{"month": "10", "state": "GA", "station": "WUWG", "content": "The guitars Pepe Romero and the Monica philharmonic orchestra conducted by Manuel clash\nJust as members supported TPP where in Eighteen station radio network you can listen online at gp beat Donald\nAmong the clash\nStitches members supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nNow is the perfect time to clean out the garage and get rid of that car you no longer need\nA little taste the coming months with a fresh start and by donating your used car to GB feel even get a tax deduction called eight seven seven GP be one car or donate securely on line at ... dot org slash cars and thank\n\nFrom the University of west Georgia Ninety point seven FM Wu WG pain to W. W.\nG. H. G. Carroll of Georgia Public broadcasting radio network\n\nMorning secretary of state Mike Pompeo hail me to the leaders of having a journalist ... diplomatic meeting Saudi Arabia is and how\nComing out how the reaction to Jamal tissue gene his parents is threatening Saudi bit that I'm Rachel Martin\nAnd I'm Steve Inskeep drug makers face the demand dispose more information\nAdministrators among them to put the list prices of their drugs and have\nAlso what happened with France received three months of rain in two\nAnd we have a story of protests during the national anthem Olympic athletes lost their medals for raising their\nOctober sixteen the singer John Mannes\nAnd the new says next\nLive from NPR News in Washington ... secretary of state Mike Pompeo was in Saudi Arabia for talks with king selmont in Riyadh\nAt issue the disappearance of Saudi journalist ... he was last seen entering the Saudi consulate in is temple two weeks ago Turkish officials say they fear could show gee was killed in later dismembered inside the consulate\nA Turkish forensics team spent time inside the building earlier today defense secretary Jim ...\nAmerica showed gee was killed in later dismembered inside the consulate a Turkish forensics team spent time inside the building earlier today defense secretary Jim Mattis says it's important to get the matter resolved\n[noise] of everything going on\nAnd far beyond our defense for life [noise]\nAnd the secretary of state park for only dealing with this issue\nMan is was speaking to reporters in Vietnam ... gee what has written extensively for the Washington Post and has been critical of Saudi Arabia's role when the war in Yemen and its arrests of women's rights advocates\nThe FBI says preliminary tests on a threatening letters sent to the home of Maine Senator Susan Collins indicate there's no threat to the public\nA note with the letter claimed the envelope containing the poison rice and relief efforts are continuing in the Florida Panhandle in the aftermath of hurricane Michael ... with member station WFSU as more\nCrossroads academy a charter school in Quincy, Florida outside Tallahassee remains closed but students and teachers are here distributing hot meals and food to the community [noise] you know people just here eating with her son and daughter she says the storm\nWas why they want to watch the wind was blowing it will take it all of a shame about home and everything\nAnd I'm watching all the trees ...\nPine everywhere crews are working around the clock but official said could be anywhere from weeks to months before cleanup efforts are complete talk with electric hopes to restore power to most queen the residents by friday but the hardest hit areas could be in the dark for two weeks or longer for NPR News I'm Shawn located in Tallahassee\nAhead of tomorrow's Brexit summit in Belgium senior officials with the European Union are expressing doubts about the prospects for a breakthrough in talks with Britain the BBC's Kevin Leahy has more from Brussels\nPay you ministers arriving here this morning went into a brief that leaders who will then decide tomorrow whether or not there is sufficient agreement to Kona special breakfast somebody's in November to finalize a devote steel Austrians foreign minister Karen can he still has said European governments are waiting in suspense of Britain's next move\nOut to talk so hold on Sunday nights because as I said you have to make a breakthrough on the issue of avoiding customs checks on the Irish vote to\nSeveral senior U.S officials have told the BBC breakthrough it this week summit is still possible that the expectation that would be the moment of truth for breakfast with no them all and\nThe BBC's ... reporting from Brussels\nBut the expectation that would be the moment of truth for breakfast with no them all\nAt the BBC's Gavin lead reporting from Brussels [laughter] this is NPR News from Washington\nIn major league baseball game three of the American league championship series shifts to Houston tonight the Astros host the Boston Red Sox with a series tied to the game of peace\nIn the national league championship series the Milwaukee Brewers lead the Los Angeles Dodgers two games to one last night Milwaukee beat the Dodgers for nothing in LA game for is tonight again in Los Angeles the winners of the championship series advance to baseball's World Series\nABC debuts its sitcom Connors tonight it's a spin off of the networks former top rated show Roseanne\nNPR's Mandalit del Barco says the cast of the ... does not include comedian Roseanne Barr\nThat network isn't giving away any spoilers about what happened to the matriarch of the con or family but just like the original Roseanne show her TV family includes actors John Goodman Sarah Gilbert and Laurie Metcalf\nEven notice how much better the flow is between the freighter in the thing\nThat ... is a re booed of a re booed at the Nineteen nineties popular sitcom Roseanne when it debuted last year bars character with back as a Trump supporter\nInmate Disney ABC quickly canceled that series and fired bar after she went on what was seen as a racist Twitter rants about former Obama White house adviser Valerie Jarrett\nThe comedian apologize for making a bad joke ABC agreed to salvage the TV family without bars character Monday late than ... NPR News\nStocks in Asia ended the day mostly higher they fell in Shanghai after China reported inflation and its economy rose for a fourth consecutive months I'm Dave ... NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the Melville charitable trust driven by one goal ending homelessness for good learn more online ad Melville trust dot org and on Twitter at Melville trust and Americans for the arts and Americans for the arts dot org\n[noise] he brings your news and information you can trust everyday join us for an in depth conversation about the challenges for news organizations to remain impartial and stay above reproach in a polarized society one a host Joshua Johnson will\nBe joined by journalist an editor for NPR and the G. P. D. newsroom for an honest conversation about\nApproach in a polarized society one a host Joshua Johnson will be joined by journalist an editor's from NPR and the G. P. B. newsroom for an honest conversation about ethics and transparency Thursday October twenty fifth and seven pm to attend reservation required GB dot org slash community for more information\nSupport for ... comes from our monthly sustain hers\nAnd Georgia State university G. P. B. Atlanta is license to Georgia State university nationally recognized as a leader and innovative programs that help students are in their degrees more information is available at G. S. U. dot edu\nTB has been honored by the Georgia Associated Press media editor is winning the top award for radio the pacemaker award we were also honored for specialized reporting best anchor and best newscast CPB news stand with the facts\nOn the next fresh air growing up with an absent mother who is addicted to heroin and raised by grandparents who gain legal custody like how could Jared J. ... about his new graphic memoir for young adults\nHave kiddo how I lost my mother found my father and dealt with family addiction it's nominated for a National Book award he also known as the lunch ladies\nSeries China\nShares this afternoon at three right here on eighty point finding the Atlanta\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin President Trump's top diplomat is managing an exceptionally delicate situation secretary\nOf state Mike Pompeo arrived today in Riyadh Saudi Arabia plus remember Saudi leaders are suspected of having a journalist murdered Jamal ... G lived in the United states and wrote for the Washington Post was last seen in Turkey\nPresident Trump responded to the disappearance by sending his top diplomat we want to find out what\nHe's got his shoes to find out what happened with the situation was\nSaudi Arabia bought President Trump is already signaled which way she may be leaning he said Saudi Arabia's king called to deny any involvement and President Trump also spread a conspiracy theory with no evidence that rogue killers might be responsible for\nThe presidential remarks may have foreshadowed a new explanation by Saudi Arabia and chairs Peter Kenyon joining Peter Kenyon rather joined us from Istanbul where ... was last seen a Peter I want to start with what is happening right now in the investigation in Turkey [noise]\nWell in Turkey there was a surge finally of the Saudi consulates some Thirteen\nYeah I Want to start with what is happening right now in the investigation in Turkey [noise] well in\nTurkey there was a search finally of the Saudi consulates some Thirteen Days after ... disappearance\nAnd this was a surge to the Turkish authorities have been talking about for several days but only last night did they get in there and they were with Saudi investigators at the same time there's they came out about nine hours later no word yet on what they found a they did reportedly collect some samples that there'll be looking at\nThis is NPR News\nPresident Trump has declared a major disaster in southwest Georgia after hurricane Michael wiped out crops we find out how George farmers are coping for years of work destroyed a mere seconds\nThat are\nGoing to be slow and tedious\nAnd\nEverybody's going to have a pitch in and help everybody up and they will\nPick up the pieces after the storm is on second thought It's MORNING at nine from ... [noise]\nNow is the perfect time to clean up the garage to get rid of that car you no longer need\nLook face the coming months with a fresh start and by donating your used Carter G Bebe you'll even get a tax deduction called eight seven seven GP be one car or donate securely on line a G. P. B. dot org slash cars and thank\nSupport for CPB comes from you our listeners\nAnd the Atlanta Opera presenting west side story Bernstein's classic Broadway musical of love trying to conquer differences November third six nine and eleven at the ... energy center tickets at Atlanta Opera dot O. R. G.\nDoes your busy life keep you from staying informed TPP has you covered you can listen live the TPP news dot org and on your smart home device follow us on Facebook and Twitter at gp be news\nClear I'm not denying climate change try explaining that President Trump you'd have to show me the scientist because they have a very big political agenda explaining the facts behind climate change is not enough to convince the night so what would it take a ...\nIt just because they have a very big boulders or gender explaining the facts behind climate change is not enough to convince tonight so what would it take a reality check on debating climate change mix on one one\nIs for one eight this morning at ten here on Haiti points I can see the effect that you can also listen live online at ... dot org\n\nSupport for NPR comes from this station and from Heather started hey gun Paul Ga Ga supporting African wildlife foundation working to ensure wildlife and wild lands thrive in modern Africa learn ... W F dot org [noise] from\nThe arc has foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at our cars foundation dot org\n[noise] from the John D and Catherine T MacArthur Foundation recognizing exceptionally creative individuals this year's MacArthur fellows and more information or at max found dot org\nAnd from the Robert Wood Johnson Foundation at our W. J. F. dot org\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin flooding in the south of France has killed at least eleven people heavy rain transformed rivers into raging torrent wiped out roads and bridges even swept people from their houses in the middle of the night Here's NPR's Eleanor Beardsley\nFlying in a helicopter over the old river in southeastern France a reporter\nFrom the F. M. T. V. points out villages Roseanne fields underwater you can see cars and trucks exploding like toys in a bass during the night\nSunday Monday three months of rain fell in only a couple hours catching people off guard when most had already gone to bed and eighty eight year old nun was sweat from her ground floor room when the floodwaters crashed through the convent front door her furniture was carried out onto a veranda\nThe nuns body was later found in the trees outside movie they sound Ninety nine year old ... with ... such a fate because her bedroom is on the second floor and she spoke on French television again just to rip up to ... I Want it to come downstairs but water was coming up the staircase so I just went back to bed\nYou said and what else could I Do I Need to have any time you have any ... says never in her life has she's seen flooding\nBut water was coming up the staircase so I just went back to bed you said and what else could I Do do you tell me how many ... says never in her life has she's seen flooding like this the French prime minister visited the devastated villages Monday President Emmanuel Macron heads down today\nAs the waters and fear recede anger is rising\nWe weren't given any warning that this group of people meeting with a local\nMayor you couldn't have maybe given us a heads up at two AM that we needed to evacuate\nBouts of heavy rain in areas of higher elevations surrounding the Mediterranean Sea our regular fall phenomenon the downpours are caused by hot moist air pushed up from the Mediterranean and meeting colder air from the north\nBut the frequency and intensity of these ranges increasing Eric ... is the mayor of habit which lost six people he says they did everything they could\nSoon be grew up with them on the upswing the rainfall was three times what it was ... he says and the sudden violence of these waters wouldn't terrifying we're dealing with the dream situations brought on by climate\nChange says ... and no one can be sufficiently prepared Eleanor Beardsley NPR News Paris [noise]\nFifty years ago at the Nineteen sixty eight Olympic Games in Mexico city track fans anticipated a special you're starting to hundred meter rich\nBut it was what happened after the race was so memorable Karen Grigsby Bates of our Code Switch team has one of our reports on Nineteen sixty eight\nNineteen sixty eight was the most to his year around the globe and Mexico City was no exception the games began in ... because a few days before the army had opened fire on thousands of students protesting in a city square\nSome reports say as many as three hundred were killed their blood was wash from the streets and the games begin soon after\nWithin a few that runner's John Carlos and Tommie Smith came to Mexico City [noise] they had a plan they were going to\nProtest racism and injustice on the world stage in an oral history for the library of Congress John Carlos said he'd met Martin Luther king just before king was killed [noise] king's vision of how effective a non violent Olympic protests could be lifted a lasting impression all more to do certain there were ...\nThat's before king was killed [noise] king's vision of how effective a non violent Olympic protests could be left a lasting impression\nI wanted to do something that would be So Paul\n... is that are\nStill in a while\nAt the games Carlos won a bronze medal for the two hundred Smith a gold setting another world record as they walked to the Olympic podium people notice both men were carrying their sneakers and wearing black Sox symbols of an impoverished black America\nAs a national anthem played in the flights began to rise Smith and Carlos belt their heads and raise their black gloved fists in the air years later talking to ABC Australia TV Australian Peter Norman the silver medalist to share the podium with Smith and Carlos recalled the moment the rise to I'm\nSymbol of the news coming together and assume most spring\nBut was able to\nExactly how it was taken by many after shocked silence the stadium filled with booze the photo of the race ... was front page on newspapers around the globe within hours as the ABC tape showed the consequences were immediate\nSmith in tiny we're going to leave the Olympic Village I'm Mexico within forty eight hours they were both stone the decision but regarding the composure\nBoth men were stripped of their medals they got hate mail and death threats they were showing for decades in the U.S for their silent gesture many black Americans thought Smith and Carlos were heroes though there are up ... became a symbol of refusal to give in to racial injustice the precursor to taking any\nSan jose State University professor Steven ... teaches African American studies now but he was an undergrad at the school in Nineteen sixty eight he vividly remembers the two runners reception when they came back to campus shortly after Mexico City\nHundreds of students there as soon as they saw Tommy John walking toward the podium and for the rest of the decade raised just indicated the unity and the determination and the real appreciation for girls\nBut there was a cost to those principles for years both men struggle to find good jobs their marriages suffered their children were bullied at school employers shied away from them Smith and Carlos were banned from Olympic artists\nTo find good jobs their marriages suffered their children were bullied at school\nEmployers shied away from them Smith and Carlos were banned from Olympic participation for life to live with that I don't have to go to ... ... talk at the Los Angeles public library in June John Carlos says he realized he lives in Olympic presence even in his absence\nThey fit to dilute showed up in art work at the games in Munich in Melbourne a huge statue of him and Smith at San jose state is a much visited tourist attraction\nEarlier this year Tommie Smith told the W. news higher authority inspired the moment\nWho was finally justified in the meetings oh by young black athletes who hope for the Olympic movement\nThat chemistry that was so misunderstood in Nineteen sixty eight is now better understood even celebrated and in two thousand eight this happened\nTo the recipient of the audacity award for courage Carlos and Tommie Smith\nVacation Karen Grigsby Bates NPR News [noise]\nTwenty sixteen crown prince Mohammed bin Solomon Saudi Arabia's affective ruler invited us and global businesses to a conference\nHe unveiled a plan called vision twenty thirty and called for a transition of the Saudi economy away from oil and toward a more diverse market based model and the crown prince invited the companies to participate\nJacob Kirkegaard of the Peterson Institute for international economics\nSays the ... G of fair is undermining the crown princes vision mainly that the world's most advanced than competitive companies come and establish themselves in Saudi Arabia that scenario is fading as the CEOs of large us and global companies one after another\nAnnounced they will not attend the second vision twenty thirty conference scheduled for next week\nJamie diamonds C. E. O. J. P. Morgan Chase has said he won't attend again\nThat can vision twenty thirty conference scheduled for next week Jamie diamond CEO of J. P. Morgan Chase has said he wanted to end again Jacob Kierkegaard\nI think the fact that as CEO as prominent as you know J. P. Morgan Jamie diamond not going to the summit and saying so publicly and linking it to the ... disappearance means that many other CEOs will probably put out\nTo other prominent Wall Street CEOs Larry fink of black rock and Steve Schwartzman of the Blackstone group also say they won't be attending\nAccording to the New York times the trio of CEOs tried but failed to get the Saudis to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven ... to stay home\nThe show gee allegations along with previous behavior of the crown prince are making companies nervous says Kirkegaard\nSays remember that back in twenty Seventeen the crown prince rounded up four hundred Saudi princes and business people detained them at the Ritz Carlton and re odd on corruption charges and force them to pay the government as much as a hundred billion dollars\nI mean basically sending the signal that the root of LOL in Saudi Arabia is amiss when you're trying to lure foreign investors into your country that is about the worst single you could possibly send them\nBut Karen ... young a resident scholar at the American Enterprise Institute\nSays U.S companies who ... the Saudis will likely pay a price because the Saudis will take it personally\nDecision on the part of the U.S corporate to walk away from this conference and to in some ways you know turn it back on the Saudi Government as a partner I Will not be forgotten by the Saudi\nYoung says it could be two decades before the Saudis will re engage with these companies young also says us sanctions against the Saudis could be tricky\nThere's lots of Saudi money in us tech real estate and stock market she says and the Saudis on lots of US government bonds not to mention the country's key role in the oil markets so the Saudis have ways to retaliate\nJohn Ydstie NPR News Washington\nThis is NPR News\nI'm Jeremy ... that after ... left his job as White House photographer\nFor President Obama he became a star on Instagram using photos of Obama to comment on the Trump Administration are correct myself when I when I was just a picture on ... on his new book shade a tale of two presidents ... here and now\nYou're hearing now today from noon until two one eighty eight point five GDP Atlanta\nSupport for G. P. B. comes from our monthly ...\nIf you're already a G. P. B. sustain or you know how great it feels to help provide fun informative and inspiring programs to make a difference in your community and beyond\nIf you're not a sustain are yet to take a few minutes right now to set up an ongoing monthly contribution at ... dot org and find out just how good it feels that G. P. B. dot org thanks so much for your support [noise]\nAnd making Chuck ... coming up with an excellent point NASCAR great Dale Earnhardt junior competed for Eighteen season along with the checkered flags he had his share of high speed crashes and in his new memoir racing to the finish my story Earnhardt opens up about concussions\nFears and why he ended his storied career he'll join us that's coming up with an excellent point from NPR News for on point this morning at eleven right here on eighty point\nFive TPP Atlanta support for TB comes from you our listeners\nAnd the George alliance lighthouse foundation committed to filling the gaps that still exist for under insured Georgians by providing access to low cost vision and hearing services as it lions Whitehouse dot org for details\nCheckout GB music on our website we feature videos at performances from touring artists and emerging musicians and you can see short documentaries about people who make Georgia music it's at gp news dot org\nThe next fresh air growing up with an absent mother who was addicted to heroin and raised by grandparents who gain legal custody adapted Jared J. ... about his new graphic memoir for young adults hate ghetto how I lost my mother found my father and dealt with family addiction it's nominated\nDo graphic memoir for young adults have kiddo how I lost my mother found my father and dealt with family addiction it's nominated for a National Book award he also does\nThe lunch ladies series China\nHarris's afternoon at three right here on eighty point nine GPA and my\n\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and resilient cities at rock found dot org\n[noise] and from F Jaycee a foundation of donor advised funds working to maximize the impact of charitable giving and to create customized philanthropic solutions learn more it F. J. C. dot org\nIt's MORNING EDITION from NPR News good morning I'm Steve Inskeep\nAnd I'm Rachel Martin it's been a year since the most destructive fire in California history the tubs fire destroyed thousands of homes in northern California now despite the risks some are rebuilding in those very same areas from member station KCUR B.D and NPR's energy environment and environment team or summer reports\nIt was late at night a year ago when Paul ... was called in to work\n[noise]\nHe's assistant fire marshal in Santa Rosa and the Thomas Fire was moving fast\nIt was exploding at a rate that I Would have never imagine would occur\nHours later he drove past his neighborhood\nYou couldn't actually make out individual homes inherited it looked like an entire wall of fire and then realized right away the\nMouse dawn lowenthal has spent the last year picking up the pieces\nAnd a crucial question came up for him and thousands of others shouldn't they rebuilt in California wildfire it's a fact of life the Thomas Fire with a repeat of a fire that burned the same area more than fifty years ago but ... says the housing market was too tight\nBut honestly it also has a lot to do with my daughter does his were we were before the fires in Missouri want to be after the\nFires [noise] now the drywall is just about to go up at his new have it appears\nNot really moving as quickly as you'd like to do but yeah you still knows we on the side\nAnd knowing what he knows about fire he's made me turn this home will be better protected with fire resistant materials\nThe roof aside and things of that nature um it was definitely a stuff but I Want it\nIt's about fire he's making sure this home will be better protected with fire resistant materials\nBetween the roof aside and things of that nature um there's definitely a stuff but I wanted to\nBut he doesn't have to take that step California building codes require fire resistant materials if you live in a designated wildfires down\nBut loaned those house wasn't technically in that zone before the fire and neither were almost two thousand other housing units and so far they're still not asked Santa Rosa's director of planning David un about that\nWe don't have a a an extra set of rules are are requirements that we put on people um to to rebuild\nGiven says legally city couldn't change of the building codes overnight and it can't stop people from rebuilding\nWe can go in and take somebody's property and that started the role of a city\nPlus the the housing shortage is even worse now\nWe need to walk and chew gum at the same time we're going to rebuild our communities fast and quickly and it's officially as we possibly can\nWe also have to build new homes as fast as we can\nHe says the city is trying to entice developers to build downtown but one big project is proposed for the hills right where the fire swept\nThrough so this is the forty acre parcel of where they want to put the two hundred and thirty seven homes the trees all around me are are black and all the way to the top\nAnd I'm standing there after turning off my recorder imam comes up to me because I'm looking at the time for the development and says I definitely wouldn't want to live there [noise]\nThey didn't want me to record that though\nIn February the city council debated this project\nTo public hearing around ... village project\nSome members light at the town home to the fire resistant and create much needed housing one council member Julie combs had doubts\nI just think we need to put more sleeping people in a fire hazard area\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin\n\nFrom the University of west Georgia mind be point seven FM W. W. W. W. G. H. G. Carroll Georgia Public broadcasting radio network\nAmong the point seven FM Wu WG and W. W. G. H. B. Gerald Ford of Georgia Public broadcasting radio network [noise]\nLive from the G. P. B. newsroom I'm Leah Fleming in person early voting begins this week for but for South Georgia counties that are reopening voter registration they're doing that for an extra day as gp Steven Fowler reports\nMore than two thirds of ... counties were under a state of emergency as hurricane Michael swept through the state\nElection offices and clay Grady Randolph and Turner counties were forced to close on October ninth that was Georgia's voter registration deadline and an executive order governor Nathan Deal says the four counties can now except registrations through Tuesday\nThere are nearly seven million active and inactive voters on the door to roles an all time record Republican secretary of state Brian Kemp is running against Democrats Stacey Abrams in a close race for governor for GB News I'm Stephen Fowler in Atlanta\nThe Georgia Supreme Court has rejected the city of stock or just request to hold the November referendum to create the city of eagles landing the creation of the new city and Henry county would de annex part parts of the city of Stockbridge the agency reports that the court ruled seven to two in favor of the state\nThe city filed the lawsuit earlier this year after governor deals signed into law a measure that would give potential residents of the new city the right to a referendum the city of Stockbridge previously sued Henry county\nWhere a judge also ruled against the city the parents of a former Georgia going at college student who they say is being held against her will in our Kelly's alleged sex called\nHave launched a hotline for the ... singers abuse victims according to Mike Mike dot com Timothy ... Savage had launched this a hotline today this is Jay ...\nLive from NPR News in Washington I'm more of a Coleman hurricane cleanup continues along the Florida Panhandle the death toll across several states remains at Seventeen people but dozens of other people are still missing and rescue teams and loved ones are continuing to search for them\nAnd the hours on the low long reports tens of thousands of homes are still without power\nUsually companies are scrambling to repair downed power lines across the region Florida governor Rick Scott has been sending extra cruise to help by clearing debris from roads officials are warning residents to avoid touching downed wires are in Florida's panhandle hundreds of families now without homes\nSpending extra cruise to help by clearing debris from roads specials are warning residents devoid touching downed wires are in Florida's panhandle hundreds of families now without homes are continuing to shelter in schools and community centers\nHundreds of National Guard members from Florida and other states are helping to lead search and rescue efforts and Bain Gulf counties to varies hit hardest by hurricane Michael ... news Destin, Florida\nSecretary of state Mike Pompeo has met with Saudi Arabian kings so man to discuss the disappearance of Saturday and journalists ... turkey believes he was killed after entering a Saudi consulate\nThe king Solomon has told President Trump he has no knowledge of ... fate however media reports suggest that Saudi Arabia is considering whether to announce that ... was killed as the result of an interrogation gone wrong\nNPR has not confirmed these reports meanwhile Google has canceled plans to attend an investment conference in Saudi Arabia as NPR's Emily Sullivan reports\nThe cancellation is the latest pressure placed on Saudi Arabia since ... a critic of Saudi policies was last seen entering the U.S consulate in Istanbul earlier this month the Turkish government alleges he was killed\nPresident Trump is threatened sanctions that the Saudi royal court is behind a show could she's disappearance the Saudis say they'd retaliate even further Google Cloud C. E. O. Diane green has an offer to reason for her cancellation the company said earlier this year it would open five innovation hubs in the kingdom\nOther prominent companies have also pulled out of that investment summit including over in shaping Morgan last year's conference generated loss of excitement about doing business in Saudi Arabia\nEmily Sullivan NPR News\nHarvard's top admissions officials will face more questions today as the trial over the school's admissions policies continues for a second day from member station W. B. you are in Boston Sherry young reports that the plaintiffs are trying to prove the school is discriminating against Asian Americans\nAttorneys with students for fair admissions that group that filed the lawsuit are expected to continue walking through the fine details of Harvard the admissions process\nThat will be reviewing officer handbook instructions and statistical analysis of application records the plaintiffs say Harvard uses an unfairly biased formula that puts Asian American applicants at a disadvantage\nCarry young reporting you're listening to NPR News\nAsian American applicants at a disadvantage\nCarry young reporting you're listening to NPR News\nA federal judge has dismissed a lawsuit against President Trump filed by adult film actress Stormy Daniels she'd claimed Trump defend her on Twitter when he claimed she was lying about being threatened over an allegation\nDaniels has alleged she had an affair with Trump an allegation Trump has denied Daniels has a separate lawsuit pending that use over a non disclosure agreement Daniels signed regarding her story of the alleged affair that lawsuit will proceed\nThe archdiocese of Washington DC has published the names of twenty eight clergyman credibly accused of sexually abusing minors as far back as the Nineteen fifties a lotta wise of member station WBUR AMU reports\nOf the twenty eight religious leaders accused and the new report some have multiple accusations of abuse more than half were convicted for their crimes and many have already died\nThe news comes just days after Pope Francis accepted the resignation of archbishop of Washington cardinal Donald Wuerl who's been accused of covering up sexual abuse scandals during his time as the bishop of Pittsburgh [noise]\nThe survivors network of those abused by priests criticized the timing of the release a group called the move a quote hastily assembled PR stunt meant to distract from worlds resignation for NPR News I'm Alone a wise in Washington\nDrawing for the mega millions lottery we'll be tonight the prize is currently valued at six hundred fifty four million dollars and your chances of winning or about one in three hundred million encore of a ... NPR News\nSupport for NPR comes from ... a meal care company that delivers semi perhaps meals to be finished at home in Fifteen minutes with one pair gobble sue ships do the ... like chopping an marinating this week's menu is at ... dot com slash NPR and Americans for the arts\n\nI think those things you are listening to MORNING EDITION on eight eight point five ... Atlanta we our land is NPR News station I'm Leah Fleming good morning thank you so much for joining us today we've got Seventy one degrees right now and are partly cloudy skies the Fort Hood the calling\nSanta we our land is NPR News station I'm Leah Fleming good morning thank you so much for joining us today we've got Seventy one degrees right now and are partly cloudy skies the had the calling for a mostly cloudy day today I don't get up to about Seventy nine degrees and then we'll be under more clouds tonight with overnight lows around sixty one\nOn people's minds in rural America just ahead we're going to bring you the results of a new poll that shows opioids and economic issues has people worried but\nMany retaining upbeat outlook about the future of their communities we're going to hear from some of those people coming up in Fifteen minutes at MORNING EDITION continues right here on gp the Atlanta\nFor TB comes from you our listeners and rooms C. D. D. and ruin the international film festival returning November first through fourth last year's festival celebrated Burt Reynolds to record audiences this year's event featured screenings master classes and parties\nMore at R. I. S. T. A. dot com and Clark Atlanta University radio presenting world renowned jazz vocalist Bobby McFerrin in his occupation of group boisterous to Atlanta one night only friday November thirtieth eight PM at Atlanta symphony home tickets to ticket master dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep let's take a walk around the Florida Panhandle which is cleaning up after hurricane Michael we will focus this morning on the Panama City area\nIn the beach communities there are some buildings or find others no longer exist and NPR's Quil Lawrence has spent days taking it all in either Quil tasty so what have you been seeing [noise]\nWell I mean\nThey're ah they're treated down everywhere these towering pine trees that are just snapped over at the middle in some of the communities along the water and they've been they've been flat and then I Know people sort of say that word or they try to describe it mostly uh people down here keep using sort of\nChildren's toys metaphors sayings like a kid swept all the houses off the monopoly board\nOr you know a kid snapped his his toy tree I I don't think people can really believe that a bit of four when could snap out so they keep on trying to reduce to some metaphor they could understand why our coast could just get picked up\nAnd moved to blocks and flipped over to the point where you can see\nThat was a house and what was a vacant lot ... um some of those communities there are people are really asking\nHow can you rebuild that's talking about like Mexico yeah yeah Mexico\nWhat was a vacant lot ... some of those communities ... there are people are really asking\nHow can you rebuild that's talking about like Mexico yeah\nYeah Mexico beach I think we've seen the overhead shots were there seems to be about one house that is intact and a couple of others that are severely damaged and everything else utterly destroyed but when you pull away from that spectacular shot do you see widespread damage up and down the coast\nThis is NPR News\nAt six Nineteen you are listening to MORNING EDITION on eight eight point by ... Atlanta I'm Leah Fleming environmental groups are hoping that the Democrats will win back the house next month\nWe had and allies leading the house of representatives they can do badly needed oversight on the Trump administration's efforts to cater to polluters\nDeathbed we're going to tell you more on what that sort of oversight might look like\nThat's coming up in Fifteen minutes at MORNING EDITION continues support for CPB comes from you our listeners behind museum of art friday jazz returns on October nineteenth between ... to Ali Ali blends African and Latin rhyme with jazz infusion into her signature sound tickets and details at ... dot org\nAnd more health health care who's pediatric and family medicine physicians nurses in staff are committed to making an impact on the overall wellbeing of newborns infants children and teens\nTo learn more and is it more health healthcare dot com\nAnd entertainment news Milan Trump spokeswoman is asking people to boycott Atlanta rapper TI because of his promotional album video that shows a woman resembling the first lady stripping and the oval office from communications director Stephanie Grisham\nTweeted saying the video is not acceptable T I tweeted on friday quote their forty five I encountered yang before sharing the video the woman in the video is wearing a jacket that reads I really don't care do you Trump wore jackets\nWith that wording on her way to visit migrant children in Texas\nPresident Trump has declared a major disaster in southwest Georgia after hurricane Michael wiped out crops we find\nOut how Georgia farmers are coping with years of work destroyed in near seconds\nThat are ... gonna they slow and tedious\nThere's a coping with years of work destroyed a mere seconds\nThat are down here it's going to be slow and tedious\nAnd\nEverybody's going to have to pitch in and help everybody up and they will [noise] making up the pieces after the storm it's on second thought this morning at nine from ... support\nFor NPR comes from this station and from PBS with the eugenics crusade American Experience explores the history of the early twentieth century campaign to breed a better American race the eugenics crusade tonight at nine eastern on PBS [noise]\nFrom west in hotels and resorts Weston is committed to the wellbeing of travelers with offerings like heavenly beds super foods are ex menu and gear lending for one workout years left behind at home Weston let's rise learned more western dot com\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more at Raymond James dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin drug addiction and the economy ... according to a new poll that is what is on the minds of rural voters as they go to the polls this election season the poll was done by NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nBut NPR's Alison Kodjak reports that even with those real challenges many rural Americans are optimistic about the future\nIf you want to picture of the troubles that face some rural communities even called Brenda a self described homemaker from the heart of Appalachia to fifty seven and married to a former coal miner\nBag that bring to black lung and having a real hard time glory without going into combat anyway\nAnd drug addiction has hit her family especially her two grandsons hard\nMy daughter and her head and I'm ... and ... because they couldn't give up his truck\nHe's still alive but some of her other relatives aren't including her niece\nThat found her and her home a lie [noise] timber\n[noise]\nShe was thirty three years old is she left behind only boys\nNPR is not using her last name to shield her grandchildren lived in Coburn Virginia\nThe she left behind during boys\nBrenda NPR has not using her last name to shield her grandchildren losing Coburn Virginia a town of about two thousand people near the point where Virginia meets Kentucky and Tennessee her experience fits into the findings are new poll which shows that in rural America drug abuse ranks with the economic outlook as residents top worry\nAlmost half of rural Americans have been personally affected by the opioid crisis on react if they personally know someone who struggled with addiction forty nine percent said yes Brenda says it's worse in her community\nIf an hour to approach can family or randomly and give them a piece of paper and have you have someone in your immediate family on the road I out of town would say yeah\nBrenda says in Coburn jobs and opportunities have dried up state officials have been promising to bring an economic development but none of it has reached her community yet\nIf he'll come out of college with a degree uh you're more than likely going to leave this area on work\nBut experiences in rural America very widely in our poll bears that out the survey of Thirteen hundred adults all living in rural areas that many people are optimistic about the future of their communities most of the people we surveyed say they're better off financially than their parents and a majority think their children will do better still\nRobert Blendon professor of health policy and political analysis at the Harvard th Chan School directed our poll\nThey're optimistic about about the future and they're also optimistic that things can be done the pulled them out of these economic problems they face\nWhile some rural communities are suffering others are thriving says Christopher thorn burn the founder of beacon economics and Los Angeles\nWho might have a cold town and an oil town well the calls on his doing terrible because coal can't compete in this era of cheap natural gas\nOn the other hand because of fracking these rural community sitting on oil are booming and incomes are up dramatically as a result of all that new money flowing into the region for oil exploration and drilling\nThe economy and grenade in Mississippi a city of fourteen thousand about halfway between Jackson and Memphis, Tennessee is doing well says that killed Powell alone job overtone that was the twenty four year old truck driver who grew up in Grenada he says the town has a drug problem but it's a kind of me is growing it's almost like\nHello I'm overtone to twenty four year old truck driver who grew up in Grenada he says the town has a drug problem but it's a kind of me is growing\nIt's almost like a turban on this starting to expand fall and bigger restaurants from Vancouver now within the last two years we really do\nAnd Brenda says she's seen flickers of hoping Coburn accounts high school has a new football coach and the community has come together to support the players\nYou know one of the inflatable how much that the kids around three way bottom one of them it was twenty six hundred dollars or ... or ... or white wearing all in one year there's good people hard working people\nEven though sometimes things still looks bleak Brenda says her view of her community is getting better Alison Kodjak NPR News\nEl\n... the Milwaukee Brewers hold two games to one lead over the Los Angeles Dodgers and baseball's National League championship series if the brewers should win the series fend Dodgers fans will insist on the if if they win the brewers would reach the world series for the first time since Nineteen eighty two one man is celebrating already\nThat is the voice of Bob ... one of baseball's great voices and he happens to be a long suffering brewers fan euchre has been calling gains for Milwaukee since Nineteen Seventy one he was a player to do is playing career started dairy and sixty too\nLong ago ... started an ad were an usher removes him from his good seat at a ballgame must be on the front row euchre says only to be taken back to the cheapest of cheap seats high up up up that self deprecating style fit a catcher who had trouble\nCatching he wants to explain to Johnny Carson his technique for handling the knuckleball\nEasiest way to catch it\nWas to wait until it stopped rolling and just pick it up [laughter]\nAnd like he earned him a role as a play by play announcer in the film major league in his famous line of the movie he said this to the radio audience about a wild pitch that misses the ... zone by about a city block\nThe sun\nThis season though he's been enjoying real brewers success\nVideo of him in the locker room after one of the teams biggest wins the players crowd around him this man in his eighties dumping beer on his head of course here is reacting to eat\nAfter one of the teams biggest wins the players crowd around him this man in his eighties dumping beer on his head to court Sherrie is reacting tweet Fox Sports Wisconsin prior\nTo more than any why what may seem\nWell they're all they're all we know why isn't here and I mean to be treated like one on one of them all the time I think that special for me\nRemember there is no I ... [laughter]\n... Milwaukee Brewers face off against the Dodgers once again tonight in Los Angeles\nHistory three million people at risk for extreme heat heat index to Hurricane Florence already making his presence along the Carolina coast\nNo none of us has pushed the environment over issues like health care or immigration and the minds of most voters but it does make for easy messaging in states where the effects of climate change are already being felt cue B roll of raging wildfires\nEven getting hotter wildfire and smoke or air in her ... her is radically opposed to efforts to fight climate change global warming is a flawed\nAds like this have been appearing throughout California Florida and in swing districts across the country targeting Republican lawmakers it's part of a multimillion dollar effort by the league of conservation voters to flip the house Democrats cured and sit in failed is a vice president what the conservation group if\nWe had in mind our allies leading the house of representatives they could do badly needed oversight on the minister Asians average to cater to the leaders everyday over our communities\nThat word oversight is one you hear a lot from Democrats in part because there's not a whole lot else they can do\nYou know to ... leaders every day over our communities that word oversight is one you hear a lot from Democrats in part because there's not a whole lot else they can do most of the role backs and environmental policy are happening in the executive branch under Trump appointees a shift in house leadership won't change that\nDemocrats can't force interior secretary Ryan Zinke you to restore Bears Ears national monument for example door to crack down on methane emissions but they can force him to explain himself\nArizona congressman role ... is the ranking Democrat on the house natural resources committee\nI Want to change the narrative of this whole thing where the Resources Committee is not just the past is part of the Trump Administration that they're independent and that they have responsibility as co equals for oversight accountability\nTranslation expect hearings lots of them if Democrats retake the house Tom pile heads the American energy alliance which supports Trump's agenda he says a Democratic majority in the house would be a setback for the administration\nAnd they would be able to tie them up mercilessly show that they would be able to slow walk a lot of the good work that's being done with respect to these issues\nDemocrats already have a working list here's Colorado congresswoman Diane and to get the ranking Democrat on the oversight committee for energy and commerce\nI think you will see a investigations in hearings around the methane rural and clean power plant and they paint car rules you're going to the scene look more in gaps\nConflicts of interest in corruption at the EPA\nAnd the list goes on to get says this year's midterms reminder of what happened in two thousand six when Democrats took back the house under President George W. Bush for the following two years Democrats called hearings and investigations and crafted legislation that they knew would not passed under Republican president\nBut then when President Obama was elected in two thousand eight we were able to roll back legislative agenda because then spent the last two years developing it\nOf course Republicans could keep their majority in Congress which would mean continued support for the administration's deregulatory agenda Nathan Rott NPR News\nAnd later today on all things considered the outcome of the mid term elections could also have a major effect on the future of U.S policy and listen to that story by asking your smart speaker to play NPR or your local member station by name\nYour local member station by name is eighty eight point five\nTo play NPR or your local member station by name\nYour local member station by name is eighty eight point five G. P. B. Atlanta it is where you're listening to MORNING EDITION at six forty three I'm Leah Fleming\nIf you are a betting kind of person that you probably already know this but the mega millions and Powerball jackpots both grew over the weekend and the combined total is now nearly a billion dollars if the nine hundred\nNinety nine million tonight mega millions jackpot it's up to six hundred fifty for a million that is the second largest jackpot in the game's history and the fourth largest in us history tomatoes Powerball jackpot is up to three hundred and forty five million dollars\nAnd that jackpot has grown since August fifteenth and has rolled Eighteen times so\nSomebody needs to win that money we're gonna talk business news on the marketplace morning report that's coming up in ten minutes right here on eight point five\nSupport for ... comes from you our listeners and the Atlanta Opera presenting west side story Bernstein's classic Broadway musical of love trying to conquer differences November third six nine and eleven at the Cobb energy center tickets at Atlanta Opera dot O. R. G.\nOf the blue and historic downtown Blue Ridge for an extensive selection of specialty wines craft\nBeers and wide selection of cheeses from the world over information that out of the deep blue dot com\nI'm an ex political rewind the attacks are getting sharp ... Jews of encouraging undocumented residents demoted illegally\nWhy impairment charged with a sinister effort to suppress democratic low intensity you the campaign is growing as election day approaches joy managers these Jim Galloway our panel and me today after\n\nAfter a much anticipated wait the great American read will finally reveal America's Best ... book with millions of votes admitted in passionate\nFans around the U.S an episode will premier on Tuesday October twenty third joined GB being making at the museum of art and science is for the life event with prizes trivia and the great American ... swag finale is best seen live with your fellow book\nWe've on snap benefits change that or take all hands on deck to address that she says churches private businesses and others are picking up for government\nIs leaving all\nThere is along the line up by the local\nOf family in children's services office down\nOr stayed up of people like Johnny Gordon her trying to get emergency snap benefits and says he has no power and there's no more chance food we found for him and his wife and their two kids so he's gotta cook which is tricky with no electricity\nThe channels and says to stamp only allow huge so much meat are so much fresh food every month the trick in good\nIs making that stretch\nThere are places scattered around the area what people would ask the car can line up food for April the lives of the national guard is directing traffic and parking lot along closed grocery store or cars are lined up into the road\nHanded out about two thousand New York last under casual Wilson is in her car with her kids waiting to get into that parking lot she's feeling that's\nI have been out of power these days I have a child with diabetes medical problem they you know the disaster\nShe'd been without food that long to\nMatch me hard you know we know which may buy come to a CD like the\nCity officials say it could be another five days before the power's back on and people in Albany can begin to restock their refrigerators that they're able to afford the food\nIn New York I'm David Brancaccio with the marketplace morning\nAmerican public media\nFrom the University of west Georgia Ninety point seven FM Wu WG paying to W. W. G. H. B. Carol that part of Georgia Public broadcasting radio network\nLine from the G the newsroom\nW W E a G H Gerald from Georgia Public broadcasting radio network\nLive from the gp newsroom I'm Leah Fleming last night the city of Atlanta agreed to a one point two million dollar settlement with a former Atlanta fire chief who was fired\nAfter he wrote a book that compared homosexuality to ... ... Taylor ... reports the council approved the payout to Kelvin Cochran with a vote of eleven to three\nEmployees Thirteen while serving as fire chief Cochran wrote and distributed or religious book which called homosexuality vulgar and the perversion he was then suspended and fired in twenty Fifteen Cochran filed a federal civil rights lawsuit against the city claiming he was terminated because of his faith\nFormer mayor cars seem read said Cochrane was fired because he didn't get permission to author the book and for promoting it at work\nLast year a federal judge ruled that the firing was not a free speech violation but that the city's rule on getting permission for non work expression like writing a book was unconstitutional\nFor the news on to their games\nThe Georgia Supreme Court has rejected the city of stock bridges request to hold a November referendum to create the city of eagles landing the creation of the new city and Henry county with the annex parts of the city of Stockbridge\nThe agency reports the cool the court ruled seven to two in favor of the state the city filed the lawsuit earlier this year after governor deal signed into law a measure that would give potential residents of the new city the right to a referendum the city of Stockbridge previously sued Henry county where a judge also ruled against the city [noise]\nThe Atlanta Braves and manager brand snicker have agreed to a two year contract extension the deal includes a team option for third year in twenty Twenty one snicker took over the team in two thousand sixteen after friday ... was fired mid season this is the PBA Atlanta\nLive from NPR News in Washington encore of a Coleman authorities in the U.S south east to say at least Seventeen people have been killed because of hurricane Michael but dozens of others still remain missing there are areas where there's no cell phone service especially in the Florida Panhandle that's where the storm made landfall so people cannot check on their loved ones\nNPR's Quil Lawrence is in the Florida Panhandle\nEighteen shelters in Florida alone and hundreds of people are still living in those others are having to start finding contractors or get insurance claims filed or trying to get help from from FEMA trying to get their roofs covered up with ... so that if it rains it will cause more\nAnd contractors or get insurance claims filed or trying to get out from from FEMA trying to get their roofs covered up with ... so that if it rains it will cause more damage than what already happened in the storm\nNPR's Quil Lawrence secretary of state Mike Pompeo has met with Saudi Arabian king Sal men in Riyadh they're discussing the fate of Saudi journalist ... ... she feared murdered news reports suggest the Saudi Government is considering saying he died in an interrogation gone wrong\nNPR has not confirmed these reports rural Americans are as concerned about drug addiction as they are about the economy NPR's Alison Kodjak reports on a new poll from NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health the\nPoll shows that about a quarter of the people living in rural areas said drug addiction or abuse is the biggest problem facing their communities [laughter] that's about the same share that side of the economy is their biggest worry\nThose two categories overwhelmed all the other responses in the survey of Thirteen hundred people who live in rural areas but even with those worries people say they have a positive outlook about their future Robert Blendon is the professor at Harvard's chance school who directed the pole\nIn terms of the future at least half of people are quite optimistic\nMost of the people who responded to the survey said they are doing better than their parents and the majority said they expect their kids to do even better Alison Kodjak NPR News\nA federal judge has dismissed a lawsuit against President Trump from adult film actress Stormy Daniels she claimed the president had deep fainter earlier this year on Twitter NPR's Jessica Taylor has more\nGain sued over a tweet Trump sent in April thing Daniels was lying about being threatened in twenty eleven not to go public with their story of an alleged sexual encounter with Trump but in his ruling the federal judge wrote that the tweet quote constitutes rhetorical hyperbole\nNormally associated with politics than public discourse in the United states but it's protected by the first amendment\nIn a statement and Trump's attorney called this a total victory for the president [noise]\nDaniels' lawyer Michael ... they would appeal the ruling and other legal action over a nondisclosure agreement Daniels signed would proceed Trump has denied any sexual encounter with Daniels but did finally admit to reimbursing his lawyer for a hundred and thirty thousand dollar payment to Daniel's on the eve of the twenty sixteen election\nJessica Taylor NPR News Washington\nYou're listening to NPR News\nThe co founder of Microsoft Paul Allen has died his company Vulcan ...\nWashington You're listening to NPR News\nThe co founder of Microsoft Paul Allen has died his company Vulcan Inc says he died Monday in Seattle of non Hodgkin's lymphoma he was sixty five\nAlan was also a philanthropist tech investor and the owner of several sports teams north and South Korea have agreed to disarm some of the troops facing each other across their common border and here's Anthony Kuhn reports from Beijing today's deal came at a meeting following last month summit between the two countries leaders it's one of the last\nHot spots of the Cold War inside the militarized zone or DMZ between the two Koreas is a joint security area or J. essay where the U.S South Korean and North Korean troops have faced each other since an armistice ended the fighting in Nineteen fifty free\nRight now soldiers and removing landmines from the J I say when that's done no firearms will be allowed in the area\nToday's talks were held among colonel level officers of the two Korean armies and the United nations command which oversees all activity inside the DMZ\nThe two sides will remove guard posts and reduce forces to thirty soldiers and five officers each Anthony Kuhn NPR News Beijing\nDiplomats from the European Union and the United kingdom will hold a meeting tomorrow in Belgium on the future of the u._k. exit from the European Union notice Brexit\nExpectations are low for a deal and there's concern the cable crash out of the European Union next march with no agreement in place the big sticking point is over whether to have a hard border between the u._k. and Ireland which will stay part of the European Union\nOn corporate Coleman NPR News in Washington\nSupport for NPR comes from the alliance for a lifetime income a nonprofit composed the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nSeven six you are listening to MORNING EDITION on a point five ... Atlanta where Atlanta is NPR News station I'm Leah phlegm and good morning\nWe've got Seventy one degrees right now the forecast is calling for a mostly cloudy day today high is going to get up to about eighty by later on this afternoon and then we'll be under clouds again for tonight there's also the chance for some showers overnight lows will sit around sixty one degrees [noise]\nBefore Colin Kaepernick took a knee there were Tommie Smith and John Carlos in the Nineteen sixty eight Mexico\nWe'll sit around sixty one degrees [noise]\nBefore Colin Kaepernick took a knee there were Tommie Smith\nAnd John Carlos in the Nineteen sixty eight Mexico City Olympics they won the gold and bronze medals for the two hundred meter race and\nThen in a move that still resonates today they raised their fists in the black power salute on the podium coming up we're going to remember that moment in history that's in Fifteen minutes at MORNING EDITION continues right here on eighty point five\nPort for ... comes from you our listeners and publics delivery powered by ... public believes the between work and to do list time as valuable\nPublic seems to help people regain time by delivering groceries to customers stores more public dot com slash delivery and Georgia State university Keith ... is license to Georgia State university a major contributors to the economic and cultural vitality in downtown Atlanta metro Atlanta area more information is available at G. S. U. dot edu\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin when journalists them all to show gee went missing two weeks ago Saudi Arabia said it knew nothing about it even though his show gee was last seen walking into the Saudi consulate in Turkey\nTurkish officials are accusing Saudi Arabia of murdering the journalist who was a vocal critic of the Saudi regime\nNow there are several reports suggesting that Saudi Arabia's leaders may have known more than they let on meanwhile President Trump dispatch secretary of state Mike Pompeo to Riyadh where he is meeting today with king selmont and with crown prince Mohammed bin some on\nNPR's Michele Kelemen is on that trip traveling with the secretary and joins us now from Riyadh and I will just do what we do have a delay on her line Michelle can you just start by explaining what the Saudis believe happened to ... to show you what are they saying [noise]\nWell you know officially they've um haven't gone they haven't said anything different when what they've said all along you're hearing sources privately I'm floating some other ideas that he was um [noise]\nUh interrogated and it was interrogation gone wrong there are lots of different versions of events out there um but what the U.S officials who are traveling with ... saying is look we haven't heard this from um them directly we're waiting for these meetings we won\nBut what the U.S officials who are traveling with ... saying is look we haven't heard this from um them directly we're waiting for these meetings we want to hear what they say face to face and that's what I'm secretary Palmdale is doing here they did they've been very tight lipped about what they think about\nThis is NPR News I'm clear I'm not denying climate change try explaining that President Trump\nYou'd have to show me the scientist because they have a very big political agenda explaining the facts behind climate change is not enough to convince tonight so what would it take a reality check on debating climate change next time on one\nYou can hear that on one at a at ten o'clock this morning right here on eight eight point five G. P. B. Atlanta it is where you're listening to MORNING EDITION at seven Nineteen I'm Leah Fleming good morning\nTV drug ads be forced to include a price of President Trump's team says yes we are going to bring you details on that coming up in Fifteen minutes [noise]\nSupport for TB comes from you our listeners and meals for kids providing delivered meals focused on the child's nutritional needs and picky tapes with experience working with private and public organizations of all sizes\nSupporting kids freedom to eat right information at meals for kids dot com and Clark Atlanta University radio presenting world renowned jazz vocalist Bobby McFerrin in his ... group boisterous to Atlanta one night only friday November thirtieth eight PM at Atlanta symphony hall tickets a ticket master dot com [noise]\n\nPresident Trump has declared a major disaster in southwest Georgia after hurricane Michael wiped out crops we find\nOut how Georgia farmers are coping with years of work destroyed in near second\nBatter blond hair and they play when Katie\nAnd\nEverybody's going to have the kitchen and help everybody up and they will [noise] taking up the pieces after this\nAnd\nEverybody's going to have a kitchen and help everybody up and they will [noise]\nMaking up the pieces after the storm it's on second thought this morning at nine from ...\nSupport for NPR comes from this station and from fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more it fidelity dot com slash wealth fidelity brokerage services so I'll see\nFrom the Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security health care and science and technology leadership brown dot edu slash NPR\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with emails time puts a drag and drop email editor and twenty four seven customer service Morris campaign monitor dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin flooding in the south of France has killed at least eleven people heavy rain transformed rivers into raging torrent wiped out roads and bridges even swept people from their houses in the middle of the night Here's NPR's Eleanor Beardsley\nIn a helicopter over the O D river in southeastern France a reporter\nFrom the F MTV points out villages Rosetta feels underwater you can see cars and trucks floating like toys and bass during the night\nSunday and Monday three months of rain fell in only a couple hours catching people off guard when most had already gone to bed and eighty eight year old nun was sweat from our ground floor room when the floodwaters crashed through the convent front door her furniture was carried out onto a veranda\nThe nuns body was later found in the trees outside reduced sound Ninety nine year old ... such a faith because her bedroom is on the second lord she spoke on French television again just to younger but but it was really one did um actually I wanted to come downstairs but water was coming up the staircase so I just went back to bed\nYou said what else could I Do I Need to have any time you have any ... says never in her life she's seen flooding like this\nThe French prime minister visited the devastated villages Monday President Emmanuel Macron heads down today as the waters and feet\nLike this the French prime minister visited the devastated villages Monday President Emmanuel Macron heads down today as the waters and fear recede anger is rising that doesn't\nWe weren't given any warning that this group of people meeting with a local\nMayor you couldn't have maybe given us a heads up at two AM that we needed to evacuate\nBouts of heavy rain in areas of higher elevations surrounding the Mediterranean Sea our regular fall phenomenon the downpours are caused by hot moist air pushed up from the Mediterranean and meeting colder air from the north\nBut the frequency and intensity of these ranges increasing Eric ... the mayor of habit which left six people he says they did everything they could\nSue them because I was going on up to the rainfall was three times what it was ... he says and the sudden violence of these waters was terrifying we're dealing with the dream situations brought on by climate\nChange says ... and no one can be sufficiently prepared Eleanor Beardsley NPR News Paris [noise]\nFifty years ago at the Nineteen sixty eight Olympic Games in Mexico city track fans anticipated a special you're starting to hundred meter rich\nBut it was what happened after the race was so memorable Karen Grigsby Bates of our Code Switch team has one of our reports on Nineteen sixty eight\nNineteen sixty eight was a tumultuous year around the globe and Mexico City was no exception the games began in ... because a few days before the army had opened fire on thousands of students protesting in a city square\nThem reports say as many as three hundred were killed their blood was wash from the streets and the games begin soon after\nIt was the atmosphere that runner's John Carlos and Tommie Smith came to Mexico City [noise] they had a plan they were going to\nProtest racism and injustice on the world stage in an oral history for the library of Congress John Carlos said he'd met Martin Luther king just before king was killed [noise] king's vision of how effective a non violent Olympic protests could be lifted a lasting impression\nI wanted to do something that would be So Paul\n... is that are still in ...\nAt the games Carlos won a bronze medal for the two hundred Smith ...\n... is that are still in a while\nAt the games Carlos won a bronze medal for the two hundred Smith a gold setting another world record as they walk to the Olympic podium people notice both of them were carrying their sneakers and wearing black Sox symbols of an impoverished black America\nAs a national anthem played in the flights began to rise Smith and Carlos bell their heads and raise their black gloved fists in the air years later talking to ABC Australia TV Australian Peter Norman the silver medalist to share the podium with Smith and Carlos recalled the moment rise the um\nNew things coming together in a spring\nEver on on believe it was it does\nExactly how it was taken by many aftershocks silence the stadium filled with booze the photo of the race ... was front page on newspapers around the globe within hours as the ABC tape showed the consequences or immediate\nSmith in tiny we're going to leave the Olympic Village I'm Mexico within forty eight hours they were both shown the decision but regarding the composure\nBoth men were stripped of their mental they got hate mail and death threats they were showing for decades in the U. S. for their silent gesture many black Americans thought Smith and Carlos were heroes though they are up ... became a symbol of refusal to give in to racial injustice the precursor to taking any\nSan jose State University professor Steven ... teaches African American studies now but he was an undergrad at the school in Nineteen sixty eight he vividly remembers the two runners reception when they came back to campus shortly after Mexico City\nHundreds of students there as soon as they saw Tommy John walking toward the podium and for the rest of the decade grave shift indicated the unity and the determination and the real appreciation for the call [noise]\nBut there was a cost to those principles for years both men struggled to find good jobs their marriages suffered their children were bullied at school employers shied away from them Smith and Carlos were banned from Olympic participation for life\nThat I don't want to go to ...\nI had to talk of the Los Angeles public library in June John Carlos says he realized he was an Olympic presence\nI live with that I don't want to go to the liver gathered at a talk at\nThe Los Angeles public library in June John Carlos says he realized he was an Olympic presence even in his absence fisted salute showed up in art work at the games in Munich in Melbourne a huge statue of him and Smith at San jose state is a much visited tourist attraction\nEarlier this year Tommie Smith told the W. news higher authority inspired the moment\nWho was finally justified in the ... of a young black athletes who were hopeful for the Olympic movement\nThe gesture that was so misunderstood in Nineteen sixty eight is now better understood even celebrated and in two thousand eight this happened\nTo the recipient of the audacity towards the courage and Tommie Smith\nVindication Karen Grigsby Bates NPR News [noise]\nAnd twenty sixteen crown prince Mohammed bin Solomon Saudi Arabia's affective ruler invited us and global businesses to a conference\nHe unveiled a plan called vision twenty thirty and called for a transition of the Saudi economy away from oil and toward a more diverse market based model and the crown prince invited the companies to participate\nJacob Kirkegaard of the Peterson Institute for international economics says the ... G A fair is undermining the crown princes vision\nNamely that the world's most advanced than competitive companies come and establish themselves in Saudi Arabia\nThat scenario is fading as the CEOs of large us and global companies one after another announced they will not attend the second vision twenty thirty conference scheduled for next week Jamie diamond C. E. O. J. P. Morgan Chase has said he wanted to end again Jacob Kirkegaard\nI think the fact that as CEO as prominent as gp Morgan's Jamie diamond not going to the summit and saying so publicly and linking it too\nThe fact that as CEO as prominent as you know J. P. Morgan Jamie diamond not going to the summit and saying so publicly and linking it to the ... disappearance\nMeans that many other CEOs will probably put out to other prominent Wall Street's CEOs Larry fink of black rock and Steve Schwartzman of the Blackstone group also say they won't be attending\nAccording to the New York times the trio of CEOs tried but failed to get the Saudis to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven mission to stay home [noise]\nThe ... the allegations along with previous behavior of the crown prince are making companies nervous says Kirkegaard\nHe says remember that back in twenty Seventeen the crown prince rounded up four hundred Saudi princes and business people detained them at the Ritz Carlton in Riyadh on corruption charges and force them to pay the government as much as a hundred billion dollars\nI mean he basically sending the signal that the root of LOL in Saudi Arabia is amiss when you're trying to lure foreign investors into your country that is about the worst single you could possibly send\nThem but Karen ... young a resident scholar at the American Enterprise Institute says U.S companies whose snow but the Saudis will likely pay a price because the Saudis will take it personally\nDecision on the part of the U.S corporate to walk away from this conference and to in some ways you know turn it back on the Saudi Government as a partner will not be forgotten by the Saudi\nYoung says it could be two decades before the Saudis will re engage with these companies\nYoung also says us sanctions against the Saudis could be tricky [noise] there's lots of Saudi money and us tech real estate and stock market she says and the Saudis on lots of US government bonds not to mention the country's key role in the oil markets so the Saudis have ways to retaliate\nJohn Ydstie NPR News Washington [noise]\nYou are listening to MORNING EDITION on idiot going fine G. P. B. S. lamp that it is now seven forty three I'm Leah Fleming coming up later today at the man Booker Prize for fiction is going to be announced the uprising to promote the finest in fiction\nThree I'm Leah Fleming coming up later today uh the man Booker Prize for fiction is going to be announced the prize aims to promote the finest in fiction by awarding the author the title best novel of the year that they had were going to hear from an author who made the short list\nSupport for CPB comes from you our listeners and the our wean hot air balloon festival friday or Tobar nineteenth and Saturday October twentieth featuring balloon rides five stages costume contests\nTrick or treating and more for information visit our olean dot com and Carter's bill tourism inviting music lovers to the Carter's bill bluegrass and folk festival October twentieth and downtown Carter's failed to stages local foods craft beers in a safe kids zone for creative play more visit Carter's bill dot org\n... candidates Stacey Abrams and Brian Kemp have agreed to participate in two televised debate before election day\nAbrams them camp will participate in the debate hosted by us Georgia Public broadcasting on October twenty third it'll be bought cat state wide and do you have to be TV will host a debate between the candidates which will include the libertarian candidate Ted met that's going to happen in November fourth and Atlanta it'll be live on TV and streamlined as well\nAn ex political rewind the attacks are getting sharp Stacey Abrams is accused of encouraging undocumented residents demoted illegally\nRyan and charged with a sinister effort to suppress democratic vote in the intensity of the campaign is growing as election day approaches joined media jerseys Jim Galloway our panel and me today to\n[noise]\nShe brings your news and information you can trust everyday join us for an in depth conversation about the challenges for news organizations to remain impartial and stay above reproach in a polarized society on a host Joshua Johnson will be\nJoined by journalist an editor's from NPR and the G. P. D. newsroom for an honest conversation about ethics in transparency\nThursday October twenty seven pm to attend reservation required\nGB dot org slash community for more information\nTransparency Thursday October twenty fifth and seven pm to attend reservation required TBB dot org slash community for more information\n\nSupport for NPR comes from this station and from logged me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com\n[noise] from indeed used by over three million businesses for hiring where employers can post jobs and do you screener questions to build their short list of preferred candidates learn more it indeed\nDot com slash higher and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm Steve Inskeep and I'm Rachel Martin it's been a year since the most destructive fire in California history the tubs fire destroyed thousands of homes in northern California\nNow despite the risks some are rebuilding in those very same areas from member station KCUR weedy and NPR's energy and environment\nTeam Lauren Sommer reports it was late at night a year ago when ... was called in to work\n[noise]\nHe's assistant fire marshal in Santa Rosa and the Thomas Fire was moving fast\nIt was exploding at a rate that I would've never imagine would occur\nHours later he drove past his neighborhood you\nCouldn't actually make out individual homes inherited it looked like an entire wall of fire and then realized right away the\nMile dawn ... has spent the last year picking up the pieces\nAnd a crucial question came up for him and thousands of others should they rebuilt and California wildfire is a fact of life the Thomas Fire was a repeat of fire that burned the same area more than fifty years ago but ... says the housing market was too tight\nBut honestly it also had a lot to do with my daughter does his were we were before the fires and the sort of want to be after the fires\n[noise] now the dry wall is just about to go up and if you have it appears\nIt's not really moving as quickly as you'd like it too but yeah you do know that the un's inside\nAnd knowing what he knows about fire he's making sure this home will be better protected with fire resistant materials\nBetween the roof aside and things of that nature um it was definitely a a stuff that I wanted to\nBut he doesn't have to take that step California building codes require fire resistant materials if you live in a designated wildfires zone\nBut he doesn't have to take that step California building codes require fire resistant materials if you live in a designated wildfires down\nBut loaned those house wasn't technically in that zone before the fire and neither were almost two thousand other housing units and so far they're still not asked Santa Rosa director of planning David un about that\nWe don't have a an extra set of rules are are requirements that we put on people um to to rebuild\nGiven says legally city couldn't change of the building codes overnight and it can't stop people from rebuilding\nWe can go in and take somebody's property and that started the role of a city\nPlus the seats housing shortage is even worse now\nWe need to walk and chew gum at the same time we're going to rebuild our communities and quickly in the fisheries we possibly can but we also have to build new homes as best we can\nHe says the city is trying to entice developers to build downtown but one big project is proposed for the hills right where the fire swept\nThrough so this is the forty acre parcel of where they want to put the two hundred and thirty seven homes the trees all around me are are black and almost all the way to the top and I'm standing there after turning off my recorder a man comes up to me because I'm looking at the time for the development and said [noise] I definitely wouldn't want to live there\nThey didn't want me to record that though\nIn February the city council debated this project\nTo carrying around burden village project\nSome members light at the town home to the fire resistant and create much needed housing one council member Julie combs had doubts\nI just think we need to not put more sleeping people in a fire hazard area\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin\nFrom the University of west Georgia mind be point seven FM W. W. W. W. A. G. H. Gerald Ford of Georgia Public broadcasting radio network [noise]\n\nLive from the G. P. B. newsroom I'm Leah Fleming last night the city of Atlanta agree to a one point two million dollar settlement with a former Atlanta fire chief who was fired after he wrote a book that compared homosexuality to base geology and she'd be tailored ... reports that council approved the payout to Kelvin Cochran with a vote of eleven to three\nEmployees Thirteen while serving as fire chief Cochran wrote and distributed or religious book which called homosexuality vulgar and the perversion he was then suspended and fired in twenty Fifteen Cochran filed a federal civil rights lawsuit against the city claiming he was terminated because of his fate\nFormer mayor casino read said Cochrane was fired because he didn't get permission to author the book and for promoting it at work\nLast year a federal judge ruled that the firing was not a free speech violation but that the city's rule I'm getting permission for non work expression like writing a book was unconstitutional for jury duty news onto the dance\nGeorgia's highest court has declined to stump voting in a referendum on whether a new city of eagles landing should be created from part of the existing city of an existing city of Stockbridge and this was an Henry county the proposed cities creation\nMust be approved by local voters next month opponents including the Stockbridge mayor say creating a new city would take a significant amount of land in tax revenue away from Stockbridge\nBut supporters of a new city say they want to secure a better city services and increase property values\nStockbridge has predominantly black while the city of eagles landing would have a higher proportion of white residents gubernatorial candidates Stacey Abrams and Brian Kemp I've agreed to participate in two televised debates before election day one will be a gp band that's October twenty third it will be broadcast statewide said or one\nFrom NPR News in Washington I'm cordless Coleman rescuers in Florida continue to search for dozens of missing people from hurricane Michael cell phone service is down in large areas and people are still trying to reach missing loved ones the storm killed at least Seventeen people\nSecretary of state Mike Pompeo has met Saudi Arabian king ... to discuss missing setting journalist ... who's feared\nSecretary of state Mike Pompeo has met Saudi Arabian king cement in Riyadh to discuss missing Saudi journalist ... who's feared dead\nThe Saudi king has denied knowledge of his faint turkey alleges ... was murdered when he went into a Saturday consulate in Houston Bowl and never came out NPR's Peter Kenyon says Turkish and Saturday investigators have now searched the consulate looking for evidence\nTurkish officials say the nine hours surge involved the collection of samples which will be examined further the consulate was searched with the Saudis permission and with Saudi investigators in attendance turkey says it also wants to search the consul general's residence and possibly diplomatic vehicles as well the Saudis denied any wrongdoing\nNPR's Peter Kenyon there are media reports suggesting the Saudi Government is considering saying ... died in an interrogation gone wrong NPR has not confirmed these reports\nThe Trump Administration is planning to require drug companies to include the retail price of their medications in television or other consumer ads NPR's Alison Kodjak has more\nHealth and Human Services secretary Alex ... says he'll require drug makers to include retail prices MTV advertisements for prescription drugs\nPatients deserve to know what a ... could cost when they're being told about the benefits and risks it may have\nUnder the proposed rules companies will have to disclose the monthly list price of any medication that costs more than thirty five dollars\nThe pharmaceutical industry is already taking steps to preempt the administration's actions\nThe industry group farmer says it's member companies have agreed to include in their ads information about where consumers can look up of medications price but that plan fall short of actually disclosing retail prices Alison Kodjak NPR News Washington\nHarvard's top admissions official will face more questions today as the federal trial over the university's admissions policies moves into a second day from member station W. B. you are in Boston carry young reports Harvard is accused of discriminating against Asian American applicants\nTheme Williams at Simmons is the plaintiffs first witness in the trial attorneys with students for fair admissions their group that filed the lawsuit spent most of Monday asking him questions about the schools recruitment tactics\nThat plaintiffs will questioned fitzsimmons further today as they continue walking through the details of the schools admissions process including its approach to assessing and applicants character traits former Harvard president\nAs they continue walking through the details of the schools admissions process including its approach to assessing an applicants character traits former Harvard president through ... and other admissions officials are also expected to testify as the trial goes forward\nCarry young reporting you're listening to NPR\nThe national weather service has issued a flash flood emergency warning for parts of West central Texas had covers eastern Kimball county a region that's already seen deadly flash flooding this month water is currently flowing over parts of interstate ten\nThe UN is warning assigned clone has struck Yemen's strong wind in heavy rain have injured several people and affected families in the war ravaged country\nThe Taliban killed more than twenty four Afghan police and security forces across the country overnight the fighting comes just days before Afghanistan holds parliamentary elections and fears DEA hid the reports from Islamabad\nWeren't as reported that Taliban insurgents attacked security checkpoints into off gone provinces\nOne in the north end another near the capital\nThey killed about two dozen men took out his hostage and sees that weapons the fighting wasn't related to upcoming elections but the Taliban have promised to disrupt that process and the multiple symbol tiniest attacks demonstrate the country's vulnerabilities even as politicians are ordinary Afghans to vote\nIt also followed a meeting in Qatar last week between Taliban officials and Washington special on voice of peace in Afghanistan that meeting was meant to pave the way for peace talks to end the country's Seventeen year conflict ... date NPR News Islam about\n... as prime minister shoveled his cabinet and women now hold half the seats they include Ethiopia's first female defense minister Ayesha Mohammed most of\nThe prime minister has also set up a new ministry of peace headed by another woman from Ethiopia and house speaker was very I have to come out on corporate Coleman NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include St Martin's press publishers of them why we hate each other and how to build a book from US Senator Ben Sasse about the state of politics and the country's future but very little where books are sold\nAt eight oh six you are listening to MORNING EDITION on a point by Judy be Atlanta we heard Lynn is NPR News station I'm Leah Fleming welcome to Tuesday Morning we've got Seventy degrees under cloudy skies were kept calling for mostly cloudy day today I was going to get up to about eighty by\nStation I'm Leah blaming welcome to Tuesday Morning we got Seventy degrees under cloudy guy the poor kept calling for mostly cloudy day today I'm going to get up to about eighty by later on this afternoon and then we'll be under some clouds were tonight and there is a chance worse than showers with overnight lows around sixty one degrees [noise]\nWhat's on people's minds in rural America coming up we're gonna bring you the result of a new poll that shows opioids and economic issues\nHave people they are worried but many retaining upbeat outlook about the future of their community we're going to hear more from them in Fifteen minutes\nSupport for ... comes from you our listeners and Peachtree orthopedics helping Atlanta heels for over sixty five years with specialist for every body part from regenerative medicine to outpatient join and spine surgery their goal is to help people feel better faster peach tree orthopedics dot com and regions bank providing online tools\nDesigned to help businesses and consumers understand a wide range of financial topics and making for money decision resources regions dot com slash\n\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep let's take a walk around the Florida Panhandle which is cleaning up after hurricane Michael we will focus this morning on the Panama City area\nIn the beach communities there are some buildings are fine oh there is no longer to exist and NPR's Quil Lawrence who spent days taking it all in either Quil tasty so what have you been seeing [noise] well\nMean they're ah they're treated down everywhere these towering pine trees that are just snapped over at the middle in some of the communities along the water and they've been they've been flat and then I Know people so to say that word or they try to describe it mostly uh people down here keep using sort of\nChildren's toys metaphor saying like a kid swept all the houses off the monopoly board\nOr you know a kid snapped his his toy tree I I don't think people can really believe that a bit of a win could snap out so we keep they keep on trying to reduce to some metaphor they could understand why our house could just get picked up\nAnd moved to blocks and flipped over to the point where you can't see\nIt could understand how how this could just get picked up and moved to blocks and flipped over to the point where you can't see what was a house in what was a vacant lot ... some of those communities there are people are really asking\nHow can you rebuild that's talking about like Mexico yeah\nYeah Mexico beach I think we've seen the overhead shots were there seems to be about one house that is intact and a couple of others that are severely damaged and everything else utterly destroyed but when you pull away from that spectacular shot do you see widespread damage up and down the coast\nYou are listening to MORNING EDITION on eighty eight point five ... Atlanta I'm Leah Fleming it's now eight Nineteen coming up environmental groups are hoping that the Democrats will win back the house next month\nWe had and our allies leading the house of representatives they could do badly needed oversight on the top administer Asians average to cater to polluters\nJust ahead we're going to tell you more on what that sort of oversight might look like that's ahead in Fifteen minutes at MORNING EDITION continues right here on the PBA Atlanta\nSupport for TB comes from you our listeners and Georgia State university CPB Atlanta is license to Georgia State university the largest University in Georgia and one of the largest in the nation more information is available that gee su dot edu and the historic Sam short line railroad\nThomas the tank engine visits the Sam short line train at Georgia veterans state park and ... October Nineteen twenty first plus the twenty seventh and twenty eight tickets at Sam short line dot com in entertainment news Milan neo Trump spokeswoman is asking people to boycott Atlanta rapper TI\nBecause of his promotional album video that shows a woman resembling the first lady's stripping in the oval office Trump communications director Stephanie Grisham\nTweeted saying that the video is not acceptable T I tweeted on friday quote you're forty five I ain't ... before sharing the video the woman in the video was wearing a jacket that reads I really don't care to you\nFrom war jacket with that wording on her way to visit my grandchildren in Texas [noise]\nTrump has declared a major disaster in southwest Georgia after hurricane Michael wiped out crops we find out how Georgia farmers your costs\nTrump has declared a major disaster in southwest Georgia after hurricane Michael wiped out chronic we find\nOut how Georgia farmers are coping with years of war destroyed a mere seconds\nThat are down here it's going to be slow and tedious\nAnd\nEverybody's going to have to pitch in and help everybody else and they will [noise]\nTaking up the pieces after the storm it's on second thought this morning at nine from ...\nSupport for NPR comes from the station and from T. I. A. T. I. A. is committed to helping those who are driven by purpose reached their definition of success investing advice banking retirement learn more AT T I Am a dot org\n[noise] from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\n[laughter] I'm from ... data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin drug addiction and the economy according to a new poll that is what is on the minds of rural voters as they go to the polls this election season the ball was done by NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nBut NPR's Alison Kodjak reports that even with those real challenges many rural Americans are optimistic about\nThe future if you want to picture of the troubles that face some rural communities even called Brenda a self described homemaker from the heart of Appalachia she fifty seven and married to a former coal miner\nThat bring that back one of them are real hard time glory if I was going to come anyway\nAnd drug addiction has hit her family especially her two grandsons hard\nMy daughter and her head and I'm ... and he walked off color because they couldn't give up his dog\nHe's still alive but some of her other relatives aren't including her nice they found her\nAnd her home [noise] uh why [noise] Denver\n[noise]\n[noise] uh [noise] the timber\n[laughter] [noise]\nShe was thirty three years old is she left behind only boys\nBrenda NPR is not using her last name to shield her grandchildren losing Coburn Virginia a town of about two thousand people near the point where Virginia meets Kentucky and Tennessee her experience fits into the findings are new poll which shows that in rural America drug abuse ranks with the economic outlook as residents top worry\nAlmost half of rural Americans have been personally affected by the opioid crisis on react if they personally know someone who struggled with addiction forty nine percent said yes Brenda says it's worse in her community\nIf an hour to approach can families or randomly and give them a piece of paper and have you have someone in your immediate family owned her eight out of town would quite yet\n... says in Coburn jobs and opportunities have dried up state officials have been promising to bring in economic development but none of it has reached her community at\nIf you come out of college with a degree I knew more than likely going to leave this area to find work\nBut experiences in rural America very widely and are pulled bears that out\nThe survey of Thirteen hundred adults all living in rural areas that many people are optimistic about the future of their communities most of the people we surveyed say they're better off financially than their parents and a majority think their children will do better still\nRobert Blendon professor of health policy and political analysis at the Harvard th Chan School directed our poll\nThey're optimistic about about the future and they're also optimistic that things can be done to pull them out of these economic problems they face\nWell some rural communities are suffering others are thriving says Christopher thorn burn the founder of beacon economics in Los Angeles\nWho might have a cold town and an oil town the town is doing terrible because coal can compete in this era of cheap natural gas\nOn the other hand because of fracking these rural community sitting on ... oil are booming and incomes are up dramatically as a result of all that new money flowing into the region for oil exploration and drilling\nThe economy and grenade in Mississippi a city of fourteen thousand about halfway between Jackson and Memphis, Tennessee is doing well\nEgypt for oil exploration and drilling the economy and grenade in Mississippi a city of fourteen thousand about halfway between Jackson and Memphis, Tennessee is doing well says that killed Powell let alone hum of its own Palestine twenty four year old truck driver who grew up in Grenada he says the town has a drug problem but it's a kind of meat is growing\nIt's almost like a farming town I'm starting to expand fall and the restaurants are being put her now within the past two years we really do\nAnd Brenda says she's seen flickers of hoping Coburn the town's high school has a new football coach and the community has come together to support the players\nYou know one of the inflatable how much that the kids run three way bottom one of them at least twenty six hundred dollars or ... or ... or white wearing all in one year there's good people hard working people\nEven though sometimes things still looks bleak Brenda says her view of her community is getting better Alison Kojak NPR News\nEl all\nThe Milwaukee Brewers hold out two games to one lead over the Los Angeles Dodgers and baseball's National League championship series if the brewers should win the series and Dodgers fans will insist on the if if they win the brewers would reach the world series for the first time since Nineteen eighty two one man is celebrating already\nThat is the voice of Bob ... one of baseball's great voices and he happens to be a long suffering brewers fan nuclear has been calling gains for Milwaukee since Nineteen Seventy one he was a player to do was playing career started there in sixty too\nLong ago euchre started in had were an usher removes him from his good seat at a ballgame must be in the front row euchre says only to be taken back to the cheapest of cheap seats high up up up that self deprecating style fit a catcher who had trouble catching he wants to explain to Johnny Carson his technique for handling the knuckleball\nEasiest way to catch it was to wait until it stopped rolling and just pick it up\n[laughter] and like it will be earned him a role as a play by play announcer in the film major league in his most famous line at the movie he fed to the radio audience about a wild pitch that misses the strike zone by about a city block\nJust a bit outside\nThis season though he's been enjoying real brewers success there\nBy about a city block\nThe sun this season though he's been enjoying real brewers success there's video of him in the locker room after one of the teams biggest wins the players crowd around him this man in his eighties dumping beer on his head to court Sherrie is reacting tweak Fox Sports Wisconsin reporter\nMore advanced than any why why it may seem fast\nWell they're all they're all we know why isn't here and I mean to be treated like one on one of them all the time I think that special for me\nRemember there is no I didn't euchre\nBob ... Milwaukee Brewers face off against the Dodgers once again tonight in Los Angeles [noise]\nNo none of this push the environment over issues like health care or immigration and the minds of most voters but it does make for easy messaging in states where the effects of climate change are already being felt cue B roll of raging wildfires\nGetting hotter but won't fire and smoke or air in her ... her is radically opposed to efforts to fight climate change global warming is a flaw\nAds like this have been appearing throughout California Florida and in swing districts across the country targeting Republican lawmakers it's part of a multimillion dollar effort by the league of conservation voters to flip the house Democrats Tiernan sit in failed is a vice president what the conservation group\nWe had in mind our allies leading the house of representatives they could do badly needed oversight on the minister Asians average to cater to polluters everyday over\nAnd by NATO allies leading the house of representatives they can do badly needed oversight on the minister Asians average to cater to the leaders every day over our communities\nThat word oversight is one you hear a lot from Democrats\nIn part because there's not a whole lot else they can do most of the role backs and environmental policy are happening in the executive branch under Trump appointees a shift in house leadership won't change that\nDemocrats can't force interior secretary Ryan Zinke you to restore Bears Ears national monument for example door to crack down on methane emissions but they can force him to explain himself\nArizona congressman role ... is the ranking Democrat on the house natural resources committee\nI Want to change the narrative of this whole thing where the Resources Committee is not just the past ... part of the Trump Administration that they're independent and that they have responsibility is co equals for oversight accountability\nTranslation expect hearings lots of them if Democrats retake the house Tom pile heads the American energy alliance which supports Trump's agenda he says a Democratic majority in the house would be a setback for the administration\nAnd they will be able to tie up mercilessly show that they would kinda be able to slow walk a lot of the good work that's being done with respect to these issues\nDemocrats already have a working list here's Colorado congresswoman Diane and to get the ranking Democrat on the oversight committee for energy and commerce\nI think you will be seeing investigations in hearings around the methane rural they claimed power plant and they paint car rules they're going to the scene I look more in gaps\nConflicts of interest in corruption at the EPA\nAnd the list goes on to get says this year's midterms reminder of what happened in two thousand six when Democrats took back the house under President George W. Bush for the following two years Democrats called hearings and investigations and crafted legislation that they knew would not passed under Republican president\nBut then when President Obama was elected in two thousand and eight we were able to roll back legislative agenda because we had spent the last two years developing it\nOf course Republicans could keep their majority in Congress which would mean continued support for the administration's deregulatory agenda Nathan Rott NPR News\nLater today on all things considered the outcome of the mid term elections that also have a major effect on the future of U.S policy and listen to that story by asking your smart speaker to play NPR\nIs it are the outcome of the mid term elections could also have a major effect on the future of us health policy can listen to that story by asking your smart speaker to play NPR\nOr your local member station\nFor ... comes from you our listeners and the Atlanta Opera presenting west side story Bernstein's classic Broadway musical of love trying to conquer differences November third six nine and ... called antigens that are tickets at Atlanta Opera dot O. R. G.\nAnd equalize books located in Decatur an independent bookstore for readers of all ages featuring new and used titles and knowledgeable staff to guide any search online or in person port eagle eye books dot com a great time\nFor good books at a forty three you are listening to MORNING EDITION on a point by ... Atlanta I'm Leah Fleming we had the marketplace morning report coming up and about ten minutes right here on eight point by\nThe Atlanta Braves manager Brian snicker has agreed to a two year contract extension the deal include the team option for third year in twenty Twenty one snicker took over the team and two thousand sixteen after friday Gonzalez was fired mid season he helped lead the brave to a division title and their first playoff appearance in five years\nIf you are a betting kind of person then you probably already know this but the mega millions and Powerball jackpots those both grew over the weekend and the combined total is now nearly a billion dollars tonight mega millions jackpot is up to six hundred fifty four million is the second largest jackpot in the game's history\nAnd the fourth largest in us history [noise]\nAn ex political rewind the attacks are getting sharp ... usually encouraging undocumented residents demoted we're going\nTo try and charged with a ... democratic votes in terms of you that campaigners rowing is election day approaches joined me New Jersey's Jim go away our panel agreed to\n\nSupport for TB comes from you our listeners and southern environmental law center protecting Georgia's environment and the people who depend on it during these challenging times through the power of the law southern environmental law center\nEnvironmental law center protecting Georgia's environment and the people who depend on it during these challenging times through the power of the laws southern environmental law center on line it's southern environment dot org\nAnd Ogle slurp University in Brookhaven working to make a private college education possible for more families in Georgia complete information on their new flagship fifty program is available and stop the the [noise]\nSupport for NPR comes from this station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and resilience cities at rock found dot org [noise]\nAnd from F Jaycee a foundation of donor advised funds working to maximize the impact of charitable giving and to create customized philanthropic solutions learn more it F. J. C. dot org\nAt eight forty five you are listening to MORNING EDITION ... bad land to I'm Leah Fleming it's been nearly a week since hurricane Michael barrel through south Georgia after wrecking destruction\nOn the Florida Gulf Coast thousands are still without power and food and for people who depend on government assistance the need is especially hard has ... grand Blankenship reports from Albany [noise]\nIt's a little after set up in the fleet of electrical lineman or on the roads have door to county health department April Smith is on a different mission she has a tree on the roof no power hungry baby\nDear lord I Can't take any more [noise]\nThat one can\nTo go buy it the health\nDepartment where she was hoping to find a formula she was supposed to be open over an hour ago is it [noise] you know food for the baby she's not sure where the next move is\nWhite can I Do I have no food stamps and I have one can't a formula what ... what do I do she can do is get on the phone call around for health\nAnd the on the phone [noise] many\nOr without access to food and already county to the changes in charge of the county's emergency management department\nWe estimate that it could be as high as thirty thousand people threw out the community which may include than those very small outlying areas that are technically in another county but to get their services in this community\nMosaic of food and security made worse by the storm includes kid to only get that at school the elderly in nursing homes and families on snap benefits change that or take all hands on deck\nThe food and security made worse by the storm includes kid to only get better at school the elderly in nursing homes and families on snap benefits change that or take all hands on deck to address that she just churches private businesses and others are picking up\nFor government is leaving all\nThere is a long line outside the local\nOf family in children's services office down\nOr stayed up of people like Johnny Gordon her trying to get emergency snap benefits and says he has no power and there's no more canned food we found for him and his wife and their two kids have got to cook which is tricky with no electricity\nIt the tables and says food stamps only allow each so much meat are so much fresh food every month the trick in good\nIs making that stretch\nArtfully scattered around the area where people would accept your car can line up and get food for April Goliath of the national guard is directing traffic and the parking lot along closed grocery store or cars are lined up into the road\nHanded out about two thousand meals on Sunday or\nCasual Wilson is in her car with her kids waiting to get into the parking lot she's feeling that's\nI have been out of ... de jour way diabetes a medical problem the you know it it's a disaster\nShe'd been without food that long to\nHave made me hard you know we know it's made by come to a CD like the\nCity officials say it could be another five days before the power's back on and people in Albany can begin to restock their refrigerators that they're able to afford the food for DD News I'm grant Blankenship in Albany", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Carrollton", "day": "16"}