{"month": "10", "state": "NY", "station": "WAMC", "content": "This is Northeast Public radio WAMC FM HD Ninety point three Albany double you argue any ... points\nReruns in Utica W am cage de Ninety point nine Kingston W O s storage de Ninety One point seven Middletown WGLA chi Ninety One point nine Plattsburgh WC HG Ninety three point three Kennedy Harry WAMC age do you want a three point nine tech Honda rogue WAMC ... five\nPoint one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC HD Ninety point one Stanford W ANR eighty eight point by Brewster and WAMC am fourteen hundred Albany [noise]\nI everyone it's Alan\nI got to tell you my heart is in your hand\nIt's locked box time again and we have another exclusive premium few\nWAMC presents the hilarious capital steps at the egg on November ninth at seven thirty PM\nBut your hundred and fifty dollars locked box for your pair of tickets before they sell out which will they always do and that's when we all get together you there\n[noise] there's this [noise]\nNPR Music and West Virginia public broadcasting was provided by Bailey a glass and by the west Virginia tourism office welcome to another mountain stage with Larry Gross [noise]\nWon't leave me\nWell I can\nSay performance radio from the mountain state\nOf West Virginia and boy do we have an exciting show for you today\nMr Jeff Daniels end up in Daniel's ban are going to be out during our next hour and they got a great sound that just made a a live recording and I know you're going to love them also very talented singer and songwriter lives in Nashville Now originally from up in Louisville dawn lenders this year with a bunch of very talented musicians from up in ...\nOne of our favorite people Lucy Wainwright Roche is comebacks she's got a brand new record and now you're going to love to hear her songs and\nSome folks who have not been with this before but we are eager to hear the handsome family\nI have fans all over the world but to start us out a man who\nNow lives in Nashville has for a little while but he's from originally from northern Louisiana and there's a lot of stories down there and he's taking some of these stories and put them into his songs he's been praised both as a songwriter and a poet because his lyrics are really fantastic his latest\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu friends with him please welcome back to the mountain stage Kevin Gordon\n[noise]\nYou\nThin glass me the ball in Maine in the same way\nIn the news the\n\nThose through the wrong but then they would give\nAs the about\nWhat all new to me\nDidn't do what we would we will go not due to dumb down a\nGoes\n\nGlad I Am I on a lot of them\nNo no\nDisbanded silly\nDad and me I'm I'm ... something about what came to see you\nAgain but there are certainly the grid and all of the brain ...\nI was just down the middle east\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n\nGood to see all this evening it was another one off the new ... this is ...\nI run a row\nNever had to go\nMitigate any chance the main\nThe ... you won't see I'm looking\nFor a\nMoment that in mind and brain you\nThere's a pseudonym and she gave me the two main\n\nSt ... man\nOr a goal\nI must say that\nIt does it down to the dirty rain\nNow which\nWas those sweet to me\nThat in some ...\n...\nYou go to\nMaybe it was through\nMy hand to hand to\nKick my change but not\nNow na\nChina maybe\nMe the three ...\nNa na\nNa\n\nReally out of the mountain stage Randall talk Kelly music right there\nListening to balance stage live performance radio for the mountain state of West Virginia major funding for mountain stages provided by Bailey ... Glasser L L P A nationwide\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nSee Boston Alabama Florida and Delaware details that Bailey Glasser dot\nCom and by the west Virginia tourism office there are places you visit and places you behold you'll find natural wonders and endless experiences in the mountain state West Virginia a place that's almost heaven more information at W. B. tourism dot com\nAdditional support is provided by hip historic Charleston West Virginia you'll find live music seven nights a week in West Virginia the capital city it's music from the hip your adventures starts on line at Charleston W the dot com does this mountain stage on NPR\nOh\n[noise]\n\n\n\n\n[noise] we don't get your take a look at our website mountain stage dot org\nYou can find links to our podcast there and you can follow us on just about every form of social media someday we hope that you will come and visit us live beyond the audience wherever we are here in Charleston at the culture center or on the road you can find out what we're going to be and get your tickets right there on the website mountain stage dot O. R. G.\nOur next guests are built around a husband and wife team of Britain and renting sparks Brett started out down in Texas but they met up in a race world up near New York city and then they moved to Chicago for a while but for a good while they've lived down in New Mexico and they've made ten recordings\nAnd had built up quite an army of the fans and people who've recorded their songs Jeff Tweedy Christie more Andrew Bird and others\nKnown for their uh sounded very intriguing sound sometimes a little more a little gothic\nA very interesting oh is she writes two words he writes the music but then in two thousand fourteen millions of people became familiar with their music because uh\nThe HBO series True Detective use the song far from any road on its opening theme so possibly you've heard that when you're going to hear a lot more right now\nFrom their last album which is called unseen and who knows where else from the they're the ones that are choosing it please welcome for the first time to the mountain stage the handsome family [noise]\nWe're going to get a\nGood song about a whole that we found in our back yard [noise]\nStreaming support for WAMC comes from Albany med now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nO L y random Caroline\n\nThe dog oh love a\nReally you know we are baby boomers low news in during the\nDid I Want\nThe ...\nThe bottom\n\n\nOut on the barn and I they're down there are all very late in Kenya gave me\nMy my bow let go and get one God\nThey'll look what is your ...\n\nShe ... down the road\nRow one ... of the world what\n... well not\nThe old in dog ...\n\n... ... ...\n\nAnd\nOn their Raleigh\n[noise]\nCoffee and the deep deep sadness I feel whenever I'm offered coffee with powder cream or\nStreaming support for WAMC comes from Albany met now will in the mastery family children's emergency center a place for ill and injured children more information at AMC dot E. D. U.\n\nAnd over and\nOr ... or ...\n... or ...\nTo ... ... ...\nWoman and and ...\nAunt was in\nTrailer and\nStreaming support for WAMC comes from Albany med now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n\nOoh\nOoh [noise]\n[noise]\n\n\nThese fires and friends say some family right there [noise] and you can\nPick up a lot of their music out there as I said before they have ten different recordings the latest one\nIs called unseen\nRemembered if you missed part of mountain stage or you just want to hear something again you can always visit the podcast section of mountain stage dot org each of these broadcasts will include songs we don't have time to sit on the radio version as well as our complete finale song\nThere was a favor and take a moment to subscribe raped and review the show on items or wherever it is that you get your podcasts we'd appreciate that\nWe're going to finish this hour was one of our great friends and a woman whose music we have admired for a good while she's been on half a dozen times both as a solo artist and also with her mother says you Roach they've done a couple of elements together\nBut Lucy Wainwright Roach has just made her fifth recording and it's really really a lovely records show is is writes great songs into your voice is quite beautiful uh this time also the production plays a pretty big part in it and uh\nI I I really recommend you get this and listen to it you're going to hear probably hear some of the tunes I don't know what she's going to do but it's awfully nice to see her again have her back on the mountain stage maker welcome loosely Wainwright Roach [noise]\n\n\n\nMm and chain na\n\nNa\nNa\nNa na\nNa na\nNa na na\nNa na\nStreaming support for WAMC comes from Albany med now will be in the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu Mm\nNo\nOn the show the ...\n... ... ...\n...\n... ...\n...\n\nThat it isn't ... ... ...\nAnd they should\n...\nYou know you know my\nD none of my\nThat oh no no no\nMm\nNo\n... ... ...\n... ... ...\nBut they all run\nAnd no ... ...\n...\n...\n\n...\n... ... ...\nAnd as many as ... ... ...\nThe ...\nThe na na na na\nNa na na\nNa\n\nA ...\nThank\nYou so much um yeah so I'm Lucy ... Roche how many of you guys have never seen me before\n[noise] that\nSeems like almost everybody in that seems about right um well can I tell you about me I have\nI've um I've been driving around in the car by myself for um about ten years and um have a lot to say\nI'm Glad to see you um\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nI'm I'm so glad to be back here to do this show and I'm trying to think what happened to me since I was here last and I think mostly nothing and also at the jury duty so for a month [noise]\nYeah I was a grand jury duty um grand jury duty is not like regular jury duty you know how with regular jury duty you can kind of amazing [noise]\nAct out a little bit and they'll send you home maybe [noise]\n\nGrand jury is not like that I'm\nKind of like the Unitarian church of jury duty because they'll take anybody so you can't get out of it [laughter]\nUh so um I guess that's my public service announcement for you a chance if you get a grand jury summons just given it's happening [noise] Mm\nAbsolutely nothing to do with that\nMm Mm Mm Mm\nSome time to see Mm saying ...\n... ... new one does not you know other\nThan ... ...\n... no ...\n... ... ... ...\n... ... ... ...\n... counting ...\nSeasons that\nRemain\n... ...\n... ...\n... ...\n... ... fine\n... well er but ... ... ...\nThe ...\nMm\nMm\nNo ...\n... ... ...\nWell\nNa na\nNa na\nNa\n\nNa ...\n\n\n...\n... ... ...\n\n\nWay right wrote a new one which is just right now you can get a cold peace\nRecorded down in Nashville with Jordan broke him producing it's a beautiful beautiful record hurt some tunes from it\nDuring her sit Lucy Wainwright Roach\nMountain stages brought you in part by Charles Ryan associates we're smart brand communications crafting solutions to drive results for more than four decades probably supporting the arts and public broadcasting throughout the mountain state\nLike you say\nHello to you right now if you're listening over W. K. why Lexington, Kentucky or W. E. M. you it's a lead to Michigan\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nJunior during the August ... heritage festival or guest host up there will be a West Virginia is big liar bill lip along with Kathy material Darren and Brooke Aldrich blue yonder and Joe Newberry\nYou're listening to mountain stage live performance radio from the mountain state of West Virginia mountain stages supported in part by the station and by West Virginia public broadcasting\nHotel accommodations for mountain stage guests are provided by the Charleston Mary uptown center hotel centrally located for the business and pleasure traveler in downtown Charleston retail district\nThis mountain stage on NPR\n[noise]\nSupport comes from ... the distillery new ... New York a farm to glass distillery featuring heritage method distilling and New York's Hudson Valley providing towards tastings and more ... dot com the town cry or live music and creative contemporary cuisine in beacon presenting\nSo called October twelve Kenny White also Amy speech October nineteenth John Gorka October twenty AT T O W N E crier dot com\nAnd from alarms have Berkshire county offering full service residential and commercial security and safety monitored system's based on individual or corporate needs\nFor over thirty five years alarms of Berkshire county dot com\nThis is Northeast Public radio WAMC FM\nHD Ninety point three Albany W. R. U. N. H. D. Ninety point three rooms in Utica WAMC ... Ninety point nine Kingston WLS our age the Ninety One seven Middletown WC EL HD Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry WAMC age do you want to pre nine taekwondo rogue of WAMC wage the one in five one great bearing can W W E S H da\nDa dun dun Kisco W. A. N. D. H. D. Ninety point one stamper W. A. and our eighty eight by\nBrewster and WAMC am fourteen hundred Albany [noise]\nThey record it hurt a lot of great music and we have a lot more to come during this hour we're going to be hearing from Mr Jeff Daniels and the ... Daniels band but will open the hour with a very very talented young woman who has not been with us\nBefore and I'm certainly glad she joined us today because she has a brand new CD out there called meet me at the river which is full of wonderful tune she co wrote ten of them and there's I think twelve or Thirteen on the record so\nShe's defined songwriter singer and she's done a lot of very interesting things of of different sorts which makes are perfect for us I mean she's recorded a\nCollection of original French songs she also had a lot of her songs placed on many many TV shows I'm sure you've heard her before but this time she\nStreaming support for WAMC comes from Albany bed now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nProducer Fred Foster to do some country tunes she brought a bunch of folks with her so she can do with what she wants to do it it's on Yelp rock records her latest please walking for the first time to the mountain stage dawn land is [noise]\n\nKnow then you know\nYou rather ah\nYeah we hadn't seen\nWeek trip they\nDid things that we know they're not\nLove my\nWonder I'm the one that back\nBuddy that rather than let\nYou things you know they know\nWhat you mean when\nWhen I'm done\nMe me\n\nStreaming support for WAMC comes from Albany med now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nThey [noise]\n\nMm\n\n\nWell we've got one more time for you and um [noise] what can I say this has been a real treat and I'm I'm looking forward to learn music night and ...\nStreaming support for WAMC comes from Albany bed now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nVery rare you get to learn a song and then two hours later sitting in front of a bunch of people school school like it [laughter] no pressure um anyway this one's called traveling thanks so much goes thing and I think ... states rather\n\nDidn't really have\nWatch some right Dover great\nI knew well\nNo no\n\nAnd her band [noise] don't move down in Nashville Now but uh she's from the little wary\nAnd as you heard her band is from around that's part of the country too\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWant your songs on that it's really quite a nice record dawn land is\nYou're listening to mountain stage live performance radio from the mountain state of West Virginia major funding for mountain stages provided by Bailey and Glasser L L P A nationwide law firm born in West Virginia with offices in Charleston Morgantown feeling St Louis D.C Boston Alabama Florida and Delaware\nDetails at Bailey Glasser dot com\nAnd by the west Virginia tourism office there are places you visit and places you'd be hold you'll find natural wonders and endless experiences in the mountain state West Virginia\nA place that's almost heaven\nMore information at W. B. tourism dot com additional support is provided by hip historic Charleston West Virginia you'll find live music seven nights a week in West Virginia is capital city it's music from the hip\nYour adventures starts on line had Charleston W the dot com\nIs this mountain stage on NPR\nOh\n[noise]\n\n\n\n\nIf you have questions or suggestions for us we love to hear from you our email address is Larry at mountain stage dot org\nYou can also connect with us on Facebook of course her check out all of our social Tumblr Instagram and Twitter all these links are at the website mountain stage dot org\nMountain stage is excited to be part of slingshot and new collaboration with taste making public radio music discovery stations and NPR Music to discover and elevate promising up and coming artists find out more about slingshot artists at NPR dot org slash swing shots\nWere going to end the show with one of America's\nGreatest actors stage screen little big screen [noise] he also has\nAlso has his own theater up in Chelsea, Michigan any rights place for that\nBut that's not wise here of course this year because he's also\nA find singer and songwriter list you think he's a actor bill a ton who's out singing a little bit this guy could easily have made a living doing this and when you hear a song she'll understand what I'm Talking about he's here along with his sons ban the bend Daniels band and they have a recording\nThat's called Jeff Daniels in bend Daniels band acoustic sitting tour alive we're going to hear a little sample of that\nAnd the fall he will be [noise]\nHe'll be starting in the fall on Broadway and to kill a mocking bird but he's going to be starting right now singing his own so\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd any other day just me and Mrs ... she was purged dome cow job was part of the chair and you know it was going on no one's going nowhere or\nI turned on T. V. turned out\nTurned to miss a thing called ...\nWhen she didn't just bombed all went to see you again that's when I saw the state of mind ...\nShe had her nose insider Jindal woo about words her as Dick said stimulation stirred opposite of what they read now were shocked to hear her say I'm On the very last page of ... D shades of gray\nRaining but these days are gray\nMy wall Missouri but these days regret\nYou be Anastasia was the only thing she said\n[noise]\n\nShe grabbed me by my hair his ... year every time you moved tomorrow we'll remind us which he or she we\nRead the\n\n...\n...\n...\n...\n\n...\n...\nNa na\nStreaming support for WAMC comes from Albany med now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nCan hear you will\nBomb ever come out [noise]\n\nI Would like to introduce my daughter in law Amanda Daniels [noise]\n\nI did a show called newsroom\nAnd it was every artist on this bill knows right ...\nYou got to keep your eyes and ears open because you're going to hear things she said that's when you got to grab it\nThat's a song that's played that's a movie that's a ... story\n... the writers I learned from were playwrights off Broadway in New York City\n...\nI was sitting on the side of the news room where the crew member she was a set designer when we're sitting in America boys office and they were lightened\nDreamy support for WAMC comes from Albany in bed now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot E. D. you know people on the set\nAnd she started talking about marriage\nAnd ... ...\nYou kind of looked out where they were working and she said\nYou know he used to do this for me used to do that for me but\nThat was back when he was into my ...\nLike\nMy job you know she really\nYour skin is the way\nYou know what I meant to\nIt didn't\nI mean you know\nYou ... yeah\nFor probably\n... to ...\nTo me\n\nAnd\nMade them do huh\n\nMm Mm\n\nTen ... try\nTo\nYou\nKnow\nTruly\n... ...\n\n... to me", "show_name": "Mountain Stage", "year": "2018", "city": "Albany", "day": "02"}