{"month": "10", "state": "NY", "station": "WAMC", "content": "This is pat Bradley in WAMC North Country bureau Blacksburg officials approve regulations on data mining maintain a moratorium\nWas this moratorium hit all the interest is gone now supplies birds really missed out on a big opportunity\nTheater on that council is concerned there could be a resurgence of acid rain the Affordable clean energy rule will have grave implications for the ... regions news is at WAMC data work\nThis is Northeast Public radio WAMC at that age di di di puts me Albany\nW arguing HD Ninety point three ribs and Utica W. M. K. E. H. D. Ninety point I think than W. O. R. H. D. Ninety One seven Middletown WC el ... Ninety One nine Plattsburgh WC a an HD Ninety three three Kennedy Harry W. N. C. H. D. one oh three point nine ... W ... by one great aren't in\nW. W. E. S. H. D. eighty eight point nine mount Kisco W. A. N. G. H. D. Ninety point one Stanford W a an eighty eight point by Brewster at WAMC am fourteen hundred Albany\nThere's this ring in Mount\n\nMindy or music and what did you read any of public broadcasting which is more provided by Malian Glasser and by the west Virginia tourism office welcome to another ... days when your host Larry Gross\nMother and I'm\nLonely me\n\nReformers radio state of\nWest Virginia we are at our home at the culture center theater in Charleston West Virginia\nWith the show that I'm sure you're going to enjoy during our next hour Amanda shy ours has returned to be with us with her whole band yeah [noise] we got a new album and she's fantastic also a brand new bad or there's never been with us before a matter of fact they're kind of new on the scene\nBut they are dynamic you're going to hear from them I'm sure in the future the war and treaty will be out\nWe're also going to a feature a man who's been around you depend on the show of several different times but never as a solo artist because he's never made a solo album until now I'll tell you who's been with when it comes out Mr Byron Isaac's this year and he's going to be out in just a little while [noise]\n\nOur favorite singer songwriter from the pharaoh violence that's right the the Rawlins you're halfway between Denmark in Iceland tighter is with us so we love tighter\nRight or from the the real violence that's right the Rawlins you're halfway between Denmark in Iceland\nTighter is with us so we love tighter he's been a well there's several times but never in this venue so good to have tighter when we're cool but it started out the man has not been with us before he just made a very dynamic album it's not as first damage made quite a few albums but\nHe lives down in Texas now out in the country and he let that whole feeling of the the Texas hill country seep into this album name of that album\nIs lifted please welcome for the first time to the mountain stage Israel and that [noise]\n\n[noise]\n\n\n\n\nMm\n[noise]\n\n\n\n\n[noise]\n[noise] we'll let you take a look at our website mountain stage dot org ... you can find links to our podcast you can also follow us on just about every form of social media\nSomeday we hope that you will join us live in the audience wherever we are whether we're here at home at the cultural center in Charleston or whether we're on the road\nYou can find all that out and get your tickets right there on the website mountain stage dot O. R. G.\nNext step is a man who's been with us at least four times before I think with old bill he's one of the founding members of the great group ... he was here with Amy home last time she was on and maybe\nOthers I don't know because he's been out there for a couple of decades a great musician a singer and songwriter but before he was writing songs for all the groups that he's in right now he plays bass\nA and records within tourists with the looming ears but because\nBefore he was writing songs for all the groups that he's in right now he plays bass a and records with a tourist with the ... years\nBut because of all there's involvement with bands over the years he never got a chance to put out his own\nRecording and now he's done that is taking some songs that he's written over the years and gathered them up with some new things and put out disappearing man I think you're probably hear some tunes from that and whatever else he wants to play brought some friends with him please welcome to the mountainsides first time so Mr Byron Isaac [noise]\n\nThe\nThings that you do and I just can't\nBe you know [noise]\nThe things that she used to say and they just they read\nYou know [noise] I'm losing\nYeah\n[noise]\nThere's not been on the table and there's nothing then then the bed and then ... then you're right and so in my\nI'm ...\nYou know\nGoing down but\nNo one at a job you know where to go who\nIt really wanna act\nThey don't know who\nYou got me on the rope and they got to be millionaire then I just can't go to Lou then you\n\nThen we do in a hole in my life and mistreated again um Mm\n\nThat was fine [noise]\nI got to say to such an honor to be here especially be back such a great line up and for the first time under my own name which is pretty weird at this point in my life to debut artists most\nOf the time I I write songs about other people and sort of leave my a kind of boring happy life out of it\nUm but the people are just much more compelling stories you know uh but this one that wrote from my wife is called summer\nMm Mm Mm\nMm\nMm Mm Mm Mm\n... does play a role model\nInsurance [noise] only from you know\nMm\nMe I'm I'm a you know a ...\nYou know\nOh I\nSee I don't\nKnow who\n...\nA\n\n\nAnd meeting\nWith a big snow\nAs the\n\nEye and say ... to ... oh\nA ... there's no do you like and\nDo the\nSame as me a\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for what three four nine nine six six zero zero\nThe\nKnow now I mean [noise]\nIt's been any in any event in many\n[laughter] [noise]\nSee ... in\n\nA\n\nBy I think [noise]\nThe latest is disappearing man actually it's his first\nRelease and it really is a fine records find songs and great production arrangements you heard some of them right there\nBy ... I mentioned that he was one of the founding members of old bill and now plays with the ... years he also played with leave on helm is played with many many people over the years\nIf you missed part of this show or any of our shows over the last couple of years or if you just want to hear in again you can always visit the podcast section of our website\nEvery podcast will include songs that we didn't have time to fit on the radio and most of the time we put on the complete finale song too if you'd like to hear the rest of that if you do is to favor we'd appreciate it if you subscribe raped and review the show wherever you get your podcasts\nWe will end this hour with a man who's been with us three times before on the mountain stage starting back when he released his first record round two thousand and three\nHe comes from the pharaoh islands that's about halfway between Norway in Iceland is part of the kingdom of Denmark and\nHe didn't much the way so much as they used to because now he's got to a family\nIt's got a child watching child there so we're happy that he included us on this trip because she has a new CD called I Want to be kind and everything you're going to hear today is that CD his sons have been recorded by a seal grin\nI Want to be kind and everything you're going to hear today is that CD his sons have been recorded by a seal\nCorinne Bailey Rae and he also met Van Dyke parks when he was on mountain stage down in Athens, Georgia if you know Van Dyke what'd fantastic musician he is yeah and he wrote to tighter and said he wanted to work with them so they did a project toilet in many many many more please welcome back\nTo the mountain stage tighter [noise]\n\nIt's un you fall man\nShe starred hold in um [noise]\nDon't want to let go\nShoot ... know\nIf you're a na na\nNa na even try\nAnd you can tell you the money\nTo boost or not and then you\nMove me straight in the ah\nLet's just get happy\nIf your heart's nah man\nYou see even more now than\nShe already gone [noise]\nYou're not here because you love me\n...\nIf you're a ... na na\nNa na\nAnd you can tell you\nSued him ...\n... and the guy\nBut it shows to get their money\nYour eyes na na na\n\n[noise]\n\n\n[noise] Mm\nYou can tell you but on the\nYou can't tell you but on the\nNews in mind\nA nice and the ...\nYou\nDon't stand to watch you in\nCity of God and you\nMom and men and women in\nYour ...\n\n[noise]\n... looking for a place\n\n\n\nI'm looking forward to say\nNot far from the yo yo\nMa ma ... man\nBe some man and he said the man you need a GED\nCan play\n\nAnd sharing your story play\nIn so many ways\nA screen man to\nUh go to this guy\n[noise]\nAnd not the age of ...\nA woman to be on a lot of those people\nYou\nKnow [noise]\nI'm at the age of ten\nTo bring on Flora God or to to\n[noise]\nOh God to [noise]\nUm no I just want\nTo be on\nThe\nSide uh\nTo me\nSomeone needs to borrow\nBeing you know ...\n\nWell I look at a tighter [noise] yeah I see you\nWhen in order to see his [noise] mentioned [noise] mentioned\nThat sealed recorded this works Corinne Bailey Rae many many people of all different kinds of Netherlands window ensemble pollen broke society Nicole ...\nCorinne Bailey Rae many many people of all different kinds and Netherlands wind ensemble Holland broke society\nNicole nearly all kinds of folks and as you heard there Mandy Potemkin\nGreat great songs and the name of the new one is called I Want to be kind and he is one of a kind tighter let's just say hello to you if you're listening right now over ... W E a G T E Toledo\nOhio or W. I. N. Odessa New York we hope you'll be with us next time when I guess we'll be living sent Taylor Gretchen Peters Jill Barber Sean around an amber rhubarb is\nNo stage is brought to you in part by Charles Ryan associates we are smart brand communications crafting solutions to drive results for more than four decades probably supporting the arts and public broadcasting throughout the mountain state\nYou're listening to mountain stage live performance radio from the mountain state of West Virginia mountain stages supported in part by this station and by West Virginia public broadcasting\nHotel accommodations for mountain stage guests are provided by the Charleston marry out town center hotel centrally located for the business and pleasure traveler in downtown Charleston retail district there's this mountain stage on NPR\n[noise]\nSupport for WAMC comes from the east ... celebrating fifty one years of folk and acoustic music presenting Betty and the baby boomers November third at seven thirty the Audi ... proctors eight stepped out of work\nThe air Carl museum of picture book art Amherst, Massachusetts presenting the exhibition our voice the credit Scott king illustrator awards with art depicting African American life history and culture crawl museum down and work\nAnd handmade in more new Paul it's a boutique that supports creative communities and cultures from America around the world with a showcase for their jewelry gifts and women's fashion handmade Anna more on Facebook\nThis Northeast Public radio WAMC up ... points we Albany W. R. UNH the Ninety\nPoint three ramps and Utica WAMC HD Ninety point nine ... WLS are HD Ninety One seven Middletown WC EL HD Ninety One nine Plattsburgh W ... Ninety three three can injure Harry WAMC HD won all three nine tie come to regret\nWAMC OH the one by one great Barrington W W E S H the idiot mind my kids go it'll be ... Ninety point one Stanford W weighing in our eighty eight by\nBrewster WAMC am fourteen hundred Albany [noise]\n[laughter] now if you are just tuning in [noise] glad you did that\nAnd we got some great music still to come on this show amen to shy or sent her band will be out and just while but we will open the hour with a couple of folks who have never been on the show before a matter of fact they just made their first full length album called ...\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for long term success with we've got strict to me in gastric bypass surgery monthly seminars open to the public for went three three nights five seven five one zero to register\nAnd Tanya Trotter Tanya grew up in D.C and she went to\nA talent contest as a young teenager knew that's what you want to do and she began writing right after that which is pretty uh pretty unusual and Michael was a little more of a late bloomer but he got his start in a very unusual way he was in the army in Iraq\nAnd he began to write songs tribute to people who were falling soldiers there\nAnd that's what they decided to do because they were so powerful they got back they run a festival together met each other and they had been together ever since they've taken the world of American music by storm and you're going to see why right now please walking for the first time to the mountain stage the war and treaty [noise]\nOh\nThose\nThose things you know a\n... my ... my my\nKnow [noise]\n\nYou at my door dry in did\nYou you know [noise]\nWe\nI mean by\nWe have you know rent own\nI think we can do\n\nDid you\nReal real\nYou um you know All right you know\nA minute wait a minute when we wait a minute you know [noise]\n\nHope he will be\nStreaming support for WAMC come from birch are orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for what three four nine nine six six zero zero we do\nTo you man you'll be there\n\nA\n... ... ... ... ... ... ...\nYou see me\n\n\nThat really is a moral\n\nYeah\nNo Larry said we never played mountain stage before he didn't know we play to stage many a times in our head\n[noise]\nThat'd be a crazy person and yeah for real\nAnd I wanted to have to get dressed up and rehearsed like really mountains are probably won't get invited back but it's a this was our last\nThank you for your\nIt's wrong cause not over yet which means don't give up still got life in your body you said that you and your loans\nDon't quit don't give up all night dream now we\nWill be a really\nSweet but no I'm a ... ... ... ...\n... may\n\nI ask\nThem you know\nThe main\nWhere are you know we me and then\nYou\nBut you\nMen do how\nDo you see\nNew law\n\nThe main thing\nLa\n\nMotive all ...\nAnd ...\nTo see\nIf we could do a little more\nWas the\nSprayed\n\n\n\n[noise]\n[noise]\n\nMy go\n[noise]\nThere [noise] and\nThey're going to be up for another month and a little bit more promoting this record and I don't have to tell you if they come to your area anywhere near you got to go see these guys my goodness and somehow I think we might invite them back again [noise]\nAnd treaty wow\nYou're listening to mountain stage live performance radio from the mountain state of West Virginia\nMajor funding for mountain stages provided by Bailey an Glasser L L P A nationwide law firm born in West Virginia with offices in Charleston Morgantown wheeling St Louis D.C Boston Alabama Florida in Delaware\nDetails that Bailey Glasser dot com\nThe early\nMe [noise]\n[noise]\n[noise] [noise] [noise] [noise] I call a true\n[noise] [noise] [noise]\n[noise]\n\nName the shanks clean stars shame they still may\nMean Jill\nIn the\n... to read the ...\nThey know what not [noise]\nNot\n\nI die\nYou know do you know\nIn a mall in ... ... ... no no\nKnees early\n... you ...\n\n\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\nYou're swimming during the\nGod loves it\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for long term success with we've ... to me in gastric bypass surgery monthly seminars open to the public or when three three nights five seven five one zero to register\n\n\n", "show_name": "Mountain Stage", "year": "2018", "city": "Albany", "day": "30"}