{"month": "10", "state": "NY", "station": "WAMC", "content": "Say everybody the midterm elections are come and when they do the future of this country is going to be in your hand we are in one of the scariest time she's ever been\nThere and in the middle of all of that is WAMC it's panel every morning commentary on all sides W. A. M. C. dot org and put something into the lock box maybe this little light in the darkness\nWill get us through this is Northeast Public radio WAMC up\nI'm HD Ninety three Albany W. R. U. N. H. D. Ninety points reruns and Utica W. M. T. H. D. nine point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown to UCLA HD Ninety One point nine Plattsburgh WC A. N. H. D. Ninety three point three ... three nine tai chi and robots\nWAMC which the one oh five one great Barrington W W E S H deity point nine mount Kisco W. N. D. H. D. in any point one Stanford WN are eighty eight point by Brewster WAMC am fourteen hundred Albany\nIs just\nYou\nNPR Music and West Virginia public broadcasting more promoted by Malian Glasser and by the west Virginia tourism office welcome to the mountain with our special guest so\nOne leaves me no\n\n\nThank you thank you so much and welcome to mountain stage live performance radio from the mountain state of West Virginia tonight we're live on the campus of Davis in Elkins college in Elkins West Virginia as part of the Augusta heritage ...\nI'm ... I'm standing in for Larry Gross I've been an audience member for mountain stage I've been a performer on mountain stage and tonight I got the honor of hosting the show I'm Glad he joined us and I thank you so much for joining in if you're on the radio you're going to be glad you did\nAnd our next hour we're going to hear from one of West Virginia is most famous and loving daughters Kathy material [noise]\n\nHas a new record out soon called pretty bird and we'll hear some of the sharks from that later on\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOh and they're banned Darren in brook Aldrich and [noise]\n\nAnd later this hour we'll hear from honky tonk hidden treasures from right here in West Virginia blue yonder [noise]\n\nThat we're going to start Tonight Show with Mr Jones Newberry or Joe ... newest album is called to hand he's known all around the world for his claw hammer banjo playing\nBut there's also a powerful guitarists a singer and songwriter the gifts and brothers version of his song in singing as we rise featuring gas to vote was Ricky Skaggs\nWhen the twenty twelve IBM a gospel record performance award and with Aaron Gibson he shared the twenty Thirteen IBM a song of the year award for they call it music\nAsked about his proudest moment as a musician Joe says I've been lucky to win awards for my songs and I've played on some really nice stages over the years but it probably my proudest moments come on folks right to tell me that they play my dogs are bad sides and funerals this is the highest honor so please\nPlease welcome Joe Newberry on his first appearance on mountain stage [noise]\n\nIs everybody do and how are you um\nI'm going to sing and play the best ... singing number from West Virginia\nMom cheery room\nYoung Malcolm\nLoved one\nLong\n...\nShe was ... I'm ...\nWhat oh my God I'm\nTo the new\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nHave a\n... [noise]\nThe long ...\nSome years\nHave a\n\nLonesome down\n[noise]\n\n\nLike sometimes like you I spent the majority of my life going to visit old people and now I Am one [noise]\nAnd my good friend the late Craig Johnson went to visit an older man in Galax, Virginia and critic was was visiting and he said I see that fit all on your wall you still play in the man held up his left hand there were no fingers on his left hand they said I don't play anymore he should buddy\nGo home and ... and so ... Wilson is uptick Craig on his dream of time it's called tiny mountains [noise]\nSit down buddy and we'll drink and smoke woman don't you weep for me\nMy hands can fiddle then my heart's been room damn no honey amount to a lost my fingers and the gala X. men two\nBuddies thing is ... I'm\nIn my heart broken you bond you lord of the time I mean I'm\nI started out logging one of the prime women don't you weep for me\nHitching up she brings to the big drag line you know ... to ... when does get her starts barking the gears come\nDown buddies thing is ... I'm In ... new cuts ground Lorna ...\nUm\nWe were fighting over nothing and drinking to her\nI'm ... and ... nine in name Louis boat and he left his mark on country\nBooms and oh Utah and\nNow when I play\nI hear when ski and she\nWas from ... in ...\nIn a long time to spend with a song that bone and mostly much down nine\n... [noise]\n\nIn the show [noise] and I was\nLord I wanted to play fast\nAnd then I thought well I could put a little space in the notes and then I discovered\nHobart Smith from Virginia [noise]\nThis is a tune into last chance [noise]\nIt like it's my last chance thank you to all the good folks at ... thank you for coming in support like music [noise]\nStreaming support for WAMC comes from Albany med now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n\nMr Joe Newberry again his latest album [noise]\n\nHis latest album is two hands and if my wife said to me backstage he said that the market but great entertainer when they can sing a super sad song and make everybody glad they hurt him so\nI I Want to remind you that October old time weak Joe has been a an instructor with the Augusta heritage festival on a number of occasions and I I Want to remind you that the October old time we get like job or twenty first three twenty six at the Augusta heritage center\nThis is bill left standing in for Larry Gross and you're listening to mountain stage live performance radio from the mountain state of West Virginia\nMajor voting for mountain stages provided by Bailey in Glasser L L P A nationwide law firm and born in West Virginia with officers in Charleston Morgantown wheeling St Louis D.C Boston Alabama Florida and Delaware details at Bailey Glasser dot com\nAnd by the west Virginia tourism office there are places you visit in places you behold you'll find natural wonders and enlist experiences in the mountain state West Virginia a place that's almost seven more information at W. V. tourism dot com\nAdditional support is provided by hip historic Charleston West Virginia you'll find live music seven nights a week in West Virginia capital city it's music from the hip your adventures starts on line at Charleston W V. dot com you're listening to mountain stage on NPR\n[noise]\n\n[noise] [noise]\n\n\nMm\nStreaming support for WAMC comes from Albany med now open the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nMm\nMm [noise] [noise]\n[noise]\n[noise]\n[noise] we love to hear your experiences listening to mountain stage or if you go out to see a band that you've heard on our show and of course your suggestions are always welcome if you'd like to write to us here at mountain stage you can email Larry at mountain stage dot org and of course we always see your comments on social media\nRemember if you missed part of the mountain stage or you want to hear something again visit the podcast section of mountain stage dot org each pockets include songs we don't have time for on the radio and our complete finale song take a moment to subscribe rate in review the show at apple podcast or wherever you like to listen\nOur special guest host for Tonight Show has a new album of laugh a minute stories called raised on who's water and later we're going to hear a tale from his latest book the princess and the pickup he's our champion liar let's welcome back Mr bill that [noise]\n\nOur next guest for the evening our group who bet on a mountain stage before they're called blue yonder I've known some of these people for quite some time and they're uh they're hard to pin\nDown Larry Gross just described them as a mix of virtuoso musicianship an original song writing that plays as well and a hipster coffeehouse as it does in a small town concert hall\nAnd Midwest record set of the trio unless somebody shows up real quick this bunch is gonna be crowned the new standard bearer of organic music folk country Americana hockey talk there is no corner that you can look at that this group doesn't do it right and righteously and I\nHave to admit that when I was putting the bio together I was thinking of them as a trio and not as a quaint yet but I like this park so I'm going to go with it any way\nWe can all list the great power trails of rock and roll but blue yonder spent so many genres of American music that this trio can best be described as the Nirvana up honky tonk the cream of country the rush of rockabilly the beach the boys of blue grass\n\nBeen to the\n[noise] who my memory homeland [noise] than a man that\nThe line you know\nStanding bad that the rules\nChange them back in ... [noise]\nHis mind the cold day [noise]\nStreaming support for WAMC comes from Albany med now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot EDU in my hair\nHoles when you get down with the fact that\nA baby ... baby road\nGreen like being in\nGreen beans\nAnd bringing my baby rose wound down\nMan literally been view the day they like to work the way they\nGreen beans and I've been in a row now\nDo green left David\nGreen Bay the\nCome in and then the other day and that we don't want to use but we forget about the people you think about the band\nGreen and I've read like bad road\nGreenland the\nGreen Bay the Green Bay road don't\n...\nDegree let me let bad role no no\nGreenland baby\nMy baby three let go\n\n\n\nLadies and gentlemen was blue yonder their new album is rough and ready heart [noise]\n\n\nI think there are walking out the door and had it on their way to Canada this very eighth inning so the people in Canada are going to have a good time I go up and you're listening to the mountains day\nTake a look at our website mountain stage a dot org there you'll find links to our podcast and you can follow us on just about every form of social media and of course we invite you to follow us to our next live show you can find out where we'll be and when\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu and mountain stage\nDot org\nBut we couldn't have built up here to host or show without asking him to give us a story after all he's nationally known storyteller\nHe's a five time winner of the west Virginia large gone to an earlier this year\nAt the annual ... gathering in Charleston West Virginia he received the two thousand and Eighteen ... award from the west Virginia division of culture and history his latest book is called the princess and the pickup let's welcome bill [noise]\n\nListen up y'all once there was a prince and he lived on a farm in mountain range you live on a farm on a Grange and\nHe wasn't just any friends he wasn't mountain friends and he wanted to get married but yeah I Want to marry just anybody who wanted to marry a real mountain princess so he said to his momma because there weren't any mountain princesses in the general vicinity so he said to his momma he still live\nWith his momma\nWhich might explain some things but anyway\nHe said to his mom and he said momma I Want to marry me a real mountain princess but the rain any around so I'm going to go out\nAnd I'm going to travel through all the mountain ranges of the world see if I Can't find me a real mountain princess so we set out and he hiked through the Himalayas any ascended the Alps and the Appalachians any cruise through the caucuses he roamed through the Rockies he went to this year I was looking\nFor ladies in the air as\nHe went to glass mountain looking for ladies with one shoe\nBut he couldn't find any real princess when he met a lot of ladies that said they were princesses but he wasn't sure that they were real princess is that they were probably fraud because let's face it you know princess costumes just aren't that expensive so\nHe went home and he was depressed and he said to his mom and he said momma I couldn't find no real mountain print stuff he said I did meet some frauds he said now I cast some of those frauds [noise]\nTo see if they would turn it into princesses and his mom and dad don't kiss fraud and\nNight it's terrible storm blew up there was wind and rain and snow and hail enlightening and in a hurricane and and as you know I mean and what not and in the midst of all of that\nThere was a knock at the door and the press wants to open the door and because this is a story when he opened the door there on the front porch good three beautiful prim prime princesses and he was so excited until they said trick or treat [noise]\nLearning is that in his field doing some work when he saw a woman walking down the road she she was wearing a calico dresses jihad hiking boots on her hair was in a mess and she walked up and she said howdy\nI'm a real mountain princess well he wasn't sure if she was a real mountain princess because he wasn't sure real princesses walked around and hiking boots with calico dresses and their hair and a mouse that she did have a stash that said mountain princess [noise]\nBut who knows right so he joined her home\nAnd he introduced it to his momma momma this year lady so she's a real mountain princess well the momma wasn't so you're either and so she said to the sun and this is where if you haven't already you'll figure out what their stories based on she said to her son she said I don't know if she has a real mountain princess or not we're going to have to test or\nHe she said here's what I Want you to do she said I Want you to take twelve mattresses\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu there'll be a pickup truck\nAnd when it comes time to go to bed will have that princess sleep up on top of those mattresses and if she don't notice that she's sleeping on a pickup truck\nWe all know that she's a real mountain princess\nOr were brainstorming should know better ideas he said [noise]\nHe's just a couple of issues one teaching house you not going to notice the pickup truck\nHe said you know I bought that pickup truck so princesses would notice make\nHow's that working out for you [noise]\nDust Russell and then\nThe friends that we ain't got real mattresses we got three of my address or an air mattress in one of those blow up wrap things and the mom and dad use what you got so depressed [noise]\nOf the pickup truck the mama put the dust rough lawn and that night\nWhen it came time for bed to print it well it's time for\nBed princess let me show you were your sleep and if I'm\nOut the front door\nUp this ladder\nOn top of this pile of mattresses\nNothing weird about that and so [noise]\nPrincess climbed up and she went to sleep and when she was good in his late the mama gave the keys to the truck to her son and she said now\nI Want you to get in the truck and I want you to drive around I Want you to go up bill and want you to go downhill I Want you to go on a windy road I Want you to go on bumpy road if you don't notice that your sleeping on a pickup truck if you don't wake up will know that she's a real mountain princess\nAnd the prince okay mama brainstorming no better he said but\nIf I hit a bump she's going to go flying often and he says you know she's going to be road\nKill and I don't want to marry a road kill princess now [noise]\nI don't know if you're aware of this but in the great state of West Virginia it is totally legal to eat road kill and so [noise]\nIn Marlin in West Virginia every year they have the roadkill cook off and I was part of that they have a beauty contest and some young woman gets named miss roadkill West Virginia [noise]\n\n\nStreaming support for WAMC comes from Albany met now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nNa na na me\nMan\n... na\nNa na\nNa na\nNa na happy and\nThe\nKnow the name\nNa na na\nNa na\nNa\nNa\nNa ve\nAnd\nThey pay\nLet me know\nNa na\nNa\nVe\n\nGets dumped me and then\nMovie and and why\nYou know not\nStreaming support for WAMC comes from Albany med now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\nNah\n\n[noise] you were\nWe live down next to she'll be in little town called cheery bill and that's Earl Scruggs country down they're done gives himself from Shelby\nWere proud to be from down there as well we know from you your meals North Carolina this pretty young fiddle player we'd go with us tonight and she's been with this all going on for years and we're very proud of her she won the IBM a momentum award last year for instrumental to the year I currently work\n[noise] for him to Benjamin the\nDude ... plays just about everything in the book you know he's been a lot of great bands down through the years I Believe you on the stage with Cadillac Sky many years ago one of my favorite bands and uh he's just a great personnel wear around and one of the best musicians up shared the stage with ... minutes the everybody\n[noise] but I\nFaith in ... North Carolina we traveled immigrate group called Charlie well in the country gentleman row you bluegrass fans out there [noise] similar to a long time and that's Billie Jean back here on the\nBase [noise] it'll bring up around the number\nOne for us a couple of years back it's a great ... he's been on stage here as well and uh\nShe does wonderful job when everything's coming up I'm ... years of marriage and that's\nBeen one for blood [noise] and it got to live in there\nAnd currently ms Brooke here's your may female vote most of the year y'all get put your hands together from\nUs [noise]\nNo\nNo I mean\n\n\n\nWell man\nStreaming support for WAMC comes from Albany med now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu Cindy\n\n\nEvery every single\n\nDay you\n\nCan\nWe\nThink we do\nStreaming support for WAMC comes from Albany med now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu and\nMay pay or you\nYeah the\nThe game then had\nDo a\nMan\nMan\nStay van na\nNa na na na all\n\nWho's the\nCreepy na\n\n[noise]\nCut is Darren ... all through this year the ban is nominated for the best gospel performance\nAnd she is of course the number one vocalist [noise]\nIt's [noise]\nThis is bill lap and you're listening to mountains they live performance radio from the mountain spate of West Virginia [noise]\n\nMajor funding for mountain stages provided by Bailey in Glasser L O P A nationwide law firm born in West Virginia with officers in Charleston Morgantown wheeling in St Louis D.C Boston Alabama Florida and Delaware details at Bailey Glasser dot com\nAnd by the west Virginia tourism office there are places you visit and places you'd be hold you'll find natural wonders and enlisted experiences in the mountains state West Virginia a place that almost seven more information at W. V. tourism dot com\nAdditional support is provided by hip historic Charleston West Virginia you'll find live music seven nights a week in West Virginia is capital city it's music from the hip your adventures starts on line at Charleston at W. V. dot com\nYou're listening to mountain stage on NPR\nOh [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n[noise]\n\n[noise]\n[noise] you can hear mountain stage performances including songs not heard on the radio broadcast at NPR Music the online address is NPR dot org slash mountain stage\nNow back to our special guest host whose latest book is an illustrated children's tale called the princess and the pickup truck let's welcome back Mr ... [noise]\n\nWe're going to end this shown a special way God ... was born in South Charleston West Virginia\nAnd she has gone on to international fame as a multi genres singer and musician she left West Virginia early in our life to go to Nashville to pursue her dreams of wage you're saying [noise]\nAnd being a tour guide at the music hall is the country music hall of fame nobody noticed jobs just didn't pan out she had to settle for being a two time Grammy women winning and multi hit recording artist she has more top ten hits than there are slots on a top ten list\nLatest album pretty bird is a self acknowledge head first plunge into finding a new voice and the journey of adapting to the changes life present so is the fact that Kathy ... is a country star is impressive\nThe fact that she is willing to create music that is entertaining culturally relevant self aware and pays attention to the plight of everyday people facing everyday problems is lotta Tory\n... when we sing together it doesn't matter who you are or where you're from or who you voted for Raul having the same experience and expressing ourselves in the same way and that's where I Want to plan my flag right now please welcome back to the mountain stage miss Cathy ...\n[noise]\nGranted [noise]\nGreat to be back so this we're going to do some news on where you from a record that comes out in a few weeks in September and um I got to these songs sitting in my living room with Bill this is bill ... who's played with me for twenty eight years standing next to him\n\nAnd when it came time to make this record I woke up at three o'clock in the morning when night and thought I Need to call Tim O'Brien that you I Need to make this record with and I called him and said would you produced this record and he said yes so we just finished having a black in the studio and out these some of the songs that we came out\n[noise] who said the wounds on Mount joy Mm Mm Mm\nMm\nMm\nNo I didn't even\nDreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu literal\nOn and on and ... you know we there's really no\nBoot in Reno\nHidden in the pot and\nThey began that\nI mean well you must do a lot on TV and I both good and I'm reading and he's in\nBoot in Reno 'cause\n... chocolate no no no no no telling\nThese dark chocolate on\nMy ... year\nOld man\nMan for the good well on my mind my\nYour movie all him in and that the brooding no reading even began\nGood in\nYou leave at ...\nJokes jumped all\nTell I had ...\n...\nAnd you have in church this thing go buy a\nYoung three different jobs\nHer own something ...\n\nMm really ... the news the ... billion to\n... the weatherman Becky ... the body stores to open\n...\nThey don't\nA hot spring ... ... ...\n... doesn't seem to\nFor me I've spent\nThinking flower shop on job job ... ...\n... ... ... ... ... ... ... ...\n... ... a job and then the money a lot of ... Rob ... ... ...\n\nDreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n... um [noise]\nI\n[noise]\nNobody does the retro spooky guitar like you do Michael [laughter] awesome\n... [noise]\nSo when we started to work on what turned out to be his album it wasn't really a ... I didn't think it would I didn't think it would have anything to do is make an album [noise] um and and what happened was when I when I sort of got my way through menopause um yeah I Know it's hard to believe isn't it was all this gray hair that ah [noise]\nUm [noise] I I've noticed that my voice started changing and I didn't know what to do about it and I had this ten minute conversation many many years ago with Tony Bennett I wound up in a room with Tony minute and we were alone for five minutes and it was the most amazing thing and I said look I Need to ask your question\nI heard you sing tonight and I know how old you are\nHow did you do that\nAnd um I saw him last year have Ninety he blew my freaking mind\nBut he just smiled and it was very gracious and he said well my voices on what it once was but it's a lot better than it was a couple of years ago you said I found a teacher and I started working again\nSo I did the very same thing I thought if Tony Bennett can do it in the seventies I can do it in my fifties and I went and found a teacher and I dug in and these are the songs that sort of brought me back to singing I Would go practice with my teacher all week and then building I Would sit on Thursday and we would sing to these crazy songs that I Would bring in\nAnd I walked in one day and I said bill I I've been listening to this song over and over and over again and it's been given me so much comfort\nAnd I don't know if I'll ever be able to sing the song but I think I'd like to try and so we kinda worked at ... and we started messing around with it in one day he looked at me he said yeah I think you're right Cathy you don't really have any business singing a song and\nFries [noise]\nAnd I was like yeah I I think you're right so we put it on the shelf for a while and then one day a couple of months later I said let's pull that time back out again and\nAnd I I ... and he said I don't know what happened but you got it like really said yeah we sang for a couple of more is that an article I gained like still there so uh we've been doing it ever since and this is this is just I'm a beautiful because just like this was written by a dear friend of mine in national who's a songwriter songwriter\nAnd this is sort of her masterpiece\nUm\nMm Mm\nMm Mm\nMm Mm\nYou know Mm Mm\nMm Mm new rules which is really going\nBall in Iraq is Loni on the ground I'm\n... ...\n... the heat is\nYou know no in the middle one man\n...\n... ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot E. D. you know\n... ...\n... ... ... ...\n...\n... ...\nStrange have you read the ...\nTo ... ...\n...\n... ... ...\nIn the pain that is nice to\nMeet those living\nThe ... ...\nHe gives you some\nLot of my country\nGonna take forever ...\nDay they give you\nHim do reach toward not I'm much\nPeople are and how\nNeed to keep the fact\nSome ...\nMm", "year": "2018", "show_name": "Mountain Stage", "city": "Albany", "day": "09"}