{"month": "10", "state": "NY", "station": "WRUR", "content": "Me no oh no yeah [noise]\n\n[noise] Mm avenue on my\n...\nNo no no no\nNo [noise]\nNo I\nKnow\nI gave him ... ...\n... ...\n...\n\nNo no\nNo\nNo\n\nNo I maybe\nMm Mm Mm\nMm Mm Mm Mm\nMm Mm\nNo ... there is true yeah right\nInto the ball yours yeah\nRoger are protected ... no no mercy in your ... no ... no no no no there's water law\nNot doorway you talk\nTo you know\nYour questions directions Mm knowing that does get ...\nThe one of us have just been ... days or no maybe we'll get forty years together\nOne yeah the go and then they you know we\nWill and fires in their lives you know we do out on the sidewalk and know labs\nYou know ... I wouldn't feel the need ... yeah maybe ... yeah you\nKnow were hard to ... yeah she is\nGive you the second ... no ... knowing that there's no ... Mm\nI mean one of us who have this man some days ago maybe we'll get forty years together in\nOne day I'll be gone one day you know\nMm Mm [noise]\n\nMm Mm\nNo no no there's no ... Mm largely in one of\nHave this man's knees or no maybe we'll get forty years the gas\nIn the morning yeah ... ... ...\n... ...\nMm no\n\nThere's nothing at all scary about that song it says sweet sweet love song from Jason is bowl and the four hundred unit if we were ... from their recording the Nashville sound you heard about the St Marie telling a tale from long ago it's called the vampire\nAnd vampire girl that's buddy Miller a gym Lauderdale today on so Kelly\nMore music for the season nine plus hours of music about ghost which is a goblins vampires it's our annual screen stream at ... dot com and tune in on Alexa ed on our mobile apps check it out\nAnd happy Halloween I'm Alina the and this is ...\n... this week when you get stuck in the military you can hear a lot of regressions two years where we started one end of the spectrum in work our way back when you're at a time like we do it over and over really wants to we move forward\nYou learn new artist sets either through their usual show this time around that's this week's ducking a psychedelic here with\n\nThis evening at ten on different radio\n[noise] do well by doing good become an underwriter to learn more about connecting your business or different radio audience send an email to underwrite W. R. U. R. got was\nWas a member supported public radio double you are you are ... Rochester\nYou can also go public online at W. R. U. R. dot org\n...\n... ... ...\nGood morning you love them to a variety of folk a programmer recorded folk music\nThat we bring to you every Saturday morning at this time\nThis is rebound learn I'll be ready for the next two hours\nThis is double you are you worried that diminish the Rochester\nW. I. G. A. just for the next day what is good to have been ready to start our show today we a pity Casey this is down from Canada [laughter]\nI come\nAh\nLong a lead I was young\nDown from Canada a\nThing you stand on in the way\nCalled any I\n...\nWay her ... her but\nShe was ... when\nDaughter and she will go\nChristmas but seeing her son ...\nYears of spills stars\n...\nLaw\nDream St Bernard\nHere's a bitter and I\nSon who's ... home\nNews she\n\nThan that I wrote to know\nThe ... the boom and spend a lot\nOf the world's ... for a young man like\n... years nine key ... no no\n\nAgain ... ... ... then\nThe the ... we really have been there in Maine um my\nThere and do\n... the the life\nAnd be though it's been many net T ...\nCann and ...\nAnd I think you guys\nNapping green during the during\nIs a great\nHere then again\nThirty began\nMillion dollars no means no more\nA long drawn to coming to this ...\nThe show in there\nShoes and then you\nThe ...\nOn my hands your adult brains\nAnd never ...\nIs changing grammar\nAnd thirty and\nThe letting them do their mom and dad and now\n... ... ... ...\n... ...\nDairy and\n... ... ... ... ... ... ... ... ...\n\n...\n... ...\nNext we hit Bob Conley the Portland collegial\n\nRanger to city and my\nMan the other night and movies\n\nThe ... the\n... the\nJob on the\nI'm showing\nMy goals Leno\nOr are they all\nAll the ... ...\nRichest heard the river leave by did builder you before the rock hall breeze Dylan before the the Portland Tony ... you're listening to double you are you wearing double your wife he shoots the shows are ready for the times eight thirty five\n... Charlie Cook little desserts lower ...\n... ... ... where have you got you know by the desert [noise] ...\nI Want to hold you want to get um\n[noise] ...\nI Wonder can you survive by the north the age of ... ... when you were about just the drop All right\n[noise] you know where have you got to know my dessert um wherever you're a ... lower\n\nYour blood of ...\nDown in my book\nAnd I hope you ... your way back ...\n... ... ...\nWaiting for you Bob ... and ... these\nGuys are ... can be so\nCold [noise] Mm\n[noise] where have you got to know my daughter does your um [noise]\n[noise] I Want to hold you good\n[noise] [noise]\n[noise] I Wonder can use to buy my hope the north east you know when you ... just to drop ... right\n... ... ... ... ... ... waiting for you my ... my dog owners\nOf these guys are not can be\nSo ...\n... where have you got to you know ... ... ... ...\n...\nNow and she ...\n...\nAnd we ...\nWe you know\n\n\nTo ...\n...\nNa\nStay out late fees\nAnd he was\nMean is ...\nReno\nThen and now\nTo the gene why no\nNa\nMan on\nThe un\nNa\nNa\n\nThey hang on a shining\n\n\n... it's been the January\nReally know Blake\nLa la\n\nLa\nThat was\nThe\nAnd the way I'm\nA\nI'm a I'm a ... that well I'm a\nYeah ...\nYeah I'm\nA\nI'm a I'm a\n... ...\n[noise] ...\nUm ...\n\nNa na na\nNa\nNa na na na na na\nNa\nNa\n...\nWe just heard degree funnel lined by the window and singers and they will be in Rochester tonight for a golden ... taking place at the Rochester Christian for church and it led to get a new mom afternoon at ... pm they will be in Corning for bally focus you're\nTaking place at the red brick church it was forty four seat or a street before when born we heard the shipyard slips like here in D.C a judge to oil\nHere before that we heard every day we sail around the world that you'll be greasy Kirby this is W where are you worried that diminish the Rochester is doubled you write th at the ... you wouldn't you take a different radio\n\n... no\n\n...\n[noise] Mm [noise]\n\nMm\nMm\nMm\nUpon or leave she read today ...\n\n...\nBrands were still on fire\nNeal\nTheir horns were black and shiny and their\nThis is\nA [noise]\nTheir ...\nSarah\nHard to track her Sunday caught off\n\nYour eye on\nOr near their ...\nAnd\n[noise] I Try\n\nMe\n\n[noise]\n\n[noise]\nMan [noise] [noise]\n\n\n... [noise]\n[noise]\n[noise]\n... ...\n\n...\n\n\n\n\n[noise]\n\n\n\n\nUh\n\n\n\n\n\n\n\nNa na\nNa na\nNa na\nNa\n... who ... nobody can\nBe home church a playground\nV it's not in line and\nIn any ... you know one of the ... you\nHim and\nHis or at least ...\nJump around and\nRich enough well again\nYou\nHe's a crazy times man\nWhen money and power range where we jak or\nTry to real famous game but you can buy\nStreet [laughter] when I can say a gallon because there are some of the ... you get\nHim you can't deny\nMan\n\n...\nBring na na na\n\nMm\nMm Mm Mm\nMm Mm\nShe knew but on streams one that should\nDown on one way to do she's not\nTo leave things then we found ... Cheney\n\nMan 'cause it was written at least\n...\nYou know for us and we do\nOh\nYou get\nFrench still\nNa na na\n... and\n\n\n...\n\nAlso like to do it on all again do create that the judge whether more willing to Trump like to be a\n\n... a word I can try to make up all this is my ... when I Am old but to take that like the day care\nBut I can do but I Do I Do the yeah the yeah\n\nWill be\n\nAbove thing I had to do that I can do I get Lou that is a God and\nAll that can be be who I Will I Am a brand new two dollar bill when I Am a little bit more real ball like could be used to be who ...\n\nWho ...\n... what can you do what I like to create the jobs where they are more willing to Trump all like to create ... jobs\nWhere the boat and they're all like in the day care when I Am a ... like to be your be who I Will wear the low but new Willie ... all like to create\nAnd the Joe ... Joe ... Joe ...\n\n... ... ... ...\nOh sorry\nOh I'm\n\n\n...\nNon\nNa\nNa na na\nNa na na\nNa na\nNa again\nNo no ... ... ... in\nThe room oh man Mm\n\nNo no no no\nYour friends\nNow\n\nOh\nMan na na na\nNo\nWell you know more than\n...\n...\n\n\n\n\nWell\nYou're listening to double the white th W where are you aware of the times nine twenty to\nResist true bound to the living but current and west before that create the just by David Roth before the price on the other by Susan she looks to me at a true but at the Scottish group guys this is called the king\n[noise] [noise]\nEver be in\n\nDownloading mine has no money the young\nIn the game the\nIn the game by my\nWe just heard winter sun by Nikki Haley\nBefore that the locked inside the gas\nAnd before that the king Buddy Guy you're listening to\nDoubled you weren't you weren't W. I. T. H. shows a variety of all\nThe time is Ninety three sides up next to me it Maria done followed by Joe jinx they will be trying to get the next year with cancers in Rochester in corny you may first up we had the good dreams they have you done\n[noise] my shopping why would it be\nShould be your ... your mind to be to do to get out of among those new\nTo me to really when\nYou don't need a young\nMan named ...\nWhen you say\nTo sweat shop but then we're going to change so happened on some beach to ... you know giving yourself the money to me from being a better\nThat work then\nYou\nWhile you can you tell me I'm not\nReally New York but in your own home\nWith me\n\n[noise]\n[noise] [noise]\n\n\n\nKeeping young man in\nBrett I'm\n\nPlanning to go\n... deliverance no pension and into the young men are tiny ...\nYou get back to New York well\nNew to me\nLast year when the G\n... kind of general the dog\nAnd the money\nIn your family in\n\nShoes my\nBread and you're going in and you can be\nA man\n\n...\n... ... ...\nMm Mm\nDo you do remember though you're not in every ... walking home so we ... up the children I'm the liberal about you and\nYour ... this country are so stranger I Am ... wage the view we're supposed to vary in my ... buying\nThe stranger in those ...\nTo teach your children how they have come soon\n\nWho's a ... ...\nJobs were bringing in their\nBrain and I'm sure you know during the nine or\n... ...\n... where it's a very thin line\n... ... I'm a stranger written this flag\n\n... to read from hunger um goes from Ron\n... Israel's\nPlaying ...\nOr you start to judge them random you\nKnow I'm reminded marathons\nYou dream you rather strange or\nYou were to seriously lying then nine dollars were involved are even stranger and then there's ...\nYou were saying why\nReally are even stranger\nI Am a stranger and there's ... ... ...\n\n...\n... ... ...\n\n... ... ... with your heart yeah\nNone of the ... neither is ... na\nYour take on New York right now\nBut you know whatever like he made\nClear your mind you he\nLied and na\nNa na na\nNa want a ... ...", "show_name": "A Variety of Folk", "year": "2018", "city": "Rochester", "day": "27"}