{"month": "10", "state": "NH", "station": "WEVN", "content": "Lynne Cohen here on the folks show in New Hampshire Public radio he's got to show coming up over at the Portsmouth look and bar on friday October twenty six\nDoes at our calendar for more information also in that set eared rod McDonald from the album songs of freedom with election night at Walmart\nSupport for an H. P. R. comes from you our listeners and then your brand supporters of wolf trap the red mind blend from South Africa's Cape of good hope\nAvailable in New Hampshire and down the ... then you're brands dot com slash wolf trap\nAnd Portsmouth back company local and independent bath and kitchen sales chat rooms specializing in helping contractors designers and homeowners with refreshing ideas Portsmouth bat CEO dot com it's got news on the way from NPR\nYoure listening to the fold show I W review conquered Manchester eighty nine point one\nW ... eighty eight point three tippy levy age hen over Ninety One point three W. E. D. N. keen Ninety point seven WABC Gore on one of seven point one W E v J Jackson Ninety nine point five\n... too little too many one point nine\nNew Hampshire public radio on line I mean to be or ... or\nLive from Culver City California I'm Janine hers\nFour days after hurricane Michael slammed into the Florida Panhandle search and rescue crews are still combing through rubble searching for survivors and emergency crews are delivering badly needed aid interest Quil Lawrence reports it's unclear exactly how many people have died there\nWithout cell phones and landlines were electricity communication between family and friends in local government has been slow in the town of Mexico beach fire chief Joe says Robin is leading a search team working for about two hundred people who had told local police they plan to stay but he's not sure they did\nTo stone ramped up so quickly it wouldn't surprise us if a lot of people get scared and ended up evacuating\nThat's his hope because looking around Mexico beach in Panama City with entire blocks of houses leveled it's hard to imagine how anyone who did stay survived and authorities fear that the death toll rises the search continues for Lawrence NPR News Miramar Beach Florida\nAnd the authorities say so far the official death toll stands at at least Fifteen people\nAre looking senators Jeff Flake and Marco Rubio are threatening tough action by Congress against Saudi Arabia if it is determined that missing journalist ... was killed inside the Saudi conflict in assemble including a possible health of arms sales\nRubio tells CNN's State of the union the U.S has to get to the bottom of what happened\nI'm not prepared to pass judgment on something I don't know for a hundred percent certainty but I can tell you he walked into the consulate and we're not seeing them come out\nAnd if he's not alive than it is the Saudis are would know what happens\nPresident Trump earlier pledged unspecified severe punishment and a CBS sixty minutes interview but he also says he doesn't want to stop the proposed one hundred ten billion dollars in arms sales to Saudi Arabia because he says it would harm us manufacturers\nLast minute talks before this weekend's rags it's some it failed to lead to a breakthrough between the United kingdom and the European Union as NPR's Frank Langfitt reports from London either side can agree on how to avoid a hard border on the island of Ireland\nRecord secretary Dominic Rob suddenly flew to Brussels raising hopes a deal within sight but afterwards you negotiator Michel ... said despite intense efforts some key issues are still open to what a horror border the use proposed keeping Northern Ireland inside the customs\nIt because it was separate Northern Ireland from Great Britain effectively creating an international border inside the United kingdom another's illusion temporarily keeping all of the United kingdom inside customs area is enraged breakfast tears\nWho say would prevent the countries in striking new trade deals for no no talks are scheduled until the EU's summit which begins Wednesday Frank Langfitt NPR News London\nAsian markets are trading and mix territory at this hour the Asia dollars down about three tenths of a percent you're listening to NPR News\nIn Germany conservatives allied with chancellor on glee America will have been dealt a major loss after elections today in the state of Bavaria from Berlin NPR psoriasis Heidi Nelson reports a far right party has benefited from voter anger\nIt's the first time in decades at the Christian social union or see a few is losing its majority rule in Bavaria\nThe reason was a protest vote linked to anger over Muslim migration to Germany German public broadcaster A. R. D. estimated a hundred and eighty thousand former C. su voters cast ballots for the far right alternative for Germany but not every frustrated Bavarian voter turned right\nThe second biggest winner was a left leaning environmentalist Green Party to see his use expected to partner with that party or with the liberal free Democrats in a conservative coalition called the free voters that way to see is you can continue to govern Germany's most prosperous state\nPsoriasis or how to Nelson NPR News Berlin\nThis week Canada will become the second country and by far the biggest to legalize recreational use of marijuana sales start this Wednesday when more than one hundred license pot shops are expected to open\nOr a guy is the only other nation was legal recreational marijuana and nine states in the U.S also allow it\nBut those who cross between Canada and the U.S before warned U.S officials say you can't carry marijuana between the two countries the U.S customs and border patrol is reminding people that the federal government still considers pot a schedule one drug and taking it between the countries is prohibited\nI'm Janine hurts NPR News Culver City California\nSupport for NPR comes from NPR stations other contributors include the Walton family foundation where opportunity takes root more information is available at Walton family foundation dot org and the John D and Catherine T MacArthur Foundation max bound dot org\nThis is the folk show at New Hampshire public radio\nOr to [noise] take all the rage played here [noise] Doc Watson [noise]\n\nHave you know but you don't I mean they played something like well we played before you know everybody knows about the record or music you know as part of that I like that stuff a lot but there's another part of the music that people don't play much and\nWe'll probably some for you and it's like a ... like beautiful spooky Walters fillers especially loved to play those things may when the audience has gone there just fillers musicians round they'll play these walls is all night\nBut they don't play among hall so a lot of people don't even know this part of it you know body music\nCalled ... [noise]\n[noise]\nUm\n\n\n\n\nDo\nA better\nTo\n\nThink\n\n\nHaven't\nBeen in\n\nTo another strange rich\nI'll be ...\n... to\n... to ... ...\nWhere we live we don't\nDo that we ...\nLady on the um\n[noise]\n... ... ...\n... ...\nI went to the you know where you're not to be around\nI went to the new hammering on\nHow bad and the you know well it's good I mean\nWell me I don't\nKnow do well for the whole\nKnow what else to me that ... you\nKnow how bad it was very good I mean\nWas no one to\nSay well gloomy all\nTime when the spring he didn't play\nNine why there is no\nWay he thinks he\nCan why it's so sad to see\nThe way they were\nThere to well then you\nKnow\nDo well does the\nWell to\nMe\nThat how do we know boy good athlete\nThere was no\nWell me I\nKnow\nWell let me\nKnow well he\nMay be and he\nHas now me\nWell me [noise]\nFrom from the ...\nBig makes me go get ...\nBelieve is never get married then\nWhen you guys know them or during the\nLord and iron ore money\nDrew the bone debate you know the murder game early in\nThe ship for the ... the ... and I'm going back to some emails and middle income\nBurning in terms of the deal\nWhen they left alone\nLater\nThey get\nHe was raised\nThe baseball game when\nJamil\nMan we gave the\nIn life\nSupport for any shipyards life's dream comes from you our members and from the law firm of or in Reno sustained excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges\nFind out how or in Reno can help you online at or dash Reno dot com\nWould\nArmy [noise]\nIn the room rubber a water\nThe only three days are over\nFarther we're going to\nDo what do they ...\n\nThe root\nChurch right what he learned\nImagine\nNever do\nAll rely early in the ...\nDream then\nLiar when they don't turn\nTheir own but they\nAnd\nMy ... in a\nBang\nHere with\nI Need Iowa that oh I'm In van\n...\nAre we I\nIn the rubble all the\n\nName in\nThe beginning\nChance to see\n\nNa na never\nReally was I Am a change in Washington oh\nIn not only\nA\n\nSometimes when you think the\nKnow the any you\nWhen the plane\nWe see\nMe\nNever never\nSo we began to change\nThe\n[noise]\nHoney [noise]\n\nOf the doubt\nNever down the street I feel shame washing\nNormally [noise]\n\nThen we speak swings ever do the name of that two in here on the folks show at New Hampshire public radio from their album called wing it was your patties lament from that Jordan TWA trio from the album live at cedar house\nWay back their cat the ... and October song let's see ... is going to be over at the colonial theater in Keene at eight o'clock on Saturday the twentieth\nAnd you're going to find the Jordan T W trio in concert is well can visit our calendar to find out about their show that's coming up is it\nAn H. P. R. dot O. R. G. for a\nPeek at all of the shows that are happening including the Jordan T W trio appearance with Jeff Warner and lives in ... and the holy rollers there the harvest music festival and shake her village in Canterbury on the twentieth that's from four until nine\nVisit shakers dot org or visit an H. P. R. dot O. R. G. for more information about the calendar items\nNext week on the exchange housing tourism an era being be the growing impact on my property rental service here in the Granite State then our mid term election coverage continue with our foreign featuring the Republican and democratic nominees for the second congressional district and later bears Turkey's moved north we sit down there\nSend email before the show to exchange it any clearer dot org and joined ... every morning at nine and to get at seven pm on any PR\nSupport brand H. P. R. comes from you our listeners and the New Hampshire women's foundation fourteenth annual women building community lunch in October twenty third in Manchester with special guest Tiffany do flew an H women's foundation dot org ... regional visiting nurse association hospice lights of life\nCelebrating its twenty third year raising awareness and the community details at C. R. D. N. A.\nDot org and the next hour will be given away tickets for the ... the third David Brown bird show that's going on so if you want to win some tickets for the show happening on the twenty seventh over the flying monkey\nIt just hang out with us boy I sure do hope you're keeping warm and cozy this evening and I\nSure am grateful that you're joining us scared any PR\n\nNo no\nGet a loan\nMaine and\nDay\nA way\n\nGive me a moment\nAnd\nSupport for H. P. R. comes from you our listeners and from you in ages MBA programs fulltime online in part time in Durham and Manchester information session October seventeenth details and application it N. B. A. dot U. N. H. dot edu\nAnd pine points financial offering financial end retirement planning advice for individuals and families upon incomes\nGetting their needs of road map information at pine point financial dot com or forecast calling for some clouds tonight Louis in the thirties\nRain likely tomorrow its highest in the fifties still cloudy and rainy tomorrow night with temperatures in the thirties and then Tuesday partly cloudy and windy with ties during the day in the upper forties\nAnd overnight temperatures in the thirties\nWe've got news on the way from NPR\nYou're listening to the fold show I W review conquered Manchester eighty nine point one\nW EDS nationally eighty eight point three ... levy age hen over Ninety One point three W. E. D. N. keen Ninety point seven Wu si Gore on one on seven point one\nW E v J Jackson Ninety nine point five\nAnd didn't even too little to Ninety One point nine\nNew Hampshire's public radio on line to be or don't or\nLive from NPR News in Culver City California Hi Janine hurts Saudi Arabia is vowing to hit back hard if the U.S slaps it with economic sanctions as NPR solid wire reports the threat marks a new chapter in a diplomatic crisis over the disappearance and suspected murder of a Saudi journalist\nPresident Trump has warned that Saudi Arabia will face consequences if it does ... suspected murder this is Trump on CBS or sixty minutes we're going to have to seize\nWe're going to get to the bottom of it and there will be severe punishment\nSaudi authorities didn't take long to answer where the morning of their own or government official pulled the kingdom state run news agency but they totally reject any diplomatic threats according to the official quote if Saudi Arabia received any action will respond with greater action and the Saudis said the widespread allegations of murder\nStill they have yet to offer any official information about the whereabouts of been missing journalist college wire MPR news\nAnd Egypt Today called for a transparent investigation into ... a death\nSomalia is marking the anniversary of the deadliest single terrorist attack in its history a bombing in the center of Mogadishu that killed nearly six hundred people a year ago ceremonies were held across the country and many gathered at a new memorials commemorating the date with a moment of silence the man convicted of coordinating the attack last year was executed\nEmotions are still raw in a country that's face decades of deadly chaos and attacks by the al Shabaab extremist group every few weeks of bomb explodes somewhere in the country and despite tight security al Shabaab has been able to continue detonating bombs inside the capital city\nFour days after hurricane Michael utility crews are working to restore electricity to customers from the Florida Panhandle to Virginia warning some they can be without power for weeks NPR's Jeff Brady reports Michael is the latest of several weather events that are prompting new efforts to make the nation's power grid more resilient\nAfter big storms the question always comes up why not put the wires underground where there'll be protected from the elements Julie ... an energy analyst at union of Concerned Scientists\nWant ... ... it can actually be much more ... and take like right now and ... and an overhead wire\n... flood prone areas that can make more sense to elevate grid infrastructure one thing McNamara would like to see more of is independent micro grids at places like hospitals and facilities where residents can't easily evacuate Jeff Brady NPR News\nAt least Fifteen deaths are being blamed on the storm and rescue crews continue to search the rubble in Florida for survivors may well FEMA chief Brock Long calls the damage some of the worst he's ever seen he toured several towns in Florida's panhandle today was governor Rick Scott\nYou're listening to NPR News from Culver City California me\nA second space telescope has entered safe mode and halted science observations run and burn from member station W. M. F. E. report it comes shortly after the Hubble Space telescope shut down\nThe Chandra X ray observatory went off line less than a week after Hubble Nassar says the telescope went into so called safe mode possibly because of a gyroscope problem\nSafe mode is automatically activated to protect the spacecraft if it's computers think there might be a technical problem the telescope uses a set of gyroscope to help navigate and studied a spacecraft\nHubble went off wind due to a similar issue both orbiting observatories are old and in will extend and missions Hubble is twenty eight wild Chandra is Nineteen white controllers are working to assume operations with both Nassar says it's just a coincidence both shut down so close together for NPR News I'm Brendan Byrne\nThe former chairman of eight off ... corps has died they'll course was also the grandson of the brewing company's founder he started his career with the company in Nineteen thirty nine and was chairman from Nineteen fifty nine through two thousand helping at grow from a regional brewer into one of the world's largest\nAlso served as an official taste tester for the company will of course was one hundred two years old\nAt the weekend box office the comic book film that Im continues to defy poor reviews and its second weekend in theaters with an estimated thirty five million dollars in ticket sales but that's down fifty six percent from its first weekend\nThe Sony Pictures film has earned one hundred forty two million dollars to date from North American theaters in second place a star is born with twenty eight million I'm Janine hurts NPR News Culver City California\nSupport for NPR comes from NPR stations other contributors include\nAnd the state of junk rock who's ... served as an enduring investment in the future of public radio and the Robert Wood Johnson Foundation and R. W. J. yeah this is the talk show in New Hampshire Public radio\n\n\n... you know what's going to be a long time to watch one of\nThese free or die\nState by your side or will be with you for the whole damn right will it looks like in my the crime will follow you the\n[noise] and it looks like it might be hard road but I'm going to walk\nWe you and I know you might have a heavy you know but I can carry some\nWhen push you down now will raise my voice stand my ground where it looks like it ... the heart grow\nFonder while we do [noise] um ... we use the yeah I Know no well we do\nHave\nA car and shot by\nThe ... because it looks\nLike it might be hard road I don't know well okay we use to\n[noise]\n[noise]\n[noise] [noise]\n\nOr no man\nGot my we had good Lola see you're asking me more\nAnd better block\nOr I can do smart boarding or\nJudges rarely boy\nEver men no harm\nIn my day to make you wages out on the margins are you\nKnow we ... we do not twisted my arm [noise]\nIt's all die I'm old out here and we look cut you happen to the man I didn't know\nBio ... to my new [noise] Mm I live off by skull rainbows to\nAll be begins by [noise]\nWith no ... no I Do the ladies in Jane playing great work is through the nice\nGoal and let you know do they lack in July [noise]\nDo mystery or a no man go away from my door\nMy we can do to see the rise getting me some more [noise]\nBetter live or or do smart Gordy or\nBetter life for a ... or ... or\n\n...\nYears the story about to turn into many friends humpback whale Leno mountain lion hope you are the good imagination case you don't hear how we really had\nShe was walking down the ocean side has been slow listening to the point you know did you learn today great they\nCan watch the show she went out and he came back he was right up and he's been around any breach the clear blue are you today\nIs a fine line is that in the ... the man you know no way to\nGo on a leash law actually there have been saying\n\nHere's another story two more friends they might have been a while we were young when you move on his first major you know why is all on her way\nFor the\nWhat do you reach to any ... that lives on although hanging over and just to let me on her name alone\nTo do much to learn a song and no no the people who knows the flash they laugh then they said why didn't they dance to it I have a job on\nThe line with modern hills and valleys open the door or just you know on the line now they're all\nGoing and going on and meet your very best friend and you might be in the street with President Johnson\nWas on the beach wonders drumming germinate your right not the same time you say ... you see signs up by\n... I Love the ups and um of this whole thing\n[laughter] [noise] yeah we ... we don't know when we're on me do you actually were made on the very best friend\n... [noise]\n... ... ...\n... ... ... ... ... ... ... ... ... ... ... ...\n... ... ...\n... years ... ...\n... ... ... ...\nJake me Ron this\nI'm and\nA\nReally nice then nah\nMe you\nKnow not be the same ... the\n... or during the ... Mm\nOh God\nThe\nDa\nNa ...\nEat and then he had done no you\nKnow they show law and a man named\nNo\nWas in\nA\nYear old ...\n... ... ...\n\nSupport for an HP ours live stream comes from you our members and from the law firm of or in Reno sustain excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges\nFind out how or in Reno can help you on line at or dash Reno dot com\nMm have you seen\nRight right um [noise]\nNo they just say\nI Know that you are or do\nYou have to use it to see\nI don't want to drive the way they used to be your heart in rural yeah mine is only ...\nJust stand up\nJewish and\nOne had cancer that strain bleeding from\n\nThe ... and I walk just who I don't know if I die does come and so\nWays about it\nThe brain say\nIs this is my last day on they were\nOut they are saying\nAbout the ah the thing\nAbout the main door oh that is ...\nWhat do you own or\nDo you this is my\nLast day on the other\nThing I let him\nOut they are today ... women were\nIn the ... land owners\nThat do go on the\nLine [noise]\nThat oh well\nThen it uh well\nI'll tell you guys live moral that it will\nBe buying a inland they own\n[noise] [noise]\n[noise]\n\n... ... ... illness or\nAbout the\nAbout the uh\nThe guy for a little role but it was were the\n... the last day all under\n... ... ... ... who had gone to the one that I noticed that a wheel than that I when they live ball rolling it was\nA last day on her\n[noise]\nDo you ... ... ah ... the ...\nRaised\nBy my boys role\nModel a alerts do you own or\nAbout to go on through the\nRock ... roll would if I were\nA little over\n... ah we live we [noise]\nGo blow\nAll the\nAll the young or old wood is what we're [noise]\n... ah alert the owner of the\nVote to be one student to stay off\nThe wall and all the whole roll would it was [noise]\n... ah over\nOver the role of that it was\nA\n\nLaw a mom I'm ...\n\nI'm\nIn a sense of humor he has that David Ross on the folks show at New Hampshire public radio\nBrand new album must stay on this earth that's the title track\nYour Brooks Williams spend the album lucky star with bright sided the blues that's my kind of guy bright side of the blues and way back there you know you heard that Latin Wainwright the third doing the Richard Thompson drunk down where the drunk or to roll\nThis is the folks show at New Hampshire public radio\nNext week on the exchange housing tourism an era being beat the grilling impacted this online property rental service here in the Granite State then our mid term election coverage continue with our foreign featuring the Republican and democratic\nNominees for the second congressional district and later bears Turkey's moved north we sit down with fish and game executive director Len doormen do send email before the show exchange a penny we aren't dot org and joined every morning like nine and again at seven pm on any\nSupport for any age PR comes from you our listeners embellish ... offspring gourmet ravioli such as slow barbecued lamb with karma like sweet potato ... farmers' markets in stores state wide online at gimme spaghetti dot com\nAnd New England ideology in Concord in Manchester offering pediatric end adult patient care to help people here life better since two thousand eleven\nMore at New England ideology dot com next Sunday night on the folks show our guests during the nine o'clock hour will be Tom Smith some hope you join us for that special treat to have\nTalent in our studio playing music and tell us what he's been up to and then on the twenty eight and visit with mountain we might start here's one from ... the folks show winds down here at any age PR\nSherry my honey\n... to ... to one\nAll the\nTime that was just ...\nTimes well\nDo you\n\nDo on the", "show_name": "The Folk Show", "year": "2018", "city": "Keene", "day": "15"}