{"month": "10", "state": "NH", "station": "WEVN", "content": "\n[noise]\n\n\nTiny rice with an all star crude Jerry Douglas helping out sand Bush helping out on the album California autumn in his version of Scarborough Fair before that you heard that same crew on Billy in the ground [noise]\nThis is the folk show at New Hampshire public radio support for an H. P. R. comes from you our listeners and from flying monkey performance that are presenting an evening of the American with David ... expand and lab Wainwright the third October twenty seventh flying monkey and H. dot com\nAnd Mac's apples on mammoth wrote in London dairy with ... standing you pick orchard snow up and picking Honeycrisp mckell and other prime varieties information at Mac's apples dot com\nNews is on the way here at W. ... conquered Manchester eighty nine point one W EDS nationally eighty eight point three W. E. V. H. Hanover Ninety One point three W E n T Ninety point seven WABC Koran when a seven point one W. E. D. J. Jackson Ninety nine point five W. E. V. S. corporate ... three\nW. E. D. cute little ten Ninety One point nine New Hampshire public radio on line at any age PR data work\nLive from NPR News in Washington I'm Janine hurts in upstate New York uh to vehicle crash involving a limousine left twenty people dead police or the limo failed to stop at an intersection crashing into an an occupied SUV before landing intervene everyone in the limo Eighteen adults were killed along with two pedestrians\nNational Transportation Safety Board chair Robert Sumwalt says it's one of the worst accidents he's seen in a while\nTwenty propellers is just horrific I've been on the board for for twelve years and uh this is one of the biggest waltz wives and we've seen in a long long time\nThe NTSB is on site investigating it happened and go Harry about forty miles west of Albany\nPresident Trump is holding several campaign rallies this week as he fights for Republicans to maintain control of Congress as NPR's Tamara Keith reports you started last night in Kansas holding the confirmation of Supreme Court justice\nBrett Kavanaugh President Trump says the one week delaying the confirmation vote for Kavanaugh turned out to be a great thing he told cheering supporters at a rally in Kansas that Republicans have been energized by the fight something that is reflected in recent polls\nTrump said his backers could show how they feel about it by voting in the midterms is November\nIf you allow the ra ra office things ...\nHistorically the president's party take the drug being in the first congressional elections after he takes office one question is whether the GOP enthusiasm of recent days the last democratic enthusiasm has been elevated ever since Trump's election camera Keith NPR News\nFlorida's governor Rick Scott has declared a state of emergency and more than two dozen counties head of tropical storm Michael which is expected to turn into a hurricane late Monday or early Tuesday\nToday is a time to get a plan do not put it off\nThere isn't any reason not to be prepared to keep your family safe\nThe governor activated five hundred National Guard troops and warned residents that the storm surge could affect areas of the state that aren't in the storms direct path\nThe national Hurricane Center says right now the storm has maximum sustained winds of fifty miles an hour it's about one hundred Ninety miles from the western a tip of Cuba the storm could be a category too by the time it reaches the Gulf\nIn Haiti rescue crews and civilians were digging through the ...\nMagnitude earthquake that hit the northern part of the country when a strong five point to magnitude aftershock hit the same area\nThe U.S Geological Survey says it's the first significant aftershock at least twelve people are dead or the one hundred are injured several buildings have been damaged or destroyed the country's president said today who makes sure proper systems are in place to help the victims\nHaiti still recovering from twenty to an earthquake that killed at least one two hundred twenty thousand people you're listening to NPR News\nReally wanted to have people in the United states ends up in the emergency room due to injuries in a given year\nAnd that was an operator reports a new study those shows just how costly those injuries are researchers analyzed data from hospitals treated injuries during two thousand Thirteen they tallied up the cost of medical standing last work time and decreased quality of life\nThis study found twelve million injuries are caused by falls or being hit by an object to accidentally another three million injuries are caused by car related accidents there were about Seventy thousand cases of firearm injuries\nAnd about ten thousand near drownings when you add it all up the annual price tag tops one point eight trillion dollars\n... said many of the injuries are preventable and quantify the costs can encourage prevention efforts that study is published in the journal injury epidemiology Allison Aubrey NPR News\nDozens of California's Central coast may see unusual sites and hear unusual sounds today as ... as I used the falcon ... rocket and for the first time space actual attempt to land of the vehicle on a ... near the launch site and not on a drone ship in the ocean\nThe launch of the falcon nine will take place at seven Twenty one pm Pacific time for ... air force base\nAir force says residents may see multiple engine burns by the first stage and the third one also be one or more sonic brooms\nSpace acts has flown boosters back to land after launches from Florida but as yet to do so\nIn California I'm Janine hurts and you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and but listeners who support this NPR suspicion\nIs that folks show at New Hampshire public radio\nYou know her done no\nMean my my\nMain question\n[noise]\n[noise] ah\n\nMy name's\nAbout [noise]\nYou know from the\n\nBeginning you know I'm ... oh\nOh my\nOh\n\nMy God\nOh my God [noise]\nOoh [noise]\nUm\nKendrick so\nMy roommate just let\nMe\nBring on a ...\nPound guy\n\nAnd they can do die\nOn the line\nThere's one there's a time\nDo\nMan guy\nAll my guy\n\nFor the\nGuy\nI'm dying to go\nHe had this guy\nSo bad guy\nSo where that guy ...\nNow yeah God\nOh my God oh God oh wow\n\n[noise] [noise]\n... ... ... ...\n...\n\n...\nYou\nThings will get better do this\nWhole new rules for\nOne day you'll see Mm\nOh Mm\n\n\n\n[noise]\n\n\n\nAnd hadn't Wainwright the third from his new collection the new album is years in the making he's going to be over at the flying monkey on the twenty seventh with David ... get seven thirty\nAnd he'll be our guest here on the folks child at an HP are also in that last set of music you heard the swimming song attuned to London Wainwright the third row from the airport convention and their album old new borrowed blue\nEva Cassidy with fields of schools from her song bird album\nAnd we heard Eric bulky with God's poet now from his everything is great album\nIs this the folks show at New Hampshire public radio\nMore than sixteen hundred listener supported any PR during our recent fun drive your contributions proves that you value the news information entertainment you find on the station thank you thank you thank you thank you for your support together we keep the community service and vibrant and available for everyone\nIf you haven't had a chance to contribute there's still time to support your local and National Journal keep an HP are strong for you a future generations today at any PR daughter works [noise]\nHey if you're one of those folks that called to support or pledged on line for the folks show at New Hampshire public radio thank you so much for your gift\nAnd thanks for listening to the folks show here at an age ... didn't have a chance but you really wanted to but you weren't near your computer or phone\nDoes it end H. P. R. dot O. R. G. support for an age PR comes from you our listeners and penny put to travel in the cone yet and north Conway a team of professionals ended ventures to strive to create the perfect travel experience details it penny but to travel dot com\nAnd made event entertainment hosting a bridal show at the council ten on October seventeenth bridal fashions floors photographers honeymoons and more information net a main event dot com [noise] this is an H. P. R.\nI. too ... too but uh\nIn\nThe ...\n\nWhen you're in concert with the\nSurge through your mind behind me the ...\nAnd ... you\nKnow the raised is why the\nReason why\nThe\nRain was waiting at the end I\nNever really know why\nI'm no\nThan ...\n... ... no\n... no ... soon to\nNow\nMe I don't know I can tell\nNo we don't know I'm\n\nWhy\nThat's why\nThey\nWeight and\nDon't know why ... ... and a good\n\n\n\nNo but it's pretty easy to miss me man ...\n... ...\n... ... ... ...\nSo he ... them by trial\nThing ...\nTo burn\nMm that news story or gear and a\nLot about the\n... when they\nYou\nKnow during the\n...\nI joined the baton sure\nMoney is a ...\n...\n... ... ...\n\n...\n... there'll be ...\n... ...\n...\n\n\nRun Mm\n... ... ... ...\n...\n...\nOr a movie\n\nBut I mean ...\n\n... ... when the\n...\n\nBut I ...\n... ... ...\n... ...\n...\n... ... ...\nI got bigger zone material lean in Iraq and Iran and\nIt's I think in a\nBind but I Know the food\nOn the back down again\n... you may know me\nAnd I use a man on the phone with\nThe ... it's been calling me the keys by you know then you show\n... and ...\nTo Mm\n\n\nSun was speeding on his side of the room\nShattering a shock when the when the baby carriages wire during the mobile phone\nThe first time on my own\nAnd wonder don't cry\nThe third one the bird\nI'm going to shoot the ball and the father of the matter\nA lesser known\nAround you show oh it's the body job on\nAnd then a generation does a hero the GOP charged\nTo cool and ... are they going to bother\nCar and\nBottle to censor volleyball or\n\nTo\n[noise]\n\nYeah [noise]\nMm\n\n\nMm Mm Mm\nMm\n[noise]\n\n\n[noise] [noise]\n\n\nYou\nKnow ...\n...\n...\n\n[noise]\n\nYou with us tonight\nFlying much front and center presenting an evening of American of with the rubber band around when right the third\nTo over twenty seven flying monkey and H. dot\nAnd Mac's apples on mammoth road in London during which barred stand and you pick orchard no open and picking Honeycrisp\n... information that Mac's\nWe heard from Kathy ... from the album for all the good people a golden ring reunion with Dave ...\nDavid Peyton Sandy picnic tricky\nAnd Harry touched with their version of the great ground to called early [noise]\nNews from NPR and then our visit with joy you lay in coming up period W. E. D. O. conquered Manchester eighty nine point Glen W E s now she weighed eighty three W. E. V. eight ten over\nNinety One point three W E n T Ninety point seven WABC ... seven point when W E v J Jackson Ninety nine point five W E s ... Ninety point three and W. E. D. cute little ten Ninety One point nine New Hampshire public radio on mine it and H. P. R.\nDot O. R. G.\nLive from NPR News in Washington I'm Janine Herb's upper bitter bipartisan fight over now Supreme Court justice Brett Kavanaugh a key member of the Senate Judiciary committee Democrat Chris Coons says it's time for the country to move forward\nAs senator role in our in our politics is not to just reflect the country but to help heal and leave the country and that's the course we should be\nSpeaking there and then B c's meet the press meanwhile Republican Senator Lindsey Graham says he's happy about cabinet but he says he has a warning for Democrats this midterm election season\nThis is going to the streets at the ballot box so I'm gonna I'm never campaigned against their colleagues\nThat's about to change Graham speaking there on Fox News Sunday National Transportation Safety Board investigators are looking into what caused the limousine crash in upstate New York to kill twenty people today is NPR's Bob Yellen reports federal officials say it's the deadliest transportation accident nearly a decade police\nPeople and barreling down a steep state road and scary when it killed two pedestrians ... Johnson says she lost three family members in the crash including a couple who got married this past summer\nDevastating I'm ready to have a large family and those who cartoon cartoons are my brother and I are like ... [laughter] this is happening\nInvestigators wouldn't say how fast the limo was traveling they are examining why the vehicle did not stop at an intersection Bobby Allyn NPR News\nIn Brazil's presidential election today far right ex army captain ... and narrow ran up a commanding lead in the first round of voting but he didn't get the outright majority he needed to avoid in October twenty eighth run off against leftist rival Fernando ...\nThis after an election that deeply divided Latin America's biggest nation along gender and racial lines also narrow often impaired with President Trump has been accused of denigrating women and minorities in Brazil\nLeading climate scientists conclude that new technology and other untested methods are needed to take greenhouse gases out of the atmosphere and fears Christopher Joyce has details on the new report\nThe scientists were asked if it's possible to keep the planet from warming more than about two and a half degrees Fahrenheit above pre industrial temperatures that's a red blood and poured dangerous effects on the climate\nWe conclude that current pledges by governments to simply limit emissions of greenhouse gases are not enough to stay below the line what's needed are new and potentially expensive technology used to extract those gases from the atmosphere as well as the best new forced to soak up carbon dioxide from the air\nThe report is from the inter governmental panel on climate change scientific group that advises the United nations Christopher Joyce NPR News\nAsian markets are trading lower at this hour the aged hours down about a third of a percent you're listening to NPR News from Washington\nInterpol says a Chinese official who was reported missing has resigned as head of the international police agency announced that came after Beijing said mom hung way was under investigation and China on suspicion of unspecified legal violations\nInterpol says among was had resigned as president of the agencies executive committee effective immediately but didn't say why\nTurkey's president says he has closely following the investigation into Saudi journalist who disappeared after entering the Saudi consulate in Istanbul NPR's Peter Kenyon reports another Turkish officials as investigators believe ... was killed\nPresident ... says Turkish investigators going through camera footage and other evidence and he'll await the results of that investigation one\nOf his advisors tells the Turkish broadcaster that investigators believe the show he was killed in the consulate in his body moved elsewhere he said he skeptical about Saudi claims that there's no camera footage of the show the inside the consulate and says there's no evidence that he left as the Saudis claim\nShow he's been a prominent critic of Saudi crown prince Mohammed bin Salman and flood the kingdom last year he went to the consulate for papers you needed to marry his Turkish fiancee Peter Kenyon NPR News Istanbul\nThe price of a gallon of gas is rising gaining seven cents a gallon over the past two weeks the Lindbergh survey says the average price for a gallon of regular now stands at two dollars Ninety seven cents\nAnd that's forty one cents a gallon higher than this time of year ago rising crude oil prices are behind the price hike\nI'm Janine hurts and you're listening to NPR News from Washington\nSupport for NPR comes from the Charles Stuart ... foundation supporting efforts to promote adjust equitable and sustainable society and it's home town of Flint, Michigan\nMore at ... dot org and the listeners who support this NPR station\n... New Hampshire public radio\n\nHere's the ... and a gray seal the flow\nHe is and we're in\nThe Bush ... name Ben Jones\nWho you know drinking a ... ... ... ... to ...\n... ... back to ... ... ... a ...\nYou know I I Know\nThat you know ... ... ... ...\n... you put your trust stinks changed ... ...\n\n... ... too many drink but also like to eat the Swiss ski Mm\n... ... ... ... ... ...\nYou did they do in me ... ... ... ... ... a\n... ... ... ... ... ...\n\n... Mm Mm\nMm Mm\n[noise] [noise] [noise] Mm [noise]\nBut it's the ... the ... du ...\nDream or sweet ... to\n... the ... ... ... ... to me that goes to ah do good\nIn a line job back home and I just think that I ... a\n... and I could die a game that\nYou love the\nNew\n... new\nMan in a man you know back in ... needle donor um\nMake no mistake is it just just a blind so get proactive in our skin\n\nShe has the disease and make peace with\n... stay calm and they run out of them and knew the store and a new doctor a man was not ... but oh well you do\nSo\nDid you get to ... get that drive for love grandpa tool\nMake sure this last between your teeth every day you don't want to talk of the game\nTo throw\nThat said the kids\n\nHow to love this morning read\nWell do you do some time and so you do\nSan snow to believe in its own better yet to find an analogy oh two\nMonths ago paying close enough to spread the love that everything is being such a new\nMom so to you you still for members social situation Jews or by ... points\nSupport for an HP our live stream comes from you our listeners and from community minded Fenton family dealerships serving keen swans and all of Chester county giving back to the community for over Thirty years ... dealerships dot com [noise]\n[noise]\nNo they're all means ... up there all seen that it didn't draw your to do this do grow secrete been Charlie Towne cutting down on hard isn't true\nI mean oh man and a leg\nTo death in the [noise]\nUh you just did it did me a well we've [noise]\n\nOh\nOh\n\nOh\nOh\nNo\n\n[noise]\nOoh\n[noise]\nOr anything and Claire and I feel like I was just talking to my daughter about how you shut the noise\nAnd I got all these messages coming constantly and one way too late other messages is just don't go out [laughter] it's already um your latest album is called glass of land and how is\nThat for you and your journey how is that your progression in terms of your writing and your record production you've got bunch releases and your belt already must that changed for you how to transform\nWell I think it was the first time I'd always sort of see myself as a as a folk song writer and a storyteller\nAnd I wanted to kind of stay true to the genre and be quiet to stick based uh but I felt like I was potentially not being true to myself and may be lying to the songs what songs wanted and\nYou know I my first love was uh the Beatles um and then also a New Zealand astray band crowded house and\nBoth of those ... well crowded house very much influenced by the Beatles you know really embrace ... elements and\nString sections in and creativity on the production side and meeting meeting clay and are working with her I'm watching her as a songwriter\nA predominantly in pop oil cheap car rights I'm with a lot of pulp and he ... based artist and the sort of freedom she brings to the some writing process and kind of not saying no to anything\nUntil the last minute because you don't want to kind of taught it all down because you don't\nSo this record is definitely a color collaboration of both out background so it's a it's a lot more electric ... it's a lot more layered yeah and it's a little more pop in it's kind of sensibilities like the drums are kind of quiet heavy and [noise]\nAnd it was really fun to clear in order to perform all of those instruments ourselves on the actual recording and then go out and try and find musicians to\nPlay with this and I as we can say right now it's it's still just the two [laughter] having trouble uh [laughter]\n... yeah well you have a choice with folks like um you mentioned when we're out there that you had a done some work with the stray birds\nBut you also work with el crow medicine show Billy brag Mary chipping carpenter so quiet variety of a performer is out there that you have been performing and now you're making your home in Nashville is that right\nYeah a widow sort of always explored coming to America a since two thousand and ten of first came here just on a bit of an exploration I'm going to the homes of where the music I Love came from um and so yeah to to with acts like old crow and\nI'm like just a whole lot of fun um you know in sign at times um but really really great\nTalk a little bit dirty about where your influences where you you mentioned the Beatles but you also have been compared to folks like gram Parsons so for you um what do you feel like it's really most influenced your music and your songwriting today\nA likes sound was in stylistically I'm my influences a sort of changing every day I depending on what I'm listening to I like I Can't help but\nIf I go to a new town and there's a new accent on on putting on that accent and potentially offending someone I'm not mocking them on just\nConstantly uh emulating the sounds around me so I'm trying not to listen to too much music because when I first got into say grandpa Austin's\n... everything I did I Want it to sound like grandma and I think he he sort of struck me just as this real ... an alternative country singer\nThat I hadn't heard that taught the fragility and um [noise] you know there was a kind of a lot of pain in his voice uh and you know I had not been through the kinds of things that have been through\nIn what was the only twenty six years he lived but\nI really connected with him so he was a huge influence a con of getting me into country so so it started with him and then went backwards to things like Hank Williams um\nBut then people like Bob Dylan [noise]\nReally what the the the ... seeing is that made me actually listen to the lyrics and before that I just wanted to be Jimi Hendrix so\nUh and I knew that that was not going to happen your mom would say get back on the couch yeah [laughter] you're still playing the guitar and just get on the couch and did you grow up in Melbourne\nYeah I grew up in ... which is a Tony twenty minutes north of the CBD so it's it's virtually Pato of great uh Melbourne and uh yes just a little suburban neighborhood not unlike a lot of neighborhoods you find in the U.S but ah\nYeah right near the tram right near the train and it was a yeah it's now like a super ... place with old a lot of big music venues and my parents still live in the same house\nIt's great to go back to pass on Facebook that he made a guest appearance at a Vietnamese restaurant do you do that\n[laughter] we we look for Vietnamese restaurants in every ah stop we make like that's a ... for us we we love with traveled to Vietnam a couple of times and love finding the best for or [noise]\n[laughter] it just rains and sunny and it's like crazy city like that and where I'm from and in Queens and\nIt's much more tropical and his son the storms that role in during the summer and um it doesn't get nearly as cold so\nI see you've got a big tour coming up in Australia pretty fair and you can you reached here in the states are making your roots now in Australia where you've got one foot in both places\nYeah we should always have to keep one foot there you know it's great to go and see a family and friends and\nWe we have got a big following in Australia so there's always a lot of great festivals and um then you said you're inviting us back so we kinda ... kinda scape it and it's great to kind of if we can have this sort of endless summer around the world\nSometimes we get stuck in a whole year of winter but\nUh yeah with what technically make in Nashville, Tennessee L L L roots but you know everything's sort of transitory in temporary you know whether it's studios or was sharing a\nSuitcase between us with an imaginary line down the middle with was trying to you know I Wish\nThat line quite a lot so I get more things\nI think we we buy toys loved the east coast to the east coast feels\nA lot more like Melbourne especially that kind of a European influence I guess a little architecturally and\nAnd it it does feel a little more like hung on and then Nashville's just like this brand new kind of place or the boats with us and we'd we'd be known and also in Los Angeles for five years or so and\nQuite frankly I was just sick of the blue sky you know Seventy five degrees every day I just sent me crazy because you've got no reference of where you are in your life for both seasonally is noted seasons so\nOn and on as cliff said four seasons in one day Melbourne or I Want it to see rain or want it to see lightning and thunder and\nNashville's completely done that in many times already in this a few months but\nUh it's yeah amazing melting pot folk music and also\nThe ability to actually have a loss as a musician you know nearly everyone sort of in and out off and on the road but uh it's a great central spot in the U.S to drive out of like yeah we drove from NASA district as well and it's pretty beautiful and easy in a way you you just can't really do that in Australia\nAre you writing a lot of songs on the road\nAh they usually quiet silly little jingles you know you you've got pasta I don't know song co gas station or something and you stop writing a song about that um\nI think it was a ... gathering let us some titles that\nThe my title is a theme is that things quotes from people uh that to be honest yeah it's sort of like your energy is taken up driving getting out of bed getting that work out where to get a good coffee and you know\nLike I'm up [laughter] picture on your website of this beautiful truck bed and I wondered if that was here to our best to get a picture of a Mickey Mouse\nYet I asked her about thought or no that is that's that's up to ... to a large written what taco truck that we drove over from now on that but that is in sitting in Glasgow pock and that\nIf you look to the left hand corner you can see tiny tip of the glass ... which looks just like the Hollywood Sign\n'em and that was partly the main influence on naming the title of this album so um we definitely do love tacos and I do love waking sleeping like Mickey Mouse who's doing that dreaming of ice cream\nShare a lot of play another song and they talk about a little bit about your upcoming tour and other plants that you might have ...\nUh this is a song a named a from a town just south of Sydney in Australia ... by the you double L. odd\nAnd it was famous for a coal mine that exploded in the Eighteen Seventy three and that's where the genesis of this song idea came from [noise] uh\nAnd uh the nickname of the town as black diamond\n\nMm\n[noise]\nMm\n[noise] [noise] oh [noise] she's that double\nDuty in the moon is the food we\n... [noise]\nMm [noise]\nMm Mr\nRoom on the floor where was this you walk through the new law with that\nMy back\nTo the boys at the time oh\nDuty I'm\nNerd is on the poor me God [noise]\n[noise] Mm [noise] Mm\n\nNot seen three now I Know she\nLoved me you know about it was you know how it\nGoes through oh\nDog\n\nOh my God\nOh you're\nFrom\nThe money's on cable Li\nNa change [noise]\nOh\n[noise]\n\nMm Mm\n\nThe journey the heat and Claire ... from the album class so land and take her for that in here without all the layers that you would find if you had the album and your CD player I'm so little stripped down version of that here in our studio on the folks show at New Hampshire public radio\nWhat's next for you get this album you're going to be out supporting that album for a little box that just came out what the September\n... yeah yeah it came out seven to ten bucks and uh but other projects do you have in mind for yourself we have a lot of different things going on uh whenever we note on the right class doing a lot of\nCar riding now in Nashville with different people in what's called a couple of collaborative a singles that\nWill be coming out uh one with\nThe strain oddest um and then one with another strike and all of us who just moved to Nashville\nSo old that I'm probably jumping the gun so when name names yet but they'll be coming out in the next few months uh you'll say just finished a documentary or you're doing is a soundtrack too I ... a documentary um\nWhich is also coming out soon so yet different bits and pieces like that uh and um yeah just us two of 'em it's only a few select diets but um yeah we roll around I'm\nGoing back to Nashville and then finish in Los Angeles a mid November and then back to Australia for touring but we're we're we're\nWe're doing another to February March in many more cities you can I ask", "year": "2018", "show_name": "The Folk Show", "city": "Keene", "day": "08"}