{"month": "10", "state": "NH", "station": "WEVN", "content": "W. E. V. S. Nashua eighty eight point three\nW. E. V. H. Hanover Ninety One point ...\nW E v Anne Kane Ninety point seven\nTo ... bc Gore ... won W E BJ jak some Ninety nine point five\nThat'd be cool Brooke Ninety point three and W. E. B. Q. levels in Ninety One one night and online at any P. R. dot org\nGood Sunday evening to you and welcome to the talk show here in New Hampshire Public radio [noise]\n[noise]\n\n\n\nI ain't got no no no no no no\nThe no\nNo longer a new study\nNot die\nDown the river\nGo you know no\nAnd I can\n... ah no ...\n... no\n\nKnow ...\n... ... ... ...\n... ... ... ... ... ...\n... ... ... ... ... ... ... ... ... ... ... ...\n...\n\n... ... ... ... ...\n... ... ... what do\nWe know\n... ... ... ... ... [laughter] well\nNo the\nNo\n\n\nWe used to do the\nSame way\nThat they grow\nHow many you\nKnow\n\nBut my mind\nWhen NATO cheese\nDied this movie\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] and she went away\n\n[noise] Mm\n\n\n\nNo no\n\nMost of my\n\nWell not only done this\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\nJust a little Jeremy kid of\nPublic radio [noise]\nSo they're giving tickets away for his do and so that for your mind and then later on so hang out with your defense so ...\n...\n... ... ...\n... ... all of those\nThings you know ... was the player Brian\nSupport for any ... life's dream comes from you our listeners and from Congress regional visiting nurse association\nA home health in hospice agency serving people of all ages and more than forty one communities discover how the conquered regional DNA can help you remain independent and your home and live life to the fall I\nDid it the RV an A. dot org\nShe went in for that long hair and stuff but mine she played it through the the old piano how to tone to send my heart to weaken it always\nSounded sweetest who need ...\nIn one seven lean bitter and smoke come into the order came upon this the new ...\nCurious have been forced to go ... and ...\n... ... ...\n...\n... they did not address the dog's been\nUp to ... calories knows\nWhat the sound new home to please read they were known\nFor area now seem to be going to be a meal out there right which maybe ... ...\nCarry all bugs\nBut still we answered the\nPrimary thing or do you do with the they were not my me in\nThe ... I didn't know where that night\nThey were ... we knew we were no ... my\nI went to curious do\nI go there for a long game\n... New Year's ... morning in\nOne or two years but I thought she could hold back from a ... ... ... ...\n\n... have nothing to do ... to ...\nShe rode down on the dog belonging to the harbor the older writers strangers than the dog she ... she\nCan scientists to be the ... ...\n...\n... ...\nOr look back now on hold\n... the may soon be carrying a new one I didn't know they do we mean hungry\n... times we launched non by just ... to ... to be\nCarrying an online I didn't know\nWhen we read\nSeveral times when humans huh bye to the New York city\n[noise]\nLove is about a song and what you're saying I mean\nHere's the way we\nThe news or anything or is that he's saying just\nLower jaw with anything and then\n\n... and they closed\n... ... ... to\nHear them and\n... and a\nMe and I\nWho told me it was ...\nShe gave me a hug and to me you know ... ...\nMeeting ... ... ...\nAnd\n... ... ...\nThe\n[noise]\nIt's great to da da da da\nDa da di di\nMe to go ahead you're headed\nGuy do when you crash\nA ... [noise]\nWhat do you need\nBe and then\nDream Maggie even\nReally\nNa dream team and it's\nReally\nFind them to be kept trying\nReading Hayek down\nTry and make us feel like when\nWhen we buy from them that it is\nHere the\nMain cheese\nReally\nReally\nKicking the\nDie down [noise]\nWhat is it okay what is it what is it\n...\nThe\n\n\nCivil and Perry for him or a small theater album\nBefore that you heard the mammals with sunshine or they're going to be over at the press room\nThe newly renovated press room in Portsmouth at eight o'clock on November ... seconds before that you heard moonshine are from Haim tendon bomb and we started up that set with David Brown bird I like to sleep late in the morning and I can\nI can agree with that from the album midnight on the water\nThis is the boat show at New Hampshire public radio\nNovember six is fast approaching and candidates are crossing the state\nSpeaking with voters like his message or like his background is my first time being able to vote just turned Eighteen in may so important for ... for a million ... however\nYou wrote we make sure you were following the news you need to make an informed decision in the weeks that stay tuned to NPR for all our election coverage\nIn each bureau election coverage sponsored in part by golf Wilson immigration law and the New Hampshire school\nAdministrators association support Britain H. P. R. comes from you our listeners and flying monkey performance center presenting an evening of the ... with David ... band and loud and lean right the third October twenty seven flying monkey and H. dot com\nAnd helped freedom plan and there were these dealt a dental a partnership created for better or all and overall health right here in New Hampshire more teeth do chose dot com here's one now from London Wainwright the third [noise]\n... [noise]\nThe green and yellow and sharp ...\nYou're still living here with me\nI'd rather be low\nAll that time I looked around", "year": "2018", "show_name": "The Folk Show", "city": "Keene", "day": "21"}