{"month": "10", "state": "FL", "station": "WUSF", "content": "I'm so looking forward to talking about about the fact that tomorrow so tuned in for that event\n\nI my corner and it's all night jobs for Wednesday evening Iran W us up at a nine point seven\nNews jazz NPR your NPR station tonight on all that jazz we'll continue our weeklong tribute to ths alone is monk was born on this day and jazz history Ninety One years ago so lots of music or among throughout the night tonight\nLots of birthdays in fact all across the board so we'll be hearing a lot of folks that were born in the state and jazz history tonight on all my jazz\nAcross the board so we'll be hearing a lot of folks that were born in this day in jazz history tonight on all night jazz\nMeanwhile all night jazz and W. USF as sponsored by Tyrone square miles of St Petersburg offering a large selection of new and certified ... Mazda as as well as quality used cars for every taste in budget gyros grandma's to dotcom seven to seven\nThree four four three three four four and you're listening to W. us up at a nine point seven Tampa saint Petersburg Sarasota we're broadcasting from the University of South Florida let's get you caught up on news of the day from National Public radio and then all night jazz for Wednesday evening will begin\nLive from NPR News in Washington I'm jak spear Georgia's governor is declaring a state of emergency for more than two thirds of that state as age of ... among burns report some W. A. B. in Atlanta hurricane Michael hit Georgia harder than officials originally anticipated\nGovernor Nathan Deal says this storm is unlike any state has never seen\nWe are not accustomed to the magnitude of the hurricane such as this getting in the direction that it is traveling and with the intensity with which it will hit our state\nThat intensity prompted ... the federal government issue a declaration of emergency federal funds to help pay for preparation and clean up for NPR News I'm Asian from ... in Atlanta\nMeanwhile the Florida Panhandle war Michael roared ashore earlier today is a strong category for hurricane with a hundred and fifty five mile an hour wind gusts damages appear to be extensive Panama City trees are operated in power lines are down some homes either had their roofs torn off or split in two by falling trees Brian\n... is with the American Red Cross and says they're expecting many more people to wind up in shelters and a difficult twenty four hours for search and rescue teams we know that\nPeople did not evacuated so what that tells us is we have a pretty good sense of our first responders are going to be required to perform started rescuing overflowed\nOfficials say one man was killed by a fall entry in the panhandle area you know the ... thousand customers in Florida alone are without power after the storm which is also caused extensive flooding\nChief justice John Roberts has referred to another circuit court Fifteen judicial misconduct complaints filed a recently against Brett Kavanaugh on the D.C court of appeals or Kavanaugh served until this past weekend and bears made it ... reports the complaints all stemmed from Kavanaugh's testimony during his confirmation hearings\nThat complaints filed in the DC circuit in September in early October when Kavanaugh was still a judge on that circuit the to complaints that have been made public were brought by the Democratic coalition a political action committee and Washington the charges are they cannot lied and violated judicial ethics rules against partisanship\nJudge who filed the remaining Thirteen complains has not been disclosed about the D.C court kicked the allegations up to chief justice Roberts for a referral to another ... Roberts then sent them to the tenth circuit in Colorado which theoretically could now launched an investigation but experts say that's highly unlikely\nNina Totenberg NPR News Washington\nThe costs of goods as they head down the pipeline that consumers rose slightly last month the Labor Department says it's producer price index a key wholesale inflation gauge was up to chance of a percent the rise offset lower food and energy prices the agency says whole shell inflation compared to a year ago it was up to point six percent\nMajor sell off on Wall street today the biggest drop in eight months with all three of the major indices down more than three percent the Dow fell eight hundred and thirty one points that I was down three hundred and Fifteen points this is NPR\n\nRules from the Treasury Department named controlling foreign investment in us firms have been approved new guidelines will require foreign investors to alert a treasury but inter agency committee of any deals giving them ...\nHere's to alert a treasury but inner agency committee of any deals giving them access to key technology industries the agreement will cover twenty seven critical industries including semi conductors telecommunications in defense was the latest escalation in the ongoing trade battle between us and China\nThe Commerce Department watchdog group says it's considering calls from Congress for an investigation into how the Trump Administration came up with plans to add a citizenship question to the twenty twenty cents us NPR's Hansi Lo Wang reports the requests for an investigation came from Democrats and both the U.S Senate and the house of representatives\nDemocratic senators Brian Schatz and Cory Booker as well as representatives Elijah Cummings and Jerry Connelly are leading the calls for an investigation of commerce secretary Wilbur Ross who oversees the census\nRush testified in Congress that he approved the citizenship question quote still ally in response to the Justice Department request from last December but internal memos and emails show he and his staff tried to get the question on to the dentist months before\nThe senators also highlights Census Bureau research suggesting that ask about citizenship status could discourage non citizens from taking part in the heck out the citizenship question has already spiked multiple lawsuits that are making their way to the Supreme Court undo along NPR News New York\nTo propose sixty nine billion dollar merger between CBS it at that has been given the green light by Justice Department regulators though with some conditions department officials say they have approved a deal on the condition that the cells it's Medicare part D prescription drug business to resolve anti monopoly issues\nI'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include that Jayanti and Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information alright max found dot org and the listeners who support this NPR station\nAnd there's more information\nAbout hurricane Michael on our website W USF dot O. R. G. as\nWell as our Facebook page W us up public media or you can check out the Florida storms out on your phone\nMe while I might Cornell and you're listening to all my jobs on W. us up at a nine point seven news jazz NPR your NPR station will have some fungi with music from bologna and smoke on his Ninety first birthday and a host of other folks as a matter of fact when we get started with music from monk at least something written by month the song called geo\nAnd its name for his producer at the time to you I'm a Sarah who also went on to produce a lot of Miles Davis is recording for Columbia Records at the time\nWe'll hear a version of CIO from Claire daily on baritone sax on her released baritone monk on all night jazz trio and then straight no chaser from guitarist Wes Montgomery\n[noise]\nOf the\n[noise] [noise]\nThe world in the middle east who\nYou do the\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\nIn\nSense because\n\nRichard group homes here on all my jobs for a Wednesday titled trying to the release grooves groove from Nineteen eighty eight with Houston Person there on China\nAnd Cecil Bridgewater on trumpet who at one time was married to a woman named Didi who still carries a standard they belong divorced Dee Dee Bridgewater meanwhile Cecil Bridgewater born on this day and Josh history in Nineteen forty two used in person also and tenor sax therefore grooves groove Richard group homes on him and ...\nJust prior to that nature music from Wes Montgomery se covered our focus artist of the week alone is money\nThat was month straight no chaser and then they're on base another guy named monkey monkey Montgomery west his brother who was also born in this day and jazz history back in Nineteen Twenty one\nAnd his other brother buddy on piano Wes Montgomery from a very early recording called echoes of Indiana avenue Nineteen fifty seven fifty eight but not released until twenty twelve Wes Montgomery straight no chaser\nAnd speaking among also born on this day and jazz history well we heard something else was composed by one of his money to open up the hour and that was a song called geo T. E. O. and we're to perform your right Claire daily and her core chat glare on baritone sax from her released baritone monk\nAnd all my jobs on W. us up and a nine point seven my corner with you on this Wednesday and all my jobs on W. U. S. is sponsored by ... square miles to thirty three hundred Tyrone boulevard in St Pete striving to make buying a car as quick and hassle free as possible I Tyrone square monster dot com always they're always square\nWill continue on all that jazz with music from ... in here from a ... a recording called landmarks with buster Williams on base of foster on drums Kenny bearing a piano Miles Davis composition here's tuna on all my jobs\n\nShe was trying to make sure you're\nJust she seems to me\n[noise]\n\n...\n\n\n[noise]\n\n\nNew track for ... and David Hi do they wrote all the songs for this recording called ice on the Hudson and then brought some booklets to interpret them that was her name or read a book called there along with your freelancers beautiful cello work on that little ice on the Hudson we'll hear more from that\nOur work on that little girl from ice on the Hudson we'll hear more from that recording on our new release round up coming up on Saturday Night here on all that jazz\nMeanwhile just pride or any rat's nest in David Hi do we are listening to music from the oak hill his latest release called the interstellar adventures cyclic episode the sun we heard from Janice CEO hill Bobby ... and started this off from landmarks Miles Davis tune tuna from Bobby ... and\nAll my job and W. us up at a nine point seven I might call that hey coming up at ten o'clock tonight it's our job strip at John\nAnd we're going to go visit a crime scene and look at all the evidence of music from bologna slumped on the anniversary of his birth\nMeanwhile when you think about making a major charitable gift consider using your eye our age just funded you can make a gift to double us up from your IRA any time and it's tax free to learn more call Scott knowing that eight hundred seven for one nine nine now\nThat we continue and all that jazz with the group humanity court chat feature in Joe from a saxophone Peter Bernstein on guitar near recording simply calls humanity here's a whole new you\n\n\n\nWill\n[laughter]\n[noise]\n\n\n\n\nAnd\nAnd\n\n\n\nAnd ah\nAnd\n\nWhen he was in New York's guys all laid out a number of free reign and goes on in the may ... do you ... been over ... billion to show why they're\nTo need to learn that that is going to see me to\nUh\n\nI was thinking you know choosing the\nWhen you do to ... to me oh\n... Mm Mm\n\n\n\n\n\n\nRobert ... tenor saxophone here on all night jazz and this from are fairly recent release called new jai perspective Troy best known for his work with Jodie Francesco just part of the Jeffrey Wright the actor doing the narration as Charlie Parker recording called the passion of Charlie Parker and that was segment\nAlso known here as fifty dollars Jeffrey right along with dynamic has on a tenor saxophone\nHumanity core chat just prior to that from their release humanity in a whole new you Joe from Peter Bernstein\nI'm On my job as a W us after the nine point seven I might Cornell and all that jazz and W. us after sponsored by Tyrone square miles thirty three hundred Tyrone boulevard in St Pete now for a wide selection of new and certified ... miles just with a commitment to a customer service Seventy seven three four four three three four four\nIs it W. us after the nine one seven Tampa saint Petersburg Sarasota broadcasting from the University of South Florida MPR news than a jazz trip at ten\nKasim from the University of South Florida NPR News than or jazz trip to\nLive from NPR News in Washington I'm jak spear\nMost of Georgia is under threat of heavy wins flooding and tornados as hurricane Michael continues to make its path inland Georgia Public broadcasting Steven Fowler as more Georgia is one of the largest states east of the Mississippi and Michael is larger than that\nHigh winds and heavy bands of rain will continue across the state overnight\nAt southwest Georgia farmers worry about pecan cotton and peanut crop others and the storm's path could be left without power and are at risk of damage from fallen trees and debris\nThere are reports of isolated tornadoes across the state governor Nathan Deal has declared a state of emergency for over two thirds of George's County sin is asking for a federal declaration as well\nFor NPR News I'm Stephen Fowler in Atlanta Michael now a category\nOne hurricane came ashore this afternoon as a powerful category for storm in the Florida Panhandle word caused extensive damage in at least one death President Trump says the White House is looking for answers in the disappearance of Saudi Arabian journalist ... ... more from the White House says\nIt's important to find out what happens in democracy Yogi administration official talk with Saudi Arabian crown prince Mohammed bin some on about the missing journalist ... said the U.S is asking the body to provide more information about the investigation\nIt's very sad situation it's very sad situation and we want to get to the bottom\n... it was last seen entering the potty consulate in its Campbell that with a little more than a week ago and he has not been seen stance as a columnist for the Washington Post he had been critical of the Saudi royal family Ayesha Rascoe NPR News\nThe White House the FBI says while his background track of a new Supreme Court justice Brett Kavanaugh was limited in scope\nThe usual process was followed FBI Director Chris Wray answering questions about the background investigation during a Senate subcommittee hearing today so that while less expensive than a criminal background check the investigation requested by the White House followed standard procedure\nWall Street hasn't seen a sell off like the one today since February all three of the major U.S stock market indices falling three percent or more with some of the biggest declines coming in an area that done well so far this year the tech sector ... chief economist with grant for it and so some investors appear to be worried about how pricey stocks like apple and Amazon to become\nWe hit you know a point where all of a sudden you had two major tech stocks caught a trillion dollars in value and all of a sudden that you know reality is lifted that today the ground shifted\nApple fell four point six percent while Amazon Microsoft both dropped more than five percent busters are also worried about rising interest rates\nTracking the numbers the Dow dropped eight hundred and thirty one points today to close a twenty five thousand five Ninety eight the NASDAQ fell three hundred and Fifteen points yes and the five hundred drop Ninety four points this is NPR after running under an interim chief since March U.S Forest service has an official boss\nNPR's Kirk Siegler reports the Trump Administration is tapping interim chief ... Christians in the lead the agency Vicki Christians\nIn his overseeing state forest in Washington in Arizona and spent the past seven years in Washington DC with a federal Forest Service\nShe's also been a wild land firefighter and has worked extensively and fire management that's one of the biggest and most important roles of the modern day Forest Service this is a highly scrutinized position she'll ever see a hundred and fifty for national forest than twenty national grasslands\nChristians and also takes over the agency at a time of turmoil her predecessor resigned earlier this year I met a sexual harassment investigation\nThe agency is still grappling with numerous complaints\nThe sexual harassment investigation agency is still grappling with numerous complaints and lawsuits many in California over alleged sexual misconduct by supervisors Kirk Siegler NPR News many Americans can expect to pay higher heating bills this whether that's based on the latest for cash from the U.S energy information administration\nWhich in a summary report says the increased cost primarily a result of higher prices for heating fuel since temperatures during the winter eating lunch October through march expected to be similar to last year\nFrom says it expects this one will be about one percent colder than last year prices for all of the main heating feels natural gas electricity heating oil and propane will go walk the heating costs in the mid west for household using propane expected to be lower because of warmer than usual wonder whether they're\nGoing to a futures prices followed the stock market lower today oil down two point four percent to end the ... Seventy three Seventeen a barrel of New York mercantile exchange I'm jak spirit NPR News in Washington\nSupport for NPR comments from NPR stations or their contributors include the Robert Wood Johnson Foundation working alongside others to build the culture of how\nThat provides everyone in America a fair and just opportunity for health and wellbeing more at our W. J. U. S. dot ORG\nAnd there's more information about hurricane Michael on our website W USF dot O. R. G.\nOn our Facebook page W. U. S. public media\nAnd on our Florida storm's path for your mobile phone meanwhile you're listening to W. U. S. F. I. D. nine point seven news jazz NPR your NPR station my corner with you on this Wednesday evening and this hour and all that jazz well here's something from the latest released from Cecile McLaurin solve on\nAnd we'll also hear a ... plant harmonica with the Count Basie orchestra that I'm sure you probably have heard of before his name is uh Stevie Wonder what you heard of that guy right\nSo he's going to be playing his song ... more with Count Basie orchestra a little bit later but we got some Miles Davis great our music right now will kick things off of their jazz chip is Jen\nEvery night at ten o'clock we take you on a little jazz adventure so tonight I imagine you're going under the yellow tape at a crime scene and we'll hear evidence from Art Blakey with the loan is bunker composed the tune from Art Blakey with\nAlone is month we'll follow that with chick Korea's fingerprints and wrap things up with a song called organized crime from dead Nash on saxophone with Warren wolf on ...\nOr ... Chen we're headed to the crime scene on the jazz trip get at your Dick Tracy watches and get ready here's evidence from Art Blakey and the loan is monk with Johnny Griffin on tenor sax [noise]\nThan\n\n\n\n\n\n[noise] [noise]\nWe\n[noise]\n\nNa na\nNa na na\n\n\n\n\n\nOr jazz trip a giant here on all night jazz and W. us that Betty nine point seven we visited a crime scene on the jazz trip tonight we looked at all the evidence that song we started off with Art Blakey ... together along with Johnny Griffin on channel bill Hartman on trumpet Becky ... breast on base\nInteresting song recorded it very early on under its original name justice and\nThen ... was kind of protesting against some Camry laws and weren't trading him very favorably changed it to evidence there we go Art Blakey alone is monk one on piano we followed evidence was fingerprints something else you always look for the crime scene right fingerprints chick Korea and his answer to wind shortage footprints\nFingerprints past present and future of the name of the recording chicken piano Ava shy calling on base just Ballard on drums\nAnd we decided between the fingerprints and all the other evidence that it wasn't organized crime that was the name of the sun wrapped up the gesture tonight at national his quintet live a disease club Coca Cola and this from recorded last year but just released this year set on Alto he wrote that you weren't all fun vibes Gary ... piano Rufus read on base and\nMatt Wilson on drums what a great band organized crime footprints and evidence all at the crime scene on our jazz chip attend tonight\nI might corner and hope you enjoy the tomorrow night we'll we'll look in the mirror and a mixed reflections on life with more music from ... who was born today in jazz history back in Nineteen Seventeen hope you enjoy the jazz trip tonight\nMeanwhile I might Cornell it's all night jazz your NPR station can take care of that old car taking up space in your driveway donated to a Sierra W us apple even pick it up for free making a donation is so simple I got to do is called eight six six Wu must have car or donate online at W. USF dot org slash vehicle\nTomorrow night at ... in old Hyde Park it's going to be acne jazz garage they're seven thirty every Thursday and friday if you've got to jazz of an ... an all night jazz at W. USF dot O. R. G.\nAlso born on this day in history in Nineteen oh three burning do great composer here's one of his tunes and if you're headed to New York this uh this is my tape it's a cosmic moment for you here's Kenny dorm and autumn in New York\n\nHappy birthday John Beasley who put these two monk us for tributes together and this from the first one and it was off good T the song we heard dedicated to a legendary Cincinnati and jazz DJ that Oscar treadmill was his name\nAnd a ... wrote that June ... John ... Canada springs just prior to that from her latest indigo and something called six H we open to set with something that was\nA written for the Nobel Peace laureate from Burma on saying to cheat that was the name of the song Wayne Shorter on soprano sacks Herbie Hancock jumped piano from one plus one\nRight here on all night jobs I'm W us up at a nine point seven Tampa saint Petersburg Sarasota we're broadcasting from the University of South Florida yet another news update from NPR and then caravan or midnight standard for Wednesday evening\nLive from NPR News in Washington I'm Jim hock hurricane Michael is blamed for at least one does a Florida Man killed one a tree fell on his home NPR's\nDebbie Elliott reports Michael intensified into a powerful category for hurricane just before making landfall near Mexico Beach Florida\nHurricane Michael and making history at the strongest storm to strike the Florida Panhandle with one hundred and fifty five mile per hour when\nThose wind and storm surge have caused widespread destruction from Panama City to Appalachia cola and treats McCormick Panama City that's her ceilings caved in at the storm came ashore\nYou can hear just about every ... and and the Wayne just hitting up against the house in ... and you can't live with something major but again if you've never experienced a hurricane or a major storm trust news or something and you never want to do a thorough\nSearch and rescue teams will deploy with boats helicopters and high water vehicle Debbie Elliott NPR News crafty in Florida\nPresident Trump visited Erie, Pennsylvania Wednesday night trying to rally Republicans before the election Chris Potter of member station WNPR straight as Trump's taught to damage democratic Senator Bob Casey by invoking the fight over Supreme Court ... court justice Brett Kavanaugh\nISI is up for reelection and Trump blasted him on a number of fronts including this one\nHe joined the lady my voting against Brett Kavanaugh\nCasey has said Trump mayday quote corrupt bargain by picking the nominee from a list pre approved by outside conservative groups but Republicans say their bases energized by the Kavanaugh fight\nAnd its allegations of sexual misconduct Republican Lou Barletta has struggled in his bid to unseat Casey Barletta told the crowd that if they didn't like how cap and not have been treated they had to vote Casey out for NPR News I'm Chris Potter ...\nDown day on Wall street Wednesday the Dow launched eight hundred thirty one points by the end of the trading such an ongoing trade tensions between the U.S and China I get some of the blame as well as the steady rise in government bond yields and the Federal Reserve's ongoing tightening up interest rates\nMarket analyst Elliot young says higher rates are affecting businesses and consumers\nWhenever they go out to borrow money to do something to grow their business they're not having to pay a higher interest rate on that loan it also means higher interest rates for consumers on their credit cards on the mortgages so consumers have less money in their pockets that can slow the economy\nInvestors pulled money out of high growth tech stocks like Facebook Amazon and Microsoft and the NASDAQ\nOf high growth tech stocks like Facebook Amazon Microsoft and the NASDAQ Composite index fell more than four percent\nA magnitude six point no earthquake struck just off the coast of Indonesia a country still reeling from an earthquake and tsunami last month that killed more than two thousand people believe this quake hit early Thursday I bought one hundred miles North West of the popular island of\nBali this is NPR News\nSan Francisco judges ordering a new trial on June of damages after a landmark judgment against the chemical giant Monsanto in August a jury awarded a total of two hundred and eighty nine million dollars to a man who says the weed killer roundup causes cancer from member station ... Daniel Levitin has more\nDwayne Johnson is a former school grounds keeper with terminal non Hodgkin's lymphoma he believed years of using roundup at work cause cancer and dude Monsanto saying the company should have labeled at the product is having potential health hazard and one\nBut now judge do the ... his granting the requests for Monsanto lawyers to overturn two hundred and fifty million dollars in punitive damages against the company\nIn her ruling the judge agreed with the company's contention at trial that Johnson had failed to produce evidence Monsanto and executives were militia arrested marketing their products\nIt's unclear whether Johnson will keep nearly forty million in compensatory damages for NPR News I'm Daniel vented in San Francisco\nFederal officials have arrested a man from New York state for manufacturing a two hundred pound bomb in his basement FBI says it was intended to be part of an election day attack on the national mall in Washington\nFifty six year old Paul em Rosenfeld was charged with federal offense is related to manufacturing a bomb and transporting explosives FBI spokesman William Sweeney set in a statement that had Rosenfeld been successful applied could've claimed the lives of innocent bystanders and caused\nUntold destruction FBI bomb technicians safely removed a device Rosenfeld basement in ... New York I'm Joe ... NPR News in Washington\nSupport for NPR comments from NPR station or their contributors include home advisor\nMatching homeowners with home improvement professional for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointment on line at homemade visor dot com\nIt's all night jazz for a Wednesday evening Iran W. U. S. F. I. D. nine point seven news jazz NPR your NPR station I might corner with you will be hanging around for about an hour or so states plans got the late shift he'll be in at one\nAnd this hour and all that jazz well new music from Cyrus Chestnut Boston extended piece of music from our focus artist or the week the loneliness monk with John Coltrane\nWill start though with Oscar Peterson and dizzy Gillespie together as they cover our midnight standard for Wednesday evening we always like to play a version of Duke Ellington and won ... old classic caravan\nAnd tonight from perfect Peterson the best of Oscar Peterson Oscar Peterson on piano dizzy Gillespie and Trump it and tear on CNN\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\nHe's\nBeen\n[noise]\n\n\n\n\n[noise]\n\n\n[noise] [laughter] [noise]\n[noise]\n[laughter] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n... golden jazz all started some great all stars indeed here my goes Santa Maria on Congo they Valentino flute Mario ribs or on saxophone Hilton release on piano Charlie supported on trumpet and teacher points to a ... in session\nAnd attuned composed by do Jordan called flights to Jordan\nAnd then just prior to that means for Milt Jackson from statements milk on vibes Hank Jones I'm Mr PC Paul Chambers on base and county K on drums Nineteen sixty one terrorists blues from Milt Jackson\nAnd we opened things up with our midnight standard we always by a version of Duke Ellington and want to use those plastic June camera ban on a Wednesday evening tonight we heard it from perfect Peterson the best of Oscar Peterson Oscar and piano dizzy Gillespie on trumpet for care of a Nineteen Seventy four date there\nI mean well tomorrow night on all my jobs on our midnight standard at this time will be playing a version of Billy strain one's lush life for you it's all my jobs on W. us up at a nine point seven I'm my corner\nHello nice monks most famous composition around midnight remains a classic work\nAnd ... after he committed to the keeper I'm Nancy Wilson killing me for the next gas profile\nAs we pay tribute to the gym a composer and pianist alone is an NPR national political\n[noise]\nListen for jazz profiles that's our new Sunday at eight o'clock program and alone is monk gonna be the featured artist this weekend we will just be wrapping up our alone is monk tribute monk one this week in jazz history in Nineteen Seventeen today actually so we're gonna play lots of luck we got more money coming this hour on all night chance\nMeanwhile I my corrected W us up at a nine point seven news jazz NPR your NPR station will continue now with music from trumpeter book or a little from book or a little for with George common in here on general Tommy Flanagan on piano\nArt Davis on base and the great max Roach on drums Nineteen fifty eight days here Jules Chapo from trumpeter book\nJohn drums Nineteen fifty eight day here Jules chapel trumpeter book or a little on all my job\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[laughter]\n\n[noise]\n\n[noise] no\nI might Cornell I've got one final set and and that's ever going to hear this past a piece of music that features a great band led by alone is monk with John Coltrane on tenor Coleman Hawkins also on tenor Gigi gripes on Alto re Copeland on trumpet Wilbur where on base an Art Blakey on drums oh my\nBlues for tomorrow the name of the songs on the release alone is monk with John Coltrane but before we get to that is guitarists ... Silverstein and to base hit [noise]\n\n\n[noise]\n\n\n\n\n\nAre focused artists to go it alone is marked with a monster band here John Coltrane Coleman Hawkins on channel ...\nBut the monster band here John Coltrane and Coleman Hawkins on tenor Gigi Rice on Alto re Copeland on trumpet Wilbur where on base and Art Blakey on drums Nineteen fifty seven blues for tomorrow from bologna as monk with John Coltrane\nAnd then just prior to that music from you know Tam Silverstein on guitar Aaron Goldberg um piano Christian McBride on base Greg Hutchinson on drums\nFrom residents that's the name of the recording to base it the sun we heard and that's all the time I've got\nI might Cornell I'm Out the door I'll be back tomorrow night at nine states planes got the late shift after news from NPR right here on W. USF eighty nine point seven Tampa saint Petersburg Sarasota\nLive from NPR News in Washington I'm Jim Huck\nHurricane my goal recently downgraded to a tropical storm has moved away from the Florida Panhandle and responders are just beginning to assess the damage the strong left those wake Doris ... from member station WFDD is that the emergency operations center in Panama City where a mandatory Korea was and in fact\nThey county sheriff Tommy Ford announced the curfew will start early after reports of looting came in from Panama City police\nWe will not tolerate anybody looting or or or disturbing anybody else's property there's enough damage and we're not going to tolerate it one bit\nOfficial said the top priority now is to clear the roads for responder at that age and eat outside the area can aid cleanup effort for NPR News I'm Delores can clean Panama City\nAt least at least ten people died on the Spanish island of ... after a trench will rainstorm caused flash flooding that caused heavy damage from Sturges of wandering mud some parts of the island received up to nine inches of rainfall and around four hours more than one third of the average yearly rainfall\nSpanish tennis star Rafi on the dollar who was from my orca how presidents clear month from their houses and the bell also announced on social media that his tennis academy on the island would offer sheltered that people affected by the floods [noise]\nBe chief justice of the Supreme Court John Roberts has referred to another circuit court the Fifteen judicial misconduct complaints recently filed against Brett Kavanaugh on the D.C court of appeals where Kavanaugh served until this past weekend\nNPR's Nina Totenberg reports the complaints all stem from Kavanaugh's testimony during his confirmation hearings\nThat complaints filed in the DC circuit in September in early October when Kavanaugh was still a judge on that circuit the to complain that have been made public were brought by the Democratic coalition a political action committee and Washington the charges are that Kevin not lied and violated judicial ethics rules against partisanship\nJudge who filed the remaining Thirteen complains has not been disclosed about the D.C court kicked the allegations up to chief justice Roberts for a referral to another ...\nRoberts then sent them to the tenth circuit in Colorado which theoretically could now launched an investigation but experts say that's highly unlikely Nina Totenberg NPR News Washington\nThere was a lot of red ink on Wall street Wednesday the down plunged eight hundred and thirty one points on the NASDAQ was down three hundred Fifteen points and the U.S and the five hundred closed down Ninety four on his way to another campaign appearance President Trump told reporters\nHe doesn't like the Federal Reserve's recent actions to keep inflation from soaring [noise]\nBesides interest rates and trade wars investors are also concerned about treasury bond yields which hit their highest level in seven years on Wednesday [noise]\nThis is NPR News Catholic bishops in Texas are promising to release a list of all priests accused of sexual abuse as Laurie Johnson of Houston Public media reports parishes are expected to release\nLaurie Johnson of Houston Public media reports parishes are expected to release the names early next year\nThe Texas Catholic conference of bishops tend to lift will date back to at least Nineteen fifty and will include named to prefer to have been credibly accused of sexually abusing a minor\nCardinal Daniel ... the archbishop of Galveston Houston sending a statement the decision is a response to culture I'm Catholic laypeople for greater accountability and transparency\nDinner to also leads the U.S conference of Catholic bishops and had been meeting with Pope Francis at the Vatican discuss the nationwide sex abuse scandal\nAll Thirteen hundred twenty parishes in Texas said that will publish the names of accused clergy by January thirty first the bishops also pledged to update the list when new accusations are made for NPR News I'm Laurie Johnson and she didn't\nMastered owning a parliamentary committee has begun debating the constitutional amendments required under a deal with neighboring Greece to change the country's name to North Macedonia in exchange for NATO membership\nThe move comes after September ... the referendum on the deal with Greece which what ended nearly thirty year dispute between the two neighbors over Macedonia is named\nA pipeline explosion in British Columbia could end up cutting off the flow of Canadian natural gas to Washington state and companies are urging customers to conserve the last Tuesday evening shutdown me Enbridge natural gas pipeline about six hundred miles northeast of Vancouver\nI'm Jim ... NPR News in Washington\nSupport for NPR comments from NPR station other contributors include the ... foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at ... foundation dot org and the corporation for public broadcasting\nAnd we're back with all night jazz on W. USF eighty nine point seven\nOr ... taken over from my corner up at a heavy along on this early Thursday morning we could hear music this hour from Jonah bono Charles ... at the end of our first set up here from Eric read Tony Bennett I'm dying to crawl together on a new album\nBut first all over Nelson a recorded in November Nineteen sixty four of the album more blues and the abstract truce\nWe're going to hear the title track\nA future solos from Phil Woods on Alto sax pepper Adams on baritone Roger Callaway piano greedy cheat on drums he was all over Nelson blues in the abstract troops on all night jazz [noise]\n\n\nTo get to know\nWhere they can do\nThat for\nA minute\nAnd all\nA\nMan\nOff and\nThere's\nA fan is very\n\n\nFor those who are you running through\n\nTime\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\nOh [noise]\n\n\n\n\n\n\n\n\nThat's the music of Charles ... is\nOne of them recorded in Nineteen fifty six bits can throw up is that correct is weird the title track I Wish you'd just coated job and man that would have been each year a Jackie McLean was an elbow sex Jay your monthly rose on tenor sax smell wandering piano Willie Jones on drums\nBefore that he and his ear agreed the album that dancing monk we heard celebrity is monks blue monk been will fund base ... hunter on drums Eric read on piano solo do you smoke it's our focus artists of the week here on all night just\nHe was born a hundred and one years ago yesterday and we started off with ranger conductor Oliver Nelson the album more blue is in the abstract truce weird the title track record in Nineteen sixty four\n\nBy my corner every now and then we have to take them home and get introspective and look in the mirror will do that tonight on all night jazz during our jazz chip in China's Mary stalling sings alone and smoke\nAnd I'm reflecting back on my\nName's ventured begins tonight at nine O W USF eighty nine points and get like a dream ...\nThey are not hey we can do and you know with all that jazz I'm Steve ... we're going to be hearing from Giovanna over from the album burn songs were going to hear Barbados Jonah bono on tenor saxophone James weidman on piano Esperanza Spalding on base among others\n[noise]\n\n\n...\nAnd I think\nAnd I think\nThat we need\nTo stand up and I think we need\nThat in the\nJust making the\nAnd the\nCat and mouse\n\nShows and I think\nAnd I\nAnd I just but being\nA statement beat\nJohn\nGet the baby\nIn the\nAnd\n\nShould have been\nAnd night and getting\n... they do\n\n\n[noise]\n[laughter]\nGosh\n...\n\nAnd and\nThat's\n\n\n\n\n\nThat's new music from Chris hazel to the place to him and be three\nIs groups called the booth could lose seven in the new album just not an August is called the basement beat we heard frying pan among others on this track Nick Roland L. to encounter rejects baritone met Hooper guitars Jenny Rojas drums pet Conway on percussion\nBefore that we heard from ... from his album for the love of you we heard that Mr Burrell thank you\nPicturing here agreed on piano Tony do mess on drums really Jones the third on drums and ... ...\nOn guitar and we started off with Jonah bono from the album bird song featuring his group a spy and we heard a song called Barbados\nThey'd be giving hunger the blues concert in festival was coming\nBut this weekend friday October two wells and Saturday October Thirteen taking place on the ground to vent ways Ohioans Sarasota it's a great cause raising money for the less fortunate and is there sort of mandatory area information available at giving hunger the blues dot org\nIf you're a jazz listening give it a shot at all that jazz at W. F. dot org will try to get it on the air for you or you can also catch it\nOn our homepage W. F. dot org click on the jets tips go down to the events calendar that you could find it all the rich as going on debate area it is on edge as I'm Steve spleen and this is Steve during the Trump bonus Trump is new album just called the very start of you\nAnd we're going to hear the shuttle about your smile feature on this track Russell I'm Alone on Qatar's Kenny Baron piano buster William space and really Jones just started again don't drop [noise] [noise]\nOr a foul ball or a a ...\n\nNa\nNa na\nNa\nNa na na\nNa\nAA\nLa la la\n[noise]\nThat is new music for Tony Bennett and Diana crawl yup I'm a ... year old George Gershwin music is called love is here to stay we heard but not for me\nThey're backed up by the bill Charlotte trio featuring bill Charlotte on piano music from Tony Bennett and Diana crawl\nBefore that we are tremor junk mail Ramirez is album released this spring in April coat African scars record save your love for me warn Wolfe was aren't vibes Matthew Clerk and you know John shift late on base\nThat's on my buddy Johnson was a big hit for Nancy Wilson if you remember back in the day save your love for me\nWe started off with Trump voters Steve to rate the album the very start if you were you heard the shuttle your smile\nThat's all that jazz aren't these planes take a break for news it'd be back with a whole lot more jazz you're listening to W. S. F. Tampa saint Petersburg Sarasota we're broadcasting from the University of South Florida the news is next to have been all that jazz continue\nJustin from the University of South Florida the news is next to them and all that jazz continue\nLive from NPR News in Washington I'm Jim Huck hurricane Michael slammed into the Florida Panhandle with winds of one hundred fifty five miles an hour on Wednesday splintering homes I answered merging neighborhoods before continuing it's destructive church inland across to solve eased\nFranklin County sheriff EJ Smith ordered a curfew from sunset through sunrise to give emergency crews the chance to clear up of debris\nCatastrophic damage there's trees everywhere\nRoads are underwater deejay National Guard they will have a hard time getting into some of these roads or\nDo we assessments eighth or you can even travel across\nThe storm also knocked out power to hundreds of thousands of homes and businesses hurricane Michael has we can do a tropical storm as it moves across Georgia and head north east where gender the Carolinas NPR's Rebecca Hersher reports warm water in the Gulf of Mexico fueled the storms initial category foreign intensity\nAnd the hours before it hit the Florida Panhandle hurricane Michael gotten more and more intense it's wind speeds got higher its core got tighter and the barometric pressure inside the storm dropped lower and lower\nMichael is the most powerful hurricane to hit the panhandle since recordkeeping began in the mid Eighteen hundreds\nHurricane Michael's increased intensity was driven by hot water in the Gulf of Mexico\nThis surface temperature in the Gulf water in the mid eighties is warmer than usual and that's part of a trend global climate change is causing our ocean the heat up and that helps fuel major hurricane Rebecca Hersher NPR News\nA Chinese intelligence official has been arrested in Belgium and was extradited to the United states to face economic espionage charges according to an FBI indictment NPR's Rob Schmitz reports\nThe extradition of she enjoys and is a major escalation of the Trump administration's effort to crack down on Chinese theft of us technology\nShoe who went by several aliases belongs to China's main spy agency the ministry of states security is sixteen page indictment detailed a dramatic sting operation to lure him to a meeting in Belgium to obtain proprietary information about Jack fan blade designs from a GE Aviation employee\nInstead he was met by a Belgian authorities and put on a plane to the U. S.\nG. aviation was a ripe target because it builds a jet helicopter ... for the Pentagon shoes apprehension is the first time a Chinese intelligence official has been brought to the United states to be prosecuted and tried in an open court Rob Schmitz NPR News Shanghai\nUs stocks plunged Wednesday as investors fearful that rising interest rates and trade tensions good her company profits ramped up their selling of high flying technology and Internet stocks\nThe Dow Jones industrial average fell eight hundred thirty one points it's worse loss and eight months apple and Amazon to most valuable companies in the U.S on the five hundred each have their worst day in two and a half years\nThis is NPR News a new study is suggesting that for women giving birth in the United states the risk of having a life threatening emergency during or after childbirth largely depends on their race and ethnic origin NPR's ... chatter gee reports\nEvery yet over sixty thousand women experience life threatening emergency requiring a blood transfusion or other life saving proceeded jarring or off to try to buy\nThe new study looked at women who underwent that procedure between two thousand and twelve and two thousand and Fifteen study up and then the administration OBGYN at the University of Michigan\nOur data show that racial and ethnic minority women are more likely to be a fact that\nFor example healthy non Hispanic black women have a Seventy percent\nFor example healthy non Hispanic black women have a Seventy percent higher risk of complications than white women that grass is even higher for women with chronic health conditions like diabetes or hypertension study appears in the general that tricks and gynecology ... NPR News\nFederal authorities have charged a New York man with building a two hundred pound bomb in his basement prosecutors say he planned to detonate the device on election day on the national mall in Washington\nFifty six year old bull Rosenfeld was charged Wednesday was unlawfully manufacturing destructive device and interstate transportation and receipt of an explosive\nYou have to be All right set in court filings but Rosenfeld confessed ordering large quantities of white powder over the Internet and that he constructed smaller explosive devices in order to\nConduct trust the nation's I'm Jim ... NPR News in Washington\nSupport for NPR comments from Americans for the yard committed to transforming America communities through the art and art education supporting the nonprofit arts industry which employed four point six million people nationwide learn more at Americans for the art dot org\nAnd we're back with all that jazz O W s F ... seven\nAnd the spleen thanks for sticking around you've got music this hour from Hendrik Americans jazz at Lincoln Center regret Stefan Harris Charles lord and the Marlboros Antonio heart and a whole lot more\nFirst chapter bay area legend out downing their friends\nFrom ALS album do jazz we're going to hear my truly sharks teachers out down the piano John Mercer base Boris Lipinski aren't guitars Ernie Calhoun tenor the legend oh Tampa Bay area legend cheers out down in my foolish charge on all that jazz and\nUh\n\n\n\n\n\n\n\n\nPer se\n\nCertainly\nThe\n\n\n\n\n\n[noise]\nSure [noise]\n\n\n[noise]\nBurgers\nBirds and\n\n\n\nThat's new music from pianist Mickey ... yeah I was called Mickey we heard book still stored on drums Orlando last living on base ... and ... on piano\nBefore that pianist Bill Charlap in his trio from their album featuring the music of hokey Carmichael it's called stardust\nWe're in Georgia on my mind Peter Washington based Kenny Washington drums bill Charlotte on piano and we started off with Tampa Bay area legend el downing and friends from the album do jazz we heard my foolish heart\nFelonies monks most famous composition around midnight remains a Catholic work a half century after he committed to the keyboard I'm Nancy Wilson joined me for the next gas profile as we pay tribute to win a composer hello nice man I'm In the Army National pending\n\nChance profiles with Nancy Wilson airs every Sunday night at eight right here on W. U. S. eighty nine point seven news jazz NPR\nMy name's Steve spleen you're listening to all night jazz let's get back to the music jazz at Lincoln Center orchestra with Wynton Marcellus just from their march of two thousand Seventeen release called the music of John Lewis said already one of the founders of the modern jazz courtship\nWe're going to hear ... dilemma were solos by Chris Crenshaw on trombone shutdown Sean ... and went to the Marcellus on trumpet on all night you\n\n\nDa\n\nDa\nDa da\nDa da\nDa\n\n\nDa\nNa\n\n[laughter]\n[laughter]\n[noise] [laughter] [noise] [laughter]\n[laughter]\nPlenty of nearly ...\nHadn't been any day yeah\nYeah\nThat is that the\nThat you had in the\nLate ...\nAnd he had his foundation at a at a price on any of that is that they\nMan that is yeah\nThat is a\nThey\n\nThat's being this Elbert drew Barry what's album released last November go jazz legacy we're going to solve your record for sure\nOh bridge or a long tour industry Adrian cutting here this though his own band future ... based Paul Wells drums Jay Clayton Sheila Jordan on vocals\nBefore that Hendrik working under her Monica Misha seeking off on piano from their album junior chi at least in two thousand for June we heard of called Bodie smokes on ruby my dear\nThat we started off with jazz at Lincoln Center future which is worse Carlos from two thousand Seventeen release called the music of John Lewis we're joined the response\nIt's called the music of John Lewis we're drawn to a song from a delay knees dilemma that song if you're a jazz or file you would recognize some of those core changing as being from George Bush when\nI got rid of them\nMade it clear water jazz holidays coming starting Thursday or job or Eighteenth running through Sunday the twenty first information at tickets\nAvailable that Clearwater jazz dot com\nIt's all night jazz aren't ... let's get back to the music which step on Harris and blackouts step on ...\nIt's been blackout from the album just out cold sonic read we're going to hear Wayne Shorter so code go step on Harris on barbs on all night Joe\n...\n[noise]\n[noise]\n\n\n\n\n[noise]\n\nDo\nDo do\nFor those\nWho don't know\nDo do do\nDo you", "show_name": "Jazz", "year": "2018", "city": "Tampa", "day": "11"}