{"month": "10", "state": "IA", "station": "WHO", "content": "But we're getting the results in the benefit of that hard fight you know they're they're the type of Republicans the basically want to just sit in power in the corner and and act like they can be friends with people that are saying publicly to kick you and that don't want to be civil\nThat are running you out of restaurants and screaming at the top of their lungs at you so I you know it's it is what it is I the only thing I really want at this point I Want results\nWant the forgotten men and women to be taken care of I Want as much prosperity as we could ever create for every American and I want to take care of Americans first and then we'll work on helping the rest of the world develop the same system in paradigm that we built that\nHas benefited our population and then I Want security in a world full of radical Islam is and people that that want to wipe America off the map and chant death to America\nI Want to make sure that we have the meanest toughest bad US military and then we can handle any threat that the world throws at us\nAnd we can do if necessary we can protect the world against evil when evil you know raises its ugly head but there's it's happened before and it's going to happen again history has proven in the meanwhile it's you know basically\nYou know temper tantrum politics\nOf never Trump or is there there's still mad they got it wrong you know we wouldn't have to Supreme Court justices that are conservative\nHad they had their way we wouldn't have had the tax cuts we wouldn't have the regulations to roll back\nWe wouldn't have America on a path towards energy independence\nWe wouldn't have had you know all the record numbers of jobs we currently have or the big GDP Growth we have or consumer confidence that we have that's why in eight days when people go out and vote this all matters a major question people have to ask is are you're better off than you work two years ago\nIn terms of the economy peace and prosperity Dr elections and if you want this prosperity this growth to continue if you want America to remain a leader on the world stage if you're not afraid to have a president that is willing to be a tough negotiator on your behalf\nBe a trade or NATO or Kim Jong un we didn't get anything that Kim Jong un nothing and look at what we've gotten back a shot at peace\nAnd denuclearization of the Korean Peninsula you know if you want a president that says he's going to respect our constitution the rule of law are our laws on borders and security and respect our sovereignty first\nAnd demand that people respect our sovereignty first then you know where to vote this year All right so in the midst of all this chaos and whining and election season\nUm you know what we have so many differences Kavanaugh caravan taxes borders energy foreign policy my guess is\nYou know what you're not getting your daily dose of black rifle coffee because of everyone had a morning do some black rifle coffee dot com slash shall we probably all get along better because we'd be so happy there's something about this cup of coffee that is so good it is the best I've ever had\nRoast to order guaranteed fresh delivered to your home and the guys that make this company up black rifle coffee dot com slash on oh yeah they're all American heroes\nThey're all first responders they're all bats and there are guys they give a portion of their cells to veteran a first responder causes\nAnd they hire vets and first responders you know what you think of the liberal coffee culture in America\nYou know what their coffee is not even put politics aside their coffee is not that good and when you compare it to black rifle coffee it makes such a difference you pick any blend you want I like really strong robust coffee and I like a black\nAnd I use black rifle coffee club and I try all the different brands and being a member of your going to save money to send it right to your door and you're going to love it looked nothing cures or bad attitude quite like starting everyday with the best coffee ever and that's black rifle coffee dot com slash Sean your first or you're going to get a Fifteen Percent discount\nRemember company founded by ... first responders hires ... first responders donates to vets and first responders and their coffee is the best\nBlack rifle coffee dot com slash Shawn you've got a Fifteen Percent discount tell you about a big Kennedy tonight straight ahead [noise]\nSo on radio show you don't want doing is\nSean Hannity is on\nNow [noise]\nRadio and forty W. H. O. [noise]\nHey Sean Hannity here you're tired of taking huge vitamin tablets unlike most vitamins which are packed with binders pillars non active ingredients superior source micro link will tablets feature only the most important active\nIngredients and our GMO free now most superior source micro link will tablets are smaller than a pie and they dissolved instantly in your mouth no water necessary superior source micro link will instant dissolved tablets are available online or it's proud Spiderman shops and other find stores\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rates stays locked buddy of rates go down your rate drops either way you win\nCall us today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about a hundred and thirty or victory mountains covered cost information and conditions people having liquor licensing office he takes animal I some are thirty thirty initial conditions are exclusion may play\nMany obstacles overcome life's obstacles with traffic and whether on the five mornings and\nUse radio ten forty doubled you wait Joe this is news radio ten forty W. H. O.\nThere's guys said over and I both can be pretty mild at forty nine\nHigh of sixty degrees we will see a few more clouds moving in but really nice\nWeather the next twenty four hours to get out there and enjoy it that easily just weather forecast from channel Thirteen I mean you're all adjusted Wilson\nAnd I'm fifty six fifty five degrees and they're mostly cloudy skies in St winds blowing out of the south and news radio ten forty W. H. O. first thing\nIn the morning and the last thing and I get the news trafficking whether you need from Alexis say electric play ten forty W. H. I. heart radio getting news radio ten forty W. H. and to my heart radium\nTonight at nine eastern on the Fox news channel we will talk about the synagogue shooting that took place over the weekend\nWe'll update you on the election eight days away the president announcing five thousand troops to the border uh Sean Spicer match slap Jason shape it spragins Sarah Rhonda Santas and Rick Scott too important racism Florida whole coming up tonight nine eastern Hannity Fox News hope you'll join us when we come back tomorrow\nWeeks from election day the best election coverage available on your radio down\n[noise]\n\nIf you've ever experienced heart racing shortness of breath or dizziness if possible you could add atrium relation one of the leading causes of mind out before too\nLike cardio mobile the FDA cleared personal EKG device ingest Ninety nine dollars to order visit cardio dot com Danny Kaye hate R. D. I. A. dot com the cardio mobile pets in your pocket and so you can take an EKG anytime anywhere and right when you deal with them in the\nGuardian mobile delivers a medical greedy cagey right to your smartphone and just thirty seconds you know your heart rate them is normal port atrium ...\nCardio mobile today for just Ninety nine dollars that the cardio dot com K. A. R. D. I. A. dot com tick unlimited Katie's morning noon or night she can always know how your heart is doing cardio Mobil much peace of mind and your pocket for only Ninety nine dollars\n... party a dot com boom that K. A. R. D. I. A. dot com\n\n[noise] go um [noise]\nDo any weight Joe ... and I arch radio station and on your age gee radio Katie already eighty to\nAnd boarding W wait Joe [noise]\nRight now today's top stories from Des Moines news traffic and severe weather station news radio ten forty W.\nI'm So Daniel Sam W. H. O. radio news our top story this hour accused synagogue shooter Robert Bauer so Senate Pittsburgh courtroom today he faces twenty nine charges in connection with a shooting in a Pittsburgh synagogue Saturday that left eleven people dead\nAs fast that it makes sense [laughter]\n\nMy God [noise] I Do not come back to help you any advice [laughter] scholar you tend to have to come back every year and a Christian\nCommunity Christian [laughter]\nI\nDon't even try\n[laughter] whatever [laughter]\n[noise]\nFor ten years best presided over these well publicized say on\nThose she stopped participating in Nineteen thirty eight not a single Halloween has passed since without an official Deanie say are held by magicians somewhere in the world is homage to the great [noise]\nWhich is somewhat ironic considering the Harry Houdini was well known for his efforts to do bunk spiritual us mediums and psych\nEven wrote a book about called a magician among the spirit\nWho was a member of the Scientific American committee offering cash prizes to anyone who can demonstrate psychic abilities under the scrutiny of scientific observers deem it would be bunk mediums by wearing elaborate disguises and infiltrating singer tricks of the trade could easily be exposed by one with such knowledge and ... to ...\nBut where did Houdini obtain this knowledge of illusion\nAnd what drove him to such great legs and his efforts to disprove psych mediums and spirituals\nIt was born in Budapest, Hungary march twenty fourth Eighteen Seventy four is Eric ... son of a rabbi in one of seven children his family immigrated to the United states and settled in Wisconsin\nEric began to pursue an interest in magical as his stage name Eric Price became Harry Houdini by having an I took her last name of his idol\nFrench magician Robert Houdin legend has it young Houdini was a print just to a locksmith where he learned to assemble and take apart locks with his eyes closed\nAt Seventeen years old Harry Houdini left his family to pursue his career\nIn magic assisted by his little brother she had to do any began appearing in New York beer halls theaters museums platforms next a snake charmer is fire eaters and human oddities they traveled as far west as Chicago brothers who dean did quite well during the Eighteen Ninety three world's fair\nIn Eighteen Ninety four wall performing at Coney Island in Brooklyn New York Houdini met a performer named ... and they were married quickly before she joined him on stage to become the husband wife act\nKnown as the Houdini\nFor the rest of Harry's career ... worked as his stage assistance\nYet Houdini began Eighteen Ninety nine adrift and discouraged he hadn't made much of a name for himself and I was trying to make a living by doing card tricks and escaping from handcuffs\nHe was also dead broke\nA year earlier you'd attempted to sell his entire\nBut there were no takers\n\nOn our American story [noise]\nThis is Lee Habib with our American stories and I want to tell you a story about my experience and my bride bally's experience with my pillow dot com we gave them a shot because well we just had never found the right pillows I'm telling you folks overnight\nThe neck pain went away and all of a sudden it was a night of ... and ... my wife went from one style I went for another hurt a little bit more from mine less and what are you know you're making your own pillows and you're sleeping beautifully at night\nSo order your my pillow go to my pillow dot com or call eight hundred three o seven nine four seven to and give them our promo code story to get their four packs special\nIt's fifty percent off on two premium my pillows and two of their go anywhere pillows or you're traveling trains planes are hotels or anywhere else but only if you use our promo code stories at my pillow dot com [noise]\nSports there's guys tonight overnight lows or can be pretty mild according\nA high up sixty degrees we will see a few more\nClouds moving in but really nice weather the next twenty four hours to get out there and enjoy it that easily just weather forecast from channel Thirteen I mean you ... just that will\nAt ten Fifteen at fifty five degrees and they're mostly cloudy skies at New Jersey uh ten forty W. H. O.\nMm\nWith one very directly with the news to me and there are some things have changed\nYounger son shoes on and on and the ... the money\nFor those who create the pop culture\nLose is no longer\nLetter in the mirror and\nOne of those thirty seconds over to heal meant\nThe Ronald Reagan station news radio turned forty W wage you\nGet a grand in your hand you could try trick or treating there you go that's right and the best they can ... your ... should not get catch a game\nYou can try to text in when the sounds of dollars to sixteen times a day every weekday\nWow that's a scary Hillary as though you were to John big shame thing belly magenta eliciting\nWhich began with a lot of weight shuts around here here's your sounds and news radio ten forty below the wait Joe\nThis is where you'll be haunted by the voices we really very scary and this\nIs\nOver who should be there if there is scared and they are scared\nRefined topics or something that will cause people to scream at a major blow in\nListen if you dare\nComing from the radio\nNews radio ten forty\nDoubled you wait Joe ...\nLoser radio and forty [noise] you have seen chances every weekday when I was in ...\nAnd we were just two hundred\nFor a shot at a thousand dollars I checked then\nWhen I can in the morning and then the afternoon\nAnd then gee posting every all\nHave you ... and another shuttered Graf\nMade my day use radio ten forty WHM\n[noise]\n\nWhich I didn't hear the story of the great Harry Houdini who at this point who drowned moderate she says it hadn't yet become famous\nAs big break came in Eighteen Ninety nine when he met manager Martin back in St Paul Minnesota convinced who need to concentrate on his escape it into her to Europe and the show was an immediate success is salary rose to three hundred\nDollars per week with his newfound\nWealth purchased address and to have been made for Queen Victoria you didn't arrange for Rand reception where he presented his mother and the dress to all of their relatives who Deanie showed was the happiest day of his life [noise]\nAnd I do you know for he returned to the United states and bought a house for twenty five thousand dollars in New York City [noise]\nHarry Houdini had arrived but his popularity was just beginning\nJoshua Jay's is successful magician and respected Harry Houdini expert and joined us from the contemporary Jewish museum in San Francisco [noise]\nAll right let's talk a little bit about being in a metaphorical sat who is going to any\nHoudini is five foot three\nIs considered at this time period and outsider Hungarian an immigrant and a time when more immigrants were coming into the country than ever before he's a minority and Jewish\nSo already you have a lot of things that people in that time viewed as stacked against you it was an outsider he wasn't thought of as American\nAnd yet somehow he became America's first superstar and he really was that's not really even a debatable statement he was America's first superstar because although there were\nPeople who are famous actor is on the stage and later in silent pictures they were famous for portraying other people other powerful papal Houdini was famous for who\nVictims of Saturday's synagogue shooting but the president tells boxes the Ingram angle he is headed\nThere I Would have done it even sooner but I didn't want to disrupt any more than they already had disruption [noise] uh but I look forward to going to Pittsburgh tomorrow\nThe first step eleven funerals for victims to be held Tuesday a suspicious package it the New York times building in Manhattan but local media reports the building's been given the all clear after it was found to contain only paper\nThe world series champion red Sox getting a parade in Boston Wednesday city police commissioner William Gross mourning fans\nCall go home will not be tolerated and you should know this just should be common sense but no weapons at all the red Sox took\nThe series after beating LA five to one game find\nI Am Brian from Des Moines us sixteen chances every weekday two hundred dollars a month and I just want to sell them dollar every hour all day\nRadio and forty that'd be heartening\nTired of crushing candy past ... is the answer\nPuzzle game like no don't miss out on solving thousands if I'm\nTired of crushing candy best beans is the answer it's a puzzle game like no other don't miss out on solving thousands upon puzzles and\nWe've all seen every one talking about the new iPhone ... on the Internet but now you have that in your own and I feel like if you want to get one but you also know\nCollecting tons of two characters with new levels every week and daily event you'll never ever get bored play against your friends and family in fact they're probably already play click now to download that means for free for a visit the app store or Google Play that struggle\nAnd collecting tons of ... characters with new levels every week and dandy event you'll never get boys play against your friends\nThey're probably already playing\nNow to download for free or visit the ...\nOh that you need to get some good offer in order to obtain this brand new phone you gotta haul their ... their best offers now you gotta have the best photos on social media right with the I don't\nYou get the true gets camera that means more advanced large amount and smart H. T. R. which to me is that read a lot of you here according to do\nNow is the tide and wherever you are is the place\nThe citadel makes it easier to earn your degree by offering master's degrees graduate certificates and undergraduate degree completion programs that are entirely online these programs are convenient for\nWorking professionals and those serving in the U.S military continuing the citadel legacy of academic excellence classes are held to the same high standards that consistently named the citadel then\nWe're going to see mostly clear skies again as we go to the overnight to very mild temperatures forty eight degrees tomorrow highest sixty it will be another sunny day will see the\nWind's not quite as strong as today so perfect time to get outside and enjoy a great for beggars night as well on the Wednesday Halloween still comfortable high temperature fifty eight degrees and mostly sunny skies that is the news radio ten forty W. H. O. three day weather from channel Thirteen I mean you were all just at Wilson\nFifty five degrees and mostly cloudy skies at news radio ten forty W. H. O. American\nStories and for all that we do by the way to go to our American network dot org\nStories about everything and that last segment we heard about how Houdini\nWas the twenty fifth person to fly in the air just years after the Wright brothers did go to our American network dot org and listen to David McCullough for the hour talking about the Wright brothers is terrific new book\nThe Wright brothers are not so new but knew if you haven't read it and you can hear the whole story at our American network dot org just typed the Wright brothers in there and you'll hear David McCullough walk us through in all of us through one of the great stories of American Life\nAnd now we return and continue with the epic tale of the great Harry Houdini where he was suffering greatly over the loss of his mother\nAfter the death of his mother the great Houdini was in the throes of depression the story from here usually goes that after his mother died Houdini attended ... says in the hopes to communicate with her and then he found\nWas fraud you then set out to expose fraudulent mediums and launched a new a new wave of his career as an anti spiritualism crusader ... bunker and it's a good story [noise]\nTrouble is it's just not true the notion that his mother's death blood directly to his anti spiritualism crusade has grown to become one of the most popular Houdini mess it would be ten years before Houdini unmasked his first media [noise]\nThe truth genesis d'nese anti spiritualism crusade is rooted in his friendship with sir Arthur Conan Doyle author and creator Sherlock Holmes\nAfter World War one spiritualism became extremely popular Arthur Conan Doyle\nLost his son and the war became a passionate champion of the movement\nAlthough Houdini insisted that spiritualism mediums of Floyd trickery ... became convinced that Houdini himself\nPossessed supernatural powers here's the voice of sort of Arthur Conan Doyle from\nA recording in Nineteen thirty where he describes his view of spiritual\nNature Seventy some Julius ... experience is my\n... I was ... by the fact and let me\nMy show ... with a friend [noise]\nShould do any kind of mine she couldn't communications visit ...\nWith ... [noise]\nA trendy ... famous sign on to the conclusion\nSuch communication wash\nThem getting a shutdown censorship factory on\nChurch family size\nCynical off my wife and I felt Saddam always you know\nWhile on the beach one day sir Arthur informed Houdini that his wife the lady Doyle I developed the power of medium ship herself was sent some that Houdini was deceased mother wished to communicate with him\nPrivately best Houdini had warned her husband that lady ... had been pepper in her with questions about his relationship with his mother just the day before\nNevertheless Houdini agreed to the ...\nDuring the ... mother appeared to return through automatic writing process in which the lady Doyle transcribed words from beyond until we know fat immediately Houdini could see problems\nPages were English language his mother did not speak she also made the sign of across the top of the first page\nNot something you would expect from the wife of a rabbi\nBut Houdini concealed is down and think for the oil for the ...\nSir Arthur told the press that Houdini had been converted into the religion of spiritualism\nHarry Houdini countered publicly that he had not been converted and that he was more skeptical than ever\nThis raised the question\nOf whether Houdini soft on the door\nThe public exchange put a strain on the friendship and Harry Houdini began to incorporate the debunking of spiritualism into his stage performances\nThose or what have you believe that they can foresee the future ill loans\nTalk to the debt [noise]\nTable ... class mixing\nThey'd rather we exercise I've fantasy brains [noise]\nNot invested years reaching across the ...\nI wanted to talk to one single saw how hard could that be\nShe died on thought on I ...\nThat twenty thousand meaning ends practicing today and not in a token does and I was like ten thousand dollar more than that\nIf they're checking the ones\nThat have been no passengers on the Titanic\nThat have been no deaths in the San Francisco quick [noise]\nIf those can in having any self proclaimed ... one of the lowest ones like\nWhat is your your poodle was one of the next train man\nPromoter murder why\nHere again is magician Joshua Jay with his perspective on Houdini quest to challenge spiritual\nBy this time you've achieved more than probably would never even thought possible for a magician is one of the most famous figures alive but something that he's getting older [noise]\nHe's famous for being a dashing young immigrant magician\nMaking these escaped showing up as a colony of his body but now he's bordering fifty years old is not quite as quick on its feet and he realizes that the last part of his career will not be as dynamic physically and the first part [noise]\nSo what do you where to go on and it's the same question great actors and rape thing or when they achieve so am I now have to reinvent\nShe was more than a magician or an escape artists\nHe was somebody who was popular culture he was by all means the biggest star zero\nAnd um I think\nOf his success king because he understood what the public wanted [noise] even more so understood how to create that interest I always said that if you cut Houdini with a nice [noise]\nPress would master at that and uh that inspires me\nMagician illusionist and comedian Penn Jillette is famous for his work as half of Penn and teller\nThere's a fascinating thing about it is a\nDeeply fascinating and then I Can't think he tried to maybe sort of put Bob Dylan in this category\nOh but it's very hard to think you may be sort of try to [noise]\nTry to sneak in ... try to sneak in Miles Davis\nBut trying to find someone who in their career made a philosophical or moral change while they were famous\nI'm someone who is come out and redefine themselves in a moral way Houdini became hugely famous as an escape artist\nSaying to a nation of immigrants uh man born in Budapest and then standing I mean there's a picture of Houdini in in times square hang upside down in a straight jacket with a whole sea of mending hats\nPicture makes me cry every time and then who d'nese publicity statement I defy the jails of the world to hold me\nI'd be should do a badge of a more heavy more I mean from a rabbi son from Budapest I mean these are anything more your early American than that he gets to be a superstar\nAs an escape artist he gets himself into dictionaries just an escape artist we look back on the twenty century and a hundred years and look at um entertainment the only two people in the running for being remembered in the twenty century or Elvis Presley Jeanie and as time goes on Houdini he's winning\nWhen Harry Houdini and his entourage arrived at the garrick theater in Detroit Michigan on October twenty fourth Nineteen twenty six he was running a fever two days earlier Houdini had been resting in his dressing room prior to his show in Montreal when a college student named James Gordon Whitehead approached him it's difficult to determine exactly what happened\nFrom here as accounts from eyewitnesses are slightly conflicting however the general story seems to be the white had asked\nHoudini if the claim that he could withstand any punch to the abdomen had any truth to it Houdini assured him that it was true in gave him permission to see for himself Whitehead immediately took several jobs at Houdini mid ... supposedly didn't have\nA chance to prepare for the blows from over exuberant Jay Gordon Whitehead the punches inflicted more pain than Houdini anticipated yet he insisted that the evenings schedule performance must go on [noise]\nAs you're reading the newspapers this morning ... has been challenged to liberate himself from a Steelers break Jackie [noise]\nMaybe in the performance with several vanishing acts coming with making a woman disappear encountering a flower shrub in her place he made it through the first act but his condition worse and and he was forced to finish the show ... finally gave in and agreed to go to grace hospital in Detroit to have an emergency appendectomy\nDoctors performed the surgery but the damage was already done\nHarry Houdini held on for about a week a grease hospital\nFinally succumbed to October thirty first Nineteen twenty six [noise]\nHe was fifty two years old [noise]\nWhich is where our story ends as it began on the night of October thirty first Nineteen thirty six on the roof top of the ... hotel in Hollywood, California ten years to the day\nAfter he died\nThe great Houdini made a pact with his wife best that he would make every attempt to communicate with her as a spirit from beyond the grey after he was dead\nSo every year on Halloween the widow of Harry Houdini held his hands for him the night of his departure for the next ten years without ever making contact\nIn this the tenth and final say\nGolden ... were sent a three hundred guests reporters than Hollywood elite lights as far away as New York would do\nOne minute of silence was observed\nFor the ceremony ... to the climax at\nFinal plea for the great Harry Houdini to reveal himself\nAnd yet at the end of it as as recently as last week the\nUs [laughter] [laughter] hey wait\nA minute [laughter]\n[noise] [noise]\n[noise] [noise]\n[laughter]\n[noise]\n\n\nAnd I\nThink\nThe evidence was in\nThe great Houdini made\nHis greatest\n...\nSend great job is always and that's just the Edwards and\nThank goodness when he hits a dirty hits it out of the park\nAnd just listening to that what a stun Harry Houdini created\nFor all those lawyers and all those false profits you expose them even in his grave setting them up for the kill a master that's a big event\nAnd by the way what an American story born in Eighteen Ninety four\nBudapest, Hungary son of a rabbi a Jew and outsiders outsiders and his new country and he becomes the biggest star there ever was and again it was pointed out early he didn't play someone else like the Valentino is the early movie world\nHoudini played himself\nEnd for rock a tour\nAnd he understood as one person said what the public wanted a life of Harry Houdini\nWhat a story here on our American stories and listen to all the we do\nGo to our American network dot org that's our American network\n[noise]\nAre women our adversaries in today's world do not have oh\nCash for the enemy so afraid of\nThose who are potential adversaries\nThey will be reminded them piece here is the highest aspirations of the American people\nThe Ronald Reagan station news radio turned forty doubled you wait Joe [noise]\nDo any way to do go on and I arch radio station and on your age the radio\nKatie are be Eighteen to\nUse radios and forty W wait Joe\nRight now today's top stories from Des Moines news trap began severe weather stations on the news radio ten forty W.\nI. Gary Barrett WHM radio use our top local stories is our\nClients to narrow lanes on Flora drive and make it more ... friendly in Des Moines will cost about twelve million dollars but others say the roads too important to experiment with narrow lanes\n... multi track\nI changed every [noise]\nSome land because here's their class and [noise] the records\nAre ... by less prone and married for ... I was even aware then without any note in your bum a recording techniques that they were doing something revolutionary\nA return to tape machine John [noise] they're just a standard regular and ...\nAs I recall there are about a dozen all twenty voices I mean that was the ... minute all married so I said oh\nYeah well I think the way they know how the low\n... now and it can affect I [noise]\nI ... I\nFound a way I don't\nHow long has it gone without getting confused and you hit\nIt cued by other well would you like to hear that I read I\nRead is\n[noise]\nHere just that [noise]\nHe made sounds nobody\n[noise] I remember my mom saying you shouldn't listen to this music excite she says this one guy tricky off [noise] so I got the best not to music from because it enables me to be rebellious as well and I enjoyed the film\nI think you can beat that I mean the way that those record sound is still exciting\n[noise]\n\nMagnetic tape an artist would come into the studio\nThey would be recorded live\nWhat they would do is literally actually grooves into the discount as this session was being recorded\nYou had to start from the beginning and go to the end she made mistakes too bad or you had to start over\nWould you choose a completely new the possibility to record infidelity was better than anyone ever even come close to two can make more accurate document\nThat the same time it lets you manipulate sound so it didn't sound lifelike at all because now you can get it you can over Doug you could cut misplaced\nOnce the technology came out very quickly became the standard for now [noise]\nAnd\nWhen we come back we continue this remarkable story this tale of innovation and music\nIs a vital part of the store\nTo store in the multi track recording continue to cheer\n\nWell why ... why not\nWhy that fellow that there are a lot of those out there\nAlex court clubs here with our American story this is me having a strange conversation with my three year old Penelope\nNot telling you this was not teach after so many times of her randomly telling me that she wants the premium my pillow too after her old man got one I finally decided to record hurricane waning\nMouth Karol out that all\nThe sad thing for a penalty is her birthday just passed and her father is Monday caught shit so she was going to have to wait a while but we did just find out that my pillow was running a four packs special that's fifty percent off so\nI just gave in to get your previous my pillows go to my pillow dot com and use our remote coach stories the get the discount\nMaryland part wow oh signing\nSome people still thinking education from northern Virginia community colleges just settling the thing is\nWith officer dot com dome is your chance to be part of history and uh making busy at high time investor dot com that high times investor dot com\nHuts I'm holding corps operate will be made only by means of offering circular which has been filed with unqualified by the U.S securities Exchange Commission the security's are highly speculative investing and chairs and kind of stuck in case\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal ad time drain so I was in my man cave researching personal loans and I found the best egg to have an a plus rating with a\nB collecting tons of two characters with new levels every week and daily event you'll never ever get bored play against your friends and family in fact they're probably already playing and click now to download that means for free for a visit the app store or Google Play that\nThe commercial airline industry is booming\nWith this level of demand the industry needs more aircraft technician we are the aviation Institute of maintenance and we trained tomorrow's technician the bureau of Labor Statistics report the average aircraft technician in the DC area make over sixty six thousand dollars a year\nVisit trained tomorrow dot com or call eight eight eight\nYou have an old car taking up space be a hero and support our nation's veterans by donating your car to the Purple Heart foundation your car donations to the Purple Heart foundation helps all veterans get the benefits they've earned deserve donate today\nAnd I ... a Purple Heart dot org\nStill putting off a building that dream home\nNow is the perfect time to talk with us about a mortgage loan\nMany options to consider find you the loan them right for\nCall today and let's get started\nWhen you meet a veteran you're meeting a hero\nWhen you donate your car to the Purple Heart foundation you are a hero someone committed to sing that our veterans get the benefits they've earned and deserve to\nGo to my heart Purple Heart dot org like donating your car today to the Purple Heart foundation you're helping a veteran with their ... benefits post traumatic stress jobs [noise]\nGonna see mostly clear skies again as we go to the overnight to very mild temperatures at forty eight degrees tomorrow high up sixty\nIt'll be another sunny day will see the wind's not quite as strong as today so perfect time to get outside and enjoy and great for beggars night as well on the Wednesday Halloween still comfortable high temperature fifty eight degrees and mostly sunny skies\nThat is the news radio ten forty W. H. O. three day weather from channel Thirteen I mean you were all just stayed Wilson eleven thirty two it's partly cloudy and fifty four degrees news radio chance forty W. H. O. ...\nSays le ... be and this is our American stories and we tell stories about everything here on this show\nHistory arts the culture and your stories to\nSend them to us in our American network dot org we'll put them up on the air and we're doing that just right now by the way some of these stories are beautiful some of these stories are hard\nSummer both and I think this one is and this one comes to us from one of our listeners in Des Moines Iowa and the the home of the mighty W. H. O. one of the great heritage signals in this country\nAnd it comes from joy new kidney\nAnd World War two her grandmother sent five sons to war\nOnly to only two came home\nHere Joyce shares how her family has honored these men\n... ... ... s\nNeglected gravestones over Memorial Day\nNo flowers no one to remember\nThis would never happen in our family\nGrowing up I knew that my mother's five brothers had served in World War to\nEnd up to three youngest had lost\nThat line there sepia tone photographed all in uniform where suddenly you're part of our home\nThose same pictures posed for decades on the chest of drawers and grandma's house\nI grew up with women who observed every Decoration Day as it was called then [noise]\nI could have asked for details about those young brother\nBut knew the answers would bring cares so I didn't [noise]\nIn fact Memorial Day was a wonderful time for me as a child [noise] as it meant an out into the big town of Perry for lunch and shopping with grandma\nHis Gloria in at Darlene either mom\nDarlene would pick up the other both toting pale pink pennies coral bells and blue Irish from their own gardens\nCarried in the trunk of the car they spring blossoms were for the cemeteries\nWe drive the dusty gravel roads in Madison County\nThan the hills of highway twenty five to grandma's house in Guthrie center where she would be waiting with her best flowers including what she called little yellow button\nGrandma's parents and some of her siblings are buried there and the Guthrie cemetery so we'd leave flowers there first to remember them\nBefore heading east to panther corner [noise]\nPerry is a few miles north of where the old panther store used to stand [noise]\nWe'd skirt Perry's downtown toward our main mission violet hill cemetery in the northeast corner down\nWell most husband is buried there\nAnd there are three sons who were lost in the war\nOr so I thought the will systems are in the east section with stately evergreens\nWeigh three generations would solemnly delivered the flowers from the car to the Wilson to dump everything seemed touched\nMe for the for name's Dale Daniel Claiborne Jay\nWe'd secure metal basis with wires mum had cut from cold hangers then we'd fill them with are passed down okay nice de la ... mentioned [noise]\nI remember her shedding tears there only one [noise]\nThe mood lightened on the drive toward downtown [noise]\nI don't remember what the grownup said but we young sisters were treated hamburgers and coax in a real cafe east of the library and shopping and visiting [noise] for young girls from an Iowa farm near the small town of Dexter this day was\nA yearly treat when it was time to start back home we'd always drive by the old Wilson acreage miles south of sixteenth street [noise]\nGrandma and her daughter's always wanted to see how it looked after so many years\nAnd how much the trees had grown that they had planted in the Nineteen forties [noise]\nThrough the decades different family members\nWould make that annual Memorial Day trip to Paris with grandma [noise]\nOne or two event Darlene sons went along\nAnd later on even my own young son [noise]\nGrandma died in Nineteen eighty seven leaving a cedar chest full of old postcards letters\nPictures and the terrible telegrams [noise]\nAfter mom and dad Darlene relived the war by reading through them [noise]\nThey shared that with me [noise]\nI realized for the very first time\nThat only their youngest brother junior is buried in Perry cemetery\nDanny Wilson obese thirty eight pilot who was killed in action in Austria is buried in France [noise]\nDown Wilson the coal mine that on the twenty five [noise]\nWas lost off the coast is getting his crew\nOnly God Knows where there remain dry [noise] I was determined that when mom and dad Darlene who is Dale twin [noise]\nGot to the place that they can no longer\nMake the trip to Paris to remember their brothers and parents for Memorial Day\nI always get it done\nSo I thought [noise] my ... got to the place where I get no longer make the trip [noise] one day my husband and I stopped by just see this don't once more\nI realize it because ... official date of death is lifted his Nineteen forty six\nMonths after the war ended\nNo one would understand that he'd been work as a [noise]\nA few admissions to all three stones would tell them more of the story of what this one family had endured\nMama Darlene agreed and the information was added\nOne stone commemorate Dale and Danny\nMaking clear that they were both killed in action\nThe center stone marks the grave of junior\nPie forty exploded information training in Texas\nIn August Nineteen forty five\nAt the very end the war\nThe brothers were age twenty two Twenty one and twenty\nFather clay died next year the stroke\nSurely another casualty gets the more even though no family members separation we remembered the well since for Memorial Day\nThat our freedoms cost is one Dallas County family must never be forgotten\nAnd it's not forgotten here joy\nAnd thanks for the peace [noise]\nAnd Danny Dylan junior [noise]\nThe sacrifices won't be forgotten in here in our American stories we don't forget [noise]\nAs often as we can bring back history to life is it still alive folks and it matters the stories matter [noise]", "show_name": "Our American Stories", "year": "2018", "city": "Des Moines", "day": "30"}