{"month": "10", "state": "IA", "station": "WHO", "content": "In twenty five days you know these off year elections are about one thing and that you showing up and in this election year well it's one of the most important in decades\nYour tax savings or on the ballot the economy is on the ballot America's comeback is on the ballot your jobs are on the ballot your kids jobs are on the ballot your wages four O. one K. that's all on the ballot business owners tax cuts are on the ballot\nThe biggest issue on the ballot also who's in charge of America's future\nIs it going to be the politicians and the bureaucrats in DC or we the people that if you want to preserve the victories of the past two years to get involved go to this website tax cuts were dot com\nOr they're going to make it easy to help you do your part make calls and emails text knock on doors or take a neighbor to the polls whatever tax cuts work\nDot com I the only way we lose is if you don't show up right so we could otherwise wouldn't shocked the world again tax cuts work dot com do your part tax cuts for dot com\n\nDrawn Hannity's shocks of the people involved in the big news stories every day [noise] Shaun Hannity [noise]\nRadio on the\n[noise]\nIf you're concerned about your heart health or knows no more than you should consider cardio mobile the NBA cleared personal EKG device for just Ninety nine dollars cardio mobile delivers a medical grade EKG right to your smartphone\nAnd it fits in your pocket you can take an EKG anytime anywhere to order the cardio dot com that'd be a A R D I ate dot com and give you feel heart racing or other symptoms\nTake any Katie on your phone number thirty second you can have peace of mind knowing your heart rate them as normal cardio is also prevented attacks atrium relation comment heart condition and a leading cause of struggling to order cardio mobile today mythic cardiac dot com K. A. R. D. I. A. dot com\nMorning noon or night cardio mobile that you take on limited medical grade EKG go\nAnd joined the peace of mind ... today for just Ninety nine dollars a week with the cardio dot com K. A. R. T. I. A. dot com [noise]\nNow do\nYou win the biggest names in the news on the ... law for newsmakers by\nLetting in law from your first call for in a lotta workman's comp or personal injury claim\nIn auto we're proud of our state our fields and are farmers and went up ... president of the I have a corn promotion board that's an old is the large market for Iowa corn\nWe're working with an egg ethanol route to work with high octane low carbon fuels will increase most preeminent decreasing missions we also partner with the American lung association on the health benefits are filling up with ethanol\nResearch shows a decrease in harmful emissions from transportation when you fill up with an all at the bottom\nFor more information go to ... dot org\nAnd we'll have another chance for that to the Monday on\nAnd what I Love my right around forty one degrees\nTomorrow highest fifty seven it'll be partly to mostly cloudy on Saturday Sunday again partly to mostly cloudy a high though of only forty five degrees that's what we normally see in the middle of November and there will be a chance for rain snow mixing up by early Monday a Monday does look dry though by the afternoon\nThat is the news radio ten forty W. H. O. three day weather from channel Thirteen urologist did Wilson\nCloudy and forty four in Des Moines it feels like forty degrees Windsor as the south south listed six miles per hour this is news radio ten forty W. H. O.\n...\n[noise]\n\nA lot of breaking news unbelievable video literally the rates of the Senate than Arizona's exploding right in front of our face same with Tennessee\nThat's good news for more than ... Sally and Marsha Blackburn Hannity tonight John Sununu Herman Cain joke conscious Haley ... match slapped Jim Jordan rank Jarrett nine eastern Hannity tonight on the Fox news channel have a great weekend when we get back twenty two days till election day the most important midterms in our lifetime\n[noise]\n\n\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments\nAt Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty\nIt's called ... and here's how it works with Rachel you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get the lower rate with ratio we really have you covered\nYou're more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage rich nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing ratio\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nIsn't right and what you said in comparison Odessa records which will prove only balance or thirty approaches transactions call for confirmation conditions equal housing wonder licensing office he said and I'm watching for thirty thirty additional conditions or exclusion may apply news radio ten forty doubled you wait Joe when you\nDon't want to wait Joe Joe ... and I arch radio station and on your age the radio Katie R B H [noise]\nW wait Joe [noise]\nRight now today's top stories from Des Moines news traffic and severe weather station news radio ten forty do hold you\nI'm Daniel than W. H. O. radio news our top local story this hour there was a high speed chase that ended near a mini\nYou got to singing gig and in no time the music execs could see where John star was headed [noise]\nBut they first saw complications with his name\nOne day there was this big heavy meaning they sat down I said listen kid [noise] sectioned off I've got to go\nRandy says that they asked them to change his name and drawn so no I Will not give up my father's name I'm proud to be a door to door and\nBread and won't put on the market to change or they had a minor hit at the time called Denver written about the city and the ... music was on the wall behind a desk job dead for\nNow with his new name John Denver set out to make it as a folk singer\nThe opening came when one of the big names in the folk circuit the Chad Mitchell trio lost their lead singer hundreds of young vocalist audition for the spot\nBut John was the obvious choice here's Mike ... book one of the trio singers\nJohn was fined musician an excellent musicians are very trying\nA twelve string guitar player\nThere there was a\nAn innocent site thank you in a way that whereas believable [noise]\nThe Mitchell trio was trademark was political satire\nJohn's innocence was on full display\nSays well I don't know anything about politics [noise]\nDrawn it's politics\nHe said that's what I'm saying I don't know anything about\nThe Mitchell trio his main audience were university students in the spring of Nineteen sixty six [noise] they were just Davis adults as a Lutheran college in St Peter Minnesota\nIn the audience was a sophomore student [noise] any march tell\nI was [noise]\nTwenty ... twenty three very young but I thought he was very glamorous very wealthy he was not at all [laughter] so\nThat you were married in June Nineteen sixty seven\nJohn began writing songs and recorded some of them at his own expense\nSending the album out as a Christmas present\nTrack three of the album was called babe I hate to go\nMitchell trio producer milk ... like the tune\nJoe and that's a terrible name river beautiful song\nWhat were your core [noise]\nShould refer third volume of course you've ever heard of song\nVersus a good name was ...\nCheers that original John Denver record\nAll the time I'm ready to do though I Do\nNot have to wake you up to say a\nMilk OLC and pass the song on to another one of his acts Peter Paul and Mary and it became their first number one hit with the Vietnam War at its height the songs\nA deep nerve and became a favorite amongst troops\n[noise] I ... no\nThis is\nOur American stories John Denver story continues after these messages\nMany times on that now so many times and\nThis is Lee Habib with our American stories and I want to tell you a story about my experience and my bride rallies experience with my pillow dot com we gave him a shot because well we just never found the right pillows and I'm telling you folks overnight\nThe neck pain went away and all of a sudden it was a night of three and ... my wife went for one style I went for another her is a little bit more from mine less and what are you know you're making your own pillows and you're sleeping beautifully at night\nTo order your my pillow go to my pillow dot com\nOr call eight hundred three o seven nine four seven to and give them our promo code storage to get their four packs special\nIt's fifty percent off on two premium my pillows and two of their go anywhere pillows were you're traveling trains planes cars hotels or anywhere else but only if you use our promo code stories at my pillow dot com [noise] now do\nYou win the biggest names in the news on the ... law firm newsmakers by\nLetting in law from your first call for in a lotta workman's comp or personal injury claims\n[noise] ...\nPretty steady temperatures that I didn't you notice this morning we did have some white snow there is another chance the battle of lake Sunday there early Monday but until\nThen a loaded died of a forty three degrees tomorrow we'll have a higher fifty seven mostly cloudy for our Saturday that is the latest weather forecasts from channel Thirteen embody religious did Wilson\nCloudy and forty foreign Des Moines news radio ten forty W. H.\nI. V. no\nAnd\nThen I have\nThis is our American stories do we continue with our this day in history celebration of the life of John Denver and his music\nAnd we return to Greg in order to this very day leaving on a jet plane strikes a nerve in life and death here's Peter Yarborough from Peter Paul and Mary\n[noise] I'm a on the board of directors of the first hospice in America in Branford, Connecticut and I sing the patients and there was one time that somebody asked me\nTo sing that who I knew was not going to be with us and as I said I realized how\nThat lyric goodbye was like a farewell\nOf sorts\nA in a in a more profound and different way and they in a moment where it says [noise]\nI won't happen just bury\nMe in my\nWaiting for me\nIf you are small business owner go to job creators network dot com and learn how to join the important group helped keep the American dream alive and go to job creators network dot com now and joins\nDean was very very big surprise gone my\nVoting coming November sticks in the mid term elections searching the defining moment or\nElections do matter to choose to store it brought\nEverything is at stake chop down\nPercent of the time for information right now\nNews radio board and forty W. H. Joe\n... Robert dire conditions for many who are stuck in the aftermath of hurricane Michael\nMoore words can't you can't compare to none of this stuff going on ...\n... new book called the day without water up on my ... my ... not\nJohn Richardson says he has no money and no way to leave a mobile home near Panama City Florida and the storm killed at least ... fourteen people but that does not include the bodies found in Mexico beach friday\nA lot of areas affected but we just want to give everybody our love\nPresident Trump at a rally friday in Ohio meantime he says the U.S and others want answers about the disappearance of journalists ... after visiting Saudi conflict in Turkey\nA lot of people are lucky to find out because it it is potentially a really really terrible situation so we'll see what happens this is Fox News\nWhich is coming in the morning on October resented my journal this election was about to Americans go to when he\n\nRona gun stores running a jingle fall firearm sales Wednesday October tenth through Saturday October ... ten days\nTo buy it ridiculous will try another eighty dollars ... eighty dollars all of a shift image GM to boil ... other deals lower prices on ... and ...\nWell no I eighty I did one eighty June Grinnell\n... I mean fire archive of thirty for thirty dollars\nMeta home tech makeover that's by is here to help starting to get free and home confrontation once you find you the perfect tech we can deliver it and make sure and working for me ... all the help after we're done we weren't all your attack on the type that by let's talk about what's possible radio\nI Do notice this morning we did have some white snow there is no chance of battling Sunday early Monday but then\nOf a load of night of forty three degrees tomorrow we'll have a higher fifty\nSeven mostly cloudy or our Saturday that is the latest weather forecasts from channel Thirteen urologist did Wilson cloudy and forty four in Des Moines news radio ten forty W. H. O.\n[noise] expected the Rocky Mountains feel a Little Rock here in this [noise]\nI was thinking the same thing [noise]\nThat John Denver shovel and\nMan [noise] Jim Carrey and Jeff Daniels\nFrom dumb and dumber and we're celebrating John Denver his life and other stay in history segment that we\nDo with ... college and by the way I just got to get back to that lyric from Rocky mountain high he was born in the summer of ... twenty seven year coming home to the place you'd never been before\nAnd I didn't hear that we were until I just started now I Know we've all had music in our lives we've heard the lyrics and we didn't know what the heck we were listening to until we actually listen to it\nAnd now back to John Denver story the Rocky Mountains where John's retreat well at home\nIn Aspen in Nineteen Seventy four he wrote his most famous song\nTo write my\nMan in\nLatin nine in for the\nLast minute and then friends um\nMy mom in their reading\nJohn and I were in our kitchen [noise]\nWe had had an argument [noise]\nWe had an argument and then we had shorted it out and she left to go skiing [noise] come\nTo me\nThere was nobody on the mountain when I started out that day I see down this very tough run all out of breath skied right onto the list\nI was riding up again sitting there catching my breath looking down where I just been a few moments ago all the physical stuff going on\nWhen suddenly I was hyper sensitive to how beautiful everything was the sky was blue you only see the mountaintops then I became aware of the other people skiing the colors of their clothes the birds singing\nSounded to lift the sibling sounded the skiers going down the mountain all of these things filled up\nMy sense is what I said this to myself ... images came on after the other\nNight in the for a walk in the rain\nThe mountains in springtime\nAll of the pictures merge [noise] and then what I was left with within\nThe ten minutes took to reach the top of them out your song was there\n\nWonderful for me because I've heard that in elevators I've heard that in St Mark's square with violent as my daughter\nPlayed at her wedding [noise] um [noise] that people still carry that with\nAnd it's just a it's a beautiful beautiful beautiful guest\nJohn Denver's rise to stardom coincided with a bleak time in American Life\nWith the Watergate scandal gasoline shortages and he ended the Vietnam War is simple songs of loving nature struck a chord across war weary America\nSun shines\nOn my show\nMakes me happy\nJobs songs offered a refreshing affirmation of kindness in contrast to the steady stream of opposition in protest music that was emptying\nOut of Americans radios in turntables but not everyone like John Denver\nIn the rock music press he was widely load your gi brown from the Colorado Music Hall of fame\nThe last interview I conducted withdrawn was in the early nineties and we got around to the topic of his detractors\nShe was called the Mickey Mouse of rock that Ronald Reagan of talk what he was going to read about was what it meant regarding just fair to people but at the University of a child to the news or or gotten married to one of those songs that they were being disparage that anger do got to got under his skin\nJohn would sing to Eighteen thousand people and the music critics would to just talk about how how ... music wise and everything and the last tagline was but the Eighteen thousand people seem to enjoy [noise]\nThere was also those who had a love hate relationship with John's music\nHere's a story from Johns friend Ron ...\nWomen like oh we have this a house boat and we found is beautiful little circular um bay you know where the ... what about a foot cliffs all the way around it like a real natural amphitheater right when the sun went down another boat came in\nAnd just parks like about twenty yards away from us [noise] they didn't know how we work\nSo that night uh John ... just gets higher and go in the middle of this little bay and full hears voices reflect back to that with a look at war with Iraq and so he's in the middle of the obvious songs any\nSingle got the thing it's got like three echoes speeding back and he's you know just having this great time just working with his vocals and senator songs that he's working on and then all of a sudden the yeah the other people are boat turn the radio up real high just drawn to solve our will\nAnd we are we just started laughing or those nuts and how she could do is like here we are ... or thousands of people pay good money to see him and here he is a free concert and ... and they know I'm I'm All right\nSo we go back and you know ... for the night and then the next morning as we're getting out there John's interest or you know pulling things you know as I'm driving the bowed out\nAnd the and those people are out on the deck and they see John ...\nIs Sean\n... it just goes off it decides that\nJohn Denver was a hugely popular entertainer his concerts often had the reverence of a religious gathering he put together a stellar banned many of whom played for Elvis including guitar legend genes Burton\nHe could put people in the palm of his hand\nIt was just like the\nOne on one you know\nVariance ladies and gentlemen\n[noise]\nBecause the critics\nJohn was one of the first celebrities to use the same to promote conservation\nHe formed affirmed friendship with legendary French naval officer in underwater explorer Jacques Cousteau\nAnd I met capital Cousteau and the and all of a number of the the calypso a data believes in the in Central America\nAnd I had these words in my head I calypso the places you've been to the the things that you showed us the stories you tell us anyway the course of the song was there at all most of the time it takes to say it\nDuring the remaining time that I spend aboard the calypso I tried to finish the song that to be able to say for capital Cousteau and his crew and for some reason I was unable to uh to get anywhere close to what I was hoping to stay behind that wonderful chorus\nAnd um I couldn't finish the song I just could not find that one day I I gave up after spending sleepless nights and literally [laughter] at least it felt like sweating blood trying to finish this song\nAnd I went skiing across the valley it's known that made a couple of runs and all of a sudden there was this incredible tension to get back home and and and to work on the song\nAnd so I've skied down in my car takes about twenty twenty five minutes to drive from snow mass back here to the house and in that time the whole rest of the song was there for me it just came\nAlmost out of nowhere I came to the house I walked upstairs\nIn Studio picked up my guitar\nOne of the best sauce I think I've ever written one that I still use to close like hot today\nI mean one of those\n\n\n\n\n... son John Michel Cousteau [noise]\nTypical of John and generosity ultimately gauge the revenue or that particular Sean [noise] too but not for profit company of my father [noise] and uh I remember collecting big ...\nLine that you know oh\nThe early Nineteen eighties John status as a pop star was fading\nAlthough his albums were still popular he hadn't at a single ... calypso in Nineteen Seventy\nFive his personal life was also in turmoil or his father died and march Nineteen eighty two and only three months later on their fifteenth wedding anniversary\nAny asked him for a divorced by the mid Nineteen eighties John star had fallen when the charity record we are the world was produced in Nineteen eighty five John wasn't even invited to participate [noise] he also broke up with this long term manager Jerry Weintraub\nIn Nineteen eighty six Denver was dropped by RCA\nThe company for whom we recorded fourteenth gold and platinum albums and the U.S alone and sold over one hundred million records\n[noise] in the Nineteen nineties his appearances in the media were more for drunk driving offenses in for his music\nBut John Denver had a loyal fan base and he still played cello shows all over the world\nIn Nineteen Ninety six John was inducted into the Songwriters Hall of fame\nBut there was to be no comeback for John Denver\nLearning to fly with his father you become a keen pilot owning a number of high performance acrobatic planes and fine Airforce F. Fifteen combat jet\nOctober twelve Nineteen Ninety seven you take and delivery of an experimental plane and test fluid at a low level over Monterey Bay in northern California when the plane crashed into the sea\nThe accident report concluded that the plane had run out of fuel John was killed instantly\nThen they think and I'm I'm\n\nSmall thing done how men [noise]\nHandheld leading a\nLonger have the huge in [noise]\nMeaning a shrine [noise] let\n\nMan I\nWho represent ... orders from a woman who wrote her\nSong Lewis on for hundreds of years [noise]\nNa hey\nHere's a story from Johns longtime friend Tom crumb\nI'll tell you a little story that that that was always meant a lot to me and this happened with ah his son's Zach when\nHe was eight or nine years old he's on the same little square hockey team that my son was on and they went all the way the state championships so there we are in this\nArena if you will this big arena in Colorado Springs and it was only sixty five people in place right you can just parents but the parents are so pumped\nThe game's about the start John doesn't know what he's going to do but I Know he needs to contribute\nShe stands up impromptu terms of space to the audience and sings the national anthem it oh no music or company or nothing just did it for sixty people we all stood up saluted the flag but our hands are hard it was incredibly moving\nWe won the game went to a pizza restaurant that night he bought every body to parents all the kids dinner he was so excited again always wanted to contribute however and then he bought everybody else in the restaurant\n\nHere again at Johns producer milk smoking\nThe arc of his career was like that or an eagle tricking flight [noise]\nPeople have said that they should not your sort of Nineteen forties Elvis the Nineteen fifties\nThe Beatles districts these John Denver was to my music was powerful\nAnd his ... to ... [noise] refreshing because [noise] I'm\nWas are Americans [noise]\n[noise]\n... story [noise] this day and history has always brought to us by the great folks are due to college this is our American story\n[noise]\nExperience ... journey on the wonder\nWill forego arena from October Seventeen to twenty first tickets Cirque du Soleil dot com\nESPN Plus had your college football coverage [noise]\nOr Tunisia and on your age the radio Katie already eight to\nW wait Joe\n[noise]\nAnd the only ... if not cap\nIt [laughter] you Bruce\nWe asked blue oyster colds drummer Albert ... who is now a music teacher New York city how the cowbell made it into don't treat the reaper\nIronically it was similar to what happened in the ...\nIt was we had put a whole bunch of uh over dogs on the on the song and one of them was um [noise] uh Randy ... put out that he put a political horn part on it or a trumpet or something\nIn the in the middle part that [noise]\nThat part so\nWe didn't like nobody nobody in the group like that you know and so a race that track so I said hey I Want to do I want to do a triangle in that park that's what I Want I really I hear a triangle in my head\nAnd their life and uh the uh one of the producers there was three there was Sandy pro when Mary ... David Lucas David Lucas was a jingle producer and he produced a lot of Eighteen to reach out and reach out and touch someone or or it's the Pepsi Generation\nI don't know if you're too young but anyway these are being a\nAds back in a it was a Mad Men so uh he said I'm\nOK you can put the trying on line but try a cowbell I just want to hear cowbell and I say why you think that it is a temple in that steady and up and he goes no doubt this temple it's fine it's I just want to hear that sound like\nI said okay so I play it and I'm like no it's not working and he's like oh we'll put some tape around it so I put the tape around it and he's like he's like yeah yeah that's it I said I don't know let me try and be able to beat her so I use like a tempting Malik and and everybody's like yeah that's it that's it so it's funny that uh\nYou know they will barrel because he wrote this kid and it's funny that even noticed it because it was mixed very low you don't even really notice it will track\nI checked we don't have a whole lot of the features account\nMore\nCowbell has its own were competing a page ... tribute and enlist reenactment [noise] it also has its very own ass\nIf you go to Amazon right now you can actually find cow bells with more cowbell printed on there's more cowbell\nShirt stickers madness posters ... studies involving license plate frame cell phone coverage pet floating warm year old she changed her bags decorations mouse pads I even found a more cowbell Frisbee and that's just on Amazon\nWants some women's underwear for your wife with more cowbell printed on it [noise]\nThey've got that too do you want an SNL\nChristopher Walken more cowbell do they cover\n[noise]\nThat hall on\nIt as one as Milwaukee wins the first game of the national league championship meeting Nelly six\nDefine this Fox News\nRight now in the antibiotic page WHM radio dot com we interview a woman whose father was a serial killer\nAnd mark Allen had some great relationship advice for a radio listener here now and the antibody page at WHM radio dot com\n[noise]\nFive times the most iconic brand and the booming cannabis industry just went public joined me I peeled now by time best\nWas college football coverage\n\n[noise] [noise]\n[noise]\n... make over Best Buy is here to help the tournament a free consultation once we find the perfect tack we can deliver it and make sure working before it really help after we're done we weren't all your attack on the type that by the fact that was awful\nMayor or terrifying directions one location designed to get\nThe American advertising federation presents ad week DC\nAn annual conference area marketing advertising in communications professionals this year's Avengers brands like Mars National Geographic envy ... such as box Daily Caller and CNN speakers from agencies have just will be adamant in whatever way if you're a member of the marketing and advertising community there's no better place to further your education and professor\nDot com dome is your chance to be part of history in the making busy at high time investor dot com back in time investor dot com I times holding\nCorps opera made only by means of offering circular which has been found with unqualified by the U.S securities Exchange Commission the security's are highly speculative investing and cheers kind of\nStuff that we had a racial mix this morning and we'll have another chance for that\nSunday into Monday until then overnight loads made right around forty one degrees tomorrow highest fifty seven it'll be partly to mostly cloudy on Saturday Sunday again partly to mostly cloudy Ohio with only forty five degrees that's what we normally see in the middle of November and there will be a chance for rain snow mixing\nUp by early Monday a Monday does look dry though by the afternoon\nThat is the news radio Jim forty W. H. O. three day weather from channel Thirteen or ... Wilson\nYeah our marriage coaching them what a great story to hear and what a what a fresh and wonder how much you want to have Emily on a couple of times a year and just\nPlay this so anyone going to be from old of a wedding planned a can just maybe just digit a talk about uh your first impressions when you heard this\nWell it is refreshing and that's the key word there because so many Koppel get tied up and not literally about planning a wedding that is there to you know media than a dream of somebody for a long time but\nUltimately when that when he has done and they're spending an average at thirty five thousand on a wedding now in America a\nDead zone as I could have used it thirty five thousand is the average\nYes that's the average kid does include our big city like New York at Seventy eight Chicago at sixty and LA at forty four but you know the reality is most couples are standing around ten grand\nThat is the goal but for some folks how huge stretch and have a couple that are having two hundred gas or so that is a big responsibility and let me tell you one that's done in the honeymoon is over your reality is going to sat in\nOn this is a commitment I made for the rest of my life and what do I have to shop and letting the odds and pictures some great memory absolutely those are all things that are important but what did you financially that's that is that you had or back\nAt the starting line of your marriage\nAnd and do you know coming into the marriage this first crisis point I actually think the wedding is the first crisis point\nAnd so if you to learn how to negotiate through that crisis point my wife and I did it fast like this we did a cheap because we just said we are not encouraging debt to go into the future of our life and as you as we've talked about the finance is is one of the key strange on a marriage\nWhat a crazy way and what a crazy precedent to set for your marriage how are you going to handle other crisis point the first house comes up you want to keep up with the Joneses so you get a house you can't afford so on and so forth\nSo talk about as marriage coach how this is an opportunity for a good coach or to come between a couple and have them think about the long view of marriage and these other crisis financial points that come from a car\nTo our house and to vacations wearing how we spend our money on those three things to me there's lead to financial ruin or the financial help than we know what happens to marriages that are financially healthy they have a better shot\nYeah they do and that you're on the same page for those thanks so I'm going to challenge folks that are listening\nTo hate yet have the designer wedding one that fits your pocketbook\nYour lifestyle and your calls that's an important lesson\nBut also have the designer marriage so many people go into the act of getting married that they don't consider how their relationship stages that and really no one where the other person is that when you make that let's face it business decision for life\nYou would not go into a partnership with the business without checking out the other person's motive and goals first and then at other per person is at in that you're on the same page\nWhy would you go into a lifelong commitment for marriage and not check things out\nI Believe that a lot of people that have a great great love for each other that don't take the time to do the double checks before they walk down the aisle and don't you want to know that you know that you know why you're marrying that person the good\nThe bad and the ugly the things that really helps us identify none of us are perfect but I Am\nItaly and ready to make that commitment to that individual\nCome hell or high water because this is my person that I'm going to a team with\nFor the rest of my life and I love this person let's not forget about that the second you throw the wedding ring engagement ring I'm Sorry on your finger\nIs the second most couples turn off their relationship building power and go into action I got to get this thing and this and this and you'll see it with a lot of bright they just go into the zone sometimes with their their mothers that they just get so involved in the wedding they forget about the relationship\nThey come to the day and that brought this on one end of the aisle or the you know wherever you are getting married at and the guns at the other\nAnd she's going or he's going oh my gosh I Hope this works and if you think you're thinking that right now in your planning your wedding you need to stop\nAnd make sure you have a coach that can come along side you and do some of that pre marital poaching that is so so important I always say repair and enrich is one of the number one ways in thirty minutes\nYou can try battles were free to go to ... dot com or download the app and tried for free that's battle B a B B. E. L. dot com or download the app to try it for free that's babble dot com\nTonight will be cloudy with temperatures remaining steady and the upper thirties in low forties rain will push along the cold front and change over to a rain snow mixing central I what by the early afternoon less than an inch of accumulation is expected by Sunday evening\nAs this guy clears out late Sunday temperatures will fall into the upper twenties and low thirties for Monday morning despite sunshine throughout the day Monday afternoon we'll be chili with high in the forties\nTemperatures will start to warm up on Tuesday this guy will be mostly sunny way hides in the middle fifties at your latest news radio ten forty W. H. O. three day weather forecast and penal Thirteen Mir Ali this amber Alexander\nOccupied the pros\nMoving and shot and Kirk\nThey've got plenty of protection you don't feel that with an open field and running it open spaces is no affair he may go oh he's tripped up inside the twenty five yard line out other twenty two\nNow you may remember that that passed it was a long ball to know a fan and I can make the argument made Stanley would have thrown a better ball that would have been a touchdown everywhere and\nSo what do you mean it was right on the money no it wasn't he threw it short Noah fan had to come back to the football which slowed him down a little bit\nAnd I don't get me wrong it was a beautiful pass beautiful play big game but if he would have hit him in stride that's a touchdown catch him when he had to cut back just three steps Rosh ...\nAnd he puts it out there with that first touchdown to campus where it's about three yards out new what has to outrun his defender and then make that one handed catch is going down in the end zone he I think even puts that ball out that far and and keeps it towards the sideline think you're right about\nThat and do just go right to and she goes uh I thought I Would say this for hot take Monday you can just get 'cause that's a different station that's on kids who knows so you get an area here and then do it again on Monday but I think parents is retiring after next season\nHe's been more emotional the season that I think I've ever seen how 'bout that passing game six passing CDs peek into the Brian parents there\nBoy I I Will say that all agree with her this with this and this is premature the speculative when when her parents retires it will be when you least expect it it's not going to be at the end of the contract or you know agree\nWith that yeah well I don't think that benefits anybody for them to know him to get to the end of the conduct because in those last couple of years yeah recruiting nightmare so I think that her timeline is probably right about that man I I don't even want to let that sink into my head we just one forty to sixty we enjoy it [laughter]\nTo wait for ten forty two eight or ten forty let's go to urban Dale it's we're Justin is Justin welcome to the judge was barbecue sound of a news radio ten forty WHM\nWhat's that guy's you're you're freaking me out man I woke up my little Napa turn on the radio and I swear to God I thought it was the morning Russia I thought I slept through the entire weekend\nYou could only be so lucky Justin\nRight anyway I'm a travesty this pose the question do they you know and they lost their running game um I don't think so I think uh I think at this point in her parents just carried Iowa\nWhat's the one thing that you that they could do to really know considers other team scares you know we've heard it from other teams in the past we know what I was going to do and we as fans watching the game you know what I was going to do\nSo yeah I think what they're doing I think they're coming out change in up to a man and a no go a little bit of a patch first I don't think there are banned in Iran I think they have the weapons out there that are allowing them to so I think it's a little bit of you know against the ship I think it's also a little bit of Brian ... says influence arms that\nColonel loosen up they'll mail it I don't know\nI ... and that's a good take I'm not saying they're abandoning the run and maybe I raised the question wrong\nUm and that is it do they have faith in it or have we turned away from there is not I I just don't think the run gained the last two weeks has been established like we've seen in the past that would set up the ... in the past there was headed to pass\nA game I think the passing game has helped the run game this last couple of weeks they got five yards carry this week desperate thirty two carries a hundred and fifty some bus yard that's five yards carry but I think that was set up more by the passing game than the other way around\nAbsolutely I think you're absolutely right about that and like I said I think that's the one thing that that um [noise] that the Iowa and dear to confuse other teams and they're looking at my table all of a sudden look in his passion game especially the last two weeks\nNow they got to account for every day on the field last year I think every team they play just stack boxing dared 'em to passionate good character you know whatever you know a sailor do hawks and I\nJust wanted to wait for ten forty was going to brand and they can be Brad welcome to the Japanese barbecue sound\nGood afternoon gentleman I Do want to let you know you get in a big thing to go yeah so it's a little you know six plus hours\nIn the long haul hold on ran off now now if you God Bless the result but here's the deal they only let us new three hours if they if they if they let us go till ten o'clock tonight Ross what I'd be lining up to do it\nOkay that's good are you guys\nWere talking about why he thought was allowing them to throw deep at the end I'd like to offer another possible theory on what what's what's at play there you know one of the area that I Will fans of sort of been concerned about is the quality of wide receiver recruiting\nAnd uh\nThey're they've been hot on the trail of David Bell who's the top wide receiver at Indianapolis or just happened to be at the game and who is told everybody who are less than that he was going to be watching that while I was passing game progress this year as part of making his decision\nThat wouldn't surprise me if that might have been partly a play and they're\nThey're thinking that they were just you know help put on a show for David Bell was he was there\nThat's funny Brad ... we saw that somebody sent that into us on Twitter earlier in the show also and said hey maybe this had maybe the fact that David Bell was on the sideline had something to do with them\nTrying to open up that play book a little bit you're you're not the first one to bring that to our attention bread I like that you're the first one talked about on the air and I'm Glad you did his drivers and I just kind of ignored that at first I thought\nYou know we we weren't sure how much validity there was to that but uh maybe there is some of it\nIs clearly a priority for the staff I mean I mean they've been in on him for a couple of years and Calvin bills that are really good job over there in Indianapolis getting Claire still wouldn't wouldn't surprise me\nBrad thanks a lot of ... hey by the way the number two teams the country is getting ready to fall or LSU is all over Georgia right now I'm\nAlmost brought this up earlier but we've just got a lot we've been trying to get through today when a listener called earlier and said hey you guys should be paying attention to that I'm not worried about this Georgia team I don't think that there are a threat I don't think that there a chance to make it to\nThe or the college football playoff their schedule gets so difficult during the second half it starts with this game at LSU they've still got Florida they've got to play at a really good Kentucky team they play ranked Auburn team\nI just I don't think George is a team that right now is necessarily worthy of the concern\nThat a lot of football fans are given to them I think by the time the season plays out you might be talking about a top Fifteen teams will say\nTo wait for ten forty David Des Moines welcome to the judgments barbecue sound of a news radio ten forty WHM\nYes I heard you talking about girls basketball ... and I want to tell you that the best basketball game I ever saw what between ... and early in June and it was over time and I like it was a hundred and ten a hundred and four yup and\nI'm a strong would shoot the ball and then turn their back and walk away and about\nFour or five shots would go in and Jeannette ocean wars are good prior and there's a mall or a a band or whatever in a marriage from a rape yeah no I was a referee for Twenty years and I went down there referee to game which are in it and I followed her out\nOh hey and she was a forward how do you water it out\nWhen you're when you're ... you're like between someone make a girl fall and when you get your elbow and push you out of the white bachelor\nFile it's now now I go ahead I thought I was gonna get killed before I got out of town [laughter] and\nI'd say I did get out of their quick because I don't think that ever happened but it wasn't fair to the guy guards\nThanks day by ... the funny thing is we just watch this long piece on Mali bowling she's competitive no ... to lose no doubt about that yeah [noise] fun man we've talked to a guy that was in the movie that you've added officiated her games we just got a clip of pistol feet in the movie [noise]\nI Love our listeners Darren said hold your call coming in [noise]\nSo anyway Joe ... and I arch radio station and on your age the radio Katie ... to [noise]\nDoubled you wait Joe\n[noise]\nTo sell or not this al I'm Roger eastern Fox News Washington grappling with the issue of whether to continue arms sales to Saudi Arabia after a Washington Post columnist or ... show he disappeared inside the Saudi conflict in eastern bowling is feared dead former UN ambassador Bill Richardson\nSo I just wondered if you think that's got to be the long term situation or whatever you guys talk at school I just wanted\nHere and ah you know in in while you're out here man I don't think so let's just kind of think about this out loud per minute 'cause we don't know the answer and there he definitely played well out there they've been kind of sliding them up into that role occasionally as these injuries have kind of decimated that line backing poor\nBut I don't think that's the long term solution I could be wrong about this I don't I think the idea would be to get these linebackers healthy again get those guys into those positions because they're better suited his long term linebackers then a money hooker whose\nFuture and football is going to be in the secondary he he's going to be if he wants to play the next level it's not going to be as linebacker\nIt's going to be at the safety I'm not sure if money's on that track right now there's certainly can't hurt him but if your question is long term and see the linebacker no I think that once you get guys healthy you moving back to the positions that you were coaching them up to a all off season that does that sound right out loud\nOkay but they didn't say that over the off season he parked on power for ...\nWell I mean I think they were thinking he might possibly do though so that's why I was wondering if that was their plan\nYeah I Would say you get ... and Eamon back next week the depth of that line back in court expands I mean almost doubles\nOr that and now you're allowed to put the money hooker back into his more natural position back and safety and that doesn't mean Darren that\nWith this experience that he's had first of all it does make him a better safety and that now you have this as a weapon you can bring him up and you can let him do some of that outside linebacker stuff that he's been doing these last couple of games have helped his defense to be so effective\nOh I agree I just I like his lead\nYeah ... ... and that's you know during\nYour keep re might keep hitting on things here\nThat speed at that position is really important for this defense because that's where a lot of us saw\nA weakness at the beginning of the year was maybe being soft against some of those guys in the slot soft against some of those tied in where you're going to be putting those linebackers against them possibly my gut tells me no hookers you safety and you put ... in hockey they back on the field [noise] [noise]\nOh well just good to get your ... I was just curious like ... man next to the phone call to wait for ten forty what's going to walk key that's David is David welcome to the judge was barbecue sound up a news radio ten forty WHM great good buddy\nGreat game or life could be down on the Indiana\nGreed or any any days the nice thing to do that I Need us up to the\nWorld that are going to be a close game I was or what [laughter] I Know you're listening to morning snow like she's\nGot a whole ah love it love it and who\nGives you a air land which is great great game to the you know what the game show up today the path again look great daily horrible as your caller bedroom right up there all Errol well\nAs the buddies in cars while I Love it love it\nYou know you're on your way back from you always you went over there David for the game yeah oh\nMan how long the drivers Bloomington do where where are you heading back to walk you\nWalk down the road what it's\nNot bad at all yeah or you'll be back you'll be back by ten o'clock tonight right\nNow what do I don't think so but we'll see you\nOr your way [noise] [noise] yeah what\nPart what part of the show today showed up to a ... or even showed him out and\nI Would think about it yeah so your buddy will look great today you know an\nAlternate you've had a lot to drink today it's All right what's\nA ... a little bit I Want to be one minute walk\nDavid go jogging over their main job with you and the boys good job over there represent in Idaho they and we said they did talk about uh Gary into an ad mentioned a few times\nWhen I had the football you could hear the crowd reacting with the off into place when Indiana had the football you could hear the crowd reacting with the defensive plays in ... even said hey you folks listening at home you're not confused that's the Iowa fans dominating this crowd here in Indiana so good job man that's a you represented everybody well\nAndy walk into the jet those barbecue sound of a news radio ten forty WN Joe\nOh thanks a lot and if we wouldn't that ends up playing black magic woman to borrow night it will be absolute travesty\nBecause Peter Green in Germany Spencer wrote that song before they got kicked out of the band to bring in the two looney females absolutely ruin the ban good night go ...\nGo hawks they played it last night I Know for a fact they played it last night\nHey so I got some info on that Denise long situation here is that a situation it's a person\nA so this was in the Nineteen sixty nine draft nice\nI'm In in the thirteenth round\n[laughter] sick Cisco warriors selected these long a girls' high high school player from a win the Iowa long who average sixty two point eight points per game or a senior year became the first ever female drafted by NBA team however however this election was later voided by the commissioner as a publicity stunt\nOh\nThere you go and she's still hangs out by the way with the warriors franchise I when you look up this story you find a picture of her in Steph Curry from march of this year\nReally yeah this is the deep rabbit all\n... they're getting he knew how to be a sophomore I put in a more subtle way\nAverage just under Seventy points in ... that it's incredible\nTo wait for ten forty ... second time to let him go was messed up the building I Know I mean jump on and it's true do it for to in order to do it for forty you can reach out to us on Twitter at\nSanta W where Joe where her till seven o'clock [noise]\nIowa State just kicked off and gets West Virginia West Virginia [noise] punted first position I Would say getting ready to one and it's versus Russian [noise] how did you argue about what are you with the television on you're not going to recognize I was yeah they they they're dressed as hot guys tonight [noise]\nWe'll talk about that would go back and forth on news radio in forty WHM [laughter]\nAs a Shane king so\nWhether you call the regular old biggest guy do moving has closed the fit you and if you're mostly just some dog we call you and I walk I spent ... salutes bands of all sizes and the Iowa\nAfter some of the stuff the stores\nHere until you find your side\n... is excited about the Iowa lotteries new ... promotion great holiday scratch games and a hundred and twenty five thousand dollars in play it again cash prizes and she's already buying tickets to use a stocking stuffer for friends and relations but who gets to have what makes her take\nOn the documents does she have stuff\nShe debut students like you don't have to wait because our holiday games are in stores now get yours today and said I Am a lottery dot com for rules and complete details\nGoing to help you yes I'm going to buy some Iowa Lottery and simply tickets I Love to play I Love the some of the games have progressive jackpots I keep growing but most of all I Love it as fast as super fast runner fast you get your ticket you find out that he won faster than the best thing that goes back to serve your tickets yes\nFast [noise] they're fun they're fast and the real veil of all now play in the play today visit I ate lottery dot com for rules and complete the sale [noise]\nMoney will join now have a lot of money a lot of Marines one meal and my friends of mine I don't know I just\nFor his love normally is General Mark you want you to love ribs every Tuesday night you can enjoy all you can be making rent rooms the generals mark you Don it only know the discount\nAt this point I kind of when it's match the TV [noise] then I went to\nI lay dot com and download it began\nIn ... new and lots of games on my computer for\nFree new sign up and no credit card require nothing like a good mystery to take me away and I don't have time for a movie or a novel so instead I mean to the latest I play games in the mystery tape ... hearing and when I Need a classic Agatha Christie murder mystery game had to sign I get my mystery and come away thinking more clearly\nNow why fine no problem with the three I think I can play my games\nMine and tune out [noise]\nI'm so glad I went I play dot com and downloaded the gap if my daily sanity restoration I play every game [noise]\nDogs News I'm Joe Shapiro President Trump is in Richmond, Kentucky hosting a political rally earlier he met with fried American pastor Andrew Brunson\nI just want to congratulate you because you live galvanizes country this\nThis is so much interest in his shoe or strikes what you've done going through I Know what you've gone through Brunson\nWas held in Turkey for two years on terrorism charges President Trump says he wants to get all the facts before they make any decisions after the disappearance suspected murder of Saudi journalist ... getting Saudi Arabia continues to deny involvement\nIn fact today the Saudi interior ministry released a statement saying\nWhat has been doing a lie and baseless allegation against the government of the kingdom of Saudi Arabia\nFox's Benjamin hall this was Fox News [noise]\nThing is to say the countdown on November is a time for information right now is now\nUse radio ...\nW. H. O.\nRay Price rates election great experience\nWhat is unexpected is how hard we work after the sale to keep your\nHonesty integrity discipline\nThese core values or why we grow every year and why we continue to acquire more dealerships experienced a shot and Kirk way of doing come visit our new Ford dealership in India nor\nIs basically right man today is Marshall one I ended up purchasing a home through American ...\nWe're talking with Lydia about the ease the banker knew how\nAnd I love it I Love my house every day I Walk through it and I think how much I've lost my house it was the easiest thing I've ever done and that's why a bank was American trust it was so easy that I kept asking my anger should be doing more work you know and I'm like no you just basically five papers and that was\nWhen you ... American chats mortgage lenders lift your loan\nHome for me is a place where people gather mean we've had a lot of things happened to my family that Sharon and that was really fortunate that I had in uniform charming warm welcoming homes that people can come and stay and it just kind of gather around her kitchen table\nWhen you find your way home American because it's all about you\nKnow subject to credit approval equal housing lender member FDIC\nMoments of clarity by the sauce man speed ever go cookies barbecue sauce\nWhen I was a kid I stole a calendar that twelve months what is clear is the cookies says the one that America ... from the original cookies sweetest Smokey barbecue sauce two wings of the exam cookies flavor in answer cookies secret ingredients which everything tastes better job cookies barbecue sauce is it your nearest grocery store\nOr a visit cookies BBQs ah [noise] we\nAre Grande county Ariz seed and we are member owned anyone he lied in our minds as an owner of the cooperative are members elect to local directors who's there among our board and make decisions that are in the best interest of our members we volunteer\nFor an support local youth programs charities and economic development and any income generated that is not needed to upgrade the cooperative is return to our members that the collaborative difference I Grande county are you seeing your local touchstone energy cooperative that power is yours [noise]\nThinking about life insurance what if you could make one free phone call and learn your best price for nearly a dozen highly rated price competitive companies well that's exactly what happens\nWhen you called select quote life for example George's forty\nHe was getting sky high quotes from other companies because he takes meds to control his blood pressure but when I shopped around I found him a ten year five hundred thousand dollar policy for under twenty five dollars a month I'm select court agent dance to you know and believe me you're ... and shopping for your life insurance you're probably paying too much\nFor your free quote called eight hundred five seven three Ninety five fifty two labs eight hundred five seven three Ninety five to eight hundred five seven three Ninety five fifty two or go to select quote dot com since Nineteen eighty five we shop you save\nGive full details on the example policy it's liberal down ... commercials or price could vary depending on your health insurance company in the factory in Austin\nTonight will be body with temperatures remaining steady in the upper thirties and low forties rain will push along the cold front and change over to a rainstorm mixing central I what by the early afternoon less than an inch of accumulation is expected by Sunday evening\nAs the sky clears out late Sunday temperatures will fall in the upper twenties in low thirties for Monday morning despite sunshine throughout the day Monday afternoon we'll be chili with high in the forties\nTemperatures will start to warm up on Tuesday this guy will be mostly sunny way hides in the middle fifties ... latest news radio ten forty W. H. O. three day weather forecast and penal Thirteen Mir Ali this amber Alexander\nGuy just froze\nProducts and American try [noise]\nThe other was new life your gums a of pull out all out ... doubt goes Ramsey [noise]\nRiley marsh came off so you're a geezer state track champion he's a sprinter and he got there and uh her [noise]\nYes he did he do for them to call with your regular news radio to forty W H um [noise]\nI didn't have much could you know it was such a blow out the dolphin give me good much\nMuch stuffed it just\nGot the yeah it can be upset with some calls so we got shortly ridiculous stalk\nJerry what else do we go from Gary [noise]\nFires one is always my favorite\nIt\nGets bad that I knew that I Hope not I mean why would but you can feel the frustration yeah and I think that's why we why you pull those aside is not that fun with it\nThis because every Hawkeye fan this feeling that Gary ... is the only one that gets to do it on you know across the country every\nDay he he he gets to convey the feelings of everybody else\nYeah his and occasionally and snakes those feelings into this ... [laughter] that was pretty bad [laughter]\nDo it for ten forty let's go back to the phones Jim in Des Moines welcome to the gym through his barbecue's on up\nTo fail if I was watching the game to check on where she is now being ... again ... ... I mean there's only one game um Iowa Indiana he will he wasn't on ESPN two you know\nNo big chunks of the Big Ten network I didn't think he was with Beth ... today\nI pilot you are but here again this guy was the most boring if there's bad blood Indiana Iowa this or I Will look past but just seconds left on the\nSpot in really bright it and and I think I heard your your wife ... guys at the beginning of the second half say somebody at Indiana players try that mixed up Iowa wave\nYou know you did yeah you heard of you did hear that writers right before the rub Brooks interview you did hear that right\nSo do you think that that's why I I was trying to really embarrassed at the end because they were right on their mouth at ... F that\nJim uh we have a a a guy that helps us out with the show who was traveling back with the team today and when they landed\nHe called me to kind of know want to know what the reaction has been here on sound off and I told him without a lot of listeners that are trying to just put their finger on why\nThey are very unfair and it's like thing to do try to try to move the football at the end of that game and I David even at the end of the first half and I through some of these things at him because we're the same thing you did we haven't heard Gary an ad mention\nMaybe it was the idea of getting the family of seven touchdown pass so we can tie took Hartley with a caller in and a tweeter that caught the census information about a recruit by the name of David Bell well highly touted wide receiver recruit it's speculating maybe this was the kind of show David Bell what this audience is capable of and\nAnd how much money he can have an a Hawkeye uniform\nOur ... our guy on the inside kinda scoffed at all that he said no the end of the game you're just watching a team that's trying to run a few plays there doing nothing special the final play especially they're just trying to burn out those three seconds by putting the ball is high in the ...\nAnd ... have you think about it because if you take it needed a clock stopped its fourth down the age of ... right right so if you run the football\nI'm\nRunning your ... your turn to run down or you could get somebody hurt that's a good point\nTo it you know now you could go back and take me like run and then take me in and burned the three seconds but I don't think they were trying to complete a pass on that last plane no I don't either not in the last place [laughter]\nHave you with him on a plate prior to\nYeah well they actually open to that so that that is is that one question that that is a good question I don't think there was that I think it was the first player that drive if I'm not saying I have to look at the play by play but I actually think it was the first place to drive and if you listen to the radio I was watching the game and listen to the to the dolphin Eddie and they're like", "year": "2018", "show_name": "Our American Stories", "city": "Des Moines", "day": "13"}