{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n[laughter]\n\n[noise] [noise]\nHigh spirited Romanian Rhapsody number one by George didn't ask go Eric Kandel conducted the Cincinnati palm\nNews from around the world around us and around Mississippi is what we using your on MTV think radio and we do a whole lot more such as live programming between thirty and knew everybody gang\nEntertaining programs on the weekend we make an investment in Mississippi so I Hope you'll make investments in what do you go to our website now MTV online dot org or call one eight three seven to ... and thanks so much\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA ... W. M. A. you view\nW. M. P. in Jackson W. M. A. W. we're ready to be it may be struck W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at ... ...\nBe online dot O. R. G. [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\nThe degree to earn Hollander showed me that using all parts of the setting of a community center transformation yeah\nWelcome to spring music from Newsweek and we're exploring the role of those magnificent Martin yards listen to music on the Hungarian people and it didn't take me too long and starting my explanation to find that I've been mispronouncing that word all my life it looks simple enough to meet you why ache are McGarry right\nTurns out gee why in this language produces it sounds like\nD and adulation\nSo these people are much Josh Rogers and what an interesting people the majority are\nIt came from the east some nice\nEuros low mountains which are moving here between Russia and Asia arrived around eight to nine hundred D.\nThey stopped for a little while and you want but they were repulsed by a German auto turned them back and then by a visit from when the Roman emperor right descendants of Charlotte I mean does it look is probably better for all of his if you just they put right where you are and so he\nDid the habit in that area centering around the deli or better than I Do the ... [noise] how some pod most nearly four hundred years nine hundred to about Thirteen hundred\nToward the end of the nine hundred Steven ... who is a great grandson of our pod went to the pope and say please tell me and in that one move\nSteven became stealing the first [noise] and I'm going to a Christian nation so it's not surprising that the earliest Hungarian\nDisconnected the Christian Church is an example early church music and the Christian Church music\nIn Hungary sunny place for us now by Mandela cortex\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\nNah\nWhich seems to break up my staff all week long because it sounds a little\nOdd and if I mispronounced that I probably have to retire from broadcasting\nHere's an attempt by linked FARC\nLast name as B. A. K. F. A. R. K.\nBorn in the seat for years Fifteen twenty six year of the battle of ...\nDied in ... nearly fifty Seventy six he spent his life on the road in Poland\nAnd Germany and Italy\nMust park was the greatest nest of Hungary and one of the greatest of his age he's about forty years older than ... Lewis John valid\nBut you'll hear some of that shame beauty and so forth and this is my first music [noise] what's your two pieces by by the FARC\nFantasia for a loop this is number nine and then a collie are these are both play first by the end goal concert\n\n\n[noise]\n\n\n\n\n\nMm [noise]\n\n\n\nMm [noise]\n\n\n\nMusic of Bali walk FARC also called Valentino walk fuck if you look I'm up in the grove dictionary music\nBorn in Pennsylvania hungry at the time is now part of Romania we already find ... and it all the art of FARC this wasn't a performance by the bank coke concert that's Danielle thank God for that group he used to call the some of the box FARC concerts they love the music so much but I think they must have had trouble saying it to\nJust go back into the libraries and check out some more music from Hungary this was a collection put together and sixteen Seventy five which is about a hundred years after the ...\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\nFor Hungarian ... taken from an Eighteen century manuscript played by the Mandela quite\nCatch up a little one history just fast once you get back in Fifteen twenty six the worst military disaster of Hungarian history the battle of march\nI mentioned defeat the Hungarians and Hobbes book is committed sort of morph up all the remainder is\nBetween about sixteen hundred and Seventeen hundred the hops works gradually put down the Ottoman somebody actually took I'm Gary an extra ...\nFamily beginning ring a bell\nRemember the employer of semi while we're getting way ahead of ourselves that's Eighteen century stuff yesterday ...\nJoined up with the polls in ... at least did she go on to the knees were so grateful that the sheep tremendous benefits on the Astor husbands who are already doing rather well for themselves [noise]\nWell enough that they could afford to have a much their family is very good composer seem as powerful PAL [noise] after ...\nWas born in ... which the Hungarians alcohol use my one in six thirty five [noise]\nAbout a hundred years before you guys have heightened [noise]\nI'm reading from the grammatical Hungarian composer point and patron of the arch people at the Jesuit school he later had a really a career as a statesman and as a soldier and it's also a really good composer [noise]\nThe music that still exists a columnist or housing consist of fifty to church peptide in which he caught\nHer moaning as she left [noise]\nNot a Lutheran Church can like box which I write another say fifty years or so this is a Roman Catholic and pretty much as ... mentioned as far as I can figure out there's so many of these pieces it's hard to pick but I just went through and started pulling off my feet which are the ones I got\nTo hear [noise] everybody here five sections from they have in the army the middle one is a rather charming piece for two singers it's a lot of by far the Christ Child\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Jackson", "day": "22"}