{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n[noise]\n\n\n\n\n\nMen Dylan is W. W. tall feature Dana concerto when she minor by your hunch bastion bucks\n\nI'm Larry Gross it's mountain stage live performance radio from NPR\nThat'd be Ninety seven on MTV music radio [noise]\nThe stations have been ... music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him Bebe on line or gee\n[noise]\n\nAt one time or another in my life I think each one of\nBeethoven piano concerto is has been my singular favorite\nOver the years I keep coming back to this one in particular the force concerto in the major [noise]\nThe Boston symphony orchestra but ... there was Rudolph circuit played that opening music [noise]\nSo different from any piano concerto ever conceived since music from year to six [noise]\nWelcome to exploring music which has been McLaughlin and this week all week long we've been trying to answer the question how do we get from\nAlmost Thirty years now [noise]\nWe left off the music of the sixteen year\nOld Mozart [noise]\nAnd now we're jumping ahead to beat them in theory to six and want to jump that is\nThat jumps across the American revolution starting in Seventeen Seventy six the French Revolution starting sixteen years later\nIt jumps across the rise of Napoleon jumped into a new century\nIt's a whole sea change taking place\nAnd we hear it in the music of Beethoven [noise]\n... just for example that marvelous opening where we aren't has it take to do this after we just heard Rudolph circumstance but just as the major music that they don't use this\nPiano is on the moon and soft its poetic it's almost a dream of vision when the orchestra comes in he puts you in the major far far away\nOnly works his way back\nFrank gradually\nTo the ...\nOf the major that's a completely different way of thinking about music than would have occurred to heighten or even the Mozart beat them it's only thirty six years old when he made this piece but he's in a new century in a new era\nBut listen to the way heightened the classic master treats the barrel form too which is very defined by the speed the instruments at the time set against the descending slower scale\nTo should the hugging cortex which is made by young Austrian whiz kids playing the court did in a major up of twenty number six music of friends you also have heightened\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\nWell that was a brilliant example of a classical composer using a baroque form I phew it's possible for classical composer to go even further in that direction\nProject was heightened and his younger can debris Mozart needed a stimulus this was provided by a man named I fried ... was born in Germany Seventeen thirty three just a year younger than I spend most of his life in Vienna he was an ambassador in Berlin for awhile and during his world travels\nHe amassed a collection of music which was outdated at the time he was collecting music of the Iraq composers and ... and ... where's to the rich\nAnd the Seventeen eighties burned bunch beaten was living once again in Vienna I become close friends with both heightened the most and brought them to his home and showed them his collection of music\nHe only had to open these scores before these two geniuses heightened emotion before the to compose it began to absorb box and ... like ... they just took it all in and it changed the way they can put their music\nUsually Supreme example of the late Eighteen century composer using all of the country bubble technique\nThat goes all the way back past parked decompose there's like ... in the renaissance here's the finale does operate without words of Mozart's Jupiter symphony hold onto your hatch this will be Fritz Reiner connecting to Chicago Symphony and it's a really in temple much like finality of Jupiter\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise] that march they comes at the end of act three of the marriage of Figaro\nWorries me a little music composed in Seventeen eighty six to a French played by boomers Shay\nBoomer she got thrown into prison in France for writing this play was considered revolutionary now keep track of the day that plays written about Seventeen Ninety three or four Mozart was supposed to be forbidden to make an opera of it in Vienna in Seventy and eighty six but he persisted\nAnd when I hear that march gone I think it's only three more years to the French Revolution it sounds like the forces are building up remember that the Viennese had invested interest in the French throne because the daughter of Maria threes of Austria was none other than Mary twin that\nMarvelous sketchy characters there on the part of Mozart in the finale of actually a few grow we heard the NFL our money conducted by cloudy and bought a with a great cast ... was both school was Charles shooter the contest Susanna some by Sylvia McNair figure who was a ...\nCan be no some by no less than two cilia Bartleby\nYou're tuned into exploring music and all week long we've been trying to figure out how to get from the music of bar who died in Seventeen fifty to that or Beethoven was born just Twenty years later\nDrop us ally let us know where you like the show you can write to us at exploring music at W. S. empty dot com\n[noise]\nBut all week long we've been trying to get from the music of the ... or ... to that of the classical slashed romantic composer Beethoven and now in her final minutes you're less than half an hour we have arrived\nAnd what to choose from this great body of work that Beethoven left is there are thirty two piano sonata is there are\nFive piano concerto either are nine symphonies there are sixteen string quartets plus the great feud and we've only time really for a short sampling of that I was trying to think of some of the things to beat them and they were so revolutionary and far exceeded even that's nominal accomplishments of his idol Mozart and his teacher hiding\n\nThere are a Dodgers and beat them into work unlike any composer before him and really anyone after all the books and their mother she has to go which many others have tried their hand these are great transcendence slow movements there's nothing like that in any other composer beforehand there is also a kind of ... energy which was brand new\nAnd there's a kind of honesty even ... to even his most self indulgent moments\nSo for better or worse I've decided to pick two moments of one of the symphonies it's from the Eighteen twelve in which we of course had a war with the English again in ... later would write an overture celebrating the defeat of Napoleon in Moscow for beat them in the big story of Eighteen twelve was that he finished his seven sympathy\nAnd we're going to hear just two movements to second moment where ... might have placed a real slow moving in a dodge yo is marked in this case I like rent though\nThis is a movement sort of a Johnny one theme given by the children's them loose strings that builds a tremendous head of steam out of seemingly very simple material no one could have imagined his music but beat them and [noise]\nAnd then for the third moment where Barack composes from their early seventeenth century through box to even heightened emotion had made a minuet Beethoven takes this ... this baroque dance old fashioned Courtney dance and changes it into a dynamo sketch so\nOnce again we're going back to Chicago simply recording with France rider conducting the other ... and the schedule a beat them it's seven symphony\n\n\n\n\n", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Jackson", "day": "12"}