{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\nBorn to fly that's what used to Texas pipe organ festival director Lawrence major has showed of our solar was they're Nineteen year old Henry Web of Dallas they're showcasing the resources of the aliens ... organ at St lukes United Methodist\nChurch in field for Texas which is one of several instruments installed by Jimmy nor Williams and designed to voice by boy very that make up the east Texas pipe organ festival schedule definitely worth hearing as Henry himself just out of high school when he played last year\nSo a student at the eastern school he'll be returning for his third year at the festival which\nThis year runs between November eleven and Fifteen an all star cast of showed was is lined up and the expected list of\nRoy Perry boys ... organs which\nTruly are east Texas treasures find out more details on line a pipe dreams dot org also in east Texas pipe organ festival dot com member hundreds of hours of additional pipe dreams programs including some from previous festivals can be accessed online twenty four seven\nQuestion comments always a welcome either be our mail bag or through our Facebook page and you can find access to those also pipe dreams dot ORG\nLight beams broadcaster presented\nBy radio stations throughout the United states including on Sunday mornings seven AM on blue lake public radio stations W. B. L. U. ... point nine Grand Rapids W. B. O. V. Ninety point three twin lakes mosquito serving western Michigan\nContinuing supportive pipe dreams is provided in memory of West the she dug lead by his family\nWith additional support from Walter McCarthy clever you into the gravestone foundation Jim ... I'll be happy family foundation\nThe ark and Martha ... fun it'd be jerking foundation celebration of the life of Martha ... camera\nAnd by the strict contributors to this public radio station\nSport also comes from ... Oregon builders are dilutes Georgia and Parsons pipe organ builders are kind of dig when New York members of a poll by the associated pipe organ builders of America\nWhich is a collaborative of designers creators and ... founded religious and educational institutions concert halls and residences throughout the United states and be on\nThe global resource guide member perspective is available to eat the obey the\nAnd that's just associate producer Michael Barone east Texas pipe organ festival porch pipe dreams we thank you\nGo on buying for more information that pipe dreams dot org ... this is a pie and American public media\nAttention all educators NPD has partnered with the secretary state shellfish who's this year's promoting the village initiatives to help your students learn important lessons\nAbout civic engagement Blount having than in the classroom in December ... hatred twelve students across Mississippi get engaged with the ... election plus you are an essay contest for more information about promote the boat where did you sign up your last or school visit NPD on line ...\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW MP in Jackson W. M. A. W. Meridian W it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at impede the online dot O. R. G.\n[noise] and Mississippi Public broadcasting fish\nSounds Jewish I'm anti motion back within our music from various points out the Jewish space time continuum including popular songs you may know aunt rare recordings that\nI dusted off just for you the Jewish people's intense autumn holiday season Komen age this week with a day of wild celebration\nOn ... the day for every choice sing with the Torah juice complete the annual cycle of public readings tourists grow\nAnd begin anew by chanting from the first chapter of ... genesis then they sing and dance with the tourists roles and some may even drink a toast\nOthers may drink more whether you understand the tour as God's literal word as human writings inspired by God\nOr as a document that various Jews compiled over the centuries the Torah remains central to Judaism today on sounds Jewish we welcome suppressed Tara with music from around the globe praising the tour and holiday\nAnd expanding on biblical stories interpretations of stories and the song [noise]\n[noise]\n... by the messengers unorthodox rock band led by double pastor knack\nOff of the Nineteen sixty nine album the in Jewish town it's customary when Jews complete the reading of a book of tore it to recites the phrase Zach Zach for ... sake\nBe strong be strong and led to strengthen one another now more about how are they from mid century modern pedagogical pair\nA lot of so called ... ... ... ...\nThing in the way we follow the hot and then the gay and then\nThe um\nHow people\nGot a beep oh\nI'm On the\nLine\nYou know\nYou and me me me me\nMe\nMe\n... Toro from the two thousand three CDs I buy you die a music from the Jewish people ...\nI don't know how many of you know how the tourist scroll was produced a trained so fair or scribe writes each word with the quilt pen I'm part you meant following it he turned to lay out the goal is to precisely reproduce the tourist scroll each time\nReading a new ... takes months of concentrated effort here's a short song from India for the dedication nobody knew tourists grow\nWhen am I now realize man was in a yeah I\n...\nMan a man who more than a man oh ... no not any of those\nThose are the ... the day the guy who does\nThe uh uh yeah not my knees they have a\nGot back than that I had a woman named\n... who are living\nIn that hold any ill man\nI mean they have\nThat in the\nSong for the dedication of a tourist scroll off of the two thousand four CD oh lovely parrot Jewish women songs from Corolla India\nThis set of global music for to store it continues on sounds Jewish with the literature go songs from the roof stoppage Jews of Zimbabwe for removing the tour from its place of honor in the sanctuary the holy arc to be read\nThis was an Eighteenth century devotion in the show the language that goes is great name is the holy one no one is like him even on earth there is no one Mike unto God or in heaven\n... no no I'm On\n[noise]\n\n[noise] [noise]\nYeah [noise]\n\n\n\n\n\n\nOf course who are quite arc my course of ... Jews from Zimbabwe on the two thousand three CDs hidden gate Jewish music around the world\nAnd speaking of arc here's the literature go song that reminds us whenever the R was carried forward Moses would say a rise lowered may your enemies be scattered may you're supposed to be put to flight\n... show come from Zion praised as God who wouldn't God's holiness gave the Toro to God's people Israel\nI Am [noise]\nA A R o\nO lo o lo o\nOh whoa hello a\nA A N\nO yeah whoa\nKept her Moshe ... one of the twentieth century great with value he'd been so out of the opening of the arc off of his Nineteen fifty nine album Torah rocket do shot\nNext following the Torah reading in synagogue scroll was returned to the arc is most congregation seeing some version of the traditional song comparing the Torah to a tree of\nLife to those who hold fast to it at all who cling to it right to happiness [noise]\n\nMean a number ... ...\nTalk that orange ya ...\n... and they made the ...\nAh\n[noise] for gay and I\nA\n\nImagine anybody I\nMean they have not had the you know I I\nTrying to hate it I'm not\nSee stupid sim coup led us rejoice by Cantor Alvin Michael send up north Hollywood, California and he's Nineteen Seventy six L P A world of Jewish music\nThe character and teacher a company is modern sound with a band contemporary look worse hair long and at this job a jacket photo sport it loud print shirt\nActually that's pretty much how I look to that next along with the rich and tore it Judaism also consult the oral Torah noticed a missionary\nMultiple discussions on the mission now are recorded in a set of legal books known as the ...\nThe attorney to grab my eyes were not writers of books but teachers by word of mouth creating and expanding the real power we do not so much regret these great changes said as over here I'm In their session this is the way the Babylonian common again\nFrom what time in the evening maybe ... hobby recited from the time the priest may begin to eat over there he's offering until the end of the first watch this is the text the Tom and wants to discuss and explain\nAnd here's the way the discussion and explanation and go on what basis does the say set forth with the statement from what time cried dizzy first stated in terms of the evening he should first stated in terms of mourning\nFor the same age the basis of scripture comes the reply where it has written about shot rehearsed them that is recite them when our lives down and Gwen got riser stop\nThis therefore the meaning of the state when is it the recitation of ... at lying down time may take place from the time the priest may begin to eat up there he's offering\nIf you wish say this this age has taken his cues from the stadium in the town to the creation of the world\nWhere it is written and first there was anything and then there was mourning one day\nNotice no cast of characters described or even named no word about the time and place of the give and take a state and just quoted\nAnd immediately one plunges into the questions and answers which were exchanged from the academy as scholars try to understand and explain attacks\nThe heart of the matter interpretation of tax is what counts it alone hardly anything else\nWhat do we mean by only interpretation of attacks\nThat that the town that is not a code our cat accusing laying down in summary form ... men's obligations are it is on the contrary the record of a process the actual process by means of which for law is made clear\nFor the focus of the comedies on the law in a sense law it's studying practice was the Tom you dig mystique\nThis indeed is what the rabbis of the Talmud hoped that they could supply the exercises which would become second nature and the world to come\nAuthor and scholar Judah golden reading from his Nineteen fifty seven book delivering Tom mood on an lp of the same name from I presume about the same time\nNext to sounds Jewish ... Tara three songs about biblical characters first here's the king of rock and roll that's dissing or not the character\nWell it won't solve\nThey got him thinking I'm not going\nI got a well\nI don't know why\nHard headed\nWoman a club dimitrius song that was the number one for Elvis Presley in Nineteen fifty eight it's from the two thousand two CD Elvis dirty number one hits\nElvis Sharon Presley had a Jewish grandmother on his mother's side which makes him a member of the tribe recording the Jewish law\nBut he was a practicing Christian who recorded a lot of gospel in addition to rock and roll and pure pop\nNext too strong with much more sympathy for a biblical woman it's based on a ... story about the matriarch\nSheriff's experience during the sacrifice of Isaac her son was Abraham shaped in shows or the preparations for the sacrifice but stops before Isaac's rescue\n[noise]\nMaybe\nWent\nEver so\n\nThe ...\nLa\nMe\n\nOh no no\nNo\n[noise] [noise]\nKnow man\n\nTo me oh\nOn a yeah\nMaybe don't you\nMe late in\nOh\n", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Jackson", "day": "11"}