{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n\nAnd the line\nThe last ...\nPhone call\n...\n... ...\n\n... [laughter]\n[noise]\n\n[laughter]\n\n\n\n[noise]\n\n[noise]\nBut my\nYeah nice to Michelle ... Barcelona symphony orchestra that's George Gershwin Rhapsody in blue\n[noise]\nDid you hear that interesting news story on NPR isn't that auto correct a great way to get advice about your car\nI heard Karen brown saying it's gonna rain today if you mentioned the Mississippi Public broadcasting you probably can say yes to the state cliche your support in in ... making a contribution to impede beat online dot org or call one eight eight eight\n... a three we need you to do your part to support a bb\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA ... W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen on the line at him be beyond\nDot org gee [noise]\n[noise]\n\n\n\n\n\n\nWow listen to Bobby go that was Robert ... Duffy playing the violin they're\nJust ... Duffy a native of Georgia and a great rock and roll fan also fabulous which was a violinist as we just heard\nPlaying with the Cincinnati pops orchestra conducted by ... the composer of this Hungarian fantasy if you just tune it may come as a surprise his name is ... lay heart the Viennese operatic composer and lay hard will be captured the popular idea of what Hungarian music sounded like\nBut you know there was another generation of young Hungarian composers coming along who had some very different ideas about what their national music should sound like I'm thinking first of all of ... ... ... was born just eleven years later Eighteen eighty one\nMy talk was only Fifteen Years old when Hungary celebrated its millennium\nOne thousand years back from Eighteen Ninety six to eight Ninety six the year that the nation had been form under our pod would come down from the Ural Mountains\nAnd there was a frenzy of nationalism which sees the country and especially the young ... took you supported national costume refused to allow his mother and sister just be German and fired off letters headed down with a ...\nIt was over the next three or four years that ... was a marvelous pianist studying at the brand new Franz Liszt Academy of music in Budapest began to contemplate a tone ... based upon the Hungarian national hero many ... ... ... was born around Eighteen one\nAnd had to lead a Hungarian revolution in Eighteen forty eight which briefly seemed as if it might be able to lift the opposite were yolk\nAround nineteenth street by ... got into some of the music a record Strauss now here's a direct lineage because it's the Hungarian composer friends list who invented pretty much the idea of the ... and then Strauss who became a pupil of list at least was very deeply inspired by less\nNow here's the third generation his part took making the peace which he calls\n... this is a big piece well over twenty minutes long and there's a natural great coaches that far and will stop and see what we think about the young ... first experiment with a big symphony orchestra\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise] so [noise]\n[noise]\nMm\n[noise] [laughter] [laughter] that's okay that's not that's not\n\nNo no no no [noise]\n[noise] how long\nLittle apple fell into the ... the last ... the first one so sad was use is like a falcon happy as long as it can roam free\nAnd the middle son if I had Hungarian bank notes I paid that much if I could get ... bank notes I put my arm around my darling waste remember our friend ... from ... that ...\nOne of cautious accomplishments in the year and a half that it looked as if Hungary would be independent of Austria\nWas it established a national bank and they offered who's with notes so here it is and the folks on collected by ... this was ... author singing with force back at the piano three Hungarian folks has collected by today\nThat she has three more of these thirty five hundred songs collected by go die this time played on the violin by David what struck and on ... Ginsberg at the piano\n[noise]\n\n\n\n\n\n\n[noise]\n\n[laughter]\n\n\n\n[noise] [noise]\n\n... bum bump bum bump bum bump bum bump bum [noise]\n\nFantastic fiddling remembered the gypsy fiddler is very very important part of the development of Hungarian music that was David moisture I was a Russian classical violinist with ... work at the piano\n... collected by could die and they said in this country version for violin and piano these are all fruits of the early years of dying by took wondering the countryside of Hungary and not just hungry all up and down the block and been into collecting folk songs wherever they when they actually went so far as turkey\nWhich is a nice connection isn't it because my journal language the Hungarian language is related to finish language Turkish language at a couple of very obscure tribes in Siberia which is if he composes we're sensing that and trying to draw the musical circle complete [noise]\nThere's just no peace which could they made for his home town band ... which was celebrating its ... anniversary in Nineteen thirty three this was the same orchestrated friends Eric how it started at the same time he was starting to be ... now eighty years later Nineteen thirty three\nWhat kind of celebration well could I create for this great art district\nOn reflection good dice went back to his childhood when she gets\nAnd here I'm quoting from per se young biography of good eye he writes a lot there was a rather dreary place on the main line from Budapest departed slobber ... and ...\nIt was a village with Mitch population of Hungarians who where the majority smallpox and German and to be a boy and a lot to in the Eighteen eighties was wish there was companionship once equals freedom to roam the countryside lively games in which the traditional ... the country were are mostly set\nIts own shows up and we're about to hear\nSomething called ice dancers have come to perform by the Philadelphia Orchestra and your doctor born in Budapest Eugene Normandie\n[noise]\n\n\n\n\n", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Jackson", "day": "25"}