{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\nBorn to fly that's what used to Texas pipe organ festival director Lawrence major has showed of our solar was they're Nineteen year old Henry Web of Dallas they're showcasing the resources of the aliens ... organ at St lukes United Methodist church in fields Worth Texas\nWhich is one of several instruments installed by Jimmy nor Williams and designed to voice by boy very that make up the east Texas pipe organ festival schedule definitely worth hearing as Henry himself just out of high school when he played last year\nSo a student at the eastern school he'll be returning for his third year at the festival which\nThis year runs between the ... eleven and Fifteen an all star cast it showed was is lined up and the expected list of\nRoy Perry voice ... organs which truly are\nUsed Texas treasures find out more details on line that pipe dreams dot org also in east Texas pipe organ festival dot com member hundreds of hours of additional pipe dreams programs including some from previous festivals can be accessed online twenty four seven\nQuestion comments always a welcome either be our mail bag or through our Facebook page and you can find access to those also a pipe dreams dot ORG\nLight beams broadcaster presented\nBy radio stations throughout the United states including on Sunday mornings seven AM on blue lake public radio stations W. B. L. U. ... point nine Grand Rapids at W. B. O. V. Ninety point three twin lakes mosquito serving western Michigan\nContinuing supportive pipe dreams is provided in memory of West the she dug lead by his family\nWith additional support from Walter McCarthy clever you into the gravestone foundation Jim ... I'll be happy family foundation\nThe auction Martha camera funded the jerky foundation celebration of life with Martha ... camera\nAnd by the strict contributors to this public radio station\nSport also comes from ... organ builders are dilutes Georgia and Parsons pipe organ builders are kind of dig New York members of a poll by the associated pipe organ builders of America\nWhich is a collaborative of designers creators and ... founded religious and educational institutions concert halls and residences throughout the United states and be on\nThe global resource guide them member prospect as soon as they live with eat the obey the\nThat NASA's associate producer Michael Barone ... east Texas pipe organ festival sports drinks we thank you\nGo on buying for more information that pipe dreams dot org ... this is a pie and American public media\nAttention all educators NPD has partnered with the secretary of state's office this year's promoting the note initiatives will help your students learn important lessons\nAbout ... well I think than in the classroom in December ... he didn't crunch Mississippi get engaged with the ... election plus art an essay contest for more information about promoting the boat where did you sign up your class or school visit NPD on line ...\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at impede the online dot O. R. G.\nAnd Mississippi Public broadcasting this is Shannon\nThe Jewish I'm anti motion back within our music from various points out the Jewish space time continuum including popular songs you may know aunt rare recordings that\nIce dusted off just for you the Jewish people's in tents\nAutumn holiday season culminate this week with a day of wild celebration\nOn some ... the day for rejoicing with the Torah juice complete the annual cycle of public readings tourists grow\nAnd begin anew by chanting from the first chapter of\n... genesis then they sing and dance with the tourist squirrels and some may even drink a toast others may drink more whether you understand that tour as God's literal word as human writings inspired by God\nOr as a document that various Jews compiled over the centuries the Torah remains central to Judaism today on sounds Jewish we welcome ... with music from around the globe praising the tour and holiday\nAnd expanding on biblical stories interpretations of stories and the song [noise]\n[noise]\n\n... by the messengers in orthodox rock band led by double pastor knack\nOff of the Nineteen sixty nine album the in Jewish town it's customary when Jews complete the reading of the book of tore it to recites the phrase shock jock for ... sake\nBe strong be strong and let us strengthen one another now more about how are they from a mid century modern pedagogical pair\nOf so called ... holiday we celebrate ... Dan\nThing way we follow the hot and then a gay and then carrying around in our living and\n[noise] the um\nAbout\nPeople\nGot a beep oh\n\nThe line\nAnd you know you were saying it was one of\nAnd you know [noise]\nYeah [noise]\nToo well go Toro from the two thousand three CDs I buy you die a music from the Jewish people up who got into\nI don't know how many of you know how the tourist scroll was produced a trained so fair or scribe writes each word with a quilt pen I'm part you meant following it he turned to lay out the goal is to precisely reproduce the tourists grow each time\nReading a new scroll takes months of concentrated effort\nHere's a short song from India for the dedication overdue tourists grow\n... or black man was a yeah I\n...\nDay and a man who more than a man oh ... no he you know\nWhole as it is though is that the guy you know so\nThe uh uh yeah not\nMy email or the day is a\nGuess I gained a new one man in the new uh living in a ... man\nI mean they have\nIn the\nSong for the dedication of a tourist scroll off of the two thousand four CD oh lovely\nParrot Jewish women songs from ... India\nThis set of global Musa ... storage continues on sounds Jewish with the literature go song from the roof stopping Jews of Zimbabwe for removing the Toro from a place of honor in the sanctuary holy arc to be read\nThis was an Eighteenth century devotion in the show the language that goes is great name is the holy one no one is why Kim even on earth there is no one light unto God or in heaven\n... no ... no no no I'm On\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n... who are quite arc my course of ... Jews from Zimbabwe 'em to two thousand three CDs the hidden gate Jewish music around the world\nAnd speaking of arc here's illiterate juggle song that reminds us whenever the R was carried forward Moses would say a rise floored me your enemies be scattered me you're supposed to be put to flight\n... show come from Zion praised as God who wouldn't God's holiness gave the Toro\nGod's people Israel oh\n[noise]\nOh oh oh oh oh\nOh whoa whoa\nOh I Am\nOh whoa whoa\nCut their Moshe ... ski one of the twentieth century great with by your he'd been so out of the opening of the arc off of his Nineteen fifty nine album Torah how could do shot\nNext following the tour reading in synagogue scroll was returned to the AARP is most congregation seeing some version of the traditional song comparing the Torah to a tree of life to those who hold fast to it\nAt all who cling to it right to happiness [noise]\n\nIt ain't no matter how ...\nHow they how they launched ya I'm\n... de la ... by\nGod [noise] for gay and I\nNo I\nNo\n...\nHaven't seen that have not heard the da da da\n... who led us rejoice by Cantor Alvin Michael send up north Hollywood, California and he's Nineteen Seventy six L P A world of Jewish music\nThe character and teacher a company is modern sound with a band contemporary look worse hair long and I just shopping jacket photo sport it loud print shirt actually that's pretty much how I look to that next\nAlong with the rich and Tora Judaism also consult the oral Torah\nNoticed a mission that multiple discussions on the missionaries are recorded in a set of legal books known as the ...\nThe attorney to grab my eyes were not writers of books but teachers by word of mouth creating and expanding the real power we do not so much read about these great so I just said as over here I'm In their session\nThis is the way the Babylonian common again from her time in the evening maybe they should not be recited\nFrom the time the priest may begin to\nThey're they're he's offering until the end of the first watch this is the text the Tom and wants to discuss and explain\nAnd here's the way the discussion and explanation go on what basis does the say set forth with the state and from what time quite as he first stated in terms of the evening he should first stated in terms of mourning\nFor this age the basis of scripture comes the reply where it is written and ... and that is recite them when our lives down and Gwen got rise to stop\nThis there for the meaning of the state and when is it that recitation ... at lying down time may take place from the time the priest may begin to eat up there he's offering\nIf you wish say this\nThis age has taken his cues from the stadium in the account of the creation of the world where it is written and first there was anything and then there was mourning one day notice no cast of characters described or\nEven named know worried about the time and place of the give and take\nA state and just quoted and immediately one plunges into the questions and answers which were exchanged in the academy as scholars try to understand and explain attack\nThe heart of the matter interpretation of tax is what kind it alone hardly anything else\nWhat do we mean by only interpretation of attacks\nThat that the town that is not a code our cat accusing laying down in summary form ... men's obligations are it is on the contrary the record of a process the actual process by means of which for law is made clear\nFor the focus of the comedies on the law in a sense law it's studying practice was the time you did misspeak\nThis indeed the rabbis of the Talmud hoped that they could supply the exercises which would become second nature and the world to come\nAuthor and scholar Judah golden reading from his Nineteen fifty seven books delivering Tom blood on an lp of the same name from I presume about the same time\nNext is chance Jewish ... Tara three songs about biblical characters first here's the king of rock and roll\nThat's dissing or not the character\nWell off and it was so\nI'm\nWhen I got a well\nHard headed woman a club dimitrius song that was the number one hits for Elvis Presley in Nineteen fifty eight it's from the two thousand two CD Elvis dirty number one hits\nElvis Presley had a Jewish grandmother on his mother's side which makes him a member of the tribe recording the Jewish law\nBut he was a practicing Christian who recorded a lot of gospel in addition to rock and roll and pure pop\nNext to song with much more sympathy for a biblical woman\nIt's based on a ... story about the matriarch ... experience during the sacrifice of Isaac her son was Abraham shaped in shows or the preparations for the sacrifice but stops before Isaac's rescue\n\n\nMay be way\nEver do I\n\nThe million\nHannah lab\nThat um\n\nUm\nIn my\n\nNo I'm\nTo me oh\nMaybe don't you\nMe late in the\nOh\n", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Jackson", "day": "09"}