{"month": "10", "state": "MS", "station": "WMPN", "content": "[laughter]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\nMm\nMm\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[laughter] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n... suits pianist receipt anger with concerts variations by Louis several\nLooking for a youthful perspective on classical music oh I'm going to play the Lynch transcendental to number seven it's very exciting an energetic and there's hardly any parts of South Park and overall it's a pretty good teeth\nNo further than from the top joined me Christopher I'm running for an anniversary seen each week right here on NPR Saturday morning at nine on M. P. B. music radio\nStations have been ... music radio R. W. M. A. H. Biloxi there'll be ... ... ... you may you Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line or jeep\nAfter the original performers have been intended\nTo lead time for a little bit of this but it's beautiful once again I just know since connecting to Boston symphony orchestra music I'm sure to coverage for many years Nineteen thirty five thirty six the finale of the fourth symphony [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\nMm\n\n\n\n\n\nAnd then the finale and we're going to use two different recordings but with the same forces delinquent for the money and the same conduct their skinny but having ski the recording of the ... here\nDates from Nineteen sixty six but then for the finale record all the way back to the beginning to November Nineteen thirty seven in Leningrad still about ... what the Leningrad cinematic\nHere the final two bits of which has to go which is simply number five\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Jackson", "day": "15"}