{"month": "10", "state": "MS", "station": "WMPN", "content": "\nHere's ... often ... cool among other things that's being set out lamb chops is that what you call the pill\nLooking up sometimes you'll see exactly what I mean this is music that became famous about Fifteen Years later ... bowl into tales of Hofmann\nBut first to use it in an opera called the finance it's Neal but you have to walk off the dock you'll hear that the millionaire to kind of unfold and the first minute with this performance by musicians have the different under marketing ... [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nYeah the tune it may stick with you for the rest of the day that was the overture from the ... die often doc later used as the Barker rolling details of off the musicians of the new from performing\n\nIn ... music for centuries ago confound fresh into why even contemporary every week on Sunday ... you can hear a variety of modern performers treats and use it gets a living art form put their unique imaginative\nStamp on music from the Eighteenth century\nI'm Suzanne bone and I hope you can join for ...\nSunday Morning at six impede be music radio\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be online dot O. R. G.\nHi they're welcome to spring music it's almost like with our seen this week is ought to leave\nAll sorts of a tumble music we're starting off today with music of the Norwegian composer it burned Greek me to visit during ... Eighteen eighty eight forty five years old and he was coming to Birmingham in fact some of the famous try any old music festival concerts there hold it in the city\nBut with my brand new piece for the English audience or an overture based on his arm he'd written a little bit earlier cold autumn storms so let's see if Greeks ... overture lives up to the army inspiration Mm\n\nMm\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\nMm\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\nMm\n[noise] [noise]\n\n\n\n[noise]\nMm\n\nMm Mm\n\nMm Mm\nMm\nAlone in a barren fields leaning against the sea splashed lift them see one\nEnraptured listening with our autumn evening he signed by Sean civilians some first by her we must have been a great finishes soprano she's accompanied here by one of her countrymen psychotic or I'm open tucked in the city of Birmingham symphony orchestra is Sean civilians\nAs beautiful as that is it's a little bleak isn't it [noise]\nWas put a couple of pieces together starting with a lovely piece from the American violinist and composer Michael Carter\nWho compose damage to tone you'll be by the way she calls the American seasons\nThat's your fault that go into the didn't\nTalk my way of Robert Frost\n\nMm\n[noise]\n\n\n\n\n[noise]\n\n\nHe's a lovely energetic and it tells you performance of the first ... of Mozart's ... or ... district ... Herschel for five eight that was the ... string quartet playing Mozart's version about forcing the hunt\nWell I'm In the mood for another sort of fall I ask you at right now and I know just a composer to turn to Frederick the earliest for nearly two sixty two and a precious composer whose English was actually a lot of French influencing this work at a great affection for France\nYou spend a lot of his life in France but when he was home in England you love trapping divorce is needed a Yorkshire I proposed to set a piece is called North Country sketches about this is like for the landscape their ears Charles MacArthur conducting the orchestra the Welsh national opera [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Jackson", "day": "02"}