{"month": "10", "state": "SC", "station": "WLTR", "content": "Look I enjoy cat videos as much as anyone but flick Maine isn't covered I'm scotch you listen to NPR for news about your commute\nJoy cat videos as much as anyone but click bait isn't covered I'm Scots aren't you listen to NPR for news about your in your local journalism matters show does your support leach keep reporting the map come visit South Carolina public radio dot org thanks so much\nTo South Carolina public radio WSBIU FM Charleston in eighty nine point three an HD one W. E. T. R. creamed one night and we\nAnd WNPR Columbia Ninety One point\nHello funeral she with you again with pleasure it's official and genre thanks a lot for joining me Mm\nMm\n... ...\nNo no\nNo the\nLike them on ...\nMe borrow\nMy mom\nWe have started off with beyond and getting this week from her album to murder was my turn so loved his T's and she was dipping into the traditional ... and get in there\nI think to some music you hear mostly ... tracks that are maybe a little obscure that you may not have hair that\nI think to some music for you to hear mostly kind of put a whim tracks that are maybe a little obscured that you may not have had that\n... particular ... a few surprises which I Know you're going to enjoy how about this it's from the legendary ... Donnan hit banning Rhapsody okay here we go\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\nWere not made out of drugs being black\nIn the book me on a train and they brought me was\nThat no one to go to my bail\nSay there's no way up in a county Ga Ga\nThose papers in the line\nNights for a ... a ball that I'm ...\nDa da na to make my rounds on that little say they show her down\nFor when I went to bed\nFor but they don't\n\n[laughter]\n[noise]\n\nUm [noise]\nNa na na\n\n\n\n... you know we put all\nRemove a week\nBefore they\nBob ... no\nOne will try\n... von ... de la la la la the rabbi\nOn the other\nHow much they do\nMean right\n\nBoth in the\nRight thing\nThe books that have\nGoing out on the\nBar and they\nThat time when you do get other\nBig dude\nMan\n[noise]\nI don't want it\nTo me\nYou\n\nNo\nLaura I'm\nFond\n\nDi\nBrandon ... a real around the sun with his her more than ... a more minimalist approach\nFrom the original or constriction all built feelings rather times we're going to continue was unexpected fines on ... and it didn't ... heart ... still to come first this is still hot July of ... the weather's wrote this song in Nineteen Seventy one eight no sunshine\nTo ...\nThe thing\nThey do a bunch of money that they know they're gone\n... telling\nGrow\nGo on a ...\nMuch oh no no no\nThat's a\n...\nThe\nDark na\nNa na\nSummer oh my God\n...\nWe do and then around ...\nOr ...\nOr stuff like that\n...\nYou know some some like oh man lonely ...\nI think it's a legal\n\nCritical um ...\n\nMm Mm Mm Mm\nMm Mm\n\nMm\nMm\n\n\n\n\n\n\n\nIn a down to a religious\nWell it's hard to imagine\nDoing the right to be in", "show_name": "Bullseye with Jesse Thorn", "year": "2018", "city": "Columbia", "day": "15"}