{"month": "10", "state": "SC", "station": "WLTR", "content": "More at G. A. M. A. C. dot org\nAnd the U.S the symphony orchestra presenting Brahms symphony number one between works by Brahms and Beethoven with Stephen screwed or on piano Thursday November first at seven thirty PM\nBrahms symphony number one between works by Brahms and Beethoven which Stevens food or on piano Thursday November first at seven thirty PM at the cougar center in Columbia tickets at cooker Center for the arts dot com [laughter]\nYou are listening to South Carolina public radio W S C I F ... Charleston in eighty nine point three an HD one don't even eat PR Greenville at Ninety point one at WNPR Colombia and Ninety One point three [noise]\nBe under chi with you that he glad to be here I'm here we go once again with the ... ... [noise]\n... ... ah the mistakes let Jake music each week turned on the silk takes us on a journey to look policy the Catholic Church to events full historical you to do light on love and then to hope for the future some types of ...\nTurkey to event full historical eat us through lives on loves and into hopes for the future sometimes the journey is less specific drift off\nIn a more mystical moods checking I missed some legends and then using tales visiting places of the imagination and so it has this week from Ireland Scotland\nWe will be in imagined drowned and sometimes\nWith real places and people who are not of the stuff of legend\nDonahue Jim ... should eat O'Connor ... they are just some of the travel agents into guides all you need to do is packed your own imagination old by dogs the head with a French Renaissance Don's known as a brawl popular in the sixteenth century\nAnd brought to Scotland through the old alliance between these countries possibly treating the vein of that most legendary head of state ... Scott's\nFrom a link those first there's a ballot and it was collected in Shetland in the nineteenth century it's a full faction of the tale of ... that if they in is in the ancient Shetland dialect of northern end of the loan last ancient choosing one scholar wrote\nThat the students should be recovered from ... from the middle ages as little to be expected as that we should hear horn from Elson blonde blue and\nKing or feel from ...\nI don't know\nOne I like it a hundred\nI don't know\nThat wasn't the highlighting how what's the line about how I got a long time\nNow highlighting the last\n... ... ... I Know\nNot willing to highlighting you say that but you know I mean I Know\nI was a high like any\nFun they live about how like how could I Know\nGot what am I getting\nThat maybe she did he might have known that I Know\nWho they\nPop some not but hey I got home and I don't\nI\nDay the home in Miami\nI like getting\nHome not getting by non good at all\nHad ... ... ...\nLike it is there a month on the whole\nNot one that I like it is not that I'm On the phone\n\n... ...\n... ... ... well I'm ...\n... new show the view\nOn they can cause\n...\nShe'll ...\nShe'll ...\nShe'll\nShe'll be\nShown who\nDon't know man\n... ... ...\n... ... ...\n... ah yeah my ...\n... new ... new\nIt's non young new games can you know\nOr ...\nOr\n...\n... ...\nNa na\nSure the\nThe new\nA new\n\nHigh other than here\nNo no\nNo no no no no\nOn the\n\nShow oh\nNo\n\nNo no I\nWas young\nShow no no\nNo\n\nNo\n\nNo\nNo no\n\n\n[noise]\n\n[noise]\nSo on three in the\nNews do you do\nIn the ... the no\nSure\nFirst I'm a\n... I\n\n...\n\nShe die\nFees\nAnd you know\nThe\nThe the [noise]\nNo [noise]\n\n[noise] well\nOh\nOh I'm\nSure NATO corner with the ET tear up Molly Malone\nAnother ballad ahead and although the ... I thought to be a vote imagined ... specific it is built around many known historical facts in twelve ichi one Margaret Dr off king Alexander the ... the ... the king of Norway\nAnd traveled there by ship escorted by a large number of ... ...\nMany drowned in a storm of any old ballot band so Patrick spans and it's a habit of June ... ... and the devil\n... [noise]\n\n[noise]\n\n[noise]\n\n\n...\nThe\nThe ...\n[noise] and\n\nMm\nMm\nTo the news should a\nBall with\nKnew was the ... but\nHe's walking a dog is a\nRuled that she could\nWalked off ... oh\nLight that is the\nOf light that is the\nDo the ... on me\n...\n\nThe ...\n\nD you mean\nTo um\nLittle read we man\nThe norm\nYou rely rely as well ours\nSolo when I hear your ah\nThe when\nRaw just much ready to go", "year": "2018", "show_name": "Bullseye with Jesse Thorn", "city": "Columbia", "day": "29"}