{"month": "10", "state": "CA", "station": "KFMB", "content": "This is a branch will seep president of will see Asset Management and those are the smart investing show on Saturday mornings are you concerned with the ... the market maybe you're not getting the investment returns you would like at will see Asset Management we use a proven strategy for investing that delivers good returns\nAnd lower risk don't worry about any high pressure sales tactics all the office eight five eight five for six six eight five eight five or six ... you're a free consultation or visit the website smart investing two thousand dot com\nBusiness needs bass secure networks to be efficient and profitable detail can help you keeping your data secure your business seats and connect\nWe've been helping San Diego businesses since Nineteen eighty three days you can provide expert solutions for networks voiceover I. P. wireless and video security we can help you make the right choices for your business\nCalled detail it eight five eight five seven one thirty one hundred\nWhether you're networking four or four hundred systems we have the solutions the answers and knowledge to make it happen we have expert IT consultants have experience in helping local business schools state and government with experts solutions such as voiceover IT systems from Cisco why and secure professional video surveillance solutions using top quality components\nDetails here thirty five you're strong we had the experience to do it right and we would love the opportunity to help you and provide you with the right solution\nGive us a call and talk to details corporate sales consultancy eight five eight five seven one thirty one hundred or email us his business at\nThe doses dot com da T. E. L. S. Y. S. dot com\nFind Seventy five years as am Seventy Seventy San Diego's talk\nTragedy it's five\nO'clock on AM seven sixty I'm Jim sharp ... that's one of the stories we're following first a check on\nTraffic news in ... accident earlier a bad one find something agenda see avenue has cleared and that's the good news that the the two right wings that were shut down\nHave been reopened traffic is still extra heavy however from the five Fifteen north mount a rainbow valuable or to North county a crash right shoulder also fifty to ease bend your central road exclusion clearing there this report sponsored by ... villages\nCNN to homelessness donate vehicles to find a job in villages your gifts help fund housing and healthcare for local families who had a neighbor dot org recall one eight hundred homeless to\nDesperation has exploded into anger four days after an earthquake and tsunami severely damaged parts of an Indonesian island CBS there's been Tracy reports\nIn four days and the er here violently show lasted seven point five Ninety to wait for\nHeavy machinery has finally arrived to aid the rescue effort buddies now increasingly over in recovery operation [noise]\nThere are still signs of hope on Monday Night eight thirty eight year old man with a whole new level\nOf buildings old I was able to talk to the west yours we spend three hours to say [laughter]\nSadly that kind of story is now a rare one of the rescue workers show me this big white piece of paper that they had up against the wall where they write down the victims they have found and just in their one small search area on Tuesday they found seven more by\n... CBS News polio in any\nExpect a call from President Trump tomorrow actually it's the first ever presidential alert CBS News Anna Werner explains\nFormer secretary of homeland security Jay Johnson says it's designed to be used a very specifically and rarely\nThis is something that should not be used for a political agenda\nHe says that this especially important because no one can opt out of these alerts\nPresidential are and some people are thinking oh man I think President Trump sending out Twitter messages all day long that has me I'm going to get whatever message that President Trump wants to send out terrorist alert system now\nNo not at all um it'd be you know one thing that we need to make very clear is that um there are laws policies and procedures that are in place of a political also ensure that the system is used in accordance with a isn't tend to use as defined by the law\nAnd order CBS News New York\nVoter registration and California's hit an all time high more than ... Seventy five percent of the state's eligible voters are now registered with more than Nineteen million people on the voting rolls ahead of the November election Republicans and Democrats both saw their ranks shrink while the number of unaffiliated voters rose\nJust under forty four percent of registered voters are Democrats twenty seven percent or unaffiliated and twenty five percent where Republicans\nA victory for people who say California's beaches should be open to the public the Supreme Court says it will hear a case over the state beach access centered\nAround a billionaire who buy property and half moon bay in two thousand eight and later blocked public from accessing it that prompted this they're frightened foundation to file a lawsuit\nMessages you can't do that\nBeaches in California belonged to the people of California\nAt state appeals court ruled that a coastal development permit is needed before denying public access ... Michelle Medina\nBears Newsday Sean styles with your micro climate forecast\nA nice cool down today and expected to last right on through the rest of the work week in fact\nGet this another chance of showers tomorrow but how much ten to twenty percent chance a less than a tenth of an inch of rain temperatures along the coastline will be in the low to mid seventies inland you're pushing to the mid eighties for CBS News ate a meteorologist Sean style and now it's cloudy and\nSeventy nine in power away chargers coach Anthony Lynn says they will reassess their kicker situation this week what a shock this after Caleb Sturgis miss two extra points in a field goal attempt in last week's squeaker over the forty niners\nThe five at five as Roger Hitchcock and Brett ... next am seven sixty talk and breaking news so\nMuch\nFor your Rogers\nFive at five with red ... urges refinance reverse visit along goes on is fun I Am seven sixty K. F.\nM. B. good afternoon good evening Roger Hitchcock I Want to state at the outset that this is a harassment free zone no harassing no ice tossing none of that of any kind okay\nOh very good what are we going to talk about\n[laughter] what were you what are going to ... when you and I will not harass anybody but you know oh no no no no we never did\nNo absolutely not I Want to start in DC but not specifically on the big D.C story it's just one of these we've been talking about this kind of stuff for years and it's funny when it finally happens Washington DC the city council realizes that\nAt Fifteen bucks an hour minimum wage thing is a is a problem for the restaurant industry you see this piece in the Washington Post Raj\n[noise] it was astonishing because look what look back up America ... years for bartenders and waitresses and waiters and after both boys who are relying on your income California Lawyer great get minimum wage for\n... credited covered in water grief crude was a part of a national campaign to it\nAnd that was going to now wait a minute if you're going to limit the cars under Seventy seven they could do that they could limit them to the minimum wage right and they said wait a minute I make way more than that exact don't don't try don't try to come in here and do that\nTo California the minimum wage plus the tips right Seventy seven opened a loophole that okay we're going to raise the minimum wage will you guys get all that but then you may or may not get the tips depending on the restaurant management well workers would wait a minute I worked for us\nSo there was a pretty interesting debate about the impact of minimum wage chips et cetera in in Washington DC and grieve there's the free market came up where\nYou didn't just single end up in a in a federal court some place I mean you think the single will be me in front of ... maybe I shouldn't say that but you know what I mean\nYeah doesn't doesn't everything winds up of course it\nWouldn't surprise me at all but it was interesting that the council members who are overwhelmingly liberal progressive journal bureaucratic people in Washington DC there's not a conservative in their ... uh the the uh the chairman of the ... the Democrat so Mendelssohn\nSaid look quote if laws about law should be amended or repeal it doesn't matter if the law was adopted by the book I saw there was a progressive you know we don't care that the voters are crazy left us we're going to protect our our restaurant industry which of course it was driving in Washington\nAnd you know the the beauty of this nobody but tourists pay ten cent of their own pockets everything else is expensive so I mean that is a license to print money from the servers and the waiters and waitresses\nI had to just to bring it down to the local scene or when I had a restaurant I had a waiter very good or bad I earned every bit of what he got but you know Fifteen Years ago we made sixty five thousand dollars a year or thereabouts a in tips well that was more than I was making the owner\n[laughter] kind of interested in that because he also made the minimum wage you know out of California Los Alamos and it\nAs a result I mean dining out in California frankly are more expensive than it is anywhere else\nYeah for sure well we will watch this and see how this progress isn't it spreads anyplace else All right let's get to the nitty gritty the ugliness of the moments and it's the back and forth over Brett Kavanaugh\nAnd I'm now we're coming to find out a couple of days so apparently only the senators only senators will get to see the final FBI report which means it's going to get leaked by one of them to the New York times and the wall Street Journal all that but nevertheless the rule is only senators are going to get to see that\n[noise] you know I thought Mr McConnell was kind of being snide a or snarky couldn't tell you what you said that because that that the minute\nHuh I think it FBI report may be coming out and I think everybody on all sides are going to be a little disappointed because they're going to say okay we talk all these people here but they said it was going to be no different than what we know they already said already\nRight can't wait to have a great nightmare talkative active right now all the best Roger Hitchcock went to five and five Brentwood herbal showing them seven sixty talking breaking news he met with the latest headlines what's object\nSo far San Diego is missed out on the rain forecast to come with the remnants of hurricane Rosa by Phoenix got a full dose today and where they came extensive flooding trapping some drivers on swamp Phoenix street metro Phoenix area got more than two inches of rain by mid morning\n... hearing continue today for San Diego sheriff's deputy accused of sexual assault Richard Fisher was back before a judge today he's accused of groping and sexually assaulting sixteen women while on patrol\nAnd a nine year old girl suffered a broken thigh bone mall riding at docklands electric scooter\nIt happened shortly before seven thirty last night on Dwight street in city heights she was riding with her sister sixteen you're or sixteen year old sister when the older sibling fell off the scooter causing the younger girls lose control in slam into a tree\nYou're never more than Fifteen minutes away from the top stories of the day on the ... show am seven sixty talking breaking news\nAm seven dogs and breaking news\nMarco Seventy eight freeway West Nile before sycamore avenue an accident leveling blocked in trying to use slow some about two and sunny ... avenue in accidents clearing the transfer means ... do you spend your central road\nThis report is sponsored by the San Diego zoo silver go wild in San Diego zoo in safari Mars where kids are free almost blown sponsored by missions federal credit union does in San Diego zoo not or for more information if you plan on buying\nListen to this important message from rex there is no longer any reason to pay six percent to sell your home introducing rex rex sells homes for the lowest in the industry two percent total saving consumers thousands of dollars per trends\nFor transaction way threats to get a full service team back by technology they don't market homes the weight traditional agents do refuses\nBig data and machine learning to attract hundreds of corn will\nFind buyers directly to your home the moment it goes on the market and restaurant just only two percent total not the six percent commission your local broker expects get started now by calling eight three three rex home that's a three three R. E. X. home rex can also help you buy a home your license rex agent Lorraine showings\nNegotiate offers guide you through escrow and even get your pre qualified for a mortgage at the lowest available rate rex is with you every step of the way to speak with a wretch representative call now and a three three rex home backs a three three R. E. X. home C. A. L. D. already licensed zero one nine seven six zero one zero\nAnd says he I guess\nYou'll just received your highest electric bill ... has this illusion goes Silverman roofing American style Brazil or is he said he goes local inveterate soldier with Ruben director for\nVery limited time say six thousand dollars to declare your independence from the electric company goals for some errors right now\nA days five three nine eighty five sixty three eight eight eight five three nine eighty five sixty three separate delivers dot com overexposed\nWith regard to the place he looks like a completely deal the U.S will be around somebody want to do\nBusiness needs fast secure networks to be efficient and profitable detail can help you keeping your data secure your business safe and connected\nWe've been helping San Diego businesses since Nineteen eighty three days you can provide experts solutions for networks voiceover IT wireless and video security we can help you make the right choices for your business\nCalled detail at eight five eight five seven one thirty one hundred\nWhether you're networking four or four hundred systems we have the solutions the answers and knowledge to make it happen we have expert I'd see consultants have experience in helping local business schools state and government with experts solutions such as voiceover IT systems for Cisco wife fi insecure professional video surveillance solutions using top quality components\nDetails here thirty five years strong we have the experience to do it right and we would love the opportunity to help you and provide you with the right solution\nGive us a call and talk to details corporate sales consultancy eight five eight five seven one thirty one hundred or email as a business that they tell us this dot com da T. E. L. S. Y. S. dot com\nMark held designer remodeling invites you to their free outdoor living space seminar Saturday October twenty you called six one nine for for one Ninety three hundred or visit trust your home to US DOT com\nGear cities around ... which came up in these real estate in mortgage analyst may run around\nThe darn close at another all time high following news of the trade deal with Canada but bond yields which usually rise on higher stock prices actually\nMoved lower on concerns over political tensions involving Italy and the euro zone meanwhile according to core logic in August year over year home prices rose by a lower five point five percent great conforming no\nPoint thirty are fixed mortgage rates average four and five eight ... cause you to foreign money for something completely different degenerate research has come from that men get tired of shopping trips a lot faster than their partners according to quit code dot com the average man gets tired of shopping after\nTwenty six minutes while the average woman in last much longer at around two hours or more information on home loans or real estate visit our website at around ... base or called me at eight seven seven seven sixty eleven thirty this is marijuana around four AM seven sixty ... Brett Kavanaugh\nA lot of down fills the phones important to have the FBI do more than just\nSeven sixty are demanding that twenty three separate individual's interviewed as part of this event I think is the thing was that being said I'd like to go quickly because it's unfair to him at this point\nWhere the real issue is officers on writer of allegations of misconduct at her I Am sitting I'm sixty one rather on the back of a judge Kavanaugh fellow so us try mirror and breaking news\n[noise] it is\nA wonderful show I have seven sixty talking breaking news Helen is in humble wanting to talk about cabinet hello Helen what's on your mind\nI'm well thanks yeah\nI'd like to comment that he can actually say yes I Am I saw a picture on the news and he can't be Margot Thirty years old\nSo ... how can she be involved with having all wow that's the\nBig ... well that's the big one day but it but but we don't know when the allegation right when when are the allegations alleged to have occurred\nFinally now that it yet but by having chicken\nChicken contend she could be the new the new bullet and the gun that's going to say that it happened uh contemporaneously right here in a more contemporary\nFashion look it's tricky situation all the way around and we got a lot of questions and we've got a lot of answers but we don't have all the answers because we don't have all the questions that's\nThe thing we got to remember [noise] let me tell you this real quick for smiling face [noise] over in Ireland prison guards are very upset very upset over in Dublin\nTheir in their yard there there patrolling they discovered that age or a drone was used to deliver Chinese takeout to a double in prison\nThat according to the Irish mirror\nJail staff discovered containers from a fast food outlets in a band in the yard and the weak field jail leading them to believe it have been delivered by a drone a source said there's no other conceivable way Chinese take away could get into the prison other than by a drone\nThat's what the staff in the jail believe\nThe food containers were founded about six weeks ago now if I'm going to use a\nDrone to bring me something in prison it's ... it's going to be something a little more valuable than low Maine\nMaine is nice and young is okay well in like some ... beef\nBut I mean I Know aren't you going to get like real contraband come under the person that you can sell\nWhy didn't why couldn't couldn't the guards and brought it in\nExcuse me sir can I get a coup platter ... whatever we'll show him seven sixty talking breaking news Jim shove it with the headlines\n[noise] the accusations against Supreme Court nominee Brett Kavanaugh will continue to mount now they're hitting close to home will tell you about in oceanside woman's claim next [noise] am\nSeven sixty K. S. N. B.\nFollows a great time to change your old windows and put an end to those expensive energy bill Newman replacing windows obviously there's a place to go you can save two hundred dollars off the Amazon or be on a more energy efficient no guard vinyl windows when you purchase five or more and you can also say five hundred dollars off the Amazon piano guard vinyl patio doors\nThe solver camping combined with any other offering it expires at the end of October thirty first the quality products the best product\nAnd the customer service that you Kevin Noonan windows absolutely next to none of the customer services beyond\nAnything you've ever experienced anywhere they never used subcontractors hundred percent lifetime warranty on labor and on all ... products so when it's time to replace your old window and patio doors just remember one day Newman replacement windows eight seven seven seven Newman for free in home estimate Newman windows\n... there for them\nTermites are swarming don't let termites kick you out of your home if you suspect your property may have termites stay home and call the orange oil experts ex termite\nEx termite controls termites while you stay home they're licensed inspectors are courteous and clean and we'll explain to you in detail how orange oil works to kill termites in eggs on contact their key product is ... two thousand orange oil plus the purest and most potent centrist product on the market for controlling termites\nYeah but now that all out in the public everybody's got their eyes on that and everybody watching I Would call them all under the carpet and just like all the carpet out under their feet and you got three hypocrite [noise]\nYeah no I understand I appreciate that I appreciate you with that a suggestion Jeff Flake I Can't tell you the number of times a day John gets a phone call from somebody saying please hear from Jeff\nJeff Flake who need more just like Jeff like more just like cut twenty nine Jeff Flake says he's got an open mind just look\nWe both hope and have been pushing the White House to\nTo make sure it's a full investigation and it's not to undo limited\nBowls and I hope they're doing it to find [laughter]\nWe have not seen any of the reporting yet we were told it might come back we're in real time um and we might have some decisions to make in terms of where they go my hope is that they\nAs they interview these individuals' immediately follow up on other leaves that that might they might now so\nWe don't know exactly where it is in terms of what it will take um [noise] I I just hope that we find and uh I have an open mind just like I had in the hearings and we'll see what they come back with I don't want to prejudge what\nDid you say you wanted a Folsom investigation is that what did he say one of the Folsom investigation that's what I heard you think this is Johnny Cash record\nI mean come on\nBut he continued he he's running for president by the way with Chris Coons as vice president in fact I think they'll be co presidents I think Monday Wednesdays Fridays flaky Jeff will be president Tuesdays Thursday Saturdays and Sundays\nChris Coons will be\nNice booming president when this case it's good to be president will never be president until that man learned how to eat pancakes like proper people do cut number thirty Jeff Flake talking more about the investigation go\nNo investigation to the ongoing um they they interviewed a first for that were named and branched off from there is my understanding and our interview an additional individuals um and as it should be and I hope that they follow\nLeaves that come from those of first interviews the what are the agreement that we struck the compromise or we struck that we'd have something that was limited by the time yes as Chris outlined it in the speech before we [noise]\nWe went outside a two one week and then we would limit the scope of the scope being limited to current credible allegations\nAre we didn't want to throw something open for ... to come out like Rhode Island boats thing that was out and then retracted or or some of the more outlandish ones out there um and uh we\nWe checked with the O. J. and they showed us that this was in within what you know the timeframe that they could do it\nIf I had to go to a speech with flaky Jeff I Swear I Would open my wallet write him a check for like two hundred dollars to just stop talking\nHe pains me to listen to like he is painful till I thought\nI thought Shelley White House ironically enough of Rhode Island was painful listen to Jeff Flake is trust my lord is impossible to just can't take it many San Diego what's going on many\nWhat happened to hurt this but I think about it tomorrow there's an awful cell phones are going to get that emergency message from Trump yes and think about the FBI as soon as the night may\nI'm clear their best to gauge it yes and at that the Democrats are saying that this whole issue is starting to slip away from them right I mean what happened when they all\nGot ... I'm ... I mean the judge to open up cages awful never to put their cell phones\nThat's awesome I Want to get their ferret\nWhat ... what ... what\nA what bath you were talking about the things we like to cook yes\nAnd the trauma and I'm not evil\nAnd I'm like okay you know the book they hate him yes I got ... ... ... ...\nI I mean do you think Jeff Flake I let Jake just wait how Donald Trump your trunk cowbell you want your child about\nDonald Trump leading a given what Donald Trump meeting leaders and shake you don't like my dog shaped the way I mean that's why we truck hey I mean not ... you know be at\nOdds are really good at the important distinction I agree with you a hundred percent on our now now man you got a promise me if you get the message tomorrow from President Trump you have a you have to promise you are going to forward it to all your liberal friends so that they get double and triple blast\nUm perverted or\nThey only [laughter] there's don't don't feel family that me and\nIt looks and you're always welcome with us over here man it's I was ... he is a great\nGuy and I love what he calls and other Faraday cage you had to put the phone in the ... oh my gosh that's an outstanding call ah here's Donald Trump for he said he said is a scary time for young men in America cut twenty four\nWell I say that it's a very scary time for young men in America when you can be\nSomething that you may not be guilty\nAs funny that were due process thing is supposed to work and apparently it's just I guess it's optional president continued got twenty five about accusations go\nThis is a very very very difficult time\nHappening here much more to do that even the appointment of it the largest it really does you could be somebody that was like somebody put a huge view of\nI pointed out a story from the Harvard grandson as you know Brett Kavanaugh was teaching law school classes there at Harvard University he's now not going to teach\nAt Harvard University law school and the reason why is absolutely disgraceful a number of law school students female law school students filed official title nine complaints with the university\nCiting Brett Kavanaugh as a sexual harasser who needed to be barred from campus\nLet that sink and read the piece I just tweeted out\nOn my Twitter feed at winter ball show it names some of these ... I mean these are some real Butte some of these claims are just unbelievable that you put that out there and I'm Sorry you you may not like Brett Kavanaugh you may not support Brett Kavanaugh but unless he sexually harassed you I don't understand\nWhy you would make a false claim that I'll tell you this right now one of them is named Kellogg they oughta if on the fence I think I Would investigator for making a false claim that Kavanaugh harassed her and I tell you what I Would do I think Boehner outta HR last and I think I'd call and all of her notes to pay for the uh to pay for the student loans\nYou can't I Can't call the police department in a community and clean somebody raped me and a lie to them without being\nCharged that's you can't make a false police report\nIt John and I am an argument nice a punch me in the face and I get John arrested he really punching the base we have a security video here at the station and they go in and punch you in the ... I'm going to face\nCharges that's a false police report what is the title nine point that's a false complaint [noise]\nSo now we can you ... a fire in a crowded theater because of ... me too okay got it ... what herbal show him seven sixty talking breaking news Jim sure about what's the latest\nIn New York Times is reporting that President Trump received at least four hundred Thirteen million dollars from his father over the decades much of that through dubious tax Dodgers including outright fraud time says its report is based on more than one hundred thousand pages of financial documents from his father Fred and his companies\nTo package is suspected of containing rice and were sent to the Pentagon today they were address to defense secretary James Madison navies top admiral John Richardson initial tests on the substance were positive for the poison\nForming linked to a white supremacist group arrested today in California in connection with the white nationalist rally that turned deadly in Charlottesville, Virginia last year Justice Department officials say the men to travel from California to incite the right bring violence to the rally\nYou're never more than Fifteen minutes away from the top stories of the day on the bread winner will show am seven sixty talk and breaking news\nTells you about it that we talk about it [noise] am seven sixty talk\nAnd breaking news\nSend Marco Seventy eight freeway west bound up before sycamore\nAvenue an accident locked in a couple of lanes for Italians clear now that the way just because he update from siege pay a little bit ago still so slow going into funds from my\nFifteen but only open find something that really strive to release French there that's also now clearing most is Travis stuff and go from Jenna see this report is sponsored by my GPA downtown San Diego's newest airline flying to all your favorite\nDestinations like Reno Las Vegas San jose in Phoenix flights began November first from the convenience\nA lot of down to the phones important to the FBI do more than that you\nDrilled seven sixty are demanding that twenty three separate individuals interview as part of this event and it gets down with that being said I'd like to go quickly because of unfair to him at this point\nAs a family owned company for over Twenty years we consider every customer to be an extended member of our family if you're looking for someone to take care of you and your vehicles and you've come to the right place\nEnjoy use of our free shuttle rides home into work or a low cost rental vehicle while you're vehicles being service or repaired west automotive group services and repairs or vehicle to manufacture specifications you can enjoy peace of mind knowing that we also back every repair with some of the longest nationwide Morsi's\nTake advantage of our no charge hedge but should sort of care diagnosis at one of the three San Diego facilities in African veto over home or ...\nOr your ultimate automotive service experience spoken appointment now at West automotive group dot com experienced the true meaning of satisfaction guaranteed that west automotive group dot com\nJust find Seventy five years the FM be San Diego's talk for a\nIt's three o'clock on AM seven sixty I'm sure I'm sure that that's one of the stories we're following first check on track\nMeets freeway eastbound just before the ... freeway interchange earlier stole he's like no clearing but traffic a little bit of extra so in the area also a crash earlier five north and the Loma Santa Fe right set of the freeway\nThis report sponsored by ... religious CNN to homeless this donate money to fund the jokes villages your gifts help fund housing and healthcare for local families but a neighbor dot org or call one eight hundred homeless to donate right now\nThat's one eight hundred homeless to donate [noise]\nThe White House is defending President Trump's mocking of the woman who is accused Supreme Court nominee Brett Kavanaugh of sexual assault saying he was just dating the fax me while we're waiting the release of the FBI investigation CBS News to coal kill you report\nThat investigation into allegations of sexual misconduct against judge has announced the wrapped up as early as today well ahead of friday's deadline\nSuit will be made available to each senator\nAnd only senators\nWill be allowed to look at it\nMajority leader Mitch McConnell says the Senate will vote this week and one of the few remaining undecided senators says he didn't like President Trump's comments last night about Dr bloody\nDry right\nSenator Jeff flake at it that he's not concerned that the FBI well apparently not interview Dr Ford or judge Kavanaugh as part of it investigations Nicole Kilian CBS News the Capitol Hill\nThere's been an arrest in connection with yesterday's series of suspicious ... containing the poison rice and sent to President Trump and the Pentagon CBS News Angelica Alvarez has more\nSecret Service says this is they should sound elope tend to President Trump never reach the White House investigators are backtracking to determine where it came from and its contents meanwhile the mail delivery center at the Pentagon remains under quarantine after two letters containing be deadly poison rising\nWere intercepted Monday he suspicious letters were sent to secretary of defense James Mattis and admiral John Richard ... chief of naval operations\nOfficial said those letters initially tested positive for rice sent a letter addressed to manage also had a written note which could help investigators track down to sender can lean to within thirty six to Seventy two hours right now all of the letters are undergoing further analysis\nAngelic Alvarez CBS News the White House\nIs investigating an accident that killed a worker at a spring valley iron company this morning a spokesman says an employee at West coast iron was struck by iron beams that fell off of a truck at a construction site on ... road\nJust days after king Hayes was bitten by a shark at beacon speech scientist are inching closer to identifying music Monique gray go talk to Dr Chris Lowe director of the shark lab at Cal State Long Beach\nWell white sharks are the most common off California coast low isn't ruling out a bull or tiger shark which are typically found in warmer water\nWind water temperatures degrees\nDitches for the first time ever that means we may start encountering sharks in places where we haven't encountered them before\nThe ... though says shark clients are extremely rare\nWhile it may seem like incidence of fights are going up per capita rate they're actually going down because more people are using the ocean than ever\nAnd when it comes to this weekend's attack that that that looks like potentially an accident\nThey'll start to stake in the person for sale central pray or didn't really know what it was but it took a bite\nNow here's Newsday tether Myers with your micro climate forecast\nAnd makes it sound in clouds out there on this Wednesday halfway through the week and we're still tracking a chance of rain moving into San Diego county at this point it looks like the storm system is a slow mover bringing some light sprinkles during the afternoon hours\nAnd then some light to steady showers at times this evening all the way through tonight I named seven sixty I knew they had their Myers\nRight now it's cloudy and Seventy five downtown ... next\nDay of seven sixty talking breaking news [noise]\nActually going round and round with a good friend of mine on Twitter who has a problem with the uh [noise] national\nEmergency system he's trying to say that no president should have the ability to put out an emergency alert to the nation\n... when it came to this ah I have\nTwo clips you've got to I Want the longer one okay the the one that so that's longer out of the two is the first one this is how will\nBe and uh and and sunny and\nWho's the other one uh there there was a wacky one they're they're really wacko a member of the ...\nAre so joy and sunny and ... how they just like panic and freak out about the national alert and I'm Wondering if my friend was watching the spirit when this happened go\nAnything we have to let you down there ah I'm giving you an early warning all Americans if you have a phone call he was going to be getting attacked from the guy in the White House to Eighteen is some time it's the first time on the presidential alert for something which you\nCannot opt out of [noise]\nDon't like that I mean he doesn't have proper etiquette or Twitter etiquette why why do I have to be subject I'm clean for like a terrorist attack or an ... pound man last one who tell me\nHow do you believe [laughter] you know I Can't stand the president's\nThat's just because you get those exactly right that's right so here's what I Want up uh make sure you use a back channel number there John called the White House I Want more ... and sunny and joy removed from the alert list so when the when the nuclear inbound missiles happened they they continue to just sit in the office building again and just get\nYou know get to see it of course the person I hate to see them have to\nSuffer the the indignities having to go down to the fallout shelter in the in the basement of the building that they're in a solar we should just have them come out to just take them completely off the list because I promise you want to laugh at and like two weeks they'll have a show about\nWhy aren't they allowing us to know that there's an imbalance nuclear attack why weren't we specifically told about this so this friend of mine I've just been trolling everybody all all afternoon\nI Want opt in an opt out on the emergency\nAlert okay well you know what that would be fascinating that you can do that on your radio you can do that on your TV 'cause last I checked that e A. S. test hits everybody we knew them every month we did a very onto your will required by the FCC to doing every month but suddenly when Donald Trump is testing the system that ... Hussein Obama\nAre put into a fast now now Donald Trump is evil protesting the system\nIs just so stupid to see this is how stupid it has gotten and I'm not saying how stupid liberals are you guys can draw your own conclusion saying how stupid it has all got its just all gotten I've got a piece of\nI'll share with you in a few minutes they're they're worrying about the political divide the tribalism I've never\nBeen worse the tribalism is terrible you hear this all the worst political divide over the tribalism polarization it's all terrible it's all bad\nIt's not it just it just is president and it's always been that way\nBut we have the luxury of complaining about the emergency alert system and we have the luxury of complaining about the polarization because you have a great economy courtesy of the effort to undertaken by the guy in the White House as well be Goldberg says\nPrivate payroll surged by two hundred and thirty thousand last month the Federal Reserve chair Jay Powell sees a remarkably positive outlook for the economy in fact CNBC is so bombed out about this they're saying that what he's saying is that it's just too good to be true\nSo good kid returns this was the I asked them number the\nThe ins and number of the Institute for supply management number which is one of these really boring economic numbers is at a record high period very like get that a record\nHigh it's off the charts do you know what that means means more manufacturing stop it means we're building stuff and needs to be more going to work and making money whole bunch more bowler I don't know you polarized than your paycheck to paycheck polarizing you\nYou got money in your pocket you maybe you're getting a car you're\nWith the article for water purification systems nothing Duncan them up to your washing machine your dishwasher your water heater\nHome and business in an industrial water treatment as well the ... has a utility Patton can't be duplicated is nothing like it\nTruly maintenance free for twelve to Fifteen Years so there's no water to drain and like other filters are are a whole house systems no electricity\nIt's the required no pumps and vows that can break no carbon filters or replace zero work\nSo stop drinking inferior water save on bottled water and ask about the aquifer reverse osmosis combination for even more savings seven six zero seven three or four fifty seven fifty five or vibrant\nEach ... dot com when Dan beer at the X. P. real T cells your house it will be guaranteed sold at one hundred percent of your asking price in twenty nine days or Dan will pay the difference minor terms apply but please know that everything is in the open with Dan beer great realtor puts his money where his mouth is please call if you're serious about selling your house called in\nAnd eight hundred six six seven twenty oh three that's eight hundred six six seven twenty oh three or visit sold by Dan beer dot com beer just like to drink sold by Dan beer dot com joined me weekdays for the lawyer and blue jeans legal minute right\nBefore six o'clock we'll be talking wacky laws in great information she then\nFrom and give me show you know at some point the FBI reports gonna you'd think this cabin on things over don't you know the FBI report comes out we'll pick out the information the backs of our side and we're right back in each other's throats freebie anybody know of a cave I can hide in milk feeling deep cave I don't care if they're bears and [laughter]\nWrite whatever happens will bring it to you on the Armstrong and getting show Armstrong and getting five AM to Pan Am am seven sixty talk and breaking news\nFrom Wales follow up there be a\nFairly as active shooter situation of Florence South Carolina has concluded the suspect is in custody after shooting five cops to city cops in Florence South Carolina and three deputies so ah three sheriff's deputies were shot\nAnd uh uh to city police officer since Florence South Carolina the local law enforcement agencies have announced that this is a this active shooter risk included a it's an active crime investigation now it is a crime scene is being investigated\nA no details other than the fact that the suspect is in custody I imagine it'll\nProbably be in the next five to ten minutes that we see the usual anti Second Amendment stuff posted\nA we must take the ... out of people's hands no more guns [noise] um [noise] [noise] yeah okay\nRichard and asking NATO welcome to the show what's on your mind today sir\nI'm not too much except just backing that up and one more thing for the Democrats to me are basically saying that they don't believe in ... but when they say\nThat it's too good to be true there fourth of July ... that let me tell me that they've gotten a ended a gift\nAnd you know they're bankrupt like we've talked about and this this active shooter situation now done\nIf we believe like a lot of the Democrats and the European invasion of their policies and the guns away from ... in France and England my guess is that could have been a lot more damage done without ... haven't gotten\nSo yeah I I I Can't I Can't imagine and ... no no law enforcement agency in this country is going to want to disarm their officers I mean that would just be\nThat would be insane but it's interesting right what do you have you have Democrats saying that this economy really isn't good and you have Democrats saying that they want to abolish an entire federal agency of law enforcement immigration and Customs Enforcement I mean that that has been the central tenet of their position\nAbolish ice and raise your taxes abolish ice and go to a socialist model on healthcare abolish ice and ruin Medicare abolish ice and ruined medicate abolish ice and dot dot dot\nDo not overlooked economic numbers\nDo not overlooked economic numbers ... they're going to try really hard to spin them as well lose or just outgrow civil bump look Obama left office in January of two thousand and Seventeen it is almost two thousand and Nineteen\nOh I Know he was the one and I know he got a Nobel Prize on spec and and I know I Know that the ocean levels went down and we are the ones we've been waiting for it\nAnd I get it I understand that right I get it that was the great hope of this guy but he was not an economic genius if I have unlimited\nReserves and I have a limited access to the Federal Reserve\nTo print money and to backstop banks and to do all that kind of stuff man I can get you a bunch of funky gross too\nBut it can't be sustained growth you're seeing now is being sustained organically like companies are selling stuff but what what what progressive don't understand is the American people by and large are afraid of you because they see that everything you touch turns to garbage\n\nRemember those great Clinton years in the nineties it resulted in the tech crash in two thousand\nThat that go go fake mortgage economy\nThat ran in the early to thousands because you could just you know lend money to your dog your your cat you couldn't lie and claimed that you actually had three million dollars in earnings last year as they should you should be able to borrow ten million bucks no problem\nThat was driven by big government getting in there and forcing with the Community Reinvestment act a bunch of people who didn't have business ... carrying around a prepaid God a debit card\nLet alone having a mortgage getting mortgages that was Barney Frank that was Chris Dodd that was Ted Kennedy\nThe same people that gave me the immigration system you have today by the way today happens to be are you already for this uh fifty third anniversary of LBJ signing the law that ruined immigration law in America we'll talk about that later in the in the program\nBut I mean this is a remarkable thing to keep in mind folks so remarkable thing to keep in mind eight hundred seven sixty gaffe and be eight hundred seven sixty five or six to Peter isn't fall broke up with a question hello Peter\n... taking my call 'em question you know I have a difficult decision come November my car's messed cars and don't get hotter\nMhm and I had\nOther good conscience vote for someone who is under indictment for what he's honoring diving or ... and there's absolutely no way I'm voting for liberal so I guess my question is is a viable candidate they don't give it up and you\nKnow those ... they don't exist anymore that why\nThey don't exist but I mean there's no answer that's come out of the woodwork\nMe you know there's no rain what's going on here you have a jungle primary right there's no third party option there's did you have the top to advance that's ... that's the that is the real thing of the jungle primary\nYou weren't saddled with what you are saddled with you have Duncan Hunter or you have camp in a jar in that race those are the two choices\nWe can we carry that out of the Bible would be a general election as well or at least the Republican Democrat a system we have I mean a coil always win whether it's heads or tails the coin always wins or you\nCan vote you can vote third party or in a federal and the federal election right in the national election for the presidency you can vote there because there's\nThere are third party candidates that run there are libertarians there are social is there a Green Party people there is no third party candidate on the ballot with with with this congressional race that's the jungle\nIt would only be a writer\nI if you could find if I let me know how you find a place to write it on the ballot that there is no blanket ...\nThat's that's just unbelievable\nTo me so we just surrendering that the people going to vote or cars or if they do and he's reelected well and he's found guilty that are well\nUh what would happen is if he's okay so let's take this in order he hasn't been convicted of eight and then he's been indicted or they had been tried and will not be tried before the election so there was no conviction there to\nVacate the vote so he would still be the congressman uh he if he gets a put on trial whenever this trial happens if he gets found guilty he would be sent to jail I'm assuming and then the seat would be vacated or the governor would appoint a replacement and then there would be a special election or you would wait till the next\nYou know the next to a cycle comes around depending on how how deep into this is that's what would happen that's so what I Would would I Would say is you know you just kinda gotta you gotta fill your unconscious them so I went really long spread what we'll show him seven sixty talk of recognition that was like\nFive officers were shot today is officials responded to an actor active shooting situation in South Carolina will have the latest details next\n[noise] am seven sixty chaos and be\nOn Roger Hitchcock with Roger report\nWell Jerry brown the governor of California signed eight hundred and fifty nine bills into law it was his turn after the legislature concluded its business\nWhat do you like it or not I really don't care here's the point I think what happened to these women in Nineteen Ninety eight they came for [noise] I don't live with the president said last night I'm the first person to say I want to hear from Dr Ford\nI thought she would handle respectfully though ... was treated like crap\nLosers\nBow yourself Lindsay says he sees himself right on man he's got a fighting side on him right now man and and I'm going to tell you something he's become uncovered because McCain's I'm dragging them down and Lindsey Graham\nWas elected by the people of South Carolina it'd be the voice of the people of South Carolina he was not elected by the people of South Carolina to be\nA sidekick to John McCain\nAnd as much as he loved to John McCain and they were best friends and he gave a very touching eulogy for John McCain on the floor of the Senate about oh heartbroken he was I think he has channeled his energy and his grief in large measure\nTo to causes that he thinks are just and I think he believes that Kavanaugh's getting a raw deal that he's getting blown up and and that he should defend him\nThis is a funny thing I I open to the hour talking about Paul polarization and tribalism and all the stuff that you hear these academics talked about all the time okay\nBut think about this for quick second [noise]\nPeople that worked with George W. Bush by in large or the fiercest never Trump hers go where they are the fiercest never Trump or his going Jeb Bush the Bush ... all those folks\nHate Donald Trump some of it is because they don't like the way Donald Trump when hard at Jan during the primaries some of it\nIs they don't like some of the shots that President Trump threw at George W. Bush some of it is that they think he's course they think he's impolite they think he is wrong and the way he has gone after President Obama and that and that's all well fine I mean you can have those opinions\nAll day every day can have those opinions it's not a problem but consider this for ... considered it when people tell you though there's too much polarization too much tribalism last week while the hearing was going on on Thursday and into friday while the hearing was going on while the hearing was going on\nGeorge W. Bush was working the phones for Brett Kavanaugh who is Donald Trump's nominee for the Supreme Court justice he he he was working the phones\nHe was working the phones to get Kavanaugh confirmed who's calling senators working to get Kevin often from now is that a win for George W. Bush or is that he went for Donald Trump it would be win for\nBoth everyone for both of them\nWhat it shows you is this yes never Trump nation is in full effect but in this case you do have attached interests between George W. Bush and Donald Trump they're fighting on the same side of the fight\nAnd the same side of the fight means putting Brett Kavanaugh on the Supreme Court that means there\nIs a light in that otherwise dark tunnels there is some daylight that you can see between these two guys which is a good thing\nThat's a bright spot that's not a bad thing the fact that Lindsey Graham has come around in the way he has\nIn the last six weeks that's a bright spot it otherwise polarized situation Republicans were polarized Republicans unified there\nWas a concern that all you do Republicans aren't gonna show up they're not gonna show up for the election they're not going to be in through is there's no energy all the energy is on the other side but you know energy with the Republicans are done they're sitting in this one out they're finished\n[noise] well [noise]\nSeems to me like Lindsey Graham is pretty darn engaged seems to me like like he's engaged real good here\nLook who is engaged against Richard Blumenthal detonating Dick Blumenthal Democrat from Connecticut\nCuts thirty two he said that Donald Trump didn't just lock ... a professor Ford last night he mocked all rape survivors really everybody's knocking everybody denying that come on now go\nGo file mocking attack on a credible immensely powerfully survivor of sexual assault is a mark of disrespect it is not only for Dr ... for the for the entire survivor community\nIt's not it's a critique on what ... said and then the overnight hours I Know everybody in this audience was following very closely as we found out about the letter that came forth as a result\nOf a of the interest of ... ex boyfriend saying that there was no evidence that she was claustrophobic no evidence that she was afraid of flying in fact she utilized her expertise to help prepare somebody for a polygraph a polygraph exam and and and for good measure when she was unfaithful to this boyfriend in Hawaii\nHe terminated the relationship and she committed a legit credit card fraud [noise]\nNow does revealing that indicate a duration a dislike or disrespect the violation against all victims of sexual abuse and harassment\nNo it's a critique\nOn one person and one person only nobody's handing out collective punishment except the people on the left eight hundred and seven sixty K. F. it'd be it's the Brentwood herbal show I Am seven sixty talk and breaking news event with that one\nIs five law enforcement officers have been shot during an active shooter incident in South Carolina Florence county officials saying the suspected shooter is in custody and we're still awaiting details on on their conditions and on the incident itself\nA Utah man was taken into custody today as a suspect in the investigation of letters sent the Pentagon officials and President Trump that were initially fear to contain the poison rice and\nWilliam Allen the third was arrested in Logan, Utah where the FBI is investigating quote potentially hazardous chemicals\nYou're never more than Fifteen minutes away from the top stories of the day on the ... show am seven sixty talked and breaking news\nTells you about it that we talk about it [noise] am seven sixty talk\nAnd breaking news\nAm seven sixty traffic on the five freeway north bound just before Loma Santa Fe we earlier had expressed as clear but traffic may still be a little bit of a steady there\nSend Marco Seventy eight freeway west bend a twin oaks valley road stole number one lane blocks us this report sponsored by my CPA dot com San Diego St Louis airline flying to all your favorite destinations like Reno Las Vegas San jose in Phoenix flights began November first from the convenience Carlsbad airport follow aren't getting tomorrow morning from five till ten and an am seven sixty\nPainting and invading math and\nDo you love your home then showing some love at the phone home garden show this weekend at the del mar fairgrounds your hundred them top quality hounded proven examiners offering special show thing\nBy amazing planets wreck from local growers plan enjoy informative free seminars where you really do need the aunt fern poor quality frantic for services and creative idea come to the ball on guard and show this weekend at the helm our fairgrounds hundreds of exhibit\nFree than our plants grow our direct do you love your home then showing some lab at the ball home garden shall we get up and down our fairgrounds for quality product for services and freedom idea\nCome to the phones garden shed this weekend in del mar fairgrounds\nDating animating fascinated\nTermites are swarming don't like termites kick you out of your home if you suspect your property may have termites stay home and call the orange oil exports ex termite\nEx termites control surmise while you stay home they're licensed inspectors are courteous and clean and we'll explain to you in detail how orange oil works to kill termites and eggs on contact their key product is ... two thousand orange oil plus the purest and most potent centrist product on the market for controlling termites\nIt worked so fast that term I have no chance and all orange oil turned my work is done without tent\nSo you won't have root for plant damage and you and your pet stay home while they do the work and you'll love the clean orange sent to\nCall for a free termite inspection at eight hundred four seven five thirty one eighty six eight hundred four seven five thirty one eighty six if you have a tear my problem stay home and keep the pants off called X termite the orange oil experts at eight hundred four seven five\nThirty one eighty six eight hundred four seven five thirty one eighty six\nAll men have ... in Seattle is let you down\nThink your best days are behind you think again if you suffer from any type of erectile dysfunction regardless of your age or medical history\nThe doctors that are men's health can help you now there's no pain no needles no surgery no medication just the newest available proven treatment from Europe using acoustic energy ways or FDA cleared medical device regenerate blood vessels indirect towel tissue was short\nIn office sessions and it's all done with no pain no needles no surgery and no medication\nCalled now for full information in San Diego called six one nine four hundred thirty four eighty four that six one nine four hundred thirty four eighty four if I ... in Seattle is have let you down coal arc men's health at six one nine four hundred thirty four eighty four and get your sex life back\nHave you been shocked by your recent electric bills compound our solar today and find out of an investment in solar makes sense for you and your family the number\nOne thing that homeowners overlook is the importance of her panel monitoring do not sign a contract with a specific language ... panel monitor the word monitoring that's not the ... the different ... per panel monitor most companies don't want to be held accountable\nThat's why I trust Palmore so they do seven six zero five zero four zero three eight eight or ...\nMarriages find Seventy five years this is the devastating than be San Diego's talk\nOfficers down south Carolina it's four o'clock on AM seven sixty I'm sure if that's one of the stories we're following first a check on traffic\nAnd crashed reported on the freeway unfortunately occurring just a little bit ago a freeway you spend your college avenue car in a motorcycle involved left side of the freeway affected traffic almost at a stop to my fifteenth also when the Mesa one twenty five freeway north on the freeway interchange an accident there at the start of the transition C. H. P. reportedly just holding up on seeing this report sponsored by county of San Diego recycling\nCounty of San Diego recycling reminds you to recycle your oil filter with your motor oil oil and filter they go together more at ... dot org slash oil [noise]\nFive law enforcement officers in one civilian had been shot this afternoon and South Carolina and there are reports that one of the officers has died CBS used ... Duncan has the latest\nFive officers from to law enforcement agencies were shot and Florence South Carolina about sixty miles west of Myrtle Beach now according to report it happened in the span of about forty minutes\nAt police are responding to an active shooting I think they'll say three foreign county deputies and two officers all suffer gunshot wounds and their topics that some of the officers are in serious condition right now\nI suspect is now in custody federal inspectors have issued a highly critical report on one of the detention centers housing immigrants in California CBS News Steve ... has that story\nAnd he says coming under attack for its handling of conditions at the largest detention center for immigrants here in California the report by the office of inspector general described poor medical care the report says detainees frequently wait weeks or months to see a doctor or a dentist\nInvestigators say they also found new says made from bed sheets and many of the cells\nIn March of last year at thirty two year old man killed himself using bed sheets there have been other suicide attempts Steve ... CBS News Los Angeles\nHas a Thirteen year old boy continues his recovery from a shark attack off the coast of Lou Katie over the weekend scientist say they're still not sure what kind of shark was involved in the attack but they may soon have some answers Newsday Tony grid go has more on the technology scientists are using to help identify the shark that attacked\nKing hey said that the Thirteen year old ... was bitten by shock at ... and the ... scientists are inching closer to identifying yeah\nThe first thing we want to figure out is what was involved and try to estimate the size of that sharp\nDumped a Chris Lowe is a marine biologist and director of the shock lab at Cal State university Long Beach\nWas important to know what these days maybe involved because there are some species that we know a lot more about than others\nOne of the rescuers who helped save team didn't see the actual mind they did the the shark\nDot com behind a kayak and sought turn\nAnd the water was flat enough that he was able to get a pretty good look at it and made a size relative to the kayak\nWitnesses said the shark appear to be tend to eleven feet and Orange County mad as file a lawsuit against every Catholic bishop in dioceses in California including\nSan Diego news H Eric Connor has more\nTime with him and says he was abused by his parish priest for two years starting in Nineteen Seventy eight when he was ten years old but humans isn't suing for money instead he hopes the lawsuit will prompt church officials to release records on clergy abuse\nThis lawsuit is really\nThe only opportunity I have at this point in time to find justice not just for myself\nBut [noise]\nTo bring all the victims that are in the shadows out\nFour AM seven sixty I'm news aids Eric\n... here Sean styles with your micro climate forecast\nIt looks like we've got a chance to some showers moving through San Diego over the next eight eight to twenty four hours or they become less and less as we move into\nThe early morning and then by tomorrow afternoon we should see partly sunny skies temperatures will remain below average low seventies coastal and inland you'll be into the low to mid eighties for CBS News eight on me\nUsing a meteorologist Sean style and now it's cloudy and Seventy three in del mar as a baseball manager when you lose one hundred Fifteen games you usually don't keep your job so no surprise today when buck Showalter was fired his manager of the Baltimore Orioles\n... next am seven sixty talk and breaking news\n[noise] now live from the valley you can feel at home sales to the\nThey lose a hundred and Fifteen games and that gets you fires much what's it look on the bright side was that you want to like forty seven [laughter] fast\n[laughter] you know get any credit for the forty several dating a guy like buck Showalter might get a pass because he's been around for so long shifts that I mean that's the problem has been around for so you're right you're\nRight I mean look let's be honest I don't I don't mean to dig up an old ugly memory but I mean when you look at the shot and\nHire more experience here in town the the president was established as being a pretty high bar if you really want to stick it to somebody that is true I mean in many ways but he uh fourteen yeah you're right into an era fired I Know\nYeah but they regretted that for years back [laughter]\nOr do you think if he was still coaching them that they would still be in town\n... well no I don't know about that they'd be in the playoffs they wouldn't go anywhere but they'd be in the part of his son was coaching them they might still be there well that's true [noise]\nWelcome itself Britain gyms the sports suck spectacular Arabs seven sixty gave up\nEvery ... let me say why does because if I ever mentioned towards I Will get like two or three emails\nGoing we don't need any of that\n... really why isn't this kind of like the ... the desert of the meal here's the thing so politics the biggest sport I mean here's the thing that I wrote here's the thing you and I essentially we just had an unemployment conversation\nRight we were discussing employment and unemployment is your job you have does it matter it's have you kept your job and have you been forced to relocate out of town tense journal\n[laughter]\nHave you lost a hundred Fifteen games and are you still working [laughter] do you think\nLike I mean not not to put too fine a point on it but you think like once you hit like\nNinety ... eighty\nLosses are you like starting to try to get in really early and get the officers lock the door and like not be seen by anybody see getting real hot\nYou're like a week I got a minute after lunch I gotta I gotta get a cold enough to be I Can't get through today but they do it tomorrow maybe [laughter] what's your plan\nOr getting in really really early on spring training like very January guys I'm here to\nKnow I see I I think what you had to do at that point is you have to do the ... the trick would you like walking seriously angry like they're on the phone we got a French that someone's getting caught\nI bring bring up back in from ...\nThat a suite ace\nBring 'em up from the ... was a kid we drafted last you went in and I don't care that he's Thirteen [laughter] will get his parents are so we'll be fired come on he's bringing the blistering heat\nI hold on I got to take this it's a Chavez Ravine is calling me I got to take to sell the be right with the with that meeting it is the Brentwood herbal showing up in seven sixty gap MBA now does that mean sixty five three six\nTo\n... many people in this audience had a crush on a list of mulatto once upon a time oh lord it are there were people in this audience who thought ... Alyssa mulatto just hung the moon was likely ever amazing now Alyssa Milano sat behind Brett Kavanaugh during his\nTestimony to this or the other day and in fact she did the one thing that I think is the most hideous thing at all of all she filmed him from behind she was saying I got a Instagram video from behind him which you would think Chuck Grassley like put that camera down\nSouth that but she still is a model when she was a ... word solace him a lot of home very angry at the president very cause he made part of Christine Blasey Ford last night in Mississippi at a campaign rally cuts thirty three an angry Alyssa mulatto enraged at the ... go\nSee those terrorists Sanders defending the president what's your take [noise] I I'm filled with a lot of range today I have to tell you [noise] um and it started last night and I couldn't sleep at all last night and I just can't believe that this is where we are that we're making distinct choice\nWho raise your hand if you really think she couldn't sleep at\nAll last night\nYou really think she could not sleep because you that much of a nut dude she she says she's enraged and could not sleep at all last night I Believe it\nOr do we over something political yeah I Do that's what you see the street and the shame that we have right now because people are that crazy they get so angry they don't sleep yes and they're just everything is all yes anything in their anger yes and they're on Twitter and they're just exploited the loans you can cook\nWhether you're networking four or four hundred systems we have the solutions the answers and knowledge to make it happen we have expert IT consult instead of experience in helping local business schools state and government with experts solutions such as voiceover I. P. systems from Cisco why fi insecure professional video surveillance solutions using top quality components\nDetails here thirty five you're strong we have the experience to do it right and we would love the opportunity to help you and provide you with the right solution\nGive us a call and talk to details corporate sales consultants today eight five eight five seven one thirty one hundred or email as a business at\n... dot com da T E. L. S. Y. S. dot com\nVis a branch will sleep president of will see Asset Management and also smart ... show on Saturday mornings are you concerned with the ... the markets maybe you're not getting the investment returns you would like at will see Asset Management we use a proven strategy for investing that delivers good returns\nAnd lower risk don't worry about any high pressure sales tactics all the office eight five eight five or six or Israel six eight five eight five or six fourth real sick you're a free consultation or visit the website smart investing two thousand dotcom\nTwelve point to four percent every single paycheck and your entire working life for the government has taken twelve point four percent of it away from you and put it towards Social Security how do you get that money back you would think\nThat the government will just give it all back to you when you turn sixty five you know there are hundreds of different decisions that need to be made in order to get ... the most money back possible from Social Security and they're not going to help you with us they're not going to tell you\nWhat decision do need to make David upstanding Bradley why will I trust the guys working with him for a long time and my Social Security sonar coming up Tuesday or Wednesday October twenty third or the twenty fourth\nAt six thirty still some to develop a gimmick all RSVP so you will know what you needed to get as much money back as possible eight five eight\nFive six four eighty thirty six Stephanie or Charlene will pick up a five eight five six four eighty thirty six men are sandwiches will be served David Epstein and read the white\nHigh it's Bryan founder of the west automatic group and the host of auto talk radio along with being the auto man on the cw San Diego our philosophy is we never put money I had to people as a family owned company for over Twenty years we consider every customer to be an extended member of our family\nIf you're looking for someone to take care of you and your vehicles and you've come to the right place\nEnjoy use of our free shuttle rides home into work or low cost rental vehicle while you're vehicles being service or repaired west automotive group services and repairs or vehicle to manufacture specifications you can enjoy piece of mind knowing that we also back every repair with some of the longest nationwide Morsi's\nTake advantage of our no charge ... diagnosis at one of the three San Diego facilities and asking veto all go home or corny Mesa\nOr your alternate automotive service experience spoken appointment now at West automotive group dot com experienced the true meaning of satisfaction guaranteed that's west automotive group dot com\nOx Dr ... before he was accused Supreme Court nominee Brett Kavanaugh of sexually assaulting her in high school\nI had one for you if you think it was just wondering how did you get home I don't remember how'd you get there I don't\nWhere is the highest I don't remember how many years ago was that I don't know\nI have a no fly for remarks like that but it was something of\nDry am seven sixty talk and breaking news\n[noise] okay\nSo check this out so last week you guys do a dock\nSeeing is deal X. X. I. N. G. store you post personal information on the Internet so people can get harassed\nSo Lindsey Graham last week was the subject of a dock saying and what happened was somebody went on to Lindsey Graham's personal with the media page and posted his home address\nIt posted his home address and I I guess a couple of other Senate folks\nDid this as well they were they were victims as well but Lindsey Graham I Know for sure\nSo they caught the guy who did it you're ready for this this\nIs rich OK latest you on this this is like actually breaking news like this just broke\nA democratic congressional staffer was arrested today and accused of posting the personal information of at least one Republican senator during last week's hearing about sexual assault claims involving Brett Kavanaugh\nUS Capitol police said twenty seven year old Jackson Cosco C O s K O was charged with making public restricted personal information so making public the restricted personal information\nWitness tampering and threats in interstate communication as well as unauthorized access of a government computer identity theft second degree burglary and unlawful entry\nPolice added the investigation was continuing and more charges could be filed against this guy who did he works for senior\nCongressional sources tell Fox News that Costco worked as a staffer for Sheila Jackson Lee a Democrat from Texas also Maggie Hassan a Democrat from New Hampshire she's a senator and former senator\nBarbara Boxer\nOf California a Lincoln page with Cosco his name on it describes him as quote a democratic political professional and cyber security graduate student the personal information\nSenators Lindsey Graham Mike Lee and Orrin Hatch was posted on their respective Wicca PTO pages as the Senate Judiciary committee question Kavanaugh over allegations he assaulted Christine Ford out of high school party in the early eighties all three have professor belief that Kavanaugh's innocent of the claims against him\nWith Graham telling the federal judge you've got nothing to apologize for\nThe intentional publication of the information was first caught by a quarter bought that automatically tracks changes made to what the ... entries from anyone located in the U.S Congress and publicize them on the social media site\nThe by later ... deleted the tweets because he edits contained personal information the home address to the centers appeared to be correct though the phone numbers didn't appear to be entirely accurate a home phone number listed per gram appeared to be to direct colors to the sexual minority youth assistance league\nIn Washington DC based advocacy group so\nI mean you already know I mean the government is infiltrated with these people that will pull addresses delete the information\nYes that that that's their job you know that's their job and to go back to applaud you for because that's why I originally called sure go ahead I'm and that is totally disgusting right away\nBut was bought for um there's a lot of common people like me because\nI I'm from lakeside okay I mean I I'm not from the coast sure and we can we can smell bull crap a mile away any if this if this lady had open her mouth and the circle of friends they would've all looked at her like she was crazy out here\nBut this I I this narrative is for people that they ate don't work in film blue collar circle they don't live on the lower end of the spectrum as far as income goes these are all people that they're not in touch with what happens with everyday people [laughter]\nAs soon as as soon as I watched the testimony and I watched a lot of it and I'm fortunate enough to be able to drive for my job and I catch from eight in the morning all the way up\nThrough your show Chuck I'm I'm not going to name the other people on your station that I Want to give you a lot of credit that's OK forever hours right\nBut but I'm just saying that I mean\nThere's ... when I go back and listen to this on she's not yeah and I'm I'm going to say it does it does she not yeah my wife listens and she's like oh that chick is nuts\nUm she at my wife has told me she reminds me of your ex wife and no ill heart to my ex wife but\nPeople like to make things up people like to over dramatize things people lie in line and lie until it goes over the top and then they'd have to put a blanket over that right and they put a blanket over that and they put a roof over the top and then they want to add it shouldn't eat\nAnd they watch both coming out here and this this is ridiculous I mean we know you're you're right you guys have covered this as much as you guys have covered this I'm actually starting to get bored because well we got it on All right well to the next thing you know I don't\nKnow ... we got a lot of great stuff still coming down the pipe ... chalet of seven sixty talking breaking news may right arm comes by next Jim show about what's the big ... by\nA man is dead following in industrial accident at a metal fabrication yard and spring valley today the details next am seven sixty Kay s MB am seven sixty news in supporting\nBusiness needs fast secure networks to be efficient and profitable detail can help you keeping your data secure your business safe and connected\nWe've been helping San Diego businesses since Nineteen eighty three days you know can provide expert solutions for networks voiceover IP wireless in video security we can help you make the right choices for your business\nCalled detail it eight five eight five seven one thirty one hundred\nWhether you networking four or four hundred systems we have the solutions the answers and knowledge to make it happen we have expert IT consultants have experience in helping local business schools state and government with experts solutions such as voiceover IT systems from Cisco why and secure professional video surveillance solutions using top quality components\nFor sure um it it is interesting and you know Jay Powell had some comments or the chairman of the fact that some comments about how good the economy's going and a guy I mean given us a little bit of a hint of how they're kind of looking at the economy and what\nThey're feeling it's easy it's easy bread and I know there's\nA big bounce in economy when you've gone through the worst recession since the great depression and therefore they call it the great recession but you know it's another\nJob after their rebound eight years later of anemic but still the comic grows job this kind of growth that's that's very hard to see and not\nDirectly correlating to the pro business a Trump agenda and policies\nSo we have all this potential in front of us but there's one thing we've gotta we've got to kind of keep an eye on and that's the recent data on the local real estate market now how's that looking there\nWell look it's it's it's a two edged sword you look at the home prices here Cora logic you know last data from August is too soon for September home prices were up\nUm nine percent compared to August of last year to another all time high the median home price of five hundred and eighty three thousand um nationally home prices increase to five and a half percent from last year so we're way above that\nWell we have to be very mindful of inventories inventories are going up a lot and depending on where you are\nIt's going to vary but you know we're looking at up Fifteen point four percent inventory of single family detached homes for sale in San Diego county in August uh when you compare it to August of last year that's a big job\nA big jump in some areas you know you ... it has gone up a lot more\nIn other areas not as much and obviously supply and demand we're inventory haven't gone up that much prices are still rising a lot and there are a lot of multiple offers so I could be your neighborhood if you're listening but in the neighborhood where the inventories have\nRisen older too much you're starting to see some people cut prices and we haven't seen that in many many years so we're seeing a little bit of a shift in the market\nSo what are we looking at in terms of when you consider the the supply you want to obviously\nMake the best foot forward put the best foot forward in terms of making your offer you know absolutely super salad how would the rates looking for the thirty the Fifteen or five\nWell there are up ... percent so conforming all points dirtier fish rates are now averaging around four and three quarters that is again the highest has been and I guess seven years or something like that and die but still historically very low Fifteen year averaging close to four and a quarter percent\nSo there's still low if economic expansion continues if\nChina trade deal also gets made\nA you know you could see rates go even higher uh so I'm gotta be careful of your refinancing get things going get your rate locked in your purchasing a home yet going\nIf they get too out of range for your memory is switched to maybe a five year program sure\nSo you do a five year fixed instead of a thirty year fix you drop from four point seven five maybe two four point one five wow which is huge\nAnd no one's saying no matter how much positive stuff I\nSat right now there will be a recession\nThere will be in a slow down and there's always been on there always will be and that is when you will have an opportunity to get a lower rate a lot of people are talking about two thousand twenty two thousand Twenty one who really knows yeah as you know we can see the future but at some point the economic expansion is going to take a break\nChances are the fed keeps raising rates a little too much\nBut the brake on a few other things happen that we don't know what those things are and that is one you'll be able to refinance\nAgain so I I wouldn't say the sky's falling that's just what happens when the economy does really really well\nNow there are folks who are out there right now that are sitting in a house where they've got a lot of equity or the houses fully paid for a may run and they they may be benefiting from a reverse mortgage or where they may want to purchase a home right they may be interested in the jumbo reverse mortgage got a lot of reverse mortgage options out there\nSo that they you know you do if you're too young to refinance combined your first and second take care of the you know take advantage of equity and do all the all the other stuff but if you or your spouse is sixty two years or older\nReverse mortgage while you know that's the ultimate refinance because you refinance into a loan that has no required monthly mortgage payments for the rest of your life but you can pay whatever you want and if you do it\nBuilds a line of credit for you and not only stops your loan balance from going up you build a line of credit you know people with free and clear home are really doing this as financial planning item great meeting with a financial planner yesterday explaining all those educating um\nHaving another wonderful meeting meeting tomorrow part of what we do is educate financial planners so they take their clients were doing well you know set up this line of credit which helps them preserve their portfolio\nMuch much longer so years from now they have more left in their retirement fund also remember we can you can buy a home with a reverse mortgage as well as large downpayment\nAbsolutely huge option that's that's out there and I can't wait till I'm sixty two I'm just I Do I Know but what do you really mean I'm not really I mean I Know for some things but you know like I'm more than six years old if people want more information but the best place that they're gonna be able to reach you may run a you are a a certified\nA professional who can help them in all of these endeavors what what was the best way to get to\nWell you know our toll free number eight seven seven seven sixty eleven thirty or our website a ... a A R A M C O dot the I's Z\nOr either way we're here to help educate not every every solution is for every ... or home buyer this fits you are in another one fit someone else so that it's all about educating and trying to figure out what's best for you\nAnd I always love it because that's that's why I'm so happy to work with you seriously I say this a lot and I'll continue to say because I'm going to come in and meet with you and I'm going to think well I got to do this and you say no but there's this option too which is nice I mean you're not you don't you want and everybody into the one size fits all thing and you know and that's the\nBeauty of it you know whether you're in the financial industry if your\nVision or only someone in your you know insurance or stocks or that you know it's it's it doesn't fit every one is with a mortgage you know you have to say oh there's a regular mortgages better VA lawn is better half ha reverse mortgage exactly or you know everybody has a different situation exactly\nYeah a lot of toes not tool box you know he was a hammer for everything I my comment or a hundred eight days before the news or do you want to use them for everything right to comment on seven seven seven sixty eleven thirty and check out the website around go up is great talking I look forward to next visit\nThank you my friend all the best it's may run armed tall enough right now it's seven seven seven sixty eleven thirty or aramco doctors Brentwood herbal show am seven sixty talking breaking news Jim shove it with the big story\n[noise] one of the five law enforcement officers wounded in South Carolina shooting has died the debt officer was a member of the Florence city police department city police working with the sheriff's office were responding to an incident when they came under fire the suspect is in custody but no further details were immediately available\nChristine Blasey Ford's lawyer say they're ready to turn over notes from her therapy sessions and any recordings of her taking a lie detector test to the FBI but they haven't heard back from the FBI a day earlier Senator Chuck Grassley accused the attorneys of withholding material evidence\nElectronic devices sounded off across the country today is FEMA conducted an emergency alert test the tone sounded at twelve Eighteen some people got the alert several times others didn't get it at all [noise]\nYou're never more than Fifteen minutes away from the top stories of the day on the ... winter ... show am seven sixty talk and breaking news\nTells you about it that we talk about it [noise] am seven sixty talk\nAnd breaking news\nSeven sixty traffic motorcycle grants earlier a bad one unfortunately freeway you spend a college avenue this occurring earlier investigators supposedly still left side of the freeway on the center divider and probably still very slow from Fifteen to release them into a new one sixty three and I says teens slow commute traffic prevailing there this report runs in my father's religious\nCNN's homelessness donate money to fund the village villages are gifts help fund housing and health care for a little family is going to need that Oregon for homeland were homeless is only now although I'm from the Getty tomorrow morning some sense of wanting to sixty as my later I Want to tell you about my dentist Dr Jeff gray got a\nVibrant water family owned and operated manufacturing the aquifer water purification systems right here in this since Nineteen Ninety\n", "year": "2018", "show_name": "Brett Winterble Show", "city": "San Diego", "day": "03"}