{"month": "10", "state": "GA", "station": "WUWG", "content": "It's the way we pay for the program to listen to enjoy and this is the way public radio works you get to listen as often as you want for as long as he won during refund drive like this when we ask you to give what you want to help us cover the costs of the programs that are important to you public radio is based on a tradition of voluntary listeners support\nSo please begin your support or continue\nAt G. P. B. dot org and click donate or the number to call his eight hundred to two two forty seven eighty eight\nContinue at G. P. B. dot org and click donate or the number to call is eight hundred to two two forty seven eighty eight\nAnd remember when you make the contribution today you get into tonight's drawing for the one thousand dollar visa gift card\nOne thousand dollars given away seven o'clock tonight to people who have supported G. P. B. today you can go to G. P. B. dot org click the green donate button at the top of the page recall eight hundred to two forty seven eighty now we do have to say that you don't have to donate to end to the drawing but\nSince the programs that matter to you on jeep you beat rely on your support\nWe certainly hope that you will\nYou can find out the drawing rules right online at gp dot org slash drawing rules or you can just do what's right and she'd be mature division golly hundred to two forty seven eighty eight time is running out on this drive\nAnd it won't be successful unless you do your part CPB dot org or eight hundred to two two forty seven eighty\nThanks to Stefan as some of life's Sonia Koran Macintosh of valley Alabama says love NPR lesson to it every day from Marietta\nCatherine Landon causing clicks coming in from around Georgia to support Georgia Public broadcasting and now it's your turn to cast your vote to support your vote of financial support to pay for the presidency love\nEight hundred to two two forty seven eighty eight or online at ... dot org thank you for doing your part\nFrom the University of west Georgia was nine be point seven FM Wu WG and W.\nW. A. G. H. D. Gerald Ford of Georgia Public broadcasting radio network [noise]\nLive from NPR News in Washington I'm Windsor Johnston the White House is defending remarks that President Trump made about the woman who accuses Supreme Court nominee Brett Kavanaugh of sexual assault\nAt a campaign rally last night Trump mom Christine Blasey Ford for not remembering some of the details of the alleged attack that took place at a high school gathering in the Nineteen eighties secretary Sarah Sanders has Trump was merely stating the facts and his comments will not affect the cap and all of the confirmation\nPresidents very confident in his nominee as he said in time and time again and we expect to send it to vote and he'll say so\nSome Democrats say they're appalled by the president's comments senator ... says they proved Trump has no empathy for survivors of sexual assault\nAnd senators possible swing votes the judge will need in order to be confirmed the FBI is investigating multiple allegations of sexual misconduct against cab and all the agency has until friday to release its findings\nWith a November midterms getting closer and new NPR PBS NewsHour Marist Poll shows more Republicans are becoming enthusiastic about election day\nNPR's Brian Naylor reports the survey also shows Republicans have narrowed the gap with Democrats over which party voters want to see control Congress\nThe poll shows or two percentage point difference between the numbers of Democrats and Republicans who are calling next month's election very important in July the number was ten points in favor of Democrats and the Democrats advantage on which party Americans want to have in control of Congress has fallen and a half\nFrom twelve points or mid September to six points now the latest poll numbers come during a heated partisan battle over President Trump's nomination of judge Brett Kavanaugh to the Supreme Court\nMultiple women have accused him of sexual misconduct which Kavanaugh has denied the controversy appears to have fired up Republican voters Brian Naylor NPR News Washington\nIslamic state is claiming responsibility for as suicide bombing that targeted an election rally in Afghanistan NPR's ... reports the attack killed at least Thirteen people and wounded more than two dozen\nIt was the first attack on an election rally since campaigning kicked off last week for parliamentary elections there widespread fear that they sort of violence could derail the process they seen as a dry run for the more important presidential elections next year and a test of the government's ability to provide security\nNPR's ... date reporting from Islam bought stocks on Wall street or trading higher this hour the Dow is up sixty points the NASDAQ out twenty six the U.S and pay five hundred up to here listening to NPR News from Washington\nThe remnants of tropical storm in the Pacific ocean or dredging parts of the southwestern us\nThe national weather service is warning of flash flooding in Colorado Arizona and Nevada state of emergency has been declared in Utah governor Gary Herbert has deployed the national guard to Utah County south of Salt Lake city to prepare for potential flooding\nThis year's Nobel Prize in chemistry has been awarded to Americans and a researcher in the United kingdom NPR's Nell Greenfieldboyce reports they won for using\nThe ... chemistry has been awarded to to Americans and a researcher in the United kingdom NPR's Nell Greenfieldboyce reports they won for using evolution to design new enzymes and medicines\nFrancis Arnold works at Cal Tech but early this morning she was in a hotel room in Dallas texas sound asleep\nAnd the phone rang and I first of course I thought it was one of my sons would have\nProblems nope it was the royals Swedish Academy of Sciences she'd been awarded half of the Nobel Prize in chemistry for pioneering the idea of using random changes to produce all kinds of new chemicals are enzymes so researchers can pick the best one for use in say an industrial process or a pharmaceutical\nShe shares the award with George Smith of the University of Missouri in Colombia and Gregory Winter at the ... the laboratory of molecular biology in the United kingdom Nell Greenfieldboyce NPR News\nGroup of investors says it will try to revive Toys R us after receiving a number of qualified bids that word comes in a bankruptcy court filing the company was founded in Nineteen fifty seven [laughter] I went through Johnston NPR News in Washington\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com\nSupport for G. P. B. programs comes from our listeners and the city of Atlanta department of watershed management's care and conserve day on Thursday October fourth providing accessible plumbing repair and bill payment assistance to water and sewer customers more information at Atlanta watershed dot org\nAnd Georgia State university gp Atlanta is license to Georgia State university ranked among the top universities in the nation and commitment to undergraduate teaching more information is available at G. S. U. dot edu\nIs fresh air I'm Terry Gross my guest is the great actress Annette Benning she's best known for her role in the ... American Beauty the kids are All right and twentieth century women [noise] she's been convincing as adoptive con artist and as a single mother whose feeling increasingly distance from her teenage son\nHe's starring in the film adaptation of check of Eighteen Ninety five play the seagull then plays arena a famous and narcissistic aging\nShe's starring in the film adaptation of check Hobbs Eighteen Ninety five play the seagull bending plays arena a famous and narcissistic aging actress trying to convince herself and others that she's still in her prime\nSet in Russia the Segal is about a family and friends spending time together on a country estate each person is in love with someone else in the group who doesn't love them back [noise]\nIt's also about two generations of theater people arena and her son who rebels against terror and wants to shake things up with a new kind of theater\n[noise] and bending welcome to fresh air thank you so much for coming on such a fan [noise] most of us know you were movies but you actually got your start on stage doing classic theater like check off in fact it did the sequel when you were young right like when you were in your twenties right after college or in\nCars yeah when I was an acting school at the American conservatory theater I did it when I was young when I was a student there ah which was an incredible experience that's what most people do when they're an acting school check off as a big part of all of our educations because he was such a brilliant writer and\nBecause he was writing at the time that basically modern acting was getting articulated in a way that we now understand it by ... who was an actor and the company and became\nAs great a teacher and writer about acting and so we're all happened at the same time it turn of the century Russia so we all studied the plays and so I did get to do it when I was in my second year at a sea tastes so\n[laughter] as as an actress what strikes you as being the most original the biggest break from the past in a single [noise]\nThe the roles for women at that time were written by Shaw ifs and check off and a few others reflected how that was the beginning of really an enormous change in an all over the world and women's lives\nAnd um you could get soundtracks to all those movies you could spend it if you're in an up an exam you could spend it all sorts of wave but chances are you're a fan of somebody that you've heard on fresh air or whether it's her somebody else and you could use that thousand dollar gift card to really dig out on your ...\nAnd I remember you don't have to be you don't have to donate to enter the drawing but since the programs that matter to you on G. P. B. rely on your support we hope that you will you'll find us online at ... dot org or you can give us a call at eight hundred to two to four seven eight and\nThank you support for G. P. B. comes from our monthly sustain nurse and the high museum of art October fifth is a pre pride party at the high featuring a drag show rainbow pennant making with indie craft experience and music by ... Whitney abstract tickets available at high dot org\nAnd Ogle Thorpe University in Brookhaven working to make a private college education possible for more families in Georgia complete information on their new flagship fifty program is available at ... dot E. D. U.\nThis is fresh air I'm Terry Gross back with Annette Benning\nIn the last few years feel like I've been seeing new and more movies and really happy about that I I think I'm right in saying that you kind of slow down when you were raising your children your four children [noise] um so are you kind of fully back in the son of it now that your children are in a late teens and twenties [noise]\nIt has definitely made a difference to youngest is Eighteen just turned Eighteen she's just about to go away so\nAh yeah no it does make a difference because when they're little you've got to be on the floor and when you're on the floor [noise] a lot of the time you can't be off doing stuff but um yeah so that's true I had been able to do more and that's where it fun for me I really enjoyed being able to respond spontaneously and go off and do stuff when I can I think\nFor women as kind of frightening to take time off to raise their children because they never know if they want a career they not enough they'll be able to get back in\nOne they feel ready when I feel like their child or children are old enough to re enter the workplace or re enter fulltime were you ever worry that people in the movie industry would forget you\nKnow and there were times I suppose I Would worry about that I also found that when I stopped for the first time to have my first baby [noise]\nI really lost the desire to work and that was quite a shock because I'd always loved it so much and I thought oh no you know does this mean [noise] I'm not going to want to\nThey lost the desire to work and that was quite a shock because I'd always loved\nIt so much and I thought oh no you know does this mean\nThey're not going to want to do it anymore but what I realized was that a that was a cyclical thing and it happened to each time I had a baby and [noise]\nI really enjoyed being away from show business quite frankly I really enjoyed stopping and turning away and the other direction of life and I and just being with my family and\nSo that was a great pleasure and then I was able to stop and start a lot which I never really thought about that before I had kids as an actress that that would be such a wonderful thing to be able to do because of course so many people can't they just can't stop and start but in my profession I can so [noise]\nUh I was able to take years off at a time um and then I guess I had just sort of enough going on that I felt like there would be something out there when I went back but there is always ... and ups and downs and that certainly was true for me [noise] did it make you feel good that\nYou were secure enough in your identity that you were able to leave work for periods and to even lose your desire to work\nAnd still know who you were to not feel insecure like what\nMy fans might forget me are casting directors my forget me directors for me\nUm I I don't remember feeling that really a ... a lot I I'm sure I went through moments of being concerned about that but I had wanted to be a mom since I was a little kid literally since I was a little girl probably\nEight or nine years old because I was the youngest of four and I wanted my mom to have another baby 'cause I Want it to be a big ... and she wouldn't do it and right at that time I I I remember starting to glom onto like the little kids in my neighborhood so I Would be playing\nWith the next door neighbor who was a toddler and kind of taking care of them a little bit and I started babysitting when I was twelve and I just I always wanted to be a mom it's just became very early to me that I wanted to be a mom it always attracted me\nA long before I even really knew what that was about except I guess watching my own mom [laughter]\nUh so that was something that I was ... is it was and is so much a part of me that um maybe also I just had so many kids so quickly I was just too busy to [laughter] [laughter] we ... you were one of four\nIn your family and you have four children of your own as for the magic number\nYeah I was just too busy to [laughter] [laughter] we ... you were one of four\nChildren in your family and you have four children of your own as for the magic number for you\n[laughter] you know I when I was little my dream was to have five I don't know why I got on to that number maybe it's because I wanted to do my own mother and say I have five I don't know um I always wanted a big family the idea of\nThe sound of kids in the house and the chaos of lots of a big family with all of the stuff that comes with that always interested me and\nI have to admit that sound when my kids are home and everybody's around and I I hear that sound in the house of people talking and laughing and of course in some cases arguing or maybe there's a door slam or\nWhatever that is I Love that I I I was always wanted that although I looked at other people that only had two\nAnd I thought oh that's so sensible you know on the hand but I for some reason I just couldn't stop and my husband was the same way he really wanted to have a big family too so we just kept going [laughter]\nI Want to play a scene from a film in which you played a mother and this is the film twentieth century women I Love this film and I love your performance in it and it was written and directed by Michael mills who based it a bit on his own mother [noise] and so you play a single mother\nWho is in her fifties and who is his son is now a teenager and she feels him just like drifting away from her\nBecause now he's into the world of like punk rock and skate boards and this is the world she knows nothing about and it's set in Nineteen Seventy nine and so much has changed\nFrom the time of her use to the time of his views\nAs reflects on that at the beginning of the movie but in in this scene your son has just\nParticipated in this game with his friends and wish you hyperventilating them somebody like squeezes your diaphragm from behind and you kind of pass out for a few seconds except\nYour son passes out for like a half hour and so he's rushed to the hospital and you you're kind of like crying at his bedside and then when he kind of comes to and he finally comes home\nYou ask him like why would you do that why did you do something so stupid and chairs that scene [noise]\nLike why would you do that why did you do something so stupid and cares that scene [noise]\n\nThey just went along with it\nFor fun just dumb why would you do something stupid\nJust following along you you you know you almost died\nRight you don't have to worry about why don't you think\nThe [noise]\nWhat is going on what might [noise]\nBut you're not going to talk to me now [noise]\nNot going to talk\nCome on\nWhy why did you hurt yourself like why do you smoke yourself the\nYou find being shouted alone [noise]\nYou [noise] you can't talk to me like that we don't you don't say that to me [noise]\nSo that's a scene from the twenty sixteen film twenty century women with my guests Annette Benning and Lucas jade zoom in as her son\n[noise] so I Know my males who wrote and directed the movie based your character in part on his own mother who do you draw from to become a character and are there things you took from your own life as a mother and from how you saw your mother mothering you [noise]\nUh I think that happens every time I'm working um that I think about my own experiences and might certainly my experiences with my own mom I have a great mom I Love her dearly she's a really great\nTo all of us um\nInteresting I wanted to just mentioned that scene Mike wrote we we were able to do some additional shooting after we had done the the bulk of the movies sometime later\nAnd he added that scene he wrote it and added in later and so we came back to shoot that so I think that's the reason I mentioned that is for a couple of reasons for people who do this kind of work to to remember that that kind of thing happens and sometimes those\nThat's the reason I mentioned that is for a couple of reasons for people who do this kind of work to to remember that that kind of thing happens and sometimes those are the\nThose are the things if you have that kind of time to do if you have the money to go back and shoot a little bit more sometimes you can add things in which really are key and Mike did it very strategically and I thought wisely [noise]\n[noise] you know conversations with that with your mom about that with your mother\n[noise] yes I think I did and I definitely remember when it was for me it was when I went to community college in San Diego I went to school called Mesa college I'm very proud of that and\nSo that would have been seven the six Seventy seven and um I took a women's studies class and I remember getting so mad at the injustices of the world for the first time [laughter]\nAh I'm laughing now but I was I was I was literally woken up and I realized how uh how an equal the world was and I remember\nThe idea of beauty contests at that time I remember one of them being on television and I just burst into tears and the uh out at how a\nDisgusting of a display that was and um [noise] so yeah no I remember that very well in fact I also remember when I was at Mesa college Jane Fonda came and spoke\nAt our little community college in San Diego and she was talking about feminism and the women's movement\nAnd I remember she had like waist length hair that really made a big impression on me [laughter] anyway so yes I remember it very well and um it was a time that people were really waking up to these things in a new way and it meant a lot to me\nAnd I think it meant a lot to my mother as well I think like the character in a movie that I played my mom is a feminist at heart and she also is someone who really loved raising her kids and loved being at home and love the role that she played and being there for us in the way\nSo is someone who really loved raising her kids and loved being at home and love the role that she played and being there for us in the way that she was and that doesn't didn't ever feel any\nUh ambivalence about that really she was was that was her life and she she was one of those people that was born at that time who was really good with that and and embrace that [noise] so you\nUh starred with Julian more in the least a chill the dingo movie the kids are All right and you played un Julianne Moore played a married couple with two teenage children who were fathered by a sperm donor an anonymous donor\nAnd the teenage daughter tracks down the sperm donor\nAnd you reluctantly agreed to a family meeting with him and he changes the whole family dynamic your kids start hanging out with him he laid to figure out your spouse Julianne Moore's character as having an affair with him on a play seeing this happens at a restaurant after you after you've had a fight\nYou you you're at a table with some friends you and Julianne Moore have had a fight then you go to to the bar part of the restaurant and start trying to talk it through but the fight fight gets a little worse [noise]\nWhat is going on with you\nI feel like you're taking over my family no\nOh I guess I'm just exhausted [noise]\nMaybe just [noise] you take some time off\nRecharge right\nRight who's going to pay for that [noise]\nI mean look I'm Sorry but uh you know I feel like I'm Carrying the whole load here\nDo you want to be at home taking care of the kids you wanted a white that is just not true you didn't like any of the nannies and short in back of my career what are you talking about I just hope to start another business yeah so you can feel better about\nSo you can feel better about yourself [noise]\nCatch my guest and bending the Julian more from the twenty ten movie the kids are are\nCats my guest and bending the Julian more from the twenty ten movie the kids are All right but what parts of yourself did you drawn to play this role [noise] uh\nLet's see I I Love this part I felt so at home in it I Love Nick locked [laughter]\nUm gosh I I guess it just like always that's what I always do is draw on parts of myself I'm\nWhen I'm working so I'm sure I have a part of me that is trying to control I'm sure I have that I'm sure my husband and my kids probably too I think I keep it under control that I'm not too I'm not too bad with that but certainly that's true um I Would say I have that yet\n[noise] um so I'm thinking I'm thinking that in the past few years you've probably thought a lot about sexual orientation and about gender and part because of this role and the kids are All right\nAnd also because I Know your oldest son is trans and I know you try to let him speak for yourself and not speak on his behalf and I will not ask you to do that but I have a quick question about you [noise] having\nI'm just having a trans son [noise]\nAnd having played a lesbian in a movie has gotten you to think any differently about issues of\nIdentity when it comes to sexual orientation or gender\nFluently and it's one of the the one of the pleasures of acting is that every time we get to enter this other imaginative world that's not our own\nUh or in this case sexual orientation order it's such a fabulous no way to expand your own heart and your own thinking\nBecause when you play a character you have this fabulous thing that you can be completely subjective and you don't have to judge the person you only have to totally back them up here they're advocate\nYou're fighting for everything that's in their lives just like in some ways we fight for what's important to us in our own lives and with my children [noise]\nI feel like especially now that they're young adults um I'm just learning more and more from them for so long you know you feel like you're teaching your children about the world and now for sure I feel the opposite way is that they're teaching me about the world\nThe long you know you feel like you're teaching your children about the world and now for sure I feel the opposite way is that they're teaching me about the world that is true of all of my kids certainly true of my oldest son Stephen\nThat there's been a whole new kind of universe opened up to me and to all of us in the family because of Stephen because who he is and um that is a fantastic part of being a parent I Love it\n[noise] so here's a question about um [noise] gender identity that I Want to ask you as the parent I'm a trans teenage son um was it a steep learning curve for you to learn about that [noise]\nUm yeah it was uh my son's down twenty six and so when he came out it was many many many many years ago when he was a teenager so yeah it was definitely and I think there's a lot more out there now for people to read about to understand because it's so much more a part of the cultural conversation\nThat you describe your parents as being very politically conservative and you and your husband are both very liberal and do your parents support president from and if so has that been a\nSource of disagreement or subject to avoid and my family [noise] I Love my parents\nSo deeply there's such great people I'm so proud of them they're amazing and they are Republicans and they are Trump supporters\nIt's actually been quite a relief I think in my family and with my kids that they have somebody if they choose to to debate with a because so many of our friends not all of them but many of our friends are Democrats as well\nSo it's been a healthy thing in the family I I really enjoy it and uh we we do talk politics not too much and [noise] uh\nI mean when I was a kid growing up we understood the rules for politics and sex they weren't articulated a lot of sort of an unspoken thing\nUm when I was growing up ah so even though my parents are were very a conservative it wasn't like we sat around and talked about politics all the time however in our house we do we talk about politics incessantly\nAnd all of my kids are also very a political and they read and everyone's always talking about something and debating about something so the debate sort of ... that have happened with my parents are\nPolitical and they read and everyone's always talking about something and debating about something so the debates sort of ... that have happened with my parents\nAre good natured and um respectful I have to say it's never gotten ugly um there have been a few times I did have to breathe deeply in order to continue the conversation and I'm sure they felt the same way [noise]\nSo um you're fifty nine now to my knowledge you haven't had cosmetic surgery and your face has some natural wrinkles in it and I want to thank you for that\nI understand and respect why many women and men would have worked on [noise] but as someone who isn't going to do that I I I really love seeing women and beautiful women like you age naturally\nAnd just see how life changes ones face and to see how beautiful you remain um and enables your face to be so much more expressive than if you've had had a lot of work done because I think your your skin gets stretched so tight and it's hard to have", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Carrollton", "day": "03"}