{"month": "10", "state": "GA", "station": "WUWG", "content": "Submitted before three o'clock I'm Dawson good to have you along this afternoon on eighty eight point five G. P. B. Atlanta and streaming live at gp be news dot org crush areas next dead at four o'clock it's all things considered an eight point five key people be allowed to\nSupport for G. P. B. comes from our monthly sustain hers and Georgia State university ... Atlanta is license to Georgia State university a major contributor to the economic and cultural vitality in downtown Atlanta and the metro Atlanta area more information is available at G. S. U. dot\nIt's a license to Georgia State university a major contributor to the economic and cultural vitality of downtown Atlanta and the metro Atlanta area more information is available at G. S. U. dot edu and the Atlanta upper representing west side story Bernstein's classic Broadway musical of love trying to conquer\nDifferences November third six nine and eleven at the Cobb energy center tickets at Atlanta Opera dot O. R. G.\n[noise] from the University of Georgia is among the points that W. W. W. W. H. G.\nCarroll of the Georgia Public broadcasting review [noise]\n\nFrom WHYY in Philadelphia I'm Terry Gross with fresh air today Melissa McCarthy she stars in the new film can you ever forgive me as a biographer turn literary forge or\nWe'll talk about growing up on a farm in her early comedy act or breakout role and bridesmaids and playing Trump's former press secretary Sean Spicer on Saturday Night live she was initially skeptical she could look like him\nReally lovely um special effects guy there just said oh yeah that's not gonna be hard at all that'll take like a half an hour which I thought oh I thought it might be harder to switch over to a man but it really was it\nAlso John Powers reviews the BBC series bodyguard which premiered in the u._k. in August and became one of the biggest hits of the decade it drops on Netflix Wednesday\nFirst news [noise]\nLive from NPR News in Washington I'm Lakshmi Singh\nNewly released surveillance video appears to show a man wearing some of the same clothes Washington Post columnist your mouth 'cause she'll gee was wearing the day he was last seen all live in the Saudi consulate in Turkey Turkish ruling party official says footage of an apparent double\nIs further evidence of premeditated murder and a cover up by Saudi Arabia a claim crown prince Mohammed bin Salman denies however over the weekend the Saudi Government conceded for the first time that ... was dead\nBlaming it on an altercation not a hit order by member of the Saudi royal family was still so many questions surrounding the journalists final moments inside of the ... weeks ago\nThe German government says it's a spending arms sales to Saudi Arabia and his estimate Nicholson tells us chance or uncle America was urging other countries to do the same speaking as a news conference American announced that until ...\nThe spending arms sales to Saudi Arabia and his estimate Nicholson tells us chance or uncle America was urging other countries to do the same\nSpeaking as a news conference American announced that until ... noon about what happens to the Washington Post on this ... Germany will cease exporting weapons to Saudi Arabia she said we condemn this act and the strongest tone that insisted that those responsible for his death must be held to account\nFor joining Saudi claims that she ... she was killed in a fistfight Germany's economy minister paid ... a ... all the ... members to follow suit and also still palms exports until more is known about what happened\nTo him and he is among the world's leading exporters of weapons to Saudi Arabia together with the U.S great person on Trump's\nFor NPR News I'm Esme Nicholson in by\nPresident Trump campaigns for Senator Ted Cruz in Houston tonight after recently declaring plans for another major tax cut for the middle class but NPR's Mara Liasson suspects just talk he's just making it up as he goes along Congress's ... they can vote on this\nBut he said it's going to be major it's going to be for middle income people why because the tax cuts that they already passed or not popular Republican thought they'd ride these the tax cut bill to victory in November but people don't buy it\nAnd pure as Mara Liasson will besides mid term some potential democratic candidates already eyeing the twenty twenty presidential race including Vermont Senator Bernie Sanders who's on a nine states tour Here's NPR's off for college\nBernie Sanders warn folks that if they don't vote Democrats will lose he said in the last midterm elections in twenty fourteen roughly two thirds of Americans did not vote\nFor working people started all lower income people for it'll be both those little Ball State not as far as\nThe law [noise] Sanders also saying this discussing crowd for supporting\nHim in his twenties sixteen presidential bed and suggested he's ideas on health care and the economy are more relevant than ever standards is one of many possible democratic presidential hopeful stumping for midterm candidates along with former vice president Joe Biden and senator Cory Booker Asma Khalid NPR News\nThis is NPR News\n\nPresident Trump is threatening to reduce or completely cut off aid to Guatemala Honduras and El Salvador he's protesting the caravan of thousands of migrants from those countries traveling north to the United states on Twitter Trump says the three Central American countries which received a combined five\nSeeing the caravan of thousands of migrants from those countries traveling north to the United states on Twitter Trump says the three Central American countries which received a combined five hundred plus million dollars from the U.S and the last fiscal year lose that funding if they don't keep their citizens from leaving and attempting to cross into the U.S illegally\nMeanwhile Mexico's president elect suggests that his country the U.S and Canada or together to fund development in poor areas of southern Mexico and Central America [noise]\nDrugs widely used to treat the Larry I'm In the intensive care unit are in fact not effective according to a study in the New England Journal of medicine NPR's Richard Harris has that story\nAnd thoughts are caught at drugs such as ... have been used for forty years to delivery him which was a confused and sometimes agitated state common in critically ill patients\nThe drugs do help calm down patients but his study involving more than five hundred volunteers shows that at our psychotic drugs are useless in treating delivery um itself\nLikewise the study found that related drugs called atypical antipsychotics don't create delivery him either are few doctors have known for years that the evidence for using these drugs to treat your leery of was weak experts in the field say this major starting now provide strong evidence that they simply don't work for this purpose Richard Harris NPR News\nThe Dow is down thirty three points at twenty five thousand four hundred ten as some he's down to a twenty seven sixty four now that cars out forty six points this is NPR\nSupport for NPR comes from the three R E oh the powering enterprise digital transformation with artificial intelligence predictive analytics and I owe the solutions learn more at the three I O T dot AI and the ... foundation at ... dot org\nAnd this is David Greene host of MORNING EDITION I'm here to talk with you about that poking the one that keeps reminding you support public radio you can support the programs you love by donating your used vehicle\nThat old car truck could be worth hundreds of dollars to the station you have to do is call and you might even received tested a gp dot org slash cars were called eight seven seven TV ONE car back [noise]\n\nIs fresh air and Terry Gross my guess Melissa McCarthy is known for her comic roles and movies like bridesmaids and the heat and for her impersonation of President Trump's first press secretary Sean Spicer\nMy guest Melissa McCarthy is known for her comic roles in movies like bridesmaids and the heat and for her impersonation of President Trump's first press secretary Sean Spicer on Saturday Night live\nNow she takes a different direction in the new film can you ever forgive me which is based on the two thousand eight men more of the same name by the Israel\nIsrael who died in twenty fourteen out a moderately successful career writing biographies of people who had fallen out of the popular consciousness like actress to Lula Bankhead and gossip columnist ... gallon but after her biography of us Stay laughter flop\nShe couldn't find a publisher for her next book about vaudeville star Fannie Bryce\nFinding herself broke unable to pay her rent or her cats that bill Israel deployed her writing skills to forge letters by literary luminaries like Dorothy Parker ed ... know coward and the actress Louis books and sold the letters to collectors\nReviewing the film and the New York times AOL Scott wrote me Israel may be the single most interesting movie character you will encounter this year\n[laughter] let's start with a clip from the film in which Israel confide your secret to Jack ... a fellow alcoholic who scrape spy on charm wet and numerous scams and hustles jak is played by Richard III grant each of these characters hasn't ... sense of humor\nMyself in a rather\nLast criminal activity goes beyond Boulder tips\nLetter writer\nChurch school mother says\nYou're not understanding the world of elite\nThrough ... pieces of paper\nThat was a waste of a secret I should've gone out they're not in Iraq and told the wrong because I get a better response we're\nAnd it was weird there were just you know all up and down the streets there were all these people watching and then you can look up into the building and just see you know hundreds of people kind of against the glass and I thought this is the most surreal moment I'll probably ever have\nIf you're just joining us my guess is Melissa McCarthy and she's now starting in the new movie can you ever forgive me so we'll be right back after a break this is fresh air support\nFor ... comes from generous listeners like you and the alliance theater is celebrating its fiftieth anniversary with a new state of the art performance space the Coca Cola stage\nSeason highlights include A Midsummer Night's Dream and thrilling musical ever after tickets an alliance theatre dot org weekdays on GB are filled with news and information bed at night kick back and enjoy the eclectic mix of music from Georgia State university students on album eighty eight\nThis is eighty eight point five G. P. P. Atlanta\nIs fresh air and if you're just joining us my guest is Melissa McCarthy she's starting in the new movie can you ever\nForgive me which is based on a memoir by Lee Israel who when she started being unable to sell new book ideas decided to forge letters by literary greats and make money selling those four letters as if they were originals\nSomething else you're very famous for as your role and bridesmaids and the most famous or maybe I should say infamous scene\nWhen the right in the bridesmaids get food poisoning as they're trying to like really expensive fancy bridal dress and yet um you know bridesmaids stresses and they get like super sick and of course there aren't enough bathrooms so you end up sitting on the bathroom sink in your expensive down that you're trying on and the whole scene is very intentionally gross\nAnd I'm Wondering how you felt about that scene because part of a of the scene and part of a point of the movie is that you know women can do gross that comedy just as men can and it really wasn't the point of it oh okay ... none of us felt\nThat way about it and that that scene was actually kind of in jak did into the film [noise] kind of late into the ...\nWas felt that way about it and that that scene was actually kind of injected into the film [noise] kind of late into the process and I think at first everyone bristled data and thought we don't want to do this grossing for the sake of gross it really isn't any of our humor we didn't find it funny [noise]\nBecause it did feel like for lack of a better way to ... foot more like a guy move [noise] I Do remember us talking about it and they said what are the only thing that appeals to me does seem funny and kind of [noise]\nIs it type of thing you watching go thank God it's not me I said if we just play the ... the horror and the embarrassment of it\nBecause this weird things like this do happen and I said if it's less about gross for gross and more about oh my God I Can't make the euro swallow me up\nAnd if you play I think how maybe more women would do it in terms of it was horrifying not we weren't going like yeah look at this we were all desperately [noise] even though we were friends with in the movie saying like oh my God\nLook somewhere else like we couldn't escape it and then I then I think we started to reconcile with the facts of like it could be funny for the sheer sake of being like what is the worst thing that could happen to you and\nAnd how do you kind of like ... and just like a horror movie get through it\nIs interesting to hear you say that because the second half of my question [laughter]\nWithin it'd be OK some women found that liberating that you know women can do gross out humor like men but then there's the question do women want to establish their quality of by doing gross out scenes there your mind is really interesting because you're saying that's that's not really what was intended but it wasn't intended and\nIt was really talked about because I'm I'm I'm not one for bathroom humor or stuff like that I think sometimes there's that horrible and wonderful feeling you get where you're so embarrassed for the character\nAnd I think that's showing the character kind of going through such a vulnerable humiliation that we can all laugh at it because in some way we've all done it we've all falling said the wrong thing had some\nShaming thing done and I think I think at least for myself that that was the connection to that's a real human experience even if that particular action hasn't happened to most people [noise]\nMelissa McCarthy something else that you're famous for [noise] is um insults [laughter] insulting oh no [laughter] I'm not real life uh\nMelissa McCarthy something else that you're famous for is I'm insults [laughter]\nAnd so they don't know that and I'm not real life or maybe in real life I wouldn't know I don't know why are you not but the most famous example of that is and this is forty\nAnd there's there's a feud between your teenage kid and ... and Leslie man's teenage kid and it becomes a feud between the three parents and they're all called in to meet with the principal\nAnd the the the other ... couple have threatened you so\nYou're all just kind of going at each other in the office so yes let's hear that same it starts with you\nThese people are liars he said that my son was an animal and then if I didn't keep on a leash that he would hit him with his car\nDid you say that that's that's ridiculous\nWho talks like that you do hit him or even you know what I said was that we need to keep an extra ... tubes because with all the technological advances having to learn to use them responsibly no no what he what he said to me was he told me what language\nCatherine let me get a relay what these two balls to me unless I say it\nCan you please not talk like that Catherine music manager her thing next door\nMusic man maybe if I look more like this fake couple bank commercial that's what you look like like your bank commercial Koppel none of this talk is productive I Would like your and my legs and kick you end up with my ... bone\nReally scaring me this is what happens when you corner you corner me I Will shoot drew you to you\n[laughter] okay and then as the credits roll at the end of this is forty uh it's just you kind of him and thriving insults in that scene in it just goes on and on with more over the top insults is that something that you're famous for outside like and the real world being able to to do really funny and solve\nYou know I Know I Do not oh go round insulting people um I Hope ever [noise] um I don't know if it's a cathartic part of the work that you know you do something so kind of like yourself and maybe it's why I don't do it in life I get it all out on on screen but [noise]\nYeah one of the first time I watched that back I kept saying I didn't say that I never say that and the first time a sitting with ... ... ...\nAm I watched that back I kept saying I didn't say that I never say that\nAnd the first time a sitting with us it sit for watching you say you said all of it and I I didn't remember saying most of it which made me feel slightly crazy and I was just trying to say ... anything that came up the very top of my head I hadn't planned anything [noise]\nSo um you know maybe it was just that so much kind of free free word association that I didn't kind of law get into my memory how'd you improv insults before [noise]\nYes I've had a big issue internally I have played a lot of kind of very assertive um characters that you know I think in the heat\nEspecially part of part of the\nPart of the characters DNA was just to literally say anything just to kind of kind of tear people down and I think kind of try to stand her\nIn her own authority so it was a big part of that character and you're very impressive detective and that very aggressive detective um [noise] there is that fun to it I mean I Would never want to do it in real life but it's part of the fun of getting to act you do\nThese things that you would never do your Boulder your harsher you know you're you're just ripping insults at someone and uh there is a there is a fun to it because hopefully you know you you don't do it in your real life [noise]\nI guess as Melissa McCarthy she stars in the new film can you ever forgive me we'll talk about growing up on a farm after a break and John Powers will review a new BBC series that drops on Netflix Wednesday\nI'm Terry Gross and this is fresh air and here's a song from the soundtrack of can you ever forgive me than by blossom daring\nOooh\nOoh\nYou've our family foundation supports WHYY is fresh air ended commitment to sharing ideas and encouraging meaningful conversation support for NPR comes from this station\nFrom indeed used by over three million businesses for hiring where employers can post jobs and do you screener questions to build their short list of preferred candidate\nLearn more and indeed dot com slash higher from Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty\nAnd delta Atlanta symphony hall live welcoming iconic vocal group dinners to Atlanta on friday October twenty six for their fan favorites tour\nTickets are available now it ticket master dot com and the ... box office\n\nFor NPR comes from this station\nMore than five hundred tire models from twenty to manufacturers\nAnd an online tool for finding tires based on vehicle me budget and brand Iraq dot com helping drivers find deliver in stone\nFrom T. I. A. T. I. A. is committed to helping those who are driven by purpose reached their definition of success\nInvesting advice banking retirement to\nLearn more T. I. A. dot org\n[noise] this is fresh air let's get back to my interview with Melissa McCarthy she stars in the new movie can you ever forgive me when we left off we were talking about her early stand up comedy career\nSo um did you perform at\nGay clubs\nI did duplex is one of my favorite places to reform I just loved it also because [noise] you know the heckling wasn't there\nWhich is really why I stopped stand up I didn't do it\nIt was one of my favorite places to perform I just loved it also because [noise] you know the heckling wasn't there\nWhich is really why I stopped stand up I didn't do it that long I think people think I did it longer and probably better than I did I didn't um [noise]\nWhen you went into a regular comedy club or something that I really didn't like was there's this element there was always one\nOne guy that always really did literally seem like do you just go club to a club like are you actually the same guy it was always kind of you know I Wonder if you weren't even fully up on stage yet and there's always somebody like your top off [laughter]\nAnd you're just like what like what does it ever worked for you is ending woman ever been like oh my God I wasn't thinking of it but you know what I'm going to take my top off [laughter] like I just I mean every time or something in that vein and especially when you're starting out you have you know four and a half minutes [noise]\nAnd the only way to stop someone from yelling and heckling you have to really shut them down like truly shut them now not just like OK buddy you know God it they're going to keep doing it and they're going to keep doing it [noise]\nSo in order to actually make them be quiet you would have to kind of truly humiliate them not in a joking way because strangely just trying to indicate to them that like I don't want to do this I don't want to have this back and forth with you and I'm not going to take my shirt off because I'm not insane [noise]\nSo I felt I had to get so mean and so cutting and actually really make the person so embarrassed that they stopped talking what was one of your favorite insults that you gave on stage in response to a heckler [noise]\nI don't think it was my favorite I think the more work the more I hated it um\nIt usually would dissolve into some kind of\nThing about are you here with your girlfriend and then oh you're not\nHow was your mom's basement you know we've kind of go down that road like this so surprising like can I get a show of hands for women who [noise]\nWho is in crazy about this guy has to take his shirt off like and I would do vote soon and talking about like wow you have no takers and it would dissolve from there but afterwards and then\nOn a selfish note I also thought out of four minutes I've taken two minutes doing something that makes me feel bad about myself no you feel terrible 'cause you'd watch the person finally\nBe truly embarrassed enough to\nTwo minutes doing something that makes me feel bad about myself no you feel terrible 'cause you'd watch the person finally be truly embarrassed enough to stop talking and then you're looking at this guy who\nEven though I think she's a jerk and should have been quiet to begin with and now he actually feels like to his core\nAnd then I'm supposed to somehow transitioned to like so I was walking down Madison Avenue and you're just like how what first of all there is no real good transition there and then now I've got two minutes left\nAt the Oscars if you go over time they're going to play you a stage is there somebody there was a comedy club owner like happened is watching thing times so\nKnow there's the light oh ever present uh not to ever not be heated\nLight that the first time I I went up I didn't I didn't know what the light than slashing it at like ... yes and when that light flashes is literally like finish your sentence and get off stage you have ten seconds before you know\nThe stage explodes it is really a big deal it's a big deal to the owner or manager who's ever running the night it's also a huge deal to the other comics be you don't get to suddenly do eight minutes if we all get four that's like a all my God it's a really big deal yeah\nAnd ... other people's time here stealing it yeah you're taking it out of there are going to get less but the\nFirst time I did stand up right there was people actually laughed at something\nMuch to my surprise and as they laughed he flashed the light from the booze\nAnd I thought it was kind of a non verbal applause from the manager kind of like ... like I thought I thought he was saying like at a girl you know keep it up because I I didn't know why he was it was the first time that I'd seen him flash of light and it happened right on a laugh\nThen he continued flashing it which I thought he meant keep it up it's going great so I kept talking in the late kept flashing and I thought boy this guy really likes me he's really encouraging me and then I\nGot up to finally did get off the stage I Can't remember if he came out and was like his arms were flailing or finally I was just like I don't know is to say I've been up here for like nine minutes [noise]\nAnd uh I came off and I just remembered him screaming at me up in a hallway asking me what's the matter with me have dumped can I be and I was like I thought you were encouraging\nOff and I just remembered him screaming at me up in a hallway asking me what's the matter with me have dumped can I be and I was like I thought you were encouraging me which I think blew his mind that I was like so naive I that I truly didn't know\n[noise] so you know one of the women who has taken on like producing and and writing films and has been an attempt to make sure that you can act immaterial\nThat means something to you that you care about and give yourself good roles because yeah I think it's often hard for women to get good roles\n[noise] I think it is and I think you know I don't think a day goes by where I don't realize how lucky I Am and I never minded how much extra work I always thought I Want to be a part of making these three dimensional flawed [noise]\nYou know often challenging but to me really real women I just thought so many things I read were kind of [noise]\nSee I don't even know what in the in the breakdown you would describe them as pleasant\nI was like I don't know how to play pleasant like ... who who\nCares there's nothing to sink or decent too it's like the perfect clothes and they look really nice and they have a nice relationship and their houses I just thought oh my God like cool who wants to watch that I don't I didn't want to play it also thought all the people I Love and like are\nFilled with [noise] quirks and eccentricities and isn't that why we always love or even dislike people take we're we're a bundle of all these different weirdness is [noise]\nAnd so often I I've I felt that everything I read for female character was really blend in and often a bummer just kind of everyone's having fun and then in would come to a woman to go like car all\nSay I'm Still I thought oh my God how many times can I just randomly walk into a room and say the guy's name I'm like why doesn't she ever walk in and go like what's going on this is fun [laughter] why she always a bummer\nI just ... I didn't know how to play it I felt like I don't have the skill set to play this 'cause I don't know why she's doing it\nOn learning if you feel that you've been affected by the me too movement which you know I mean like Harvey Weinstein fell several actors their careers or at least temporarily ended because they were ousted for assaulting or Ratzinger mental behavior yet to two women\nOh several actors their careers or at least temporarily ended because they were ousted for assaulting or Ratzinger mental behavior yet to two women so like a as somebody who is both you know as an actor a writer producer has the kind of\nChange in climate been meaningful\nFor you can you feel the difference do you feel that women are being more empowered in Hollywood now [noise]\nEvery little inch I Will take every centimeter forward it will take I think the more we talk about it and the fact that it is becoming less acceptable you know I think I think the treatment of of women just can't be dismissed you can't treat half the population\nSo poorly and have it be like me you know boys\nHas to be repercussions and it's happening in all fields which is what I think is so important about me too it's it's branching out to everyone and it's all women that need help that need money for representation it's saying that we're all in it together and I think the more we we linked up and realize their strength and numbers\nIt can't be for the worse\nMelissa McCarthy I Want to thank you so much for coming on our show I've greatly enjoyed it I Love you and your new role and can you ever forgive me and let's continue the conversation some other time\n[laughter] I Would love to this has been a just a dream I Love the show so I think so much for having me on", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Carrollton", "day": "22"}