{"month": "10", "state": "MA", "station": "WNNZ", "content": "And by the PTA providing public transportation to twenty four communities seven days a week all buses accessible for the mobility impaired PTA dot com\nHundreds of black women are running in federal state and local elections this year\nBlack women have been the most reliably voting constituency for many years for the Democratic party\nAnd so this is about more than just respecting our vote but it's about respecting an honoring\nOur leadership I'm Ari Shapiro the surgeon black women running for office this afternoon on all things considered from NPR News [noise]\nListen to this afternoon at four o'clock\nThis was the PR news network WINZ am six forty Westfield WINZ FM Ninety One seven Deerfield\nWFCR eighty eight five H. T. three Amherst W and I knew it you know and find great Barrington W. N. N. I. Ninety eighty nine Adams WAMC Ninety One nine Springfield and W. A. M. H. eighty nine three immersed in partnership with Amherst College and UMass Amherst streaming at NPR dot net it's eleven o'clock\n\n[noise] in times of tragedy the president is usually the ones that are in cheap [laughter]\nYou have lost too much but you have not lost everything\nI Know it's hard to understand sometimes painful things like this\nWe examine how the role has evolved and what happens when presidents don't rise to the occasion\nResidents have to always remember that\nOf their job is to be a political leader of the other half of the jobs to be headed\nI'm tending to Vegas and this is the takeaway also on the show on the very spooky day we're talking about the role of women in horror film\nWhere they have always been gay and type in American Made ... women are both stereotype and empowered by are held him in our stereotype in horror movies that's why a danger lake heritage and like the ... the the take away we'll be right back after these headlines\n\nLive from NPR News in Washington encore of a cool and President Trump is traveling to a political rally near Fort Myers Florida Today I had of next Tuesday's elections White House spokeswoman Sarah Sanders says that Trump is going to start campaigning for Republican gubernatorial and Senate candidates\nThey're awful places where the president overwhelmingly popular in those locations and I think that the president the best messenger for the party you've had an incredible historic first two years in office and he has a great story to tell\nTrump has eleven campaign stops on his schedule before the election\nI mean on the president continues to tweet today about what he wants to do about changing birthright citizenship\nThis is guaranteed and the fourteenth amendment to the U.S constitution Trump falsely claims that it is not he's also threatening to take the matter to the U.S Supreme Court to get the constitution changed the constitution has only amend it\n[noise] hey for more content from New England Public radio show to NPR dot net\nSubscribe for music news and great storytelling at our\nWherever you get your podcasts\nNative Americans in North Dakota are suing the state over voter identification requirements NPR's Jeff Brady reports the lawsuit comes as tribes are scrambling to make sure their members have the required id to vote next Tuesday\nThe spirit lake Sioux tribe and members of other tribes are suing the state to overturn a requirement that voters have a street address on their identification\nMany Native Americans in North Dakota live in rural places and some don't have a street address that get their mail at a local post office Native Americans are an important voting bloc for Democrats in North Dakota\nIn recent years Republicans who control the state government have changed identification requirements citing concerns about potential voter fraud earlier this month the U.S Supreme Court let stand a previous decision that the address requirement is constitutional\nJeff Brady NPR News Bismarck North Dakota\nThere are three funerals plan today in Pittsburgh for some of the eleven victims of last Saturday's mass shooting at the tree of life synagogue Joyce Feinberg Melvin wax and urban younger will be laid to rest\nDuck boats begin rolling through the streets of Boston this hour it's a parade to celebrate the world series victory of the red Sox from member station WB you are in Boston Bob Schieffer reports\nThis is the fourth time since two thousand for that the red Sox have won the world series and then also the fourth time players have piled onto the duck boats to celebrate with rolling rally through the city\nThe boats are leaving from Fenway Park and will make their way to the streets with hundreds of thousands of fans expected to cheer them on Marty Walsh says that while parade like this might be a familiar sight in Boston this when and his team stand out\nThis is a an all time great team that we had I think a lot of people enjoyed watching the steam ah everybody contributed these plays a role models and we want to celebrate them in Boston style\nBusier socks team won a franchise record one hundred and eight games in the regular season for NPR News I'm Bob Schieffer in Boston on Wall street the dollars up more than one percent\nIt's NPR\nA Turkish prosecutor says Saudi Arabian journalists democracy OJ was strangled when he entered the Saturday consulate in Istanbul for many days the Saudi Government claimed he was alive\nThan it claimed the dissident died in a fistfight now it is the knowledge that his death was premeditated Turkey's president has demanded that Saudi officials turn over ... body but the Turkish prosecutor says it was dismembered and disposed of\nThe u._s. and Kim Rooney and governments say an American has been killed and the trouble northwest part of the Central African nation NPR's affair via Quist Arcton reports Baptist missionary Charles west go had recently moved to Cameron with his family\nThat I'll conflicting accounts of how Charles what's to die nearby man that's\nThe main town in North west kind of ruined a region where the minute the and pro independence separatists have been fighting the ... days have blamed the secessionist for west goes day other reports say he was killed in crossfire or by government soldier the Indiana mission me was reportedly traveling in a vehicle with his wife\nOne of the eight children and another mission me a family member ... west ... moved to come in\nLess than two weeks ago the state department puts on Tuesday that to an American citizen was killed in Cameron but gave no details that Iraq was stopped at NPR News that guy\nRescuers in the northern Philippines are working to free people trapped by a massive landslide it was triggered by a powerful typhoon at least Eighteen people are missing rescuers are using shovels and their hands\nTo dang I'm more of a ... NPR News\nSupport for NPR comes from NPR stations other contributors include a Rhodes Scholar offering educational traveled experiences with an algae B. T. Q. theme to learning adventure aboard the queen Mary and twenty Nineteen more R. O. A. B. scholar dot org slash cue him to\nYou're listening to the M. P. R. news mentor today's forecasts most loose on these guys ... mid to upper fifties ... mostly cloudy with ... and the upper forties\nStreaming of New England public radio is funded by you at all the energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\n[noise] you're listening to the N. E. P. R. news network news talk culture presented by New England public radio\nIn ... county production comes from the five college studios at UMass Amherst\n\nThis is the takeaway ... pass Tuesday's the funerals began\n[noise] two brothers Cecil and David Rosenthal were among the first of the eleventh victims of Saturday's mass shooting at the tree of life synagogue in Pittsburgh to be buried more than one thousand people attended\nStop their Jerry ... from squirrel hill was also buried lines of mourners stretched around the block and then on Tuesday Afternoon President Trump arrived in Pittsburgh a company called the first lady his daughter and his son in law\nBut local and national leaders refused to appear what the president and after the funeral services ended a quiet peaceful protests began\nTo be\n[noise]\nMore than sixteen thousand people signed a letter to the president written by a group of Pittsburgh Jewish leaders quote President Trump than you are not welcome in\nPittsburgh the letter read the country often looks to leadership in times of tragedy in someone who can identify with those morning and help direct the nation towards the higher better place I played the feeling the President Trump appears unable or unwilling to play that role and\nI think historians will be extremely critical of the way that Donald Trump reacted to this\nWorst attack on Jewish Americans in worshipped him two hundred years [noise]\nMichael ... said the presidential historian and author most recently of presidents of war and he spent his career researching and writing about the roles and expectations of the president's the\nPresident's award time have always had to\nGo to funerals console you know families of soldiers who were falling on the battlefield because of their own decisions and that's one reason you've always wanted to have presidents with empathy for instance\nAbraham Lincoln during the civil war was told that there had to be a National Cemetery a new one because so many soldiers were dying and Lincoln said put that cemetery right near my summer home so that I can see the union graves being dug I wanted to see the results of the terrible decisions I'm making that are creating\nOutside of having a president who is able to do this whether or not Americans themselves or\nStreaming of New England public radio is funded by un Franklin Community co op offering organic produce baked goods groceries and prepared foods in Greenfield in children's walls community grown and community own since Nineteen Seventy seven\nYou know they knew that you could elect presidents and some of them would do certain things well and some presidents would do things extremely badly and they always had faded from the wisdom of the American people if there was a vacuum like that to do it for themselves\nMichael Beschloss says a presidential historian and author most recently of presidents of war Michael thank you again thank you [noise]\nThe takeaway is supported by huge original sign roadside attraction presenting fiber class starring Susan Sarandon as a mother struggling to free her captured journalists time also trying math Omar and eating out now in theaters friday\nAnd babble language EPA teachers real life conversations in a new language like Spanish French or German battles ten to Fifteen minute lessons are available and the app store or online at babble B a B B. E. L. dot com [noise]\n\nThe any PR news network is funded by un docket El Al ... a membership workspace for attorneys in downtown Springfield within walking distance of state and federal courthouses D O C K I. T. M. A. dot com\nAnd buy a pivot media providing scanning photo restoration and fine art printing services for individuals and institutions since Nineteen Ninety nine information it as a media dot com\n[noise] I'm Jeremy ... next week voters around the country will be casting their ballads on a myriad of policy questions everything gerrymandering to nursing staff levels to casino gambling\nBut our voters really qualified to be directly deciding these kinds of things and direct versus representative democracy that's next time on here and now Bush for here and now today at noon on the any PR news network\n[noise]\nThat\nWith you on the take away and happy Halloween everybody you're saying safe and having fun and we are definitely a cartoon here at the show so check it out on Twitter [noise]\nBut back to business before the party's since taking office Donald Trump has never really stopped campaigning often returning to speak in towns and cities across the country where support for his presidency remains high\n[noise] but as\nThe mid term elections approach Trump is spending even more time on the campaign trail trying to lift fellow Republicans in tight races in an effort to maintain control of Congress and in order to keep his base energize the president is keeping his messaging simple\nLaws grocer borders illegally will be sent back home court\n[noise]\nAnd we tell them that because they've got a long hike but they can't they cannot government\nThe way they want a government doesn't work\nWith less than a week to go will the president's message motivate his core supporters to turn out like they did in twenty sixteen here to discuss this Christopher catalogue all the White House reporter for Politico Christopher welcome to the take away\nIt's a pleasure to be here [noise] so let's talk about the president's messaging here as we said we've got one week before the midterm elections what are some of the big themes that the president is really knocking hard we've got obviously immigration what else are you seeing\nThe president is going very hard on illegal immigration as you mentioned he has brought up a very unlikely proposal but one that he thinks it's going to motivate folks which is a ten percent tax cut on the middle class\nThe president has continued his barrage of assaults on the media\nAnd in the last few days he has really dialed up his critique of the Democratic party that is meant as something to really unify Republicans pointing to what he sees as kind of be extremes of the Democratic party\nYou know and I'm Wondering the president has made no\n[noise] hey for more content from New England Public radio ... NPR dot net\nGrab from music he's angry storytelling at our\nWherever you get your podcasts\nAnd Central America for Mexico with the very beginning of his campaign so is there a reason why he still really doubling down on immigration um what does that strategy tell us as opposed to health care or as opposed to other issues that he should be looking at\nThis is a an election that's really based on motivating his base nationalizing the selection around his supporters because the question that Republicans have always had as there were a number of people who turned out for Donald Trump\nMuch of them Republicans but not all of them and the question was would they come out and turn out for\nA member of Congress or a candidate for the house\nAnd that has been a much tougher thing to answer and so if Donald Trump goes out there and says this midterms is really about me my policies are on the ballot you'll remember rock Obama said that and it turned into a scandal will Donald Trump has been saying that exact thing\nAnd it's it's a way for him to to make this about himself in a way to really sort of rile up his supporters\nUh what I Would say about illegal immigration that he's focused on is this has been a constant focus as you pointed out I mean going back to the beginning of his campaign obviously earlier this spring he went really hard on the MS Thirteen gang\nAnd started using terms like animals to describe people which are generated a lot of backlash and so what he's doing is we we flash forward to the beginning of October\nAnd the president's political team started to get a whole bunch of polling data come back to them\nAbout this issue of immigration saying that in a lot of these marginal districts these competitive house districts where Donald Trump is not always seen as a help\nIllegal immigration was resonating with folks this whole idea of the Republican Party being sort of the protectors of immigration and customs agents there was an abolish ice movement on the left obviously and so that whole issue was resonating and what happened was the the president sort of\nHad this migrant caravan issue sort of land in his lap after they had already decided that they were going to really close on illegal immigration\nWell and and there's also the the recent news that the president has decided to send troops to the southern border we should also remind our listeners that\nThis migrants caravan if you will the folks who are migrating are still weeks away from even reaching the United states border so the president's doubling down on sending troops and reinforces the idea that these folks are almost the scapegoats in many ways right\nYeah I mean a lot of these attacks a lot of these statements are not grounded in reality as you mentioned these people are hundreds of miles away they would not reach here like you said for weeks and then in in the last day or so there's been this issue of ending birthright citizenship which um is has been\nReally sort of a the third rail um in in ... it has come up and it has worked in the president's favorite was obviously a question from a reporter was not something the White House proactively put out\nThere well let's listen to that 'cause I I Want to hear that clip and then I Want us to sort of break that down\nFall immigration some legal scholars believe you can get rid of the citizenship without tensions sauce chicken wing executive orders that\nOr have you thought about that is telling all it was always told me that you needed a constitutional amendment castle and you don't need a number one number one you don't need that nobody listens well you can definitely do it with an act of Congress but now they're saying I can do it just was an executive order\nI think the president was very frustrated and the folks around him were very frustrated over the last few days because the the narrative or as folks go head to the polls and a lot of these states that have early voting\nOr was all about domestic terrorism there was this obviously this is terrible a shooting in Pittsburgh and and ... you know\nEverybody sees these these things as the tragedies that\nStreaming of New England public radio is funded by you and they pass university graduate schools MS and applied laboratories outside operations enrolling now for August twenty seventh applications at bay paths dot edu\nWas going to be a very tough mid term elections Donald Trump knew that as well and what they were saying was you know all these issues come up and they they last for a day or two and then they dissipate and so they never really knew where we would end what would we be talking about when voters finally start going to the polls\nAnd they were talking about these these domestic terrorism issues that we're not seen as a help to the party so the president saw the the migrant caravan or despite the fact that it was never going to reach a the border anywhere near election day as a political gift that was the term that the folks around him were using and then\nI Would say the same thing for this question that came up yesterday I mean these are things that are going to come up and what he's doing even if it's not something that they're generating they're able to amplify the stories and they're really give them life and I think that\nIf that is something that allows them to turn the page on the type of narratives that they don't find helpful they are going to do that\nChristopher ... the White House reporter for Politico Christopher thanks again thank you so much for [noise]\nFor for the ... comes from babble European made language learning program\nThat will teaches practical conversation to tell you Russia's leaders and other languages available in the app store or online at ... a B B. E. L. dot com\nHousing it's also access to education you know we're not going to see declines in the number of people that are arriving to destination cities like LA or New York or Chicago I think it's imperative that\nLeaders take that challenge and really create not only the infrastructure but also think through how other partners can come along in this process of agenda setting for their integration\nLinda Lopez is the director of the Los Angeles mayor's office of immigrant affairs and ... is the urban advisor for the international Rescue Committee thanks to you both like you for having thank you\n\nThe PR news network is funded by un forget you know for us to create an custom floral designs for every day special occasions shut one fourteen main street in North Hampton added forget me not for us to know\nWhoa dot com and by the daily ... providing local news information at advertising for the quieter rally available online on mobile devices on tablets goes up not dot com\n[noise]\nBack now to the Saudi led war in Yemen which by most estimates has displaced well over two million ... where the humanitarian crisis is at a scale\nStreaming of New England public radio was funded by you and all the energy solar helping homes businesses and firms in western New England save money and the environment with solar power all energy solar dot com\nThat at how bad it had become\nNew York times staff photographer Tyler Hicks has made three trips to the war torn country his latest just this month and when he found there was unlike anything he'd seen before\nOn Tuesdays program we talk to the New York times is Declan Walsh who's recent reporting shares vivid details of the desperate state of millions of civilians in Yemen a country now at the brink of famine\nA company that report were portraits captured by Tyler Hicks showing children and babies starving to death in the north of the country and the bloody conflict ongoing in the south I spoke to Tyler today about those photographs\nYemen's very difficult place to work there are a lot of\nDistance to cover you know lots of checkpoints but there were a few places that we'd heard that people are really suffering and and these are areas where people\nAre coming from a pretty large region and and getting suggests a couple of really clinics I mean these are so much hospitals as as we would think of them back home these are very small\nClinics where where people come and however they can we found out there a lot of the problems is just that the economy of there's absolutely\nNo money they earned by people people don't have jobs they don't have money to get to these hospitals fuels very expensive and hard to come by and make it costs a lot of money for them you know they're they're they're having a hard time just\nFeeding their families are let alone going many hours in a vehicle to get to a clinic\nThat's how we chose to go to these specific areas\nNow the piece that you did or for the New York times one of the first images that readers will see\nWhen they opened the peace is a photo of a young girl named among all can you describe the photo for our listeners and tell us a little bit about what you were seeing and experiencing and really what struck you about a mile [noise]\nI've been to a few hospitals clinics around the north and when I when I walked into this particular one in a place called a slum\nI can tell that the moment that I walked into this was a really were some of the worst\nCases were ah it so that kind of open court orders with rooms\nAre surrounding it and just looking from that central area without even entering the rooms I could see that that the children there were were really in terrible shape skin and bones and the first for him that I went into I saw this young girl a mall and\nThe poor child was just laying on on um Koch her ribs just showing completely through her skin there was an ounce of us out on her her arms and legs just like to ... ...\nIs just very you know something about her face also she's very calm child who ... when you see your body is just heartbreaking and and I I spent a lotta time photographing her um I I knew that\nAs difficult as this photograph was to take\nAnd ... as difficult it is for the the viewers just to see\nI knew that this was going to be an important picture and unimportant photograph to be seen because uh she she really sums up how tragic and how bad the the malnutrition and the starvation has really become and Yemen\nAnd Tyler ... there is often a debate about traumatic images right\nOn the one hand people will say they're just too traumatic to publish tend to look at um on on the other hand there are people who say are they exploiting you know people who are in their most vulnerable state and at the photo journalist I'm Wondering how do you grapple with those\nIssues I never take photographs that are difficult to look at just for the sake of of getting a traumatic photo or sometimes there's a reason to document things that can be difficult to look at it and and this is one of those cases\nThere's a lot of decision that goes into both taking the photographs than to file the photographs\nStreaming of New England public radio was funded by you and bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nSide whether that image or images will appear in the newspaper this was one of the cases where I think it's really important for these photographs be seen I mean there has not been\nA lot of coverage out of Yemen it's very difficult place to get to because the travel restrictions they're western journalists not been invited very often do to go there so when we can see what's happening\nThat's an opportunity for us to to show which what's happening in the country is as difficult as it is\nAnd Tyler ... we become desensitized to images like this and the crisis in Yemen over all um because I just think back to what two years ago when there was an image of a toddler or that the Syrian refugee crisis in this town there you know with dead on the beach on the shore and I just think\nThat image was so powerful like are we becoming desensitized to the ... out there because we're just there's so much going on right now\n[noise] I think yes but at the same time it that doesn't affect the way I think that\nI should be doing my job or about how the media should be covering these places you catch tried to deconstruct what people sensitivities are and in effect\nQuarantine what you what you choose to show I think it's the more people become used to these things actually the more that you should be out there covering them because people need to be reminded of what's happening out there but all that being said it's extremely important to keep the tempo up\nAnd to continue to get these images out there\nAnd to have the machine and to get a reaction from them and of course some people will disagree with that they'll think that these photographs shouldn't be shown wonder why would you show you know these these children who are are starving to death I mean there there was another photograph that ran as part of that I was at the same hospital\nAnd I'm a as people were praying in their their six children often with their mothers being completely malnourished and unable to breastfeed or to to give any nutrition for them\nAnd it was a child photographs and um eight hours later that that that child died I found out the next day and uh [noise]\nThat's just incredibly heartbreaking to be witness to such a young an innocent lives but then it was just gone you know you hear it the next day though that that child died and the people who are volunteering and working in these clinics are they're kind of becoming used to it\nTyler Hicks is a staff photographer for the New York times titled thank you so much for joining us [noise] thank you for having [noise]\nThe way and supported by huge original Roseanne attacks and presenting diaper clap during Susan Sarandon as a mother struggling to free or captured journal my son also trying ... found out in theaters friday\nThe any PR news network has funded by you and the Yukon executive m._b._a. program in Hartford uh twenty months program for business managers seeking leadership track E. M. B. A. dot business dot ... dot edu\nAnd by yes computers celebrating twenty two years serving the valleys Mac community an apple authorized service shutter probably supporting New England public radio\nAnd the Supreme Court became so politicized\nHow the court looks now with the Trump appointees and the chief justice is considered the most likely to swing voters we'll talk with David Kaplan author of the most dangerous branch he was the legal affairs editor at Newsweek join us [noise]\n[noise] hey for more content from New England Public radio go to NPR dot net slashed puck can subscribe for music news and great storytelling at our website or wherever you get your podcasts", "year": "2018", "show_name": "The Takeaway (PRI)", "city": "Westfield", "day": "31"}