{"month": "10", "state": "PA", "station": "WESA", "content": "Free to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nYou won a your contribution in any amount matters here's how you can help all of the programs on Pittsburgh's NPR News station or made possible by membership please begin or renew your support anytime W E s I thought of them\nIt was important for me to become a member of W the essay they feel like in the fact well and then the gate and thought out and this wouldn't exist without the people who listen and supported financially ... chose to be kind of standing member because I realized how many hours of every day I'm really spending with W DNA\nIt was really worth every dollar that I contribute each month for how much time with them\nName is Jennifer tomorrow and I live in a minute\nPlease join me as a sustaining member visit W E s say\nNot ask them more call for one to six nine seven to nine five five thank you\nThis is Ninety point five W. E. S. A. N. W. E. S. A. H. D. one in Pittsburgh Pittsburgh NPR News station we are going to be going to NPR for news and just a moment we have a minute left or you get your gift match dollar for dollar\nAnd a pick up for example those Bluetooth ear buds on special for a ten dollar a month contribution after today they go up to a hundred and eighty so get it on the match take advantage of this opportunity joined folks like Drew Drew and look in the air thank you for your support\nSays that drew is encouraging all citizens to listen\nTo interesting and informative radio you're not just a listener you're a citizen when you are everybody is but you're more informed citizens when you listen to the station thank you do for your support caffeine ... made a contribution as well\nUh did a copy and macdonald thank you for your support Angela in Pittsburgh Joan in Hampton township and uh we want to thank you as well and we also heard from Andrea\nThese folks have gotten their gift match you could still get your gift doubled if you're on the phone or on the Web and the next minute the phone number to call it for one\nTo six nine seven twenty nine fifty five you're gifted doubled when you give on line at W. E. S. A. dot FM thank you for your support\nLife from NPR News in Washington I'm Laurie London Pope Francis has notified cardinal Donald Wuerl the archbishop of Washington DC that he has accepted his offer to step down NPR's Tom Gjelten says\nWorld has been accused of helping to cover up the sex crimes of priests under his supervision\nCardinal Wuerl has not himself been accused of sexual abuse unlike his predecessor in Washington Theodore ... who had to step down as a cardinal in July\nBut his bishop of Pittsburgh world do sympathetically with several priests against whom serious complaints have been made sending them for psychological evaluation but allowing them to remain in the priesthood or approving payments to them\nAnd accepting the arch bishops resignation Pope Francis noted that world could have defended themselves by distinguishing between covering up crimes and committing mistakes but the world had not tried to do so he has to world to remain in charge of the Washington archdiocese until a successor is named Tom Gjelten NPR News\nIt's all about right response and recovery now and the aftermath of hurricane Michael the storm has caused massive damage particularly on the coast of Florida supplies of food and water are being brought in some by helicopter in cases where roads are still impassable\nFEMA administrator Brock Long is asking residents who evacuated to wait a bit longer to return\nQuite honestly it's a dangerous area to go back into a you know when you asked\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nFlorida supplies of food and water are being brought in some by helicopter in\nCases where roads are still impassable FEMA administrator Brock Long is asking residents who evacuated to wait a bit longer to return\nQuite honestly it's a dangerous area to go back into a you know when you have this type of destruction there's gas lines that are there there's power lines that are down a and doing so you're putting your life in danger and we ask you to be patient\nSome areas saw several feet of storm surge which smashed through windows ripped off routes flu outbreak walls Michael is now being blamed for eleven fates holidays and Florida Senate debate between democratic Senator Bill Nelson and Republican Rick Scott has been postponed\nAmerican pastor has been released from house arrest in Turkey NPR's Scott Horsley reports President Trump had lobbied for pastor Andrew Brunson is freedom\nPresident Trump tweeted this morning that his thoughts and prayers are with Andrew Brunson hopes to have the pastor safely back home soon in the United states Brunson who's from North Carolina was imprisoned in Turkey for two years it was part of a round up following the failed coup against president ... or to what\nThe Trump Administration had champion Brunson cause telling her to want his release would improve us Turkish relations Rosen was transferred to house arrest earlier this summer today's order but he'd be freed entirely was warmly welcomed by evangelical Christians in this country Scott Horsley NPR News the White House\nStocks are recovering to some degree from the law says this week but still on track for their biggest one week law since late march the Gallup hundred and sixty two this is NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nYou are listening not employed five W E s say I'm Brian to work here with Sarah ...\nMany reasons why W E s a is your go to radio station all of the programs you hear hear are in need of your support for the W e as they can keep them on the radio\nPlease give now during our fall membership Dr W E S H ... FM or give us a call it for one to six nine seven to nine five five Sarah\nWarn listeners are accusing sustaining membership\nDesignating a set amount for your budget each month as an affordable latest support all your favorite programs to make sure we have the money it takes to keep bringing them to yield and getting a little money at little extra money every month as the best way to maintain a strong future for the station and the programs he left he\nCan give us ten or twenty dollars a month now by giving us a call it for one to six Ninety seven to nine five five or go on line to W E s said ...\nIf you support W E s a at ten dollars a month we'll thank you with our brand new Bluetooth ear buds this is a special offer after today you'll have to give a hundred and eighty dollars these ear buds are controlled by magnets when the year ... separated they power on what's her back together the power off it's very clever\nBuilt in microphone and music control is also there and they work well with your phone tablet or any Bluetooth enabled device and they're also comfy two and a easy to use and they sound great so sign up as a sustaining member at ten dollars a month\nAnd that's where the ear buds you can also give one hundred and twenty dollars all at once\nDreaming on W. E. N.\nSay it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nWould leave power off it's very clever a bill to the microphone and music control is also there and they work well with your phone tablet or any Bluetooth enabled devices and they're also ... two and a easy to use and they sound great so sign up as a sustaining member it ten dollars a month\nAnd that's where the ear buds you can also give one hundred and twenty dollars all at once it's a special offer after seven o'clock you will have to give one hundred and eighty dollars to get these as I think your gift to support you're listening to W. E. S. A. now by giving online at W. E. S. age out FM recall for one to six nine seven to nine five five\nMakes public radio a great one reason is that most of the reporters and hosts that there'll be at NPR and W. E. S. A. R. ... readers they constantly follow global national and local news stories and read books and magazines and blacks to keep up with the current events and cultural trends\nThen they use that understanding of the world to create original reports and stories that let you be of racist listener help us continue to feed your need for great radio by giving now give us a call it for one to six nine seven to nine five five or go online to W E S H ...\nAnd the best way to give to W. E. S. A. is by signing up as a sustaining member you can pick a monthly amount that works for you five ten or twenty dollars a month it's automatically charged to your credit card or to doctors from your checking account you can change that I'm Out anytime what other monthly bills to pay that are less than ten dollars a month\nThat give you the value and knowledge that you get from W E s they make the call us support right now it for one to six nine seven to nine to five five or do that over a W why or W E essay dot FM\nWe live W like if you if you're going to do a lot of hearing from listeners to tell us they grew up listening to NPR it was on the way home that they heard it in their parents' car radio writing in the back seat I always remember hearing Car Talk as so now it's your turn you can become a member for listening that you do now and\nWe'll ask for some from your kid sometime down the road to give us a call it for one to six nine Seventy and tonight by by where this on line that W E S H ...\nW E s I supported by chorus call a worldwide Monroeville based provider of customer video conferencing audio conferencing webcast have event management services for business community nonprofit organizations since my duty to\nMore information about course called it was a ... a course called dot com\nBoom and if they take away with Amy Walter from WNYC NPR I public radio international collaboration with doubling GBH radio in Boston\nWe continue our look at Trump's promises from twenty sixteen campaign to pick up now on trade\nThen candidate Trump rent on a message of blow it up a bad deal I'm\nGoing to tell the foreigners that I intend to immediately leaned negotiate the terms of that agreement I Am going to withdraw the stray from the Trans Pacific partnership and I'm going to direct the secretary of commerce identify\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free press\nWhen you become a standing member was W E s say today you're contributing to an organization that is truly exceptional seriously like where else can you learn\nTo make that call us supported for one to six Ninety seven to nine to five five you could also help us get closer to the goal at W. E. S. H. dot FM and when you become a sustaining member was W E as say today you're contributing to an organization\nThat is truly exceptional seriously like where else can you learn the news of the day from seasoned journalist here about the lives of people on the other side of the planet listen to it and that exploration of scientific discoveries\nAnd discover music from some of the world's most creative artist take a moment and think about everything NPR\nAnd W. E. S. A. brings to you and our community here in Pittsburgh now remember W E as safe as possible because of the support of our listeners please offer your sustaining contribution now for one to six nine seven to nine five five or on line that W E S H ...\nThink about a contribution of ten or twenty dollars a month you probably spend a lot more each month on things you value a lot less maybe you pay for a subscription service that you don't even use that often but it's there for you when you want it you make W E s a part of your weekly maybe even daily routine\nSo today we're asking for you to make us part of your budget you make a big difference and you'll feel great when you do it how many other organizations can you just pick what you want to contribute to them and pay for what you need for one to six nine seven to nine five five\nYou can do it online as well at W. years say\n... FM in thank you W\nE S a is supported by Carnegie library of Pittsburgh providing services and spaces for learning exploration achievement and to discovery Carnegie library of Pittsburgh is dedicated to serving the region through community support more information is available at Carnegie library dot org\nToday in the takeaway we're looking back at President Trump's promises\nI Am going to be\nThe greatest jobs president\nThat God ever created remember that [noise] candidate\nTrump outlined two goals to measure that jobs promise\nOver the next ten years or economic team estimates that under our plan the economy will average three point five percent growth and create a total of twenty five million new jobs\nAnd twenty Seventeen GDP Growth was over four percent on pace with his goal here ... attacks an economics reporter for the New York times\nIt wasn't over four percent but that's just one quarter to quarter before that was like two percent\nSo we're sort of on pace right now most forecasters think to him about three percent\nWhich is good comparatively for the last ten years that's faster wrote that we've seen and so it's not what the president promised it's not the super charged sustained three and a half four percent which is really hard to do particularly at this point in an economic cycle but\nIt's better than it was and I I Do think that he gets some credit for that\nOkay let's tackled number two twenty five million jobs as a candidate President Trump said that he would create twenty five million jobs over the course of ten years are we on track to see that kind of job growth\nSo I I Believe we're right around for a million jobs from the start of his presidency and I will say first off that is just like a straight line continuation of the job creation pace that we were on for the average of the last several years before his residency that said it is very difficult to imagine that you will\nScreaming on WGN supported by Carnegie Mellon university integrated innovation detail on a master's program\nAt the end news dot edu flash I I I\nSo I I Believe we're at right around for a million jobs from the start of his presidency and I will say first off that is just like a straight line continuation of the job creation pace that we were on for the average of the last several years before his residency that said\nIt is very difficult to imagine that you will continue to see that kind of expansion absent more workers coming online I mean there just\nAren't going to be enough workers to fill those jobs where three point what seven percent unemployment there are probably some workers who haven't been looking for work who come in off the sidelines but not enough to keep this kind of pays up for six more years most economists think\nThis discussion about more jobs in the manufacturing\nSector and in sectors like coal mining what have we seen there\nSo again here here's a mixed picture with some real successes though the president can claim\nManufacturing had a pretty terrible not just recession but pretty ... recovery from the recession and that has set up we have seen more manufacturing jobs added and a real celebration of that over the last year so the president is claiming a lot of credit for that\nOn mining if you're looking at oil and gas drilling we've seen a bounce back which is almost certainly correlated with the a spike in oil prices again coalmining which is a thing that he really did focus on a lot has not come back\nWe also heard a lot about this president is a populist so how do you rank him on the scale of populist or economic nationalist his rhetoric versus what's actually happening uh be uh his administration policy\nI mean he's done a lot of the things he said he would do but he has led with a lot of things that\nAlmost any other Republican running against him and twenty six teams for the nomination would have also done\nYou know Jeb Bush would have signed a tax cut bill that Donald Trump signed and it might not have walked all that different I guess you can see the most pro trouble you can put it is\nShe is pursued a bunch of policies that are pro growth and that of help the economy grow faster and the most skeptical Trump you could say is that he inherited a the start of a parade and has done a very good job throwing himself in front of it and you know tossing some\nFuel back to the to the floats in the form of fiscal stimulus I Do want to mention one other thing though which is that he also promised that Americans will be seeing huge increases in their paychecks and we don't see that yet because inflation has\nHas also written over the last year and so there has been for the typical American worker really no wage gained over the last twelve month for a president who made a populist pitch to workers it's not all that reassuring to say to them corporate profits are at an all time high and we promised your wages will get\nThere so\nYou are listening to Ninety point five W E s a this afternoon the take away on a friday TGIF thanks for being here with us we're going to take a few minutes because we count on listeners like you for the money needed to pay for the news reports that analysis discussion the\nTake away which he joined every day the noon hour this is our fall membership drive and we're asking you\nTo do your part becoming a sustaining member here was Ninety point five FM online at W. E. S. A. dot ... or you can go to our website there are ... you can give us a call actually because I just mentioned the website for one to six nine seven to nine five five\nWe count on listeners like you for the money needed to pay for the news reports said analysis discussion the take away which he joined every day this at noon hour this is our fault membership drive and we're asking you\nTo do your part becoming a sustaining member here was Ninety point five FM online at W. E. S. A. dot ... or you can go to our website that are ... you can give us a call actually because I just mentioned website for one to six nine seven to nine five five I'm Christopher ears and I'm joined here right now I'm five Bryant's work\nAnd good afternoon to you you know if you support W E essay at ten dollars a month today we'll thank you with our new Bluetooth ear buds it's a special offer after today you'll have to give a hundred and eighty dollars to get those the ear buds are controlled by magnets they're blue and when they hear buds are separated they power on once you're back together the power of\nThere's a built in microphones you can talk on the phone with them you know to listen to music with them as well there's value in control there as well they work with the phone\nA tablet or any Bluetooth enabled device if you sign up as a standing member today at ten dollars a month you can ask for the ear buds you could also give a hundred and twenty dollars all at once but it is a special effort today and after seven o'clock tonight\nYou'll have to give one hundred and eighty dollars to get them to support you're listening by giving online at W. E. S. A. dot FM or call us at Fort one to six nine seven to nine five five and when you\nCall right now and you contributed W E s say you'll be doing three things you'll be you'll be feeling good because you're contributing to the uh to the news programming that you hear on this station every day by doing your part and and uh and contributing you'll be getting those earbuds at ten dollars a month you will also be helping us reach our goal for this hour\nWhich is one thousand dollars and we're almost halfway through the twelve o'clock hour we're doing great work so far we only have\nThree hundred and Seventy dollars left to go to meet that one thousand dollar goal for this twelve o'clock hour during the take away so do your part right now give us a call ... those ear buds help us meet the goal for one to six nine seven to nine five five were on line a W E S H ...\nWhen you listen to the w._b. essay you stand with the facts you stand for reporting that recognizes that we live in a world of nuance and you stand for respect of all ideas\nAnd opinions now I'm asking for you to stand with NPR Anne W E s a as a sustaining member of the station support of just ten or Fifteen dollars a month\nEnsures the news that you trust is always available for you you can make that phone call us support right now at for one to six Ninety seven to nine five five or join online at W. E. essay dot FM\nA thousand dollars for this hour as what we're looking for in in just the a couple of seconds really since I last mentioned our goal one of one thousand dollars we have two hundred and fifty dollars left\nSo we're making really good progress here at twelve thirty I'm coming up on twelve thirty call right now for one to six nine seven to nine five five you can contribute on line a W E essay dot at them and thank you\nW E essays supported by the natural sleep shopping cranberry township natural sleep shops infant apartment features organic ... mattresses and custom non toxic nursery furniture bill from a choice in six different woods and over Seventy finishes made in the U.S spy kids comfort\nNature Pete again more details at the natural sleep shop dot com I'm\nGoing to appoint justices of the United States Supreme\nCourt\nFree to pursue the re to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free press\nOh\nJust a last week Facebook and Google both announced a new smart speakers with video screens and ...\nIn just a last week Facebook and Google both announced a new smart speakers with video screens and Amazon as heck bent on putting elected in everything\nNow on the one hand people seem to want these do have these research firm can Alice says global smart speaker sales grew one hundred and eighty seven percent in the second quarter of this year\nOn the other hand and always on always connected listening devices home with a video screen or camera I've really freaks some people out\nSo let's dig into this and quality assurance the segment where we take a deeper look at a big tech story ... is the hosted the pod cast daily tech news show he said before you decide whether to worry about smart speakers you should know what you're worried about\nIt's kind of the new the CIA is listening into my telephone I mean we all had Mike's in our house with telephones a long time ago and there were misperceptions about what could actually be done or even if it could be done how often it was done\nUh it's pretty well audited that these things are only listening for the wake word and not sending things to the cloud I think there's a lot of worry about the wrong things would be smart speakers you should be aware of what it is collecting\nBut on the other hand I don't think that you need to worry that it's constantly spying on you\nYeah I mean I feel like the reason we're having the conversation is fundamentally about this trust thing and it's hard to say yes they are gathering data about you and you don't need to worry about it I think\nIt's all about knowing what they're collecting and knowing what they're using it for I think that's where the trust got lost as people didn't realize it was being collected and what it was being used for people voluntarily let Nielsen collect information about them all the time because they go in with eyes wide open I'm going to get this benefit in exchange for giving them\nThat knowledge and and I think that's the situation you need to adjust yourself to his what benefit am I getting by doing so I'm able to turn the lights off in my house with the speaking of a word is that okay in exchange for Amazon going oh this person that smart lights the next time I go to Amazon dot com I'm going to show them some suggestions for that kind of\nProduct we're kind of like guinea pigs I think at this point for all the technology that's being thrown at us and part of the reason people feel skeptical that this is new in its were the first generation I think you could argue that really are having to wrestle with these questions about privacy can we even really understand the longer term consequences of the decisions were making today\nNo I I think that's a good point is that nobody knows these companies don't know what the consequences of their collection are uh I think in large part they are doing it out of a profit motivation or it's not necessarily for your good but I don't think they have an evil intent to either\nIt's an amoral intent for a large part and I don't know that they knew what the consequences were and a lot of this backlash is a surprise to them because they drink their own Kool Aid and thought yes but you're getting this great free service that were provided why would you be upset with a little data collection\nThat's Tom merit hosted the daily tech new show all week long I've been asking you on Instagram and in a pod cast what you think about smart speaker\nCheck out the marketplace tech high gas to hear some of your answers and other\nMali would enough my life [noise]\nYour days are more interesting when you listen to marketplace tack on Ninety point five W E s\nFree to pursue the free to explore we're Nineteen twenty five W E s say Pittsburgh's NPR News ... the sound of a free press\nAnd speaker check out the marketplace Kathy here some of your answers and\nI'm only would it not my place [noise]\nThis is eight PM your days are more interesting when you listen to marketplace tack on Ninety point five W E s say\nThat's a good reason to make a contribution during our farm membership cry which is going on right now your gift now will make a for more interesting days to come more informative days to come please give on line at W. E. S. A. dot FM you can also give us a call and for one to six times seven to nine five five\nGood Friday afternoon I'm Christopher ears I'm drawn to your by Bryant's work and good afternoon\nOr what about ten dollars a month if you support W E essay at ten dollars a month\nWe can thank you today with our new Bluetooth earbuds it is a special offer for today only after today you have to give more money and they are a these are ear buds or blue their control by magnets and when the Airbus are separated they power on and once they are back together they power off\nThere is also built a microphone and music control as well and they work with any Bluetooth enabled device so that is today only if you sign up as a sustaining member of ten dollars a month\nYou can also give one hundred and twenty dollars all at once but it's a special offer after seven o'clock today you have to give a hundred and eighty dollars to get these ear buds so support you're listening by giving online right now at W. E. S. A. dot FM or by calling for one to six nine seven to nine five five\nYou know from your perspective ... getting the best radio journalism as easy as just pushing a button on your radio in your car or on your smartphone you just tune into W ESPN NPR from our perspective here on our end we we can tell you that worthwhile radio doesn't come to you got easily\nIt takes considerable resources takes time\nTakes expertise to create great radio takes skill\nThis fund drive is about having the money to keep doing the difficult work of keeping you in the know keeping us informed\nKeeping you better connected to your community and to the world\nPlease get what you can write now become a sustaining member for one to six nine seven\nTo nine five five you can also do so just as easily on line that W E S H ... and you know you can set up your membership with this radio station the same way you listen just by the push of a button really because of becoming a sustaining member more and more listeners are choosing that option\nAnd all you do is designated a small amount of your budget each month\nAnd it's an affordable way to support all of your favorite favorite programs and make sure that we have the money it takes to keep bringing them to you and give it a little money every month is the best way to maintain a strong future for the station\nAnd the programs you love also it's really great for your budget you can give ten twenty dollars or more or less a month right now at for one to six nine seven\nTo nine five five or online that W E essay dot FM and if you've never given a public radio before Brian I and I are here this afternoon we're talking to you you listen to every day you're listening here this Friday afternoon you count on NPR in W E s saves your\nPrimary source for news this radio station runs on idealism that's the fuel that keeps us going it runs on the belief that you will see the fairness and paying for what you use\nW. E. S. A. is worthy of your attention that's why you listen now we asked you please given amount that you think is fair got become a sustaining member become a sustaining first time member to W. E. essay right now if you've never contributed for one to six times seven to nine five five you can do so on\nFree to explore free to pursue the truth\nNinety five W yet they Pittsburgh NPR News station the sound of a free press\nIt runs on the belief that you will see the fairness and paying for what you use\nWBFO he is worthy of your attention that's why you listen now we asked you please given amount that you think is fair got become a sustaining member become a sustaining first time member to W. E. essay right now if you've never contributed for one to six Ninety seven to nine five five you can do so on line at W. E. essay dot ...\nWe all make a conscious decision to support the things that matter to us you listen to NPR because facts matter truth and trust are important to do\nIt today we're here to remind you that you met her so pleased become a member of this radio station that brings you all this great news and information every day by making that phone call the support at for one to six nine seven to nine five five you could do that on line a W E s said dot FM just like\nBorder from squirrel hill did in Andrew in the keys rocks thanks to them we would hear from you next\nListen to take away my made me Walter\nWe've been examining the promises of Donald Trump on the campaign trail which ones have borne out\nWe in the hour with one of President Trump's biggest promises of all to curtail both illegal and even some legal immigration one part of that plan\nDonald J Trump is calling for a total and complete shutdown\nOf Muslims entering the United states\nUntil our country's representatives can figure out what the hell is going off\nAfter a series of injunction in court cases the Supreme Court ruled earlier this year that the administration's third travel ban I mostly Muslim nations can in fact move forward and the one that there's been some success ... he also promised to go after sanctuary cities\nRefuse to cooperate\nWill not receive taxpayer dollars and we\nTo pass legislation to protect jurors searchers that do federal\nAuthorities [noise] but just\nEarlier this month a judge found that the Trump administration's efforts to stop federal grants from going to jurisdictions with sanctuary city legislation to be unconstitutional\nAdministration is also ramped up ice enforcement\nCut down on the number of refugees admitted to the country and put in place to zero tolerance and family separation policy at the border policy they later had to reverse through executive order after backlash and we should note there are still children being held in federal immigration detention\nBut the immigration problem is most important to his supporters\nI Will build a great great wall\nOn our southern border and I will have Mexico pay for that wall mark my words that\nIf you watch a Trump rally today you would think the wall is well underway Trump supporters even hold up signs that read finished that wall\nYou know we've already started when he got one point six million were fixing a lot of it and we're going to get it finished sooner than anyone would believe\nMe ... is senior editor of different parents desk for K. Jay Z and works along the border I asked him how Trump is doing on the biggest a promising\nNow give it a breakdown so Mexican on the U.S Sheera two thousand model boundary about six hundred and ...\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station\nThe sound of a free press\n... is senior editor of different parents death for K. Jay Z and works along the border I asking how Trump is doing I'm the biggest problem\nRight now given the breakdown so Mexican on the U.S share of two thousand miles boundary about six hundred and fifty miles of that have some sort of sense and that's that's two types uh there's either to the ball or style walls which are ah", "year": "2018", "show_name": "The Takeaway (PRI)", "city": "Pittsburgh", "day": "12"}