{"month": "10", "state": "PA", "station": "WESA", "content": "Free to explore read it for the the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nCorps W. E. S. A. dot ...\nWe're getting so close and if you're on the phone or on the Web you will count toward that goal think about becoming a sustaining member of at ten or twenty dollars a month whatever fits your budget\nYou probably spend more each month on on coffee maybe pay for a service you don't use much but you used W E essay you listen to one a every day so please join us that for one to six nine seven to nine five five or W. E. S. A. dot ...\nGive now and you'll get for great thank you gifts in one special package we called the W E S a free press pack\nNormal you'd have to give three sixty to receive all for gifts but today you're going to get the news out of a press stainless steel water bottle are stand with the facts tote bag wait wait don't tell me the uh digital album and one of our new reusable strolls for just Fifteen dollars a month\nYou're going to be supporting the news in a big way when you call right now for one to six Ninety seven to nine to five five you'll also be entered win tickets to Hamilton W E s say ...\nYour fellow listeners are stepping up we only have five hundred dollars to go to meet our goal in less than a minute so you could you could help put us over the top if you go to the phone now it for one to\nSix nine seven to nine five five or you can go on line at W. E. S. A. dot FM we are getting so close and we know that you're going to put us over the top\nYou've been waiting for the time to contribute you've been waiting for just the right time for you well I'm telling you right now is that time I'm encouraging you to give us a call help us meet the school five hundred dollars to go I guarantee you we can do it for once you six nine seven to nine five five\nYou can also give on line at W. E. S. A. dot at that and thank you\nLive from NPR News in Washington I'm Lakshmi Singh with spotty electricity and phone service the search for missing hurricane victims in the Florida Panhandle is precarious\nIt's been a week since hurricane Michael leveled entire communities as floodwaters recede more bodies are being recovered\nThe death toll in Florida and other states is at least twenty nine dozens of people are unaccounted for with fears rising that people may still be trapped beneath their collapsed homes NPR's Greg Allen takes a look at one community that was almost wiped off the map\nSome of the worst destruction is in Mexico beach where search and rescue teams have been combing through such destroyed homes with help of dogs and listening gear does have been reported to Mexico beach it's not clear yet how many for the emergency operations center says twelve doesn't ... plus one death in ... he had been confirmed by medical examiner's\nThat's from the storm of all she was confirmed in Gadsden county and clay county there also deaths from hurricane Michael reported outside of Florida and Virginia Georgia in North Carolina\nThat's NPR's Greg Allen secretary of state Mike Pompeo says Washington will wait for the results of investigations into the disappearance and alleged murder of a Saudi dissident journalists who resides in the U.S and parents Peter Kenyon reports from Pelayo says if it's proven that Saudi Arabia was involved in your mouth to show jeeze death such an act would be indefensible\nCompel you met with President Richard ... and they discuss the probe of what happened to ... after he entered the Saturday consulate in Istanbul\nPompeo told reporters on this plane that he's not going to get ahead of the investigations but rejected the notion that the U.S might condoned the kidnapping are killing of a journalist\nI'm not going to speculate obviously if someone gave you the\nNo no one is going to defend\nActivity of Turkish in Saudi investigators entered the Saudi consul general's residence today to conduct a search Peter Kenyon NPR News Istanbul German Chancellor\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\n[noise] we have more from as we Nicholson speaking in the ... before heading to the summit in Brussels under the ... said she regret the United kingdom's decision to leave the European Union and that Britain had shaped your in many ways they last for decades\nEven some onion oh not that I'm also\nAn appalling caught up all of that\nI very much hope it's great question will remain a close friend trusted pocket of the youth wants to shift left\nShutting concerned about the Irish border Muslims that the most difficult to see how often that to the end of the negotiation sickening she sees a good chance ... solution\n... must recognize there is a difference between ... the European Union and not being a member for NPR News I'm Esme Nicholson invited\nUs stocks are lower with the Dow down fifty four points at twenty five thousand seven hundred forty four this is NPR\nSupport for NPR terms from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more ed Raymond James dot com\nIt's the Ninety point five W E s a fall membership drive which is going on right now thank you for joining us this afternoon for the take away on Ninety point five FM\nOr drive ins tomorrow at ten AM so please help pay for your W E s a listing by making a contribution right now for one to six nine seven to nine five five it's also easy to enroll online at W. you said ... good afternoon I'm Christopher ears are joined here in Studio ...\nYes and to all of you take away listeners if you become a member of W E S H today you could win a pair of tickets to the Hamilton\nThe smash hit Broadway musical Hamilton is coming to Pittsburgh in one lucky person will win a pair of front row orchestra tickets to see it at the Benetton center on January twenty six these are great seats they're not even on sale to the public yet you will be entered too when when you give\nYour membership right now on line at W. E. S. A. dot FM or you can call for one to six nine seven to nine five\nYes you will be a joining a other folks who are going and contributing right now are helping us meet our goal overall for this Dr you'll be entered the windows Hamilton tickets you also be joining a lot of find folks\nIn membership you'll be joining people like Jennifer from Pittsburgh who contributed last hour Beatrice from beaver Linda from Bethel park Patty from bridge will mark from Pittsburgh so many people appreciate\nA Pittsburgh public radio a nine point five W E s say if you're one of those people then join those folks and membership right now for one to six Ninety seven to nine five five sign up for those Hamilton tickets W E S H ...\nMore thank you it's going out to Lauren from Ohio townships thank you so much and and Raymond from Pittsburgh Patricia and dance so McDonald's PA\nWe have listeners from cannons bark like Richard all of them all of them support public radio and appreciate what they hear every day here on W E s I won't you joined them it's easy just takes a couple of minutes either on the phone and for one to six nine seven to nine five five or online at W. E. S. A. dot ...\nSaw a few listeners on the phone from last\nHour which means it looks like we made that goal from last hour which is fantastic if you're you are listening last hour you called any you contributed thank you so much for helping us make that goal because every individual goal for every\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt ... dot edu slash I I I\nThe month we're going to thank you with a W E s a free press pack which includes are loose out of a free press a water bottle are stand with facts tote bag wait wait don't tell me the twentieth anniversary digital album and one of our new reusable strolls\nNormally you would have to give three hundred sixty dollars to get all these thank you gifts today only you can get them for Fifteen dollars a month which is a fantastic value on line that W E S H ... give us a call during the take away a four to six Ninety seven to nine five five\nO W e essay you hear stories about events that changed the international order that's what's happening now with the disappearance of the Saudi journalist\nIt's happening now and you're only going to get a deep analysis from NPR and here at W. E. S. say we know you appreciate programs like the take away here and now all things considered\nDon't wait any longer join us a call and become a member if you aren't at Fort one to six nine seven to nine five five O W E S H ...\nAlso when you call today you're going to be entered when a pair of tickets to see Hamilton third one to six nine seven to nine five five injure them drawing today at W. E. S. A. dot ... and ...\nThis is the takeaway I'm tending to Vegas in an interview with Fox News Tuesday night President Trump spoke about missing journalist Jamal ...\nYou'll start hearing what is happening Turkish looking at a very strongly we're all looking at it together but turkey and Saudi Arabia looking for ... whether or not the case the crown prince knew about it in my opinion [noise]\nNumber one what happens with whether or not they knew about it if they knew about if that will be bad\nBut in an interview with the Associated Press the president took a different tone this tiny compared what's happening to Saudi Arabia to the treatment of justice Brett Kavanaugh and he said quote here we go again with you know you're guilty until proven innocent\nMeanwhile secretary of state Mike Pompeo visited Saudi Arabia and met with the crown prince in a statement ... said the Saudi leaders would investigate the matter and that they continue to deny any involvement in ... disappearance\nBut the incident has highlighted international concern over the Saudis regime on human rights abuses there have been reports of an increase of women and other activists being arrested entertained\nThat is one example of that um women in Saudi Arabia have now joined the twenty first century um with the abolition of the restriction on their right to drive 'em as well as uh the problem is to open movie theaters um which is considered a revolutionary move in twenty Eighteen in Saudi Arabia\nIs a lot of this optics though or is it real change um I think it's no I think it's\nCertainly real you know when when women take the wheel a mate means they have some freedom of movement a and the ban on their driving was one hundred percent about controlling women's freedom of movement\nSo women in Saudi Arabia still can't travel or without the permission of male guardian a that is a restriction on their freedom of movement\nAnd Saudi women who have managed to escape Saudi Arabia have found themselves facing a threats of abduction a attempted abductions an actual abduction by Saudi Government officials who literally drag them back\nTo the country um and so uh it is it is it is a loosening of that restriction\nAnd I think it's a smart move by NBS to tap into a the majority of his population who are under the age of thirty and who don't understand why their country is so behind the times in these basic things that is extremely embarrassing when people talk about Saudi Arabia the number one example they would always give\nAs well women can't drive there so it's taken that talking point away at what has turned out to be very minimal cost for decades or the Saudi government's defense for continuing to create this ban on women driving was that the public would revolt against the government if they changed it\nHe has called the bluff of all of those threats as to why Saudi can't make changes and so certainly now we want to see other changes like lifting the bans on a women's right to marry women can't get married and Saudi Arabia without their male Guardian's permission\nSarah Leah Whitson is executive director of the middle east and North Africa division with human rights watch Sarah thanks for being with us thank you [noise]\n\nParticularly supported by a dedicated to those who make build and more offering Bold Business banking for freelancers and entrepreneurs including children in forcing more deposits an online accounts at ... dot\nCom first\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt the end you dot edu slash I I I\nThis year every house seat is up for grabs Democrats could take over and a third of the Senate is in play well the Republican agenda continue\nI'm tending to Vegas from the take away you know there's going to be a lot of news between now and November public radio is poised to deliver objective reporting on all the issues that will come up in the coming months and you can count on it\nAnd public radio accounts on you for the funding to pay the cost of this exceptional journalism your contribution is essential so call now or join online banks\nW E S H ... two six nine seven to nine five five is the number to call thank you to everyone who's already given during her for membership drives the past week if you have yet to give it is almost over a it ends tomorrow morning at ten o'clock right after the confluence\nSo please make your contribution to W E s say help pay for your listening in the months to come\nEasy to give on line become a sustaining member a W E S H ... you can also call for one to six nine seven to nine five five\nGood afternoon thank you for being here during the take away I'm Christopher ears and I'm joined in Studio by Murray is capitalism\nAnd if you're a procrastinator it's actually a good thing because if you become a member of W E s a today you could win a pair of tickets to see Hamilton\nThe smash hit Broadway musical Hamilton is coming to Pittsburgh and wimax lucky person will win a pair of front row orchestra tickets to see it at the ... on Saturday January twenty six you will be honored to when when you give\nTo the membership Dr don't wait do it now on line at W. E. S. A. dot fmri call for one to six nine seven to nine five five\nYou'll be entered the windows tickets you also be helping us meet our goal for this hour two thousand dollars but we're looking to raise by one o'clock this was the last time that you'll be listening to the take away during this drive\nSo if this is a program that you appreciate a then now at the time to call for one to six nine seven to nine five five two thousand dollars is the number we're looking for by the end of this hour W E S H ...\nYou know a W E s say we don't just tell you the news we explain it and that what that is what happens on programs like the take away today for example the mysterious disappearance of the Saudi journalist the takeaways looking at\nThat through the lens of Saudi Arabia trajectory of human rights abuses where else do you find that probing journalism\nNowhere else but here on public radio on W E s saying NPR so please take a moment if you appreciate the quality journalism take a moment and become a member for one to six nine seven to nine five five or W. E. S. A. dot ... and\nIf you support the news by giving the W. E. S. A. right now today you're also going to be entered into a drawing to win a pair of tickets to see Hamilton maybe you wanted to see Hamilton for a while\nUm you maybe you wanted to go to New York city the show but you haven't had the opportunity well it turns out the Hamilton is coming here to you in Pittsburgh tickets are not on sale to the general public yet\nBut today and so they only when you contributed W E s say you're going to be entered into a\n... a drawing to win a pair of front row tickets to see the show at the Benetton center on Saturday January twenty six so for a chance to ... to see the show you're going to have to give us a call right now for one to six Ninety seven to nine five five you can also entered when those tickets on line at W. E. S. A.\nFM and we're going to even entice you more if you get Fifteen dollars a month we will thank you with a W E s a free press pack it includes our sound of the free press stainless steel water bottle are stand with the fact tote bag the ...\nFried ... free to pursue the truth Ninety five double you yet the Pittsburgh NPR News station the sound of a free press\nMetal straws to help protect the environment I'm holding it right here it's great normally you'd have to give three hundred and sixty dollars to get all of these thank you gifts but today only you can get them with a pledge of Fifteen dollars per month you'd see just takes a couple of minutes online W. E. S. A. dot ...\nOr for one to six nine seven to nine five five and thank you\nW E s e supported by a health care benefits company offering coverage at all hospitals in western Pennsylvania at now is dedicated to helping members to cheap health goals managed benefits and view plan documents through a secure\nMember portable more information on line at at no coverage you dot com\nWe turned to Florida now and the aftermath of hurricane Michael whenever a natural disaster hits vulnerable communities can often be forgotten or left behind and the disabled community is no exception\nLast week Oscar winning actress Marley Matlen who is death tweeted out a video of the storms trajectory with this comment\nI wanted to share this video for the thousands of deaf and hard of hearing residents in the path of hurricane Michael but unfortunately it's not closed caption access to info is vital it's a life or death matter\nSo what can be done to improve on these communications failures for Americans with disabilities Marcy Ross is the CEO of the partnership for inclusive disasters strategies and she formerly served as famous director of the office of disability integration and coordination\nWelcome Marcy thank you very much for having me\nSo Marcy in her tweet Marlene ... described the failure to provide closed captioning during Michael what are the federal guidelines for how communication needs to share before during and after an emergency or natural disaster\nIt required that information is provided equally to ah people who have the legal protection of disability um which includes people who are deaf people who are hard of hearing\nInformation must be provided during emergencies that is actionable and accessible king everyone\n... what do we know about how people with disabilities do during disasters are they more at risk are the more likely to be left behind are they more likely to be discriminated against\nPeople with disabilities are two to four times more likely to be injured or to die in a disaster\nAnd it's almost never because of their ability it's because and share your king plan and be inclusive of ... on the eve of the community in Hama dating every one\nWe're obviously reporting on the aftermath of hurricane Michael I'm Wondering what was your assessment of uh the situation on the ground there for the disabled community\nSo we are still very much at the front end of disaster response and a circumstances for\nEvery one has been dire for people with disabilities circumstance will tell them that actually difficult the uh ability can't get actionable information or\nHas been stymied because\nA communication systems are down and people don't has television a text messaging thankfully is still a working for many people but if you don't have power and you don't have the ability to\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nHeard that many people who have evacuated have not found\nThat Larry Rosen cofounder and president of Edison research you can find other takeaways from the Edison poll about trade our economic anxiety index and the poll by the numbers on our website marketplace dot org\nI'm only what and that's marketplace ...\nMrs eight PM\nYou are listening to Ninety point five W E s say it's our fault membership campaign\nGave now and you will be entered for a chance to win a pair of tickets to see Hamilton at the ... center in January what better time to become a member of W E s say\nGood afternoon I'm ... and I'm here with Christopher airs asking you to join now to become a member to support public radio in programs like the take away\nOur membership drives for the fall it's almost over last\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt the end you dot edu flash I I I\nFor one to six nine seven to nine five five or W. E. S. A. dot ...\nWe've got twenty minutes to go before we get to one o'clock that's when the take away and that means you have only twenty minutes left to contribute during the take away so if this is a show that you particularly I have an affinity for that you tune in each day\nUh now's the time to contribute we're looking for Fifteen hundred dollars a to raised by the end of this hour Fifteen hundred dollars that's just a few people contributing pooling resources and are using the time we have here during the take away and marketplace tacked to um to help us reached that goal\nFifteen hundred dollars twenty minutes to do it for one to six nine seven to nine five five on line a W yes I got to\nRemember give now and get a chance to win tickets to see Hamilton and your support it goes directly to news coverage both from NPR and from our newsroom here at W. E. essay over the past several months we had been putting your membership dollars to work on a series we're launching today it's called dividing lines the shape of education in Pittsburgh\nIt's a critical look at Pittsburgh public schools feeder pattern which is the map that assigns kids to neighborhood schools based on where they live and we have stories about the choices parents make about where to send their kids to school about desegregation about school closures and a lot more it's an eight part series that runs from today through next friday\nThis is a great example of the work that you'll only get here at W. E. essay and it comes with your support for one to six nine seven to nine five five or online at W. E. S. A. dot EFF MPs\nThat dividing line series that is one of the reasons that you contribute to the station because\nUh of the expertise and the are reporting that we bring you hear that the the ah W E s a new team brings you you know you listen to W yeah say throughout the year because you appreciate that kind of news you appreciate the local news the national news you appreciate the take away\nSo why not spread your membership out the same way throughout the year\nYou can try W E essays monthly sustain are planned you pick the amount that fits your budget and it's automatically build to your credit card every month or deducted from your checking account so your contribution keeps giving all year long just as you are listening to the station and the sustaining membership or news automatically so you don't have to worry about that\nFor one to six sites seven to nine five five or give on line a W E S H ...\nA lot of really good reasons to become a member today not just to win a possible tickets to the Hamilton but also if you get Fifteen dollars a month we will thank you with a W E s a free press pack it includes our sound of a free press stainless steel water bottle\nAre stand with facts tote bag the wait wait don't tell me twentieth anniversary digital album and finally one of our new reusable metal straws normally you would have to give three hundred and sixty dollars to get all of these gifts but today you get them\nFor a sustaining membership of Fifteen dollars a month\nAnd it's easy just go to the phones for one to six nine seven to nine five five or go on line at W. E. S. A. dot ...\nNow get a chance to win tickets to see the Broadway musical that hit the one all the Tonys Hamilton\nWhich is coming to Pittsburgh January twenty six this tonight you'll be entered the windows tickets twelve hundred dollars to go in the next\nAbout sixteen minutes twelve hundred dollars to go that could be just a few people that we need to hear from before the end of the take away at one o'clock four to six Ninety seven to nine five five you can also give on line that W E S H ... n thank you\nToday's program and you'll supported by truck elevator Pittsburgh's coding boot camp\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nCareer workshop October twenty fourth to understand so Pittsburgh tech landscape and tips to use a tech a job search using tech elevators career ... program registration at tech elevator dot com\n[noise] fifty\nYears ago this week Tommie Smith and John Carlos raised their gloved fists as they stood on the medal podium set the Mexico City Olympic Games [noise] it was the summer of Nineteen sixty eight and their protest a symbol of black power and civil disobedience round the world here Smith at a press conference after the ceremony in\nThe rye glove\nThat I wore on my right hand things by the\nLike teenage John Carlos warheads pan [noise] made an art\nMy right hand in hand also signify backed unity [noise]\nFifty years later we're seeing a renewed wave of protests in sports and most notably with athletes taking a knee during the national anthem to protest police brutality and social injustice according to a recent NBC Wall Street Journal poll\nFifty four percent of voters say kneeling during the anthem is inappropriate but that hasn't stopped athletes at all levels from pro sports to high school programs from participating\nThat's why I'm so passionate about this because I have a grandfather that's a veteran I've talked to him and he supports me and my decision at the daily it's to a point in this nation where people need to see the problem and either be named to be a part of the solution or they're part of the problem with\nRichard Johnson the second place left tackle in defense of then on the Capitol Christian football team in Maryland and he goes by Archie and before the season again he and his teammates organized and decided that collectively all thirty two players were taken me before each game and Cornell Wade is RJ courage\nI think one of the great things about the protests\nIn terms of what goes on with us is that I take I mean right next to country or who is a retired Marine who stands out in full attention and I think that's a great representation of what America should be aware you know I can have my opinion and I can voice my opinion and I can have\nA fight that I feel it's worthwhile and someone else can we can disagree on that and that is okay so why people may sound like it is inappropriate [noise] what I Would like in a situation where people are understanding of the deeper meaning behind this isn't an issue\nA flag at the end of the day is an issue about the fact\nThat you know house in players some of the school and I'm not sure whether or not they'll make it home and made me ...\nI asked coach weighed how their team first came to the decision to take any out when\nThey first approached me about it I I\nDefinitely was proud that they wanted to take up a fight if you will I'm I'm a firm believer that you stand for something or fall for anything so seeing them decide that they want it to you know stand up for a cause that they thought was words he gave me a sense of pride\nI just gave them two things do they need to make sure that they did the first is that every one of their teammates agreed that they wanted to do the protests are we support the protest and to defecate was that they did it in every game it'd be pick and choose when they did it\nRJ this thing about taking a knee actually started a couple of the two years ago or ...\nScreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation details on a master's program\nAt ... dot edu slashed I I I\nI personally I was saying that parents in watching the news article that I think I Believe in that week it happened\nIt was it was shocking because it was it was it made me realize even more what the problem in this country was and then just seeing all the backlash said he had within the week we have him first nearly it was\nIt was it was a sad reaction butter it also made me hungry or for for justice and when you say justice what do you mean I mean justice for all the innocent lives that were lost to police brutality\nAs a Christian and as a man there's certain morals that you have to uphold and you need to be able to take care of everyone 'cause I Know if I had a son I wouldn't I wouldn't want him to be able to I wouldn't let him do anything because that'd be too worried about him doing something\nOr you are having conversations about this I'm In school\nYes the school is a very politically active school and we are very politically aware\nRJ when you you know this week is the fiftieth anniversary of Tommie Smith and John Carlos who are raised their fists at the top of the podium in Mexico city at the Olympic Games did you ever heard of that protest\nYes ma'am I've seen the pictures of it and my family by great uncle who actually recently just as he was very it was very active and he made sure that I knew a lot about civil rights\nTo do you feel like that influences what you guys are trying to do on the field now\nObviously it obviously does because I Know that ... the older generation in my family they told me stories of how they had to struggle and and they've told me it's horrible stories about what people or does it ever tried to do that or do to their friends", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Pittsburgh", "day": "17"}