{"month": "10", "state": "PA", "station": "WESA", "content": "Free to pursue the re to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nWhen we found the fact that it was on every one of our review malls and if we turn the radio on that's what we're listening to we sort of you know what we have to support those ideas that are good for me to be funded\nAnd those who are suspending membership it's just the reassurance but we're doing our part to make sure that this continues\nDealing with usually respect the fact and I appreciate that\nThey will bring different voices table and forces the don't necessarily agree [noise] I went to respectful discourse when it comes to you\nDon't want drama I just want information presented\nA priest drawn from trailer\nFor one to six and seven\nOr visit the usa\nThis is not the point five FM heavy enough ... each one Pittsburgh Pittsburgh NPR News station dreaming WTO see ... of them\nA teenager from what they might last six asylum in the United states but under the Trump Administration his chances are extraordinarily slim and he goes to court by himself he's given a list of lawyers that he could call free lawyers they are too busy to take him he's connected with a private lawyer who's willing to help them\nBut he has to pay forty five hundred dollars for that time Tanzania Vegas and this is the takeaway\nAlso on the show the problems with using artificial intelligence in hiring\nAlgorithms can talk today\nDisaster bait and perpetuated by as they exacerbate the discrimination problem [noise]\nAnd the fight to get more representation to the group that is often considered the backbone of the Democratic party\nThing the Democratic party can afford is for black women to stay home on election day any place in the country and all that and your takes as well on the take away after the headlines ...\n\nLive from NPR News in Washington I'm Laurie London [noise]\nHurricane Michael is now an extremely dangerous category for storm and continues to grow forecasters say it will make landfall around mid day to day posing a threat of catastrophic searches of the water and a roof shredding wins\nFEMA says it has nearly three thousand people in the field ready to assist\nAnd as NPR's Rebecca Hersher reports Michael is predicted to be the worst hurricane ever recorded on the Florida Panhandle\nMichael's maximum sustained wind speeds or near one hundred forty five miles per hour that's strong enough to rip off ribs downed trees and to overturn mobile homes hurricane warning in effect for hundreds of miles of coastline along the Florida Panhandle storm surge of at least nine vertical feet is forecast near Panama City Florida\nUp to twelve inches of rain could cause flash floods in some areas and tornados are also possible according to the national Hurricane Center Michael could get slightly stronger before it's powerful core makes landfall in Florida this afternoon\nThe storm is expected to turn northeast as it hits land moving across Georgia and South Carolina on Thursday before busting out into the Atlantic on friday Rebecca Hersher NPR News\nThe U.S Supreme Court is weighing in on lawsuits over a citizenship question the Trump Administration wants to add to the twenty twenty cents is NPR's Hansi Lo Wang reports\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free friends\nIt's land moving across Georgia and South Carolina on Thursday before busting out into the Atlantic on friday Rebecca Hersher NPR News\nThe U.S Supreme Court is weighing in on lawsuits over a citizenship question the Trump Administration wants to add to the twenty twenty cents is NPR's Hansi Lo Wang reports the administration is asking the court to stop lawyers from questioning administration officials under oath about the citizenship question\nLower courts had ordered to key officials behind the citizenship question to testify out of court they include Congress secretary Wilbur Ross who approved adding the question to the twenty twenty senses and John Gore the acting director of the Justice Department division that the administration says it needs to question to better enforce the voting rights act\nSupreme Court Justice Ruth Bader Ginsburg has put both of their depositions on hold temporarily until the high court decides whether to block them permanently dozens of states cities and other groups are suing for the removal of the citizenship question\nA field discovers households with non citizens from participating in the census and harm the accuracy of the information collected on the long NPR News New York\nPresident Trump is repeating and an supported assertion that California Democratic Senator Dianne Feinstein leaked a letter written by the woman accusing Supreme Court justice Brett Kavanaugh of sexual assault\nTrump's comments at a rally in Iowa last night prompted the crowd chanted lock her up Feinstein is the ranking democratic member of the Senate Judiciary committee she denies leaking the letter that led to the firestorm over Kavanaugh's confirmation\nOn Wall street tech stocks are leading a major downward slide the Dow is down three hundred and Seventy nine points this is NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nYou're listening to the takeaway on Ninety point five W. E. S. A. and this is the W E S a\nFall membership drives a noncommercial nonprofit community radio station\nWe rely on listening as like you for the most important part of our income so please help pay for your future W E s listening by giving now by becoming a sustaining member now that for one to six nine seven to nine five five or online a W E S C I F him for\nInviting you to become a sustaining number today during the first day the fall membership drag because we have a ten thousand dollar\nChallenge waiting for us at the finish line if we can hear from two hundred and twenty five sustaining members by seven P. M. we've heard from a hundred and sixteen so far that means a hundred and nine to go you can get us a little bit closer\nRight now by choosing a get the ten dollars a month twenty dollars a month maybe you can afford to come in at a hundred dollars a month whatever that is that fits your budget do it today and help us unlock\nThis tremendous challenge opportunity again the numbers for one to six nine seven to nine five five or you can join online at W. E. essay dot FM\nWhen you listen to one a and the takeaway on W. is so you stand with the fact you stand for accuracy and reporting you stand for journalism that's fair because facts matter\nAnd values matter that's what makes NPR and W. usa worth listening to it makes it worth supporting and it makes it worth becoming supporting member we're relying on you to keep this\nScreaming on W. E. N. say\nIt's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nYou stand for accuracy and reporting you stand for journalism that's fair because facts matter and values matter that's what makes NPR W E s a worth listening to it makes it worth supporting and it makes it worth becoming supporting member we're relying on you to keep this valuable service going\nCollege now right now for one to six nine seven to nine five five or online that W E s a F him\nAnd if it gets up ten dollars a month or more sounds good to you can take advantage of our new it's thank you get a good question this our theories here on W. E. essay\nFeature is now coming to print it's a book that will not be available at stars at least not for a little while that you can get your very own copy as with your donation of ten dollars a month or more and you can select that when you call for one to six Ninety seven to nine five five or ... when you get on line at W. E. S. A. dot at them\nYou can step up right now and become a member were counting on you call right now for one to six nine seven to nine five five go online at W. E. S. A. dot FM thanks for becoming a supporter\n\nW. E. S. A. is supported by the Pittsburgh foundation working to improve the quality of life in the Pittsburgh region since Nineteen forty five by evaluating at addressing or most pressing issues promoting responsible philanthropy and alerting donors to our\nCommunities most urgent critical needs more information at Pittsburgh foundation dot org\n\n\nA little bit of my friends were able to escape and they called me and they began to hit me they were punishing me they were cutting my hands so\nThis is a story of escape as well and they ... him which has in the town where I live there is a lot of crime and there was a gang veterans that is like\nAnd they're looking for people in order to grow in science and in fact as they say expand their territory\nEighteen year old ... grew up in a mountain town in Guatemala were violent gangs were daily reality and one he was always aware of and then one day a year ago and the fall of twenty Seventeen Melvin found himself face to face with a local gangs brutality\nBegan talking with me and said hey man you know we need more people in our gang do you want to join our game would you like that and I said no and I said no I did not once you're on the other hand if I wasn't going to leave my study is for things that weren't good\nThis is going to happen after some time they got hired and I've come to his wealth or fourteenth of September ... beat me between all of them and they beat me because I didn't want to help and yes\nThey thought I Would fight back but then they all begin piling on and began beating me I think I bled from here with the punches all over here because they say that though\nThe gang tortured Melvin using knives to slice slowly and painfully into his arms with the support of his parents he fled to the U.S seeking safety alone Melvin set out on the dangerous journey to the border\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nEspecially so there is a lot of concern about what's going to happen as the storm which is still gathering strength continues to come toward us we've got about a minute left\nDid not evacuate so we don't know what's going to happen to them um we're expecting a lot of our roads to wash out highway Ninety eight here that runs along the Gulf especially so there is a lot of concern about what's going to happen as the storm which is still gathering strength continues to come toward us\nWe've got about a minute left land and I just want to know what measures if any are being taken right now to minimize the injury or potential for death or damage\nWell the measures that could have been taken have already been taken those were basically the evacuation orders if people didn't evacuate again these are low lying areas they're pretty much stuck for the duration of this event\nUm you had businesses that are boarded up but again in Tallahassee were happy with trees they've tried to bring them back as much as possible these low lying areas they tried to get as many people to evacuate and get out as possible but\nAgain either people cut into or as some have chosen to stay behind so at this stage of the game they've done all that they can do\nLynn had her at the news director at WFSU in Tallahassee Lynn thanks again thank you [noise]\nOoh\nWilliams supported by timeshare eggs with gene doping people negotiate releases from timeshare commitments learn more at ... dot com\nJournalists across the country covered local news and all those stories about your city's culture town hall and changes in your community there are all connected I'm Jeremy Hobson and local journalism means going into your neighborhoods schools and barbershops to talk to you\nWhen you link all those stories together you get a vivid picture of our country its people and the challenges we face take for an example education\nSchools across Oklahoma have been closed for nine days\nAnd in North Carolina thousands of teachers are expected to march on mistake captures in Arizona are headed back to their classrooms today after six days of protests at the state Capitol in Phoenix\nYou can hear the bigger picture when you listen to NPR and when you give each month you help support local stories they unite our country keep the stories that connect our country coming become a sustaining member now\nThan we count on listeners like you for the money needed to pay for the news reports analysis the discussion that you depend on every day this is our phone membership drives here at Ninety point five W E essay and we're\nAsking you to do your part by becoming a sustaining member online if W E s said to them or at for one to six nine seven\nTo nine five five good afternoon thanks for joining us here for the take away this afternoon I'm Christopher ... into your body lurking paid shake ups\nThat tried to get our full membership drive off to a great start David and Marianne from Lebanon will donate ten thousand dollars in challenge money to W E s save the catch is we only receive that money to spend two hundred twenty five people sign up as monthly sustaining members tonight\nBy seven increasing your existing sustain membership also counts toward that challenge\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News ... the sound of a free press\nShould drive off to a great start David and Marianne from out of Lebanon will donate ten thousand dollars in challenge money to W E s saved the catch is we only receive that money to spend two hundred twenty five people sign up as a monthly sustaining members tonight\nI sat and increasing your existing sustain membership also counts toward that challenge that was one of the many people who believe in the importance of a free press as someone who believes that W E s a is an important part of what makes a living in Pittsburgh special I Hope you'll join now as a standing member to help her in that challenge\nFor one to six nine seven to nine five five or online at W. E. S. say data FM you know here at W. E. S. say we know reporting the news does not just mean telling you what happened you need to know why it happened who was behind it water their motivations who benefits what does it mean for you\nThese are the questions you want answered and you want them answered by someone that you can trust\nThat is why out of all the news sources out there you turn to NPR in W E s say right now we're turning to you for support we'd like you to be a sustaining member give us a call for one to six nine seven to nine five five or you can contribute online sign up as a sustaining member there at W. E. S. A. dot FM\nListener contributions make up about half of the total revenue for W E essay\nGetting more new members just one or two percent more would make a huge difference your contribution now to W. E. essay on sure that NPR and W E s able remain on the air the quality of news and information you receive from W E s say would not be nearly what it is today\nIf we had to rely solely on tax dollars for programming W. E. S. A. is only hear thanks to our listeners who give\nSo please do so now for one to six nine seven to nine five five on line W E S H ...\nYou know you spend money on things that are essential to you beyond just food and housing things like cable t._v. your smartphone Internet access and probably entertainment options may be other news subscriptions listening to W. E. essays is central to your life ... you are essential to last year the reason that we can operate here on a daily basis\nMembership makes everything that we do and everything that you hear on this station possible it's not worth ten dollars a month maybe twenty dollars a month\nMaybe thirty become sustaining member today it takes just a couple of minutes and you will be happy and satisfied each day that you tune in and know that you're part of the reason that we're still on the air here at Ninety point five four to six nine seven to nine five five become a sustaining member W E S H ...\nWe have a super special gift for new members and sustain or it's the W E S a good question bug good questions become one of our most popular features and right now you can get all the answers when you support W E s say at ten dollars a month\nYour curiosity sparked some Pittsburgh's most intriguing questions we found the answers for you and they are ... W E essays first ever good question book you can pick one of those up by calling for one to six Ninety seven to nine five five W E s said that I found\nYou know when you listen to W E s say uh you're standing with the facts you're here to get your questions answered your good questions\nYou're standing for clarity and uh you're standing for reason with the station those are all great reasons to support NPR on W E s say right now to become a sustaining member do it it's really easy ten dollars a month you get the good question book\nJust go to our website W E s said ... you can contribute there or you can just give us a call ... using the old fashioned way it's for one to six nine seven to nine five five\nFree to explore free to pursue the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nReasons to support NPR on W E s say right now to become a sustaining member do it it's really easy ten dollars a month you get the good question book\nJust go to our website W E s said then you can contribute there or you can just give us a call ... easy the old fashioned way it's for one to six nine seven to nine five five that's for one to six nine seven to nine five five and thank you very much\nToday's programming is supported by Allegheny financial group more an eight six six six two zero six seven six zero in Allegheny financial dot com Allegheny financial group providing comprehensive financial planning and wealth management\nAllegheny financial group invested in your piece of mind\nAnd we're back with the pie and goes from the Harvard Kennedy School he was also a technology and economic advisor in the Obama White house then more recently worked on privacy policy issues that Facebook\nWe're talking about privacy in the age of artificial intelligence eight I is something that touches more parts of our lives and never before including how we get hired for jobs\nI asked him how private proprietary hiring algorithms reconcile with a person's privacy\nUp until now and it just doesn't records and that's that's the problem that we have\nA lot of people don't necessarily want their information to be grabbed by recruiters whether it's a vendor or big company trying to look into you determine whether or not you're a good candidate\nFor a job at a bank or a job at Google or a job at any sort of multinational company\nA lot of people just don't want their information to be pulled by these organizations and for their behavior and characteristics and personalities and routines and likes and dislikes and interests and preferences many of us don't want that to be on show for recruiters\nHow do we matched that there's not really a good solution for that in the United states we do not\nHave a baseline privacy law\nEurope does have a fundamental right to privacy Europeans do and many other countries and injure restrictions around the world they're not trying to develop something similar in the United states we don't and it it's actually\nA bit of a non starter here to give the individual whether it's a voter or consumer or any potential candidate for a job it's a tough political battle to sell policymakers and politicians on the idea that privacy is something that deserves respect\nI I Know it because I covered that many years ago particularly um when there were many efforts in Washington DC to try to pass some sort of policy legislation and that was under the Obama administration actually has your work at the Obama White house or a Facebook influenced how you look at this today\n[laughter] absolutely while I was in the Obama White house the Snowden disclosures and just happened there was a lot of attention on the administration there was a lot of pressure on America to do something about privacy\nOr in other words do something about the breach of trust against Silicon Valley really and the American government in light of\nThe tremendously challenging and extensive surveillance programs that America and the national Security Agency were were engaging\nAnd part of our job was to craft a baseline privacy law which we ultimately called the consumer privacy bill of rights and ultimately the president announced that as a legislative draft as a discussion draft for the consideration of the U.S Congress\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nAgency were were engaging\nAnd part of our job was to craft a baseline privacy law which we ultimately called the consumer privacy bill of rights and ultimately the president announced that as a legislative draft as a discussion draft for the consideration of the U.S Congress\n[noise] so the first five ... ... talk\n[noise] so the first five ... ... talk that they'll be coming out in the next year\nIn two or three years there's talk that some of the networks will be commercial ready\nTo move into this Internet of things these machines I've talked to one another will be out on the market\nYou know what's a broader timeline well you know a lot of folks in ministry talk about a five year rollout and even more broadly that each of the past generations of wireless technology three ... each of those generations has been about a decade so maybe that kind of order of magnitude\nScott tongue it's a marketplace reporter and our former China correspondent tomorrow and the show we'll talk about the tension between companies who wants to roll out five gee infrastructure and the cities who want some say in that process [noise] em Ali would and that marketplace at\nMrs eight PM expanding your horizons and deepening your understanding of the world the world of tack that News World\nAh two reasons that you two ... two W E s a two good reasons to give to W E s said during our fall membership drive please sign up as a sustaining member on line at W. E. S. A. dot FM or call for one to six nine seven to nine five five good\nWednesday afternoon I'm Christopher heirs and I'm joined here in Studio during this fall membership campaign by lurking page Jake upsets\nRight many people who listen to W. E. S. A. simply believed that W E S H is the most credible and reliable source of news and information on the radio\nThey think it's the best way to stay informed about what's happening in Pittsburgh and around the globe you're listening now and you ... W E essay so I'm asking you to police sign up as a sustaining member\nDoing it now will also help need eight ten thousand dollar challenge grant being offered by David and Marion and not Lebanon\nThe only way to earn the challenge is it two hundred and twenty five people sign up as a standing numbers if you're already a sustaining member you can still help meet the challenge by increasing your monthly amount you can do that by calling for one to six nine seven to nine five five\nSo far today we've gotten a lot of calls were still looking for one hundred for more ... you can sign up online as well W. E. S. A. dot at them\nThat's where I W E s say data FM for one to six times seven to nine five five looking for those one hundred for more sustained there's this afternoon and into this evening W E essays voice of reason in a time when civil discourse\nIs a rare thing and W E s safe sport's your interest in in news of course in current events but also in history\nIn music and in science those are a few good reasons to support W E s say right now for one to six Ninety seven to nine five five become a sustained or online at W. E. S. A. dot at them\nAnd let me tell you there's never a shortage of news your contribution makes it possible for NPR and W. E. essay to cover the news in the way you expect and depend on\nThe expensive to but reporters in the field when you think about where news is happening and where it could happen next is important to get as many listener contributions as possible so we can continue to bring you the important news or the day no matter where it is\nYou can contribute by calling for one to six nine seven to nine five five crews over on line W E s they died I found\nKnow consider for a moment\nFried ... free to pursue the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nAnd the field when you think about where news is happening and where it could happen next is important to get as many listener contributions as possible so we can continue to bring you the important news or the day no matter where it is\nYou can contribute by calling for one to six nine seven to nine five five crews over on line W E S H ...\nYou know consider for a moment a contribution of ten or twenty dollars a month you probably spend a lot more each month on things that you value a lot less maybe pay for a subscription service that you don't even use that often but it's there for you when you want it you make W E s a part of your weekly maybe even your daily routine\nToday we're asking you to make us part of your budget you'll make a big difference and you will feel great\nWhile you do that budget spreadsheet each month for one to six times seven to nine five five become a sustaining member at W. E. S. A. dot FM\nDo do a budget spreadsheet each month I tried to yes I Try to ... and stick to it I should say one of our new thank your guest is hot off the press it's the W E S a good question book\nGood questions become one of our most popular features and right now you can get all the answers when you support W E s say at ten dollars a month for one to six nine seven to nine five five\nYou can give on line at W. E. S. A. dot FM I'm sure you've heard good question on our airwaves now you can read it and the comfort of your living room for one to six nine seven to nine five five go on line W E S H ... you know today's\nNews is too complex for just sound bites that's why you listen to W. E. essay\nBut in depth reporting is expensive which is why fewer news outlets do it\nYou can fight the soundbite mentality by preserving your source for in depth news by giving to W. E. S. A. right now become a sustaining member you can call us at for one to six times seven to nine five five where you can become a sustaining member on line at W. E. S. said that at them\nAnd we look forward to hearing from you and thank you very much\nTo do is programming of supported by the Pittsburgh cultural trust presenting as part of the Pittsburgh international festival first watched that a puppet theater show for adults good questions or politics news sources and place in history using the lens of childhood as the prospect of\nOctober twelve and ... teams to go to that trust or ... org slash first [noise]\nJust the take away with hands and Vegas from WNYC NPR I public radio international collaboration with W GBH radio in Boston\nAs Democrats seem to wrestle back control of Congress this November they're trying to mobilize a key part of their constituency black women\nBut are they really doing enough well let's talk about it in the twenty sixteen presidential election Ninety four percent of black women voted for Hillary Clinton over Donald Trump according to exit polls and last year Senate race in Alabama saw black women proof have it all in electing the state's first democratic senator and a quarter century\nAnd we know that victory would never happen without the organizing power down there or without African American women the backbone of the Democratic party Ninety eight percent of them voted for Doug Jones that's\nDNC chairman Tom press but some black female leaders are concerned that they aren't being given enough of a voice to shape the party's direction at its highest levels when you think of currently right now the spokespeople for the Democratic party\nI I'm pretty sure there is not one woman of color who is speaking on behalf of the DNC and and I find that to to be\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free friends\nSome black female leaders are concerned that they aren't being given enough of a voice to shape the party's direction at its highest levels\nWhen you think of currently right now the spokespeople for the Democratic party\nI I'm pretty sure there's not one woman of color who is speaking on behalf of the DNC and\nAnd I find that to to be close to malpractice when you have so many black women around the country who support and and make it possible for democratic candidates to win when they don't see themselves in the leadership of the party I I think that that's a big strategic mistake\nThat Jim ... she's the founding member of vote run lead and she was the only black female candidate to run for DNC chair and twenty Seventeen she's become increasingly frustrated with the party's leadership\nCertainly with the Democratic National Committee and and as this was becoming more apparent it was absolutely necessary for me to\nTell my personal story of of why I go to the DNC when I noticed that there were a lot of systemic issues not being addressed as far as opportunities for black women in leadership positions at the national party\n[noise] I'm Wondering if we knew in the twenty sixteen elections that the majority of black women Ninety percent of black women voted for Hillary Clinton was already frustration in the women that you talk to about that\nAbout their support of the Democratic party in record numbers and then not the support that you're describing\nThere's a lot of frustration out there there's frustration in the Democratic party's response to the twenty sixteen election where you had an overwhelming majority upper Ninety percent of African American women voting for Hillary Clinton voting for democratic candidates\nAnd not having the narrative that came out of the twenty sixteen election\nReally to recognize that and the narrative that did come out of the twenty sixteen elections for many Democrats and and for many of the Democratic party institutions was focused around how the party needed to invest in white male voters\nAnd as you can imagine you know that sparked frustration I think also for me personally watching the DNC chair race take off and not have\nAny woman of color on that stage in those forum when everyone and and it's a very well known phrase says that women are black women are the backbone of the Democratic party but it's not reflected in\nThe leadership selection in the investments to ah recruit and train and support black woman running for office I mean even today I don't think those frustrations have been addressed in any\nReal significant way from our party institutions when you have four out of that eighty four\nTargeted races for the Democratic congressional campaign committee only four out of eighty four are black woman\nGiven those numbers of support coming from black women to democratic candidates that that that's just not acceptable\nYou of course ran for chair of the DNC could someone say well ah you're just frustrated that you didn't get the chair and that's your that's the basis of your critique I have to ask the questions\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on the master's program\nAt CMU dot edu slash I I I\nThose numbers of support coming from black woman to democratic candidates that that that's just not acceptable\nYou of course ran for chair of the DNC could someone say well ah you're just frustrated that you didn't get the chair and that's your that's the basis of your critique I have to ask the question to move there\nCan be anything further from the truth I I think my entire professional political career has been focused on", "year": "2018", "show_name": "The Takeaway (PRI)", "city": "Pittsburgh", "day": "10"}