{"month": "10", "state": "NH", "station": "WEVN", "content": "Where it happens and H. P. R. dot org it's quick and easy it's easy you got it set up so it takes between two and three minutes to make that pledge or you can call has been said one eight eight eight eight zero five six four seven seven and when you make that pledge remember\nYou are making everything that you hear a New Hampshire public radio possible we really thank you for that and H. P. R. dot org and thanks thank you\nIt is twelve noon and coming up next to Syria now on an HP our support for an HP aren't comes from you our listeners them from winter didn't burn which are which show rooms in Amherst keen and wind in Massachusetts offering personal consultation more in the winter in furniture dot com\nAnd from the parish players present in the world premiere of Sylvia andme Area C by Duncan Nichols directed by nor Jacobson opening October eleventh tickets or perish players dot org these are decisions of New Hampshire\nPublic radio reveal conquered eighty nine point one\nW. E. V. S. Nashua eighty eight point three\nW. E. V. H. Hanover Ninety One point three\nW. E. D. in Keene Ninety point seven WABC Corum one in seven point one\nW E v J Jackson Ninety nine point five\nW E v F Holbrooke Ninety point three\nAnd W. E. V. cute little ten Ninety One point nine an on line at an H.\nP. R. dot org\nLine from NPR News in Washington I'm Louis ...\nInside the U.S Capitol in a secure room senators are waiting their turn to read the results or the confidential background check on sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh outside people are shouting to be heard these demonstrators support cabin on [noise]\n[noise]\nHaving view the confidential materials available after the most recent FBI review Democrats are not impressed California's Dianne Feinstein is the judiciary committee's top Democrats\nThe White House certainly blocked access to millions of documents from judge Kavanaugh's record I Know that\nAnd ensure that Ninety percent of his emails and memos weren't available for the Senate or the public in the hearings it now appears that they also blocked the FBI from doing its job at first\nProcedural vote is scheduled for tomorrow in the Senate NPR's Windsor Johnston is at the Capitol where the Supreme Court confirmation debate has energized voters\nPretty much anywhere you go on Capitol Hill right now the ... have their\nOut of office buildings lining the steps of the U.S Supreme Court they've come a sign that reads stopped having all have an old lied under oath summers sitting on the ground writing last minute letters to deliver to senators before they vote on Kavanaugh confirmation they're angry\nThey believed that the U.S Supreme Court deserve better adjusted for will serve the country of judicial way and they said that person not Brett Kavanaugh NPR's\nWinter Johnston Iran's Supreme leader says his country will defeat American sanctions and deliver a slap to the U.S NPR's Peter Kenyon reports us oil sanctions are due to be re imposed next month\nLeader Ayatollah Ali Khamenei delivered a televised speech to an audience of besieged paramilitary forces calling it a sensitive time for the Iranian people which he blamed on arrogant powers\nHow many appeared to respond to a comment by President Trump that Iran could collapse under American sanctions reimposed after Trump's decision to withdraw the U.S from the twenty fifty nuclear agreement with the wrong painful sanctions on Iran's oil and gas sector are due to return\nCountries say they're committed to continuing trade with Iran despite the American sanctions but a number of companies that do business with both to us and Iran have already announced their decision to drop the Iran business Peter Kenyon NPR News Istanbul\nFlags across South Carolina are flying at half staff the governor ordering the remembrance upset and law enforcement officer shot in the line of duty and Florence South Carolina won guide Wall Street the gal ... two hundred thirty five points this is NPR ...\nSupport for NPR comes from log men make you go to meeting proud sponsor of how I built this entrepreneur summit taking place in San Francisco ... censor October sixteenth more about the summit at NPR dot org slash summit and the ... e Casey foundation\nThis is an HP our News I'm Dan Kogan that afternoon\nOfficials to New Hampshire hospitals have announced plans to merge with a Massachusetts hospital system Exeter hospitals CEO Kevin Callahan announced its partnership this week with my wife Douglas Hospital in merger with Massachusetts General hospital\nCallahan says Exeter in one wave Douglas will be part of a New Hampshire based healthcare system called new co that is minister to buy Massachusetts General ... merger will likely not receive state and federal approval before winter of two thousand Nineteen\nO s Lebanon library will host a public information session tonight on accessory dwelling unit the units often called in law apartments are seen as one solution to the region significant housing shortage\nMike ... is with bottled communities the organization sponsoring the event he says the goal is to make use of infrastructure that is already built just\nA school system is water sure transportation lines successful neighborhood it to other people\nNew Hampshire formally legalize accessory dwelling units last year protecting them from local regulation Kyle says he was expecting more homeowners describe leasing out parts of their property but so far there has not been a significant change\nThe status chosen granted pathways to operate a new substance use disorder treatment facility for teenagers on the grounds of the new new youth center in Manchester\nThe executive council approved a four year contract with a group on Wednesday was services expected to begin in early November the thirty six bed facility will be open to children ages twelve to Eighteen who are in need of inpatient treatment\nThis the new new center has seen a decline in its operational population as the state reforms its approach to juvenile justice creating the space for a new addition services\nMostly cloudy this afternoon chances some showers possible thunderstorm especially northern parts of the state high temperatures in the lower seventies mostly cloudy this evening some clearing in the overnight lows tonight thirties and northern New Hampshire forties and the rest of the state than a sunny day for tomorrow high temperatures in the lower sixties\nSupport for an age PR comes from you our listeners him from Norris helping New Hampshire businesses schools and organizations by designing and servicing engineered systems for security life safety in communications\nInfo at ... dot com and Hopkins Center for the arts welcoming this things virtual seat chamber orchestra with a program celebrating composers that fought for unity admits conflict October nine ... Dartmouth and dot edu\nIt is twelve o seven and this is an H. P. R.\nAnd this is an HP our fault find Dr we're asking you to support the news you trust and programs you loved by making a contribution now in any amount at N. H. P. I. dot org you can also give us a call one eight\nFour seven seven and just a few minutes we'll get right into here and now the first and then like working with me now is Andrew ...\nYour financial support is the most reliable source of funding for an age we are and how to pay for the programs you love and today\nWhen you contribute Fifteen dollars a month is a stain or we'd like to thank you with the new and H. B. R. T. mug combo it's a handsome combo gray a soft T shirt\nAnd a large red mugs they'll make great additions to your collections um we think of any fears being could've contributors as being trustworthy and love worthy we've included these words on the red mode to share with you you can check them both out at an H. P. R.\nDot org where you can contribute by calling one eight eight eight zero five six four seven seven\nAnd T's and ... are are\nAre all well and good but I'm here to remind everyone that when you make your gift and each ... right now you're going to be entered to win at the grand prize which is a trip of a lifetime for two to your choice of either Australia for New Zealand so that is we're getting that away tomorrow\nAfternoon but you're listening right now maybe you're just\nTaking off for your lunch break now is a perfect time to do that thing you've been meaning to do for a long time become a sustained member of an HP are at an H. P. R. dot org and get yourself entered to win that incredible trip to either Australia or New Zealand again and H. P. R. dot org\nCause a great trip and you don't want to miss out so you'd better go to an H. P. R. dot org become a first time giver become become a member of an HP are because you understand that journalism helped each of us shape our own opinions\nAbout the issues that affect our lives and Public Radio's journalists investigated issues and aren't afraid to ask decision makers the hard questions public radio reporters provide context they provide viewpoints from diverse voices\nAnd public radio is funded by individual listeners just like you give ten or twenty dollars a month whatever fits your budget I'm more than you and when we pull your ten or twenty dollars a month with the turned twenty dollars a month from listeners all over the state we can make this happen may make your gift now it and H. P. R. dot\nUh you know a presidential nominees of both parties have done for over forty years\nAnd so the times said let's try to solve that and it was able to go back and find a number of ways in which you know what they say we're essentially tax Dodgers of of questionable legality including three ... essentially a shell company called the ... county building supply and maintenance which\nFred Trump would buy his equipment from but allow the kids to charge 'em a huge markup of for the equipment\nThat the White House has dismissed this report but hasn't denied any of its claims President Trump called it a hit piece on Twitter where does this go from here\nWell you've seen some interesting action or the New York State Department at the ... of taxation has said that it's going to review a number of the allegations are and and claims made in this article one of the things that makes it so impressive as they include links to all kinds of original documentation so that readers can evaluate for themselves\nYou know the basis on which they're they're making these are reporting a and\nYou know we will see whether or not this becomes an issue as a Democrat so look to find ways to take advantage of the unpopularity of the president's taxes she you could imagine that coming back into play as well but this is a huge blockbuster of a story that takes a lot of time to absorb and to understand\nAnd I think uh you know one real question will be whether or not the Democrats take over the house of representatives and seek to use this as a hammer against the president tried to force or the release of his tax documents do\nYou expect other news organizations will put this kind of energy and effort into stories like this a given the reaction that the New York times has gotten well\nAnd we don't know that they're not uh you know this was something that according to the times has taken effectively Eighteen months and that they had a well over a hundred ... a thousand pages of documents to review to make this happen several top reporters meant a lot of time on this as well as\nEditors and and the other researchers and others on it it's incredible devotion of resources but yes when asked to hope that we're looking at things\nPart of the reason that ... is doing this as as I said those documents weren't released and so it's kind of accountability being performed it's also the kinds of forty one which had been able to be done during the election season voters are interested in this stuff\nThe question is whether it is still lingers in twenty twenty a very interesting insight into our president and the mythology he wrapped himself in France who ran for office David Folkenflik NPR thank you you bet it's here in\nThe news continues on an age PR more here now is coming up in just a moment\nAnd here now in in each PR are your sources for the news you trust and I'm here to remind you that supporters\nUh listeners like you make this programming possible with your voluntary contributions so if you've never made it get to an HP are before this is your chance to make that first time I get it so quick and easy to do at an H. P. R. dot org I'm Emily ... with me now is Taylor ...\nWhen you contribute right now you're going to be entered to in the final\nGive away of this drive you know we've heard the other stuff come and go the prizes they'd been big but this is the really really big one this is the once in a lifetime for for to do either Australia or New Zealand you get to choose if you win but you can't be a winner if you're not entered and H. P. R. dot org\nYou want to do this fast because this is the final hours of the driver got thirty one hours left\nAnd at that point we are giving away this trip so go to the website right now get your\nPR dot org thank you to Sarah in Athens from mine she says I don't live in New Hampshire and I have never lived in New Hampshire but an HP are is nice station of choice whenever I hear these tries I told myself I Can't afford it and now I realize that I Can't not afford to support you will thank you Sarah\nFrom Athens, Vermont thank you to Carolyn in Manchester Katie May in Farmington so many people thousands of people have called are gone on line to do their part to support the news that they trust and now it's your turn as Taylor said when you do you'll be entered to win this grand prize triple the lifetime to either Australia or New Zealand so there is no time like the president\nMake your gets now at an H. P. R. dot org\nCan't not support it I liked that logic there and you know the truth is is that sometimes money's tight sometimes you know you have to think about what you can afford and it takes all manner of gifts here there's folks who give it to five dollars a month level there spoke to give it the leadership circle the one hundred dollars a month level\nIf not necessarily about exactly how much you can afford it's about whether or not you can afford to make this decision and support the public radio station that you listen to so you know go on line go to the website check out the different thank you gifts that's an easy way to figure out what do I want to do here maybe Fifteen dollars a month is right for you\nIf that is then we'll send you this very cool in each pure heart phone tea and mugs combo I'm rather than me tell you about a month to check them out yourself and H. P. R. dot org\nYou know that news happens throughout the day and hearing now is here to react to news events right now as they're happening\nWhether it's plug into your ear buds as you go for your lunchtime locker running a quick couple of errands in the middle of the day you benefit from the work of smart journalists from around the globe this is what public radio is all about and that's why an HP are is worth\nYour support the best way to participate in this great radio is to become a sustaining member at an H. P. R. dot org\nAnd the best thing about journalism like the journalism but we do here at NPR\nIs it's not about just telling you what to think it's about giving you the tools so that you can shape your own educated opinions about the issues that affect our lives Public Radio's journalist investigate the issues they're not afraid to ask the really tough questions they provide context in different viewpoints from a diversity of voices\nPublic radio is funded though by individual listeners like you who gives his five or ten dollars a month\nThat is the most dependable source of funding that we have and it is the most important and that's why it is so critical that you go on line right now and do what you can at N. H. B. R. dot org\nThere are so many reasons to make your gift to an age PR right now you just have to choose the one that speaks to you the most maybe it's that trip that the chance to win a trip of a lifetime to your choice of either Australia or New Zealand we're giving that away tomorrow you're listening now so now it's the best time to give make your sustaining membership gift\nAt N. H. P. R. dot org\n[noise]\nTwelve twenty six good afternoon support for an age PR comes from you our listeners\nAnd from Mac's apples on mammoth wrote in London dairy farm stand and you pick orchard to no open and picking honey Chris ... and other prime varieties information that Mac's apples dot com [noise] from Dana Farber Cancer Institute ringing Dana Farber expertise closer to you Dana Farber dot org slash locations\nAnd from the palace theatre in Manchester presenting are low Guthrie back my popular demand on who's Alice this restaurant or friday October twelve tickets a palace theatre dot org\nWas this afternoon mostly cloudy chances some showers and storms especially in northern parts of the state temperatures in the lower seventies\nIt will be mostly cloudy this evening clearing in the open I low temperatures tonight thirties for the north country forties and the rest of New Hampshire for tomorrow it'll be sunny\nAnd mostly sunny Saturday nor the New Hampshire could have some areas or frost in the morning with high temperatures in the lower sixty [noise]\nThis was on HBO [noise]\nEnding for here and now comes from the listeners of W. B. U. R. Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance\nAvailable at Geico dot com or one eight hundred nine four seven auto\nThis this year in now Stormy Daniels needs very little introduction real name is Stephanie Clifford she's a porn star who claims to have had an affair with President Trump more than ten years ago Trump denies that but did authorize a payment of a hundred and thirty thousand dollars to her to stay quiet about it just a month before the election in twenty sixteen\nTrump's former fixer Michael Cohen pleaded guilty to violating campaign finance law by making that payment will Stormy Daniels has a book out this week called full disclosure she joined me from Beverly Hills to talk about it it is a memoir about more than the night she says she slept with Trump\nEverybody wanted me to write a tell all and I was like I really don't want to do that because you know that doesn't define me of course everybody knows that you know about that at bake you know Ninety seconds and uh back in two thousand six with Trump and I was like I just don't want to write a tell all because it would be a very very short book\nBut then you know I really didn't have an outlet to tell my side of the story obviously I went on sixty minutes and hope to do that or an interview was over three hours but once it was edited down it was only fourteen minutes and some of the really key things that I Want it to express you got cut out everybody knows what happened but nobody really knew how or why\nSo like you people haven't gotten the full picture of who you are\nCorrect and like I said how things transpired and why they happen the way they did and the way things unfold it so I just rushed the book and it was it was just my way of putting having complete control um although you know I'm Still show that people are just going to jump straight to chapter three and I\nDidn't know it might make a joke about that in the book but let's let's start with what you're talking about at the beginning you grew up in Baton Rouge Louisiana you describe a rough childhood your mother would leave you alone for days without food or you say you were repeatedly raped at the age of nine\nAnd you were called the liar when you tried to report that sexual abuse to a guidance counselor what are you were able to know about you and your life that you don't think that they do already know\nUm basically what I just said that I don't want to be defined by one single evening with someone that\nNumber at twenty dollars a month or if you increase your sustaining gift\nTo twenty dollars a month we'll give you a year long New York times digital subscription and then new and H. P. R. T shirt to go with it the facts are important to you and that's why you listen to an H. P. R.\nAnd the New York times is a perfect news companion to your listening plus pitcher yourself reading and listening with a new heart phones T shirt and gray with the ... design on the front you can check it out for yourself at an age PR where as luck would have it you can also make or sustaining gift and H. P. R. dot or\nIn so many of your friends and neighbors have already called during this drive in fact we we get the list of names and comments and it reads like a map of the state we've got Lindsey from and field who says\nAnd he's pure as honest trustworthy news Tracy from New fields honest reliable news Scott from Manchester\nGreat source for news and entertainment Jason from Miramax unit Eunice from Lebanon so many different folks their contributions to gather with yours and other listeners provide ongoing using programs just like this so pleased joined them now have your voice heard and make your contribution at an H. P. R. dot org\nThat's right thank you to everyone has done their part to support and H. P. R. during this fall fund drive and especially thank you to cells pizza located at ... street in Concord for donating lunch today we can't do it without you ... it in an effort here and we need the pizza\nAnd um and so if you need another reason to make you get down each PR right now I Do want to remind everyone that there is that grand prize looming we're giving it away tomorrow a trip of a lifetime for two it's nine days eight nights to either your choice of Australia or New Zealand how incredible would that be\nI Know if I was recently re watching the fellowship of the ring like a nerd and [laughter]\nAnd I go to New Zealand looks amazing it looks like the most amazing place on earth\nIt really does and the hot it's there and you know that the hobbit bill is actually like a place\nYeah it's a place that you can actually it's a tourist area and\nThrow it in ... than again but anyway you make that choice it's a tough decision but you won't be making any choices unless you have your name into the running to win the strong so you're listening now maybe you're wrapping up your lunch break now it's the perfect time to go to an H. P. R. dot org\nAnd of course we do these great give away as we do drawings and we have to thank you gifts but really what you're supporting is the news that you actually listen to every day and age bureau stick in a newsroom wide approach to covering some of the really important issues in New Hampshire for example the opioid epidemic um we've seen a lot of\nCoverage on MORNING EDITION from all the reporters who work really hard to try and figure out how to tell these stories how to make sure the information is out there that is what you're supporting with your financial gift when you go to an H. P. R. dot org\nActually listen to every day one eight eight eight eight zero five six four seven so if you've never given the four please know that an H. P. R. was here for you because someone else\nWants to that first step from being a listener to being a number today is your day today's your data you step out to do that thing that you've been meaning to do for so\nMany years it's so quick and easy to do when you go on line and H. P. R. dot org and you can also give us a call at one\nEight eight eight eight zero five six four seven seven and thanks\nIt is twelve forty three good afternoon support for an age ... comes from you our listeners and from University of New Hampshire in Manchester hosting open house on October twenty to explore campus in degree programs detailed in Manchester daughter UNH dot edu slash open house\nFrom Maine event entertainment hosting a bridal show at the castles and on October seventeenth bridal fashions floors photographers honeymoons and more information that a main event dot com\nAnd from Concord regional visiting nurse association providing hospice where people of all ages or terminally ill and bereavement and grief support for the families see RV an aide auto board\nFor this afternoon mostly cloudy a chance of some shower responsible thunderstorm especially in northern parts of the state high temperatures in the lower seventies it'll be mostly cloudy this evening clearing often the overnight low temperatures tonight thirties for northern New Hampshire forties and the rest of the state sunshine tomorrow mud temperatures in the lower sixties this is an H PR\nFunding for here and now comes from the listeners have W. B. U. R. Boston with a program is produced and your NPR station\nFrom home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd NPR and MORNING EDITION on this station tomorrow morning what happened while you were sleeping and the news interviews and analysis for\nThe day ahead national international and local news tomorrow on MORNING edition\nWell let's take a break from the news now for another edition of the hearing now DJ sessions near does [noise]\n\n[noise]\nJoining us today the original DJ from the hearing now DJ sessions Travis welcome at KCRW in Santa Monica I Try this fellow Jeremy great to be back ... to ... how have you been it's been so long since we've talked to you\nI Know I like ever since the last time we spoke and or at least since the last time I've been to this NPR studio they've completely redone it oh wow it's okay but the music will still\nBe incredible because it's coming from you this is the first one polo intend to French DJ's this is their song [noise]\n[noise]\n[noise]\n[noise]\n\nSo they're saying they're sweet them why suited us young which is following me under the ocean and tell us about this one [noise]\nKnow this album ... by polo and pan it came out\nThis year in the states with five additional tracks and that's when it sort of came on to my radar\nUm it's got very tropical kind of\nFeel that route the album um and I know we're in the fall now but it's been a while since I spoke to you so I just wanted to catch everybody our I'm classic ... this this is the sound of the summer I um it'll you still use the next summer too but when I'm screening albums to looking for stuff to play on my show if I can find\nThree or four songs on an album I'm really happy and that's what I consider that to be a good album or just care about album though has Seventeen tracks and I think I've played something like fourteen of them on my show already\nSo basically like every every track on this album is great and that is like an unheard ratio for for my show to be\nInto that many of the songs but there's so many different looks I mean they have\nHave like some songs inspired by Brazilians some but there's some daytime disco system club ready house cut some ambient songs that kind of run the whole gamut and what would you say is the ... overall\nI Would say sort of like tropical electronic I mean I Would say you know they've definitely got an ear for pop\n'em but it definitely is more electronic driven and or if I were to Johnny comparisons between other bans I Would say it's sort of like disclosure meets poolside\nOh I like that that's great we have poolside on the show actually they're great um yeah let's listen to the next one you brought up this is the Swedish group ... boys are this is called sport [noise]\nTell us what's going on here\nYou know what I Am not completely without going on but I've seen a couple of different interpretations of this particular song and some people they're saying it's a commentary on male hyper masculinity\nUm when I first heard it I just thought it was a really goofy fun track 'em and it's one of those songs like it reminds me when I was a little kid I wasn't allowed to watch Miami Vice before\nI went to sleep as they would give me a way to fire it up before bed\nAnd this song so that has the same effect on me every time I hear it\nAnd obviously funny would you say it's like a good listen to do you like to listen to\nThis song is an unbelievably find lists and yet I mean like just after the after you get through the hook the first time you'll be you'll be chanting the hook on your own the second time it comes around and every other time as the sun moves on to become the belief singers bashing Murphy becomes more and more ...\nUm until it via basically just a blob puddle um [noise] what people can\nPeople can go on our website and listen to the entire thing it here now I Hope that I really hope they do okay or the next one is from Ireland uh this is a maverick saber who just released this new songs drifting appear to [noise]\nFrom flying monkey performance center presenting a night of laughter with political satire troops the Capitol Steps on Saturday October thirteenth tickets that flying monkey an H. dot com and I'm from the valley in Middleton building supply providing ten styles or sheds nine styles of garages\nAll available for installation at home site information that low valleys dot com [noise]\nMostly cloudy this afternoon with a chance of showers maybe a thunderstorm especially in the north of New Hampshire high temperatures today in the lower seventies it'll be mostly cloudy this evening clearing in the overnight most temperatures tonight in the thirties for the north country for to use and the rest of the state [noise]\nThese are the stations of New Hampshire public radio W. E. Z. O. conquered eighty nine point one W.\nE. V. S. Nashua eighty eight points three W. H. I. V. H. Hanover Ninety One point three\nW E being keen Ninety point seven W ... one of those seven point one\nW. E. D. J. Jackson Ninety nine point five W E s ... Ninety point three and W. E. V. cute little in Ninety One point nine in online an H. B. R. dot org\nLive from NPR News in Washington I'm Louise skills on the White House says it's staying in close contact with senators who may still be on the fence about Supreme Court nominee Brett Kavanaugh actually are Scott Horsley reports Kavanaugh faces a key procedural vote in the Senate tomorrow\nThe FBI has completed its follow up background check on Kavanaugh both the White House and senators are now reviewing those findings some people who knew coming out in high school and college complain they weren't interviewed by the FBI about allegations that nominee sexually assaulted women while drunk\nWhile spokesman Raj Shah says agents did what they were asked to do\nWhat critics want is a never ending fishing expedition in highschool drink that's not what the senators were question that's not where this investigations go went I went to serious allegations and tried to corroborate them with\nSupport for HP eyes live stream comes from you our listeners and from castle in the clouds Milton burl experienced\nThe beauty of autumn in New Hampshire from high up on the castle on ... states what a trails or taking colorful views while dining on the terrorists open deli through October twenty first castle in the clouds dot org report\nDoes not support allegations against Kavanaugh\nOr\nFor worse\nHe did not say how he'd vote the alleged shooter of seven police officers in Florence South Carolina has been identified as a disabled veteran South Carolina Public Radio's Todd Underwood has more\nAccording to records from the south Carolina Supreme Court and his two thousand divorce case\nSeventy four year old Frederick Hawkins was injured in the Vietnam War and we're receiving disability payments a lawyer admitted to the south Carolina bar in Nineteen eighty\nHe was later this board Hawkins is accused of killing a police officer in winning six others in a standoff involving officers attempt to serve a warrant on another person at Hopkins home Hopkins was charged in two thousand fourteen with disorderly conduct\nAnd later with a fence is related to not restraining his animals of Florence county deputy reports the Hopkins was hospitalized with a head injury\nAnd is unable to speak with authorities for NPR News I'm ... Underwood in Columbia South Carolina\nThe Justice Department is charging seven Russian military intelligence officials with conspiracy to hack computers instilled data focused on international anti doping agency's\nThat's already said the effort meant to de legitimize anti doping organizations and expose officials to rebuild a Russian state sponsored athletes doping program\nScott Brady is us attorney for the western district in Pennsylvania\nThat she didn't they got caught they were banned from the Olympics they were mad and they retaliated and in retaliating they broke the law so they are criminals\nThe gallows down to a lady fine this is NPR\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more ed Raymond James dot com\nSport for any age PR comes from you our listeners and from ... trust in the state attorneys in Bedford pleased to announce out attorney west Davis has joined the for him as an associate on the Web at a an F. E. L. L. P. A. dot com\nAnd I'm from ... retreats children's inpatient psychiatric programs serving young people ages four to twelve learn more and bread or retreat and auto hoard it is one oh form this is an H\nPR [noise] Hi I'm Taylor going to be here with Emily quirk and uh don't go anywhere 'cause we've got more here now coming up with just a few minutes we're going to hear more updates about Supreme Court nominee Brett Kavanaugh's or impending vote\nTo see if he's going to be confirmed to the Supreme Court more on that story coming up and just a few minutes right now we're asking you to help pay for here now and all of the programs that you listen to each and every day\nSo give to this Dr we've got some exciting things coming up right now give an H. P. R. dot org and Emily what's going on\nHave a quite a big thing going on and we're giving away this incredible trip it's we're giving it away tomorrow\nBut it's a grant the grand prize of this drawing a trip of a lifetime to the winners choice of either Australia or New Zealand we're giving that away tomorrow at seven P. M. um but you don't want them is your chance you don't want to put this off because if you do get so it's going to happen and you're not going to be entered when ... you're going to completely forget\nAnd then you're going to be realizing that somebody else when your trip when it could have been ... so there is no time to present to support\nTo do at an H. P. R. dot org do it\nBecause he loved the programs do it because of the trip to do it because of the thank you gifts due because there's a sense of social responsibility that comes with listening to NPR\nUm you know many members tell us that they think of the station is a shared community resource so the reason that somebody might give is to make sure that their friends and neighbors who either can't afford to or just haven't quite gotten to that point so that they still have access\nTo an age PR we provide a really valuable service uh there's information in the form of our newscast really just what's happening out there in the world or in your region\nAnd then there's the contacts how to understand the news\nBetter as a shared community resource it really means something to step up and contribute to an HP are when you know there are so many people that listen but aren't quite there yet so do your part now at N. H. P. R. dot org\nIt is a community resource and it's a community effort to keep the going and we thank each and every single person who has done their part\nTo a ... to call in or to go on line to an H. P. R. dot org and I really truly love reading the comments that people leave for us while they're making their gifts this one's really nice ones from Christopher and national he says\nAnd HBO or has been a great help\nAnd helping him feel at home as a new president of the Granite State keep up the excellent work and thanks for all you do to keep the free press free welcome Christopher I Know this is a wonderful nagging keen\nOn an H. P. R. feels like home to me when I went off to college in a major us city and lived there after I chose to listen to an H. P. R. every morning\nAnd no matter where I go I Know I can always have a little piece of New Hampshire with me were always pulling in the ex pats that's right that's right and so new people come in and people leaving but they have an H. P. R. and comment\nAnd we want you to be next to want you to support your public radio station whether you've been here for a few months or whether you grew up here and maybe you're listening across the country ... we'd like your support to the best way to give an H. P. R. dot org\nContributed Fifteen dollars a month and we will send you the tool to coolest pieces of swag for this Dr we've got a muggy and a T shirt they've got this really great design on it I'm\nSo sort of like a headphone shape a over you know a heart so looks like the hearts listening to headphones so I get it you know I mean you you kind of have to see it to understand what it looks like so just had to the website check it out and you can make your gift they're Fifteen dollars a month gets you both at an H. P. R. dot\nOrg and it's true it's a really ... we began handling and all day it's very soft it's very well made and I think you'd look great in it so you can check it out as a tailor said on line and H. P. R. dot org it's time to do your part and become a first time contributor if you've never taken that leap before joined the thousands of people\nOf every color and create who support public radio here in the Granite State many givers ah contribute five ten maybe Fifteen dollars a month as their first ever get the process takes\nTwo minutes of your time so you can contribute now at an age PR dot org\nBig thanks to everybody who's already given during this Dr also thank you uh to south pizza located ... eighty store street in Concord New Hampshire for donating our lunch today my belly is feeling much fuller than it was twenty minutes ago so thank you so much for that\nUm don't forget we've still got this big trip going on it's the triple the lifetime a choice of either Australia or New Zealand if you win a ton of a hard thing to choose but I think of all the choices that you have to make in your life that would be one of the best you could possibly have\nSo call now or go on line get energy wind before we get to the weekend before you run out of time before you forget about it and\nH. P. R. dot org is the easiest place to do it but you can also call one eight eight eight eight zero five six four seven seven and thanks\nNPR WB you are I'm Robyn Young I'm Jeremy ... and it's here and now it is a day of fast moving developments in Washington where senators are reviewing the U.S\nA a invited a speaker that China was not in favor of so there was some discussion here of cyber attacks yeah\nLook at to examine speech very briefly then vice president reached out to China do you think Beijing how will Beijing react very briefly\nI think Beijing is\nConcerned about the aggressive posture that this administration has taken towards China whether we're talking about militarily whether we're talking about the trade posture [noise] uh and I think the sort of rhetorical open hand the fence extended will be overshadowed by the much more aggressive told me the most of his speech\nAnd hearing his ... Scott Horsley thank you You're welcome teaching [noise]\nJournalists and America have always face challenges and today we face some new ones but we remained steadfast and our duty as journalists because we work for you I'm Ari Shapiro host of all things\nConsidered an everyday our job is to bring you vetted verified information to ferret out the facts and ask tough questions\nYou can support your local journalists here in New Hampshire and the NPR reporters across the country and around the world\nWhen you become a sustaining member of an H. P. R. today support your journalist and help keep the station fiercely independent here's how\nTo end H. P. R. dot org and this is an each PR fall fund drive and we'd like to hear from you next did you never made that uh you don't vote of support a to an HP are before this is your time and a hearing now continues in just a few minutes and ...\nLead author Daniel nice and about his new book winter soldier it's a vivid historical fiction about a privileged twenty two year old medical student he was deployed to the front lines\nTo tend to the wounded during World War one um I don't know about you but I Love historical fiction and I'm looking forward to that interview I don't want to miss it so take one minute right now to do your part to support and H. P. R. at an H. P. R. dot org I normally work and with me now is Taylor lending\nHere now that the show they were listening to it's real collaborative effort\nOr every day hosting producers of WB you are in Boston there working with reporters base that NPR stations across the country like an HP are so you'll often hear some of the national correspondents on their show and then of course you know you've heard here now broadcast from an HBO studios and speak to an HBO reporters here\nAt times like uh the the primary the first in the nation primary\nThis collaboration it also extends to listeners like you your financial support of our station helps our reporters produce stories for hearing now for the network and helps the network in here now stories come here to an age PR your support is so important and that's why it's time to act\nAnd H. P. R. dot org is the easiest way to contribute you\nWhen you become an H ... you'll never need to worry about when your support and once you set it up it stays up to date no more wondering no more renewal notices in the mail\nAnd you can make changes anytime you want think about how much ... worth you just pick the monthly amount that feels good and then just go to an H. P. R. dot org to give and when you choose to be as his dinner you'll get special access to our pledge free strain\nWhich gives you the ability to listen to an HBO or without hearing the pledge breaks like the one you're hearing right now so the best way to make that get go online to an H. P. R. dot org\nAnd HBO coverage of issues of topics\nIt connects you to your community by introducing you to people places events that you just might not have realized a ride around you and one of the ways that we've been doing that especially in these past few years is through our podcast so you might have heard something wild over the years it's actually been on for I think Twenty years now\nUm but it's also available via podcasts and it takes you to so many interesting little places around the state\nGet to learn about hum interesting ecosystems animals Fisher cats all sorts of crazy stuff\nWord of mouth for example another show that also available via pod cast gets all over the state sort of weird nooks and crannies when you become a sustaining member that's what you're supporting your supporting the shows you're supporting the podcast you're supporting the website all of it is thanks to you so do support it now if you haven't already at an age P. R. dot org\nAnd again you'll be entered to win this trip of a lifetime to your choice of either Australia or New Zealand when you make your guest right now or before tomorrow evening at seven that's when we're picking the lucky winner\nAnd so far we've heard from about twelve hundred listeners from across New Hampshire who have said yeah I I Want in doing it yeah exactly I Want to support public radio\nAnd I want a chance to win this insane trip and you can too but you do have to act now you can call us at one eight eight eight\nEight zero five six four seven seven or just go on line it's so quick and easy to do an H. P. R. dot org\nAnd for listeners who are able to support the station at a hundred dollars a month or twelve hundred dollars in a one time gift we're very excited to offer a pair of VIP tickets to see NPR's host of one a structural Johnson is going to be in conquered on October uh on October Eighteenth\nSo support an HP argue that premium seeding pose a special invitation to a small reception after the show um it's it's an amazing way of saying thanks and and and I'm doing your part to support the public radio listening that you do do do that now at an H. B. R. dot org when you do you'll be entered to win\n... or Australia you get to choose if you win but of course you've got to get entered now and H. P. R. dot org or one eight eight eight eight zero five six or seven seven\nIt's one twenty five good afternoon support for an H. P. R. comes from you our listeners\nAnd I'm from ... community services announcing the opening of their new thrift store in Lebanon accepting donations of clothing furniture\nHousewares and more lifting community services dog call from the Rudy group serving successful families and businesses with sophisticated planning an investment management for over thirty five years have UPS financial services member fender acidic\nAm from ... states whereas ferns are set up resenting the music of Tom Waits with Vicki Christina Barcelona on October fifth information at Keenan dot edu slash arts slash Redfern [noise]\nMostly cloudy this afternoon chances some showers maybe a passing thunderstorm especially in northern areas of the state high temperatures today in the lower seventies\nIt'll be mostly cloudy this evening than clearing and the overnight with low temperatures tonight in the thirties and nor the New Hampshire forties for the rest of the state for tomorrow Sonny Bono temperatures in the lower sixties it'll be mostly sunny Saturday nor the New Hampshire could have some areas of frost in the morning eyes on Saturday in the lower sixties\nThis is an H PR for here and now comes from the listeners of WB or Boston and math works creators of Matt lab and simulate software for technical computing and model based designed math works accelerating the pace of discovery in engineering and science learn more at math works dot\nCom\nIt's here and now at its most basic Daniel ... new novel the winter soldiers powerfully vivid historical fiction about a privilege twenty two year old sign of a Viennese family a barely train medical student applied to the front during World War one to tend the wounded and it does move field station and the ... mountains\nBut that's only a fraction of this glorious novel from the author of the piano tonight [noise]\nYes it takes readers from imperial Vienna to the frozen front into the horrors of war maggot infested ... starvation\nIt's also about the nascent field of medicine about the psychiatric toll of war on soldiers but we now understand is pie TST Daniel Mason is a physician and it shows\nAnd it's a romance with shades of doctor Zhivago end up moment in history when people could be separated in an instant with little hope of ever find each other again Denny Mason changes from ... in San Francisco welcome and congratulations\nThank you it's wonderful to be on the show well how did you come to this story this time in history it began as a very different different novel I'm a psychiatrist and I was very interested in this period psychiatric history in the Nineteen twenties and was writing about a psychiatrist at that time\nAnd I thought that this character of course needed a back story and that most doctors that time and have a ... that involved the first World War\nAnd so I began to read about the medical experience in the first World War and\nAs I was reading that I began to encounter this anecdote of how the ... army was so Eli prepared that\nThey began to recruit a medical students sometimes a dentist and unfettered Erin's to serve very important roles and feel hospitals on the front tending to a massive numbers of men\nAnd this was at a time when I had recently finished medical school\nAnd all of a sudden to imagine this colleague across time hundred years ago leaving his medical training and being asked to perform a medical responsibilities that he was on credit for something that that resonated with me and the place I was in at that time\nWell and he he's issued an army issued medical manual that offers advice are building latrines soothing\nMoral instructions a soldier who misses the comforts of his wife and what happens when he gets there is he hears about Louis that might be teeming with maggots just horrifying and churning clumps they teens they stirred like embers these are life as well on every last clothing and every stitch and seen\nThat came out upon our comes grainy like wet meal [laughter] it's just\nAnd in the world of fundraising for public broadcasting we've taken a lot of steps to make sure that the money is separated from the news and how it's covered the news department its its independence is fiercely guarded and your contribution large or small is treated with the same respect\nEvery contribution supports the fact based thoroughly researched balanced fair journalism that you have come to expect of an HBO are\nFive or ten dollars a month it supports the news and it says that this station has a meaningful place in your life in in the life of our community so please if you haven't announced the time to make your first ever gift to an age PR it's super easy to do will send you some thank you gifts check it out at an HBO dot org\nAnd we know that many of you are already sustaining members and if you already are one thank you so much for your support if you've been at the same level for really long time in ... consider that increasing your monthly gift by a few dollars if you've been at that ten or Fifteen dollar month level\nMaybe joined it for or or or increase your level to twenty dollars a month and it helps pay for the NPR News for the news from around New Hampshire\nYour gift means a lot especially since you and numbers like you provided the most important share of the money that pays for everything you hear and when you join at that twenty dollar a month level you can\nLove worthy read mug you can increase your get now at an H. P. R. dot org\nAnd also a big Thanks This house pizza located at ... street in Concord New Hampshire for donating lunch today\nYou're listening to hear now this is one of those shows that over the course of two hours is going to cover the breaking news it's going to talk about what's literally happening right now the sorts of stories that are on the front page of every Web sites but you're also going to get music you're going to get a conversations with authors and musicians\nYou're going to get those maybe back of the um what is the bottom of the fold stories you know the sorts of stories that sometimes you don't hear about because the breaking news is so loud and\nAnd constant um that's what you get from a a a program like this as you get a real plate you know you get the vegetables you get the fruits you get them the protein you get all these different things\nAnd and it's what makes us listening experience so good is that it's not just one thing it's everything well balanced meal that is why in the afternoon we hold on all things considered enough some things considered but that's where you're supporting that kind of programming in context it's really important so you should support it at an HP are dead or\nThere are so many reasons to contribute to an HP are right now but if you need a an added incentive I have one for you we are getting away uh our grand prize is a trip of a lifetime for ... the winters choice of either Australia or New Zealand were given that away tomorrow at seven PM like you're listening now\nSo if you wait you might forget and is your chance don't miss your chance get yourself enter do when it's so quick and easy to do at an H. P. R. dot org you can also call if you'd like to speak to a human one eight eight eight eight zero five six four seven seven\nWith so many news sources available it's important to know where to find news with contacts news that you can trust and that is why you come\nTo New Hampshire public radio you get the news cast of the top of the hour to get local information from the folks and reporters in our newsroom and you get the national and international context you need to be able to Wade through all the information that comes out you these days\nThat's where you're supporting when you go to an H. P. R. dot org you'll also be entered when this great trip so don't delay again the website is an H. P. R. dot org and thinks\nIt is one forty three and good afternoon support for an age ... comes from you our listeners\nAnd from careers leather furniture featuring American leather convert sleepers with solid platforms for even support\nNo bars no springs and no sagging would use couriers Laverne dot com from Harvard Toyota and nothing with a new two thousand Eighteen Camry with category and inspired accents and ... available to test drive\nDirections at Harvard Toyota dot com\nAnd from the colonial theater in king presenting Tommy Emanuel's Saturday October Thirteen tickets out the colonial dot org\nFor the rest of this afternoon mostly cloudy a chance of some showers maybe a thunderstorm especially in northern parts of the state high temperatures and the lower seventies mostly cloudy this evening clearing in the overnight with low temperatures thirties for nor the New Hampshire forties and the rest of the state for tomorrow sunny multiply temperatures in the lower sixty [noise]\nThis is an HP are\nFunding for here and now comes from the listeners of WB or Boston and your NPR station\nStaples with printers printer ink on toner cartridges for home in business and in store print shops for customized presentations booklets and manuals\nMore at staples stores or staples dot com staples and NPR and MORNING EDITION on this station tomorrow morning what happened while you were sleeping and the news interviews and analysis for the day I had national international and local news tomorrow on MORNING edition\nThis year and now retailers prepping for the holidays got some good news this week the national Retail Federation expects holiday spending to increase\nKind of meat but there's a downside the low unemployment rate will make it very hard for stores to find seasonal workers\n... senior innovation reporter at W. B. or he joins us now I call them hijacking and tell us more about how much people are supposed to spend this year how much they're expected to spend this year and how that lines up with pastures so the projection is about seven hundred and twenty billion dollars in November and December and that excludes\nCars and gas and spending at restaurants are really just sort of those gifts around the holidays that would be about thirty billion dollars more than last year and just for perspective a spending usually does grow year over year but the average growth rate in recent years has been about three point nine percent so somewhere between four and five would be above average\nAnd how does that line up with the fact that we've talked about mall vacancies being at high levels are about big department stores having problems like Macy's\nRight so the trend is undeniable I'm In Cyber Monday last year was the biggest online shopping day in history and meanwhile the foot traffic in brick and mortar stores on Black Friday was down by two percent so I think the overall spending increased can help the retailers to do both and I think one really interesting experiment this year\nIs way fair the online furniture retail or they are experimenting with temporary\nBrick and mortar locations in those shopping malls but interestingly they will just be showrooms you can actually buy them there you see them in the physical space in that order online\nIs is the ... model of where you can go and try things on but you have to actually go on line to buy it um what about this idea that it's hard for these places to attract seasonal workers\nQuite so we just saw a Amazon a couple of days so that could increase minimum pay the Fifteen dollars an hour\nAnd that increasing it looks like it will be the norm this holiday season the market research firm weak field of research published a survey last week about a thousand retailers and report the average hourly wage this holiday season is going to be Fifteen dollars and forty cents and that's a big jump from an average of eleven and Seventy cents last year\nAnd the minimum wage just about seven dollars an hour a nationally what about the trade war and terrorists is that going to have an impact on how much we're spending on\nGifts could other Retail Federation says it's concerned about those tariffs has an estimated what the overall impact will be but of course we've been hearing for months from businesses saying that the ... of the tariffs are especially on Chinese imports could make their costs go up and therefore they would have to pass those along to consumers\nOne more thing account big economic news today and probably driving the markets lower today is that we found that the yield on ten year treasury notes US government bonds reached its highest level since ... eleven what's going on\nHere right so it was up to about three point two percent that's the highest since uh two thousand eleven as you said this is another sign of confidence in the U.S economy hard to know exactly what goes on in investors' minds but of course they're weighing the risks versus reward and the treasury notes considered very\nSafe investment that's why the interest rate is typically lower than what you might be able to get in the riskier stock market but if that interest rate takes up a little bit maybe people don't want to take so much risk in the stock market\nAnd maybe mortgage rates in other things also start to take off even more ... of WB or thank you so much to be with you\nWell as we heard earlier vice president Mike Pence took a hard line on China today including stand on Taiwan saying ... administration will continue to respect a one China policy Taiwan to embrace it democracy shows a better path for all of the Chinese people\nKind of questions is Taiwan is part of its territory and actively works to isolate it gets ...\nAnd that power struggle is playing out in an unlikely region only Seventeen countries in the world still recognized Taiwan including several in Latin America\nIt's the talk of our continuing series on Chinese expanding rolling around\nNPR's Carrie Kahn reports on a small employer region of Latin America increasingly embroiled in Asia is diplomatic tool\nEarlier this summer ... president seminars and to set in went on national television and said the word\nThere's only ... percent for ... the only legitimate representation of China is the People's Republic of China said send just sit in Taiwan he added is in in ... part of China\nWith Adam Salvador moved over to the Chinese side of the diplomatic scorecard further isolating Taiwan internationally and opening itself up to trade and much thought after foreign investment with the world's second biggest economy\nChinese foreign minister Wang Yi praised El Salvador for what he described as it's unconditional adherence to the one China principle that Taiwan is part of the mainland and not a separate democratic country China will not recognize or do business with countries that have relations with Taiwan ...\nThis is the right choice and conforms to international norms and trends of the time said long", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Keene", "day": "04"}