{"month": "10", "state": "NH", "station": "WEVN", "content": "And thinking and really appreciates that were the only station in the region that airs want to every morning so Marshall in your field California if you can hear me thank you very much\nAre we heard from folks obviously across New Hampshire Richard unstructured Virginia impending cook Sarah and wall poll everybody's coming together pleased joined the enjoying them support an HP are with your monthly contribution as little as five or ten dollars a month makes a world of difference and sign up and H. P. R. dot org and thanks for your support\nIt is twelve noon here right now is coming up next to Ron in age PR were support comes from you our listeners him from Dana Farber Cancer Institute bringing Dana Farber expertise closer to you I'm Dana Farber dot org slash locations\nAnd from careers leather furniture featuring American mother comfort sleepers with solid platforms for an even support no bars no springs and no sagging would use careers leather dot com\nThese are the stations of New Hampshire public radio W ... conquered eighty nine point one W abs Nashua eighty eight point three W. E. D. H. Hanover Ninety One point three to ... end keen Ninety point seven W ... one of seven point one W E v\nJ Jackson Ninety nine point five\nOr ... Colbert Ninety point through and W. E. B. Q. little ten Ninety One point nine and online at an H. P. R. dot org\nLive from NPR News in Washington I'm Laurie London a number of people have now been interviewed as part of the FBI's reopened background investigation of Supreme Court nominee Brett Kavanaugh and Paris camera Keith reports Senate majority leader Mitch McConnell plans to move forward with a confirmation vote this week\nFBI investigators have spoken with mark judge the Kavanaugh friend from high school who Christine Blasey Ford said was in the room when she alleges Kavanaugh sexually assaulted her Leyland Kaiser who was friends with Ford in high school\nHas been interviewed as well and Deborah Ramirez who says cabinet exposed himself to her at a drunken party at Yale\nHas also spoken to the FBI a source familiar with the matter told NPR's Ryan Lucas that she gave investigators more than a dozen names of people she says we're either I witnesses or who heard about it at the time\nCabinet strenuously denies all these allegations camera Keith NPR News\nSenator Bernie Sanders a longtime critic of Amazon over its pay pie kisses is praying that company for announcing it will raise wages for hundreds of thousands of workers Amazon announcing today that it will increase its minimum wage for all employees to Fifteen dollars an hour starting November first\nAmazon's senior vice president Dave Clark says he hopes others will follow their lead\nWe certainly hope that we're able to employ a Congress and to move forward with an increase in the federal minimum wage will thorough for other large employers to the ball and increase their minimum wages as well\nThey made the move because they think the national minimum wage of seven twenty five is too low and Clark says this increase will have a significant impact on Amazon employees and their families Amazon is one of NPR's financial supporters\nIn Germany chancellor ongoing Merkel's government says agreed on the details of a proposed new immigration law that's modeled on the Canadian system as may Nicholson reports the law intends to make it easier for skilled workers to get visas while preventing immigration for those who are unskilled\nThe proposed legislation removes ... highly qualified known emu citizens with Jim and language skills the bill is a response to Gemini skilled labor shortage and the potential problems it poses to the public pension system\nPreference to Jen and citizens when recruiting and jamming speaking foreign graduates will be entitled to a six month FISA to look for what if they can prove that they have the financial means to support the job such the government says the needle aims to regulate economic integration and has no bearing on assigned them\nAs may Nicholson reporting on Wall street stocks rallied for a second day the Gallup a hundred and twenty three points this is NPR\nSupport for NPR comes from ... am committed to a changing lives through math by building math achievements problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations Matt ... dot com slash NPR\nThis is an HP our News I'm Dan Kogan good afternoon New Hampshire environmental officials ordering the installation of the air pollution controls at a company blamed for releasing toxic chemicals into the groundwater near its facility and Miramax\nOfficials say single game plastics is still releasing small amounts of pee fast from it smokestacks which could be contributing to local groundwater contamination\nThe company has been working with the regulator for two years from the notification requires a company to investigate and apply for a permit to install air pollution controls\nA state law that went into effect last month authorizes the state to require controls for era admissions of certain ... compounds that impact soil and water\nArizona Senator Jeff flake says he would vote against judge Brett Kavanaugh if an FBI investigation revealed he had lied under oath\nFlake spoke at St ... college in Monday Night he's a key vote in the Senate confirmation of Kavanaugh to the Supreme Court last week flakes helped forcing it expanded FBI investigation of assault allegations against Kavanaugh\nEvidence comes back robbery or seeing for story then all of us were that's why we're doing the investigation so but I have an open mind on this\nFlight says the FBI investigation should only stick to what he calls credible and current allegations\n\nSupport for an age PR comes from you our listeners and support also comes to us from ... in furniture show rooms in Amherst Keenan Wynn tuned in Massachusetts offering personal consultation more wind in furniture dot com\nAnd I'm from Raleigh super ruined conquered a local family run business serving the needs of central New Hampshire a super owners and buyers for over twenty four years\nDetails said Riley super ... dot com cloudy for this afternoon showers possible uh thunderstorms this afternoon some of those storms could have heavy rainfall high temperatures in the fifties\nIt'll be cloudy tonight some showers and possible thunderstorms some of the storms again could have some heavy rainfall low temperatures tonight upper forties to lower fifties for tomorrow and partly to mostly cloudy with high temperatures in the sixties\nIt is twelve oh six and this is an HP our news\nWow sounds like the weather's going to get better towards the end of the week and I can't wait for that we're going to take a quick break here before we joined back here and now I'm to check in with our member Dr you're listening to NPR right now to get up to date on what's happening in our world you know that any ... the dependable source of local national and international news\nAnd I'm here to remind you that listeners you our listeners are in each parents most dependable source of funding so today during our friend for asking you to contribute in any amount to help pay for the new do you trust and the programs do you live give to your checking account or your credit card at an H. P. R. dot org and breed a green and with me here is\nValerie argenbright yeah good afternoon did you know that your gift right now to an H A n H. P. R. puts you in the running to win to Southwest Airlines one thousand dollar gift cards and I think of all the place\nYour chance to go on somebody else's dime the best way to give is on line through your checking account or credit card five or ten dollars a month works you can give us a sustained her and you are automatically entered into the drawing for though once in a lifetime trip for to\nTo the winters choice of Australia or New Zealand\nGet it to Southwest Airlines one thousand dollar gift cards plus you could also when a trip to Australia or New Zealand to all you have to do is give the New Hampshire public radio and H. P. R. dot org\nYou can join Cynthia in Amherst she says any fear helped her keep her sanity in this crazed world well me too I think um you can learn and Marie and son cooked she says it's my main news source and she loves them off to Allison conquered says it wakes me up every day\nSometimes it does to me to tell you that I'm joined them join us become a member today at N. H. P. R. dot org you\nKnow think about this you don't listen to New Hampshire public radio just once a year you listen year round day in and day out now you can give the way you listened by becoming a sustained or you make small ongoing monthly contributions for as long as you wish it's convenient and\nEasy to do it also makes a world of difference for New Hampshire public radio by enabling more of your contribution to go directly to programs here on an age PR and as the state or you can enjoy the benefit of choosing a thank you give to annually get through your checking account or credit card on line and H. P. R. dot org\nThat's right and this Dr we are offering some really great thank you gift if you become a sustain or like Valerie was saying at twenty dollars a month or if you increase your seceding membership whatever it is now to twenty dollars a month\nWe'll give you a year long New York times digital subscription and you'll get the new HP our T shirt to go with it if you already have a digital ... subscription to the New York times\nMaybe you could give it as a gift to become a your friend's favorite friend\nSo the facts are important to you and that's why you listen to an HP are the New York times is a perfect news companion to go along with that listening with that listening\nPlus you can put yourself reading and listening with a new ... with the new ... heart phone T shirt it's gray with a really fun to sign on the front it's a robin's egg blue heart with headphones so good at each pair that or to contribute or call one eight eight eight eight oh five six four seven seven\nWill they be doing serious science or they could be having cats chase a little bit more\nOkay one of the things that's interesting about this prize this year is that one of the winners is a woman that would be done Strickland a of Canada this is the first woman to win the Nobel Prize\nIn physics in fifty five years by the way they've only been to the first one was Marie Curie back in Nineteen oh three\nYeah so the second was Maria goal for mayor ah in fact our society the American Physical Society is going to honor her a later this month a at Argonne National laboratory where she did a lot of the work\nThe ... I think the Nobel Committee is increasingly sensitive as is the entire scientific community about looking very very broadly about who actually contributed\nTo inventions or scientific discoveries when they award these prizes and I think that's a terrific thing and this year I think they got it right\nLast year the Nobel Prize in physics went to three scientists who helped recognize the detection of gravitational waves are in space this year as you said it's for work using light what does it tell you about the research that's going on physics today\nWell interestingly of course the tool that we use to measure the gravitational waves\nUses lasers as the sensitive element to detect the gravity wave so there's some commonality and the two years\nUm one way of looking at it is that the discovery last year was for real scientific discovery whereas the prize this year looks at an invention but I think the important point here is that this invention that's being rewarded this year is actually being used for basic science all over the world\nAh and so this interplay between invention of a tool and the use of it for science you can't really uh find the boundary between those two ideas but we do tend to distinctly a reward one or the other\nIs Roger Coney the president of the American Physical Society thank you so much for joining us Jeremy it's been a pleasure and tomorrow we'll find out who wins the Nobel Prize in chemistry get\nThis is Renee Montagne we've heard of them certainly didn't want any of our political discourse lately\nAnd to top it on the news media replaying the name Clinton\nOver and over\nNPR is different you don't shout more point fingers were the plates means in non inflammatory humbling divorce\nAnd with this way because you some more that you made it clear that you don't really like people yelling at you when you turn on the radio show reserve that home placed on your dialed today call now with your financial support we promise argues side boy\nAnd thanks and that's exactly the truth or just in the last ten minutes and we heard an update on what's going on with judge Kavanaugh's nomination also we got a story about physics\nAnd both of those were interesting stories touching on women's issues and they were presented thoughtfully carefully I Would say and that's why you tune into an each PR you want to keep up with the news and you don't want to hear that shouting angry\nTo contribute to keep this kind of news on the air you can contribute any amount at an age ... died or\nHey when these Chris autumn days turn into cold winter nights do you think about taking a trip maybe to a robot or Jamaica or Bermuda well guess what you could when you contribute to New Hampshire public radio because we will enter your name into a drawing to win\nTo Southwest Airlines one thousand dollar gift cards wow you will support New Hampshire public radio ads the same time have your name put into a drawing to win to one thousand dollar gift cards that would be fabulous act right now on line and H. P. R. dot org\nMargaret in Hanover size and each pair is my friend every morning as I drive to work et cetera and so I appreciate all that you do thanks so much well thank you Margaret for joining us Catherine in Amherst as any whereas my daily source for news education and\n... there you go to like a payment [laughter] joined them join us here at any age PR give in any amount with your checking account your credit card at an HP are dead or\nSometimes when I'm uh with uh people who listen to public radio somebody will say hey you guys get all the government tax dollars and I say you know that's not really true at an age PR for instance a small but important part does come from the government that's true but by comparison members\nListeners just like you provide the most important funding and that's why we're asking you to give right now on line a gift of ten or Fifteen dollars a month it'll do it and H. P. R. dot org\nAnd if you join at twenty dollars a month we have a special offer you this drive you will get a New York times digital subscription and not just that even though that's quite invaluable as it is a mule also get our new T shirt which is super salad it's like a charcoal grey T shirt with a Robin said blue hearts wearing headphones\nPerfect thing to wear around this winter I was twenty dollars a month you'll get that subscription and a T shirt on and you can join us here and supporting this news that you value the news that you trust so give us a call one eight eight eight eight oh five six four seven seven are go ahead on line at N. H. P. R. dot org\nThere is an incredibly talented rope bust group of journalists here at New Hampshire public radio that are covering every inch of this state to bring you the news that is important\nAnd we're asking you right now during this member drive to support them with your contribution to let us know that you care about what's going on in your state it's easy it's convenient when you give as sustain are at an H. P. R. dot org\n[noise] it takes just a few minutes the best way to give is through your checking account or your credit card that's on line if we've as we've been saying and H. P. R. dot org we always like to say do it now while you're thinking about it because you'll likely forget it later and H. P. R. dot org and thank you so much for joining us\n[noise]\nDisadvantage PR it's twelve twenty five [noise]\n\nFor for an HBO or comes from you our listeners and from Rochester opera house preventing Engelberg hover Nick man I Want to beat or friday\nNovember second at eight PM more at Rochester opera house dot com and from Land Rover Bedford prior model year land rovers are still available for test drive us they make room for two thousand might the rovers and their new show room Land Rover Bedford dot com\nAnd from New Hampshire magazine featuring local craft brewers plus the survival is in New Hampshire magazine\nAnd fuzzy tales from Fritz whether it be more at an age magazine dot com [noise]\n\nCrowded today from showers and the possible outcomes under storm [noise]\nPfizer on the fifties [noise]\nNow comes from the listeners of W. B. U. R. Boston and Geico offering auto insurance coverage for cars trucks are SUVs and providing twenty four seven customer service more information on auto insurance that Geico dot com or one eight hundred nine four seven\nAuto it here and now\nWhy is all about [noise]\nOkay [noise] many of you instantly picturing that didn't win hanging on across in the money python ethic life of Brian\nCheerfully singing to the neighboring Brian across way in a field of crucifixion cherub things could be worse not really of course there about the crucified or maybe it's something that someone in a bar or hurt it at a funeral or at the twenty twelve Olympic\nWell you can blame Eric Idle cofounder of ... of the Broadway takeoff spend a lot and songwriter see\nAnd he comes by the irony in it honestly we read in his new memoir that his father survived World War two only to be killed and a gruesome car accident while hitchhiking home on Christmas Eve\nHis mother went into a depression at seven Eric Idle was sent to a boarding school where bullying and abuse was rampant well thankfully he met up with some guy named John Cleese Terry Jones Graham Chapman Michael Palin Terry Gilliam together they took on every institution including boarding schools payback is weak\nAreas idols new book is appropriately enough always look on the right side of life he joined us from the NPR studios Welcome thank you Mr Right\nOh it was a lot of fun I think um I think creating it was really good because we didn't know what we were doing but we insisted on doing it anyway and we didn't get any executives its executive free comedy which is why it's any good and you know we we don't always towards the strange show\nWhich we had done lots of other shows aren't we knew wanted to be different from all of the other shows rework taught\nWell there was this incredible bursts of comedy shows in England and we many times to John Cleese a boy he will go on any show will he not [laughter] well it's the whole divorce thing will Alibis\nDivorced years ago this is just he likes the money he once told me all we're not trying to use he should be do anything for money so I offered him a quick to shut up and took it [laughter] well at any\nRate all of you were watching all of these great English shows and in sixty three you say what changed forever\nWas the show beyond the fringe with Alan Bennett Peter Cook Jonathan Miller Dudley Moore here's a little sound somewhat of their bits a man of principles\nComing up and just a couple of moments here you are a Tuesday Afternoon listening to an H. P. R. Y. not because it provides you with a high quality source of news\nAnd today we're asking you to contribute any amount to help pay for the news you trust and the programs you love seasoned journalists from across this region and around the globe bring your reporting that his second to none and one of those journalists as with me in the studio today breathe degree\nYes and today is one of my favorite days with a member drive because we're giving away to a ... gift cards to Southwest Airlines valued at a thousand dollars each it's my favorite because there's so much possibility in a gift card to a an airplane ticket like think of all the places you could go\nLiterally anywhere I think pretty much so\nTo get in the running for one of those gift cards joined us by going online at an H. P. R. dot org you can give with your checking account or your credit card um or you can always give us a call at one eight eight eight eight oh five six four seven\nSeven become a sustained her today and support the podcast that maybe you listen to from an HP are those podcast can keep you connected to the world for ... for example\nThere civics one oh one which offers a refresher course on the basics of how our democracy works if you've not listen to it you should really look it up but it's pretty interesting and it's fun to listen to I guarantee you all have some I didn't know that moments you always do when you listen to public radio\nHow about a little bit of support right now on line and H. P. R. dot org\nYeah I Love civics when a when they're launching a new season which is going to sound very much more dynamic and fun so I hear um we also want to get a special thank you today to south pizza at ... street in Concord thank you so much for our lunch\nToday and like you said one of the best way to join us to become a sustain or had has its benefits will automatically be under when all the drawings drawings that we do during these dry up just like the thousand dollar Southwest Airlines gift cards that we mentioned\nAnd you choose from any thank you get that you want every year so as a senior your contribution is adopted automatically from your checking account\nOn every month until you tell us to stop and you can join us as a sustain are at an H. P. R. dot org\nSo many people who are becoming members for the first time right they've never given before they listen for years they finally said yes contribute five bucks a month\nSo we're asking you to do that right now and we would love to thank you with our brand new you'll love it read an HP are trustworthy love where the bug hot or cold morning coffee afternoon refresher give it to a friend who likes New Hampshire public radio\nJust make a contribution right now five dollars a month on line and H. P. R. dot org\nSome of my favorite comic that we get from listeners are the most is ... very to the point like\nSharing inside that works that my co pilot that Michael what we love to be your co pilot sharing please and if that resonates with how you feel about an HBO and joined us today at an HBO died or\nPublic radio is funded by individual listeners who give five or ten dollars a month to become a first time give her today during this Dr don't let the opportunity to go by do your part contribute and H. P. R. dot org\nAnd that's even saying when it the best way to join us as as a ... that'll automatically ... from your checking account every month super easy and H. P. I. dot org and thanks\n[noise] this is an age PR it's twelve forty three support for an H. P. R. comes from you our listeners and from listen community services announcing the opening of their new thrift store in Lebanon accepting donations of clothing furniture housewares and more listening community services dot org\nInterim seacoast or mythology specializing in skin cancer diagnosis and treatment including advance most surgery early skin cancer detection saves lives seacoast term an H. dot com in from Portsmouth Fast Company local and independent bath and kitchen sales showrooms specializing in helping contractor designers and homeowners with refreshing idea of\nPortsmouth ... dot com ... cloudy today with some showers possible afternoon thunder storm highs around the fifties Timmy clouded tonight the lingering possibility of thunderstorms flows in the upper forties or fifties\nAnd this is an HP are\nFunding for here and now comes from the listeners have W. B. U. R. Boston with a program is produced and your NPR station\nFrom home advisor matching homeowners with home improvement professionals for a variety of home projects for minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd NPR and MORNING EDITION on this station tomorrow morning what happened while you were sleeping and the news interviews and analysis for the day I hit national international and local news tomorrow on MORNING edition\nThis is here now Republican Senator Jeff flake who paused a boat in the Senate on Brett Kavanaugh's nomination to make time for an FBI investigation said today he was troubled by the tone of Kavanaugh's remarks last Thursday\nI Hope that I Would sound that indignant if I were a if I felt that I was unjustly maligned\nBut then it went on and the interaction with the members was sharp and partisan and that concerns me and I tell myself to give a little leeway\nBecause of what he's done through but on the other hand we can't have this on the court we simply can't\nSome senators are also raising concerns about what they believe to be misleading testimony from Kevin ... let's bring in the Washington Post Philip bump for more high Philip hello how are you doing well and first of all Kavanaugh said he had never attended a gathering like the one that Christine Blasey Ford describes in her allegation here's Kevin\nDr Ford's allegation is not merely uncorroborated it is refuted\nBy the very people she says we're there\nIncluding by a longtime friend of hers refuted\nAs you report that is misleading house oh\nWell it's misleading because it changes very directly on what you mean when you say the the the sort of gathering that has been alleged five four right so we know for example according to Kavanaugh's own counters\nThat the word got things like the ones that Ford alleges are gatherings with very particular people over the course of the summer of Nineteen eighty two when it's when this allegedly occurred\nAnd is relying on a lot of nuance intentionally I think uh\nSupport for an HP ours live stream comes from you our members and from the law firm of or in Reno sustain excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges find out how or in Reno can help you online at or dash Reno dot com\nKnow this thing did not happen\nYou also point out that there's an event on July first in Kavanaugh's calendar that does fit the description that for gave\nThat's exactly right it does it does loosely I Will say that you know there is a one of the things that's important to note and one of the reasons I think this has become such a partisan fight is that there's a lot of gray area around a lot of this but yes that July first gathering specifically includes mark judge to whom I just referred\nTo a guy named PJ ... Smith who a Ford says was there a it includes drinking and it is on a weekday which\nKavanaugh sort of tried to downplay the extent to which he and his friends got together for beers on weekdays there all these ways in which\nAh that event reinforces even if that wasn't the day on which an incident had occurred it reinforces that such things did happen over the course of that summer\nWhich is something the cat and I went to great pains to deny\nKevin as your book has also become the focus of scrutiny this is Senator Sheldon Whitehouse reading from Kevin ... country\nHave view I don't know if it's ... or ... how do you pronounce that our first of flatulence sixteen okay [noise]\nAnd so when a your friend mark judge said the same put the same thing as your book page back to you at the same meaning it was ...\nI don't know what he did but that's my recollection and we want to talk about flatulence a sixteen year book page on 'em game ... Philip ... that's not what proved means\nWell it's sort of unclear what booth means in that context right I mean I I I'm not really a booth truth or if you will on this particular subject I mean there's you know in high school you have little terms that you use with your friends and and they can very pretty wisely\nBut it seems pretty clear that the broader effort the Kavanaugh was undertaking there was two each time there was a pretty obvious that a reference to drinking\nThat was made in your book he tried to redirect away from the fact that they were talking about drinking heavily\nYou know he he said that the beach week Ralph club which is pretty obviously right they reference to him drinking Latin and vomiting was a function of him having a weak stomach so whatever the definition of booth is however it relates to drinking the fact is that the euro country makes very clear that drinking was a big part of his high school experience\nWell and just by the way I mean of course it's crowd source but the Urban Dictionary says that moved refers to anal sex or this is Sheldon Whitehouse later talking with Kavanaugh about another term as your book devil's triangle here is\nDevil's triangle\nDrinking game has played three glasses and a triangle\nAnd\nYour plate quarters you know okay so ...\nWhat about that one and again I'm going to refer to Urban Dictionary uh and it says now because of what's happened in the last few days that are the devil's triangle is made up game of quarters with three cups arranging the triangle the rules are unknown because the inventor of the game Brett Kavanaugh could not explain them under oath\nDisadvantage PR it's twelve fifty nine sport for an edge PR comes from you our listeners from tough so freedom plant in northeast open dental partnership created for better or all into overall health right here in New Hampshire learned more AT T supposed to come\nIn from ... states read for an art center of preventing the music of Tom Waits with Vicki Christina Barcelona on October of\nInformation that keen dot edu slash slash Redfern\nIntroduced by lumber company of tried Chester find hardwood boat lumber marine plywood and west system for boats canoes kayaks on wood surfboards who's by lumber dot net\n\nCloudy today from showers possible afternoon thunder storm or two fires around the fifties cloudy tonight to possible thunderstorms ... and the upper forties to lower fifty\n\nAnd listening to an HBO are\nThese other stations of New Hampshire public radio W. E. V. O. conquered eighty nine point one\nW. E. V. S. Nashua eighty eight point three W. E. V. H. Hanover Ninety One point three W. E. V. in Keene Ninety point seven WABC Gore him one o seven point one W E v J Jackson Ninety nine point five\nW. E. D. U. F. cobra maybe points three and W. E. D. cute little to him like the one point nine\nAnd on line at any age PR dot org I'm Laurie London Senate majority leader Mitch McConnell says the Senate will vote by the end of the week on Brett Kavanaugh's nomination to the Supreme Court\nNPR's Kelsey Snell reports the vote will follow a deadline for the FBI to complete its investigation into allegations of sexual misconduct by having all\nThe FBI has until friday to investigate allegations against Kavanaugh but the process could take less time their mandate is to investigate any current credible claims of misconduct Democrat to criticize that definition is too vague and so far it's unclear who will be interviewed in the pro\nDemocrats say Republican leaders are constraining the investigation and have criticized the process as incomplete button McConnell's pushing back\nTerrible or Mr Braga practically here\nEven though he's not setting the exact day for a final vote Kelsey Snell NPR News Washington\nFour days after a magnitude seven point to earthquake and ... on the Indonesian island of ...\nThe situation remains dire the death toll is all ready above twelve hundred NPR's Julie McCarthy is in Indonesia traveling with an army aid and security convoy to the heavily hit city of ... near the epicenter or casualties are likely to increase\nWe're our own well there's a high that holds the coach says we move north to follow the roads are in decent condition it started to rain or what sort of added to the misery here\nThere's not a lot of traffic coming back out which you would have expected because a lot of people are trying to leave however there is no gasoline to do that and so people really there's a sense of feeling trapped\nShe says there's no water no food and aftershocks continue sixty five thousand homes or destroyed but more than a million people have been affected\nThe Nobel Prize in physics has been awarded to three people for their work in advancing laser technology NPR's Geoff Brumfiel reports the prize winners included a female recipient for the first time and fifty five years\nEven Donna Strickland the winter herself seemed surprised to learn how few women who have won the prize she was asked about it in today's press conference\nYou are that the woman ever getting that no prize in physics\nOften what your comments on that okay I can say\nStrickland in charge more route one for their work creating high intensity ultra fast laser pulses the prize also went to Arthur asking for his work using lasers this tweezers to pick up and move tiny objects Geoff Brumfiel NPR News this is NPR\n[noise] this is an age PR it's one of four support\nFor an age ... comes from you our listeners man from un aged school of law specializing in legal education for the information age with masters in L. M. degrees and intellectual property driving invasion in the state and beyond flawed UNH dot EDU\nIn from North branch construction celebrating sixty years in business on time on budget on line from North branch dot net\nWho this is an HP are in\n... we all are comprised of many different instincts like there's good instincts in us or bad instincts in as the bad wins a lot of the time this is an appeal to the good part to say\nYes it's about ... like I'd probably Twenty one inches away from you\nKnow yeah I'm going to [noise] which is when you're pushing you to the phones sixteen inches [noise]\nYour number to call that number is eight eight eight\nEight oh five six four seven seven will continue with more here now and just a couple of moments she'll make sure that you stay tuned for that I'm Valerie argenbright here we're here to remind you that support from listeners make programs like hearing now possible and what a great show it is right\nAll of the day's events right here we're asking you to act during an HBO ... fold Dr make a gift through your checking account or credit card at an age P. R. dot org ... Greene is with me in the studio\nYup and today we're giving away too um gift cards to Southwest Airlines they're each worth a thousand dollars so that will likely cover\nOf a buddy to go with you too so I think about all the places that you could go if you win our drying today\nUm join us at an H. P. R. dot org the best way to give is with your checking account or a credit card that that's an H. P. R. dot org and thank you\nWe love it when so many listeners contribute to New Hampshire public radio during drives including Patricia from ... who says\nAn H PR is a voice of sanity in a crazy time and also Kirsten from ... said that it's a connection to her community's local to international in thoughtful and thought provoking ways we absolutely love that thank you for contributing today\nAnd also thank you to cells pizza located at eighty stores street in Concord\nFor donating lunch today we appreciate that as well\nYes we do and you know we're sitting here in the studio just I'm listening to here and now this past hour is talking about the latest with the Kavanaugh investigations and\nThinking of all the questions that we have even as big time news consumers I'm sure you have a lot of questions as well and that's why you are in an HP our listener because you're curious and you want to know what's going on\nMaybe you've never gifted gave given to the station before now is a great time to do that is that an H. P. R. dot org\nWe have a lot of really wonderful thank you gifts this time around some new T shirts new mugs we would really love to hear from you if you're a first time member that's an H. P. R. dot org\nHay and why don't you do what breed it was just saying become a first time member contribute ten dollars a month and ask for that brand new heart phones tea is a thank you gift you'll absolutely love it it's got a\nReally lovely picture of a big heart listening to an age PR on it you can go online and see what it looks like but it really is nice it'd be fun to where I encourage you right now\nTo contribute ten dollars go on line and H. P. R. dot org and say yes I mean the T shirt\nWe talk a lot about the programs that you hear on the radio we also of course have a whole suite of really fantastic pod cast that are produced here and in each pair\nThat's not ... usual I Would say I mean any any fear among other public radio stations hasn't really exceptional pod cast team making 'em all kinds of shows that are interesting to you one of the big ones is called outside in which explores the natural world\nThat's something that's really important to a lot of people living here in New Hampshire with our hosts Sam Evans brown you might hear him on MORNING edition every once in awhile answering all your questions about\nSay what's going on with the squirrels so to support that show to support everything we do here at an age PR join us had an H. P. R. dot\nOrg and also when you contribute to New Hampshire public radio you'll be entered into a drawing for a grand prize which is a trip of a lifetime and that's what we call it triple the lifetime for two to your choice of Australia or New Zealand online and H. P. R. dot org\nSo it's a trip of a lifetime Australia or New Zealand right your choice or you can win I'm One of two Southwest Airlines gift cards those were talking about today super inspirational because you get to go anywhere you want I think I might choose to go to Paris how about you know\nI thought oh boy I Would love to go to New Zealand I hear it's [laughter]\nSo even if you don't win and New Zealand trip you can take yourself there with your dog airline good idea to get in on that again join us on line the best way to do that is an H. P. R. dot org with your checking account or your credit card\nOr you know when you get right down to it it is really simple right you have made the choice free will you've made the choice to listen to public radio it's not for everybody but it's for you you enjoy the experience it's your experience don't put up supporting in age PR it's simple when you get through your checking account online at any age\nP. R. dot org if you've already contributed during this Dr ... thank you very much\nBeing a voice in criticism that they taught breaking the\nSemi life being lost when the systems could have\nSaved many lives uh of course others would disagree that it's too early to self pointing fingers at each other and that every a quake everything on me that friend that that may pass system\nBut they are they all some questions that the local authorities and the government will have down so that the name and the the focus has really being on the screen ... still believes to be trapped underneath the level\nBut the BBC's Rico or joining us from ... to the epicenter of the devastation of from this you know what I mean thank you so much\nThank you thank you for having me and you're listening to hear now [noise]\nThis is Ira Glass this American Life and that you think about whether to put your public radio consider for a second how commercial radio and TV Martin last year forty two billion ... billion dollars were spent on television ads three and a half billion we spent a radio ad [noise]\nAnd you know where that money\nFrom it comes from you and me we pay for that and every time we buy really anything that advertises on radio or TV [noise] how much does it work out to a year for us it works out to two hundred dollars for each adult in this country which basically just gets siphoned invisible you off of\nYou and me right we don't even get a choice [noise] ... radio it's way more straightforward first of all you get a choice and if you're somebody who does with all the time\nHelp out [noise] I Would just as you just as you make that choice to consider this fact OK you are already pitching in you are ready underwriting all sorts of radio stations and television stations to the tune of two hundred and eight dollars a year [noise]\nBut they're not necessarily radio and television stations or even like [noise] you know you are subsidizing television shows that you despise underwriting radio station who you hate your guts you have [noise]\nWhen you like to support or radio station that you actually listen to [noise]\nYou know you're already starting to hundred eight dollars to all these other people you don't want to do when you like to vote with your dollars every now and then for something that you actually\nBelieve in [noise] stand up for what you actually like you're giving money to all these other radio stations are these other television stations stand up\nFor what you like by calling this number it's one eight eight eight\nEight oh five six four seven seven and that is right stand up for what you like we hope that you like and it's because you're listening to it right now he probably listen to it all the time like so many of us do\nPlease join us now you can also go to an H. P. R. dot org to make your contribution that's an H. P. R. dot org where you can get with your checking account or your credit card and breach of green here with me today as Valerie argenbright\nAnd when you go on line to make your contribution you will be automatically entered to win to one thousand dollars southwest airline gift cards\nSouthwest flies to a hundred destinations and forty states I mean think about the places you could go and that's you know that's like a little bit of a cherry on the top the big thing is is that you're supporting New Hampshire public radio the cherry is that your name is being entered into a drawing to win a thousand dollar gift card\nWe can't do anything though but you hold all the power right now go on line and H. P. R. dot org\nAnd right now we're listening to here and now it's important to remember that here and now in a lot of the shows that you hear on HBO or are really a collaborative effort they're produced in one place here and now it's pretty soon Boston by producers there but they're aired all over the country and they feature voices from all over the country\nAnd that collaboration also extends to listeners to you're giving us your ideas you're asking us questions that we then go out and try to answer and your financial support\nHelps keep these shows on the air so help us keep hearing now in the air join us at an H. P. R. dot org\nYou know every day whether the news happens here around the country or abroad and H. P. R. can bring it to you because of listeners support and so we're asking you right now to join other members other sustain ers donates ten or Fifteen dollars a month\nAnd say yes I Am going to help make sure that New Hampshire public radio stays strong and stays independent it takes only minutes to give on line which most of the standards do at N. H. P. R. dot org\nAnd at that Fifteen dollar a month level you'll get not only our T shirt which has really well this year and a great share it with a white headphones and a blue heart\nBut you also get our new mud and that's a bright red really cheery good morning mug especially in a day like today where it's quite cold and rainy who wouldn't want a new mug [laughter] so go ahead and joined us at Fifteen dollars a month and you can get both of those thank you guess it's an H. P. R. dot org I'm enjoying this\nThere are so many listeners who are contributing to New Hampshire public radio today we want to thank them and we want to thank cells pizza located eighty stores street in Concord for donating lunch today I guess with the donated\nHey a lot of people are working hard to make sure that you have the best public radio service available and it's happening it's alive that's why you listen it's an H. P. R. dot org make a contribution right now\nEven if you think you'll never going to win because you've never won before we let me tell you every time we do want to be strives we hear from someone who said I\nSo go ahead enter your name and a hat and let me tell you you have a good shot at winning at the end H. P. R. dot org and thank you so much for joining\n\nThis was an HP arts one twenty five for\n... comes from you our listeners man from ... word orchards in London dairy fall foods give pumpkins and a fourteen ...\nOpen daily corn may also open friday and Saturday nights more at L. would orchards dot com\nAnd from Dr Jones a visa providing central cared to adults and children and the Congress area for over Thirty years and now accepting new patients information at two to six to nine nine five and from Raymond more opera beginning of twenty third season with an opera cabaret production of tragedy that car among\nAfrican country club fuck over six and seven Raymond more dot com [noise]\n\nRowdy today some showers impossible afternoon thunder storm or two eyes in the fifties cloudy tonight showers blows and the upper forties to lower fifties tomorrow partly to mostly cloudy [noise] disadvantage PR\nFunding for here and now comes from the listeners of W. B. U. R. Boston and your NPR station and Geico offering motorcycle an RV insurance more information available on motorcycle an RV insurance at\nGeico dot com or one eight hundred nine four seven auto\nThis is here and now this week the Trump Administration announced that it had reached a new trade agreement with Mexico and Canada a revision of NAFTA the north American free trade agreement\nJoining us now to talk about that and more is Larry Summers the former secretary of the treasury under President Clinton former top economic advisor under President Obama and president emeritus of Harvard University Larry Summers walking back to her now\nGlad to be with Germany and let's start with this trade agreement the new U.S Mexico Canada trade agreement what do you think of it\nNever seen so much ado about so little I thought the old trade regime between Canada and Mexico in the United states was a good one\nAnd this one's not very different towers could possibly be worth major alienation of major allies I Can't imagine\nThese are relatively small changes the vast majority of NAFTA is continuing as it was this has been a major diversion from the important domestic challenges facing the United states\nAnd the important international challenges but I'm happy with the new agreement put simply because I was happy with the olden Raymond\nAnd I can't imagine why someone who was profoundly troubled by the old agreement should be happy with the new agreement so this is more in the nature of a publicity stunt\nThan an international diplomatic act\nSo when President Trump said this is proof that my strategy worked that I put pressure on Canada and Mexico and I got what I wanted and our dairy farmers are going to be in better shape now you say what\nI say any changes are tiny compared to the overall economy\nThe ill will we have created with respect to the Canadians and the Mexicans will have costs that will exceed any benefits the ...\nUnified when we face very serious challenges from Asia\nHas been constrained this has been the most short sighted of strategies for the most negligible game\nDo you feel the same way about what's happening these of the trade with China right now\nWill continue with here now in just a couple of moments the take away coming up at the top of the hour incredible again afternoon of news and information here on New Hampshire public radio that interview with Larry Summers I mean\nThat was ten minutes right a ten minute interview and here it was right here on New Hampshire public radio because that's the kind of news and information that you're asking for and you know you get it right here get through your checking account or credit card at N. H. P. R. dot org I'm Valerie argenbright with me this afternoon is Bree to green\nYep and today we're giving away too um southwest airline gift cards to gift cards I had a thousand dollars each\nYou can use those to go where every like and chances are you'll have enough without a thousand dollars to take not only your own self to where you want to go but also a friend or family member that you might want to travel with them just\nHave some fun imagining where you might end up when you when one of those gift cards and joined us at any age P. R. dot org you can give their with your credit card or your checking account\nAre so many reasons to support New Hampshire public radio when you do you'll help pay for the information the analysis the enjoyment and you know what I think tomorrow Jason ...\nUnsolved murder case in New Hampshire\nNow a podcast called bear Brooke\nI think the first episode of that is going to be available to you tomorrow so you'll have to watch for that it takes time and talent to report on these stories and it all happens\nBecause of listeners who are already financial supporters we call them ... we call the members were counting on you right now to do your part and joined them on line and H. P. R. dot org\nAnd if you become a sustain or like you mentioned you get a whole host of perks with that um you'll be automatically entered every year into our drawings you'll get I think you gift and he believes he won't miss out on the fun giveaways that we have during these guys and you'll get special access to our pledge free stream so that means if you can listen to\nUm our programming without hearing us talk like we are now during his pledge drive so that is a major perk for a lot of people so to join us as a sustain or go on line and H. P. R. dot org or you can give us a call if you'd like that's one eight eight eight eight oh five six or seven seven\nHere's something else which quickly becoming a favorite of people who are contributing during this drive Fifteen dollars a month and you can choose a year long New York times digital subscription\nUnlimited access to all times content through any smartphone tablet or Web browser all year long Fifteen dollars a month learn more about it when you go online and H. P. R. dot org\nAnd we've been hearing from members joining us all throughout this drive some really fun\nLittle tidbits that they give us about why they love and H. P. R. and James in Keene says daily all day I cannot live without it\nAnd he says we he enjoys rex humor in the morning [laughter] so do we all Richard in Concord says he's lived in Maine for the past ten ... ten months but he's still prefers listening to an HP are now he's moving back well thanks I'm Glad you're coming back to join a these members on line at an age PR\nDied or you decide the amount five dollars a month ten dollars a month decided the amount and go to an H. P. R. dot org support your public radio station and H. P. R. act now on line and H. P. R. dot org\nAnd don't forget about the Southwest Airlines gift cards us or to each valued at a thousand dollars you could go to Bermuda you can go I don't know anywhere you can dream up and H. P. R. dot org and thanks\nThis is an HP arts one forty three [noise]\nSupport for an itch PR comes from you our listeners from hunt community a proud tradition for senior living in Nashua silverstone living life\nPlan community information that hunt community dot org and from from her piper ethical spin and Kramer PC reading experience to legal guidance and collaboration with businesses and individuals throughout New Hampshire\nLearned more at ... dot com\nAnd from Daniel restaurant in ...\nOffering space for business meetings and family events overlooking the concert river information and menu that Daniels would panic or dot com\nRowdy today some rain showers in a possible afternoon thunder storm\nHighs around the fifties cloudy nights showers ... under storm blows in the upper forties a lower fifties\nDisadvantage PR [noise]\nFunding for here and now comes from the listeners of WB or Boston and your NPR station\nStaples with printers printer ink on toner cartridges for home in business and in store print shops for customized presentations booklets and manuals\nMore at staples stores or staples dot com staples and NPR and MORNING EDITION on this station tomorrow morning what happened while you were sleeping and the news interviews and analysis for the day I had national international and local news tomorrow\nIt's here and\nNow and we've spoken here over the years about early retirement a couple who sold their home traveling and staying in other people's homes to save money\nMillennial who work day and night to earn a million dollars and live off investment income well there's now a name for this it's called fire financial independence retire early and fire is on fire inspired in part by books like your money or your life\nAnd stoked on blogs pod cast and read it message boards sharing ideas like how's hacking you buy a home rent out all the rooms you crash on the couch\nOr work at a place with free food Scott ... and his wife Taylor are on fire they were earning a hundred and sixty thousand dollars a year living in a beach town driving a BMW and then\nLet's let Scott tell it he joined us from Bend Oregon Scott welcome\nHi thanks for having me well nice to speak with you and I understand you heard a pod cast it with one of the gurus of this movement Mr money moustache this is Pete adding me what was it that he said that made you and your wife so a roughly change your lives you moved you\nStarted saving you were determined to to retire what what what did you hear\nInitially what was so intriguing to me was he sounded so optimistic and um for someone who's living on twenty seven thousand dollars a year which is how he was introduced on the podcast that was very interesting to me at that time I was actually looking for\nMy own million dollar idea to kind of get out of the stresses that I felt from our spend the lifestyle\nTalked about those stresses you are creative director at a creative agency and I imagine in the homes got nicer and the cars got nicer in the clubs you belong to that nice or is that was was there that kind of escalation going on\nThat's exactly right it was this unintentional lifestyle creep we originally moved into this little five hundred square foot apartment in this little beach town\nAnd our our costs are much lower than and you know as we got older and we had a baby or you know some of our knees were were changing but also our taste\nYou know we found ourselves eating out quite a bit we found ourselves are moving to a larger three bedroom apartment and you know we moved there when the recession was in full force but fast forward a couple of years and things were gaining steam and rents were going through the roof and\nYou know ... my financial literacy wasn't in top shape at that time and so\nTo hear that someone was that happy living on twenty seven thousand dollars a year as well so intriguing to me in the beginning\nOf the other thing that happened is that your wife Taylor she looked at a retirement calculator\n[laughter] so uh once I started going down the rabbit hole and learning about some of these tactics and strategy is from is from now my friends but at the time my my heroes I implemented the retirement calculator kind of understand our situation and when I first plug the numbers into what current spending was\nIt looked like we would probably be retiring in our eighties\nAnd uh and when I ran some models on what I thought we could live on reasonably based off of some major life changes I realized that we could probably retire in about ten years if we really stuck to it that is what put her over the edge\nOkay so this sense that you could be unburden from the cost of your own lifestyle that you could get out of maybe a rat race you'd gotten into did you not like your job\nYou know it's funny I personally really like my job and it for me it's not about work for me it was about a ring myself from\nThis idea of mandatory labor you know there's passion that I have that may not necessarily coincide with earning a lot of money or earning money at all and to have the time to pursue that felt like more like the type of life I'd want to live so when I realized that there was a potential for that I mean it was intoxicated\nOK so a couple of things first of all when you say this mandatory labor many of us just said you mean a job which is\nSupport for an HP ours live stream comes from you our members and from the law firm of or in Reno sustained excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges find out how or in Reno can help you on line at or dash Reno dot com\nAre making a documentary about your FIRE movement and you're writing a book about your FIRE movement haven't you just replaced your creative director job with film director author [laughter]\nYou know it's funny I I've I've now met a lot of people in this fire community and the one thing that seems to stay very relevant true is that you know you don't meet a lot of people who are just straight up retired doing absolutely nothing right I haven't met anyone that's been like that\nAnd we should say there's different levels or this is according to our reading there's lean fire where people are extremely frugal fat fire where people have a more typical standard of living but they save and invest ... to fire you weren't part time at like a Starbucks [laughter] so you can", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Keene", "day": "02"}