{"month": "10", "state": "NH", "station": "WEVN", "content": "W E s Nashua eighty eight point three W. E. D. H. Hanover Ninety One point three or ... and keen Ninety point seven\nW. E. B. C. Gore him one of those seven point one W. E. B. J. Jackson Ninety nine point five ... easy as coal Brooke Ninety point three and\nW. E. V. cute little ten Ninety One point nine and online at N. H. P. R. dot org\nFunding for here and now comes from that weren't greeters of that lab and stimulate somewhere accelerating the pace of engineering and science you learn more men were not come from NPR and W. B. or Boston I'm Jeremy homes and\nAround the young here in now coming up as President Trump visits hurricane ravaged Florida residents reflect on what they went through a motel owner next to ... beach sorry he didn't evacuate\nMonday for gold up each day did the stresses boise's it looks like we did the wrong thing to do this or we do and he's been really good no these are\nAlso Sears filed for bankruptcy or the lessons for Amazon\nAnd President Trump says I'm wrong killer in a conflict could be behind the disappearance of the Saudi journalist\nThese stories and get ready for all the predictions about what's going to happen in the terms but really how good are we in forecasting future in\nThe room with expert predictions so often it heads I win tails you forget we had about coming up here in the news is first\n[noise]\nLive from NPR News in Washington I'm Lakshmi saying the president and first lady or on the ground in Florida's panhandle they just arrived to see firsthand the destruction hurricane Michael inflicted on Floridians last week NPR's Quil Lawrence reports on the difficult recovery confronting those directly affected\nThere have been some promises that power is schools things will be rebuilt within days or weeks but the people here are facing living day by day one more day in an area that still devastated\nThat's Quil Lawrence reporting hurricane Michael struck the pan handle as a category ... storm with one hundred and fifty five miles per hour winds it rabbits communities with floods powerful winds and tornadoes in four states at least\nSeventeen people were killed dozens of people are still unaccounted for moments ago President Trump addressed reporters as he was standing beside Florida governor Rick Scott he prays Scott's oversight of the storm response in his state\nThe president appears to be taking Saudi Arabia at its word that he had nothing to do with the disappearance impossible murder of Washington Post contributor ... NPR's Mara Liasson has the latest the\nPresident said quote we'll get to the bottom of the ... disappearance but he also said he talked to the Saudi king who he said firmly and flatly denied any knowledge of ... disappearance Trump even suggested an alternative theory of the case\nLike these are sort of thing for\nThe president's reaction to the quote from denials by the Saudis sounded a lot like his reaction to Vladimir Putin's quote strong denials about election interference\nAnd as a gesture and that maybe someone else was at fault sounded like his suggestion that the Democrats emails could have been hacked by quote somebody sitting on their bed that weighs four hundred pounds Mara Liasson NPR News the White House [noise]\nA federal judge in Boston is hearing opening statements today in a lawsuit alleging Harvard University discriminates against Asian applicants from member station WBFO war Simone Rios has more\nThe suit is spearheaded by conservative activists Edward Blum\nWe believe the evidence shows the Harvard systematically\nRaises the bar for Asian Americans in systematically lowers it for whites African Americans and Hispanics\nIn defense of Harvard sophomore album Sam says considering race is a key part of the admissions process\nWould diminish cause even ... like understand you and your ability to talking about yourself\nSupporters of the suit say diversity should not be achieved by treating students differently opponents say the suit is an attack on diversity itself for NPR News I'm Simone Rios in Boston\nThe Dow Jones industrial average is down fifty two points to twenty five thousand two hundred and eighty seven yes and he is down eleven points that two thousand seven hundred and fifty five the NASDAQ down sixty points this is NPR\nIt's twelve oh for this is an H. P. R. News I'm Peter below actor Alec Baldwin was in Manchester last night to fire up Democrats at the state parties in annual fundraiser\nBaldwin is known for his impression of President Trump on Saturday Night live and the support of liberal causes but he's also been criticized for sexist and homophobic remarks in his speech he called her quote the peaceful overthrow of the government of Donald Trump with democratic wave in the mid term elections\nAs many rich power billionaires pulling strings like a GOP as but our advantages but all those billionaires still only have one vote there are more of us\n[noise] even drew about eight hundred Democratic Party supporters which organizers say is a record amount since the event began in Nineteen Ninety One Goldman Sachs foundation is launching a program at Manchester community college to train a small business owners and H. P. R. Sarah Gibson has more\nThe program called ten thousand small business as offers at ten week intensive course and certificate to entrepreneur is free of cost Goldman Sachs has fourteen other sites like that throughout the country ... is the chancellor of the community college system of New Hampshire on friday he welcome to the new partnership\nCommunity colleges are at the intersection of economy education and communities and we know communities could only be as strong as the businesses in those communities\nThe company expects to offer training at Manchester community college to about Seventy small business owners next year for an each pair News I'm Sarah Gibson\nShowers today with high in the mid to upper fifties and more showers tonight with Lowes around forty four tomorrow sunshine with ties in the mid fifties in the south upper forties in the north\nSupport for an HBO or comes from listeners like un from North Atlantic fuels\nProducing clean and dry locally sourced firewood wrapped on a pound and delivered to the home learn more at North Atlantic fuels dot com and from the New Hampshire union leaders forty under forty program presented by Dartmouth Hitchcock two thousand Nineteen nominations being accepted at union leader dot com slash and forty\nThis has been HP our support for NPR comes from the financial services firm of Raymond James\nOffering personal lives wealth management advice and banking capital markets expertise along with the legacy of putting clients financial well being first learn more Raymond James dot com\nFrom NPR and W. B. U. R. I'm Jeremy hops amount than young it here and now President Trump visited the Florida Panhandle today to see the devastation left behind like hurricane Michael Charles Smith in what was the small town of Mexico beach is grateful for the attention and they help from FEMA\nAs you know by now Mexico's beaches quaint no high rise hotels so Michaels direct hit nearly wiped it out Charles Smith on what's left of the Gulf the motel it was destroyed in fact in Alabama now that's how far he says he had to drive to find a place to take a shower\nCharles that we're so sorry for the destruction and also you state during the worst because you've been to hurricanes like open all so you didn't realize how bad Michael would be you must have been terrified\nUh yes ma'am very knew I was going to die\nHit we had no electric so I couldn't see the TV Monday recalled a paste aid but he had so much stress in his voice cease it looks like we did the wrong thing I said yes are we did\nAnd he said it looks like this disease and I said Yes sir I said it's been really good knowing you sir oh wow then the phone lines went dead oh\nHeld on for a grab all my cats and took him down stairs put them in one of my room because I figured the roof going to blow off the top\nWhen we were the rooms the water started coming up under the door and around the side of the door neighbor's house came through the front that I tried to get the cash out to put them\nIn the stairwell but the water was too much I grabbed a hold the door knob it would not move it would not there was too much water pressure than the wall started collapsed in I was able to get one door open\nI grab one of my cats just threw it in the office it went up to the upstairs I went back down or the other ones are the doors slammed on I mean the water went up\nWent from two feet to for\nTo flip me after the roof\nAnd I got sucked into the laundry room with the four cats and then the fridge raided hit me because everything is ... you you take everything that floats and put it right about four feet where you're at and it's not standing still\nIsn't moving and it's a missile yep oh I got hit by beds\nStoves 'cause I'm I'm a motel and I got kitchenette and my neighbors' houses floating\nIn my house I grabbed the cat I had I threw it in and they came in and suck me back out I was able to get back into the in the room number two\nThen the outside wall caved again we're not once I get up on the fridge writer because it got ... bridge rather got sucked in and jammed into the ... the bathroom I was able to get back among the longer the fridge right or I went to reach for my cat wall broke through and the cats just we're on the bad news is loaded out\nAnd from a bluebird self storage a New Hampshire owned and operated business offering through climate control and pick up for new customers in personalized service details of bluebirds storage\nDot com [noise]\nFunny some showers this afternoon high temperatures today in the fifties cloudy some showers this evening it'll be clearing in the overnight low temperatures denied her thirties to mid forties sunny tomorrow ... upper forties to lower fifties this is an HBO [laughter]\n\nFunding for here and now comes from the listeners of WB Lara Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance available\nAt Geico dot com or one eight hundred nine four seven auto\nThis year and now the midterms are three weeks away and pundits and politicians are working hard to make predictions about how they'll turn out we often look for predictions tell us what will happen in politics and the economy and technology and in other things but as the saying goes making predictions is hard especially about the future\nSo how do you do it well joining us now is Dan gardener who's the author of future babble and super forecasting the art and science of production Dan welcome\nHi Jeremy so why is it that we humans always want to know what's going to happen in the future when it's really hard to do that in a lot of ways\nYeah uh it really stems from a really fundamental need we have a need a psychologically rooted need for control a sense of control of our environment\nAnd what do you need for control of your environment you need to know you need to know what's happening now or if you're looking into the future you need to know what's going to happen and if you look into the future\nAnd you've got important questions on your mind and all you see as a swirling vortex of uncertainty that's deeply disturbing you have to a race that uncertain and one way that we erase uncertainty is by turning to experts in saying please tell me what's going to happen next\nOne the experts that I think of when it comes to productions that get it pretty right at least in the not too distant future weather forecasters yeah I have an app that tells me in ten minutes it's going to start raining exactly where you are right now um but you know where are we good at it and where we bad at it\nWell it's interesting that you highlight weather forecasters because of course people tend to make jokes about weather forecasts as they always get things wrong you know ... ... exactly the opposite in fact weather forecasting is the gold standard of forecasting\nNow the big difference between the weather forecasters in one of the reasons why they're so good and so many other domains\nIs it the weather forecasters know how good they are and they know when they cannot do so many other domains that's not true people use vague language like something's probably going to happen or that's pretty certain or there's a good chance that\nA and nobody keeps track they don't keep score and so if you look at\nThe big famous pundits who tend to dominate the news whether it's politics or economics or anything else [noise]\nUm they don't actually have proven track record scientifically scored track records we don't know how accurate they are in the same way that we know how good a baseball player is by looking at his batting average in is the goal of of\nTo be able to make a decision once you know what's going to happen or once you think you know what's going to happen that will change the outcome\nThis is an absolutely essential point very often when you talked about forecasting people talk about well how do you make an accurate forecast but very very often when forecasts are made\nIt's not actually accuracy the people are interested in there all sorts of other reasons why people make forecasts so you know a pundit on television might be making a forecast because it's ideologically congenial for the audience that very often happens\nOr they might be making a forecast because it's shocking and it's interesting it entertaining [noise] um there's all sorts of these other competing interests\nAnd one of those is to cause change so for example if I warned that some terrible thing is about to happen it's not necessarily that I Believe that is in fact the case it may be that I'm trying to spur others to action in order to prevent this suppose a catastrophe [noise]\nUm so we have to be careful when we're looking at a forecast we have to ask ourselves is this person just trying to give me a district goods to be as accurate as possible or do they have other interests at stake\nWhat are some big flops some production failures that stand out in your memory\nWell I always liked to say that the Nineteen seventies where the golden era of failed productions um it started really in Nineteen sixty eight with population bombed by Paul Ehrlich was a huge bestseller basically said that there will be mass global starvation within a couple of decades [noise]\nWrong or and then the Nineteen seventies were absolutely stuffed with the most amazing forecasts and and happily for humanity most of those forecasts which were wrong we're all dismal they all said we're going to run out of oil um\nWill it reminds me of Y. two K. right that we all thought that general is going to end with two thousand came along and nothing happened\nThat's that's exactly right Y. two K. was another one there is a very long litany of these things but you know a one of the unfortunate aspects about forecasting is this if I go back to old forecasts and say hey do you remember what that guy said ten years ago well let's take a look at what happened and it turns out it's wrong\nI can tell you from experience the people kinda yawn [laughter] because it's an old forecast who cares about or forecast old forecasts are old news\nBut if time passes in somebody's forecast happens to be right then they will be introduced as the person who got it right and we all have to listen to this person because there and tell us what's gonna happen next and as a result the rule with expert predictions so often is heads I win tails you forget\nWe had a bad right well you think about that every time somebody who figured out that President Trump was going to win when much of the media thought that he would not when a when he did win you know there are a few journalists out there like I said at look at my tweet from you know she might have to go I said it was going to happen you up\nAnd you know look it's a there's an old saying about the mutual funds you know you start five hundred mutual funds and you just bet on all sorts of different stocks\nAnd ... by sheer happenstance one or two of them will hit big and then you hold up your one or two that had big and you say look at this what a brilliant invest right and well forecast very often function like that you can't judge the quality of a forecaster by a single forecast\nThat stand gardener who is author of the book future battle and co author of super forecasting the art and science of production dance thank you so much for joining us thank you and let us know what you think of forecast political and otherwise at here now dot org\nNow to the environmental fall out from one of the most destructive fires in California history in late July the Carr Fire swept through parts of the city of reading and the surrounding area\nToday residents are faced with burning hillsides burned hillsides and more than ... than\nThey did with toxic ash Liam Moriarty from Jefferson public radio reports [noise]\nI'm just off keswick dam road on the western edge of renting the Carr Fire blasted through this neighborhood on the evening of July twenty six incentive reading dozens of homes on this date accrue in white hazmat suits and respirators as methodically sifting through the ash and rubble\nIvan Rodriguez the California Department of toxic substances control says this is phase one of the clean up\nThat entails screening the properties that have been devastated by the fire and looking at household hazardous waste that needs to be removed to allow for the ash and debris to go off in the future time\nRodriguez says the typical American home contains a whole range of products that can cause toxic contamination after a fire\nPolitically for Prescott cylinders looking for batteries looking for any paints any solving any pesticides herbicides\nHazmat workers are marking what they find with spray paint to signal the removal crews white paint for propane tanks and other standard hazardous waste ... which requires its own special removal techniques\nOnce phase one is complete crews will collect the ash in rubble including the building's foundation and hold it all off to a hazardous waste facility\nThe danger of toxic gas blowing across the landscape gives this job a sense of urgency but there are other posts fire threat says well\nWe're on the back deck of my house Daniel Whitley a standing behind his home in the lake reading states neighborhood were many homes were damaged or destroyed ... was nearly one of them\nWere looking at the remnants of the Carr Fire that came a pair of sleep close to the back of the house as he points to the burned hillside right out is back door\nHe talks about his plans to head off the erosion that winter rains are likely to cause I'll put in some straw bottles those long stalled fields flexible things and then I'm going to plant some a perennial bunch grasses up their\nWhitley says if he can get the grasses established before winter he thinks he can avoid potential mudslides\nDrew co says that in some of readings burned over hillside neighborhoods so called debris flows could well be a danger\nShe can have essentially a large mass of rock and mud and water moving down and you can wipe out a house\nCall was with Cal fire's watershed emergency response team the group of hydrologist a soil scientist and other experts uses sophisticated digital mapping tools and onsite observation to identify populated areas at risk for landslides another post fire hazards to safety and property\nShe says the size of the Carr Fire and the geological conditions in reading I mean the threats here aren't as dire as after last year's massive Thomas Fire in Southern California\nSupport for HP I'd live stream comes from you our listeners and from castle in the clouds Milton burl\nExperienced the beauty of autumn in New Hampshire from high up on the castle on the states what a trails or taking colorful used while dining on the terrorists open deli through October twenty first cats on the clouds dot org\nAnd now it is\nIt was stage manufacturing a company that we've purchased\nThis was the industry in Rhode Island how it is still the industry rather changed a lot of it has changed a lot\nA lot of people would say then you factoring in the U.S\nYou know has diminished\nAnd my response to that is that there was a time when we struggle\nAnyone you talk to that knows anything will say it's coming back\nThat people aren't that satisfied with going overseas and they prefer to have something that in the usa\nAre you happy with the direction of the state is going\nI think we could do better um but I think that gets into politics and I'm not going there\nWas the politicians are\nWhen I ran for governor we had one of the highest unemployment rates in the country\nAt a recent debate Gina Raimondo took credit for bringing in Rhode Island out of the recession\nIn fact for most of the year that Iran we had the highest unemployment rate in the country and in some industries like the building trades unemployment was over twenty percent people were hurting so I did get to where I got to hurt changing the way we do economic development\nWhat she means is tax\nBreaks Raimondo lured big companies like Johnson and Johnson and a division of G. E. with generous financial incentives her opponent Alan ... who was mayor of the city of Cranston is not impressed\nWith culture thing for governor subscribe to a corporate welfare [noise] those millions that have been given for many uh developments that are produced only a few construction job no long term jobs that's going to be dramatically reformed and many of those millions are going to be caught\nAnd fun has his own challenges in this blue state he has to tout his conservative credentials without hewing too closely to President Trump and then there's this wild card deny our knowledge\nAnd draw votes from Mr ...\nI Want to draw who to vote for some\nJokes shrill oh news running as an independent and he could get a big chunk of conservative votes at phones expense thriller was the chair of President Trump's twenty sixteen campaign in Rhode Island\nOf ... and I would ... into a month I'm tired of the party politics\nSo how will vote was three candidates do in the race for Rhode Island's governor\nTo get some answers to that question I went to this very busy street corner in downtown Providence of course the capital of this tiny little state and I asked Maureen locally\nFor some guy that she's a political scientist and she's been following politics in this state for very long time I lived in Rhode Island to thirty three years you know the lay of the land [noise]\nPretty much yeah why did you bring me right here in this spot in downtown friday I thought if we were talking about this race this would be a good place to illustrate some of the changes that have gone on in the past decade say\nWe were in worse shape\nAfter and during the recession we were at the bottom\nWe were the last to come out of the recession no I've heard this a couple of times talking to Rhode Island or if you were the first to go in and you were one of the last to come out right and I think that's because we had a a workforce that was relatively\nUh on train for new technology but up until fairly recently\nFactoring a middle class living\nPot in his little cottages down at the shore and things like that\nBut all that changed you know in the eighties and nineties and so when the recession hit we really weren't prepared for what was coming\nStruck it it really hit us hard how much did that pain affect the political psyche of the people here\nI think they were pretty cynical about politics if we had been\nSo long at a disadvantage economically and people people it promised things and not a lot of big changes occurred in addition to that there was a sort of a Hail Mary pass made by the last administration Republican administration said attempted\nTo a fun with state funds are gaming sort of video game\nCurt Schilling that went sauce in the Boston Red Sox pitcher for the Boston Red Sox Fisher it cost us like you know over like Ninety million dollars initially we got some of the money back\nBut that really gave people an jaded perspective on economic development and what people were doing so added to the you know the the long downturn sort of deep recession we had\nThis was an attempt to pull us out\nIt failed and it left people pretty cynical\nAnd yet here we are today twenty Eighteen we're about to come up on the mid term elections in a big gubernatorial election here in Rhode Island\nAnd we see construction crews here hard at work on a project\nRight well the thing is we are in a good spot now in other words we have come out of this recession our unemployment numbers are above the national average I think that's why you see all the trains in the sky and so forth\nLet's talk about Alan from he is a Republican and the polls do show run on to a head but not by that much\nIs that a surprise to you in a blue state like this is going to be an interesting race is not going to be a cakewalk for Dina reminder she's going to have to work really hard and she's gonna have to get out of her voters so in that sense I Am not surprised there are people in this state who are concerned about\nOld Rhode Island what it was like ... and Alan songs message resonates with them\nGot a good story he's got a good story he's the son of Chinese immigrants he worked in a um Chinese restaurant they went to a local college where she is Yale Harvard roads are so it's a very very different picture\nThe most recent University of New Hampshire poll which came out after my conversation with Maureen locally has run Mondo\nPulling ahead but even in deep blue New England you can't discount the conservative vote\nAnd there are pockets of Rhode Island were fun will do well\nWe were walking by the inch water water and a\nFour miles a day rain snow sleet right here in this part of the most part\nI met flung supporter Ron and Conan his friend Alan ... on their daily walk around a pretty little park in the city of Johnston Trump beat Hillary Clinton here by fourteen points two years ago\nWhat are you leaning towards right now I'm leaning towards foreign yes and what the cause we need change change of leadership\nWhat's wrong with the way the state's going bankrupt the pension funds are not funded that's the problem you brought up a very controversial point Gina Raimondo and what she did with the pension is that something that's still bothers you got spoke\nW. E. V. S. Nashua idiot point three W. E. D. H. Hanover Ninety One point three W. E. V. in Keene Ninety point seven\nOr ... one of seven point one W E v J Jackson Ninety nine point five W ... broke Ninety point three and W. E. B. Q. Littleton Ninety One point nine an on line that an H. P. R. dot org\nFunding for here and now comes from network graders ... accelerating the pace of engineering and science learn more and I met ...\nDot com boom and the R. N. W. E. or Boston I'm Robyn Young I'm\nJeremy Homs and if you're in the coming up as President Trump surveys the storm damage from hurricane Michael today we'll hear from a family that lost their home\nThere the moment that we didn't realize that everything that we build you know the family and his home is gone and not including our community that the place we love her or golf and\nAlso the latest in technology for the blind including a camera on your glasses you could hook up to a sighted person\nIf I double tap on the home button on this phone call in and are raging\nIn ages hunting starting video please wait [noise]\n\nNews stories and President Trump sixty minutes interview coming up here and now the news is first\nLive from NPR News in Washington I'm Lakshmi Singh a joint Turkish and Saudi investigative team as searching the Saudi conflict and assemble turkey nearly two weeks after journalist ... entered the building and apparently never came out he is feared dead\nThe mystery surrounding his jokey whose columns have been critical of Saudi crown prince Mohammed bin Salman puts the Trump Administration in a highly sensitive diplomatic position with the U.S ally in the middle east NPR's Michel ... element is traveling with secretary of state Mike Pompeo who is on his way to Saudi Arabia this hour to meet with the crown prince his father Washington\nPost columnist Jamal 'cause Yogi was last seen entering the Saudi constantly in ... earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to your show gay Trump says he spoke by phone with gangs all non edits ending his secretary\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord ... to the consulate and killed him there and\nThe cases draining us relations with Saudi Arabia and the Trump is made clear he doesn't want you disrupt lucrative arms deals Michele ... NPR News the state department\nShould President Trump ever make another Pocahontas dig against Senator Elizabeth Warren the lawmaker from Massachusetts will respond with a DNA test she has released the results which offers strong evidence that she has Native American heritage going back six to ten generations\nUntil now Trump never seem to believe warrants claim at his rallies he has mocked her as a fake Pocahontas or a markets deeply insulting to Native American groups several months ago in Montana he even better generous donation senator warrants favorite charity if she could proved him wrong I Want\nTo ours favorite charity\nIf you take the test of the shows\nOn his way to Florida this morning President Trump told reporters\nHe never said that the\nPresident and first lady Melania Trump are in Florida this our viewing hurricane recovery work NPR's Quil Lawrence reports from the Florida Panhandle hundreds of people are still in shelters\nTarps and chainsaws are in high demand as residents clear fallen trees and patch up the holes in the ruse made by hurricane Michael's one hundred fifty five miles per hour winds\nElectric generators or sought after with power companies still tentative about when the lights might come back on there is no cell phone signal and much of the region locals have been getting tips from radio stations about where they might find gas\nFood and water distribution and medical care traffic in and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flew into the pan handle from all over the state Quil Lawrence NPR News Miramar Beach Florida\nThe Dow is up twenty nine points to twenty five thousand three hundred sixty nine an as that goes down twenty seven asked him he's off one this is NPR\nIt's one oh for this is an H. P. R. News I'm Peter below Republicans and Democrats used the weekend to rally voters across New Hampshire an age PR is Josh Rogers has more\nGovernor Christian into campaign to the north country his father John ... Republican volunteers and Exeter I Am ... and the former governor is joined by first district GOP nominee Eddie Edwards\nJobs to make sure to Washington DC says that fool my out of our state that's what this is all about\nThe Democrat running of CD one Chris Pappas campaign alongside firefighters as a little chillier in London dairy Andover\nAnymore takers hair so you still got to wait and then the weather right from the weather\nDidn't deter Audi staters Republican outrage was boosted by a group of volunteers calling themselves Chinese Americans for Trump\nIn this country so American for\nNew York city Mayor Mike Bloomberg meanwhile visited natural urge activists tobacco gun control another New Yorker actor and Trump impersonator Alec Baldwin was in Manchester last night the\nHeadline in the state democratic parties and full fundraiser for an age ... News I'm Josh Rogers\nA shortage of substitute teachers is affecting districts across the state Carl lab is the executive director of the New Hampshire school administrators association says the shortage can be particularly difficult for high schools where it creates a scheduling problems it's\nVery very difficult or with a shortage of substitutes to try to maintain a high quality program uh each and every day for all children\n... says low unemployment numbers and new guidelines on the number of hours retired people can work and schools are contributing to the shortage has some showers today with ties in the mid to upper fifties and for tonight showers are likely lose around forty and for tomorrow sunshine again ties in the mid fifties\nSupport for H. P. R. comes from listeners like un from the Richard's group creating Employee Benefit commercial insurance and retirement plans allusions for employers throughout the region the Richard G. R. P. dot com\nAnd I'm from the comments flying monkey movie house in performance center in Plymouth\nFeaturing artist movies more event calendar and flying monkey and H. dot com support for NPR comes from the three ... three Powell ring enterprise digital transformation with artificial intelligence predicted ... an eye on the solution is to learn more and the\nThree I O T dot hey I Am ... foundation at ... dot org [noise]\nFrom NPR and WB you are I'm Jeremy ... and I'm Robyn Young it here and now in today President Trump answered reporters' questions before boarding air force one to travel to storm ravaged Florida in Georgia\nAsked about the disappearance of Saudi journalist ... Trump said he spoke with the king of Saudi Arabia\nSticking firmly denied any knowledge of it [noise] you didn't really know I I don't want to get his size but these are sort of thing for\nPresident Trump also said he sending secretary of state Mike Pompeo to Saudi Arabia let's kick off the week ahead in politics with NPR lead political editor demand ... now how medical\n... are going to learning or afternoon [laughter] let's start with\nA missing Saudi journalist the president picking up on a theory that your colleague NPR's Jackie Northam told us is popular in Saudi Arabia this was broke killers\nBut in a consulate you know even Republican lawmakers want punishment that the president seems unwilling to carry out in blocking an arms deal when what do you what's your sense of what's going to happen here well\nIt certainly complicated geopolitically for this president he seems to have revealed himself pretty plainly as somebody who wants to talk about you know specific transactions during the very transactional person this is the way he was with his real estate deals and the thing that kept coming up for President Trump was the fact last night on sixty minutes that\nHe said look they we get billions of dollars in a you know these weapons sales and he doesn't want to hurt jobs when it comes to race yawn or any of the other uh arms makers\nWell and and as others have said these aren't really commitments for sales are more like promissory notes ... you know they they may not having any way but and some of the most us did happen under the Obama administration but you mentioned the sixty minutes interview he was also asked about that die report from the inter governmental\nAgencies are claiming that a climate change is real and time is running out to do something about it\nThe president said he's not denying that climate change exists but that it could change back and that people say that storms or as we just saw it with hurricane Michael were worse years ago let's listen to this conversation with Leslie stall\nThey say that we had hurricanes that were far worse than what we just had with Michael says that they say I mean they say that India but what about ninth scientists say it's worse than ever are\nYou have to show me the scientist because they have a very big political agenda the medical\nWorld climate change is real uh that's the thing that we've had an editor neighbor ended right [laughter]\nAh but this is a president who again is very transactional he's not somebody who's very interested in the long view or the science he's interested in making sure that the economy stays where it is so that it benefits him politically and I think again that's what we continue to see and continue to talk about he's not somebody with a vision\nFor the globe or as much as he is somebody who's trying to win the next battle and move on and it's something that he talked about it\n... hours this afternoon high temperatures in the fifties cloudy showers this evening clearing often the overnight low temperatures tonight upper thirties to mid forties sunshine tomorrow high temperatures upper\nForties to lower fifties [noise] this is an H PR [noise]\n\nFunding for here and now comes from the listeners of WB or Boston and college fine where consultants work with high school students to identify and achieve their goals in high school complete the college admissions process and negotiate merit scholarship awards more at college find dot com\n\nIt's here and now and now look at some of the latest technology for the blind and the vision in haired with our friend and go to guy Brian Charles and director of technology at the ... Center for the blind\nAnd bring it all sorts of things spread out here in the studio and I were making a video so people can see this for their loved ones were posted it here now dot org but what would you like to start\nI'm going to start with the simplest of technologies one that has a lot of impact on blind are visually impaired people and that is our ability to pick the right medicine at the right time he had a medicine medicine bottles here and attached to its side is a little digital recorder\nNow there's kind of comical a recording on here [noise]\n[laughter] [noise]\nWow what a timely saying\nOf having to put rubber bands on to indicate whether or not this is a once a day or twice a day or three times a day mad I can rely on this kind of\nAt first of all who did it Abraham Lincoln had it for ... yeah\nYeah for Xanax now is this is one example of two or three different companies out there the one that I tend to get my medications from is a mail order place but I can also get this from just down the street at the local pharmacy and they know cats so that's that is now a lot of\nPeople these days are having to deal with diabetes and as a mine\nAnd therefore you have to take your blood sugar on a regular basis you tested so I've just taken the test strip out and I'm going to the slightest into my glucose monitor\n[noise] she's just acknowledge him making that she couldn't tell me [noise]\nPlease apply blood test strips so I could uh put my finger put the blood on there and that will tell me my blood sugar and it keeps track of it over time you go bye-bye [laughter] it keeps track of it over time\nSo that when I go to see my physician they can download the data from it is now also in my little bag over here um I Love\nThe kitchen in my household it's my favorite Rome I Love to cook and so I'm forever looking for gadgets that will make my life easier so in my kitchen ever talking microwave oven I have a talking kitchen scale so that when I'm baking I can measure by weight rather than by volume\nThose kinds of things you also have been talking for monitor like this one because among other things pushing the button a couple of times [noise]\n\nThis I can switch from Fahrenheit disintegrate and it can take very high temperatures and not taken out of my bag a\nWell they're called adopt part of the echo families and in my household we have a a big echo in the living room and a little dots here and there throughout the house\nLet's be honest I uh I don't like your wife to hear this like you do refer to this as your new\nGirl than it is yes she go is definitely my new girlfriend the facts of the matter is that she wakes me up in the morning she sings me to sleep at night it sounds like a girl friend to me\nAnd I would just like there's so many more devices when you see them but I'm just wondering what life is like in your house\nWith the ... it just is a revolution for you but I'm also thinking that there's just got to be voices going all the time you're talking to relax and asking her to turn a light on or off and you know the radio on or off or you know testing your blood or it just it feels like there's a Greek chorus fire you know there's a\nLot of chatter that goes on in the house no doubt I'm very lucky that I Know braille so I'm a portion of my access to information comes back to Lisa nobody gets to what's going on\nBut one of the absolute phenomenon in my household is eyes get out of bed first had to the bathroom I turn on the shower the sink flush the toilet and step on to my talking scale 'cause I don't want the rest of the household here with the bad news or the morning is from that talking scale\nSo we learned a mascot we control volume and with the new eco family only the one closest to you responds and so you don't have this problem has seen something down the hallway only a habit change something in the living room yeah that kind of thing that\nI mentioned frail a moment ago no braille hasn't been around that long a just a couple of hundred years and it's still under development of we recently adopted in international standard for English Braille because the the Brits wrote braille differently than the Americans than the Australians [noise]\nBut the big change in braille\nI'm going to turn on this orbit reader mhm it looks like a hand held label printer [noise] what's it doing little dots electro mechanical dots are raising up in the pattern of braille characters now a couple of years ago I was showing your roof ritual braille display\nAnd you were astounded at the price of three thousand four thousand dollars this one now costs five hundred oh wow so\nBraille is becoming more affordable than it's ever been before\nAnd now I'm going to turn to magnification ... the vast majority of blanket visually impaired people have\nUsable vision so out of those who are legally blind about eight out of him have some usable vision so we use closed circuit TV devices I'm going to turn this one on ...\nLooks like a very small TV you know\nDidn't come on yet\nIt gives me controls to show things in magnification to increase the magnification decrease it changed the polarity of things so am I see things better white on black than black on white defined I can switch that you can also take a picture with it\nA at a distance bring it closer to my face and be able to control that magnification as well and if you do have a large\nTV in your living room you can attach this to that and use it screen but the device that's on your camera this on your device and really enlarging image so grandparents ... with low vision can see pictures of their grandkids are so this makes it very portable for them to do that when it's like\nWe know you have catch the bus that's an application that it can help you find the stats learn a rival departure times blind square that a GPS application just like foursquare but I Want to see the device it helps you know the color of your clothing\n[laughter] so the color identifier that are brought to show your last time costs three hundred and fifty dollars this one costs twenty six wow and this is maybe a temp the side so that one yeah it's like a car key fob exactly I'm going to hold it against my time [noise]\nJak orange that trait that dark red states [noise] God be [noise] now I'm pointing it at my pants and they say [noise]\nVery dark brown that lying I'm wearing a look at black pants a gray and [noise] yeah that\nTells me guess what the batteries dying oh [laughter] when is it that far off\nWow so I now match my own parents which church with ties in my household something that I always had to rely on somebody else to do in the past I Want to see the classes that get help with so\nAnd I'm going to take off my regular designers shades hear them and put her on a pair of glasses but they have a camera mounted just above the no no way so I'm now going to take a phone it's specifically a over rice and phone\nThat has only one purpose and that's to do what I'm about to do with it so I really ready for service and now if I double tap on the home button on this phone it's calling in Iran agent\n[noise] [noise]\nHey Cody Brian here I'm I'm doing a demonstration of Ira for public radio Hi Cody and across the way here is my interview were\n[noise] [noise] [laughter] [noise]\nI'll trade freaking me out [laughter] [noise]\nAnd I hear your class [noise] yes [noise] [laughter]\nSunshine tomorrow high temperatures upper forties to lower fifties for Wednesday mix of sending clouds across most of the steak cloudy some showers in northern New Hampshire with high temperatures upper forties to lower fifties [noise]\nAnd then partly to mostly sunny on Thursday with high temperatures mid thirties to the lower forties [noise]\nThis is an HP aren't [noise]\n\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station\nFrom home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major re models\nHomeowners can read reviews of local pros and book appointments online at home advisor dot com and Geico offering motorcycle an RV insurance more information available on motorcycle an RV insurance at ... dot com or one eight hundred nine four seven auto\nIf hearing now back to President Trump's comments last night on sixty minutes continuing to question the importance of addressing climate change\nLook I think something's happening something's changing and it'll change back again I don't think it's a hoax I think there's probably\nI don't know that it's manmade I Will say this um\nI don't want to give trillions and trillions of dollars I don't want to lose millions and millions of jobs I don't want to be put in a disadvantage\nWell others are pushing forward in fact they're fighting there saying that fighting climate change can be job producing and we're running out of time according to last week's Intergovernmental Panel on climate change there's just about a decade left to take on President action to reduce to reduce the exchange impacts of climate change\nTheir report recommends reducing current emission is being released into the atmosphere but also capturing the carbon dioxide that's already out there what's known as negative and missions so let's take them with greatly manage a professor of public affairs and environmental studies at the ... school of public affairs at the University of Wisconsin Madison\nProfessor technologies will be needed to do this but one of the easiest way the carbon dioxide out of the plants right because they just suck it out\n[noise] yeah so growing things so using photos synthesis to takes you to go to the atmosphere and then store it into would in a tree or in plants that has the potential to remove\nBillions of tons of you to from the atmosphere so that's really appealing it all of these uh schemes to remove seem to have negative have some concerns about them and the biggest one with\nPlanting more trees is that if you're planting trees um that's land that potentially could have been done something else with and if it's if that's something else as growing food um that's a real concern because that's one of the biggest impacts of climate change is worrying about crop yields in the future\nAnd if we're going to have food prices go up because we're using land for food and using it to ... to a that's a negative negative effects and things like growing trees that we think are pretty benign um have negative impacts because the scale has to be so large\nWell and also we know the dead trees only store carbon for so much for so long I'm it may not be long enough\n[noise] yeah there was a permanent issue with a story for you to in um injuries that um is not such an issue for storing it underground for example\nOkay so let's move on to some of the other ideas carbon capture storage what are some of the ideas there\nSo the idea with carbon capture traditionally has been you take a a\nPower plant that's using fossil fuels and instead of venting the CEO to into the atmosphere which is what we do now you find a way to collect it in the flu gas and\nCompress it put it in the pipeline and stored underground so that's a way to avoid seemed to going into the atmosphere with negative emissions there's a way you can actually remove CEO to the atmosphere using that scheme by again\nPlanting crops and instead of using the crops for food you would use them for energy it takes you to that's in the atmosphere photosynthesis will store that CEO to into the crops\nThan you burn the crops and the power plant and instead of putting that suit to back into the atmosphere you're going to do the same thing compress it and stored underground and\nThat has the potential to remove\nA billions of tons of ... too and in this case stored underground where it tends to be more stable and will stay there as long as we needed to it has a similar negative side of the fact that we had with planting trees in that you need to use a farm land for growing those crops so for using that land for\nCrops that we're going to use to store ... two and put it underground we're not using that for food and again that could a crate and food security issues which is something we want to avoid what\nAbout ... and by the way I just said Steven Pinker is a terrific and provocative new book and lightened it now and you know he talks about the fact that a lot of this is going to be on a technologies that we aren't you know we don't even have\nSupport for an HP our live stream comes from you our listeners and from radiation energy a local employee owned company helping thousands of granite staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nAnd capture CEO to this and the air capture that's due to compress it and then store underground\nThat is appealing one of the most appealing aspects of that is it doesn't have this large land impact\nThat almost every other one of the schemes has the biggest downside so far has been it's been dismissed as a prohibitively expensive so\nSomething like three or four times as expensive as these other schemes\nCrime or actually a Swiss start up and they say the costs of between six hundred and eight hundred for metric kind of sealed to captured 'em there's another company in Canada that protect closer to two hundred and fifty per metric time but they catch expensive\nThat's expensive and just to put that into comparison if you look to kind of the average price of CEO to over the whole world now I think the number of about five dollars is about right there is other places it's high like in Sweden and then you you've got prices in twenty to thirty dollars but overall it's about five so that's that's way higher like by a factor of a hundred\nBut I think what's interesting about those technologies is the concepts come down so as you say climb works did this first the world's first demonstration plant a about a year ago and that was six hundred dollars per ton of Syria to\nTheir next plan plants they're saying they can do for between a hundred and hundred and fifty dollars per ton of CEO to\nThere's another company called carbon engineering and Canada has things that can do it for about a hundred to two hundred there's a U.S company called the global thermostat\nThat uh is doing it the first demonstration in Alabama this year\nAnd they think that'll be about a hundred and fifty dollars per ton and they have plans to get it down to a hundred after that so this idea that the\nCosts of technology makes it impossible and we should just um dismiss it it seems to be I'm falling away as we look at some of these real plans being built without severe problems and with costs of seemed to be starting to come down so there's the potential\nTo really get the costs down to make it affordable and not have a lemon juice impacts\nOne of the biggest concerns that I Would have is to do this in a real way\nWe need to be removing billions of tons of CEO to by mid century\nUm and so we need to be doing this on a large scale pretty soon right now so there's three companies we've mentioned that's it for the whole world and in terms of commercial director or capture and I\nI think that adds up to about four hundred people in the world employed by these companies\nBut that really doesn't fit with the scale the challenger facing so that's that's the real challenge for direct heir captures how you scale up from three companies doing on the order of five or six plants to something like six hundred thousand plants is which is what we're going to need and the next five or ten years\n[laughter] what six hundred thousand well are you getting the investors excited about that [laughter]\nYou know that that may be the future but look again Steven Pinker writes set the more speculative and and this kind of thinking includes plans to disperse pulverized rock it takes up CEO tuition weather's too at alkaline clouds of the oceans to dissolve Morsi oh Timmy underwater\nFertilize the ocean with iron to accelerate flown since it's just like plankton\nAnd again ... out of the atmosphere in different ways what do you say though to how her tag on a fellow of seeing things at MIT who says in the fact that there's a danger that this might lead to complacency in reducing a sea of two emissions if people start thinking\nYeah yeah there is this concern and it's um it's sometimes\nCalled a ... term for his moral hazard this idea that\nIf you have this technology available it's kind of like an insurance policy and then you'll engage in risky behavior and in this case it means you won't reduce the missions uh enough\nI I actually think we're not we don't really have the the luxury of dismissing this negative emotions technology is something that I'm able to take away our incentives I mean it's kind of like you know an insurance policy for a house insurance or fire insurance or something like that where\nYeah maybe there is a sense in which if you have the insurance there'll be less careful about fires in your house but on the other hand most people still want to have a insurance because it's it's worth it to them and it's worth it to society and I think that's kind of the way we have to\nHave to look at it I think the other thing is you know we're", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Keene", "day": "15"}