{"month": "11", "state": "WI", "station": "WORT", "content": "After almost a decade of fighting she wrote through prison the courts a hunger strike and through the insurance company I finally got the surgery this week\nShe didn't take any time off from her activism however quickly condemning the latest anti trans moves by the Trump Administration laws don't determine our existence she tweeted we determine our existence\nHouse of commons who's waded into the logjam defer to establish marriage equality in Northern Ireland the only major part of the United kingdom without it the legislature and heavily Roman Catholic Northern Ireland is dysfunctional Judah fractures policy differences between the two major parties primarily over marriage equality and ...\nAnd same gender couples legally married elsewhere are only recognize as civil partners\nAnd women seeking a safe abortion must travel to England for the procedure emergency legislation giving Northern Ireland civil servants more decision making authority until lawmakers can resolve their differences included an amendment instructing Northern Ireland Secretary Kerry and Bradley\nTo issue guidance on the continued enforcement by civil servants of laws would outlaw abortion and denies civil marriage to same gender couples and to report quarterly to parliament on those issues\nThe amendment was sponsored by labor and tore MPs and passed in the comments by a vote of two hundred seven to one hundred Seventeen\nHuman rights activists cheered the action while mostly symbolic they say it puts more pressure on Northern Ireland lawmakers to get their house in order including the passage of marriage equality a moose supported in poll after poll by an overwhelming majority of the people who've Northern Ireland\nThe country's high court heard a legal challenge to Northern Ireland unequal marriage laws in September\nA sixteen year old gay activists in Russia unexpectedly wine and appeal this week of his conviction of violating the country's infamous law against promoting nontraditional sexual relations after he posted several photos of shirtless men hugging on social media\nMaxine never off is believed to be the only suspect under the age of Eighteen to be charged with that offense since ... signed the so called no promo homo bill into law in twenty Thirteen the teenagers lawyer art some lap off from the advocacy group Russian algae Beatty network applauded the legal victory\nThe court used to the principle of the presumption of innocence and came to the conclusion that never robs guilt and committing the fence was not proven he said on the basis of this are complaints were satisfied and the decision of the commission on juvenile affairs was canceled\nActivists never off some sources say does not identify as algae B. T. Q. believes that law enforcement started to monitor his activities after he organized an anti government gay or pollute and performance in may\nThe European Court of human rights ruled last year that Russia's no promo homo law violates regional treaties\nThe right to freedom of expression and of algae B. T. Q. people to not be discriminated against the putting government dismissed the decision as unjust the law has been used across the country to ban the so called promotion of algae B. T. Q. rights including pride events and even the display of ramble flags\nAlgae ... people on the majority Hindu island of Bali thought they were relatively safe and anti queer predominantly Muslim Indonesia where government officials in security police had been leading a steadily escalating series of attacks on sexual and gender variant minorities\nBut homophobic Muslim groups pressure the owners of the convention hall and dentists are bullies capital to cancel a beauty pageant organized by the guy to water foundation\nAnd HIV aids prevention in education group\nThe annual event has been held successfully for the past three years twenty four contestants narrowed down from a field of eighty contenders all Indonesian were said to compete in separate Mr and Mrs categories\nThrough telling performances and a drag show all finalists were required to undergo training and demonstrate knowledge of sexual health in HIV issues\nAre fearful bunnies gay man who only disclosed his first name a gloom told the voice of America that I thought Bollywood have that space for us to be ourselves it doesn't have that bubble anymore\nO. G. P. T. Q. activists and their allies rallied outside Australia's parliament this week chanting where's the bill they were calling on prime minister Scott Morris and to make good on his promise as our city correspondent Barry McKay reported last week to offer legislation to ban biased against clear students in religious schools\nGreens senator Janet Rice spoke to the rally in ... joined by a few other lawmakers representatives of the human rights Law Center rainbow families and parents of gender diverse children along with some of those children\nRice noted that the current session of parliament was virtually over she promised that if it's not at the top of ... legislative agenda and the next session assuming he's still prime minister her party would do his job for him\nAnd finally cigars all around for a pair of Aussie penguin dead at cities see life aquarium\nCaretakers first notice that spin and magic head for him to close bond ahead of breeding season and it's been it even offered magical special stone\nWhich a staff member explained was equivalent to proposing the love language of penguins the penguin partners began hoarding ... to building of indicating their desire to start a family they were given in a band in egg and their baby chicks hatched this week initially named ... after it's to foster parents\nThe tricks permanent name will be chosen after its genders determined in about two months\nAnnouncing the news on Facebook the aquarium reported that the loving foster parents are co parenting exceptionally well to raise their young same gender periods are fairly common among penguins we love watching the ... parents doting and taking turns caring for their baby chick the aquarium Facebook posting gushed\nWe can't wait for the world fall in love with baby ... like they did with our amazing same sex couple spin and magic\nNews rap global queer news with attitude for the week ending October twenty seven twenty Eighteen follow the news in your area and around the world and informed community is a strong community\nUser up was written by great Gordon produce was brand new shoes are recorded in the studios or KPFK Los Angeles in the Bronx you buy\nHelp keep us on the air and in your ears always updated this way out dot org where you can also read the text of this news accounts for this way out I'm seriously name\nIt I went to ... [noise]\nThis just in a far right nationalist\nKnown as the Trump of the tropics has been elected president of Brazil with most of the October twenty eight votes counted social liberal ... was the feeding the workers' party is Fernando had dodge fifty five percent to forty five percent\nBoth ... has proudly denigrated L G BQ people women and ethnic minorities\n[noise] although twenty nine percent of where voters were expected to support both denaro as a reaction against corruption under the workers' party government his election has national algae Beatty cue and international human rights organizations sounding the alarm murders and other hate crimes against they'll G. P. T. Q. Brazilians\nHas skyrocketed during the presidential campaign both in our role as a fan of both Donald Trump and the brutal military dictatorship that ruled Brazil from Nineteen sixty four to Nineteen eighty five\nAnd other late breaking news the delta foundation of Pittsburgh reports that the October twenty seventh mass shooting at a synagogue where to place during a brisk for the newly adopted twins or the gay couple other sources say the prominent HIV specialist Dr Jerry Rabinowitz was among the slain\n[noise]\nJust how gay is Halloween is on the trick or treat you found out later in the program but first something even more scary and very real [noise]\n[laughter]\n\n[laughter] [noise]\nWith France activist responded swiftly and emphatically\nTo the news that the Trump Administration was working on a plan\nTo effectively erased transgender people from civil rights law a draft memo link to the New York times reveal that the department of health and Human Services was seeking to get the departments of justice education and labor on board with a unified definition of sex and title nine of the civil rights that\nThe Obama administration had pushed to to find protections against discrimination based on sex to include gender sexual orientation and gender identity this proposed definition says that sex means a person's status as a male or female\nBased on immutable biological trades identifiable by or before birth and uh\nThe sex listed on a person's birth certificate as originally issued shall constitute definitive proof of a person sex unless the budget by red liable genetic evidence\nProtests erupted as soon as the times published it's piece on October twenty first and the pictures of trans people with the hash tag won't be erased flooded social media a coalition of organizations held a press conference at the human rights campaign the following morning [noise]", "show_name": "This Way Out", "year": "2018", "city": "Madison", "day": "01"}