{"month": "10", "state": "AZ", "station": "KOFA", "content": "[noise] Arizona was in college will be hosting a CPR proceed certification class with instructor Joanna Eliot there will be the Saturday October twenty from nine AM to one PM at the either we use the gym which is located on the east side of the human cap is if you'd like more information you can give us a call at nine to wait three four four seven six nine zero\nThanks for listening to K O F ... Thirteen twenty I Am and border radio easy dot org a service of Arizona west in college we also broadcast on the Arizona community radio network at eighty nine point five of them have Jay Z a Drake Williams Ninety ...\nNinety point seven FM kj the cake Kingman and Ninety One point three of them Flagstaff\nIn observance of Hispanic heritage month assemblies library will host or fifth annual or explosion featuring the art work of local hard is it continues through October fifteenth assemblies branch library paying Seventy five north sixth avenue you can find further details are you my library dot org\n... borders or Mexico ... Argentina created is the lack of rock pop hip hop music [noise] sixty minutes between ... artist like Holocaust fabulous a Cadillac better fuel for a lot of child\nMonday evening at seven on board or radio Thirteen twenty and [noise]\nOf the clear tonight and you move low around sixty three degrees gets up to twenty five miles per hour from the north a bit when you tomorrow as well let's get up to thirty miles per hour from the north and sunny skies a hundred Seventy seven\nIs it an alternative [noise] sixty minutes each week sliding artist like Holocaust fabulous a Cadillac there for a lot of my child and\nMonday evening at seven on board or radio Thirteen twenty and [noise]\nMostly clear tonight and you move low around sixty three degrees up to twenty five miles per hour from the north when you tomorrow as well let's get up to thirty miles per hour from North in sunny skies hind you're Seventy seven in ... mostly clear skies a low around fifty seven gets up to thirty miles per hour\nTomorrow sunny skies hind you're Seventy eight and got up to twenty five miles per hour\n\n[noise]\n\n[noise]\nJazz and blues from radio Phoenix dot org visits ... broadcast nationally through P. R. act the public radio exchange in Pacifica networks audio poor distribution made possible with financial support from China or gold Paul made regular special and clay here holds for men and women shapes so\nHand merchandise retail locations in the u._s. or global online store at ... dot com in China or gold on\nFacebook promotional consideration for this program is provided by men musical instrument museum\nThe world's only global musical instrument museum and the music theater at ... boulevard in Phoenix mayhem dot org your host for this radio series it's Tom Cole and get a downloadable MP three of this and other hours\nWith playlists or listen anytime at full moon hack saw dot com\n\n\nMm\n\n\n\nPre law to make\nAll looked frail yeah\nPlease do not want to hear from the\nMust take the ...\nThey get a strain [noise]\nDon't you know I'm\nAnd again and again I'm a lot\nBetter get up on the age range\nThat again I'm a lot\nTo get up on the train\nTake the train you\nThey shouldn't miss the age range\nYeah you're going to be\nDa de da de\nDon't want to get a big giant ... you don't want that they have\nOlder I get a hollow metal\nWas on a chain of\nEating that me and I'm\nRarely da da da\n\n... Anderson from an album Concord to London in the days of the Concord jets to Concord, California from London why not she was doing to kind of like the solitude I got it bad at night I had good\nDo nothing till you're here for me to take the train all ...\nRight now I've got some Latin music and this is Irving Berlin's blue skies by the H I made salsa jazz orchestra [noise]\n\n\n\nNa\n\nNa\nNa\n\n\nNa na\nNa na\nNa and\nDid and\n\n\nIn the\nHad at\n\nHarold Lopez new say is a resident of Havana and he came through town it's great to be able to have residents of Cuba common place for us\nAnd the Lopez new says they're nice guys it's Harold Lopez new leader and piano and his brother Roy on the drums so wonderful combination\nI was a little out of shape on winging at but roughly translated this album is just another day and it's a bold statement was pretty melodies ... took piano duo up and substantive\nAnd then the bed both Valdez tribute to I never realized ... chose\nFather to Cheetos grandfather\nLet's see that's put on Instagram the picture of the ... being played sparsely uh melody only by the drummer blowing into it to rather than a mouthpiece and here's attracted to the trio played is called Hialeah it's named for a Miami neighborhood where they get together and hang play dominoes and such\nFor the encore a very beautiful locked and piano style on a ballad\nHeroin Lopez new show and then again we heard Hialeah off of a new CD\nHeroin Lopez new show now and again we heard Hialeah off of the new CD [noise] too\n[noise]\nYou do not need a recognizable name a household named like great music is evidence there by guitars to run a feat in his tribute to fifty second street to street of swimming in the forties or New York city\nBut this uh Ninety treatment of Ted damper on Ted's delights ... Tom top of the day and we go now to a belated fulfillment of a request by blues man Robin for\nBang bang bang\nShe became the\nThey didn't know\nMe\nMother and father\nPlaylists or listening anytime at full moon taxed on dot com\nThe human county library is hosting small business workshops presented by Andrew Solomon this week there'll be featuring build your own product or service that will be this Friday afternoon for three to five at the humane library twenty nine fifty one twenty first Dr you can find further details that you my library dot org\nBroadcasting from the campus of Arizona western college does its border radio Thirteen twenty am kale let's say you might end border radio ac dot org\nWe also broadcast in Arizona community radio network at eighty nine point five that's engaging the age ... Williams Ninety One FM cage ACP press get Ninety point seven F. M. K. J. C. K. king meant in Ninety One point three offense like staff\nEither BCS health and wellness department will be hosting a domestic\nTwenty nine fifty one cell twenty first Dr you can find further details that you my library dot org\nBroadcasting from the campus of Arizona western college does its border radio Thirteen twenty A N K O F am I Am born and radio ac dot org\nWe also broadcasts an Arizona community radio network eighty nine point five FM cagey C H ... Williams Ninety One F. M. K. J. C. P. Prescott Ninety point seven F. M. K. Jaycee kicking men in Ninety One point three ethane Flagstaff\nUPCs health and wellness department will be hosting a domestic violence on breast cancer awareness walk this Wednesday starting at ten am at the three ... building breeze way on the human capital if if you like more information you can contact us at nights a week three four seven six nine zero\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world you in case a double you see and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty seven at St Paul cultural center for information visit K. A. W. C. dot org this event made possible in part by a grant from Arizona humanities\nMostly clear tonight and you move low around sixty three degrees gets up to twenty five miles per hour from the north\nA bit when you tomorrow as well with gas up to thirty miles per hour from North and sunny skies behind you're Seventy seven in ... mostly clear skies a low rent fifty seven gets up to thirty miles per hour tomorrow sunny skies hind you're Seventy eight and ... up to twenty five miles per hour\n[noise]\n\n\n[noise]\n[noise]\n\nThe the little league\nJazz and blues from radio Phoenix dot org business school have stopped broadcast nationally droopy are asked the public radio exchange in Pacifica networks audio port distribution made possible with financial support from China or gold Tom made regular special and clay here holds for men and women shapes soap\nAnd merchandise retail locations in the u._s. or global online store edge China or go dot com in China or gold on Facebook promotional consideration for this program is provided by members musical instrument museum\nThe world's only global musical instrument museum and the music theater at ... in Phoenix ... dot org your host for this radio series it Tom Cole and get a downloadable MP three of this\nAnd other hours with platelets or listen any time at full moon hacks da da da\n\n\nThe truly international big band a frenzy bowling Dane County clerk Belgium born pianist rent the Boleyn than American born Kenny Clark drummed gold leaders Clark was the original number of the modern yet or just in Nineteen fifty three and fifty four based out of cologne in Germany\nThat recording was made in Nineteen sixty seven in Czechoslovakia big been disbanded after the death of the key soloist out those facts is Derek humble\nRecently I needed an architect of some sort and ended up in Nineteen eighty nine when some of the ... elections we were playing included the currency bowling Kenny ... big band in total blue super Saxon confirmation\nThe modern jazz quartet called led by John Lewis piano hinge Milt Jackson undivided played Burke and Venus and here's a rainy day\nRecently I needed an archive of some sort and ended up in Nineteen eighty nine so we might play bits and pieces of this this antique broadcast a little commentary from those days creeping in as we get through the ... elections as the mood takes us\nThe Duke Ellington orchestra Nineteen forty a wonderful version of the band he had and Jack the bear written especially for basis Jimmy Blanton\nAnother tune in a musical tribute to modern jet quartet performed on friday October thirteenth Nineteen eighty nine\nAt the ... Center for the art as a tribute to Duke Ellington ... Keith on the base with the M. J. cute did his imitation of Jimmy Blanton had the M. J. cue dejected they're reminding us all that it's just the blues all through the modern jazz quartets\nIndividually all four members had received their doctor it's been music to their last visit to the area for\nAlso the modern jazz quartets individually all four members had received their doctorates in music since there last visit to the area\n\n\n\nTo\nLittle\n[laughter]\n\n[noise]\n\n\n[noise]\n[laughter]\nIt or not but it\nThough\n\nHarold Lopez new say is a resident of Havana and he came through town it's great to be able to have residents of Cuba common place for us\nAnd the Lopez new says they're nice guys it's Harold Lopez new leader in Seattle and his brother Roy on the drums so wonderful combination\nI was a little out of shape on waiting at but roughly translated this album is just another day and it's a bold statement with pretty melody ... who took piano duo up and substance to\nAnd then the baseball Valdez tribute to I never realized ... chose\nFather to Cheetos grandfather let's see that's put on Instagram the picture of the ... being played sparsely uh melody only by the drummer blowing into it to rather than a mouthpiece and here's attracted the trio played is called Hialeah snake ...\nBut roughly translated this album is just another day and it's a bold statement with pretty melody is co hotel piano duo up and substance to and then the bat both Valdez tribute to I never realized ... shoot chose\nFather to Cheetos grandfather\nLet's see that's put on Instagram the picture of the ... being played sparsely uh melody only by the drummer blowing into it to rather than a mouthpiece and here's attracted the trio played is called Hialeah snake for a Miami neighborhoods where they get together and hang play dominoes and such\nFor the ... very beautiful locked and piano style on a ballad\nHeroin Lopez new show and then again we heard Hialeah off of a new CD\n\n\nYou do not need a recognizable name a household name to play great music as evidence thereby guitarist run up feet and is tribute to fifty second street the street of swing in the forties or New York city but this uh Ninety treatment of Denver on Ted's delights\n... Tom top of the day and we go now to a belated fulfillment of a request by blues man Robin for\nBang bang bang bang\nHe treated me the\nDay and that every day\n\nAbout me\nKnow there is", "year": "2018", "show_name": "Full Moon Hacksaw", "city": "Yuma", "day": "15"}