{"month": "10", "state": "AZ", "station": "KAWC", "content": "Doing K. A. W. sea and retired Arizona highways publisher when Holden at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty to seven at St Paul's cultural center for information visit K. A. W. C. dot org this has been made possible in part by a grant from Arizona humanities\nDesertion stadium will be hosting the Tony ... there'll be a contest for costumes and much more it will be the Saturday in the evening from six to seven thirty at twelve ... drive in Yuma, Arizona for more information you can call us at nine to wait three or four seven six nine zero\nA service of Arizona western college for more than forty five years this is K. A. W. the humor K. A. W. P. Parker eighty eight point nine at them and take a WC dot org trusted news for humor and the ... counties it's eight o'clock ah\nWell my girlfriend and I were driving down the road listening to the show one day and she kind of positive the question about which language has the most words in it\nThe only reason that you really need to know how many word there aren't any given language they only good reason is if the alien ... said that they were going to defend\nWords in it really the only reason that you really need to know how many words there aren't any given language the only good reason is it the alien said that they were going to defend to read the earth's if he didn't\nTell them dealing eventually way with words Wednesday evening and then ... the ...\nWeather forecast in Parker tonight clear skies with the low around fifty five degrees in northwest wind up around five miles per hour\nTomorrow sunny skies with high is reaching up to eighty five degrees with the ... south wind in Yuma clear skies tonight with a low rent sixty four and a column southwest wind tomorrow sunny but the high on your eighty six\nLive from NPR News in Washington on trial Snyder the newest justice of the Supreme Court will be on the bench in the morning when the court hears oral arguments NPR's Scott Horsley reports President Trump hosted a Monday Night ceremonial swearing in at the White House for Brett Kavanaugh\nKevin ... had already been quietly sworn in on Saturday hours after he was confirmed on or near party line vote he said he wants to put the contentious and emotional confirmation battle behind it and he promised to serve in a non partisan fashion\nI was not appointed to serve one party or one interests but to serve one nation\nWell Kevin O's remarks were conciliatory President Trump's were not Trump blasted Democrats for a campaign against Kevin ... he called dishonest and deceptive the president thinks ceding the new justice will give a political booster Republicans in the mid term elections Scott Horsley NPR News Washington\nFederal investigators are looking into that deadly limo crash in upstate New York to kill twenty people the chairman of the national Transportation Safety board Robert Sumwalt says his agency has hard questions for prestige limousine\nThe company's safety culture\nThe company's records\nRecords of prior clashes their management of drivers their fatigue management program vehicle maintenance fitness for ... driver fitness for duty we want to look at everything that we can related to the company that operated that limousine\nState police say the crashes the subject of an ongoing criminal investigation earlier this evening more than a thousand people attended a vigil in Amsterdam New York Florida's panhandle preparing for hurricane Michael's shelters expected to begin opening up on Tuesday ride daily of member station WFSU\nReports of Tallahassee mayor Andrew Gillum is urging the public to take precautions\nTallahassee mayor Andrew Gillum says north Florida has been battle tested through two major hurricanes in recent years including our mind to thousands Seventeen but he says the state's panhandle region should brace itself for an even stronger storm with Michael and Florida's capital city the mayor expects widespread power outages\nFor those who again rely on our electric utility system for their livelihood\nOr we would recommend that day\nA fine I'm a safer place to write out the mandatory evacuations have been called in some coastal counties Michael is expected to make landfall Wednesday for NPR News I'm Ryan daily in Tallahassee\nInternational Monetary fund seems more pessimistic about the global economy the IMF has released an update to its world economic outlook downright grading its forecast for this year and for twenty Nineteen\nThe IMF now says it expects the global economy to grow three point seven percent down from three point nine percent it was forecasting in July claiming a variety of factors including trade tensions between us and China this is NPR\nSecretary of state Mike Pompeo is calling on the government of Saudi Arabia to support what he says should be a thorough and transparent investigation into the disappearance of\nMike Pompeo was calling on the governmental Saudi Arabia to support what he says should be a thorough and transparent investigation into the disappearance of Saudi journalist ...\nIssued a statement tonight saying senior State Department officials have spoken with a Saudi Arabian government which will be as a critic of the Saudi Government who has written for the Washington Post Turkish officials believe he was killed inside the Saudi consulate in Istanbul last week\nInterior secretary Ryan Zinke he is taking action against new mining Montana's Yellowstone National park you know some public radio scale Adderall shows more\nLeaky returned to his home state of Montana\nIt signed papers that putting hold on mining of thirty thousand acres of federal land there\nThere was places the mind there's places knock them out\nAnd do you have to look at the American conservation ethic of best sorry it's best practices greatest good longest term\nThe land off limits to development is known for its natural resources and tourism the document extend protections put in place during the Obama administration and twenty sixteen that otherwise would have expired next month the withdrawal of Lance last Twenty years which is the maximum length of time and interior secretary Ken Grant\nFor NPR News I'm ... in ...\nThe regional markets a financial markets in Asia down and Tuesday trading Asian chairs are slipping following a mixed day in the U.S the Dow closed up thirty nine points to thirty and Monday trading but the NASDAQ was down fifty two points in the U.S in the end of the day almost flat this is NPR News\nSupport for NPR comes from NPR station other contributors include the Pew Charitable trusts celebrating Seventy years up serving the public learn more ... trust dot org slash Seventy and the ... foundation at ... dot org\nAnal sex stay with us for a beautiful night of classical music with Peter ... you\nMight take a double you've seen eighty eight point nine ...\nThe ... library celebrating the ... week with the book ... consistent viewing of a film adaptation gets on going down through Saturday October Thirteen at the ... library which is located at ten Seventy five notes sixth avenue in families\nIf you'd like more information you can contact us at nine to wait three or four seven six nine zero\nSome old so famous music by George Gershwin where you are right now it is called an American in Paris and we have a performance with the Cincinnati popped orchestra conducted by Eric ... [noise]\n[noise]\n[noise]\n\nMatter\n\n\n... ...\n\n... ...\n[noise]\n\n\n\n\n\n[noise]\nWell the work of George Gershwin it's called an American in Paris and it was performed by the Cincinnati pops orchestra conducted by Eric ... all\n\nThanks for joining us for classical music you like K. A. W. see eighty eight point nine FM and K. A. W. C. dot org a service of Arizona western college\nWe act K. A. W. see hope that we are an important part of your life delivering to use factual thorough news from trusted reporters and respected correspondence your donations or why we can do what we do so please consider making gifted day visit our website at K. A. W. C. dot org to donate\nAnd things there's guys in the forecast for human tonight lows around sixty four degrees with the ... south west wind tomorrow sunny skies with behind your eighty six\nIn parts are tonight we just got the low around fifty five and northwest wind around five miles per hour tomorrow sunny skies but behind your eighty five and a comment from the south\n\nWhen we're American piece before we turn to a\nMusic by one of the sons of Johann Sebastian Bach that will be a trio so not a here's a trio do by the American composer Amy Marcy Cheney beach she went by Mrs H. each a beach during her lifetime\nAnd this was written right at the end of her like Nineteen thirty eight music apparently she had this work on her mind for a long time but it makes use of some earlier pieces of hurts songs et cetera\nThe piano trio performed by members of the large quartet Joanne Polk is the ...\n\n\n\n\n\n\n\n\nMm\n\n\nAmy Beach compose music when she was Seventy years old and it's one of her last composition the piano trio Diane ... after ... ... ... that's called ... and the Joanne pope was the ... the first two mentioned members of the bark or ten\nYears another trio with the very very different sound to it because this comes from the Eighteenth century by one of the sons of Johann Sebastian Bach Johan Christoph ... box\nAnd it's a trio for violin and cello but ... and ... or this case for to get a Richard ER and Richard will and your shoulder all members of London broke with his music by Johan Christoph ...\n[noise]\nThe ... [noise]\n\n\n\nA\nGuitarist David Russell performing the transcription of music originally for the loop to buy Johann Sebastian Bach from his sweet number four ... high and\nThe races are on that he's up for grabs in every state keeping up with the mid term elections can feel like running a marathon\nIs about being out there every day on the front line here\nStaying on top of all the election is can be a challenge for all things considered helps you keep pace because of the bigger picture every afternoon on all things considered from NPR News [noise]\nObservance of Arizona western college for more than forty five years this is Kate AWAC Yuma K. A. W. P. Parker eighty eight point nine FM and K. A. W. O. C. dot org trusted news for humor and the ... counties\nIt's nine o'clock\nIn observance of Hispanic heritage month assemblies library will host or fifth annual our expedition featuring the art work of local art is it continues through October fifteenth assemblies branch library ten Seventy five north sixth avenue you can find further details that you my library dot org [noise]\nIn the Nineteen fifties the girl who took part radios for fun wanted to tackle advanced math\nOr guidance counselor had other ideas why do you want to take calculus to just going to grow up and have babies how she became a pioneering astronomer any way on the next big picture science [noise]\nSee the evening at Senate unpaid I mean the eighty nine [noise]\nWeather forecast in Parker tonight clear skies with the lower around fifty five degrees in northwest wind up around five miles per hour tomorrow sunny skies ... reaching up to eighty five degrees with the ... south wind\nIn Yuma clear skies tonight with a low around sixty four and a column southwest wind tomorrow sunny but the high on your eighty six\n\nLive from NPR News in Washington um trials Snyder new Supreme Court justice Brett Kavanaugh sounding conciliatory following the bruising fight over his nomination but President Trump is not\nWhat happened to the cabinet or a family violates every notion of fairness decency and due process our country a man or woman wants to always be presumed innocent unless and until proven guilty\nPresident Trump hosted the ceremonial swearing in at the White House for Brett Kavanaugh who says he wants to put the nomination battle behind him he used to be on the bench in the morning when the court hears oral arguments\nHurricane Michael is gaining strength the latest advisory from the national Hurricane Center in Miami says Michael's top sustained winds are now being clocked at Ninety miles per hour it's been soaking Cuba is expected to make landfall in the Florida Panhandle on Wednesday\nFlorida's governor has mobilized National Guard troops thousands of Gulf Coast residents being urged to evacuate\nProductions that hurricane Michael may head up the east coast as people in North Carolina worry NPR's Tom Gjelten says damage from Hurricane Florence two weeks ago still unknown and now residents are bracing for the potential of another storm\nWater has receded along the Carolina coast and the streets in Wilmington are mostly clear but no one is ready for another yet\nThe president of the chamber of commerce Natalie English says businesses are still assessing their losses and are in shape to lose power shut down all over again I don't like what I heard of that\nProductions that hurricane Michael may head up the east coast as people in North Carolina worry NPR's Tom Gjelten says damage from Hurricane Florence two weeks ago still unknown and now residents are bracing for the potential of another storm\nWater has receded along the Carolina coast and the streets in Wilmington are mostly clear but no one is ready for another hit the president of the chamber of commerce Natalie English says businesses are still assessing their losses and are in shape to lose power shut down all over again\nI don't like what I heard of that hurricane like oh I think a lot of rain rains hire an impact on our\nSchools are finally open again in Wilmington but in many nearby communities they remain closed Jovan ... NPR News Wilmington North Carolina\nTennessee Supreme Court has compelled to states three drug method for putting prisoners to death Blake Farmer of member station WBFO in Nashville reports in order issued late Monday clears the path for several looming executions\nNearly thirty death row inmates were arguing today one drug political using only ... would be easier to carry out unless painful for prisoners several states currently used this one drug method by the majority of tendency Supreme Court said the inmates did not prove ... could be obtained it's been in short supply\nA dissenting justices executions in Tennessee are cloaked in secrecy making it nearly impossible for inmates to know the availability of lethal injection drugs and she argued that the pending executions should have been put on hold so the high court wasn't forced to rush a ruling for NPR News I'm Blake Farmer in Nashville\nThe Associated Press is now reporting that and to make scheduled to be executed on Thursday is asking the state that he died by electric chair rather than lethal injection you're listening to NPR News in Amsterdam\nNew York tonight a candlelight vigil for the twenty people killed in a limo crash in\n\nMore than one thousand people turned out at a riverside park in Amsterdam Shannon who campus there\nNow is I really late\nTeens seat limo ran a stop sign and hit a parked SUV Saturday and ... say police say the crash is under is an ongoing criminal investigation of the national Transportation Safety board is also involved in and I'm looking into what happened\nOne of the Wisconsin girls who pleaded guilty to stabbing a classmate in order to please a fictional characters appealing hurricane smarty Michael ... from member station Wu WM in Milwaukee reports attorneys for the girl filed a notice Monday\nThe girls attorney declined to outline the basis for the appeal the girl was sentenced in February to forty years in the mental health institution first stabbing her classmate Nineteen times at a park ... suburb in twenty four teen\nThe subtext told police they stabbed their classmate in order to pleads slender man and online fictional horror character a co defendant was sentenced to twenty five years and an institution the classmate managed to crawl out at the wooded park and the passer by found her she survived\nAll three girls were twelve years old at the time for NPR News I'm Marti Michael ... in Milwaukee and on trial Snyder in Washington\n\nSupport for NPR comes from the ape and either Cooper foundation commemorating ... Cooper by supporting public radio programming that highlights issues including diversity racist\nYou're not going to say we tend to twenty five years in an institution the classmate managed to crawl out in the wooded park independence or by founder she survived oh three girls were twelve years old at the time for NPR News I'm Marti Michael scene in Milwaukee until later in Washington\n\nSupport for NPR comes from the ... in either Cooper foundation commemorating ... Cooper by supporting public radio programming that highlights issues including diversity racism equality anti Semitism and sexism and the corporation for public broadcasting\n\nAlthough famous as a composer Charles really or Stanford was maybe more highly regarded as a teacher listen to the some of the pupils whew who's the twentieth century English composers coverage\nHoles Frank Bridge Arthur Bliss John Ireland Gustavo Samuel Coleridge Taylor refund Williams and many many others but do you mean by some of those little bit but right now one of the Irish shrimp cities by this Irish born composers Charles really or Stanford this is the number four\nOf the Irish wraps these called the Fisher of meal and what he saw the\nWhole store constricted not to buy for Napoli [noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\nMm\n\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] ooh\n\nPerformance by the oldster orchestra conducted by burning handling the Irish born leader English base composer and teachers sir Charles ... Stamford that was his Irish Rhapsody number four\n\nBy people of but Stanford named John Ireland\n... ... ...\n\nPerformance by the oldster orchestra conducted by burning handling of the Irish born leader English base composer and teacher sir Charles ... Stamford that was his Irish Rhapsody number four\n\nIs by people of Stanford named John Ireland\n... ...\n... what we all look\nLike he was with\nUs but he\n\nMight have hoped\nHe goes what do you think you know which you wouldn't know what the\nHell do you think he will\nRemain up well when he goes I\nThink what we eat written\nSome\nGray\nCurtain he tells\nMe what\nYou need to read [noise]\n\n\nLeast a meal with Graham Johnson at the piano and that song by John Ireland people obstruct Charles bill your Stanford\n\nSays one of the more luxurious of Stanford students goose bumps host as we listen to his ... green sweet with the English Tony I conducted by Howard ...\n\n\n\n[laughter]\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\nMm\n\n\n[noise]\n\n\n[noise]\n\n\n\nMm\n\n\n\nMichael Ludwig violin Virginia asking piano the by law from Eighteen Ninety five by the African English composer Samuel Coleridge Taylor [noise]\nIf you're just tuning in we heard a bit of goes to music by sir Charles bill your Stanford who talked all these great composers music we're hearing now including and probably best known\nAmong which is refund Williams and so it is to him that we now go with this is music he wrote to accompany a play by ear stop nice cold the wasps and you'll hear the ... of the wasps and the opening to this overture Esther Adrian both conduct the London philharmonic [noise]\nUh\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] the fourth of six studies in English folks on ... Williams Jonathan colder\nTime you knew from the humor crossing national heritage area will present spooked and spirits of Yuma it'll be the Saturday starting at noon at the heritage library three fifty some third avenue in Yuma for more information you can call less than nine to wait three or four seven six nine zero ...\nEighty eight point nine ... K. A. W. the Duma K. A. W. P. Parker and K. A. W. the dot org ... on a western college for more than forty five years trusted news spread humor and the ... counties\nI'm Anthony Wright Alice it's ten o'clock\nThere's there's some stadium will be hosting the twenty ... there'll be a contest for college students and much more it will be this Saturday in the evening from six to seven thirty ... drive in Yuma, Arizona for more information you can call us at nine to wait three or four seven six nine zero\nClear skies in the forecast for human tonight lows around sixty four degrees but the ... south west wind tomorrow sunny skies with the heightened your age six instructor tonight clear skies with the low around fifty five at the northwest wind around five miles per hour tomorrow sunny skies but the high near eighty five and a comment from the south\nThe ... library celebrating the ... week with the book the photo contest and the feeling of a film adaptation\nLive from may be our news in Washington on trial Snyder\nAfter a bruising confirmation fight the newest Supreme Court justice Brett Kavanaugh is offering words of reconciliation during the ceremony swear at during a ceremonial swearing at at the White House Monday Night cabin on said he's taking the job with no bitterness and sought to reassure the public that he would be fair\nBut NPR's Scott Horsley says President Trump's slam Kavanaugh's opponents for what he called a campaign of personal destruction\nThe court itself tried to make a show of unity all eight if Kavanaugh's fellow justices were at the White House to to to make a stand that way Kevin up setting\nFor ... fight the newest Supreme Court justice Brett Kavanaugh's offering words of reconciliation during the ceremony swear during a ceremonial swearing at at the White House Monday Night Kavanaugh said he's taking the job wasn't no bitterness and sought to reassure the public that he would be fair\nBut NPR's Scott Horsley says President Trump's slam Kavanaugh's opponents for what he called a campaign of personal destruction\nThe court itself tried to make a show of unity all eight of Kavanaugh's fellow justices were at the White House to to to make a stand that way Kavanaugh said he knows and respects all of his future colleagues and he promised that he would be a justice for all Americans\nBut the president's tone was much more partisan and Donald Trump lambasted the Democrats who led the fight to keep Kevin ... off the bench\nKavanaugh will take his seat alongside the court said other justices in the morning tremendous ... preparing to publish proposed rules that could tonight green cards to immigrants who use a wide range of public benefits NPR's Joel Rose reports those rules are said to be published in the federal register this week\nThe Trump Administration says it's trying to ensure that immigrants are self sufficient by enforcing a longstanding law that immigrants cannot be a quote public charge\nUnder the proposed rules legal immigrants could still use public benefits like food assistance and medicate but for the first time that would count against them if they try to get a green card or bring relatives to join them in the u._s.\nPublic health officials worry that many immigrants will be afraid to use any kind of public assistance at all which could hurt both immigrants and public health wants the proposal is formally published in the federal register the public will have sixty days to comment Joel Rose NPR News\nScientists say they've identified the first genes linked to erectile dysfunction impair smuggling to apply for reports the findings may help with the development of new treatment\nSo red counties function is extremely comic it affects about twenty percent of men over each forty scientists have known for a long time that gene can affect a man's risk for the problem but it's been difficult to pinpoint which genes are not important\nNow scientists at Kaiser Permanente northern California are starting to change that\nThe team analyze gene from within thirty six thousand men in found one little piece of DNA which reaches a man's risk by about twenty five percent to scientists think the DNA influences neurons in the brain that control sexual function\nThe findings which appear in the proceedings of the national Academy of sciences offer clues about conscious reptile dysfunction and a new strategy for developing drugs to stop it Michaeline to class NPR News\nAsian stock markets are retreating after the international Monetary Fund downgraded it's economic outlook the IMF now says a global economy will grow three point seven percent this year down from three point nine percent had forecasted back in July [noise] you're listening to NPR News\nEuropean Union leaders of media activists are demanding a thorough investigation into the murder of all Bulgarian journalist over the weekend the tour of a no vote was killed after she reported on the possible misuse of European funds in Bulgaria Teri Schultz reports on plans to honor her\nCandlelight vigils are planned throughout Bulgaria tour of member Victoria ... she's the force investigative journalists killed in the new within the last twelve months\nThe committee to protect journalists in his Bulgaria employ all efforts and resources to carry out an exhausted inquiry and find those responsible for raping pledging and suffocating the thirty year old TV anchor and a reporter\nEuropean commission's those named margarita ... echoes calls for justice and for answers about whether the murder with link to her work\nWe must make the journalists everywhere are safe\nHold the lowest ranking in media freedom among ... minutes\nShe's the fourth investigative journalist ... within the last twelve months the committee to protect journalists in Bulgaria employ all efforts and resources to carry out and exhausted inquiry upper find those responsible for raping pledging and suffocating the thirty year old TV anchor and reporter\nEuropean conditions that's named margarita ... echoes calls for justice and for answers about whether the murder was linked to her work\nWe must make sure that journalists everywhere are safe\nBulgaria hold the lowest ranking media freedom among ... member state for NPR News I'm Teri Schultz in Brussels\nAs State Department says it's been in touch with the government of Saudi Arabia about the disappearance of the Saudi journalist ... in a statement secretary of state Mike Pompeo called on Saudi Arabia to support a thorough and transparent investigation\nCar show he has not been seen since the end of the Saudi Arabian consulate in Istanbul last week Saudi Arabia tonight's killing it\nOr to governor Rick Scott has declared a state of emergency and thirty five counties along Florida's Gulf Coast mandatory evacuations underway because of hurricane Michael forecasters say that storm could strengthen into a major category three hurricane has it makes it way too likely Wednesday landfall this is NPR News\nSupport for NPR comes from Jane in Gerald catcher supporting the children's movement to Florida dedicated to helping all children entering school with the social emotional and intellectual skills needed to succeed more information is available at children's movement Florida dot org and Americans for the arts\n\nTalks new world symphony just a few minutes away here is a concerto but also what ran the concerto which is based on the ... for the keyboard it was Charles ... Eighteen century Englishman who made this arrangement and this is one of twelve country already grossly by Elvis and after Scott body will here the number ten\nThe brains of recounts were conducted by really good [noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\nYeah\n[noise]\n\n\nVoice on what's your name what's the ten cent crossing that line repairman Santa Barbara minds we don't know I mean they don't want\nTo make ends meet up at night that role playing that role I mean people\nWatch ... ... well\nBefore\n\n\nWilliam Parker was the baritone at William Huckabee at the piano and that's music up American composer Charles ... British it's called an old song in observance\nOf Hispanic heritage month the St Louis library will host or fifth annual orange division between the art work the local parties it continues through October fifteenth assemblies branch library and Seventy five north sixth avenue you can find further details that you my library dot org\n... eighty eight point nine F. M. K. WC Yuma K. E. W. P. Parker and K W C. dot org service of Arizona western college for more than forty five years we bring NPR News to the Colorado River communities of human ... counties\nIt's eleven o'clock\nTime you knew from the humor crossing national heritage area will present speaks and spirits of Yuma it'll be the Saturday starting at noon at the heritage library three fifty some third avenue in Yuma for more information you can call us at nine to wait three or four seven six nine zero\nForecast in Parker tonight clear skies with the low around fifty five degrees in northwest wind up around five miles per hour tomorrow sunny sky\nYears we bring NPR News to the Colorado River communities of human ... counties\nIt's eleven o'clock\nTime he knew from the ... crossing national heritage area will present spooked and spirits of Yuma it'll be the Saturday starting at noon at the heritage library three fifty south third avenue in Yuma for more information you can call in less than nine to wait three or four seven six nine zero\nWeather forecast in Parker tonight clear skies with the lower around fifty five degrees in northwest wind up around five miles per hour\nTomorrow sunny skies with high is reaching up to eighty five degrees with the ... south wind in Yuma clear skies tonight with a low around sixty four and a column southwest wind tomorrow sunny but the high on your eighty six Mm\nMm\nLive from NPR News in Washington on child Snyder Brett Kavanaugh said the area's first arguments as a Supreme Court justice in the morning you used to take his seat on the bench after a Monday Night ceremonial swearing in at the White House\nPresident Trump apologize to Kevin offer the bitter confirmation fight and claimed cabinet was proven innocent of sexual misconduct\nEarlier Monday deputy attorney general Rod Rosenstein travel with President Trump to Florida NPR's Scott Horsley reports that rose assigned as keeping his job for now\nRosenstein state has been a question mark for several weeks since the New York times published a story saying among other things that the deputy attorney general had discussed secretly tape recording the president last year\nRosenstein has denied that report Trump spent about thirty minutes talking with the deputy attorney general aboard air force one as the two men made their way to a police convention in Florida\nI'm traveling with broad I didn't know ride before but I've gotten to know but I get along very\nRosenstein his job is politically sensitive because he oversees special counsel Robert Mueller's investigation of Russian interference in the twenty sixteen election Scott Horsley NPR News Washington\nFederal investigators are looking into Saturday's deadly limo crash in upstate New York to kill twenty people the chairman of the national Transportation Safety board Robert Sumwalt so since agency has hard questions for prestige limousines\nThe company's safety culture\nThe company's records\nRecords of prior clashes their management of drivers the fatigue management program vehicle maintenance fitness for ... driver fitness for duty we want to look at everything that we can relate into the company that operated that Lehman same state\nPolice say the crashes a subject of an ongoing criminal investigation on Monday evening where the one thousand people attended a vigil in Amsterdam New York it's been one year since a firestorm of northern California wine country that live forty four people dead and damaged Twenty one thousand homes\nSo Sandy of member station KCPW ... D reports at Napa County officials are now testing new ways of communicating with the public during emergencies\nWindy and warm here in Napa red flag warnings are in effect I'm not like it was a year ago\nWhen Napa County sheriff's deputy ... around searching for people to rescue some of whom because of an coordinated and delete alerts were worn too late\nTo focus on people that you couldn't get to what you could have done differently\nIt's that sentiment that's dragging several changes chef John Roberts Senate putting special disaster sirens on squad cars to let people know\nIt's time to tune in its time to turn on your television to turn on your cell phone to work with your neighbors communicate\nOther changes include mailbox evacuation tags for those who've left and a federal cell phones warning system set to debut here on Tuesday for NPR News I'm Sarah Varney in that and\nYou're listening to NPR News\nThe delete alerts were worn too late\nTo focus on people that you couldn't get to what you could have done differently\nThat sentiment that's dragging several changes chef John Roberts Senate putting special disastrous Iran's on squad cars to let people know\nIt's time to tune in time to turn on your television to turn on your cell phone to work with your neighbors communicate\nOther changes include mailbox evacuation tags for those who've left and a federal cell phones warning system set to debut here on Tuesday for NPR News I'm Sarah Varney in that\nAnd you're listening to NPR News\nA federal judge in Texas has declared unconstitutional a decades old law that aims to keep indigenous families together made ... yellow stone public radio reports that the Indian child welfare act gives adoption placement preference to native child's family tribe or other Native Americans\nLast year at Texas a couple of tried to adopt a native ... they were fostering but provisions within the Indian child welfare act required the government plates that child with an indigenous family instead intervening on behalf of the couple of the state of Texas sued and now a federal judge says the law is unconstitutional\nDavid Simmons is with the national Indian child welfare Association He says the ruling has a chilling effect on at risk native families\nAnd our concern is what does this do to those families what kind of days or replace them what additional trauma well they have to receive\nThe law was first elected in the Nineteen seventies after study showed nearly a third of all native children were being forcibly removed from their families and communities and placed in state welfare systems for NPR News I'm a ... in Missoula, Montana the international\nMonetary Fund is cutting its forecasts for global growth the IMF has revised its forecasts from July announcing the global economy will grow three point seven percent down from three point nine percent this year and then twenty Nineteen it's always rising interest rates intentions over trade\nReport comes as the IMF and World Bank prepares for their annual meeting this week in Indonesia Asian markets putting in a mixed performance and Tuesday trading a day after the leading us into says\nFinished ... as well [noise]\nUm ... NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include the state of John crock who's request serves as an enduring investment in the future of public radio and seeks to help NPR producer programming that means the highest standards of public service in journalism and cultural expression\nWe have in front of U.S Russian music and we're going to hear something right now by a compulsion being I'm Tony odd off\nSomething by ... in a moment but ah she was a ... by the odd off with the Mexico City philharmonic conducted by Enrique bought these\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\nMm\n\n\n\n\n\n[noise]\n\nThey\n[noise]\n\n\n\n\n\nUm [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\nMm\n\n\nMm Mm\n\n\n\nMm\nMm\n\n\n\n\nMm Mm\n\n[noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n\nMm\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\nNah\n...\n\n[noise]\n\n\nWe heard the violin Saddam the number one by a ... born in ... a French parentage shores are born in Nineteen sixty one he died in Nineteen twenty six\n[noise]\n[noise]\n\n[noise] we've heard the violin Saddam was a number one by a composer born in ... a French parentage shores Qatar\nBorn in Nineteen sixty one he died in Nineteen twenty six people of ... course to call for one ... and then of course it got passed them off to the student I told the dog\nThat was the performance of the first ... by George ... with two brothers they're ... and ... and ... respectively\n\nWould listen to music man do break the influenced ... just a moment first this played by ... by it's by ... I'll be in that a a ...\n[noise] [noise] [noise]\n[noise]\n[noise]\nNa na\n\nNa\n[noise]\n\n\n[noise] [noise] [noise]\n... de ... was the ... ... ... was the composer that was the previewed opus eleven number about ... be\n\nYou're the music of George cut to our\nKey metric husky at one point showed him but set a piano variations and Tchaikovsky was very taken by young George ... said it would be a sin if you did not devote yourself to composition the two became friends and the Tchaikovsky something of a mentor to ... I thought we could use the music of Tchaikovsky next\nAnd what it is best known compositions that so called Eighteen twelve over chore Berlin symphony at ... Peter floor\n[noise]\nAnd one of his best known compositions that so called Eighteen twelve over chore Berlin symphony and Peter floor\n\n[noise]\n[laughter] [laughter] [laughter] [laughter] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[laughter]\n[noise]\nOh there's music like those are cool was best known for his association with binoculars or veterans ski course they call it but most ... ski boarding a member of the Russian spy or like a handful of states are we we are December libraries celebrating the ... week with the big scandal consistent the viewing of a film adaptation\n[noise]\n\nOh there's music by a composer who is best known for his association with ... call up and move toward ski and bought her being a member of the Russian Five or mighty handful seats are ... we heard\nA sandwich libraries celebrating the ... week with the book this photo contest and the viewing of a film adaptation it's ongoing now through Saturday October Thirteen at the ... library which is located at ten Seventy five no sixth avenue in families if you'd like more information you can contact us had nine to wait three four four seven six nine zero\n\nIt's midnight this is eighty eight point nine F. M. K. A. WC Yuma K. A. W. P. Parker and K WC dot org\nA service of Arizona western college for more than forty five years trusted news for ... and the pause counties stay tuned for NPR headlines and more classical music\nSunny skies and the forecast for Parker today highs reaching up to eighty five degrees what they call them southwest when throughout the day mostly clear skies in the evening with the low of around fifty nine degrees south window five miles per hour\nIn Yuma today sunny skies continue with ties reaching up to eighty six degrees tonight clear skies but the low of around sixty four degrees\nIn observance of Hispanic heritage month the family's library will host or fifth annual our mission featuring the artwork of local artists it continues through October fifteenth assemblies branch library ten Seventy five north sixth avenue you can find further details that you my library dot org\n\nLive from NPR News in Washington on trial Snyder the Supreme Court justice Brett Kavanaugh's sounding conciliatory following the bruising fight over his nomination but President Trump is not\nWhat happened to the Kavanaugh family violates every notion of fairness decency and due process our country a man or woman must always be presumed innocent unless and until proven guilty\nAs the Trump posed to the ceremonial swearing in at the White House for Brett Kavanaugh who says he's taking the job was no bitterness\nAnd sought to assure the public that he will be fair cabinet has to be on the bench in the morning when the court hears oral arguments attend shelter for use in the west Texas desert continues to expand as the Trump Administration struggles to handle an influx of migrant children crossing the border illegally\nNPR's John Burnett reports the campus coming under increasing criticism\nThe U.S conference of mayors have sent a letter to the health and Human Services secretary demanding to know how the department is caring for a record Thirteen thousand migrant children in custody around the country\nOver the weekend protesters showed up at the ... border crossing to denounce the expansion of the camp which is next door\nThe cluster of sand colored tense east of El Paso was supposed to hold only a few hundred migrant children enclosed this fall but the government announced last month the shelter may grow to as many as thirty eight hundred beds\nThe tornado camp currently holds within sixteen hundred children ages twelve to Seventeen most of the boys from Central America with more arriving every week can't managers insist the children are well cared for with apple food recreation and medical care John Burnett NPR News\nFinancial markets in Asia are mixed after the international Monetary Fund downgraded it's economic outlook it's blaming a variety of factors for lowering global expectations including trade tensions between the U.S and China\nMay grow to as many as thirty eight hundred beds the ... camp currently holds within sixteen hundred children ages twelve to Seventeen most of the boys from Central America with more arriving every week can't managers insist the children are well cared for with apple food recreation and medical care John Burnett NPR News\nThe financial markets in Asia are mixed after the international Monetary Fund downgraded it's economic outlook it's blaming a variety of factors for lowering global expectations including trade tensions between the U.S and China\nAmid the dispute China's central bank this week again lower the amount of cash reserves banks must hold in an attempt to boost spending as NPR's Rob Schmitz reports\nThis is the fourth time that people's bank of China has cut China's reserve requirements this year it comes after Beijing pledged to invest billions of dollars and infrastructure projects as China's economy show signs of cooling with investment growth at a record low\nThe move announced on the last day of China's weeklong national day holiday will inject more than a hundred billion dollars into China's banking system\nAnd let's say it shows China's government is worried about the impact of external shocks to its markets such as last week speech by us vice president Mike Pence who accused China of trying to undermine President Trump ahead of next month's congressional elections\nChina's also preparing for tough days had after the U.S has imposed tariffs on hundreds of billions of dollars worth of Chinese products\nRob Schmitz NPR News Shanghai and you're listening to NPR News\n\nPresident Trump is scheduled to travel to Iowa Tuesday where he is expected to announce that his administration is lifting a federal ban on the summertime sale of higher ethanol blends of gasoline\nThe move would benefit farm states such as Iowa which is the country's largest producer of ethanol dropped as expected to direct the environmental protection agency to ride rule with the aim of finalizing it in time for next summer\nDrop administration says it is imposing a twenty year ban on new mining projects just north of Yellowstone National park in an area known as the paradise valley of Montana Montana Public Radio's ... Carney reports\nInterior secretary Ryan Zinke you stood with his back to mountain peaks as he said some places shouldn't be mind even though he calls himself a pro mining guy mountain behind his\nSpecial special the community is special the Montana and special tour nation the\nInterior department's block on new mining projects on public land here is a continuation of a two year ban put in place by the Obama administration lawmakers are considering legislation that could permanently banned mining in the area at least one company says it's willing to sue the government to keep its mining project moving forward\nFor NPR News I'm Lauren keeps Carney in prey Montana\nAs to Hurricane Center in Miami expects hurricane Michael to wrap up into a major hurricane by Tuesday night the storm expected to move over the Florida Panhandle beginning on Wednesday Florida governor Rick Scott is warning of a monster storm he's declared a state of emergency for thirty five Florida counties\nFrom the panhandle to Tampa Bay on trial Snyder NPR News\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with she apt to point detection and sixteen programmed massages including morning night and stretch fashion retailers nationwide more ... dream wave chair dot com Andy\nAny case the foundation\n\nFunny story told about the peace we're going to hear right now which is ... with the boss to follow by the way one of the Brandenburg ... middle doubles wrote this for a pianist friends of his and uh she thanked import and put it away and then he contacted her a Nineteen fifty three and said okay no I Hope to the scores ready because ...\nScience chairs from Japan which she got to point the action and sixteen ... random massages including morning nights and stretch bashing retailers nationwide more ... chair dot com and the ... foundation\n\nTwenty story told about the peace recorded here right now which is about eight or ... with Boston followed by the white one of the ...\nMiddle doubles real ... and uh she thanked deporting put it away and then he contacted her Nineteen fifty three and said okay no help you scores ready because in fourteen days we're giving the premier of it so she had to learn the whole piece in fourteen days\nWas written in Nineteen forty eight the second up the fight piano concerto goes by the double here's Christie ... or ... with the royal philharmonic chemical Mr Martinez nah\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\nOh\n\nTrust me some changes in the Castro version of that song too I Know it was signed by cutting ... with a London symphony conducted by Michael\n... new from the humor crossing national heritage area will present spooked and spirits of Yuma it'll be the Saturday starting at noon at the heritage library three fifty south third avenue in Yuma for more information you can call less than nine to wait three or four seven six nine zero\nBroadcasting for the property hardy radio studio complex on the campus of Arizona western college for more than forty five years this is Kate AWAC Yuma K. A. W. P. Parker eighty eight point nine at them and K. A. W. seat dot org\nComing up next we have another our classical music overnight with Peter Pan of graft it's one o'clock\nSunny skies continue in human today in the forecast with high it's reaching up to eighty six degrees in the evening clear skies with the lower around sixty four degrees\nAnd Parker sunny skies but behind your eighty five degrees a column south wind throughout the day most of the clear skies in the evening with a low around fifty nine and a south windows five miles per hour\nThat there is some stadium will be hosting the Tony ... there'll be a contest for costumes and much more it will be this Saturday in the evening from six to seven thirty at twelve eighty what does your son drive in Yuma, Arizona for more information you can call us at nine to wait three or four seven six nine zero\n\nLive from NPR News in Washington a joy ... Snyder\nAfter bruising confirmation fight the newest Supreme Court justice Brett Kavanaugh's offering words of reconciliation during a ceremonial swearing in at the White House Monday Night Kevin O's said he's taking a job but no bitterness and sought to reassure the public that he will be fair\nBut NPR's Scott Horsley says President Trump's slammed Kavanaugh's opponents for what he called a campaign of personal destruction\nThe court itself tried to make a show of unity all eight of Kavanaugh's fellow justices were at the White House to to to make a stand that way Kevin ... said he knows and respects all of his future colleagues and he promised that he would be a justice for all Americans\nBut the president's tone was much more partisan and Donald Trump lambasted the Democrats who led the fight to keep Kevin ... off the bench Kavanaugh will take\nHis seat alongside the court said other justices later this morning a un report calling on countries around the world to do more to combat global warming Larry Miller reports that scientists are warning of severe environmental changes including heat waves devastating storms droughts lots of species\nCc says even keeping the earth's temperature rise to the two degrees centigrade targeting agree that the Paris climate change talks is too high when the world is heading toward of three degree rise\nThe ICC PCC says only by dropping to one point five degrees can the worst effects of climate change be avoided its report says manmade CEO to emissions need your dropped\nStreets around the world to do more to combat global warming Larry Miller reports that scientists are warning of severe environmental changes including heat waves devastating storms droughts lots of species\nVIP cc says even keeping the earth's temperature rise to the two degrees centigrade target agree that the Paris climate change talks is too high when the world is heading toward of three degree rise\nThe ICC PCC says only by dropping to one point five degrees can the worst effects of climate change be avoided\nIts report says manmade CEO to emissions me to drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent now one IPC sea board member warns\nThere is only the slimmest chance of avoiding unsinkable damage to the climate system that supports life as we know it\nFor NPR News I'm Larry Miller in London Pakistan's\nForeign minister says he will seek a bailout from the international Monetary Fund as the country struggles with a balance of payment crisis and we'll say Pakistan is hoping to secure eight billion dollars in loans and bears the deed reports from Muslim about\nPakistan you government tried to avoid turning the IMF for weeks they approached allies China in Saudi Arabia hoping they'd offer enough funds to mitigate the country's foreign Conti deficit but it wasn't enough the finance minister aside ... says he'll hold talks with the IMF later this month\nWashington's already expressed concerns that it they might be used to repay Pakistan's loans to China which it opposes\nPakistan's long approach the IMF to deal with it the bus to county it most recently received a six point seven billion dollar loan in two thousand and Thirteen ... date NPR News is on that I\nMean I Am FM World Bank holding their annual meetings this week on the Indonesian\nResort island of Bali and you're listening to NPR News in Amsterdam\nNew York last night a candlelight vigil for the twenty people killed the little little grass shack\nIn\nMore than one thousand people turned out to riverside park in Amsterdam Shannon boot camp was there\nSome ... ... as I can really hurt\nNineteen seed limbo ran a stop sign and hit a parked as you'd be Saturday and go Harry state police say the crashes under an ongoing criminal investigation of the national Transportation Safety board also involved in looking into what happened\nAnd so it's a company that operated limo has tough questions to answer for the three hundred migrants were intercepted by Spain's maritime rescue services Monday morning they were crossing from Morocco and suburban different about seven different ... some of those rescued where women will see a been a few days reports\nAs the weather cools migrant crossing from Morocco to Spain do not seem to diminish Monday through ... add to the more than twelve hundred migrants pulled out of Mediterranean waters this weekend\nSpain is also putting pressure on Brussels to send more money to Morocco and an effort to keep migrants from crossing immigration activists however say the Moroccan authorities use this money to raid the camps for sub Saharan African migrants set up before they cross\nIn recent months these raids have allegedly become more frequent and more violent\nFor NPR News I'm Lucy ... in Barcelona\nSays NPR News\nFor NPR comments from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major ...\nSing immigration activists however the the Moroccan authorities to use this money to rate the camps which sub Saharan African migrants set up before they cross in recent months these raids have allegedly become more frequent and more violent\nFor NPR News I'm Lucy ... is in Barcelona\nIt's supposed to be argues\nSupport for NPR comments from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at ... dot com\n\nOr works of head include the symphonic coin called the forest by others other gloves adult thanks very much for being with me Peter ... graph here\nWith the performance of the trouble controlling number one by heightened sci major concerto this is the one which was discovered in archives in Prague in Nineteen sixty one\nAnd we're going to hear offer heartily performing with the\nVictorious symphony orchestra directed by poll Freeman says heightens ... concerto in see\n[noise]\n\n\n\n\n\n\n\n\nNo\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n\n\nA\nA\n\n\n\n\n[noise] [noise]\n\nOh\nAnd it was about ... soprano ... at the song ... from\nThe hope is twenty six set by ... money off\nThe ... library celebrating the ... week with the book ... contest and the viewing of a film adaptation it's ongoing now through Saturday October Thirteen at the family's library which is located at ten Seventy five north sixth avenue in San Luis it'd be like more information you can contact us had nine to wait three or four seven six nine zero\nThanks but listening to paint a double you see you might take a WPN Parker eighty eight point nine ... ... a WC dot org service about France in a western college more than forty five years trusted news for the pause and human counties we hope to stick around for another hour classical music overnight with Peter Van Dyk rap\nWhich is coming up next it's two o'clock\nSunny skies in the forecast for Parker today has reaching up to eighty five degrees what they call them southwest when throughout the day mostly clear skies in the evening with the low around fifty nine degrees that South window five miles per hour\nAnd humid today it's sunny skies continuing ties reaching up to eighty six degrees tonight clear skies but the low up around sixty four degrees\nIn observance of Hispanic heritage month the family's library will host or fifth annual our exhibition featuring the artwork of local art is it continues through October Fifteen that the families branch library ... Seventy five north sixth avenue you can find further details that you might library dot org\n\nLive from NPR News in Washington I'm Dave ...\nFlorida's governor is calling hurricane Michael monstrous what forecasters warning it could become a major storm before making landfall along the Gulf Coast sometime tomorrow more than thirty Florida counties are under a state of emergency from Tampa Bay to the panhandle coastal evacuations are underway\nIn the Carolinas NPR's Tom Gjelten says residents are still working to recover from Hurricane Florence\nWater has receded along the Carolina coast and the streets in Wilmington they're mostly clear no what is ready for another yet president\nWay Florida's governor is calling hurricane Michael monstrous what forecasters warning it could become a major storm before making landfall along the Gulf Coast sometime tomorrow more than thirty Florida counties are under a state of emergency from Tampa Bay to the panhandle coastal evacuations are underway\nIn the Carolinas NPR's Tom Gjelten says residents are still working to recover from Hurricane Florence\nWater has receded along the Carolina coast and the streets in Wilmington are mostly clear but no one is ready for another hit the president of the chamber of commerce Natalie English because businesses are still assessing their losses and are in shape to lose power shut down all over again\nI don't like what I've heard of that hurricane like oh I think a lot of rain the ground from the rain that we had two weeks ago and a higher wage more rain because my faith in our\nSchools are finally open again in Wilmington but in many nearby communities they remain closed Tom Gjelten NPR News Wilmington North Carolina\nFederal investigators say they're still not sure why the driver of a limousine in upstate New York failed to stop at a stop sign the stretch limo crashed into a parked SUV and skill Harry at a high rate of speed killing all Eighteen people in the vehicle and to pedestrians\nNew York's governor says the limo driver did not have the required commercial license and the vehicle had failed a recent inspection\nLast night friends and family attended a vigil at a park in Amsterdam\nMy heart rate and they think of all the lives that were never will be the same [noise]\nIt gives me hope to see is here with ... and so\nThat's local school superintendent Vicki Ramos one of the speakers at the vigil vice president Pence was in Texas yesterday campaigning for a couple of incumbent Republicans trying to keep their seats on Capitol Hill Stella Chavez with member station KNPR a reports from Dallas\nThe vice president's first stop what's for us representative Pete Sessions he's facing a tough challenge from Democrat colon all red and civil rights attorney and former NFL linebacker\nTense praise sessions for his support of Trump Administration policy from Obamacare roll back to tax cuts the vice president also had at the new trade agreement with Mexico and Canada and unemployment at a safety or low\nAnd on Saturday we can\n[noise] justice Brett Kavanaugh [noise]\nRe electing Pete Sessions and Senator Ted Cruz it's crucial to hanging onto a Republican majority in Congress for NPR News I'm Stella chatted in Dallas\nThis is NPR News from Washington\n\nLater this morning Brett Kavanaugh here's his first arguments as a justice on the U.S Supreme Court the high court is scheduled to hear two hours of arguments at the White House last night there was a ceremonial swearing in\nTurkey is calling on Saudi Arabia to approve a missing Saudi journalist left its consulate in is simple as the government claims as NPR's Peter Kenyon reports from all ... has been missing since he entered the Saudi conflict a week ago\nSpeaking during a visit to hungry president ... said prosecutors are looking into ... disappearance including the arrival of more than a dozen Saudis to assemble on the day the journalists disappeared\nInto an said Saudi consulate officials can't get away with saying he left the building addressing the Saudis air to one added if he left the building then you need to prove that investigators suspect to show he was either spirited out of the country by the Saudis or killed in ...\nAs NPR's Peter Kenyon reports from all ... has been missing since he entered the Saudi conflict a week ago\nSpeaking during a visit to hungry president ... once said prosecutors are looking into ... disappearance including the arrival of more than a dozen Saudis to assemble on the day the journalists disappeared\nEveryone said Saudi consulate officials can't get away with saying he left the building addressing the Saudis air to one added if he left the building then you need to prove that investigators suspected Yogi was either spirited out of the country by the Saudis or killed inside the consulate Saudi Arabia denies the allegations\nPresident Trump says he's concerned like your show these disappearance\nPeter Kenyon NPR News Istanbul\nThe international Monetary Fund is downgrading its outlook for the global economy for twenty Eighteen it expects growth for the year to reach three point seven percent\nThat's down from three point nine percent it's earlier forecast the IMF expects the U.S economy to grow to point nine percent for the year that would be the strongest since two thousand five\nThe Federal Reserve has raised us interest rates three times this year as the economy continues expanding unemployment to the U.S is that a forty nine year low\nI'm Dave ... NPR News in Washington\nSupport for NPR comments from NPR station other contributors include visits St Petersburg Clearwater along Florida's Gulf Coast offering artistic drugs including St Pete's Dali museum pitcher who collection and the museum of fine arts more er visits saint Pete Clearwater dot com\n\nAll shots to coach including his first symphony we'll also hear a an arrangement of his of tea for two which he called the ... to ... trot and we have right now one of his string quartets this taking from Nineteen sixty and it is by far the shortest up his quartets\nNumber seven F sharp minor as performed here from their complete set by the Emerson string quartet [noise]\n\nUm [noise] um\n\n\n\n[laughter]\n\n\n[noise]\n[laughter] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] to ... to ... arranged to AT T for two events humans and he called it to ... to ... that was the Chicago sinful and yet it directed by Paul Freeman\nHearing all ... we have his first symphony coming up a couple of minutes what's your once again do as a ranger he took each English and American Folk songs and arrange them for a voice in orchestra\nAnd here's an English folk song Billy Boy ... even ... soprano and the U.S is our ministry of culture sympathy\n\nWe will you please leave always going to\nBe\nComing down you know\nWe will you\nKnow I mean I'm really not\nKnown for believe me we will we need any\nMoney from the meeting yeah\nWe will leave me alone [noise]\n\nNo I mean I'm\nEnglish looks on\nHe must be some people eating in\nEarly ... really launched\nMalone [noise]\nNo I mean the people who know\nEnglish folks on Billy Boy reigned by South Dakota which conducted by ... by ... even if I\n\nHear is a network which really put shop to go which on the map in the world I'm the man who who\nTaunted ... which into arranging tea for two as we just heard it and he could like Marco conducted the premier this peace and ... which was only Nineteen years old when it was first performed in Nineteen twenty six Senate soon made its way around the world and there's still so often perform it is the first symphony\nAnd we have the Cincinnati Symphony orchestra Walter ... can conducting usually kept Dimitri ...\n[noise]\n[noise] [noise]\n\n\n\nOh [noise]\nMm [noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\nWow rubber or there are a number of rubber above a bar\nOr [noise] or um [noise] [noise]\n\n[noise] we were to music which can be trusted coverage composed for Shakespeare's King Lear a march\nTime he knew from the ... the national heritage area will present speaks and spirits of you buy it will be the Saturday starting at noon at the heritage library three fifty some third avenue in Yuma more information you can call us at nine to wait three or four seven six nine zero\nA service of Amazon a western college more than forty five years this is K. A. W. seed you must take a WPN Parker eighty eight point nine F. M. N. T. A. W. A. C. dot org trusted news for ... and the pots counties\nIt's three o'clock coming up next we have another our classical music overnight with Peter banned the graph\nSunny skies continuing humid today in the forecast with high it's reaching up to eighty six degrees in the evening clear skies with the low around sixty four degrees\nIn Parker sunny skies but the high near eighty five degrees come south wind throughout the day mostly clear skies in the evening with the low around fifty nine in the south windows five miles per hour\nThere's some stadium will be hosting the twenty teens don't be run well there'll be a contest for\nTrusted news for humor and the ... counties it's three o'clock coming up next we have another our classical music overnight with Peter Van de graph\nSunny skies continue in humid today in the forecast with high is reaching up to eighty six degrees in the evening clear skies with the low around sixty four degrees\nAnd Parker sunny skies with the high and you're eighty five degrees become south wind throughout the day mostly clear skies in the evening with the low around fifty nine and a south windows five miles per hour\nDeserves some stadium will be hosting the Tony ... there'll be a contest for costumes and much more it will be the Saturday in the evening from six to seven thirty at twelve lady was desert sun drive in Yuma, Arizona for more information you can call us at nine to wait three four seven six nine zero\n\nLive from NPR News in Washington I'm core of a Coleman the newest justice of the U.S Supreme Court will be on the bench this morning when the court hears oral arguments NPR's Scott Horsley reports President Trump hosted a Monday Night ceremonial swearing in for Brett Kavanaugh at the White House\nKevin ... had already been quietly sworn in on Saturday hours after he was confirmed on or near party line vote he said he wants to put the contentious and emotional confirmation battle behind it and he promised to serve in a non partisan fashion\nI was not appointed to serve one party or one entrance but to serve one nation\nWell Kevin O's remarks were conciliatory President Trump's were not Trump blasted Democrats for a campaign against Kevin ... he called dishonest and deceptive the president thinks seat in the new justice will give a political booster Republicans in the mid term elections Scott Horsley NPR News Washington\nThe national Hurricane Center says that hurricane Michael is moving north in the Gulf of Mexico and aiming for the Florida coast forecaster John ... says Michael ... top sustained winds aren't Ninety miles per hour\nIt's gonna be likely to make landfall in the Florida Panhandle of Florida Big Bend area during the day Wednesday that is our current thinking um and it's likely to make landfall as a major hurricane so that's category three or stronger or on the scale\nHurricane Michael is projected to them blown north across Florida and in Georgia and the Carolinas tropical storm watches are posted from the Florida Gulf Coast north to South Carolina\nThe international Monetary Fund is cutting its forecast for global growth NPR's John Snyder reports the IMF blames rising interest rates and trade tensions\nThe IMF has revised its forecasts from July when it said the global economy would grow three point nine percent this year it's now cut that down a couple of nachos downgrading expectations for this year and for twenty nine team the IMF now says the global economy will grow at a three point seven percent clip\nThe IMF left us economic growth on change for the rest of this year but cut the U. S. is twenty Nineteen forecasts to two and a half percent because of the trade tensions with China\nThe revision to the global forecasts was issued on the resort island of Bali as the annual meeting so the IMF and World Bank get underway this week\nTrials Snyder NPR News Washington\nThe south Korean government said North Korean leader Kim Jong un wants Pope Francis to visit North Korea\nAnd South Korean presidential office released a statement saying Kim told diplomats at the pope would be enthusiastically welcomed in North Korea the president of South Korea is expected to deliver that formal invitation to the contests during his scheduled visit in Rome next week\nNorth Korea strictly controlled religious expression in that country Kim has seemed to welcome diplomatic engagement this year meeting with South Korean officials\nAnd President Trump this is NPR\nKim Jong un wants Pope Francis to visit North Korea\nAnd South Korean presidential office released a statement saying Kim told diplomats at the pope would be enthusiastically welcomed in North Korea the president of South Korea is expected to deliver that formal invitation to the conscious drinking scheduled visited Rome next week\nNorth Korea at strictly controlled religious expression in that country Kim has seemed to welcome diplomatic engagement this year meeting with South Korean officials and President Trump\nThis is NPR\nOnline company Google is shutting down its social network Google Plus the company said he discovered a flaw last march that could have exposed personal data of up to half a million users\nThe company did not disclose this law until Monday the wall Street Journal also published a story on the floor saying Google didn't want regulatory scrutiny or damage to its reputation\nInterior secretary Ryan Zinke he is taking action against new mining in Montana part of Yellowstone National park Yellowstone Public Radio's Kayla to Roche has more\nLeaky returned to his home state of Montana it signed papers that put a hold on mining of thirty thousand acres of federal land there\nThere's places the mind is that there's places knock them off\nAnd you have to look at the American conservation ethic of ... best practices greatest good love is are\nThe land off limits to development is known for its natural resources and tourism the document extend protections put in place during the Obama administration and twenty six team that otherwise would have expired next month the withdrawal of those lands last Twenty years which is the maximum length of time and interior secretary Ken Grant\nFor NPR News I'm Kayla debt Roche in billings\nDisaster officials in Indonesia now say more than two thousand people have died from last month's earthquake and tsunami on the island silhouettes see most of the death or in the provincial capital Paolo a coastal city that felt the full effect of the disasters\nSome Seventy thousand people have since been displaced food and clean water remain limited\n[noise] this is NPR\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template uh dragging drop email editor and twenty four seven customer service more at a campaign monitor dot com and American for the arts\n\nHere is the composer from the twentieth century or from the Czech Republic named ... who stop marketing do I find is use extremely attractive and very identifiable as well this was a Nineteen forty five ... for food and piano by Marty knew his first let's play by Laurel sucker and pianist mark Shapiro\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nWhat was sucker flutes mark Shapiro piano perform that music Nineteen forty five by the ... who saw Maki ... that was his first so no more by mark you knew that she mean Fox Trump's [noise]\n\n\nThat's from Nineteen twenty two so called ... Fox trot and Prague symphony orchestra ... by ... music by march\n\n... as a conductor and then as a ranger first Eric treatment at the violinist with the London symphony and this is by the polish violinist composure and there could be an yep ski it is legit\nOh oh\nOh\nWhen you do it\n\n[noise]\n\n\n[noise] [noise]\n\n\nThe rest of the ...\n\n\n\n[noise]\n[laughter]\n\n\n[laughter]\n\n\n", "year": "2018", "show_name": "Music of the Masters", "city": "Yuma", "day": "09"}