{"month": "10", "state": "AZ", "station": "KAWC", "content": "Is it going this American Life producers chase was following Senator Jeff flake during the days before the recent cabinet hearing that they have the hearing and after she has said that you have not heard elsewhere so\nOne point she was backstage with senator during member that was straight out of bed fellows but one of the actual cast members from good fellas strongly encourage Senator Flake devote a certain way on the nomination\nAnyway that this week Saturday afternoon at four in the evening at seven on cannot be the eighty ... than\nIn observance of Hispanic heritage month assemblies library will host or fifth annual mission featuring the art work of local or is it continues through October fifteenth assemblies branch library somebody five\nShe has said that you have not heard elsewhere\nOne point she was backstage with senator during remember there was straight out of Goodfellas but one of the actual cast members from good fellas strongly encourage Senator Flake devote a certain way on the nomination\nAnyway let this week on Saturday afternoon at four in the evening at seven on ... the ... than\nIn observance of Hispanic heritage month assemblies library will host or fifth annual expedition featuring the art work of art is it continues through October fifth you up assemblies branch library whom Seventy five north sixth avenue you can find further details are you my library dot org\nThanks for listening to K. A. W. see humor K. A. W. P. Parker eighty eight point nine FM and K. A. W. C. dot org a service of everyone's on a western college for more than forty five years trusted news for the ponds and you'll ... counties\nIt's eight o'clock the weight has\nBeen a long time but it won't be long now are you ready to come home with\n... or about senator and governor is battling for power with the midterms aren't just about who wins and who loses or even which candidate said what they're about by you vote\nThere about issues in your community there about you listen to all things considered and hear the bigger picture every afternoon from NPR News [noise]\nTwenty percent chance of showers in Yuma tonight before eleven partly cloudy skies with low around Seventy two tomorrow sunny skies with a high and you're eighty four with the north west window five to ten miles per hour\nIn Parker tonight fifty percent chance of showers partly cloudy skies halo around sixty seven and tomorrow Sundays guys with the high end you're eighty seven and a south south West Wing of five to ten miles per hour\nLive from NPR News in Washington I'm chase the than\nThe FBI is wrapping up its supplemental background check on Supreme Court nominee Brett Kavanaugh majority leader Mitch McConnell says the Senate will get the report tonight and that a procedural vote on the nomination is set for friday as NPR's Scott Detrow explains the FBI's findings are not being made public\nEvery senator is being given the chance to read the FBI's findings about to report will be held very closely only one copy is being made available and will be held in the secure ruined the Senate uses for sensitive topics senators and a limited amount of age with security clearances will be allowed to read the report\nThe Judiciary Committee asked the FBI to conduct a one week investigation of claims cabinet salted Christine Blasey Ford and other women or is on a Senator Jeff flake yes vote was contingent on that demand\nBut the report scope is already coming under fire from Democrats Ford says the FBI never tried to interview her Scott Detrow NPR News the Capitol\nA federal judge in San Francisco is temporarily blocking the Trump administration's plan to end temporary protected status for immigrants from Sudan Haiti Nicaragua and El Salvador us district court judge and we're ... granted requests for preliminary injunction pending a lawsuit\nAnd says there's evidence that President Trump is hostile toward immigrants who do not come from Europe\nTemporary protected status has granted to people from countries devastated by natural disasters or conflict until conditions approve at home\nThe murder trial of Chicago police officer Jason Van Dyke will soon be in the hands of the jury W. B. easiest Patrick Smith reports\nThe defense called twenty witnesses over the span of more than a week much of the testimony was aimed at trying to undercut dash cam video showing Van Dyke shooting Seventeen year old a quandary Donald sixteen times that video with the centerpiece of the prosecution's case and chose McDonald walking away from police and ...\nTemporary protected status has granted to people from countries devastated by natural disasters or conflict until conditions to prove it home the murder trial of Chicago police officer Jason Van Dyke will soon be in the hands of the jury W. B. easy is Patrick Smith reports\nThe defense called twenty witnesses over the span of more than a week much of the testimony was aimed at trying to undercut a dash cam video showing Van Dyke shooting Seventeen year old the climate Donald sixteen times\nThat video with the centerpiece of the prosecution's case it shows McDonald walking away from police and Van Dyke keep shooting until his gun is empty even while McDonald is laying on the ground\nProsecutors called the former FBI agent and use of force expert who testified that the shooting was unjustified on Tuesday Van Dyke to stand in his own defense he choked up describing the shooting and he testified that he was in fear for his life when he shot\nClosing arguments are scheduled for Thursday for NPR News I'm Patrick Smith in Chicago\nAt least one South Carolina law enforcement officers dead and six others were wounded after a gunman opened fire on them and the city of Florence Allen Hitler is the city's police chief there were responding\nWhere they knew that there are others\nFrom the sheriff's officer brothers and sisters and the sheriff's office for the\nFinal says terrorists were trying to deliver a search warrant when a man barricaded inside a home open fire on them and police responding to the shooting\nHe says that the suspect is now in custody you're listening to NPR News\nAuthorities in Utah arrested a man in connection with suspicious letters mailed to President Trump and officials at the Pentagon\nSpokesman for the state prosecutor's office has thirty nine year old navy veteran William Allen the third\nWas arrested in the city of Logan two of the letters contain traces of what turned out to be cast her seat they were thought to contain traces of the poison rice and which is made from a byproduct of castor oil production all of the envelopes were intercepted it mail screening facilities\nThe occupational health and Safety Administration has fine superior refining company more than eighty three thousand dollars for a worker safety violations as Wisconsin Public Radio's Daniel ... reports the violation stemmed from an explosion earlier this year that injured thirty six people\nOSHA found the company which is owned and operated by husky energy failed to inspect and test equipment to make sure it would fit for service the agency said those measures could've prevented the explosion that constant evacuation for much of the city of superior in April ginger jewel with the activist group twin ports action alliance says the ... it's a slap on the rest\nOf our first time this company here you're refining company has been cited for some of the serious issues file shot on felon husky really wants to be a good neighbor to our community they'll make a commitment that they will not continue operations like as\nA husky energy's spokesman says in a statement that the company has continuously improving safety programs for NPR News I'm Danielle ... in superior Wisconsin\nOn Wall street stocks closed a bit higher Asian markets are mixed I'm Shay Stevens NPR News\nIn Washington\nSupport for NPR comes from NPR's Beijing other contributors include the symbol Family Foundation supporting the national Center for learning disabilities which works to improve the lives of the one in five individuals with learning and potential measures learn more at mc L. D. dot org\nIt's eight or six they doing with us for a beautiful night of classical music with Peter ... you don't take a double you've seen eighty eight point nine FM\nWestern college offering the guest service excellence program a chance to learn from the guest service school curriculum and\nContributors include the demo Family Foundation supporting the national Center for learning disabilities which works to improve the lives of the one in five individuals with learning and the tension that shares learn more at the end C. L. D. dot org\nHe's eight or six states humid that's for a beautiful night of classical music with Peter ... you're right take a double you've seen eighty eight point nine FM\nArizona western college offering the guest service excellence program a chance to learn from the guest service school curriculum and earn a certified service professional credential the three day program each Thursday mornings from October ... through the Eighteenth registration is available through the e WC continuing ed office\n[noise]\nMeeting Ninety eight so basically you wrote music for a a play written by people is actually named Adolf or ADL Powell called king Christian the second was the king of Denmark Norway in Sweden at the beginning of the sixteenth century we have a sweet now from that music for king Christ you on the second ... Gulf in brick symphony\nConducted by me but you already [noise]\n\n[noise] [noise]\n[noise]\nMm\nWell\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] we're\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\nJohann Sebastian Bach e minor violence and all that performed by trio set the CIA into which has that despite but this Rachel Barton high now steps down the violin and picks up the viola da dum ... literally the ... of love\nGets like it'll be all about but it has more strings different ... very different sound and structure to the instrument about what Google it didn't take a look at a viola dumb ... here is Rachel barking climbed with ours on ... as we hear music by another great composure from the baroque Antoni open up all the and the ... major concerto\n\n\nLove it's like ... but it has more strings different ... very different tone to em structure to the instrument but when I Googled it didn't take a look at it viola dumb ... here is Rachel ... with our son ... as we hear music by another great composure from the baroque on Tony open all the ... major concerto na\nNa\nNa\nNa\nNa\nNa\nNa na\n\nNa\n... that that that that says\n\nMy ...\nAnd what doesn't\n\nAgain\nOn the line [noise]\n\n\n[noise]\n\n\n\n\nA punt performing of course when the violin was Rachel Martin pie with Matthew hey go at the piano music by a man who was himself a violinist Americans ... burly that's called the rapid\nA brochure first produced by the Arizona department of Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world joined K A bill you see and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty seven and St Paul's cultural for information visit K. A. W. C. dot org this has been made possible in part by a grant from Arizona humanities\nHuman county library continuing their small business workshops series presented by business librarian Andrew Solomon this week teachers find your customer friday afternoon October fifth from three to five at the humane library twenty nine fifty one south twenty first drive more information at human library dot org\n\nThis is eighty eight point nine F. M. K. A. W. feet Yuma K. A. W. P. Parker and take a W seat dot org observance of Amazon a western college for more than forty five years trusted news for humor and the ... county it's nine o'clock\nI might be a novelist that next time on Latino USA a conversation with Supreme Court Justice Sonia Sotomayor about writing to books for kids all challenges or not to be just could not when\nThey become a part of what we hang with us then next time on the you know usa\nTraining and then again I mean the eighty nine and then [noise]\nTwenty percent chance of showers in Yuma tonight before eleven partly cloudy skies with low around Seventy two tomorrow sunny skies with a ... eighty four with the north west window five to ten miles per hour\nIn Parker tonight fifty percent chance of showers partly cloudy skies halo around sixty seven and tomorrow Sundays guys with the high end you're eighty seven and a south south west window of five to ten miles per hour\n\nMy from NPR News in Washington I'm Shay Stevens White House officials are defending President Trump's criticism of a woman accusing Supreme Court nominee Brett Kavanaugh of past sexual assault spokeswoman Sarah Sanders was asked about Trump's comments at a Tuesday rally where he mocked Christine Blasey Ford's testimony at a Senate hearing\nThe president was stating the facts are frankly facts that were included in special prosecutor Rachel Mitchell's report he was stating facts that were given during Dr Ford's testimony and it's and it has to make a decision based on those facts and whether or not they see judge Kavanaugh to be qualified to hold the position on the Supreme Court\nSanders says Kevin O's detractors of made falls in baseless allegation and a coordinated smear campaign to question his legitimacy for the high court\nSenate majority leader Mitch McConnell has a copy of the FBI supplemental background check on Kavanaugh will be released to lawmakers for review he says a procedural vote on the nomination is set for friday\nThe international court of justice was ordering the United states to make sure that it's sanctions do not hinder aid to Iran NPR's Michele Kelemen reports that the Trump Administration is fighting back\nAccusing Iran of using the court as a propaganda forum\nThat Trump minister ration is pulling out of the Nineteen fifty five treaty of amity with Iran which you can use to bring its case against the U.S at the international court of justice national security adviser John Bolton to the U. S. is also withdrawing from another international protocol to undercut a Palestinian case it\nToday the international court of justice was ordering the United states to make sure that it's sanctions do not hinder aid to Iran NPR's Michele Kelemen reports that the Trump Administration is fighting back accusing Iran of using the court as a propaganda forum\nThe Trump Administration is pulling out of the Nineteen fifty five treaty of amity with Iran which Iran used to bring its case against the U.S at the international court of justice\nNational security adviser John Bolton does the U.S is also withdrawing from another international protocol to undercut a Palestinian case that the court which challenges that decision to move the U.S embassy in Israel from Tel Aviv to Jerusalem\nUnited States will not sit idly by as face looks politicized claims are brought against those\nFulton ad that he's now reviewing all agreements that exposed the U.S to the jurisdiction of the un tribunal Michele ... NPR News Washington\nAnd Florence South Carolina seven law enforcement officers have been shot in one killed while trying to serve a warrant South Carolina Public Radio's Victoria Hansen reports that authorities say a suspect barricaded himself inside a home and help children hostage\nInvestigator said the way the suspect was positioned he had an advantage shots were being fired everywhere\nThree of the wounded officers were removed with a bullet resistant vehicle as a suspect continued to open fire rooting for more police officers\nAuthorities say the standoff lasted two hours some of the injured officers are in serious condition the children have been taken to safety the suspect is in custody the shootings happened at an upscale neighborhood police have not said why they were serving the war it for NPR News I'm Victoria Hansen\nOn Wall street stocks closed a bit higher although blue chips hit a new high the Dow gained fifty four points on Asian market shares are mixed up one percent in Shanghai this is NPR News\nWorkers at seven marry out hotels in Boston walked off their jobs after months of field contract talks their union UNITE HERE says more than Fifteen hundred service workers are taking part in the strike\nThe Boston walkout comes days after members of another unite your local reached a new contract agreement at more than a dozen Chicago hotels\nStrikes continue in several other Chicago hotels where workers are insisting on year round healthcare benefits for workers who are laid off during slower mumps and hotels and several other cities are facing the possibility of strikes most of them in California\nThe engineer who helped shape the sound of the Beatles has died just America what Seventy two years old as NPR's on a stop to steal cars reports emerged died yesterday of heart failure at his home in Los Angeles\nGesture America came of age with the Beatles\n[noise]\nAnd I actually just years old when he began working it out of the road studios in London he was an assistant engineers for such early hits as love me do in a hard day's night he became the Beatles primary engineer it and just as he turned Nineteen and help turn the studio into a laboratory or salad\n\n\nHemorrhage went on to work with a wide range of artists from Michael Jackson to Kate Bush on us as he has to cuss NPR News\nNew York and I'm Steve and NPR News in Washington\nFor NPR comes from NPR stations other contributors include vital project started supporting the museum of modern art in Manhattan where drugs and dance theater the work is never do\n\n\nYeah and I went on to work with a wide range of artist from Michael Jackson to the push on his says he had two cars and here in New ... New York\nAnd I'm Steve Henn NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include vital project started supporting the museum of modern art in Manhattan where jets and dance theater that work is never done it don't view and includes weekly performances in Marin atrium more at ... dot org\n\nAmerican music or you right now and we have a cup of coffee is seven the last symphony to hear just a little bit this is the group called empire brash with friends and we hear selections from sweet drawn from the opera by George Gershwin Porgy and Bess\n\nI don't\n\nOh ... with a ... with a ... a ... what\n... what a what\n\nPerformance by empire brash with selections from George Gershwin already in bed\n\nAnd this is also from Porgy and Bess she would make to conduct [noise]\n\n\n[laughter] [noise]\n\n[noise]\nOh I can sit down that comes from the opera Porgy and Bess by George Gershwin Xu Bin ... New York philharmonic New York or London\n\nMixed his music by ... ... if I had different styles at different times of his life although always recognizable as per a copy of music\nUh some rather album guard he was known as an awful to be a a a very experimental young man\nAnd I did some pieces that weren't are quite conservative and this is one of those very late music upper coffee if in fact when he attended the from Europe is in Nineteen fifty two it was to be the last concert he would ever attend and he died\nJust a couple of months after this symphony number seven where he parents just dial down to a rather simplistic ... are you pro trouble um this is the Los Angeles philharmonic orchestra Henri prepping the conductor this ... symphony by ...\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\nMm\n\n[noise]\n[noise] Mm\n[noise]\n\nOh [noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\nOoh [noise]\n\n\n\n\n\n...\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\nUnless you're a real efficient auto with the music of Chopin you'd probably have never heard that before album leaf unpublished had recorded their bike Eric Olson\nThe UC foundation WC alumni association and the Mexican constantly to Yuma upper taste if you look through the fast it's a chance to sample local cuisine while enjoying entertainers celebrating Mexican culture friday evening October fifth from five till eleven details at foundation dot easy western dot edu\nIt's ten o'clock and you're listening to K. A. W. the Duma K. A. W. P. Parker eighty eight point nine at them and take a W the dot org observance of average in a western college for more than forty five years since the news for the past ... counties I'm Anthony ...\nFifty percent chance of showers in Parker tonight with partly cloudy skies ... around sixty seven tomorrow sunny skies with ... eighty seven at south south west window five to ten miles per hour\nAnd you might say twenty percent chance of showers before eleven partly cloudy skies with low of Seventy two and tomorrow sunny skies behind your eighty four and a northwest window five to ten miles per hour\nIn the county library hosting a presentation by business librarian Andrews ... he'll be leading a series of workshops that each potential small business owner is what they need to know to start a small business this week teachers creating a profitable company it's Thursday October forth from three to five at the St Louis library\nAnd Seventy five north sixth avenue in San Luis\nLive from NPR News in Washington I'm shave Stevens and the majority leader Mitch McConnell says he's filed a motion to end debate over judge Brett Kavanaugh's nomination to the U.S Supreme Court\nHe says a boat on the confirmation could be held as soon as Saturday McConnell said there's plenty of time between now and then for lawmakers to review the FBI supplemental background check into allegations that Kavanaugh engaged in past sexual misconduct or both will have\nThe opportunity to review investigators records\nAt as a standard procedure designated [noise]\nIs this your staff members with a required Clarissa\nWill be authorized the brief members\nLawyers Kevin O's principled accuser Christine Blasey Ford said they're disappointed that the FBI review did not including interview with their client door witnesses to corroborate her allegations\nThe of time between now and then for lawmakers to review the FBI supplemental background check into allegations that Kavanaugh engaged in past sexual misconduct or both will have\nThe opportunity to review investigators records\nAt as a standard procedure doesn't motive [noise]\nThere's your staff members with a require ...\nWill be all of the ... member\nLawyers for cabinet was principled accuser Christine lousy for say they're disappointed that the F beyond review did not include an interview with their client nor witnesses who could corroborate her allegations\nPresident Trump's ridicule of Christine Blasey Ford has alienated Republican Senator Susan Collins Lisa Murkowski and Jeff Flake as NPR's Tim Mak reports the lawmakers are upset over Trump's remarks at a campaign rally Tuesday night Trump\nMocked Ford's Senate testimony at a political rally in Mississippi his attack on Capitol is accuser\nWas greeted with cheers but where is the flight so I don't remember how many years [noise] not\nSo much on Capitol Hill Republicans have a slim majority in Senate meaning that Kavanaugh's confirmation may come down to three key lawmakers Here's Senator Murkowski\nEye and taking everything into account and I think the president yesterday\nMy doctor for we're totally inappropriate and in my view unacceptable\nSenator Collins called the comments just plain wrong and Senator Flake called it kind of appalling Tim Mak NPR News Washington\nThe FBI has arrested a former sailor in Utah who is suspected upstanding suspicious letters to the White House and the Pentagon the story from NPR's Greg Myre worry\nThe FBI identifies the suspect is William Clyde Allen age thirty nine of Logan, Utah you served in the navy in the early to thousands but it wasn't immediately clear what he's been doing in recent years\nHe was picked up after two incoming letter to the Pentagon in one to the White House were flagged just suspicious before the envelopes entered either building\nThe Pentagon says the two letters it received contain caster seeds which aren't inherently dangerous but can be used to make the poison rice and the secret service hasn't disclosed its findings from the letter addressed to President Trump Allen is expected in court on friday\nGreg Myre NPR News Washington\nFirst lady Melania Trump store the infamous door of no return off the coast to Senegal a hub for the Atlantic slave trade Mrs Trump described it as a solemn reminder of a time in history that should never be forgotten the site is now a museum and memorial this is NPR News\nI'm federal judge in San Francisco is temporarily blocking the government from ending protections for hundreds of thousands of immigrants from\nCountries afflicted by disaster or war us district judge Edward ... granted a request for preliminary injunction pending the outcome of a lawsuit over the issue\nThe suit was filed on behalf of immigrants from Sudan Nicaragua Haiti and El Salvador who stand to lose protections which allowed them to live and work in the U.S until conditions at home improve\nWith the help of a former Pennsylvania governor a nonprofit group says it plans to open a supervised injection site for illegal drug users in Philadelphia is WHYY Bobby Allyn reports the Justice Department is already threatening to shut it down\nCall it an overdose prevention site where users inject the legal drugs under the watchful eye of medical staff\nSupporters say it will save lives and move more people into treatment deputy attorney general Rod Rosenstein says if the site opens the response will be swift and aggressive because it violates federal drug laws former Pennsylvania Governor Ed Rendell is a board member of safe\nTo open a supervised injection sites or illegal drug users in Philadelphia is WHYY Bobby Allyn reports the Justice Department is already threatening to shut it down\nAdvocates call it an overdose prevention site where users inject the legal drugs under the watchful eye of medical staff\nSupporters say it will save lives and move more people into treatment deputy attorney general Rod Rosenstein says if the site opens the response will be swift and aggressive because it violates federal drug laws former Pennsylvania Governor Ed Rendell is a board member of safe house the nonprofit trying to open the site he isn't worried\nOr their message for Mr Rosenstein um incorporate or of let's say protection site non profit and they come and arrest me first\nResearchers say the opioid crisis claims a hundred lives nationwide every day for NPR News I'm Bobby Allyn in Philadelphia\nOn stock markets in Asia shares are mixed up one percent in Shanghai following slight gain on Wall street I'm shape Stevens NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home at ... dot com\n\n... great to operate a composer wrote a number of standalone walks us we're going to one of them right now called the gold and silver waltz and this is the Vienna Johann Strauss orchestra conducted by ... [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\nKnow that when\nHe was a body surprised me a Viennese composer born in Eighteen fifty named Johan Trumbull and that was the trumble quartet performing at ... ... ... ...\nHow the beat the bill has grown now how big your nose has become so loosely translates novels sounds like a German accent it doesn't\nAffect let's hear our church novel play a bit of Schubert\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\nA musical moment to moment she called by Schubert recorded by Arthur ... novel that was the number three and a half my\n\nWhat a privileges to present to you this recording which is with one of the ... century's greatest pianist in repertoire which he specialized and I'm speaking of art or ... novel and the ... we're going to listen to one of the Beethoven piano concerto this recording is from Nineteen thirty three it's a very fine transfer\nOf Beethoven's piano concerto number four in gene major and Arthur ... novel is joined by the London philharmonic orchestra conductor here is Malcolm Sharpton\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nHe\n\n[noise]\n[noise]\n\nThe ... calling themselves fend has performed that dance titled the galley art to by William Bert\nAre the human county library is hosting small business workshops presented by Andrew Tilghman this week there'll be between buying your customer it will be this Friday afternoon from three to five at the human brain library twenty nine fifty one south twenty Bruce drive you can find further details that you bought library dot org\nIt's eleven o'clock and you're listening to K. A. W. see you must pay a W Peter Parker eighty eight point nine at them and K. A. W. dot org a service of Arizona western college for more than forty five years tough to deal with for the pots and you'll ... counties I'm Anthony ...\nTwenty percent chance of showers in Yuma tonight before Lebanon partly cloudy skies with low around Seventy two tomorrow sunny skies with a ... eighty four with the north west windows five to ten miles per hour in Parker tonight fifty percent chance of showers partly cloudy skies halo around sixty seven and tomorrow send these guys with the high end you're eighty seven and a south south west wind up five to ten miles per hour\nIn observance of Hispanic heritage month the St Louis library will host or fifth annual our expedition featuring the artwork of local art is it continues through October fifteenth assemblies branch library ten Seventy five north sixth avenue you can find further details that Yuma library dot org\nSeventy two tomorrow sunny skies with a high and you're eighty four with the north west window five to ten miles per hour in Parker tonight fifty percent chance of showers partly cloudy skies halo around sixty seven and tomorrow Sundays guys with the high end you're eighty seven and a self southwest window of five to ten miles per hour\nIn observance of Hispanic heritage month assemblies library will host or fifth annual expedition featuring the art work hard is it could be used for the October fifth you got the family's ranch library in Seventy five more sixth avenue you can find further details are you my library dot org\nUm Mm\nLive from NPR News in Washington I'm chase Stevens the Senate is preparing to vote this week on judge Brett Kavanaugh's nomination to the Supreme Court now that the FBI is done looking into sexual assault claims against him\nMeanwhile the White House was defending President Trump's comments ridiculing testimony by Kavanaugh's accuser Christine Blasey Ford\nNPR's Ayesha Rascoe has more\nWhite House press secretary Sarah Sanders says Trump was not making fun of for during his remark that Mississippi campaign rally during the event the audience laughed in a plot as Trump question for the count of the alleged sexual assault\nSeemed to me that he was stating facts that Dr Ford herself a laid out in her testimony once again a every single word that judge Kavanaugh had said has been looked at examined picked apart by most of you in this room\nCabinet has categorically denied all allegations of sexual misconduct some Republican senators have complained that Trump's remarks were inappropriate ... NPR News the White House\nA federal judge has temporarily preventing the Trump Administration from ending humanitarian protections for more than three hundred thousand immigrants and sending them home from member station cake you eat eat for ... Murray Hill has more\nJudge Edward Chen says temporary protected status holders and their U.S born children would suffer irreparable harm if the Trump Administration ends TPS for national\nOf Salvador Nicaragua Haiti and sit on\nMy contract Jen says the federal government failed to establish any real harm as TPS stays in place\nThat program allows immigrants from countries devastated by natural disasters or war to live and work in the U.S the preliminary injunction will be an effect on the ten rules on the class action lawsuit brought by TPS holders and their American Kids\nThey claim that Trump Administration unlawfully ended that protections because of racial bias for NPR News I'm fighting for that or a medal in San Francisco\nAt least one South Carolina law enforcement officer has been killed six others were wounded after a gunman opened fire on them in the city of Florence Allen hide lowers the city's police chief they were responding\nWhere they knew that their brothers\nFrom the sheriff's officer brothers and sisters and the sheriff's office or in the\nPie loses shares we're trying to deliver a search warrant on a man barricaded himself inside the home open fire on them and police responding to the shooting he says the suspect who had been holding children hostage is in custody\nAuthorities in Logan, Utah have arrested a man in connection with suspicious letters mailed to the White House and the Pentagon to the oval contained traces of what turned out to be cast her seeds they were thought to contain traces of the poison rice and which is made from a byproduct of castor oil production\nYou're listening to NPR News\nThe U.S Senate has voted overwhelmingly to send almost two billion dollars in recovery aid to states impacted by Hurricane Florence and other recent disasters NPR's David Schaper reports\nCustody authorities in Logan, Utah have arrested a man in connection with suspicious letters mailed to the White House in the Pentagon to the envelope contained traces of what turned out to be cast her seat they were told to contain traces of the poison rice and which is made from a byproduct of castor oil production\nYou're listening to NPR News\nThe U.S Senate has voted overwhelmingly to send almost two million dollars in recovery aid to states impacted by Hurricane Florence another recent disasters NPR's David Schaper reports that the money is part of a bill reauthorized funds for FAA programs the bill tackles a\nWide range of controversial air travel issues it requires the FAA was fabulous job minimum sides for airplane seat to stop the shrinking of leg room and it prohibits airlines from removing passengers from overbooked planes\nIt also attempts to shorten airport security lines by boosting the number of bomb sniffing dogs at airports about funding new passenger screening technologies\nIt signed into law the bill would at ease cigarettes to the on board smoking ban it would prohibit talking on cell phones during flights and it would set new rules for transporting animals but an effort to limit the fees that airlines charge for checking baggage and changing reservations failed David Schaper NPR News\nSecretary of state Mike Pompeo says the United states just terminating a Nineteen fifty five treaty that tougher infringing relations with Iran the move came after the United nation's highest court order the lifting of sanctions on Iran that affect imports of humanitarian goods\nAround argue that sanctions imposed after the U.S pulled out of the twenty Fifteen nuclear agreement were in violation of the Nineteen fifty five treaty\nPale calls the claims absurd and they used to run of abusing the international court for political and propaganda purposes on Asian stock market shares are mixed down nearly one point eight percent\nIn Hong Kong this is NPR News\nSupport for NPR comes from the NPR stations or their contributors include ISI MC foundation working to improve postsecondary educational outcomes for underserved students through evidence based innovation learn more at ease the emcee foundation dot org\n[noise] Phoenix medals on really hitting his stride when he wrote the piece we're going to ride out he was Eighteen years old already a very season the composer but he started really composing his his masterpieces right around this time this was a cattle to nothing in B flat major the number three\nAnd Frederick Chu is the pianist [noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n... new ... new\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[laughter]\n[noise]\n[laughter]\n[noise]\n\n\n\n\n\n\n[noise]\n\n... Kew was the pianist and stick the middle so close to ... in that Saddam in B flat major is\nNumber three\nLittle song by the so called new love some by Christopher ...\n[noise]\nHe lives on it seems to me\nThere's just not just took\nThe money [noise]\n\n[noise]\nHe's going to switch from the teachers aren't even much easier for people to do [noise] some of\nThe things I'm going to be the top of you who is good\nI don't\nKnow\nWhat\nYou can find some way to find all the time he prefers to kids who\nCome from I'm going to be the science of course you\nKnow\nWe've been she's ready to meet you too much and he told me about it at all\nI\nKnow [laughter]\nTo talk some more you know ... the\nLittle ... ...\n\n... ... forty piano what song by Phoenix Mendelssohn called ... or you love\n\nWe are going to listen to just a few minutes to a sweet composed for a radio production of Shakespeare's Midsummer Night's dream and its music arranged by shock you bear and right now we have a bit of music from middle ... music for six years I've been someone extreme\nThis is the Internet so bumper symphony orchestra conducted by ... Peter floor\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\nMm [noise]\n\nMm\n[noise]\n[noise]\nMm\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\nCanadian Brass performing that music by William Bert ... up about\nCounty library continuing their small business workshops series presented by business librarian ... this week teachers find your customer friday afternoon October fifth from three to five at the human main library twenty nine fifty one twenty first dry Maureen\n[noise] Canadian Brass performing that music by William bird\nUp of human county library continuing their small business workshops series presented by business librarian Andrew Solomon this week teachers find your customer friday afternoon October fifth from three to five at human main library twenty nine fifty one top twenty first drive more information at human library dot org\n\nIt's midnight dishes eighty eight point nine F. M. K. A. WC Yuma K. A. W. P. Parker and K WC dot org\nObservers of Arizona western college for more than forty five years trusted news for ... and the pause counties stay tuned for NPR headlines and more classical music\nSunny skies and Parker today a high near eighty seven with the south south west window five to ten miles per hour in the evening clear skies but the lower around sixty two\nIn Yuma sunny skies with the high near eighty four a northwest window five to ten miles per hour clear skies in the evening with a low around sixty nine and a west northwest breeds of five to ten miles per hour\nThe ADA UC foundation the AWAC alumni association and the Mexican constantly didn't Yuma offer taste of you must ... fast it's a chance to sample local cuisine while enjoying entertainers celebrating Mexican culture friday evening October fifth from five till eleven details at foundation dot easy western dot E.\nLines from NPR News in Washington ... Stevens oh one hundred US Senators and a handful of staff will get to read the FBI supplemental report on sexual misconduct claims against Supreme Court nominee Brett Kavanaugh an initial Senate vote on the nomination set for tomorrow\nA new NPR PBS Marist Poll shows more Republicans are becoming enthusiastic about next month's midterm elections as NPR's Brian Naylor reports the survey also shows Republicans have narrow the gap with Democrats over which party voters want to see in control of Congress the poll\nShows a two percentage point difference between the numbers of Democrats and Republicans who are calling next month's election very important in July the number was ten points in favor of Democrats and the Democrats advantage on which party Americans want to have in control of Congress has fallen in half\nFrom twelve points in mid September to six points now\nThe latest poll numbers come during a heated partisan battle over President Trump's nomination of judge Brett Kavanaugh to the Supreme Court multiple women have accused him of sexual misconduct which Kavanaugh has denied the controversy appears to have fired up Republican voters\nBrian Naylor NPR News Washington\nThe United states is pulling out of a Nineteen fifty five treaty affirming friendly relations with the wrong the largely symbolic gesture comes after the international criminal court sided with Iran in a complaint challenging us sanctions that affect imports of humanitarian goods\nNational security adviser John Bolton says the U.S is also withdrawing from an amendment to the international law on treaties\nThe United states which grow from the optional for the call and dispute resolution to the Vienna Convention or diplomatic relations this has any connection with the case brought by the so called state of Palestine naming the United states as a defendant challenging our move our embassy from Tel Aviv to Jerusalem\nFulton says the Vienna Convention resolution violate us sovereignty and could have been used to sue the United states in international court a shooting in Florence South Carolina has left the police officer dead and several others injured\nTreaties the United states which girl from the optional for the call and dispute resolution to the Vienna Convention or diplomatic relations this was any connection with the case fraud by the so called state of Palestine naming the United states as a defendant challenging our move our embassy from Tel Aviv to Jerusalem Fulton\nSays the Vienna Convention resolution violate us sovereignty and could have been used to sue the United states in international court a shooting in Florence South Carolina has left the police officer dead and several others injured South Carolina Public Radio's fence called loophole reports that the suspect is in custody\nPolice say the suspect exchanged gunfire with officers for two hours while holding children hostage before he was taken into custody neighbors described hearing burst of gunshots has dozens of police cruisers swarmed the neighborhood including an armored vehicle that was used to rescue three of the wounded officers\nBy the time the shooting stopped seven officers have been shot one fatally as well it's a twenty year old male who was in the home too though it's not clear who he is or why was there\nPleads have not released the name of the shooter or the condition of the other officers police identified the slain officer as parents care away a thirty year veteran of the force for NPR News I'm Vince cold blue go in Colombia\nAnd you're listening to NPR News\nBritish officials claim the Russian military intelligence unit gee argue is behind a new wave of global cyber attacks on political institutions and businesses\nForeign secretary Jeremy ... called it a pattern of behavior that shows disregard for international law or established norms Britain's national cybersecurity center had already blame that you argue for the poisoning of a former Russian double agent and his daughter in England earlier this year\nMoscow denied any involvement in the attacks\nThe first moon and another solar system may have been detected with the help of the Hubble Space telescope NPR's Nell Greenfieldboyce reports that defined as exciting but still needs to be confirmed finding\nMoons is important because planets aren't the only kind of world that alien life could call home astronomers David camping and Alex teaching of Columbia University now say they see signs of a moon around Jupiter sized planet in a solar system that's eight thousand ... light years away\nKeeping says this planet appears to have a moon the size of Neptune\nYou know we're still not a hundred percent sure about that that we think is the leading hypothesis\nIf they're right it would be a pretty big deal that's why they hope to do more observations with Hubble next year Nell Greenfieldboyce NPR News\nThe U.S Senate has voted to reauthorize the Federal Aviation administration and fund aviation programs for the next five years the ... legislation requires to get the aid to establish a minimum size for airplanes seats that new rules for transporting pets and prohibits airlines promoting pastors from over both flight this is NPR\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen programmed massages including warning night and stretch sessions retailers nationwide more dream wave chair dot com Andy any each case the foundation\n\nAround to grow up here with music which is by use of hide and right now and then ... and early work of his later on the heightened ... is the fifty ninth symphony which happens to have a subtitle attached to it it's called the ... the fire some funny because of\nA company to play called the source of fire which was performed asked her husband were heightened was employed it's also thought though that it may be a social subtitled because of the very dramatic contrast and ... ...\nAndy Andy each case the foundation\nPeter Randy Graf here with music which is by us have heightened right now in the ... or the work of his later on the heightened is the fifty ninth symphony which happens to have a subtitle attached to it it's called the forty hour the funnier sympathy because if\nA company to play called the source of fire which was performed asked her husband were heightened was employed it's also thought that it may\nBe a social subtitled because it's a very dramatic contrast since ... soft and loud and also the use of rhythm and the symphony it's performed you buy the loose on chamber orchestra he ... the conductor\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThey\n\nWere\n\nSimply by using heightened number fifty nine in a major series is subtitled with the fire symphony due in part because there's some of it was thought to be used to a company a play called the fire stores but also because of the rather binary nature\nYou\n\nKnow\nSymphony by using heightened number fifty nine in a major subtitle with the fire symphony\nDue in part because some of it was taught to use to accompany a play called the fire source but also because of the rather fiery nature of the peaks moves on chamber orchestra he switched up a couple of the conductor\nIf I can push me Watkins fire dance\n[noise]\n\nMm\n[noise]\nMm\n[noise]\n\n\n\n\n\n\nMhm [noise]\n\nSuzanne McDonald playing the fire dance by what can\n\nThere's an interesting work it's by eight twenty three year old ... crops he was already a very season composer at that very young age\nIt's a ... at least originally but we have a transcription made by the flu just hear much about ... and he plays this Saddam's ... opus Eighteen by Strauss with Eric the siege\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nUh\nOrchestra of St John Smith Square one Jon Lovett conducting a German dance\nBy boats are the human county library is hosting small business workshops presented by Andrew zoom in these week there'll be featuring find your customer it'll be tomorrow afternoon from three to five at the human main library twenty nine fifty one twenty first Dr you can find further details are you my library don't or\nThis is eighty eight point nine F. M. K. A. W. see humor K. A. W. P. Parker and K. A. W. seat dot org ... percent of western college more than forty five years trusted news for humor and the ... counties\nIt's one o'clock NPR headlights is up next fall to buy another hour of classical music overnight with Peter banned the graph\nHigh is reaching eighty four in Yuma tonight with some sunny skies north window five to ten miles per hour clear skies tonight with the low around sixty nine and a column west northwest breeze in perjured sunny skies with a high near eighty seven south south west window five to ten miles per hour and in the evening clear skies but the low around sixty two\nIn observance of Hispanic heritage month assemblies library will host or fifth annual mission featuring the art work of local art is it continues through October fifteenth assemblies branch library Seventy five north sixth avenue you can find further details you my library dot org\n\nLines from NPR News in Washington ... Stevens\nSenate majority leader Mitch McConnell says he'll vote hold a vote tomorrow to end debate on Brett Kavanaugh's nomination to the U.S Supreme Court if successful McConnell says the confirmation those could be held on Saturday\nIn the meantime there's he says there's plenty of time for all one hundred senators to review and that's beyond his report on sexual misconduct allegations against Kavanaugh\nEverybody's will have the opportunity to review investigators records\nAt as a standard procedure designated [noise] their shirts up numbers with a required clearances\nWill be authorized debris members\nLawyers for Kevin O's main accuser say they're disappointed that the FBI refuted not including interview with their client the witnesses to corroborate her story meanwhile an NPR PBS NewsHour Marist Poll finds that more Americans believe Christine Blasey Ford than those who believe judge Kavanaugh details from NPR's Jessica Taylor\nForty five percent say they believe for allegations of sexual assault against capping off as described in her testimony to the Senate that's a Thirteen point up take from those who thought Ford was telling the truth before she testified last Thursday\nA third of Americans say they believe Kavanaugh who strongly denied assaulting for it or ever acting inappropriately that's slightly from before he testified went about a fourth ... cabin with being truthful\nThe public perception is this shift from the Nineteen Ninety One Clarence Thomas Anita Hill hearings back then fifty six percent of Americans believe that then Supreme Court nominees denials over hills accusations that Thomas\nThe sexual assault against Kavanaugh as described in her testimony to the Senate that's a Thirteen point uptake from those who thought Ford was telling the truth before she testified last Thursday\nA third of Americans say they believe Kavanaugh who strongly denied assaulting for it or ever acting inappropriately that's slightly from before he testified what about uh forethought cabinet with being truthful\nAnd the public perception is a shift from the Nineteen Ninety One Clarence Thomas Anita Hill hearings back then fifty six percent of Americans believe that then Supreme Court nominees denials over hills accusations that Thomas's sexually harassed her only twenty four percent then said they believed to\nJessica Taylor NPR News Washington\nA federal judge in San Francisco is holding the government's plan to end temporary protected status for immigrants ... natural disasters or war at home us district court judge it were Chan issued a preliminary injunction in a lawsuit brought by a number of immigrants from Sudan Haiti Nicaragua and El Salvador\nChance of the Trump Administration has failed to show that there's any real harm and letting the immigrant's day pending the outcome of their case\nOf Florence South Carolina law enforcement officer is dead and several others are injured after a gunman shot them last night South Carolina Public Radio's Victoria Hansen describes what led to the attack\nInvestigators say the suspect open fire the officers as they tried to serve that war edge they say he was barricaded in a home with children inside\nThe kids have been taken to safety the suspect is in custody authorities in a standoff lasted two hours some of the officers injured are said to be in serious condition no word on the reason the war was being served for NPR News I'm Victoria\nHansen on stock markets in Asia shares are mostly lower down one percent in Shanghai and up nearly two percent in Hong Kong you're listening to NPR News\nI'm an in Utah was accused of sending suspicious letters to President Trump into us defense officials thirty nine year old navy veteran William Allen was arrested yesterday in the northern city of Logan he's accused of mailing humble dose with traces of what turned out to be cast her seats initially thought to be traces of the boys and rice and\nBritain claims Russia's military intelligence service the G argue is behind a series of global cyber attacks designed to undermine international stability as the BBC's Gordon career reports British officials say the targets include a British television station and the U.S Democratic Party\nBritain's national cybersecurity center says you have high confidence that a group of activists belonging to the G all you often known as fancy bear was almost certainly responsible for a series of cyber attacks a\nPrevious attacking June twenty Seventeen which cripple businesses around the world including the u._k. had already been linked to the geo you in a statement the foreign secretary Jeremy ... said the G argues actions were reckless and indiscriminate\nAnd that together with allies the u._k. would expose and respond to the G argues attempt to undermine international stability\nThe BBC's Gordon career reporting\nInternational relief efforts are picking up and central Indonesia nearly one week after an earthquake and tsunami on ... ways the island\nIndonesia disaster agency says at least fourteen hundred people were killed and more than Seventy thousand others are displaced the un estimates that around two hundred thousand people need assistance in the disasters ...\nI'm chase Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the George guns foundation working to make Cleveland and the northeast Ohio more globally competitive livable sustainable and just more information available\nSo the waste the island Indonesia disaster agency says at least fourteen hundred people were killed and more than Seventy thousand others are displaced the un estimates that around two hundred thousand people need assistance in the disaster zone I'm chase Stevens NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include the George guns foundation working to make Cleveland and the northeast Ohio more globally competitive livable sustainable and just more information available at gun foundation dot org and the corporation for public broadcasting\n\nWhich would be ... to grow up they would be for some\nMusic depicting the creation of the world we also will listen to you talk proven in ... in control [noise] here's a remarkable piece from a composer born in sixteen sixty six you're going to think it sounds like it's completely modern however as this depicts chaos before the creation of the world\nIt's by French composer John Feehery or rebel and almost all of the notes of the scale are played at the same time the depiction of the chaotic state before the the assembly of the elements into the creation here is that right her ... and ...\n[noise]\n[noise]\n\n\n\n\nMm\nMm\n\n\n\nMm\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n... yeah ...\n\n\n\n...\n\n\n[noise]\n\n\n\n[noise]\n...\n\n\n[noise]\n\n\n\n\n\n\n\nMm\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\nA song by ... corps and gold with baritone decreased control and got him a county library continuing their small business workshops series presented by business librarian Andrew Solomon this week teachers find your customer friday afternoon October fifth from three to five at the human main library twenty nine fifty one south twenty first drive\nMore information at you my library dot org\nService of hours at a western college for both the forty five years this is Kate AWAC you must take a WPN Parker eighty eight point nine F. M. S. K. A. W. dot org trusted news for humor and the ... counties\nIt's two o'clock NPR headlines is up next fall divided up an hour of classical music overnight with Peter Van to graph\nSunny skies and Parker today a high near eighty seven with the south south west window five to ten miles per hour in the evening clear skies but the lower around sixty two in Yuma sunny skies with the high near eighty four a northwest window five to ten miles per hour clear skies in the evening with a low around sixty nine and a west northwest breeze that five to ten miles per hour\nThe WC foundation the AWAC alumni association and the Mexican conflict in Yuma upper taste if you look through the fast it's a chance to sample local cuisine while enjoying entertainers celebrating Mexican culture friday evening October fifth from five till eleven details at foundation dot easy western dot edu\nLive from NPR News in Washington ... an FBI report on sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh is to be available to senator today in a secure room on Capitol Hill said majority leader Mitch McConnell said senators and some staffers will have access or\nBecause while the opportunity to review investigators records and as a standard procedure designated [noise] is this your staff members what's required blurring those\nWill be authorized the brief members\nMcConnell has scheduled a procedural vote on the nomination tomorrow if that passes a final vote as possible this weekend in Florence South Carolina\nKavanaugh is to be available to senators today in a secure room on Capitol Hill said majority leader Mitch McConnell says senators and some staffers will have access\nTo the opportunity to review investigators records [noise] at a standard procedure voted voted [noise] their shirts up numbers with a record ...\nWill be all of the ... member\nMcConnell has scheduled a procedural vote on the nomination tomorrow if that passes a final vote as possible this weekend\nIn Florence South Carolina's seventh law enforcement officers have been shot in one killed while trying to serve a warrant South Carolina Public Radio's Victoria Hansen reports authorities say a suspect barricaded himself inside a home and he'll children hostage\nInvestigator said the way the suspect was positioned he had an advantage shots were being fired everywhere\nThree of the wounded officers were removed with a bullet resistant vehicle as a suspect continued to open fire rooting for more police officers\nAuthorities say the standoff lasted two hours some of the injured officers are in serious condition the children have been taken to safety the suspect is in custody the shootings happened at an upscale neighborhood police have not said why they were serving the warrant for NPR News I'm Victoria Hansen\nThe problem of disinformation on social media networks like Twitter remains a major threat ahead of the mid term elections next month\nNPR's Tim Mak reports a new study casts doubt about whether effort to stem disinformation campaigns on Twitter is really working researchers at the Knight Foundation found that more than ... percent of the ... to spread disinformation during the twenty sixteen presidential campaign remain active now\nThe results of this new study raises questions about whether Twitter has effectively been able to crack down on accounts that spreads false information\nThe authors found that disinformation networks continue to pump out more than a million tweets today much of them through automated or semi automated accounts\nTwitter set on July that it was purging suspicious accounts as part of its efforts to build trust the company has also highlighted how many more accounts it is removed this year as opposed to last year Tim Mak NPR News Washington Britain cybersecurity center is accusing Russia's military intelligence unit of\nBeing behind a wave of global cyber attacks in a report released today Britain said Russian hackers have targeted political institutions businesses media and sports\nForeign secretary Jeremy Hunter says the attacks are reckless an indiscriminate that they're designed to interfered elections around the world and to undermine international security\nThis is NPR News from Washington\nThe occupational health and Safety Administration has find superior refining company more than eighty three thousand dollars for a worker safety violations\nAs Wisconsin Public radio Danielle ... reports the violations them from an explosion earlier this year but injured thirty six people ocean found the company\nWhich is owned and operated by husky energy failed to inspect and test equipment to make sure it would fit for service the agency said those measures could've prevented the explosion that constant evacuation for much of the city of superior in April ginger Joel with the activist group twin ports action alliance says the fine it's a slap on the wrist\nThis wasn't the first time this company the superior refining company has been cited for some of the serious issued by OSHA um so how does he really wants to be a good neighbor to our community they'll make a commitment that they will not continue operations like a\nHusky energy's spokesman says in a statement that the company has continuously improving safety programs for NPR\nThe agency said those measures could've prevented the explosion that constant evacuation for much of the city of superior in April ginger ... with the activist group twin ports action alliance that's the point it's a slap on the wrist\nThis wasn't the first time this company the superior refining company has been cited for some of the serious issues bio shot on the show was husky really wants to be a good neighbor to our community they'll make a commitment that they will not continue operations like a\nHusky energy's spokesman says in a statement that the company is continuously improving safety programs for NPR News I'm Daniel ... superior Wisconsin\nA Canadian company will not be allowed to open a robot brothel in Houston a place where people could rent adult love adults\nMayor Sylvester Turner says he's spoken with his constituents around the city and they are not interested\nRegardless of where I was\nFrom ...\nTo ... to ... with\n... which was going to happen with those role but OK\nTurner says he wants to businesses to come to Houston but there are some which he says you know it's fine if you go someplace else I'm door rom NPR News in Washington\nSupport for NPR comes from Heather ... and Paul ... supporting African wildlife foundation working to ensure the future of Africa's wildlife in wild land learn more at a W. S. dot org and Americans for the arts at Americans for the arts dot org\n\nWouldn't listen to some pieces ... by ... played by ... reaching and we have right now something by editor composer born in Seventeen thirty two so exact contemporary of heightened named Francesco bus quality Ricci\nWell traveled in fact the symphony we're going to hear right now was composed in the Netherlands company number for play by the Netherlands radio chamber orchestra young villains ... conductor [noise]\nNoble coldest didn't phony or the almost a little can turtle there by an Italian born composer named Francesco puffs while they are each e simple and you end up or Fort with a metal enjoyed your chamber orchestra Amy or ethnic violence young Dylan distinct conductor\nSo from composer already cheap to violinist or retreat rue general retreat that is\nWho recorded all of the debate the violin and piano works and there's a lot of them will be at least once a violinist himself worthy and his career Sylvia Robin office the pianist these are four pieces from Nineteen twenty nine on the heat loud humorists and the bell\n\n\n\n\n\n\nNah [noise]\nNah\n[noise]\n[noise] [noise]\n\n\n\n...\n\nOh\n\n\n\n\nNa\nNa\n\nNa\nNa\n\n[noise]\n\n[noise]\n[noise]\n\nNa\n\n\n[noise]\n[noise]\nJohn Ritter conducting the city of London since ... the bell Cynthia from the Orioles solved by handle\n\nHere was a third of the symphonic poems now by friends list the famous Lee ... has played by the ... symphony orchestra conducted by close Peter floor\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nWell\nMm\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\nMm\n[noise]\n[noise]\nWell\n[noise]\n[noise]\n\nHow much we based on ... folk melody that is the village dance by morally Calvert played by Chicago brass quintet\nThe human county library is hosting small business workshops presented by Andrew zoom in each week there'll be featuring buying your customer it'll be tomorrow afternoon from three to five at the human main library twenty nine fifty one twenty first right you can find further details are you my library don't or\nThis is eighty eight point nine of them came a double you see humor J. A. W. P. Parker and K. A. W. M. C. dot org a service members in a western college from what the forty five years trusted news for human and the ... counties\nIt's three o'clock NPR headlines is up next fall to buy into the our classical music overnight with Peter banned the graph\nHigh is reaching eighty four in Yuma tonight with some sunny skies north window five to ten miles per hour clear skies tonight with the low around sixty nine and a column west northwest breeze in perjury sunny skies with a high near eighty seven south south west window five to ten miles per hour and in the evening clear skies but the low around sixty two\nIn observance of Hispanic heritage month ... library will host the ... annual Ari submission featuring the art work of local\nNPR headlines is up next although by another our classical music overnight with Peter bend a graph\nHighs reaching eighty four in Yuma tonight with some sunny skies north window five to ten miles per hour clear skies tonight with the low around sixty nine and a calm west northwest breeze\nIn Packer Sundays guys with a high and you're eighty seven assault southwest window five to ten miles per hour and in the evening clear skies but the lower around sixty two\nIn observance of Hispanic heritage month ... annual expedition featuring the art work as hard as it could be used to be October fifth you got the ... ... somebody five more to sixth avenue you can find further details are you my library ...\n\nLive from NPR News in Washington encore of a coal miner in a statement released in the middle of the night the White House said he'd received the FBI's report if its investigation of sexual assault allegations against Supreme Court nominee Brett Kavanaugh that Senate Judiciary committee says it has gotten the report from the White House\nMeanwhile Senate majority leader Mitch McConnell has scheduled a procedural vote known as cloture on Kavanaugh's nomination NPR's Emily Sullivan reports the vote is set for tomorrow\nBy checking off for procedural box McConnell has set up an important vote to take place on friday as the White House prepares to send the FBI is completed report on Kavanaugh to the Senate\nThere'll be plenty of time for members review and be briefed on the supplemental materials\nBefore friday cloture vote\nIs fifty one senators vote in favor of passing the culture the upper chamber will stop its debate on Kavanaugh's nomination moving it to the floor until then senators along with teams is ten staffers will take individual turns viewing just one physical copy of the report in a secure room\nEmily Sullivan NPR News Washington a shooting in\nFlorence South Carolina has left one police officer dead and several others injured South Carolina Public Radio's Vince cold lingo reports at a suspect is in custody\nPolice say that suspect exchanged gunfire with officers for two hours while holding children hostage before he was taken into custody neighbors described hearing burst of gunshots has dozens of police cruisers swarm the neighborhood including an armored vehicle that was used to rescue three of the wounded officers\nBy the time the shooting stopped seven officers have been shot one fatally as well it's a twenty year old male who was in the home too though it's not clear who he is or why was their\nPolice have not released the name of the shooter or the condition of the other officers we've identified the slain officer as parents care way a thirty year veteran of the force for NPR News I'm Vince cold blue go in Columbia\nOfficials in Indonesia said they will end search and rescue efforts tomorrow for survivors of last week's nominee an earthquake that hit the island and ... more than fourteen hundred people were killed and the disaster the BBC's Rebecca ... is on the Lewis the island\n... at the ground that as being completely sit by the hour of that quake and tsunami and sent to the devastation\nThat model on top of the houses that collapse tomorrow it is fairly unlikely that anyone would still be alive teams stretch and the government says they help those that date survive\nThe BBC's Rebecca ... a touch of winter is coming to the upper plains the national weather service says a mix of rain and snow will fall and upper Montana and North Dakota today up to three inch it could fall meanwhile heavy rain persist and parts of Arizona and Utah following the remnants of the Pacific hurricane\nYou're listening to NPR\nA federal judge is blocking the Trump Administration from ending certain image\nAnd it got to get help that survive\nThe BBC's Rebecca ... got a touch of winter is coming to the upper plains the national weather service says a mix of rain and snow will fall in upper Montana and North Dakota today after three inch it could fall meanwhile heavy rain protests in parts of Arizona and Utah following the remnants of the Pacific hurricane\nYou're listening to NPR\nA federal judge is blocking the Trump Administration from ending certain immigration protections for some immigrants for now the Trump Administration cannot end temporary protected status for about three hundred thousand people from El Salvador Haiti Nicaragua and Sudan\nThe status was created by Congress to let people from countries suffering from natural disasters or civil conflict stay in the U.S temporarily\nWith the help of the former Pennsylvania governor a nonprofit group plans to open a supervised injection sites for illegal drug users in Philadelphia on the island of member station WHYY report the Justice Department is already threatening to shut it down\nAdvocates call it an overdose prevention site where users injecting illegal drugs under the watchful eye of medical staff\nSupporters say it will save lives and move more people into treatment deputy attorney general Rod Rosenstein says if the site opens the response will be swift and aggressive because it violates federal drug laws former Pennsylvania Governor Ed Rendell is a board member of safe house the nonprofit trying to open the site he isn't worried\nA message for Mr Rosenstein um incorporate or of the safe injection site non profit in the coming arrest me first\nResearchers say the opioid crisis claims a hundred lives nationwide every day for NPR News I'm Bobby Allyn in Philadelphia\nVice president Mike Pence is scheduled to deliver remarks today criticizing China he's expected to warn China and the U.S won't retreat for movement in the south China Sea the U.S said these are international waters China has declared sovereignty over them on corporate Coleman NPR Indians\nSupport for NPR comes from an be used by over three million businesses for hiring more employers can post jobs and youth screener questions to build their short list a preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\n\nDo they do later on to the great jazz clarinet it's up to the mid ... century ... Herman and Benny Goodman playing concerto was written for them by two of the greatest composers of the ... century ... and ...\nRight now we have music by fronts Schubert this is based on a song you wrote part of the song cycle T shirt in the middle of it and it is talk in a blue moon dry flowers this is a variations on that song played by starfish Doppler and Phoenix Gulf the potential\n\n\n\n\n\n\n[noise]\n[noise]\nMm [noise] Mm\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise] Mm\n[noise]\n\n\n\n[noise]\n\n[noise]\n\nIs [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[laughter]\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\nMm [noise] na\n[noise]\n[noise]\n\n\nExcuses by Schubert descended variations on a stone which he wrote it was part of the song cycle the beautiful Miller's daughter ... and ... was the violin that's the part often played on the flute and recordings Phoenix godly puts the piano\nAnd the name of the children it is talk now blooming dry flowers\nFlower piece here before we move on to some great jazz clarinet playing classical music [noise] this is by John Will be Elizabethan English master Florida gave me a feminist five hours\n\nA day and it's\nAnd\n\nThe ebony concerto from Nineteen forty five by egos driven ski commissioned by and performed there by the jazz clarinet as to what he heard button and these orchestra other great jazz Clara dentist Benny Goodman\n\nBe ebony concerto from Nineteen forty five by ... commissioned by and performed there by the jazz clerk at us what you heard about this orchestra\nOther great jazz Clara dentist Benny Goodman\nCommissioned other great twentieth century got classical composer Aaron Copland to ride a competition and ... responded with his clarinet concerto written just a couple of years after the ... we just heard Nineteen forty seven year secure once again we have to ban for them to work was composed Benny Goodman performing with an orchestra\nAnd we have the have the added benefit of having everyone Copeland conduct\n... were\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nEh\nUh\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n", "show_name": "Music of the Masters", "year": "2018", "city": "Yuma", "day": "04"}