{"month": "10", "state": "AZ", "station": "KAWC", "content": "I'm Joanna I'm from London I salute the fabulous to be had traveling police Rick Steve [noise] ... [noise]\nI Am\nThe races are on the up for grabs in every state keeping up with the mid term elections can feel like running a marathon\nIs about eating out there every day on the front lines\nStaying on top of all the election is can be a challenge for all things considered helps you keep pace [noise] here's a bigger picture every afternoon on all things considered from NPR News [noise]\nHuman county library continuing their small business workshops series presented by business librarian Andrew resolving this week teachers find your customer friday afternoon October fifth from three to five at human main library twenty nine fifty one ...\nA marathon is about eating out there every day on the front lines\nStaying on top of all the election you can be a challenge for all things considered helps you keep pace here the bigger picture every afternoon on all things considered from NPR News [noise]\nHuman county library continuing their small business workshops series presented by business librarian Andrew ... this week teachers find your customer friday afternoon October fifth from three to five at human main library twenty nine fifty one south twenty first drive\nMore information at human library dot org\nThanks for listening to K. A. W. see Yuma K. A. W. P. Parker eighty eight point nine FM and K. A. W. scene dot org a service of everyone's in a western college for more than forty five years trusted news for the pause and human counties\nIt's eight o'clock [noise]\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and rebuild publications in the world\nJoined K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty to seven at St Paul's cultural center for information does it K. A. W. C. dot org this have been made possible in part by a grant from Arizona humanities\nClear tonight in part or with the low around sixty to eighty southwest window five to ten miles per hour sunny skies with the high and you're eighty nine tomorrow with a column southwest breeds tonight in Yuma clear skies but the low around sixty eight west wind up ten miles per hour\nTomorrow some of these guys with the high end you're eighty seven and a northwest window of five to ten miles per hour\nLines from NPR News in Washington I'm Shay Stevens Senate Republicans say an FBI report finds no evidence to support sexual assault allegations against U.S Supreme Court nominee Brett Kavanaugh as W E essays Chris Potter reports from Pittsburgh a lawyer for one accuser said he's not surprised\nMichael ... represents truly sweat Nick she says that she attended parties in the Nineteen eighties where she observed Kavanaugh drunk and pressing himself against women without their consent in Pittsburgh this week ... said the FBI hadn't contacted sweat neck or witnesses who could back up her account\nHe blames the White House and Senate Republicans for limiting the FBI's review\nThe FBI investigation I think is an absolute joke there are only interested in\nRamming this combination through as quickly as possible in the interests of politics\nKavanaugh has denied sweat next claims saying they were quote from the twilight zone for NPR News I'm Chris Potter in Pittsburgh\nAs protesters gathered outside the U.S Senate office in Supreme Court buildings today you as senators took turns reviewing the FBI you report on Brett Kavanaugh democratic Senator Tim Kaine of Virginia says the process is a sham\nThey're letting senators come in for an hour long walk guess what there's not a hundred hours between when they made it available at eight AM and when they want to do the ...\nSouth Carolina Republican Lindsey Graham suggests it's time to move on\nSenators who requested the\nBackground check got what they request [noise]\nThe full Senate will decide tomorrow whether to end debate on that Kavanaugh's nomination with a confirmation vote this weekend\nThe fate of a white Chicago police officer charged with murder and a black teenager four years ago is now in the hands of a jury\nAs NPR's Cheryl Corley reports the case has focused attention on police use of force and race relations a video of the twenty fourteen incident shows police officer Jason Van Dyke shooting Seventeen year old ... McDonald sixteen times\nThe full Senate will decide tomorrow whether to end debate on that Kavanaugh's nomination with a confirmation vote this weekend\nThe fate of a white Chicago police officer charged with murder and a black teenager four years ago is now in the hands of a jury as NPR's Cheryl Corley reports the case has focused attention on police use of force and race relations\nA video of the twenty fourteen incident shows police officer Jason Van Dyke shooting Seventeen year old ... McDonald sixteen times McDonald was holding a knife at the time during closing arguments defense attorney Dan Herbert told the jury to look at the case from the perspective of an officer who feared for his life\nProbably built is not an [noise]\nProsecutor Jody Gleason says the shooting was not justified\nHad no other option that he had you other than firing fat\nPolice say they've already plans in anticipation of the jury verdict Cheryl Corley NPR News Chicago\nAnd Los Angeles a judge sentenced former music Mobil should night for a fatal hit and run in two thousand Fifteen night avoid a trial by pleading no contest to voluntary manslaughter charges the co founder of death row record stared in silence today is the victim's family read statements in court\nOn Wall street stocks close lower with tech shares leading the declined the NASDAQ Composite index fell a hundred and forty five points [noise]\nThis is NPR News\nThe Mormon church is joining Utah lawmakers the governors and others in supporting an agreement to legalize medical marijuana for certain patients the deal follows months of debate\nHeading into the November ballot initiative on the issue Utah governor Gary Herbert says he'll call the special legislative session after the mid term to pass the compromise into law no matter how voters\nDecide the MacArthur Foundation has announced this year's crop of fellows overseas so called genius grants of more than six hundred thousand dollars NPR's ... reports that this year's class includes a diverse array of gifted musicians writers and visual artist\nThe youngest MacArthur Fellow that theory is twenty eight year old composer ... Des\nGoverning Marie so is another winner she's known for chronicling her native to train her latest is the story of the temptations as she told NPR in June\nI just was so moved by the story of these young African American men figuring out their lives and their role is art is while the world and and the country was in grade civic unrest\nOther winners included painter and sculptor Titus can far and poet Natalie Diaz ... NPR News New York\nAnd NPR ... also received funding from the MacArthur Foundation on Asian market shares are mixed hired this hour in Shanghai ... Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build them more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station\nIt's eight or six state June with us for a beautiful night of classical music with Peter Van and grab you don't take a double you've seen eighty eight point nine FM\nWC foundation the WC alumni association and the Mexican consulate in Yuma offer taste of human food\nContributors include American Jewish World Service working together for more than Thirty years to build them more just an equitable world learn more AJ W. S. dot ORG and the listeners who support this NPR station\n... eight or six states too but that's ... beautiful night of classical music with Peter ... you're right take a double you've seen eighty eight point nine ...\nThe aww see foundation the AWAC alumni association and the Mexican constantly you know upper taste of you must ... it's a chance to sample local cuisine while enjoying entertainers celebrating Mexican culture friday evening October fifth from five till eleven details ... foundation dot easy western dot EDU\n[noise] just about various reverse this is a music from Nineteen sixty nine which has said some ... by a British composure born in Nineteen Twenty one William believes are\nOr yup probably how it's pronounced B. L. E. Z. A. R. D. and it describes a couple meeting ... running screen ... conducted by Kevin ...\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n...\n\n[noise]\n[noise]\n\n\n\n\n\n[noise] [laughter]\n\n\nNo\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n... ... and one of history's greatest composer violinist\nAnd one of history's greatest composer violinist named Nicole ... wrote that music was one of the twenty four so violent to pre says we heard the numbers sixteen ... minor\n\n... next time on Latino USA a conversation with Supreme Court Justice Sonia Sotomayor about writing to books for kids all challenges or not to be just putting out when\nThey become a party of what we hang with us then name you know I'm On the you know usa\nTraining and then again I mean the eighty eight point nine at him [noise]\nBroadcasting from the Robert Hardy radio studio complex on the campus of Arizona western college for more than forty five years business K. A. W. ... K. A. W. P. Parker eighty eight point nine FM and K. A. W. seat dot org it's nine o'clock\nClear tonight in partnering with the low around sixty to eighty southwest window of five to ten miles per hour sunny skies with a high and you're eighty nine tomorrow with a column southwest breeze tonight in Yuma clear skies but the low around sixty eight west wind up ten miles per hour tomorrow some of these guys with the high and you're eighty seven and a northwest window of five to ten miles per hour\nVisiting this American Life our producers always chase was following Senator Jeff flake during the days before the recent Kavanaugh hearing that they have the hearing and after that you said that you have not heard elsewhere so\nOne point she was backstage with senator during remember there was straight out of bed fellows but one of the actual cast members from Goodfellas strongly encourage Senator Flake devote a certain way on the nomination\nAnyway that this week Saturday afternoon at four and Sunday evening at seven on ...\nIn observance of Hispanic heritage month assemblies library will host or fifth annual because the mission featuring the art work of art is it continues through October fifth you got the family's ranch library and Seventy five north sixth avenue you can find further details you my library dot org\nMm\nLive from NPR News in Washington I'm Shays Stevens usage Brett Kavanaugh has written a commentary defending his tone and demeanor at a Senate Judiciary committee hearing last week as NPR's Kelsey Snell report Kavanaugh says he was more emotional than usual but remains an impartial judge\nKavanaugh writes in an op ed published by the wall Street Journal that at time his testimony regarding sexual assault allegations against him reflected frustration he says he was wrongly accused ended answers reflected his deep distress said what he described as an unfair process\nCannot write to the judge must be a quote neutral and impartial arbiters who favored no political party he said he reviews the constitution and if confirmed would keep an open mind in every case\nSome Democrats say his performance was partisan and should disqualify the Senate is that for a procedural vote on his nomination on friday Kelsey Snell NPR News Washington\nA handful of US Senators say they have not decided whether to support Kavanaugh's nomination Maine Republican Susan Collins is among the undecided so is retiring Senator Jeff flake a frequent Trump critic who was instrumental in getting the president to order the FBI investigation into sexual misconduct allegations\nAgainst Kavanaugh a conservation vote on the nomination is expected by Saturday\nHe was defense secretary Jim Mattis says the ... states is ready to help NATO allies fend off cyber attacks by Russia's intelligence services speaking in Brussels Madison the G R U and other Russian agencies\nMaine Republican Susan Collins is among the undecided sellers retiring Senator Jeff flake a frequent Trump critic who was instrumental in getting the president to order the FBI investigation into sexual misconduct allegations against Kavanaugh a conservation vote on the nomination is expected by Saturday\nHe was defense secretary Jim Mattis says the ... states is ready to help NATO allies fend off cyber attacks by Russia's intelligence services speaking in Brussels Madison the G R U and other Russian agencies must be held accountable\nDespite denials from the Kremlin the international community clearly sees the reality in the United states in shoulder to shoulder with our Dutch and British and all NATO allies\nMan is called the attack on the international chemical weapons watchdog reckless irresponsible and not surprising that same lab was conducting tests to determine if a deadly nerve agent was used poison a former Russian spy and his daughter in England\nAnd upcoming summit in Canada aimed at saving the world Trade Organization will be notable because of the absence of one country ... reports that the United states was not invited\nWashington has been left off the guest list for the two day summit because the WTO is one of the organizations derided by president Donald Trump Canada's international trade diversification minister Jim cars says ministers from Thirteen like minded countries will attend and he says the hope is to ultimately persuade Washington of the continued value of the WTO\nBut the Trump Administration has gone beyond rhetoric in its disdain for the Trade Organization and even blocked appointments of a new judges do its dispute settlement body cars says modernizing the world body is the best way to reestablish of rules based system something that would be more difficult if I Do I have not preserve the dispute resolution mechanism\nIn the new free trade agreement for NPR News I'm Dan ... in Toronto you're listening to NPR News\nThe Pentagon is exploring the possibility of deploying insects to offer plants genes to make them more resilient\nAnd to protect the nation's food supply and opinion piece in the journal science suggests more study is needed since other countries may view the project is a potential biological weapon\nMilitary Research Agency says the state department has been briefed to ensure that the work does not violate international treaties State Department says the project is for peaceful purposes while the agriculture department says it's being conducted in control laps [noise]\nTo the south Carolina police officers wounded in a standoff outside the home in Florence when they are out of the hospital South Carolina Public Radio's ... ... reports that the city's police department this morning an officer who was killed in the incident\nAt a press conference Lawrence police chief Alan Hi were had only praise for sergeant tyrants Carol way a thirty year veteran of the force killed by a gunman in an attack which entered six other officers at a person in the gunman's residents hydro described Carol way as a standup police officer\nHe was the epitome of a community police officer you love this community you gave it as all with\nMore than Thirty years he didn't have to do this job but this was his life and this is what you want to do\n... was a giant of a man but the proverbial gentle giant and I loved him for NPR News I'm touch Underwood in Columbia South Carolina\nOn stock markets in Asia shares are mixed up one percent in Shanghai following down day on Wall street the NASDAQ Composite index fell a hundred and forty five points I'm shades Stevens NPR\nNews in Washington\nSupport for NPR comes from green wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen program to massages including warning night and stretch sessions retailers nationwide\nGiant and I loved him re NPR News I'm touch Underwood in Columbia South Carolina\nOn stock markets in Asia fears are mixed up one percent in Shanghai falling down day on Wall street than anti composite index down the hundred and forty five points ... NPR News in Washington\nSupport for NPR comes from green wave maker of luxury massage chairs from Japan which she got to point detection and sixteen program to massages including morning night and stretch bashing retailers nationwide more ... chair dot com and the ... foundation\nFascinating recording here as Beethoven you just talked left a number of sketches for a symphony now be open lots of sketches for a lot of things and they're very very difficult to decipher\nBut he's one time secretary ... published an article claiming that he had made a number of sketches for the temp Stephanie these were found and they realized completed by Dr Barry Cooper\nInto a single movement didn't so that's going to hear right now a realization of sketches from Beethoven's tense symphony\nAnd this is the London symphony orchestra conducted by when more [noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n[noise] [noise] well [noise] [noise]\nWell uh\n[noise] uh well\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] Mm [noise]\nWell [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\nWell\n\n\n\nMm [noise]\n...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDear erase the of rats from the requiem by Mozart that was ... called Hmong conducting the Amsterdam Pearl orchestra and the boss society of metal ones\nOoh\n[noise]\n\n\n\nTime when women were found [noise]\nAnd then when we were able to do in the middle\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nMm\n[noise]\n\n\n[noise]\n\n...\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise] [noise] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\nThat\n[noise] [noise]\n\nIn the\n[noise]\n\n\nThe\n\n\n...\n... ...\n... ...\n\n\n\n\n\n\n[noise] and [noise] then\nAnd then\nAnd\n\nMm [noise] [noise] when\n\n\n\nCome in and many many many many many\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRetired U.S Supreme court Justice John Paul Stevens says he's changed his mind about Brett Kavanaugh's nomination to the high court NPR's Nina Totenberg reports that Stevens made his comments and an event hosted by retirees in Boca Raton Florida\nStevens who retired from the Supreme Court in twenty ten at age Ninety noted that he had previously held Kavanaugh in high regard but he went on to say quote I've changed my views for reasons that have no relationship to his intellectual ability I feel his performance in the hearings ultimately changed my mind\nA lifelong Republican Stevens was appointed by President Ford but his votes reviewed as more liberal overtime in comparison to the increasingly conservative Supreme Court majority Nina Totenberg NPR News Washington\nJudge Brett Kavanaugh acknowledges in the wall Street Journal op ed piece that his tone at a Senate hearing last week was striking but he says it's because he forcefully and passionately denied sexual misconduct allegations against him a five day supplemental FBI investigation turned up no evidence to back up the accusations\nA hundred senators and a handful of aids have a chance to review the report before an initial vote on the nomination friday morning\nPresident Trump was back on the road Thursday telling a political rally in Rochester, Minnesota that life in America today is good and getting better\nJobs [noise] wages arise\nOf Americans working\nNow today has reached an\nTime high in our history [noise]\nTrump also told the crowd and economic games will be reversed in government regulations will increase if voters chose Democrats over Republicans in next month's elections the president also said that rage over Supreme Court nominee Brett Kavanaugh will boost GOP turnout\nBut your attorney general's office as President Trump's charitable foundation repeatedly violated state and federal laws NPR's Jim Zarroli reports at the state filed papers Thursday asking a judge to let a lawsuit against the foundation proceed\nAttorney general Barbara Underwood sued the Trump Foundation in June the suit said the foundation had soliciting money from donors and then used it for campaign purposes and legal claims against Trump's company among other things\nIn August the foundation ask the court to dismiss the suit saying it was motivated by politics in her response Underwood argued that the foundation was missed stating the claims against it and ask them to suit be allowed to continue\nShe said the Trump Foundation was a show corporation that functioned as a checkbook from which Trump's businesses made payments Jim Zarroli NPR News New York\nStock markets in Asia shares are mixed up one percent in Shanghai following him down day on Wall street you're listening to NPR News\nChicago jury has begun deliberating the fate of a white police officer who fatally shot a black teenager four years ago a video of the incident was a key part of closing arguments in the case defense attorneys say officer Jason Van Dyke killed the quantum McDonald because he felt threatened when the teenager refused to drop the knife\nProsecutors say the video shows McDonnell was being shot sixteen times while walking away\nA French rescue team is lost hope of finding life beneath the rubble of a hotel on Indonesia's ... ways the island sensors detected like their Thursday but rescuers got no response friday morning\nThe disaster claimed more than fourteen hundred lives and displaced tens of thousands others a week later the BBC's Murray go oil report that power has been restored and some shops are open again\nHearing the holiday we ask saying God electricity back up last night falls right than we did have said that he could take weeks\nSixteen times for walking away the French rescue team is lost hope of finding life beneath the rubble of the hotel and Indonesia ... the island sensors detected like the Thursday but rescuers got no response friday morning\nThe disaster claimed more than fourteen hundred lines and displaced tens of thousands now there's a week later the BBC's where we go we report that power has been restored and some shops are open again\nHearing the holiday we actually got like ... last night that I mean we had said that he could take them we think we still with any Penn State and when we have we been talking about\nHow divided slick struggling to get hold of them at all week and we are starting to think like a lot of them on the faith people and so I think is selling it on the state as well at the same time that you know to find they can find the link\nAnd said the recovery at forty\nThe BBC's Marie ... boy reporting from pundits Indonesia an earthquake shook parts of northern Japan who ... no injuries were damage reported Japan's meteorological agencies heads with an aftershock the quake that federal landslide some damage to power plant in the same area last month [noise]\nThis is NPR News in Washington support\nFor NPR comes from the Jack kente cook foundation providing scholarships throughout the nation to exceptionally higher cheating students with financial need for middle school to college more information about coke scholarships is available at J. K. C. S. dot org and Americans for the arts\n\nWe're going to listen right now to a a song cycle by Gustav Mahler the voice part is performed on the base trombone these are the leader I just found in the ... or ... therefore songs at all\nDonald ... plays trombone and direct woods the piano\n[noise] [noise] [noise] [noise]\n\nUh\n...\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nUh ...\n[noise]\n\n[noise] [noise] ah\nI'm a\n\nMom now\n[noise]\n\n\nNa na\n[noise]\nLittle uh\n\n\n[noise] [noise]\nPerforming the voice part of the big Trump bone was Donald now which ... which is the sound we heard the songs of a waste or the ... I decided to get done by ... mother in Nineteen oh by his mother ...\n[noise]\n\n[noise]\nPerforming the voice part of the biggest trombone was doubled now which ... we heard the songs of a waste or lead to a ... by Gustav Mahler\nIn Nineteen oh five Mahler went into the light seek studios O M belt\nOn during the makers of ... rules for the same as the built in your own system and recorded the number of his own channel pieces were going to hear\nA screw ups shuttle goals really him but to just about as close as we can get plenty in the first movement up his symphony number five this was arranged by auto singer from the ... mother made his own additions and corrections to it so Mahler playing bottlers here\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAs long as the model for a while a law about a\n\n... boy close [noise]\n[noise]\n\n\nI don't know because people [noise]\nPeople who would ask you what [noise]\nWhat do you want on\nAll\nCambridge Singers conducted by John Rocker and that famous magical by John Will be Florida gave me Ferris flowers\n\nAnd the Taliban for a little work at ... in B flat major [noise] and we have a performance by ... or ... of colorful\n[noise] [noise]\n\n\n\nRichard cap unfilled ammonia virtual see what that music by ... from his sweetened gee major a dance called ... into\nThe human county library is hosting small business workshops presented by Andrew zoom in each week there'll be featuring buying your customer it will be tomorrow afternoon from three to five at the human main library twenty nine fifty one south Lenny Bruce drive you can find further details are you my library don't or\nA service about France in a western college for more than forty five years this is K. A. W. see humor K. A. W. P. Parker eighty eight point nine at them and K. A. W. the dot org trusted news for Yuma and the ... counties it's eleven o'clock I'm Anthony ... is\nClear tonight in ... with the low around sixty to eighty southwest window five to ten miles per hour sunny skies but the high and you're eighty nine tomorrow but the column southwest breeze tonight in you might clear skies but the low around sixty eight west wind up ten miles per hour tomorrow sunny skies but the high end you're eighty seven and a northwest window of five to ten miles per hour\nIn observance of Hispanic heritage month the St Louis\nEight point nine at them and take a W dot org trusted news for you ... and the ... counties it's eleven o'clock I'm Anthony ... clear tonight\nIn ... with the low around sixty two a southwest window five to ten miles per hour sunny skies but the high and you're eighty nine tomorrow with a column southwest breeze tonight in Yuma clear skies but the low around sixty eight west wind up ten miles per hour tomorrow sunny skies but the high and you're eighty seven and a northwest window of five to ten miles per hour\nIn observance of Hispanic heritage month assemblies library will host or fifth annual submission featuring the art work of art is it continues through October fifth assemblies branch library and Seventy five six seven you you can find further details that human library dot org [noise]\nLive from NPR News in Washington ... Stevens as protesters gathered outside Senate office in Supreme Court buildings Thursday US Senators took turns reviewing an FBI report on sexual misconduct claims against Supreme Court nominee Brett Kavanaugh Virginia democratic Senator Tim Kaine calls the process of sham\nThey're letting senators come in for an hour long walk guess what there's not a hundred hours between when they made it available in eight AM and when they want to do the ... south\nCarolina Republican Lindsey Graham suggests it's time to move on\nSenators who requested the\nThe full you ascended votes friday on whether to end debate on the cabinet nominations and proceed to a confirmation vote by Saturday the child that minister ration has unveiled a new strategy for combating terrorism NPR's Scott Horsley reports it's the first major rewrite of the plan in seven years\nOf angles for beefed up border security a culture of preparedness and international cooperation to fight with the White House says is an increasingly complex and diffused terrorists threats to\nNational security adviser John Bolton who oversaw the planning process says one big change from the previous blueprint as the focus on what he calls a radical Islamic ideology\nGets a long bend the president's view that without recognizing that we're in an ideological struggle that we can't properly addressed the terrorist threat\nSupplant also addresses homegrown terrorism and the process by which people already living in the U.S can become dangerously radicalized Scott Horsley NPR News the White House\nTop Russian diplomat warns us allegations of cybercrime just by the Russian intelligence agency could escalate tensions between the two nations\nThe Justice Department is charge seven Russian military intelligence officers with hacking anti doping agency's and other organizations the indictment says Russia's military intelligence targeted supporters of a ban on Russian athletes\nDays after a settlement with the securities and Exchange Commission former Tesla charity lawn must mocked the agency on Twitter as NPR's Emily ... reports that's how most landed in trouble with them in the first place\nAnd a tweet sent yesterday afternoon mosque called the agency the short seller enrichment commission\nThe SPCA accused mosque securities fraud in September after he tweeted he secured funding to take Tesla private\nAs far as the SEC is concerned you can't say that if you don't actually have the money in a lawsuit they called the statements false in a misleading and asked him to step down Tesla chairman mouse ... called the lawsuit unjustified but in a settlement agreed to resign he will still be CEO\nSettlement also required tests Latin Mass to pay twenty million dollars in fines each and for Tesla to play stricter oversight and mosques communications Emily Sullivan NPR News from Washington ears listening to NPR\nTo take a Tesla private as far as the SEC is concerned you can't say that if you don't actually have money in a lawsuit they called the statements false and misleading and asked him to step down Tesla chairman mouse ... called the lawsuit unjustified but in a settlement agreed to resign he will still be CEO\nSettlement also requires Tesla masks to pay twenty million dollars in fines each and for Tesla to play stricter oversight and mosques communication Emily Sullivan NPR News\nFrom Washington ears listening to NPR News\nFormer rap mogul Mary and shook night has received a twenty eight year prison sentence for killing of Southern California businessman but this car David Wagner from member station KP cc was in the courtroom\nThe former C. E. O. of death row records ran down fifty five year old ... Carter with his truck in twenty Fifteen night originally said it was out of self defense but now he's pleaded no contest to a charge a voluntary manslaughter the victim's relatives wept in the courtroom at they described how the incident has affected them\nAfter the sentencing daughter ... Carter said she's relieved nights case is finally over\nHe showed no remorse matter of fact he made himself to death over and over again\nNext sentence is part of a plea deal to drop to other cases one involving robbery and another ... which night allegedly threatened the F Gary Gray the director of the twenty Fifteen film straight out accounted for NPR News I'm David Wagner in Los Angeles\nThe Mormon church is joining Utah lawmaker is the governor and others in supporting compromise legislation to legalize medical marijuana the deal follows months of debate head of the November ballot initiative on whether to allow marijuana use for certain patients\nGovernor Gary Herbert says he'll call the special legislative session after the midterm elections to enact the compromise regardless of how the ballot initiative turns out\nOn stock markets in Asia shares are mostly lower amid concerns about rising interest rates and after vice president Mike Pence accused China of meddling in the upcoming us mid term elections ... Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the state of job be crock who's request serves as an during an investment in the future of public radio and seeks to help NPR producer programming that means the highest standards of public service in journalism and cultural expression\n[noise] this is the second to the to cello so not has bought you'll hummus Brahms is open Ninety nine and F major and George ... book is the ... ... is the cellist\n\nThen\n\n[noise]\n[noise]\n\nNa na\n\n[noise] [noise]\n\n...\nMm\n[laughter]\n[laughter]\n\n\n... people\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJerry junk in the Dallas when symphony performed at Gallup which ends a little sweet for banned by Serbian observance of spending ... months\nJerry junk I'm In the Dallas when symphony performed at Gallup which ends a little sweet for banned by Serbian\nObservance of Hispanic heritage month to families library will host or fifth annual our expedition featuring the art work of local or is it continues through October fifteenth assemblies branch library and Seventy five north sixth avenue you can find further details that you my library dot org\n\nBroadcasting from the Robert Hardy radio studio complex on the campus of Arizona western college for more than forty five years this is Kate WC ... W ... eighty eight point nine of them in case a WC dot org it's twelve midnight stay tuned for more NPR headlines and classical music\nSunny skies in the forecast for human today a high ... eighty seven was in northwest window five to ten miles per hour clear skies in the evening with the low around sixty eight and a column northwest breeze and Parker sunny skies with a high and you're eighty nine today a calm southwest breach today in the evening mostly clear skies low around sixty two what's it called west northwest\nBreeze do you make county library will be hosting a live performance of the territorial chapter of the Arizona ... association there will be next Tuesday October nine from three to five at the main library which is located at twenty nine fifty oneself twenty first striving Yuma it'd be like more information you can contact us at nine to wait three four seven\nLines from NPR News in Washington ... but he was Senate is poised to hold its first vote today on Supreme Court nominee Brett Kavanaugh three key Republicans still have not announced what they will do but NPR's Scott Detrow reports that one of few undecided Democrat says she'll vote no\nNorth Dakota Democrat Heidi Heitkamp is in a tight race for reelection and as one of the incumbent senators most in danger of losing a seat\nBecause you represent such a conservative state high camp was seen as a possible yes on Kavanaugh I Can't voted for justice Neil Gorsuch told North Dakota TV station WD a wide that she's not supporting this Trump nominee\nThe process has been bad um but at the end of the day you have to make a decision and I've made that decision\nAnd that decision will be what senator I Will be voting no one judge Kavanaugh that leads West Virginia Senator Joe Manchin as the lone undecided Democrat with everyone else in the party voting no Scott Detrow NPR News Washington\nAnd Wall Street journal opinion piece Brett Kavanaugh acknowledges that the tone of his remarks at last week's Senate hearing was harsh but\nHe says it's because he was forcefully and passionately denying sexual misconduct allegations Kevin ... says he remains an impartial judge\nBut then secretary Jim Mattis said the U.S is ready to help pay into ally stand on cyber attacks by Russia's intelligence services speaking and brushes masses Mattis said the G argue another Russian agencies must be held accountable\nDespite denials from the Kremlin international community clearly ... the reality in the United states in shoulder to shoulder with our Dutch and British and all NATO allies\nAnd it's called the attack on the international chemical weapons watchdog reckless irresponsible and not surprising that same lap was testing the poison used to attack a former Russian double agent and his daughter in England earlier this year Britain blames the attack on Russia which ... any involvement\nSaid the G argue and other Russian agencies must be held accountable\nDespite denials from the Kremlin international community clearly she's the reality in the United states and shoulder to shoulder with our Dutch and British and all NATO allies\nThat is called the attack on the international chemical weapons watchdog reckless irresponsible and not surprising that\nSame level as testing the poison used to attack a former Russian double agent that his daughter in England earlier this year\nBritain blames the attack on Russia which now has any involvement China's foreign ministry is accusing vice president Mike Pence of slander he's responding to remarks Pence made to a Washington think tank NPR's Scott Horsley reports that the vice president accuses China meddling in the U.S political process\nVice president Mike Pence told adds an Institute China wants to undermine President Trump has accused the Chinese government of using covert actors and propaganda to sway us public opinion before the November midterm elections as well as the presidential contest two years from now\nAs a senior career member of our intelligence community told me just this week what the Russians are doing pales in comparison to what China is doing across this country\nFences charge of election interference was part of a broader critique of Beijing's growing power and assertiveness and says even a strange and has responded with terrorists investment limits and the build up of the U.S military that were NPR News the White House on stock\nMarkets in Asia shares are mixed higher in Shanghai you're listening to NPR News\nNew York's attorney general Barbara Underwood says her office can make a strong case that the Trump Foundation violated state and federal laws Underwood sued the foundation in June but a new court filing alleges the organization was a shell corporation that misused charitable donations\nTrump's attorney said any rule violations were minor and that the suit is politically motivated they've asked a judge to dismiss the case\nNearly one week after an earthquake and tsunami in Indonesia the official death toll from the disaster has risen again to more than Fifteen hundred but NPR's Lauren Frayer reports and thousands more are still missing\nThe death toll is mostly in Hollywood city of more than a third of a million people it as a barely functioning airport where relief supplies are trickling in food clean water mosquito nets fuel and camping gear because tens of thousands of homes have been destroyed damaged or cut off\nBut outside the city limits huge areas have yet to receive any ate it all dozens of people have been arrested for looting things like fuel and farm equipment which they might use to clear landslides collapsed buildings and rescue loved ones\nMost landlines and Internet or down Australia is among those sending a plane load of supplies and dozens of doctors Lauren Frayer NPR News Jakarta\nFirst lady and millennia Trump is in Kenya visiting a national park in Nairobi to learn what's being done to preserve elephants and rhinos Mrs Trump is also scheduled to go on a brief safari then visit an orphanage and see a children's performance on a national theatre Egypt is scheduled to be the final stop for Africa trip\nOn shape Stevens NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic drugs including St Pete's Dali museum pitcher who collection and the museum of fine arts more er visits saint Pete Clearwater dot com\n\n... speaking when I hear some music inspired by almost ... Greenberg or strings Betty in a a little while somebody in the U.S and toward owning the composers but we have right now\nFor NPR Beijing other contributors include busy St Petersburg Clearwater along Florida's Gulf Coast offering artistic dramas including St Pete's Dali museum which are who we collection and the theme of fine arts more busy St Pete Clearwater dot com\n\n... speaking when you hear some music inspired by almost ... or strength Betty\nHim out a little while to ... and ... ... but we have right now the wind diverge mental by Mozart turned about sixteen ... two eighty nine and this is the ... the quintet for\n... ... ... ... ...\n\n\n[noise]\n\n\n\n\n[noise] no no no [laughter] [noise] [noise] [laughter]\nI don't know that [laughter]\n[noise]\n[noise]\n[noise]\n\n\n...\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\nMm\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nSome music by Mozart a wind diverted mental as we heard the numbers sixteen Kate to eighty nine performed by the da Vinci quintet\n\nNever going to go to some music by ... the U.S but before we hear something from incidental music for a play by ... string Berg here is a little piece called the bells with general Ricci ...\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] who general ... Sylvia Robin piano and some music there by the baby is the fourth of four pieces opus one Fifteen from Nineteen twenty nine that's called the bell\n\nWe have a couple of pieces here now which were inspired by written for productions of I'll boost string burglar student better use plays were going to begin with one called swan white\nNow this was first performed in Nineteen hundred but then this was a revival in Nineteen oh six\nIn Helsinki that the music was composed by chance of being the it's the place called ... white dude from it we hear the prince alone\n\nWe have a couple of pieces here no which were inspired by Britain spore production of ... ... ... it's going to begin with one cold one white\nNow this was first performed in Nineteen hundred but then this was born a revival in Nineteen oh six\nIn Helsinki that the music was composed by jumps will be the place called one white from it we hear the prince although the Iceland sympathy conducted by petri suck on [noise]\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\nOh oh\nOh oh oh\n\n\n\nOw ow ow\nOw\nOw Mm\n\n\nOr [noise]\nMm\n\n\n[noise]\n\n[noise]\n\n[noise]\n\nA setting of a Serbian folk song by a Swedish composer I'm not sure how that came about ... made the arrangement of the judgment and that was talking about on his all the fun of her mental soprano bank forced Betty was the pianist\nHe WC Madrigal men's and women's soccer teams will be having a home double header against Phoenix College which will take place tomorrow with the men kicking up at four thirty in the woman beginning at seven it'll take place that they will be the soccer field on the east side of the campus behind the gym you can find further details at ...\nDot com it's one o'clock and we hope you'll stick around for another hour of classical music overnight with Peter banned the graph\nA surface of our butts on the western college for more than forty five years this is Kate ... humor K. A. W. P. Parker eighty eight point nine FM and K. A. W. C. dot org trusted news for humor and the ... counties\nIn Parker today's sunny skies this Friday with a high and you're eighty nine come southwest breeze\nTonight mostly clear skies what's a low around sixty two and a column west northwest breeze in human sunny skies today a high near eighty seven with the north west window five to ten miles per hour tonight clears guys with the low around sixty eight and a column northwest when\nThe city of ... force and you'll you ... with tabletop games panels and more it will lead to more from eleven to seven PM at the human civic center if you'd like more information you can contact us a nine to wait three or four seven six nine zero\n\nLive from NPR News in Washington unchanged even some of US Senators are still we're doing a report on the FBI supplemental probe into claims of past the sexual misconduct by Supreme Court nominee Brett Kavanaugh a handful remain undecided although the initial vote on the nomination is set for today\nRetired U.S Supreme court judge John Paul Stevens says he no longer believe the judge Kavanaugh should be confirmed NPR's Nina Totenberg reports that Steven sites Kevin ... performance and a Senate hearing last week\nStevens who has praised Kevin ... in the past said he had changed his view on confirmation not because of any question about Kavanaugh's intellectual ability but because of his performance last week accusing Democrats and liberal groups of a partisan plot on behalf of the Clintons to destroy his nomination\nThose comments Steven suggests it would force Kevin to recuse himself from many cases before the court in the future\nFor the good of the court [noise] and it's not that healthy they get a new justice you know only a ... a part time job\nNina Totenberg NPR News Washington\nPresident Trump told a rally in Rochester, Minnesota last night than anti Kavanaugh sentiment will boost Republican turnout in the November midterms Trump says another factor will be the strongest economy\nJobs dot com [noise] wages are rising\nOf Americans working\nNow today\nReached an all time high\nThe healthy they get a new justice you know only a new ... apart and\nNina Totenberg NPR News Washington\nPresident Trump told a rally in Rochester, Minnesota last night than anti Kavanaugh sentiment will boost Republican turnout in the November midterms Trump says another factor will be the strong economy\n[noise] jobs [noise] wages are rising\nOf Americans working right now today\nIt's reached an all time high in our history [noise]\nI'm a gains and deregulation will be reversed if voters chose Democrats over Republicans next month\nHe was nuclear energy company Westinghouse says it was not compromised by Russian hackers as NPR's Geoff Brumfiel reports the Justice Department names Westinghouse as one of a number of targets attacked by Russian military intelligence agents\nWestinghouse makes nuclear reactors and fuel for those reactors it's recently been supplying that fuel to Ukraine and that appears to be why Russian hackers targeted the company\nAccording to a federal indictment released earlier today back in twenty fourteen in twenty Fifteen the hackers use spoof to emails and fake Web sites to try and steal logging details from Westinghouse employees\nSeveral employees clicked militias links but a spokesperson says the company security was never breached the indictment also claims hackers targeted numerous other organizations including a chemical weapons watchdog and the world anti Doping Agency Geoff Brumfiel NPR News Washington\nArizona based meat processor GPS told us in his brief calling more than six and a half\nMillion pounds of beef that could be contaminated with salmonella at least fifty seven illnesses and sixteen states have been linked to roll beef package between July twenty six and September seventh and shipped to retailers nationwide this NPR\nDuring deliberations resume today and the murder trial of the white Chicago police officer who fatally shot a black teenager forty years ago\nA video of the incident was a key part of yesterday's closing arguments defense attorneys say officer Jason Van Dyke killed Laquan McDonald because he felt threatened when the teen refused to drop the knife prosecutors say a video shows McDonald being shot sixteen times while walking away\nThe newspaper company trunk is shedding its futuristic name and NPR's David Folkenflik reports the company is returning to the name Tribune Publishing next week\nOver it's two years as trunk the company faced a series of crises at the Los Angeles times the editor in chief departed after newsroom insurrection the papers publisher was shifted to a corporate job after NPR reported paid settlements of to pass sexual harassment lawsuits against him and the new staff overwhelmingly voted to unionize\nTrunk sold the LA Times and response newsrooms at the Chicago Tribune into Virginia papers also join union NPR's reporting led to the ouster of the top news executive of the New York daily news for sexual harassment too and the company laid off half of that tabloids newsroom\nIn addition trunks controlling owner Michael Thoreau was also accused of sexual harassment executives did not say what led to drunks rebranding report suggests possible buyers are circling David Folkenflik NPR News\nTravelers in New Zealand can be fined the equivalent of thirty two hundred US dollars for fusing to unlock electronic devices for examination by customs officials the law which took effect October first also gives authorities the right to copy data found on ... devices they search\nThis is NPR News\nFor NPR comments from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs\nPossible buyers are circling David Folkenflik NPR News\nTraveling to New Zealand can be fined the equivalent of thirty two hundred US dollars for fusing to unlock electronic devices for examination by customs officials the law which took effect October first also gives the authority to write to copy data found on the ... device as they search this is NPR News\nSupport for NPR comes from NPR stations or their contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews the local pros and book appointments online at ... dot com\n\nAnd Peter ... later I'm going to listen to some music from two different operas by Engelberg home predict yes Hansel and Gretel but also Kearney ... but\nRight that we have a concerto by bill ... book for flute and orchestrating arena Fisher plays flute when was the ... of cologne directed by Reinhardt global\n[noise]\n\n\n\nClue concerto indeed by bill helping Friedman bok the eldest son of Johann Sebastian Bach with arena Fisher ... that was the ... of cologne Reinhardt ... the director\nBefore we move on to music by ... to his greatest offers we have a bit more for the ... valley despite Johann Sebastian Bach has we excerpt\nFrom the corral the collection Donetsk coffee are your goals and this is ... he's a Christian priest be tall Jesus Christ which Christopher ... at the Oregon [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\nAnd\n\nAnd\n\n... ... [noise]\n\n\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n\n\n[noise]\nUh [noise]\n[noise] [noise]\n\n\n\nOh [noise]\n\nDecreased central baritone held would do each piano at a song by every ... corn gold coal dust I did ... little brook that reasonable man\nIn observance of Hispanic heritage month the St Louis library will host or fifth annual our mission featuring the art work of local parties it continues through October fifteenth assemblies branch library ten Seventy five north sixth avenue you can find further details that you might library dot org\nClassical music overnight with Peter Van to grapple continue in just a moment here on eighty eight point nine ... K. A. W. see humor K. A. W. P. Parker and K. A. W. A. C. dot org surface about ... percent of western college for more than forty five years trusted news for humor and the ... counties\nIt's two o'clock\nSunny skies in the forecast for humid today a high near eighty seven within northwest wind up five to ten miles per hour\nClear skies in the evening with the low around sixty eight and a column northwest breeze in Parker sunny skies with the heightened you're eighty nine today a calm southwest breeze today in the evening most declares guys the low around sixty two what's it called west northwest breeze\nHuman county library will be hosting a live performance of the territorial chapter of the Arizona all time favorites association it'll be next Tuesday October night from three to five at the main library which is located at twenty nine fifty one cell twenty first striving Yuma it'd be like more information you can contact us at ... ... for seven six nine zero\n\nLive from NPR News in Washington I'm Dave ... later this morning the Senate holds a procedural vote on Brett Kavanaugh's nomination to the U.S Supreme Court\nSenators will decide whether to bring debate to a close setting up a confirmation vote tomorrow Republicans hold a fifty one forty nine majority in the Senate a handful of GOP senators are considered key to Kavanaugh being confirmed Susan Collins of Maine Lisa Murkowski of Alaska and there was known as Jeff Flake\nOfficially none has said how they will vote\nSenate Democrats opposed the cabin all have been critical of an FBI and\n... later this morning the Senate holds a procedural vote on Brett Kavanaugh's nomination to the U.S Supreme Court\nSenators will decide whether to bring debate to a close setting up a confirmation vote tomorrow Republicans hold a fifty one forty nine majority in the Senate\nA handful of GOP senators are considered key to Kevin all being confirmed Susan Collins of Maine Lisa Murkowski of Alaska and Arizona's Jeff Flake officially none has said how they will vote\nSenate Democrats opposed to Kevin all have been critical of an FBI investigation into allegations of sexual assault and sexual misconduct against Kavanaugh dating\nBack to his time in high school and college they argue more witnesses should have been questioned the FBI interviewed ten people Republican leaders say it found no corroboration of the allegations against Kavanaugh made by Christine Blasey Ford and others\nCritics of cabin I'll have been protesting on Capitol Hill and in Hollywood [noise]\n\nDemonstrators marched along the Hollywood walk of fame with banners reading believe women in an op ed in the wall Street Journal cabin on defenses tone and demeanor it last week Senate Judiciary committee hearing Here's NPR's Kelsey Snell\nCabinet writes in an op ed published by the wall Street Journal that at time of his testimony regarding sexual assault allegations against him reflected frustration he says he was wrongly accused and his answers reflected his deep gets draft said what he described as an unfair process\nCannot write to the judge must be a quote neutral and impartial arbiters who favored no political party he said he reviews the constitution and if confirmed would keep an open mind in every case\nSome Democrats say his performance went part attained and should disqualify in the Senate is that for a procedural vote on his nomination on friday Kelsey Snell NPR News Washington\nEconomists are predicting a further decline in the U.S unemployment rate when September his numbers are released this morning by the Labor Department NPR's John Ydstie has more\nProtections for job growth in September are into one hundred and eighty thousand range less than the August gain but near the monthly average for the past year and it's widely expected the unemployment rate will take down a notch to three point eight percent\nIf it comes in at three point seven percent it would touch a low last reached half a century ago\nWith the U.S at or near full employment economists have been expecting wage growth to accelerate as employers compete for scarce workers\nThere'll be watching closely to see if September matches or exceeds the strong ten cents an hour increase in wages posted in August John Ydstie NPR News Washington\nWall Street futures are on the downside this morning this is NPR News from Washington the death toll in Indonesia now tops Fifteen hundred a week after a strong earthquake and tsunami the BBC's were Rico oh boy has the latest from Palo\nHearing the holiday we ask saying God backup last night off than we did I say that it can take what we think we do all hand\nIn hand has said and what we think about how surviving with companies get hold of them have all week but we are talking I think quite a lot of them on the table I saw I think just having it on the ... has while at the same time then they find they said why they have any length\nAnd covering his party\nAt the BBC it's a Rico oil reporting from Palo Indonesia the international Atomic Energy agency says it plans to test ocean water marine sediment and fish near Japan's Fukushima nuclear plant\nSo you didn't have we been talking about housing Vijay ... found any homeless and ... and we always talking to quite a lot of them on the famous people and talking just having it on the can down at the same time does not defined they invite the continuing and over the country\nAt the BBC is Marie go boy reporting from Palo Indonesia\nThe international Atomic Energy agency says it plans to test ocean water marine sediment and fish near Japan's Fukushima nuclear plant\nThe testing will begin next week and run for ten days\nThis will be the eighth round of testing since an earthquake and tsunami destroyed three nuclear reactors at the plant that occurred in March of two thousand eleven last month the plant's operators Tokyo electric power said much of the radioactive waste stored at the site needs further treatment before it can be released into the ocean\nIt's been a down day for stocks ahead of the latest us employment numbers stocks tend to debate lower in Japan and Hong Kong markets in China were closed for a national holiday yesterday Wall Street ended the day with losses the NASDAQ drop one point eight percent the Dow was off more than a half percent\nI've dated mattingley NPR News in Washington\nSupport for NPR comes from NPR's patient other contributors include the Joyce Foundation committed to advancing racial equity and economic mobility for the next generation and the great lakes region learn more at Joyce SBN dot org and the N E E Casey foundation\n\nSpanish music ordeal and specifically nocturnal Spanish music and even more specifically nocturnal Spanish music by ... would define as we first here a piano piece he wrote when he was just Twenty years old he was\nKnocked ... has recorded by ...\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\nMm\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\nAnd\n[noise]\nKnow\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n[noise] ...\n[noise]\n\nKnow and [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\nEnding with his famous springs ... that's a collection of songs without words the sixty to set by Felix Mendelssohn ... ...\nThere was an interesting item [noise]\nIf we go back to that sets and listen to the third of those songs without words it's a a funeral march which was arranged\nBy a physics mental trained you know ... and actually plead jury mental ... funeral as the Compton went past the very rich the draped coffin in the ... in the ...\nUsually reserved for loyalty what's this ceremony but he reads the actual funeral march or brain trauma that sort of sums up words by ... for mental funeral block bras come sort of budging stormed\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "show_name": "Music of the Masters", "year": "2018", "city": "Yuma", "day": "05"}