{"month": "10", "state": "AZ", "station": "KAWC", "content": "Doing K. A. W. sea and retired airs on highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty to seven at St Paul's cultural center for information visit K. A. W. C. dot org this have been made possible in part by a grant from Arizona humanities\nCagey WCW my son in the arts center sponsor the film series there's this ... or ... in Syria a film in Arabic with English subtitles it'll be this Thursday evening November first beginning at seven at the historic human theater which is located out to buy or sell the main street in downtown Yuma\nIs is eighty eight point nine F. M. K. A. WC Yuma cage W. P. Parker and K. E. W. dot org service of Arizona western college for more than forty five years trusted news for humor and the ... counties\nAn evening of classical music begins next it's eight o'clock\nSometimes I met in ... at a party\nOkay then what happened [laughter] and the colon makes intense eye contact and says now look and the semi colon hands you they're drinking plates\nAnd the colon makes intense I contacted says look and the semi colon hands you they're drinking plate so that they can gesture more freely\nAnd the period abruptly says wait on let's go you were married to play this week on way with words and Wednesday evening at seven on ... ...\nMostly clear in human this evening a Loeb around sixty three a north when around ten miles per hour that one will continue into tomorrow morning with sunny skies behind your eighty some gusts up to twenty five pounds per hour in Parker tonight clear skies Loeb around fifty eight breezy with the north when around Fifteen to twenty miles per hour tomorrow sunny with a high near Seventy degrees\n\nLive from NPR News in Washington I'm chased even the\nFirst funeral have been held for the victims of Saturday's mass shooting at a synagogue in Pittsburgh Amy Sisk of member station W E s a report on the service health for Jerry Rubin of votes hundreds\nOf people attended the funeral for the sixty six year old Pittsburgh doctor at the Jewish community center family and friends filtered in past police providing security during a service friend fall but it's one of them she knew Rabinowitz because they both attended the ... congregation tree of life in Pittsburgh ... neighbor had\nOur president of the synagogue wonderful age she even more of those high because Jerry Lewis never without at that time\nShe says Rabinowitz always arrived early for Saturday services and helped out where ever needed for NPR News I'm Amy Sisk in Pittsburgh\nOr White House press secretary says President Trump's visit to Pittsburgh was very humbling it very sad to ever Sanders telling reporters aboard air force one the Trump visited a local hospital where one of the first responders were being treated\nFirst lady Milan a daughter a bunker and son in law Jared Kushner joined the president congressional leaders of both parties declined to join the first family on the trip\nMeanwhile thousands of protesters took to the streets marching toward the tree of life synagogue and demanding that the trumps go home\nThe president wants to eliminate automatic citizenship for U.S born babies with undocumented residents of guaranteed by the fourteenth amendment during an interview with ... upcoming HBO series Trump floated the idea of doing so by executive order\nBut house Speaker Paul Ryan tells W. V. okay radio in Lexington, Kentucky that the president doesn't have that authority\nOr does it very clear is you can't change this executive at a at the very least it would have to be statutory through\nCongress Ryan knows that GOP lawmakers were not happy when former President Obama tried to change immigration law by executive order\nNotorious Boston gangster James Whitey Bolger is dead as Dave Mistich of West Virginia Public broadcasting reports Bolger was killed in a federal prison where he arrived on Monday\nUs zero prisons as Bolger was unresponsive at eight twenty in the morning Richard Holbrooke president of the American federation of government employees local for twenty ... an apparent homicide based on information from responding guards\nThe FBI was notified in an investigation has been initiated\nThe eighty nine year old had been transferred to the result in penitentiary near Morgantown West Virginia the day before his death he was serving a life sentence for racketeering money laundering possession of unregistered machine guns and other convictions the mob boss turned FBI informing has been sixteen years on the lam before police caught up with him in two thousand eleven\nFor NPR News I'm Dave message in Morgantown West Virginia\nFrom Washington You're listening to NPR News\nArmed forces chief says search crews may have located the fuselage from the hill\nIndonesian armed forces chief says search crews may have located\nThe fuselage from the ill fated lion air passenger jet the two month old bowling seven thirty seven crashed into the job of sea on Monday just minutes after take off from Jakarta killing all one hundred eighty nine people on board\nNASA's Kepler space telescope is being retired after running out of fuel as NPR's Nell Greenfieldboyce reports Kepler discovered thousands of planets during its nine year mission\nNASA's Kepler telescope stared at around a hundred and fifty thousand start watching for tips in brightness that meant a passing planet had blocked some star light\nAll in all Kepler detected more than two thousand six hundred planets lead scientist William ... says a favorite is Kepler twenty to be which is more than five hundred light years away\nIt's a planet and between the size of the earth and after unlike any planet in our solar system it's Atlanta may very well being a water world world cover wasn't ocean\nKepler showed that planets are common that many of the stars visible in the night sky are likely to have small planets with temperatures mild enough for liquid water and maybe even life Nell Greenfieldboyce NPR News I'm\nCurrently Davidson is recalling nearly one hundred Seventy thousand motorcycles in the U.S because of a clutch problem that can prevent the driver from switching gears\nHarley says it to wear a five crashes linked to the problem but no injuries the recall covers twenty six vehicles from two thousand Seventeen and Eighteen this is NPR News\nSupport for NPR comes from NPR stations or their contributors include the joys foundation\nCommitted to advancing racial equity and economic mobility for the next generation and the great lakes region learn more at Joyce SBN dot org and the ... foundation\nYou're attuned to K. AWAC eighty eight point nine FM and Katie WC dot org classical music begins next it said oh six\nThe education foundation of human county is accepting nominations for the ... education hall of fame nominations on several categories reflecting the many ways individuals and groups impact education in ... county the deadline for nominations as December seventh and can be made that tiny euro dot com slash human and hall of fame\n\nVictoria ... is our violinist or ruined listened to a set of variations by ... based on a tune which is often heard as the basis for variations not talking about twenty four so the violin Caprice put a piece by Giovanni ... from his opera ... to the tune is no quarter ...\nAnd as I say pocketing he scored this for ... violin\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nVictoria ... played the violin that music is by the great violinist or the nineteenth century Nicole ... is variations on a theme bike ... cold no quarter ... single\nThere's more Italian music on Tony Vivaldi wrote this a fluke concerto what has a subtitle attached to it because of its fiery in stormy character is known as locked him pet study ... the storm at sea Patrick ... with the ... the U.S chamber orchestra\n[noise]\n\n[noise]\n\nIt was pretty gentle is storms go but that is called the storm at sea locked him passed on the body by Antoni up of all the Patrick ... played the food with the ... the U.S chamber orchestra\nThanks for spending part of your evening with key AWAC eighty eight point nine FM ... dot org classical music continues in a moment\nDenise Cady WC day sponsors or bill and Marcia pike celebrating their return to you for the winter\nThey appreciate Cade WC for providing GOOD Music and news to our entire community villain Marcia encourage their fellow winter visitors to join them in supporting K. A. W. see as the pikes have done for more than Twenty years\nClear and breezy and Parker this evening and north wind around Fifteen to twenty miles per hour gusts up to thirty miles per hour I Love around fifty degrees tomorrow sunny skies with a high and you're Seventy eight and you this evening mostly clear Loeb around sixty three tomorrow Sundays guys with the heightened you're eighty some north when the ten to Fifteen miles per hour but gets up to twenty five\nAnother storm inspired piece this was a inspired us by storms but also by a concerto by composer pianist named Daniel ... of the nineteenth century who wrote a very popular concerto at the time it's rarely her do\nCold the storm and uh he had such a great success with that that his friend and competitor had a friendly competition going on John Field decided to write his own that storm concerto he called this last Sunday ... or the conflagration caused by lightning from the storm\nCould be loose translation of at the piano concerto number five by John Field\nAnd it is performed here by John O'Connor ... that's the new Irish chamber orchestra ... is the conductor more storm music here [noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] no no no no no no\nUm [noise]\n[noise]\n[noise] [noise]\n\nMm\n\n\n\n[noise]\nOh\n\n[noise]\n[noise]\nMm\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\nRunning a marathon is about being out there every day on the front lines from\nStaying on top of all the election news can be a challenge and all things considered helps you keep pace here the bigger picture every afternoon on all things considered from NPR News [noise]\nThe ... learning center is hosting an exhibit on she got so out of the few drinks you know an artist who say the least nobody's going to lose the ... is ongoing from now through November ninth Monday through Thursday from idioms and seven PM and Fridays from nine AM to three PM at the ... learning center which is located up one three four zero eighth avenue in San Luis\nBroadcasting from the Robert Hardy radio studio complex on the campus of Arizona western college for more than forty five years this is Katie WC Uma ... Parker eighty eight point nine FM and king AWAC dot org it's nine o'clock\n\nHi this is Kevin Kevin I'm One of your host on the street ... next time on the program flabby international sounds from human blues Davis will also be returning with another educational segment on the pioneers in innovators enshrined in the blues hall of fame that's all coming up next time on the street here\nThe evening at seven ... Eighteen twenty and\nMostly clear in human this evening a local around sixty three north when around ten miles per hour that one will continue into tomorrow morning with sunny skies hind you're eighty some gusts up to twenty five pounds per hour\nIn Parker tonight clear skies Loeb around fifty eight breezy what the north winter on Fifteen to twenty miles per hour tomorrow sunny but the high near Seventy eight degrees\nLive from NPR News in Washington ...\nPresident Trump and first lady millennia visited Pittsburgh today to honor the eleventh people killed in a mass shooting at the tree of life synagogue as NPR's Brian Mann reports the city's mayor declined to meet with Trump proves motorcade passed by angry protestors [noise]\nHundreds of people marched down the street rural hill neighborhood you're the tree of life synagogue many carrying signs opposing white supremacy some calling for gun control [noise]\nLisa fires didn't grow up here and one of the marchers and she said many people in Pittsburgh are conflicted about the president's visit because of his controversial rhetoric about immigrants and the ...\nYou know if he doesn't go out and you're going to be caught and take\nAnd I think that's going to hate on him for a\nVote on both of them died and um he's not welcoming Pittsburgh\nThe president's daughter and son in large Jewish while in the city Trump and his wife millennial laid stones and white flowers on the memorials have eleven people who died Brian Mann NPR News Pittsburgh\nThe president has expressing confidence that he can strip away the fourteenth amendment guaranteed that the U.S born babies I'm undocumented immigrants automatically become citizens in an interview with actually also named HBO Trump says he can issue an executive order\nWe're the only country in the world\nWhere a person comes in has a baby and the baby is essentially a citizen of the United states for eighty five years with all of those benefits ridiculous it's ridiculous and it has to end\nUnited States has one more than is one of more than thirty countries that offer birthright citizenship change in the U.S law requires an act of Congress\nMore than a thousand migrants in a second caravan are now in the southern Mexico after crossing the river from Guatemala diverse contingents of the group of skin arriving at an encampment in the city of chocolate Chula headache to the U. S.\nSearch and rescue crews have found no survivors from a lion air crash\nSkin arriving at an encampment in the city of chocolate Chula headed to the U. S.\nSearch and rescue crews have found no survivors from a lion air crash or Indonesia but believe they have located at the planes fuselage aviation authorities have ordered inspections of all Boeing seven thirty seven max aids like the one that plunged into the java sea with a hundred and eighty nine people aboard NPR's Julie McCarthy reports from manila\nLying areas under intense pressure to provide answers for family members of the victims of light six ten\nThere are questions about the technical state of the three month old plane mechanics reportedly had just six and a half hours to examine why the Boeing seven thirty seven max aid a sophisticated jetliner had taken steep dies as it uh send it on a flight from Bali to the Indonesian capital Jakarta\nThe night before the airlines CEO to the issue had been resolved\nDay to show the aircraft repeated the same unusual pattern the next morning before it crashed into the sea\nNPR's Julie McCarthy reporting from manila you're listening to NPR News\n\nNotorious mobsters turned informant James\nWhitey Bolger has been killed in a West Virginia present day after his transfer their for medical care lawyer who represented Bolger says the Federal Bureau of prisons is responsible for his former clients death\nAfter sixteen years on the run eighty nine year old Bolger was convicted for eleven murders and other crimes in August twenty Thirteen\nHe was serving two consecutive life terms for five years when he was killed [noise]\nFacebook is reporting profits but its overall picture has been mixed in the past three months NPR's Jasmine Garsd reports that security breaches and privacy scandals have undermined the company's efforts to pick up more users\nThe good news for Facebook is it still making money and the last three months more than Thirteen billion dollars for advertising the bad news is Facebook's new user growth has flat line in the U. S. and is declining in Europe\nThat might be due to ongoing privacy scandals just last month the company reported that an attack on its network expose the data up to fifty million users Facebook has been warning investors that strengthening user privacy is a priority that will cost money and slowed down revenue growth\nThe company's stock took a dead after the earnings report the den Hubbard back at around ... percent by market close Jasmine Garsd NPR News New York\nOn Asian stock market shares are mostly higher up around one and a half percent in Tokyo following gains on Wall street the Dow Jones industrial rose four hundred thirty one points I'm shape Stevens NPR News in Washington\nSupport for NPR comes from the Charles Stuart my foundation supporting efforts to promote adjust equitable and sustainable society in his hometown of Flint, Michigan and communities around the world more at ... dot org and that listeners who support this NPR station\n\nAmong the ... will be hearing a hub Beethoven's very first piano sonata and right now this music by auto ... which is an early worker feels he originally compose this for ... but he was such a great orchestrate or not we're going to hear it emits version for trouble with orchestra it's called a ... with variations slow with variations\nAnd a recording by the fill harmonious orchestra conductor here is Jeffrey Simon Alexander ... is a socialist [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise] a cellist was Alexander ... with the shelter ammonia orchestra conducted by Jeffrey Simon music by a young or do we know risky that's called the dodge ... variation\nWe were in ... no music ... boss\nI think one of his greatest compositions fantasy and few in C minor are bigger pardon ... if you can see fighter as orchestrated by ... who was one of the truly great orchestrate your music history this is the Seattle sympathy conducted by Gerard short a\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\nThe day\n[noise]\n\n\n\n\nMm Mm\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n... [noise]\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[laughter]\n\n[laughter]\n\n[noise]\n...\nMen\nVery little known French fertile composer their road OJ ... wrote that little piece called the jealousy and it was performed by the ensemble brigade all you\nSee is a part of your community every now and then we turn to the community for a little help our next on their pledge drive begins next week and we're looking for some volunteers to answer phones especially during MORNING EDITION you can call three or four Ford nine six nine zero to preserve a place or email ... K. A. W. C. dot org\nBroadcasting from the Robert E hearty radio studio complex on the campus of Arizona western college for more than forty five years just as Kay WC Yuma K. A. W. Peter Parker eighty eight point nine FM indicate AWAC dot org\nIt's ten o'clock\nClear and breezy and Parker this evening and north wind around Fifteen to twenty miles per hour gusts up to thirty miles per hour all over around fifty degrees tomorrow sunny skies with a high and you're Seventy eight and you this evening mostly clear Loeb around sixty three tomorrow sunny skies with the high end you're eighty some north when the ten to Fifteen miles per hour but it's got up to twenty five\n... county library is hosting small business workshops presented by Andrew Solomon this week there'll be featuring creating a profitable company it will be this Friday afternoon November seconds from three to five at the human mean library which is located at twenty nine fifty one south twenty first Dr you can find for the details are you my library dot org\n\nLive from NPR News in Washington state and President Trump visited Pittsburgh Tuesday to pay respects to victims of the mass shooting at a Senate ... NPR's Brakkton Booker reports that the president's visit ... mixed reaction\nPresident Trump visited the tree of life synagogue where he and the first lady play stones and flowers at a memorial\nAfter that they traveled to the University of Pittsburgh Medical center it was there that they met first responders injured in the shooting Cindy Kirk is both in nursing supervisor at the hospital in a Republican who sits on the Allegheny county council she was there during Trump's visit it meant\nA lot to our patient steady can just say and that's what made it nice\nTo visit wasn't all nice hundreds of protesters pack the city streets near the site of the shooting people held signs that read Jewish lives matter and no place for hate Brakkton Booker NPR News Pittsburgh\nVice president Joe Biden says he's fed up with the Trump Administration and what he's described as it's like all of moral leadership\nHoward former vice president Joe Biden says he's fed up with the Trump Administration and what he describes as it's like all of moral leadership at a campaign rally in Madison, Wisconsin Biden suggested that both political parties should tone down their rhetoric\nWas not who we are we need to recognize words matter words matter [noise]\nMy noted that in just one week alone the nation has seen three incidence of attacks on people because of their political beliefs religion or skin color he's touring Midwest states to campaign for Democrats running in places that Trump won and twenty sixteen [noise]\nBoston mobster James Whitey Bolger has been killed in a federal prison in West Virginia\nAs WBRC alley jar manning reports the eighty nine year old spent sixteen years on the run\nBefore lending behind bars five years ago\nFederal prison officials said Bolger was found unresponsive in itself around eight twenty in the morning he had just been transferred to the handle and maximum security prison the day before the FBI and us attorney's office in West Virginia or investigate him\nAnd my boss wrote you a different sort of power as a secret informant within the Boston FBI and for decades agents let him get away with murder and extortion\nThose same agents tipped him off to a pending indictment in Nineteen Ninety four and he went on the land here I mean one of the FBI's most wanted until later found hiding in plain sight in Santa Monica California with his girlfriend Bolger was sentenced to two consecutive life sentences and twenty Thirteen for NPR News I'm Elly Germany and Boston\nHundreds of migrants are in a second caravan moving through southern Mexico after crossing the river from Guatemala the first contingents with a group of arrived at any camping in the city of top of Chula a larger caravan of about four thousand asylum seekers from Honduras pass through the city ten days ago\nYou're listening to NPR News\nAmerican consumers appear optimistic about the current economy and its future outlook the conference board says it's consumer confidence index hit an Eighteen year high of a hundred and thirty seven point nine this month boosted by low unemployment meanwhile rising interest rates may be causing a weakening of home sales\nThe S. and P. corn logic Case Shiller twenty city home price index says games and us home values slowed in August for the fifth month in a row it increased five and a half percent in August down from five point nine percent gain in July\nA giant telescope is one step closer to being constructed on Hawaii's tallest mountain that state's Supreme Court ruled in favor of the project but as to why you Public Radio's Bill Dorman reports the controversy over the project is not over\nHawaii Supreme Court ruled in a four to one decision that the seat when board acted correctly wanted approved a construction permit for a massive telescope the one point four billion dollar project we'd put the largest telescope in the northern hemisphere on Hawaii Island\nThe device would be a top Mona care summit considered sacred by many native Hawaiian ... that's what led to years of protests from some native Hawaiian sand from some environmentalists\nSupporters say the project will deepen the islands involvement with leading edge science for NPR News I'm Bill Dorman informal looming\nOn stock markets in Asia shares are mostly higher up one point seven percent in Tokyo following games on Wall street on chase Stevens NPR News in Washington\nSupport for NPR comments from NPR's Beijing other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including ...\nFor NPR station other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum that you're who we collection and the museum of fine arts more busy St Pete Clearwater dot com\n\nYou believe or I'm going to listen to some of film score music by some great composers of traditional classical music but right now we have this week number two from these days ... with the Montreal symphony and ...\n...\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n... what\n\nBreached we'd have excerpts from the Nineteen forty five Alfred Hitchcock film called Spellbound for which ... Rosa wrote the music that was Cincinnati pops conducted by Eric ...\nHere's another prominent composer in the classical world writing a film score and this was Malcolm Arnold no Nineteen sixty one will be called which sold down the when the story of three children living on a remote Lancaster farm\nFind a stranger in the barn and they think is Jesus but it was really a criminal on the run from the police there was a sweet from we sold down the wind from Nineteen sixty one Malcolm Arnold London symphony conducted by Richard ...\n\n[noise]\n\n[noise]\n\n[noise] [noise] [laughter]\n[noise] [noise] [noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\nAh\n\n\nOh oh\n\nOh [noise]\nEvery folks Concord gold about Thirteen Years old when he wrote that song OB into lunch soft evening landscape over ... was the baritone cops\nCagey there'll be you see the humor sending the you my art center sponsor the film CDs Thursday at the theater the November film is in Syria a film in Arabic with English subtitles it will be this Thursday evening November first beginning at seven at the historic human theater which is located at to fight for self main street in downtown Yuma\nThis is eighty eight point nine FM cage WC Yuma K. E. W. P. Parker and K W C. dot org\nService of Arizona western college for more than forty five years we bring NPR News to the Colorado River communities of human ... counties it's eleven o'clock\nMostly clear in human this evening a Loeb around sixty three at north when around ten miles per hour that one will continue into tomorrow morning with sunny skies a high and you're eighty some gusts up to twenty five miles per hour in Parker tonight clear skies Loeb around fifty eight breezy with the north wind around Fifteen to twenty miles per hour tomorrow sunny but the high near Seventy eight degrees\nThe education foundation of human county is accepting nominations for the human county education hall of fame nominations our son several categories reflecting the many ways individuals and groups impact education in Yuma county the deadline for nominations as December seventh and can be made that tiny URL dot com slash you might add hall of fame\n\nLife from NPR News in Washington I'm shape Steven brothers the cylinder Rosenthal were you able to John in Pittsburgh today as having been a part of the fabric of the local Jewish community is W. I. T. S. Katie mired reports that men both mentally impaired ...\nHaving been a part of the fabric of the local Jewish community as W IDS Katie Meyer reports the men both mentally impaired were among eleven people killed in a weekend mass shooting at a synagogue as she wouldn't coffins were loaded into a hearse mourners crowded around again to\n\nYou and you feel like rabbi Jeffrey Maier on David were so efficient helping and set up\nAll he had to do is lead services different about gold in says it was seized those custom two legged thinker and tell people you better go to services\nWe're taking a cough and I've I gave him when he gives me all the time\nYou better go to services and that's what I'm going to remember of\nFamily and friends say David with quieter industry has worker fascinated by police well he was born politician who wanted to be involved with everything rabbi Myers thanked the brother parents for sharing them with the community services he said will be the same for NPR News I'm Katie ... in Pittsburgh\nPresident Trump is loaning the idea of ending US citizenship rights for babies born to non citizens in an interview with access on HBO Trump suggested he could do so by executive order but house Speaker Paul Ryan tells W. V. okay radio in Lexington, Kentucky the tropics misinformed\nWhat does it very clear is you can't change this via executive uh at the very least it would have to be statutory Congress\nRyan also knows that Republicans were not happy when former President Obama tried to change immigration law by executive order Robert Mueller's office has told the FBI about an alleged scheme to undermine the special counsel's credibility details from NPR's barb is brought to\nThe office of the special counsel says it has learned of allegations that a woman was offered money to make false sexual harassment claims against Robert Mueller\nShe contacted journalists including NPR to share details about the alleged offer NPR's currently pursuing confirmation including seeking comment from the spokesman of the special counsel's office Peter car in a statement car says the matter has been referred to investigators Barbara sprint NPR News Washington\nIndonesian search and rescue workers have detected a Seventy two foot long object in an area of the job of see we're alliant air passenger jet went down with a hundred and eighty nine people on board there were no survivors from Monday's crashed taking place just minutes after take off from Jakarta\nSpecial equipment is now being used to find the planes black box recorders which may help investigators\nDetermine what caused the mishaps\nOn stock markets in Asia shares are higher up around two percent in Tokyo following canes on Wall street you're listening to NPR News\nAir force general tyrants OSHA honesty says around a thousand us troops are already in Texas to help border patrol officers ... says the number will grow to at least Eighteen hundred by Wednesday\nMore than fifty two hundred troops are being sent to Texas Arizona and California as a caravan of Central American asylum seekers heads to the U.S border\nRussia says it plans to conduct missile drills in international waters off Norway next month as NPR's Frank Langfitt reports from Sean time NATO troops are holding their largest exercises sent the end of the Cold War in the same region\nSixty five ships Jordan's if the airplanes and fifty thousand personnel tried and jokes are Eighteen is a series of war games designed to protect Norway from an unnamed enemy that everybody presumes Russia or happy with the exercise is Russia plans to test missiles off the Norwegian coast this week in Stoltenberg NATO general secretary downplayed the action\nOn the ... the erosion\nYeah and Stoltenberg ghettos general secretary downplayed the action\nIs the one that's the difficult for them but the the Russian forces will behave in a responsible way and I said the\nYou also downplayed the rivalry which picked up steam after Russia annexed Crimea in two thousand and fourteen\nWe're not in the Cold War situation must be or exercising look the defense\nThe exercises wrap up next week Frank Langfitt NPR News drawn type Norway\nHarley Davidson says it's recalling nearly a hundred and Seventy thousand motorcycles in the U.S because of the clutch problem that can prevent drivers from switching gears hardly says to wear five ... linked to the problem but no injuries ... NPR News in Washington support\nFor NPR comes from NPR stations other contributors to include life lock lifelike with Norton works to help protect identities and the information on devices from cyber criminals learn more at life locked dot com and the ... foundation at ... dot org\n[noise]\nWe used to be us now by composer whose name sounds very French shores ... he was actually born in Moscow\nTo parents a French descent he was born in Eighteen sixty one encouraged by Tchaikovsky and tonight yeah if you studied with ...\nAnd we're going to listen to a Nineteen oh six composition by George ... which is his violin Saddam had number two it's subtitled a poem it's not a traditional sonata said one through composed movement almost more of a fantasy up\nHere are heavy sock violin and parents talk two brothers and parents plays the piano [noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nThey know\n\n\n\n\n[noise]\n\n\n\n[noise]\n...\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd\n\n\n\n\n[noise]\n\n\nConsidering the Europe composition of that work it's a very forward looking composition Nineteen oh six\n... bar sounds ... but actually Russian composer of French ... wrote that violin so not a number to ... to ... and ... and their talk two brothers ...\nCut you are a a contemporary of our next composer just four years older than ... under guns and all that when you're a little ceremony for orchestra by close enough with the Romanian state orchestra directed by ... school\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n... learning center is hosting an exhibit on Chicago a few drinks he not allowing artists within ... nobody's going to be made its own going from Melbourne November night Monday through Thursday from any empty seven PM and friday from nine AM to three PM at the ... learning center\nIs located up one three four zero eighth avenue in San Luis\n\nBroadcasting from the Robert Hardy radio studio complex on the campus of Arizona western college for more than forty five years this is Kay AWAC ... W ... eighty eight point nine ... a WC dot org it's twelve midnight stay tuned for more NPR headlines and classical music\nSunny skies and humid today hind you're eighty degrees a bit breezy out there with the north wind up ten to Fifteen miles per hour gets his highest Tony\nClassical music\nSunny skies and humid today hind you're eighty degrees a bit breezy out there with an earth wind up ten to Fifteen miles per hour Augusta's highest twenty five mostly clear this evening Loeb around fifty five\nIn Parker sunny skies with higher Seventy eight today breezy out there as well get some ties twenty five miles per hour mostly clearing the evening with the Loeb around fifty one\nThe ... county library is hosting small business workshops presented by Andrew Solomon this week there'll be featuring creating a profitable company you may be just right after new November second from three to five at the ... library which is located at twenty nine fifty one cell twenty first Dr you can find further details are you my library daughter will\nLive from NPR News in Washington I'm shades Stevens the Pittsburgh office of public safety has released the names of four police officers wounded and the deadly shooting at the tree of life Senegal up from member station WBUR hearsay lurking page Jacobs reports\nA gunman entered the synagogue just before ten am Saturday a police SWAT Team arrived on the scene about ten minutes later and immediately came under fire\nOfficer Timothy ... with multiple gunshot wounds remains in the hospital as the Daniel need with a gunshot wound to the hand officers Anthony Burke and Michael Snyder with less severe injuries had been released from the hospital in all the shooting killed eleven and wounded six for NPR News I'm Larkin page Jacobs in Pittsburgh\nPresident Trump is expressing confidence that he can strip away citizenship rights for U.S born babies up non citizens during an interview with Axios on HBO Trump said he could issue an executive order to end the fourteenth amendment guarantee\nWhen the only country in the world\nWhere a person comes in has a baby and the baby is essentially a citizen of the United states for eighty five years with all of those benefits ridiculous it's ridiculous that it has to end\nThe United states has one of more than thirty countries that offer birthright citizenship changing the U.S law requires an act of Congress\nA migrant caravan from El Salvador has reached the Guatemala Mexico border this groups crossing into Mexico is proceeding in an orderly fashion that's in contrast to a clash between Mexican police and mostly Honduran immigrants a few days ago Maria Martin has more\nSince four hundred Salvadoran migrant Smith on Tuesday with a Mexican town so into what am I on the border town of ... when I'm On a representative for the council till the migrants they would be allowed to enter Mexican territory but in a legal an orderly manner\nThe migrants were allowed in in groups of fifty to complete paperwork a shelter has been set up for them and the state of Chiapas as his report at the intake process may take us longest forty five days\nMexico's president at the beginning and hit them within the announced aids is this your whole program were by migrants would be allowed temporary work permits it remains to be seen how many will take advantage of the offer or choose to proceed to the U.S border we're a contingent of troops awaits them\nFor NPR News I'm Mark and\nThe FBI is investigating claims that someone offered to pay women to make full sexual misconduct claims against special counsel Robert Mueller\nAccording to a spokesman Mueller's office refer the matter to the FBI soon after hearing about the allegations that statement did not say what the claims were but suggest that Mueller's office believes the prime may have been committed\nMuller is leading an investigation into Russian interference in the two thousand sixteen presidential election his officers charged thirty two people so far including for former Trump\nAssociates who pleaded guilty this is NPR News\nArmed forces chief says search crews may have located the fuselage from an ill fated lion air passenger jet the two month old\nIndonesia's armed forces chief says search crews may have located the fuselage from an ill fated lion air passenger jet the two month old Boeing seven thirty seven crashed into the job of sea Monday just minutes after taking off from Jakarta killing all one hundred eighty nine people on board\nA new NPR Ipsos poll shows that just a year after the me too movement took off over forty percent of Americans thanks it's gone too far as NPR's Tovia Smith reports the survey also shows a deep partisan divide over the issue\nTwo thirds of those surveyed said to me too movement has created a climate where those accused of sexual misconduct will be held accountable but forty three percent think it's gone too far\nThat includes three quarters of Republicans and left them one quarter of Democrats the party divide is much wider than the gender gap on that question has on others like whether victims should be given the benefit of the doubt far more Democrats say yes and whether false accusations are common far more Republicans agree with that\nHow about a third of those surveyed suggests the movement has not yet gone far enough\nWomen and Democrats were most likely to believe the allegations of sexual harassment these days still get ignored Tovia Smith NPR News\nMobster turned informing James Whitey Bolger had been been killed in West Virginia prison a day after being transferred there for medical care after sixteen years on the run Bolger was convicted for eleven murders in two thousand Thirteen he was serving two consecutive light turns plus five years\n... Stevens NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor dot com\n[noise]\nHave you bought some chick composers I think are very worst hearing we're getting to know\nThe main work is going to be a quintet by ... we have first this piece from Mozart's time so it might be better set of bohemian composure you'll just missed leave a truck known as the divine bohemian in his day\nThis is the ... chamber orchestra without conductor and a ... in be by mislead truck [noise]\n\nPoodle performing music by ... stop Marcia and duct tape for glass harmonica\n\nAnother check composer that you might not be familiar with but I think is right we're getting to know\nNice round dates to ... near the beach is his name he was born in Eighteen fifty died in Nineteen hundred so contemporary out but to me to talk but I'd like to walk and smashing up for that matter CBP mostly look towards Germany as opposed to nationalism for his inspiration\nThis was a quintet for an unusual combination of instruments by Phoebe violin clarinet horn trouble in Seattle\nAnd we listen to the ... the most ...\n\n[noise]\n\n\n[noise]\nMm [noise] na na\nNa na na\nNa na na\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\nI'm going to be [noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n... [noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\nUm na\n\n\nNa na na na na\n[noise]\n\n\n[noise]\n\n\nI don't\nYou're going\nBe you\nWe're in\n... between\nIt just didn't want to do\nBang bang bang\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\nKnow they didn't have\n\n\nBangers and\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\nReally not [noise]\n[noise]\n\n\n\n\n\n\nOf them\nIn the mid ...\n\n\n\n\n[noise] [noise] [noise] mhm\n\nDay and then\n[noise] [laughter]\n\n\n\n\nMm\n\nAnd then you know you have\nTo\nDo it [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nThe hope is thirty two number eight previewed by segregated off money off recorded thereby monitor the ...\nK W see the you must send them to you mark center sponsor the film's use Thursday at the theater the November film is in Syria a film in Arabic with English subtitles it'll be tomorrow evening beginning at seven at the historic human theater which is located at two by fours ... main street in downtown Yuma\nIt's one o'clock and we hope you'll stick around for another hour of classical music overnight with Peter Van to craft\nA surface of Arizona western college for more than forty five years this is Kate AWAC humor K. A. W. P. Parker eighty eight point nine of them and take a WC dot org trusted news for humor and the ... counties\nSunny and Parker today hind you're Seventy eight brings out there in North when they're on Fifteen miles per hour but it's just as high as twenty five miles per hour mostly Clinton the evening with the Loeb around fifty one and human sunny skies a hundred eighty today a bit breezy out there as well twenty five miles per hour wind gusts mostly clear in the evening was a low around fifty five degrees\nThe education foundation of human county as accepting nominations for the ... county education hall of fame nominations are on several categories reflecting the many ways individuals and groups impact education in ... county the deadline for nominations as December seventh and can be made that tiny euro dot com slash human at hall of fame\n\nLive from NPR News in Washington ... Stevens hundreds of protesters marched in Pittsburgh yesterday as President Trump visited the site of the deadly synagogue shooting NPR's Asia Roscoe reports that Trump was joined by his wife eldest daughter and son in law and paying respects to the victims and their families\nAt the tree of life synagogue President Trump and first lady millennia lit candles for eleven victims who died after a gunman opened fire in the house of worship the president and first lady also laid stones and white roses at a makeshift memorial outside of the synagogue\nThey've been traveled to a local hospitals meet with police officers wounded in the attack and to greet medical staff treating the injured Trump went ahead with them is the Pittsburgh despite objections from some local political and religious leaders\nThe city's democratic mayor had asked Trump to delay the trip so families can hold funerals without distraction\nProtestors gathered near the synagogue holding signs and chanting against shop\n... NPR News\nFormer vice president Joe Biden says he's fed up with the Trump Administration and what he calls its lack of moral leadership by telling a Madison, Wisconsin rally that both parties should tone down their rhetoric\nThis is not who we are we need to recognize\nThat words matter words matter [noise]\nMy noted that in a week alone the nation has seen three incidents of attacks on people because of their political beliefs religion or skin color he's touring the mid west to campaign for Democrats running in states that Trump won and twenty sixteen\nEighty nine year old gangster James Whitey Bolger is dead he was killed in a federal prison in West Virginia ... a day after being transferred there from member station WBHM GBH Maggie Penman gut reaction from the south Boston area where Bolger was a mob boss decades ago\nCastle island I bumped in Harvard with one of the Bolger favorite ...\nAction from the south Boston area we're Bolger was a mob boss decades ago\nCastle island I bumped in harbor with one of Bolger favorite ... when he lived in the neighborhood\nIf you're we're down here twenty five years you're used to be walking around here in the morning which is a girlfriend Catherine and the dog's\nLongtime resident Doug ... said Bolger acted like he was just a regular guy but the neighborhood knew better use is a\n... you know here's here's our hot rod\nWhen I spoke with Robert he didn't realize Bolger had died and he wasn't sorry to find out\nWhat are you guys well he died in a very good that's good news yeah\nFor over with one of the few people who would speak to be on the record about Bulger's like at the ... hour News I'm Maggie Penman in Boston\nAnd Indonesia's search crews believe they've spotted the fuselage of the lion air jet crashed into the job of sea with a hundred and eighty nine people on board\nHigh tech equipment is being used to try to find a black box recorders there are believed to be no survivors dozens of relatives had been flown to Jakarta to help identify remains retrieve so far\nThis is NPR News\nAnd Afghan officials his army helicopter carrying seniors officials has crashed in bad weather in western far province Nasir ... spokesman for the provincial governor says all twenty five people on board were killed he says the passengers included the jeopardy corps commander of Afghanistan's western zone and the head of the far up provincial council\nMeanwhile in interior ministry official says a suicide bomber has attacked the country's largest prison in eastern ... there's been no immediate claim of responsibility for that attack\nPakistan Supreme Court has overturned the conviction of the Christian Woman who was sentenced to death for blasphemy as the BBC's psych ... reports the case of divided the nation\n... from a small village to the west of the whole with accused of blasphemy for doing an argument with too with the women who refused to drink water from the same gloss as her\nShe's now spent nearly a decade in jail at case became particularly prominent off to the murder of a politician who'd expressed support for her and talked to the need to reform the country's controversial blasphemy laws blasphemy it legally punishable by death and buckets done there no one has ever been executed for it\nThat are offered that right wing ... who wanted off your baby's death sentence to be carried out will react violently to the verdict\nThe b._b._c. ... reporting on stock markets in Asia shares closed higher today up to ... percent in Tokyo up nearly one and a half percent in Shanghai on optimism over strong earnings reports\nIn the United states I'm Shay Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the symbol Family Foundation supporting the national Center for learning disabilities which works to improve the lives of the one in five individuals with learning and potential issues learn more at NC L. D. dot org\n... by Mozart the first one written when he was just a child about nine years old is all it's his Kirsch will number Thirteen sores thirteenth piece he wrote and it's a sonata for flute and keyboard\nIn F. performance by Michael fast food to Utah I'm unique ski ... record [noise]\n\n[noise]\n\n\n\nMm\n\n[noise]\nMm\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise] Mm [noise]\n\n\nMm\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\nMm [noise]\n[noise]\n\nArrange promote charge magic ... fried slipped\n\nKnow from BCS not least yeah the girl from our all incidental music linear sweets\n\nYou know from these days is not least yeah the girl from our you know music ruining your sweet number one with the national orchestrated by my going crazy\n\n\n\n\n\nDo\n\nMany\n\n\n\n[noise]\n\n\n\nMm\n\n\n\n\n\n[noise] [noise]\n...\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\nIn the original instrumentation with the original chorus that was the musicians of the Louvre led by mark ... the foreign oil from BCS nominees yet\nThe family's learning center is hosting an exhibit on she got so out of the between the number one artist within ... Gonzales ... is ongoing from mountain in November ninth Monday through Thursday from idioms and feminine PM and Fridays from nine AM to three PM at the ... learning center which is located at one three four zero eighth avenue in San Luis\nClassical music overnight with Peter Van to grapple continue in just a moment Iran eighty eight point nine ... a double you'd see humor to a W. P. Parker and K. A. W. A. C. dot org service about ... percent of western college for more than forty five years trusted news for humor and the ... counties\nIt's two o'clock\nSunny skies and humid today hind you're eighty degrees a bit breezy out there with the north end of ten to Fifteen miles per hour gusts his highest twenty five mostly cleared this evening Loeb around fifty five in Parker's sunny skies with the high end you're Seventy eight today breezy out there as well get some ties twenty five miles per hour mostly in the evening with the Loeb around fifty one\nThe ... county library is hosting small business workshops presented by Andrew Solomon this week there'll be between creating a profitable company it will be this Friday afternoon November seconds from three to five at the human library which is located at twenty nine fifty one south twenty first\nDr you can find for the details are you my library dot org\nLive from NPR News in Washington I'm Dave ... officials in Afghanistan said there were no survivors in today's crash of an Afghan Army helicopter and western Farah Province all twenty five people aboard were killed the Reuters news agency quotes Taliban insurgents as claiming they shot it down\nThe helicopter crashed into a mountain shortly after taking off from a base in poor whether a top Afghan military commanders reported to be among the dead\nDive teams are still trying to locate the flight data recorders from a lion air seven thirty seven that crashed into the job of a sea of Indonesia two days ago\nThe head of Indonesia Transportation Safety committee says crews have detected paintings believed to be from those were quarters none of the one hundred eighty nine people aboard survive when the airliner went down minutes after taking off from Jakarta on route to an island off Sumatra\nAs NPR's Julie McCarthy reports investigators are examining reports of technical problems on the plane's flight previous to the crash lying areas under intense pressure to provide answers for family members of the victims\nTechnical problems on the plane's flight previous to the crash\nLying areas under intense pressure to provide answers for family members of the victims of flight six ten there are questions about the technical state of the three month old plane mechanics reportedly had just six and a half hours to examine why the bowling seven thirty seven max ate a sophisticated jetliner\nHad taken steep dies as it as send it on a flight from Bali to the Indonesian capital Jakarta the night before the airlines CEOs so the issue had been resolved\nDay to show the aircraft repeated the same unusual pattern the next morning before it crashed into the sea lion air has recently been removed from us an e black lists but the accident has reignited concerns\nAbout safety in Indonesia's airline industry Julie McCarthy NPR News manila\nMore funerals will be taking place today for those killed in a shooting at the tree of life synagogue in Pennsylvania for days ago NPR's Brakkton Booker has more\nMelvin wax was eighty eight years old he was described as a sweet guy and his greatest passions included his grandson his Judaism and the Pittsburgh Pirates Joyce Feinberg was Seventy five and those who knew her say she was someone who cared for others who needed a helping hand\nOr even younger with sixty nine and with the youth football and baseball coach they will be the next to be buried the first funerals got underway on Tuesday\nThe alleged suspect in the shooting rampage took the lives of eleven Jewish worshippers during a ... service on Saturday morning the suspected gunman is charged with twenty nine counts and is due back in court on\nThursday Brakkton Booker NPR News Pittsburgh\nLater this morning in Boston that city honors the red Sox for winning this year's World Series over the Los Angeles Dodgers a victory parade begins at Fenway Park this is NPR News\n\nFormer Chicago police officer is due in court today a sentencing date could be set for Jason Van Dyke\nEarlier this month the ex officer who was white was found guilty of second degree murder for the shooting death of a black teenager look one McDonald had happened in twenty fourteen but Donald was shot sixteen times\nThan I was also convicted of sixteen counts of aggravated battery with a firearm legal experts say it's unclear how much time and I could spend in person\nA tribal leader from Washington state says he was denied entry to the U.S Supreme Court because he was wearing a traditional head dress Emily ... with the Northwest News network explains\nIf your the leader of an Indian tribe that you wear your traditional regalia especially for that they have the highest court in the United states but a security guard turned yeah come on nation chairman Joe ... away because of what he was wearing\nA pair of these misinterpretation end our misunderstanding with regard to the significance of what our our traditional higher undergo your means to us\nIn a video posted to social media the guard killed ... had guts could influence justices and that there were big corn issues in the courtroom\nGaddy called the experience dehumanizing he was at the Supreme Court to hear arguments in a treaty rights case between ... and the U.S for NPR News I'm Emily ... in Spokane\nStocks in Asia ended the day mostly higher following a day of games on Wall street the Dow added four hundred and thirty two points for one point eight percent\nI've Dave ... NPR News in Washington\nSupport for NPR comes from NPR's Beijing other contributors include the symbol Family Foundation supporting the national Center for learning disability\nIt comes from NPR station or the contributors include the symbol Family Foundation supporting the national Center for learning disabilities which works to improve the lives of the one in five individuals with learning and the tension issues learn more in the L. D. died or\n\nHere's our line of musical you were going to listen to a very famous previewed by boss right know followed by eat percussion concerto very brief work by dumping used meal then we have foreshocks symphony number seven\nThe preview to bite but technically called a pre new deal was arranged by him many times including a version for so long to find a link from from a party to our sweet to eat it's been raining here for marine by Lyndon maxi performs\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\nThe black key eight to ... by Chopin ... not as he wrote it of course he wrote for the piano but played by everyone Lenny and members of the national philharmonic orchestra\n\nBoth guns abolish conducts the Philadelphia Orchestra as we listen to ... Jacques seven symphony\n\nMm\n\n\n\n\nWell\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\nWell [noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\nDa\n\n\n\n\n\n\n\n\n\n[noise]\nThey would start at the performed the chess by guitars composer ...\nK. E. W. see the you must send them to you mark center sponsor the film series Thursday at the theater the November film is in Syria a film an Arabic with English subtitles it'll be tomorrow evening beginning at seven at the historic human theater which is located at to fight for self main street in downtown Uma\n... eighty eight point night F. M. K. A. W. seat you must take a W ... Parker and K. A. W. M. C. dot org\nSurface ferrets at a western college from what the forty five years trusted news for human and the ... counties it's three o'clock NPR ahead by just up next although by our classical music overnight with Peter bad the graph\nSunny and Parker today hind you're Seventy eight brings out there in North went around Fifteen miles per hour but it's got this highest twenty five miles per hour mostly Clinton the evening with the local around fifty one and you must sunny skies to hide your eighty today a bit breezy out there as well twenty five miles per hour wind gusts mostly clear in the evening load up around fifty five degrees\nThe education foundation of human county as accepting nominations for the ... county education hall of fame nominations our son several categories reflecting the many ways individuals and groups impact education they knew my county the deadline for nominations is December seventh and can be made that tiny euro dot com slash human at hall of fame\n\nFrom NPR News in Washington I corps but cool and there will be funerals that Pittsburgh today for three of the eleven people killed in the tree of life synagogue shooting last Saturday Joyce Feinberg Melvin wax and Irving Younger will be laid to rest\nKilled in the tree of life synagogue shooting last Saturday Joyce Feinberg Melvin wax and Irving Younger will be laid to rest\nPresident Trump visited Pittsburgh on Tuesday and paid a visit to the synagogue many protestors gathered near the building to voice their opposition to the president Pennsylvania's governor and Pittsburgh's mayor declined to join him\nPresident Trump will travel to its Darrow Florida later today on a campaign swing to the Gulf Coast from member station WWNO jeep seeing you Julie Glenn has more\nAlmost all of President Trump's rallies this election cycle are in heavily Republican areas including today's appearance in Lee County Florida we're forty three percent of voters are registered as Republicans\nFlorida Gulf Coast university political science professor Dr Peter burgers and says this rally is targeted to boost turnout to help statewide candidates like Ron disadvantage for governor and Rick Scott for Senate\nHigher turnout here in southwest Florida of Republican voters than offsetting the Democratic games that you might see in Miami Dade and Broward County\nThey county in the panhandle is still reeling from hurricane Michael possibly depressing turn out in a county where fifty two percent of voters are registered Republicans for NPR News I'm Julie Glen and if the euro\nA new NPR Ipsos poll showed that more than forty percent of Americans believe the me too movement has gone too far and fears Tovia Smith reports that public opinion divides along political party lines\nThree quarters of Republicans and one quarter of Democrats Samy too has gone too far\nRepublicans are also more likely to believe false accusations are common and the less likely to say alleged victims should be given the benefit of the doubt on the other hand a third of respondents believe allegations of misconduct these days still get ignored\nNPR's Tovia Smith reporting Pakistan's Supreme Court has acquitted a Christian Woman who had been sentenced to death for blasphemy that case said transfixed Pakistan and now the country is on high alert for attacks and ... reports from Islam about\nThe chief justice of the Supreme Court took less than a minute to order a sea of BP's release nearly a decade after the illiterate fond hand was accused of insulting Islam or advocates say her fellow Muslim farmhands what angry because maybe try to drink water from the same bowl of them\nAs the chief justice issue devoted security for a shutdown the area around the Supreme Court\nDozens of protesters gathered at a distance they chanted against the judges saying they'd ruled against Islam baby's case has royal Pakistan it's led to the assassination of a minister and golf now who defended her\nHis ... to executed and he's now ... by many in Pakistan do you date NPR News Islamabad\nYou're listening to NPR News\nReports from northern Russia say that one person was killed after a bomb detonated at the entrance of the local branch of Russia's main intelligence agency three people have been hurt in the explosion Reuters news agency says the person who was killed was the man who brought the explosive device with him\nCommunity and human rights groups in Toronto one organizers to cancel a debate that features former Trump adviser Steve Bannon as Dan carpet jak reports Bannon has been accused of promoting white nationalist ideology\nIs to take part in a public discussion opposite conservative author David Frum is among debates which covers major policy issues held at the University of Toronto the two speakers are to argue whether the political future of the west is populism with Batman arguing in favor\nBut some opposed Bannon's presence called him a poster boy for white supremacy and they want the events cancelled at a press conference in Toronto several groups so you should not be invited when heightened racism\nBoy for white supremacy and they want the event cancelled\nAt a press conference in Toronto several groups say you should not be invited wouldn't heightened racism Islamophobia and anti immigrant sentiment around the rise\nAnd it would be inappropriate they haven't been draw to in the wake of the Pittsburgh attack organizers say inviting him to speak is a public service and people should be allowed to draw their own conclusions for NPR News I'm Dan carpet Chuck in Toronto\nNow say is shutting down the Kepler space telescope it's run out of fuel after nine and a half years\nBut tell us go help scientists discovered more than two thousand planets scientists also learn the planets are quite common and in many of the stars in the night sky probably have small planets with temperatures mild enough for liquid water and perhaps life\nI'm more of a cooling NPR gains\nSupport for NPR comes from NPR stations or their contributors include the University of Florida we're solving for next it's powered by its land grants heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\n\nA major work here by a composer born in Eighteen Seventy one lived in Nineteen twenty seven from Sweden ... Steen hot butter it's his second the piano concerto and Swedish radio somebody performs your ... Eric so does the pianist and your guinea skip on up is the conductor\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\nFor\n\n\n[laughter]\n[noise]\n\n[laughter]\n\n[noise]\n\n\nMm [noise]\n\n...\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\nIt's called the ... by Adriano ... Solomon's forbid involved we heard empire brass infringe\n\nTortured her Kendall the great opera composer ... most of his great operas or England but of course he was born in Germany and yet he began his operatic career in his native country in Hamburg specifically wrote a few operas there then you went down to Lawrence and wrote a couple of operas there and then went to England\nWhere he continues his career couldn't hear a A N over chore it's almost a dance we just extended piece I Can't imagine this would have opened the baroque opera 'cause it lasts about sixteen and a half minutes\nBut it's an overture to his Florence Brett Rodrigo we hear the part of the of instruments conducted by Peter holding\n\n\n[noise]", "year": "2018", "show_name": "Music of the Masters", "city": "Yuma", "day": "31"}