{"month": "10", "state": "AZ", "station": "KOFA", "content": "You're most finished radio series his Tom Cole and get a downloadable MP three bits and other hours weightless we're listening anytime boom boom has stolen dot com\nThank you for listening to what they ... at Thirteen twenty am as well as border radio easy dot org ... of Arizona western college we also broadcast on the Arizona community radio network at eighty nine point five ... Ben ... Williams Ninety point one FM Jay Jay Z pie Prescott\nNinety point seven at them kj ... men in Ninety One point three up andme in Flagstaff\nMartin little that one of the hosts for me program called crossing borders on ...\nRadio Thirteen Tunisia Yemen human genus every afternoon from three to seven from mix of music from around the world it's rained here in Arizona we can be heard on the Arizona community radio network and you can stream of candy WC done or the radio or the ... just search for Kate ... at\n\nThat is the latest round trip to Dave\nThat's the latest from trumpeter David Douglas featuring Anwar marshal on drums it's an album called little giants still like\n[noise]\nNeed to\n\n\n\n\n\n\nAnd\nOf [noise]\n\nAll\n[noise]\n\n\n\nThe\n\n\n\n\n\n...\nSmiles runs the boob tube down from the album pitches brew was a double lp when it came out in Nineteen Seventy\nAnd just shook everything up I told your most of the personnel I'll remind you that it was Wayne Shorter on soprano saxophone and many mop and on bass clarinet I did not mention the two bass players who were there Harvey Brooks was one basis Dave Holland the other electric basis\nUh and that made for a basically a double rhythm section because they're also the two drummers found Eliason jak Jeanette and the two keyboard it Joe ... and ... Korea\nAnd as I say that album shook everyone up I'm I'm not really I Can't remember exactly what I thought of it the first time I heard it a within a few years I knew that it was important and amazing\nBut when I first heard it I'm sure that my reaction could have been like many in the jazz establishment who just went what what is is it's not happening but it is the album that launched a thousand fusion ears\nAnd you heard it here on jazz with menial tasks or\nIt can be airport or radio Thirteen twenty am on the radio at sap download the app and sell it and so like Kay or let's say as your favorite station\nDoes there's some stadium will be hosting the twenty teens don't be fun run there'll be a contest for costumes and much more it will be this Saturday in the evening from six or seven thirty at twelve eighty what does your son drive in Yuma, Arizona for more information you can call us at nine to wait three or four seven six nine zero\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world joined K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty to seven at St Paul's cultural center for information visit K. A. W. C. dot org this event made possible in part by a grant from Arizona humanities\nAWAC is calling their ... will be having full dinner offerings for the fall semester the next meal featuring Armenian night with ... will be served this Tuesday evening at six wheels are served in the learning resources building on the campus room ... new nine tickets are available to them to eat a PC business office\nGot another fairly long piece of music coming up next it's not as eerie\nOr as scary as bitches brew I hasten to add it's from a recently released album by guitarist than Bruce ... sex tests that's based in the Chicago area but he calls his base a collective he defines payday here as a measure of systemic risk\nAnd I think that's a pretty good description for the music here this is the title track from the album called earth shine\nComing up next it's not as eerie or as scary as it which is true I hasten to add it's from a recently released album by guitars Dan Bruce Banner sex tests that's based in the Chicago area but he calls his paycheck collective he defined beta here as a measure of systemic risk\nAnd I think that's a pretty good description or the music here this is the title track from the album called shine\n[noise]\n[noise]\n\n[noise] [noise]\nGuitarist than Bruce than his beat a collective starring ... Ross Johnson on trumpet Rob clear field on electric piano and John Diamond Meyer on drums on the title track from the album called earth shine\nHere's something off the latest album by piano Stanley Kowalski what's an album called no illusion cynicism titled style jets for homeland\n\n\n\n[noise]\n\n\n\n\n\n[noise]\nMm\nMm Mm\nMm\n... ... ...\n... ...\nWords to his songs in English not just translations from the Portuguese new lyrics that were only in English or only in English until we translated them back to Portuguese he was an amazing man\n\nThanks for listening to ... an ... radio a C. dot org and service of Arizona what's in college we also broadcasts an Arizona community radio network at eighty nine point five FM K. J. C. H. Drake Williams Ninety playing one ...\nNinety eight point seven ... in Ninety One point three FM Flagstaff\nMostly clear in Yuma tonight with a low around sixty four breezy what the west northwest window five to Fifteen miles per hour\nTomorrow sunny with the high near eighty three tonight and Parker there's a ten percent chance of showers and thunderstorms partly cloudy with a low around fifty eight north northwest window five to ten miles per hour tomorrow sunny with the heightened you're eighty two\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\nBa ba\nBom\n\n[noise]\n\n[noise]\nAt the latest from percussionist rain man see a leading a group that included Mike Freeman on fiber phone on a couple of tracks the album called high voltage\nAnd the true coming home baby which came out in the spring or summer of two thousand Seventeen also featuring the keyboard it Eddie Martinez and on drums Diego Lopez that's a tune coming home baby that was a big hit for her being man back in the Nineteen sixties\nAnd has remained in the jazz repertoire ever since and you're hurting Iran jazz with menial Chester\n\nWas generous\nGracious and good\nThat was my dad's\n\nAre human beings so true people who are just a shame because he knew\nIn live in the\nGym for you do is\nAll we stand by me\nSo I'd be punished free\nWas my that\n\n\n\n[noise]\nWritten system\n\n\n\nTom heroin his gourd cats here's the vibe or phone it erodes wreck appalled\n\nThat's trumpeter Tom heroin his court cat here's the proponents arrows ...\n\nD O\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\nAll the\nDo the old guard but they're not\nThere all the man behind the\nWay up\nThe white or black or buying\nGoing\n\nThey do all that in mind is\n\nLearn every day\n\n\n\n\nAnd\n\n\nTo get them\nThey're going to get them\nManner and manage to\nA way\nDa\nDa\n\nDa da da da di\nDay off\nWe're first from Antonio adults though the Brazilian pianist and a ranger who's album in two thousand Seventeen and title hybrid do\nUh brought his Brazilian rhythms to the melodies Wayne Shorter who himself has had a great experience with Brazilian music throughout the second part of his career\nSo we heard prince of darkness from the album hyper do from Antonio a doubtful which is subtitled by the way the album from real to Wayne Shorter\nAnd then we just finished listening to suddenly rounds and the clip so called brown skin girl\nWhich case that's talking about the lyrics\nMiller said brown skin girl\nStay home and take care of baby\nYou know the ... to ... to\nReally be many other than a\nLine in in the movies ... so I mean\nYou are changing K O F ... water radio searching twenty am and border radio easy dot org you also broadcast on the Arizona community radio network at eighty nine point five FM change easy a drink Williams Ninety point one F. M.\nK. J. C. P. press get Ninety point seven FM cage easy cake king net in Ninety One point three FM watched that\nThis was folk singer Michael Jonathan inviting you to tune in a very special broadcast\nWere reading legacy record labels in America the historic metrics waiver that gave us Johnny Cash Elvis Presley Howlin' Wolf bb king Roy ... and so many more were celebrating son record with music in conversation on this week's broadcast of\nThe word\nSeven border radio Thirteen twenty am\n\n\n\n\nHe\n\nThat\nThey\n\n\n\n\n...\n\nA\n\nOn\nCrusaders recorded live at the lighthouse in California in Nineteen\nSixty six\nYou're tuned to jazz with Neil ... here's the arc farmer Benny goals in jazz\n\n\nIn a restaurant is a whole lot follow\nFrom Goree show on leaving us on the show or a little windy\nTime out private land smell of in a plane in my mind and then we will actually\nSo am I don't think it's\nA moment of any I mean all the time and no one I did I recall\nIn reference to the whole law\nBut those are the odds you know the Milan as I recall ...\nIn ...\n\n\n\nThat's the jazz warriors Iran Joe Neel pets are underserved shank\nNa na na na\nNa na na na na na na na na na\nNa na na\nBut the jazz warriors Iran job with a little tougher shape\nRight now I Know\nThat meant that no no no not at\nThem get back and I know that that that\nThat that never had a\n\n\nBut\nThat that\nGoing to be in you know and\n\n\n...\n...\nAnd ...\nMan who was\n... name\nThey they\nAdded ...\nNa na\nNa na na na\nNa na na\n[noise]\nI'm Gina went into the new program called crossing borders on board I mean you think he's twenty and then you must join us every afternoon for three to seven for Nixon music from around the world or right here in Arizona\nThey can they heard on the air isn't meant to me radio network or you can she must that K W scene dot org or on the radio ethics that far they can get ... [noise]\nTime he knew from the ... the national heritage area will present speaks and spirits of Yuma it'll be the Saturday starting at noon at the heritage library three fifty some third avenue in Yuma for more information you can call us then nine to wait three or four seven six nine zero [noise]\nWhen you say\nHot weather that tried to\nHot weather that tried to\nWas from the jazz renegade and the eighties here is a recent album from the Bob several big band featuring white ...\nBut when you need someone to love knows\nDon't do this stranger\nMind Jersey dollars per\nCall\nFollow your heart a no win\nGung ho and\nTo me\n\n\nDid you\nThe\nStone strangers\nCome to me\nThat surely or in the book was and the pianist the horn arrangements by Johnny paid a music legend here on jazz with Neal tester\nThis border radio Katie where the Yuma Thirteen twenty am and ... on the service of Arizona western college\nWe also broadcast on the hour we're going to community radio network at eighty nine point five ... kj CSI age ... Williams Ninety One FM kj deep deep press get Ninety point seven FM Jay Jay Z gay Kingman and Ninety One point do you ask them like staff\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highway devolved into one of the most respected and rebuild publications in the world\nDoing K. A. W. sea and retired Arizona highways publisher when holding at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty to seven at St Paul's cultural center for information\nThe the rich get Ninety point seven as than Jay Jay Z cake team in Ninety One point three ... ... ...\n... a brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and rebuild publications in the world\nJoin K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty seven at St Paul cultural center for information does it K. A. W. C. dot org this have been made possible in part by a grant from Arizona He may\n\n\nNot\n\n\n\n\nSo\nNa na na na\n\n\nNa\n\nNa\n[noise]\n\n\n\n\n[noise]\n\nJust one of McCoy all writers many exciting pieces of music that's called inner glimpse done by Harold may burn off with Harold CD to love to be loved\nHarold on piano one of the masters of the piano Eric Alexander I'm center that reads the bassist Jimmy Cobb on drums and Freddie Hendricks on trumpet\nHello and welcome you're listening to jazz with age one we are delighted to have you with us and please stick around for a lot of the great American music we call jazz\nUp next one of the great tenor masters Johnny Griffin and checked his last\nRecord date he's joined by worry Hargrove on trumpet David Newton is the pianist and on base Reggie Johnson Billy ... is the drummer for the blues walk\n[noise]\nYou're listening to jazz with Dave ... we are delighted to have you with us and please stick around for a lot of the great American music we call jazz\nUp next one of the great tenor masters Johnny Griffin and checked his last record date you joined by Rory Hargrove on trumpet David new new the pianist and on base Reggie Johnson Billy ... is the drummer for the blues walk\n[noise]\n\n\n\n\n\nAnd then from\n\nCity [noise] [noise]\nAnd all the\nStudents\n[noise]\n[noise] [noise] [noise]\nYou know something about them\n\nThe\n\n\nContinue to\n\n\n\n\nTo know\nWho are looking\nOne\nOf the\nTo to to to\n\nThe space\nStation\n[noise] into\nSays she\nTo find a\nLink to run on the\nPlane\n\nMean\nIn the ...\nMen\nNa na\nMen\nNa\n[noise]\n\n\nAnd then they pulled aside from\n[noise]\n\n\n\n\n\n\nThe [noise]\nThe news\nAnd I'm In\nPool and then\nBoom\nBoom\nBoom boom boom [noise]\n[noise]\n\n\nThe CD is called monk train miles and me miles represented there by all blues of course that guitarist Larry Corey out along with Larry on guitar something deeper into bowling debate sport is so low\n[noise] um [noise]\n\n\nThe CD is called monk train miles in me miles represented there by all blues of course that guitarist Larry Korea all\nAlong with the Larry on guitar Sunday deeply auto bowling the base for his solo sounded great there and you're on Israel on drums we have a lot of other things that sound great and they're just ahead please stay with us You're listening to jazz with Dave swan\nYou probably hear a thing on a regular basis that border radio listener supported such a dusty contribute to border radio thank you for making everything here I'm distaste impossible especially the student internship program thanks for your support\nThings were listening to butter radio Thirteen twenty am in Yuma and butter radio ... dot org we have been these surveys of Arizona western college for more than forty five years\nSunny skies in the forecast for humid today highest reaching up to eighty three degrees north window five to ten miles per hour in Kingman sunny skies today with the highest reaching up to Seventy degrees\nIn Prescott a thirty percent chance of showers and thunderstorms today partly sunny skies with ties reaching up to fifty nine degrees in Flagstaff there is a forty percent chance of showers and thunderstorms during the day partly sunny skies with the heightened your fifty degrees\nIn observance of Hispanic heritage month assemblies library will host or fifth annual our exhibition featuring the art work of low court is it continues through October Fifteen that the ... library ten Seventy five north sixth avenue you can find further details I Am a library dot org\nJim war filled up next from the CD jazz land jazz land aptly describes the music that goes on it and there's actually a lot of different influences here\nStraight ahead things gospel things beautiful ballad like tenderly even old to Billy Joel you remember the hit by Bobby gentry from the Nineteen sixties which was huge for\nBobby gentry and it's done been done in a variety of versions but we're going to hear a tune by Donald Brown who was with Art Blakey and the Jazz Messengers some years back here's Tim war field version of theme for Malcolm\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\nAnd\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\nStill are by starlight\nThe unmistakable trumpet of Miles Davis\nThat was from a concert in February of Nineteen sixty four at Lincoln Center now this was long before jazz at Lincoln Center of course but that was recorded at philharmonic call the Lincoln Center at the newly opened Lincoln Center at that time\nMiles on trumpet George Coleman Turner sex Herbie Hancock piano Ron Carter base and ... Williams on drums the makings of the second great quintet for Miles Davis a George Coleman playing briefly with ... and playing very well\nRon Carter basin Tony Williams on drums the makings of the second great quintet for Miles Davis a George Coleman playing briefly with miles of playing very well", "show_name": "Jazz with Dee Alexander", "year": "2018", "city": "Yuma", "day": "08"}