{"month": "10", "state": "AZ", "station": "KOFA", "content": "... radio network eighty nine point five FM case do you see a St Louis in Ninety One F. M. K. J. C. P. press get Ninety point seven F. M. K. J. C. K. king meant in Ninety One point three offense like staff\nToday's border radio day sponsors the gamble families celebrating the sixty eighth birthday a rock and Roll Hall of fame and duck the Tom Petty\nIt's hard to believe it's been over a year since it was Tom time to move on to her room at the top even though for them he will live forever the gambles would get anything for one more day one more night\n\n\n[noise]\n\n\nChip white and his all star ensemble volume five\nFrom New medications and let me move that were minor adjustments and he has an all star cast here why clipboard non trombone Bruce Williams saxophone patients he flew to real staffer trumpet when you wrote in his piano Peter Washington based the crew on ...\nAnd you've heard this great music right here with me the Alexander more music coming up so please stay close to ...\n\nThe [noise]\n\n[noise]\n\nSome day he'll come on\nMan I Know\nHe'll be big and I'm the man I Love 'em\nWhen he comes my way\nDo my thing [noise] to\nHe comes my way\nDo my best to\n\n[noise]\nAnd the man's mind\nUnderstand\nIn a little one\nHe will tell you this is mine\nKnow it seems so [noise]\nUm\n\nMaybe he\nStern day\nMonday [noise]\nMating I'm\nStill a lot of shows him\nWill be a little\nMen phone today\nFrom which I never\nWhen you were yeah [noise]\nSo that's the\nAh\n\n\nMm\n\nMm proved to be ... be\n\nTo prove to be the baby boom boom\nBoom\n[noise]\n\n[noise]\n[noise]\n\nMm\nMm Mm Mm Mm [noise] [noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\nMm Mm\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nOr\n\n[noise]\n\n\nSteve home with his tribute to Bobby ... that were merely and he's a company by Adam Coker on tinder below kind of piano Peter Washington based\nJohn Reilly on drums with Steve I'm On my end before that\nAll about that they see the Count Basie orchestra directed by Scott Barnhart with don't worry about me featuring curtailing\nHe Dinah Washington and preventing you get what it takes maybe [noise]\n\nYou go just to see if we go\nThere and they\nYou go to work harder to regard\nYeah oh yeah you got again on its way around you\n[noise]\n[noise]\n...\n... [noise]\n\n\nGoing to\n\n\nThings and\n\nDuring the day\nCan be\n\n\n\n\nYou know he gave\nWe also broadcast on the hour is on a community radio network at eighty nine point five as than Jay Jay Z a drink Williams Ninety One that same cage GDP ... Ninety eight point seven that fan Jay Jay Z Jake Kingman and Ninety One point three FM blacks\nPartly cloudy this evening in ... around sixty seven degrees tomorrow on Sunday mostly sunny a heightened you're eighty eight and Parker tonight thirty percent chance of showers partly cloudy skies Loeb around sixty six tomorrow that slight chance of showers will continue we've got mostly sunny skies but the height and your eighty seven degrees thanks for listening\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nDo with the\n\nBall\nMan [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\nIn the [noise] the the\nThe beep beep beep beep beep beep\n\nBeep beep beep beep beep [noise]\n[noise] he seems\nBe [noise]\nBe too\n\nTo try\nTo\nKeep the [noise]\n\n[noise] [noise] [noise]\n[noise] we we can\nTalk with them for the last time I get your mind\nDog ... and\nMike Freeman ends on the line from ... blind that was also the title of the track\nMy ... Vides ... Gonzalez trumpet Ian Stewart base Robert ... cattle on cougars and Joel McHale on drones thank you so much for joining me to see the Alexander hope you are having a wonderful time and I hope\nTail on drums thank you so much for joining me this is the Alexander hope you are having a wonderful time and I hope that you have a smile on your face more music coming up for you shortly so please stay with me this is Janice\n[noise]\nGet it straightened out of Iraq then we'll be down\nIf you can hang with us feeling\nWhile there ain't no use for you that\nHe seems on night and day she lives in crazy then the only way not to know\nEnjoy the other thing is\nThere some human chain you I think so man\nThere ain't no phone so I'm getting loud\nIf you take a chance and doing while they're even\nNight and day really crazy that is the only way\n\nAnd yet\nIf you're leaving\n[noise] she\n\nNo\n\n[laughter] [noise] boom boom boom\nBoom boom\nBoom\nBoom [noise]\n\n\n\n\n[noise]\nThe one who determines\n[noise]\n\n\n", "show_name": "Jazz with Dee Alexander", "year": "2018", "city": "Yuma", "day": "21"}