{"month": "10", "state": "AZ", "station": "KOFA", "content": "Platelets or listen anytime at full moon taxed on dot com\nThe downloadable MP three of this and other hours platelets or listen anytime at full moon taxed on dot com\n[noise]\nHuman civic center hosting the human community job in education berry this week It's Wednesday October third from nine AM to one PM ... center fourteen forty west\nDesert he'll drive ... if you'd like more information about the human community job and dedication fair ... WC three four four seven six nine zero\n... campus of Arizona western college does his border radio Thirteen twenty am kale at the human importer radio ac dot org\nWe also broadcast in Arizona community radio network at eighty nine point five FM cagey C H ... Williams Ninety One F. M. K. J. C. P. press get Ninety point seven F. M. K. J. C. K. Kingman in Ninety One point three ... [noise]\nWhat's it like to explore a city with your here [noise]\n...\nSome people talk usually people are trying to block out the noise of the city but it's actually interesting to turn it off\nEverything has pitch and rhythm the city itself has claimed\nThat alone is month at the piano Johnny Oregon basements break you dumb up on drums and Charlie route on tenor saxophone\nAll the money for chat recorded live in Italy in Nineteen sixty one then among composition called San Francisco holiday\nYou're doing the jazz Neal tester and then this hour the program we're going to take a San Francisco holiday\nTo quote the famous tune by a woman smoke no particular reason every so often we get to the music of a different city\nAnd this hour that means one of the great jazz cities in the world San Francisco or I should say really the San Francisco bay area because you have to count when in there were so many great musicians have come from\nIncluding the saxophonist Louis Jordan Eli WINS sue I Believe is based on the Oakland side of San Francisco bay he hasn't reached without them that we're going to get to that we're going to get to a recent one from ... in the San Francisco pianist and a synthesizer is done his most recent recording\nAs well as some things from some tried and true San Francisco area favorite such as Wayne Wallace who's coming up next\nAnd Sandy Kress men then why don't you things recorded live in San Francisco not just by San Franciscans but by people who were temporary San Franciscans visiting the city\nAnd performing in one of the find clubs there but as I mentioned waiting while is up next with his Latin jazz quintet this is the most recent album by that group it came out in two thousand Fifteen and like the previous five albums by waiting while it's his Latin jazz quintet earned itself a Grammy nomination\nThis is a Spike Lee and at first deceptive arrangement dizzy Gillespie tune that you may recognize called out go when you are [noise]\nHa ha [laughter] the\nMusician that\nMeets for an extended period each year a near the ... in the San Francisco jazz center in San Francisco and uh they're they work up compositions of their own and arrangements of another jazz musicians famous jazz musicians compositions this was the most recent double album recording\nFrom a concert which they play the music of Miles Davis and their own original compositions including one which is written by the basic math Penman\nIt's called your churning among those taking their turn\nWere the tenor saxophone is W. Sanchez than the microphones Warren wolf\nAnd the trombone is Robin Eubanks and just before that we heard in other trombone is too is even more readily identifiable with San Francisco that would be way while is\nThe Latin jazz expert who is no not only for his leadership of his own Latin jazz quintet as well as as\nA splendid trombone player but also because his label ... records has for many years been the go to spot for independence San Francisco jazz musicians to get their music out on desk\nWe heard from Wayne was his album called injure cameo backtrack also featuring joke Algernon steel drums and Michael Spiro on percussion here on jazz with Neil ... in an hour where we\nFrancisco that would be way while is the Latin jazz expert who is no not only for his leadership and his own Latin jazz quintet as well as as\nA splendid trombone playing but also because his label ... records has for many years been the go to spot for independence San Francisco jazz musicians to get their music out on desk\nWe heard from Wayne was his album called injure can be you backtrack also be dream job Algernon steel drums and Michael Spiro on percussion here on jazz with the Old Testament\nAnd an hour where we have our hearts and our head in San Francisco we'll get to some more music from northern California and just a couple of minutes I Do want to remind you that if you like what you're hearing or hate what you're hearing or just want to talk about what you're hearing you can get a hold of me or any of my jazz network colleagues\nBy writing to us care of this radio station\nHere to the border radio Thirteen twenty am in Yuma and border radio easy ... or we also broadcast on the Arizona community radio network human\nCounty library hosting a presentation by business librarian Andrews ... he'll be leading a series workshops that teach potential small business owners would they need to know to start a small business dispute features creating a profitable company it's Thursday October forth from three to five at the San Luis library\nAnd Seventy five north sixth avenue in St Louis [noise]\nGet rid of him on this American roots with New Orleans jazz drummer Shannon Powell the meters bunk masters ... son rockabilly Jay and Vinnie baloney us months drummer enrolling in the late ... pointed [noise]\nName is joined me for the art of precaution on American route\nDay morning from San Antonio and [noise]\nHuman county library continuing their small business workshops series presented by business librarian Andrews the woman is weak teachers find your customer friday afternoon October fifth from three to five at human main library twenty nine fifty one top twenty first drive more information at you my library dot org\n\nUh\n\n\nThat's a quintet there was led by the saxophonist Harold Land and the ... Bobby Hutchison\nOn an album called San Francisco from the early Nineteen seventies and that's pretty much the theme of this hour of jazz would Neal tests or San Francisco and Oakland and much of the great music\nAnd many of the great musicians that have come out of that city Bobby Hutchison who was born in Los Angeles I moved to San Francisco after he lived in New York for a while and spent a I Believe the second half of his life\nIn San Francisco just before that we heard from Denny's island who moved out to San Francisco and the late Nineteen sixties and it's been a\nAn important musician out there ever since then he's like when a George march with whom he has been collaborating on music for drums and electronics since the late ... early Nineteen seventies really\nThis latest example of their work together is called expedition I came out on the sunny side label in two thousand Seventeen now before that we heard from Louis Jordan saxophonist L. E. W. I. S.\nAnd his group music at large their latest album is called this is where I came in and Louis Jordan is a veteran of the ... when at San Francisco Jesse\nHad so many of the artist on the album we have queued up next it's called oak tree Amigo which is Portuguese for among friends it's from the vocalist and songwriter Sandy craftsmen [noise]\nHi\nThe guy that to\nBe seen as leverage the chill yeah Bush ...\nOn my\nPhone and\nYou did he die\nOn me I mean you\nAnd me being shown now and they need you may be due to the\nAnd to\nBe a a a saw me and\nDo things to put on me de da\nDa\nDa da da da\nDa da\nDa da da\nDa da da da da da de\nDa\n\nDe ... but we do\nNeed male voters maybe\nWe could\nAll the girls do guy\nCame in after him\nThe line who think de da da\nDa\nDe da\nDe ... God\nShe up by\n... game\nShe told me today because\nShe by\n... should be on the on the\nTailed\nLine for he\nDo it you\nThe maybe the\nThe\nDo people make\nAll the\n\n\n\nThe police department will be hosting copy it was a ... a unique opportunity for community members question to learn more about the department's work in the city of human neighborhoods ... will be between six and ten am this Wednesday at Goldsboro bakery twenty forty five ... avenue and\nThanks for listening to us the human and Thirteen twenty am I'm ... radio waves eat daughter worked your surveys of Arizona western college\nWe also broadcast on the Arizona community radio network at eighty nine point five as than Kay Jay Z a drink Williams Ninety One that same cage GDP press get Ninety point seven there than kj easy take Kingman in Ninety One point three FM ...\nIn observance of Hispanic heritage month the St Louis library will host or fifth annual REX division between the heart where's the local parties it continues through October ... that the ... branch library ten Seventy five north sixth avenue you can think further\nUp the mess you another hour a jazz with Neil ... there's music from the San Franciscans Jenny may be on piano and Nick Philips on trumpet pop east burn on the [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\nThe piano Jenny maybe and trumpeter next Philips on their album called haiku which came out in two thousand sixty here at the San Francisco string trail\n\n\n\nThe main point should only\nBe a game called to let this pin that not that you you won ... Benson died due to my aunt who bought up\nThe in my\nMind being then there's\nBeen so closed down you know one little over ... you know keep your mind from the movie that did that is\n...\nDon't you get bloody oh\nWas watching your cloudy oh\nNo\nThey're going to get cloudy\nWas going to get bloody oh\nA little bit yeah cloudy all\nGlobe gladly oh\nMichael ... da\nDa da\nDa da da da da\n\nDi di di di di\n\nAnd and\n[noise]\nYou know when people do need to be would be\nIn the [noise] the the\nThe army and [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\nWe're first from Russell I'm Alone on guitar and the latest album under his name is called time for the dancers and also features Willie Jones the third on drums\nAnd Rick Germans and the pianist and look Selleck find young basis on a tune called leave it to Loni which was written by Russell Malone and then we just finished listening to Joe hinders them from a Nineteen sixty six album called mold for Joe\nAnd Joe Henderson zone June called a shade of jade what'd you become a pretty well known especially to younger generations of musicians who have turned it into one of their a prime vehicles for a learning composition and for improvising on it's become one of the new jazz standards\nAt least that's what I'm told by folks who are still in high school and college and are getting into the music first hand\nHuman\nCounty library hosting a presentation by business librarian Andrews ... he'll be leaving a series of workshops that teach potential small business owners what they need to know to start a small business this week teachers creating a profitable company it's Thursday October forth from three to five at the St Louis library ten Seventy five north sixth avenue in St Louis\nThis was born and radio K O F e Yuma searching twenty am and where do we do is eat that Oregon a service of Arizona western college he also broadcast on the Arizona community radio network at age ... K daisy a drink Williams ... FM ... press get\nNinety point seven F. M. K. D. C. K. king men in Ninety One point three FM Flagstaff\nThe police department will be hosting coffee was a cop a unique opportunity for community members to ask questions I learned more about the department's work in the city of human neighborhoods the event will be between sixteen Tony I'm this Wednesday at Goldsboro bakery [laughter]\n\n[noise]\n[noise]\n[noise]\nThat's\nThe newest album from drummer Lewis have what's called serenade for silver and that's because the pretty much came up and Horace Silver bands in the Nineteen fifties where they were having ... the milk to non by\nYou're doing the jazz Neal that this is the steel McLaurin stuff all\n\n\n\n\nWhy my world\nMay or may\nMy world\nNarrow minded\n\n[noise]\n\nNa\n\n\n\nThat's a quartet called black diamond Here's New music from trumpeter Tom Harold\n\n... for\nMy\nAnd\n\nPop pop popcorn\n\nNo no no no talking from\nLa\nLa\nDa dum la la la\nLa la la la\nLa la la la\nLa la la\n\nLa la\n\n\n\n\n\n\nDi di di di di di di ... [noise]\n\nYou know between the people who [noise]\n\n\nTo do it [noise]\nIt it it will do it\n[noise]\n[noise]\n\n\n\nFrom the from\nDon't know\n[noise]\n\n\n\n\n\nMm\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nYou are to chew K O F e humor border radio Thirteen twenty am and order radio eighty dollars\nWe also broadcast on the Arizona community radio network at eighty nine point five FM cage Jay Z a Drake Williams Ninety point one FM kj deep deep Prescott Ninety point seven FM kj the cake Kingman and Ninety One point three FM Flagstaff [noise]\nWhat's it like to explore a city with your here [noise]\nThe rumble what are\nSome people talking usually people trying to block out the noise of the city but it's actually interesting if you turn it up [noise]\nEverything has pitch and rhythm the city itself has claimed [noise]\nTo listen to your\nNext time onto the best of our knowledge from\nSunday mornings and continue on key Wu si se ...\n\n\nTo explore a city with your dear\nRumbling\nAnd people talking usually people trying to block out the noise in the city but it's actually interesting if you turn it off\nEverything has pitch and rhythm the city itself has claimed\nTo listen to your\nNext time onto the best of our knowledge from\nSunday mornings and tend to noon on key to be you see any point nine us and\n\nHa\nHa ha ha ha ha ha\nHa\nHa ha ha ha\nSo\n\n\n\n\n\n\n[noise]\n\n\n\nParents\n...\n...\nAnd\nThen we\nAnd\nThe quartet known as ... fear and this time the dreams on me that quartet being Charlie rose center Kenny Baron on piano Ben Riley on drums and buster Williams on base from the CD called for for all\nWe have a tune coming up and just a second dedicated to Charlie routes the great tenor player who played for so many years with the learning of smoke hello there and welcome you're listening to jazz with Dave swan\n\nWe hope things are going very well for you and we hope to music makes it even better here's been hearing this going back to the Nineteen nineties uh since and hearing on the evidence labeled\nThis quartet is with Donald grants on piano Robert her son base and the drummer is Jacque de Jeanette a tune that was written by Robert cursed for Charlie Rouse it's called roast about\nListening to jazz with Dave one\nWe hope things are going very well for you and we hope the music makes it even better here's been hearing this going back to the Nineteen Ninety seven since an hearing on the evidence label\nQuartet is with Donald grant on piano rubber Hearst on base and the drummer is Jackie Jeanette tune that was written by Robert cursed for Charlie Rose it's called roast about [noise]\nGot\nTo get to the island from cedar Walton\nThe bases in the group there roped into David Williams' along with senior Vincent carrying on al ... and we'll be Jones the third on drums from cedar Walton CD called the bouncer you're listening to jazz with Dave wide and feel ill with the too cold for those who do [noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]", "year": "2018", "show_name": "Jazz with Dee Alexander", "city": "Yuma", "day": "01"}