{"month": "10", "state": "TX", "station": "KTDH", "content": "Was over thirty albums to his credit James ... is one of the most prolific artist pleasure of interviewing you shared the stage such diverse funny ready to go out and Larsen believe Robin Williams this weekend artist Saturday evening at eleven central\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da di di di ... one point seven KGAN Hayes a service of high plains public radio\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot Ozark\nHighlands radio is brought to you by the ... center state park in Mountain View Arkansas a wonderful way to enjoy yesterday on the Web at other talk folks centered dot com [noise]\n\nEverybody just days Smith hosted Ozark highlands Radio Welcome to our show on this week's show we'll explore\nBoth songs about families and songs played by families too\nWith music from some of our best local musicians as well as\nThe likes of Asia grocery Tom brash and the grandpa Jones\nFamily get our guest host segment renown traditional folk musician writer and step to answer ... Atwater explores the strange tradition of counting song and of course I'll be heading down to the ball to see what Jim mark Jones is found forced all that this week on Ozark highlands radio\n[noise]\nFamily life and ties are a big part of Ozark for culture and music this week let's take a look at music by family for family and about family\nPerformed by various artists recorded live at the Ozark folks interstate park in Mountain View Arkansas come on home with us to the Ozarks as we enjoy a little family time celebrating the joy familial bonding through song when AJ\nPark in Mountain View Arkansas come on home whether it's to the Ozarks as we enjoy a little family talk celebrating the joy familial bonding through Saul when AJ crunchy some of the late great Jim Crow cheap light here last year he let a recording of his dad's dark this dog that he came in to finish it anyhow\n[noise] I'm not much on special effects lessened balls are actually playing music and so uh this is a little tricky sometimes goes wrong even though it's should be relatively simple [laughter]\nYou know a anyhow this is a does the original demos of this song that my father wrote for me in\nNineteen Seventy\n[noise]\nMm\n[noise]\nIt's good to see ... or do they know as I\nCan do ...\nAnd just see it every day ... just to spend ...\n...\n... ... that\nWere good may wishes come true Mm\nI said in that region luggage treasure and I'm not in love with Ben ...\nTime to do the same ... once you\n[noise]\nMm Mm Mm\nMm Mm\nHis ... dogs just foolish you know ... they didn't never um to bomb would be empty ...\n... being on\nTo do ...\n\n...\nGo do Mm\nMm\nMm Mm\n\n\nThat was father and son Jim an age encroaching singing time in a bottle the great song that AJ says his father wrote for him I'm already you know if you're ... you're like me you better get your hanky show because these are some pretty heavy dogs were playing for you this week on this week's show a future not one but two sets of identical twin\nKatie Lewis penny league Clark were raised on a working family farm in the deep tiny woods in east Texas here's a song they wrote about their father\nWe lived in Nashville for five years and um we uh\nHad a great time there I never really thought I'd I'd leave actually come back to Texas\nFor five years and um we uh\nWe had a great time there I never really thought I'd I'd leave actually come back to Texas where I live now back home on the farm that I grew up on\nBut I'm In two thousand and well my dad became ill back in Texas and it was really an opportunity for us to come home and take care of my dad and take care of things on the farm we took a year off and um\nGot to spend a really tough and sweet year with my dad before he passed away in two thousand and Thirteen ever since my dad passed away I've\nHad this running list of things I'm a computer that perhaps I I Wish he could be here experience with us here on the third some things are begun summer just small and here's a song that we wrote out of that list of things that we are computer\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm I\n\nHaven't really been ... that that the whole driveway ... in the summer of Thirteen or ... ... ... ... ... said that she had no down ... uh where you know and\nBut you sure hated and leave your family I Wish you could have seen this guy that day or you just said that her stroke you weigh ...\n... ... ... ... ... ... there is peace in the dorm miles on air\nBases we took pictures and are red and orange and blue\nBeans ... seem to do things\nThat go with that daddy knew\nWhen they made everybody in the\n... you know leave all the people around that gray\nAfter lunch your rent pay no\nOne has to write a book on the other main they had the name of you when you're young or a day\nWhen did you get the and the crowd that here\nWe had rain rain upon time they reach the here in\nNew York daily news on the phone ... from\nHe just didn't see that one didn't that those two\nThings I waste my daddy news\nBut you know I'm I'm at work in high demand from my family now learning how to drive\nRight now but down around zero not\nBaby lady offering\nMen tend to be a man Loomis\nThe game is how I got to be there with me and\nNot that old went in to the students without any injury to defy\nAll your brand can they do on it'd be like ...\nOr my daddy\nMeans that we're mad daddy news\nMan in the bed and they're the ... na\nThere ain't got nothing on their own you\n[noise] are you tired of hearing the same music over and over again I Want something a little more maybe something\nWithin a feed them both men tuned into punk and disorderly on high plains public radio this week will the black flag ... gimme gimme a lot more [noise] I'm Brian bureau joined me this Saturday Night at midnight central right here on H. B. PR desert\n[noise]\nH. P. P. R.\n\nH. P. P. R. is a community resource that delivers media that matters and is made possible by the contributions to H. P. P. R. you gain knowledge and grow community so please give today at H. P. P. R. dot org\nWelcome back to college radio it's that time of the week folks it's time when I go down and visit my buddy in the vault mark Jones let's go down there now [laughter]\n\nHey mark I day by your you come down here I better get lonely down your after a while then they have pretty much I don't nobody else will come down these free hey I've been a remembrance\nOf old friends of mine a gym and Denise ... they played your some years ago to remember\nThem I Do have you got any other recordings at all well\nI Do and uh let me\nLook around here I don't know what I did with it but it cheers show more yeah\nHere it is a a gym in the ... have you ever heard are you from ... that's\nA good old song it is and what they do it well I bet they do let's hear\nHello strangers\nBay and you\nDon't be revive the Iraq and I\nI Know Jack the jobs\nPlaying a mommy convene\nFiling man woman said to me\nThere ... man\nOn a more land up down me can be\nMan weather man of God in\nTell me how to\nAnd along the same argument from Alabama panicky or\nOn any like well that makes\nFrom the man well I'm I'm a man\nWay that you know even\nTo plan a lab the ah\nIs way down you know allow the ban\nOne lives are ... are they learning malware that down bound\nTrain that runs in the name\nThe other hand of God but\nTell me how do you\nOn on the line from Alabama Tennessee or can rely on anybody make two\nAre you from the name\nMe well I'm from Maine\nHow are you from the thing\nGlad I found big name\nOr that takes me back here and then you know what I noticed about while we were listening to that that could have been recorded in Nineteen thirty for its just got that great old time sound too doesn't it it did that Jim ... pick that guitar to what a good pick or he was he was a\nGreat musician and I I think guitar was probably the main instrument something I point out to my students\nThat are left handed Jim was left handed and he played everything right here in the play guitar banjo fiddle mandolin ... what else he played right handed even though he was left handed\nAnd I tell my students if he could play it you can play it so I Try to encourage my students to play right hand All right it works good and I was huge him as an example 'cause he was such a great pick your hand Denise bode yeah excellent ... well ... thank you very much refined or they're recording it means a lot to me you're\nWell come back we'll five so well All right I'll see\nYou next week All right in this next set of socks we'll explore music played by married couples\nGary and Roberta Gordon grew up on farms in southern Illinois they met at the age of fourteen married at Seventeen and I've been playing music together ever since with their music strongly influenced by folk and bluegrass they're still singing and writing songs together here's one of the originals sing with me\nRescue shed the humane\nSame thing\nTo get there we do know\nDid the same for me that\nThey said to you know\nWe\nBang bang bang bomb\nAgain do we do know\nThey think they know me relax you than than me daddy\nThey they they\nAgain do we do know\n... you may\n... ...\n[noise] an original songs sing with me by husband and wife duo\nGary and Roberta Gordon her next one comes from another musical couple the honeydew drops\nBased out of Baltimore, Maryland honey do drops continue a long line of husband and wife duo ... beautiful music together at work when cagey parish no reside in Baltimore but as strong connecting route to the music in their home state of Virginia let's listen to one of the original talks low like\nTangle can\nDream on\nMa no car\nI think that\nThe na\nNa\nNa\nNa na na\nDon't tell me\n... and\nMake you\nThe ...\nWe hear the\nOnly when you wrote down\nThe road dam\nThe way you know na na\nYour financial contribution right now it keeps it coming to you it's quick and easy to get online and H. P. P. R. dot org\nMm Mm\nMm\nThis is folk singer Michael Jonathan inviting you to tune into very special broadcast was reading one of the legacy record labels in America the historic Memphis labor they gave us Johnny Cash Elvis Presley Howlin' Wolf bb king Roy ... percent in so many more were celebrating\nSon record with music in conversation on this week's broadcast of the way the\nSaturday evening at\nTen o'clock central welcome back to Ozark caverns Radio Free now traditional folk musician writer and step to answer ... water always has something interesting and educational for us let's see what she has this week\n... knew I was a new one no one no one lives on the low forever more she'll be so ... do one thing we can get to all\nIn Reno one the one that is all over 'em or she'll be so ... what I was three ...\nThree in the driver's\nWhat Braves voted on bringing no\nOver Bush will be so prominent I was doing\nWhat the ancient cumulative counting song come in I Will send you\nSome nearby Newfoundland group great big see how many variants and other titles such as green grow their ashes though and an Ozark version called the twelve apostles\nCollected by many colleges including English folk songs scholar assessed all shark and Nineteen sixteen the biblical astronomical and pagan references are at times so garbled as a result of oral transmission that we are hard pressed to understand their original meanings related songs including the English Carol\nTwelve days at Christmas dating back to Seventeen eighty and African American spiritual children go where I send me both counting to twelve is well there's also a similar Hebrew son who knows one son yet many Jewish Passover Seder is here's the last first I've come in Iowa and you\n\nIn this segment we're looking at folk songs that use numbers either symbolically or as a game or both examples of songs that many of us know include children's in camp ... such\nAs reverse counting song Ninety nine bottles of beer on the wall this old man one to buckle my shoe and five little monkey jumping on the bad one in my personal favorites\nKentucky folk singer Jean Ritchie use the counting motif when she wrote the bluebirds dawn in the Nineteen fifties as a ... by for her young son the story is based on a lovely event that happened in jeans childhood\nWhen I was dreaming\nMe no grey soccer that's fun to me and my dad\n\nWhen I did not know the captain not there to do when\nYou eat a\nMind you know road John Reid yeah na na na ... read these various things really good at that never been to\nOther when I'm In three ... and ...\nCenturies old Irish song Spanish Lady at some by sisters Trina and may read knee gallon all bars accounting first from an even older song the wheel of fortune the numbers are thought to symbolize the fate of how our lives play out\n'cause I was walking through the [noise]\nAbout the\nBe do you think about\nWas ... when she do right now\nOver by a\nI mean money how 'bout that so\nShe had plenty for being\nTo any fix for\nThree and\nI Do despite its profound symbolism there's a sweet playfulness with this reverse counting chorus by even an odd creating a unique example of Irish lifting or mouth music here's the last part of the song\nWay of addressing\nChi twin and on the\nPenny\nThanks Aubrey I'd like to finish up our show with a few more family socks to go along with his ...\nYears ago I used to listen to a great song played a song by Randy ... sister Lisa Randy finally joined the army after a career in the military came home to Arkansas started a family with six children ranging from six to sixteen Randy and his wife now I have a pretty good family bad going right in their own home\nHere they are singing around by William ... from the first song book published in the United states the\n\nYeah\nHoney I\nUh\nUh\nGuess\nWe don't we\nDo a\n\nOh my God\n\nLow well\nHe died on me\nAnd a\nMan\n[noise]\nThat was the weedy family from Searcy county Arkansas singing a type of song called around when Jesus wept as a father who joined a short window of time playing music with my two sons I Would tell Randy we need to enjoy every minute that his kids are still at home and play with the family\nMegan Abigail vote hail from the little town of Erie, Kansas they've been turning the Midwest is twenty twelve pleasing audiences with their tight sister lea harmony here the vote sisters with the original song ivory angel\n\n...\nI mean the\nDrapes than in the ... ah\nKnow\n\nThe need for a small knife that home late so", "year": "2018", "show_name": "Ozark Highlands Radio", "city": "Dalhart", "day": "07"}