{"month": "10", "state": "GA", "station": "WUWG", "content": "Hoo listener supported gp radio an Eighteen stations service of Georgia Public broadcasting\nThe new book center supported G. P. B. radio an Eighteen station service of Georgia Public broadcasting thank you so much for spending a portion of your Saturday evening with just off the radar is next Iran G. P. B. [noise]\nI'm David Barbie hosted the sound of Athens where we showcase live performances from the stages of the music venues to Athens\nTime our broadcast theater performance by Tweedy recorded live at the Georgia theater on September Nineteen\nJoined us for the Santa bathrooms Sunday night at seven on Georgia Public broadcasting\n\nFrom the University of west Georgia quick with Ninety point seven FM W. W. J. N. W. W. G. H. B. Carol ... quarter but Georgia Public broadcasting radio network\n\n\nFrom W UGA in Athens, Georgia I'm just silver and this is just off the radar [noise]\nFollow my musical ... so much great musical today's program we hardly have time to tell you what's on offer but since we are contractually obliged you'll be tuning into new music from the legendary Richard Thompson as well as the soon to be legendary Richard swept\nWill dive into the new album from local heroes Marshall coast get caught up in the latest from the breeders by the throat backtrack from bikini kill as well as something for one of the worst reviewed albums in recent history all that and much more after we hear this from a proper DJ I beat drumming here but this week thing concept\nWhich comments from rock but then I saw those lawyers from Atlanta Georgia [noise] our area\nSex\nDrive from a very favorite Ari amount that was the live for a second guessing that's who did on ... ... ... ...\n[noise] sex drive\nFrom a very favorite Ari amalgam that was the live version of second guessing that's included on the multi ... that\nIs the new Ari BBC collection agencies the kind of eight and a one a DVD if you can stand it fantastic collection spent much of their catalog more details about that at our E. M. H. Q A dot com you haven't already got the word speaking of which are we got the word a little a little late side\nAbout the latest album from the breeders Mm\nMm\n[noise] Mm [noise]\n\n\n\nA city that are to all the luggage soldiers have got to see that banned during the recent stop in Georgia oh the breeders here are just off\nThe radar comes from their new ish record cold all nerves gimmick Kelly deal back in action by surprise by Kim Kim for the thing that we wake up and have a less than a ... program let's literally drop the needle on something brand new from\nThe pie lawn reenactments society\n\n\n\n\n\n\nNa na na na na\nNa na\nNa na na na na ...\nTheir parents you\nYou know ... how can I\nBe a\nMan\nAnd then\nIf she\nHadn't seen in a\nFrom the new album Thirteen rivers that was the lights\nFor the new album Thirteen rivers that what the legend is Richard Thompson who they are with the rattler what then he'll be down the variety play house was just there actually a lot of the first of December\nWe could ask Richard what it was like to play with Jimmy hendrix and the straight talk about her resume to say nothing of all the music he created with airport convention or should be a great show Richard Thompson dash music dot com for him and the record picks up here on the program this week throwback track and this time\nThat distinction goes to a none other than a bikini kill [noise]\nMm [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nOne half of a perfect the single that was bikini kill with our throwback track of the week here are just off the radar go I hate danger originally early back in Nineteen Ninety five now\nRecently released on vinyl on the bikini kill single collection of ... will be a lookout for the next time you're up their records shopping or you may or may not come across the notorious released\nFrom Greta Van fleet ...\nNa\n\n\n\n[noise]\nOh\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] Mm\nYou know if you just got John ... the the thing that\nNo one would have had a problem with it at all that was Greta Van\nFleet with a song called love her leave her from there now infamous album which received one of the worst reviews in recent music history but like we said on Twitter ... ... that had been released Nineteen Seventy five you probably would have had someone I pitch for calling it a law scholastic ah you of course can retweet any and\nAll opposing opinions at us as the other handle just off the radar living on right now though with something dramatically different this is the future law classic from Angelo the Augustine\nDo make\nI Am\n\n\nNa na\n\nNa trees a much to do with the phone call when the weekend comes around is going to be taking part in the looping battle ... ever seen before uh with the local artist PC boss she they're both part of a special but called human in the machine presented by our friends\nLooping battle I don't think it's ever see one of those before uh with the local arts key she ... she they're both part of a special event called humid in the machine\nPresented by our friends at ... that's the internationally\nRight now what ... music I bet that takes place each year up in\nDurham North Carolina it's sort of an offshoot show I've also got a feature damned Tony parts something\nVery heavy from author and punish ... plus a special presentation from Michael's type of our yam that's November third at the Georgia theater and it's completely free\nEven in the machine adopt mode fest dot com for more on that now so it was we don't run out of time here are just off the radar let's move straight on to something that was\nPut in our and just a couple of days ago\nBy marshmallow coast\n[noise] [noise]\n\n[noise]\nNew law\n[noise]\n\n\nPretty was Marshall coast here on that just off the radar with the title track to the new album called memory girl was at the very very find work Mr and he gets all is who you can catch lives down at the flickers theater in Athens, Georgia on Saturday October twenty Seventy is going to be taking part in the eight track\nGorilla twentieth anniversary celebration collision drive in church but the dying also in the house along with special screening of tracking the gorilla that two thousand in seven the documentary should be a lot of fun a which is exactly what we can say about this next track from Calvin Johnson\n... [noise]\n", "year": "2018", "show_name": "Athens 441", "city": "Carrollton", "day": "28"}