{"month": "10", "state": "GA", "station": "WUWG", "content": "Listener supported GB radio and Eighteen station service of Georgia Public broadcasting thank you so much for spending a portion of your Saturday evening with just off the radar because next year on gp be [noise]\nJust off the radar because next year on gp be [noise]\nI'm David Barbie to the sound of Athens where we showcase live performances from the day just the music they nice of Athens, Georgia this time our broadcast speakers your performance by all of them which is recorded at the ... club on April thirteenth them\nDonors for the sound about\nSunday night at seven oh one Georgia Public radio\n\nFrom the University of west Georgia quick with ... family W. W. J. N. W. W. P. H. D. Carol good quarterback at Georgia Public broadcasting radio network\nMm\n\nFrom W UGA in Athens, Georgia I'm just over ... is just off the radar [noise]\n\nAlright calling all alien life forms on this week's show our musical world wouldn't touch it down with a new music\nFrom the recently returned and now since I have taken sharing bonnet and we also celebrate the unveiling of a new album from the glam as well as a recently released collection around ... also throw in some new music from escapism and the mud honey\nBut first let's check out something that's looming up the smooth jazz jarred from the Death Valley girls\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\nBut Death Valley girls rubbing our engines on this week's just off the radar that was called street justice because her latest long player darkness rains\nTo speak you know the weather oh there's another song that record which they released a video for the teachers nothing more than the legendary ag pop eating a hamburger on camera for three and a half minutes\nOr ... valley girl dot ... dot com for more on that on the program or one of the loudest bans we've ever stood in front of that is much honey\nThe program one of the loudest bans we've ever stood in front of the ... is mud honey [noise]\nHow do you where the kick off track the album number can\nWhich is called digital garbage in the sun was oh yeah last track and the shortest track if I got that right a ban now celebrating three decades' worth of shredding eardrum is all around the world about the only time I saw this person was here in Aspen said at one point\nDuring the show a steep target jumped up and landed on some good part pedal in front\nOf him and my ears were right for the next twenty four hours or so at least a ... dot com it's a place to find out more about the album next step on the program a band that's completely new to us from Ohio is a DVD\nAnd\nDa\n\n\n\nUh\n[noise]\n\n\nThe last ... released by the late Richard slip that was a song called broken finger blew the name of the the record that it's taken from is the ... which is an secretly Canadian record so artist producer work with the normal range of arts and the black keys\nAnd will coach to name just a few can play something else from that that is just phenomenal\nRaise parts of the black keys will coach to name just a few could replace something else from a bat is just phenomenal album or they appear on that just off the radar system is the season let's drop the needle on the streets throwback truck by the ...\n[noise]\n\n[noise]\nAdditive\nBut let me\nAdd an editor and\n\nYou got it\nAdded editor that are that\n... and it it at at at at at at at at at\n\n\nAnd hang\n\n\n\nAdded a whole\n\nAnd right now at the Aspen seen a it's a job or a whole string of frightening films to see through the season including the fortieth anniversary of Halloween\nAs well as a screening of the fog of both by the master apart himself or John Carpenter the only person who's threatened to hang up on me in recent memory or tickets and ties for those and all the rest of the scary movies that after the ... dot com as we get scary things before that you heard from the mighty cramps\nFrom collection called the Ohio demos\nNineteen Seventy nine ... that's the second Ohio band on this week shows it turns out that was an early version of teenage werewolf which would\nLater wind up on their first full legs album I Wish I could have gotten to see them live um but unfortunately that wasn't the case or we won't make the same mistake however next month when this band comes to town I should say next but that's actually this but this is ... ... ... [noise]\n\n[noise]\nRound and round and round\n\nAll down town and the window\nFemale to learn how to\nThat and you can turn to\nDo\n\nThey are not\nMaking and\nI'm\n\n\nDa\nDa da\nDa da\n\nDa\n\n\n\n\n\n\n[noise] [noise]\n[noise]\nKids ...\nAnd not paying\nYou a little boy and isn't very chest pain\nKids you know\nI met him I'm sure um\nI go away and weighing in or oh\nI can disappear and ensure failures her ties and [noise] I agree the tree in my free paying ...\nEarly then I could turn my girl and she will lead the\nSilver she throws me eye candy evil\n\nTouched her crooked fingers in mine\nUh [noise]\nYou can be evil\nThoughts are crooked finger than mine\nUh\nI write to me lines of code without um um ... while I\nMake angels and the snow outside or\nHow\nTo handle\n[noise]\nThere's gravity may stop or maybe it makes me all over logging hello\nI'm orbiting your way throughout the day so\nMaybe there's or mental to Jay\nMy hard\n\nDrive and sure enough about the last month so so so big a deal\nUh [laughter]\nHeard in\nOn a lack\nBaby girl [noise]\n\nDarwin D's returning to the just off the radar playlist that was called the world's best kisser new record from the north Carolina native who now lives up there in the big apple is called ten song that happened when you left me with my stupid heart beat the\nAlbum title of the year uh this is out on the lucky number label and he'll be down at the masquerade down there the big eight feet on the fourth of November should be a good show which is what we can also say about this week's upcoming gig with Mr Johnny mar [noise]\n\n\n\n\nThey say some really\nScott ...\nMy ...\nBy\nAre you listening\nTo cross the fame to die [noise]\nMom said today I'll watch the parade\n\nTrade and [noise]\n[noise] [noise]\nGoing to die to imagine that it typically only tracing slash talking to make [noise] I\nOn a strike is is to get the full day not already\n[noise] I have a great name praised [noise]\nIsn't it interesting and made for a little town called sweet [noise] na na na\n\nHow are you doing man\nShot late\n... College of all all self\n... for Iran\nFaster than\n... also called ... ... [noise] for the around\nGoes down and\nSchool [noise]\n\n[laughter]\n\n[laughter]\n[laughter]", "show_name": "Athens 441", "year": "2018", "city": "Carrollton", "day": "14"}