{"month": "10", "state": "MA", "station": "WNCK", "content": "It'll be sunny for the tail end of the week on friday with temperatures a little bit milder reaching close to sixty by friday afternoon we may see some light rain showers moving through on Saturday That's your island forecast this is a meteorologist Russ Marley\nW. N. C. K. Nantucket\n[noise]\nTwo elementary schools still organized field trips for kids to go to see classical music concerts anymore and places where there are orchestras for them to see I remember being a kid\nGoing to see one I Wish I could say that I had faced this kind of thing regularly happens anymore\n[noise]\nBenjamin Britten wanted to open up the world in the Sunni orchestra for children and so he wrote this incredibly vivid captivating piece comb the young person's guide to the orchestra [noise] spawned a phrase the young person's guide to\nAnd let's listen to invest piece coming up this hour [noise]\nFor the young at heart you\n\nLive from NPR News in Washington I'm jak spear\nSecretary of state Mike palm peyote travels from Saudi Arabia to turkey as he pushes for a full investigation into the disappearance of a Saudi journalist turkey says ... was killed when he went to the Saudi constantly in Istanbul they'll do Saudis denied any knowledge of that or from NPR's Michele Kelemen\nSecretary Pompeo said he had a candid conversation in Saudi Arabia an end in every one of those meetings that Saudi leadership strongly denied any knowledge of what took place at they're constantly in its stand all\nHis statement says there's a serious commitment to determine all the facts and ensure accountability President Trump spoke by phone with the Saudi crown prince wild on day over there\nAnd came to the same conclusion writing on Twitter that Mohammed bin Salman\nTotally denied he knew what happened Trump goes further in an interview with the Associated Press saying he sees this as an attempt to declare the Saudis guilty until proven innocent\nMichele Kelemen NPR News Riyadh\nDemocrats have continued in even strengthen their financial advantage in the fight to control the house of representatives NPR's Peter Overby says the numbers tell the story and third quarter reports just filed at the federal election commission\nIn sixty two races that will determine the house majority Democrats have consistently and dramatically outraged Republicans last quarter the Democrats collected a hundred and forty million dollars to Republicans fifty one million\nA couple of specifics outside Austin, Texas Democrat and Jay Hagar raised one point nine million compared to not quite six hundred thousand for a long time Republican incumbent Jon Carter\nSome races are closer than that in Wisconsin districts it's been represented by house Speaker Paul Ryan Democrat Randy Bryce pulled in one point four million or Republican Brian style wasn't far behind it just over a million as for the polls the races are generally tighter\nPeter Overby NPR News Washington [noise]\nCuban diplomats and their supporters disrupting a un meeting called by the U.S to spotlight the islands treatment of political prisoners protesters loudly banging tables and traveling in Spanish Cuba yes us blockade no\nThe protesters grounded out us stepping in Bastrop Kelly curry senior Trump Administration officials with the secretary general of the American organization of American states above the noise in the U.S chamber was where protests by accredited diplomat to have a right to attend any open un meeting\nAlso shows deterioration of us Cuban relations out of the Trump Administration but when the restoration of ties with the island nation under then president bronco bomber in two thousand Fifteen\nNumber of help wanted ads went up in August Labor Department says job openings rosy tens of represent the seven point one for a million that's more than the six point two million people on the unemployment rolls last month\nOn Wall street a strong day the Dow jumped five hundred and forty seven points you're listening to NPR\nA federal judges approved a settlement between Tesla CEO Elon Musk and securities regulators over his infamous message on Twitter about taking the company private\nThe SEC to argue the message must posted was misleading harmed investors who bought stock in the electric car company the company letter announced it was not going private the SEC find mosque and the company a total of forty million dollars and settlement agreement allows him to hold onto a CEO post but he's given up his seat his company chairman for three years\nAnd NPR News investigation finds women in prison get discipline more than men for smaller infractions Here's NPR's Joseph Shapiro women get punished at higher rates often two to three times higher for those lesser and non violent violations of prison rules for things like in someone's disrespect for cursing or disobeying an officer\nNPR and the ... school of journalism at Northwestern university\nBeing an officer NPR and the ... school of journalism at Northwestern university analyzed data from Fifteen states and found punishments even for small infraction can I be consequences women go to solitary confinement they lose good combat credits that would reduce time in prison\nAnd they lose bone and visitation privileges that cuts off mother's from children more than half of women in prison or the mothers of children under the age of Eighteen\nJoseph Shapiro NPR News you attach daughters your by last week's failed watching emergency landing after problems with the Soviet liftoff says he knew we needed to remain calm\nUs air force colonel Mick Hagen she'll be caused by were on their way to the international space station but she'll use rocket failed their capital ripped away and that's designed plummeted earth both men are okay\nI'm jak spirit NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include life lock lifelike with Norton works to help protect identities and the information on devices from cyber criminals learn more at life locked dot com and the ... foundation at ... dot org\nPiano [noise] actually feel how are you doing I trust that you're doing All right I Know you can't answer so I'll just take it on fix that everything's going okay if it's not\nEven if it is you come to the right place for good music because I've got a piano sonata by most temperate fossil science coming up hearing about Eighteen minutes\n\nBenjamin Britain's music is on the way to and this is from ... blouse they I'm Brazilian composer for Nineteen thirty one to Nineteen Ninety three a country Chino for global and strings with Andreas Schiller playing the Colorado to Berlin\n\n\n\n\nMm\n[noise]\n\n\n\nMm\n\n\n\n\n\n[noise] but it's music buying Bernal blocks and music is concertina for mobile and strings there by ... ... ... with the camaraderie barrel check\nW. N. C. K. Nantucket\n\n\n[noise]\nNantucket NPR station eighty nine points fine W. N. T. K.\nI'm ... and really having a a banner evening here I'm seek seal which just skip the uh the niceties here and get back into music shall we irresponsible side ... church to be honest about three to ...\n...\n[laughter]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n[laughter]\n\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\nMm [noise]\n\n[noise]\n[noise]\n\n\n... [noise]\n[laughter] [laughter]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n[laughter]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [laughter]\n\n\n[laughter] ...\n\n[noise] [noise]\n[noise]\nHi this is Nantucket town manager let me get listen to a live audience I'm old cast of the Nantucket what it's like ... meeting this Wednesday at six pm here an eighty nine point five W. N. C. K now tickets NPR station\nThe young person's guide to the orchestra by Benjamin Britten came about when he wanted to introduce\nKids to the sound of the orchestra and and also the sections of an orchestra he runs a symphony orchestras do a complete kind of grand prix course ... tour of the country side with the tour in this case being all the sections the strings the brass the production\nAnd all of them coming together at the end the grounds to tea playing together the young person's guide to New York is trails and say I'm variations ... seen by early or\nEnglish composer ... Michael Stern here in Kansas City symphony music of Benjamin Britten mhm\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\nBoy\n\n\n[noise]\nMm\n[noise]\n\n\n\n\n[noise]\nIt'll be sunny for the tail end of the week on friday with temperatures a little bit milder reaching close to sixty by friday afternoon we may see some light rain showers moving through on Saturday That's your island forecast this was meteorologist Russ Marley\nW. N. C. K. Nantucket [noise]\n\nWouldn't want to enter with a nice bliss on like that and making an entry is very much what is this is about here welcome to the party and the ... of ... through this\n...\nThis music ... on science to capture them around shore\nFifteenth century courts of France and so you can be lowered or leaving [noise]\nMake your grand entrance listen to this music here are just a five minute supportive of Tuesday evening of good listening was Schubert Schumann minnow wrote them coming a stick around\n\nLive from NPR News in Washington I'm neuron President Trump is still standing by members of the Saudi ruling family as they continue to deny knowing anything about the suspected killing of Saudi dissident and legal us residential market ... NPR's Mara Liasson reports\nTrump told Fox News that if the Saudi ruling family knew about what happened to ... that would be bad but he also tweeted that he talked with the crown prince who quote totally denied any knowledge of what took place inside the Saudi consulate in Istanbul\nTrump tweeted that he had no financial interests in Saudi Arabia that may be true but in the past he's boasted about how much Saudi money comes to him in the U.S in twenty Fifteen he said of the Saudis quote they buy apartments for me they spent forty million Fifteen million am I supposed to dislike them I like them very much\nMeanwhile there are bipartisan calls in Congress for sanctions against Saudi Arabia Mara Liasson NPR News the White House\nAbout Ninety percent of all the immigrant children separated from their parents at the border have now been released from us custody but as NPR's John Burnett reports more than two hundred children remain in shelters\nThe office of refugee resettlement that oversees the government's youth shelters reports for two thousand three hundred and sixty three migrant children who were taken from their parents as part of the Trump administration's controversial zero tolerance policy have been released as of Monday\nOf the remaining two hundred and forty five kids still in shelters a majority of them are there because their parents were deported back to Central America\nThe American civil liberties union which successfully sued the government to reunify families says almost all the parents back in Central America had been contacted to find out if they want to be reunited with their children\nAnd ACLU attorney's just two thirds of those deported parents want their kids to remain in the U.S where there'll be safe from criminal gangs in food insecurity and their hometowns John Burnett NPR News\nDoctors at the Centers for Disease Control are tracking a rare disease that affects mainly children it's called acute flash at my latest and causes partial paralysis Dr Nancy ... says is affected more than one hundred people this year\nIn twenty Eighteen so far the CDC has received the port of one hundred and twenty seven patients under investigation PY each one state of sixty two cases have been concerned at the Aspen\nShe urges parents to seek medical treatment right away if their child develops a sudden weakness or a loss of muscle tone and the arms her legs she says she's frustrated doctors have been unable so far to identify the cause of the illness\nStocks closed higher today the Dow was up five hundred and forty seven points just over two percent the NASDAQ rose almost three percent and the essence he was up more than two percent\nThis is NPR News\nAnalyst say part of the reason for the games on Wall street today with some positive company earnings reports NPR's Jasmine Garsd reports on the digital streaming company Netflix\nNearly seven million people subscribe to Netflix just in the last few months that's according to the company's latest quarterly report it's streaming revenue grew to about four billion dollars\nNet flicks shares were up ... percent at market closed in continue to rise in after hours trading in the report Netflix predicts it will continue to growth for the rest of the year adding nearly ten million more subscribers in the fourth quarter Jasmine Garsd NPR News New York\nThe Labor Department reports that job openings in the U.S arose in August to the highest level since it began keeping that statistic in two thousand it says there were seven point one four million open jobs far more than the six point two million people who are looking for work that might\nThat suggest companies are finding it increasingly difficult to find qualified workers\nThe death toll continues to rise six days after hurricane Michael's slammed into the Florida Panhandle officials now say at least twenty six people died in Florida Georgia North Carolina and Virginia tens of thousands of homes and businesses are without power\nCanada is legalizing marijuana starting tomorrow it becomes the second country after your way to allow the recreational use of the drug it's already tomorrow in Newfoundland so sales are now legal their candidate has authorized the medical use of marijuana since two thousand one\nI'm neuron NPR News in Washington\nI'm doing wrong NPR News in Washington\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about rocket ... work in food health power jobs and resilient cities at rocks down out of work and Americans for the arts\nAnd\nI'm Steve seal thank you put you in again for good music or a Tuesday evening she works third on way planes from you know later on as well for more than ... and the orchestra\nAnd this is one of those pieces here next it's easier to enjoy that is to describe it going on\nThat's by the twentieth century French people is right now the next couple bomb Beatrice they stay which is to say it's kind of a tribute to not just the music also a much earlier century in France the sixteenth century\nGiven what he's referencing and the title but the um the grand balls ... era as well in the music that one might have heard\nIn those days it's a well known music the woman piece for wind ban and it's the hormone me on the twenty six year Stephen Richmond and almost ... by it right now\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\nNah nah the\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise] [noise] uh\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n... I'll be a truce they stay the music of ... played there by the hormone eat on so much Steve enrichment W. N. C. K. Nantucket\n\n\nMhm\n\n\nNantucket NPR station eighty nine points fine W. N. T. K.\nR. music instead supported this evening by progressive insurance committed to offering a streamline shopping experience where home in auto can be bundled together now that's progressive\nLearn more progressive dot com or one eight hundred progressive to music from Schumer dance promise to your symphony number three this evening played by the Vienna Monica Carlos Liberia can [noise]\n\n[noise] [noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\nThe ... the number three my friend she works was Carlos\nThe ... number three my friend she works with Carlos labor and the ...\n...\n\nHi this is kind of job right and I like to join me for the artists association of Nantucket our talk each weekday morning at nine and six during MORNING EDITION here in eighty nine twenty five ... at the end see Cate Nantucket NPR station\nActually seal is always good to have you gone for good music in the evening hours Nino wrote to its best known for his film scores such as the godfather you read about a hundred and fifty movie scores but he also wrote about the same number of concert works in the ... one of those touchstone do on\nA work some title ... for corn and we're ... we don't ... the horn here with mark she'll come the virtual ... county\n\n\n\n\n[noise]\n\n\n\n\n\nThe tail end of the week on friday with temperatures a little bit milder reaching close to sixty by friday afternoon we may see some light rain showers moving through on Saturday That's your island forecast this is a meteorologist Russ Marley W. N. C. K. Nantucket\nAt first Tchaikovsky said he couldn't write this piece\nPrimary patron is met him before [noise]\nRequested a piano trio he actually said that the classic format [noise] piano violin and show was barrel [noise] my\nSpring geniuses can have unusual opinions and that certainly was one of them from a very junior [noise]\nEventually came around [noise]\nBroke this which would be the only time it would rise to the gym or music or the trio so at least he was the piano trio on a minor [noise] it was John Edwards from Chicago street view [noise] main work coming just ahead tonight [noise]\nLive from NPR News in Washington I'm neuron secretary of state Mike Pompeo traveled from Saudi Arabia to turkey shortly as he pushes for a full investigation into the disappearance of a Saudi journalist\nTurkey says ... she was killed when he went to the Saudi consulate in Istanbul the Saudis denied any knowledge of that NPR's Michel telling that has more\nSecretary Pompeo said he had a candid conversation in Saudi Arabia an end in every one of those meetings that Saudi leadership strongly denied any knowledge of what took place at their consulate in Istanbul his statement says there's a serious commitment to determine all the facts and ensure accountability\nPresident Trump spoke by phone with the Saudi crown prince while San Pedro was there\nAnd came to the same conclusion writing on Twitter that Mohammed bin Salman totally denied he knew what happened Trump goes further in an interview with the Associated Press saying he sees this as an attempt to declare the Saudis guilty until proven innocent\nMichele ... NPR News Riyadh\nSixteen people are now confirmed dead in Florida in the aftermath of hurricane Michael it was the strongest storm to hit the region and fifty years NPR's Greg Allen reports taller than the ... are in Bay county\nBay county in Florida's panhandle is where hurricane Michael made landfall with a sizable storm surge in one hundred and fifty five mile per hour winds\nSome of the worst destruction is in Mexico beach or search and rescue teams have been combing through such destroyed homes with help of dogs and listening here that have been reported to Mexico beach it's not clear yet how many Florida emergency operations center says twelve debts and big ... plus one death the ... Gulf county had been confirmed by medical examiner's\nUnder state law medical examiner's responsible for confirming attributing Des occurring and their counties\nThat's when the storm of all been confirmed gaps in county ... county there also deaths from hurricane Michael reported outside of Florida in Virginia Georgia in North Carolina ... NPR News\nThe chairman of the joint chiefs of staff General Joseph Dunford says that although terrorist attacks have declined in number and severity in recent years the world must not become complacent we know from\nPrevious experience that when you relieve relieve pressure from the thread\nSo they will take the ability to reconstitute and so the key to success is to continue to provide pressure even if that pressure is a different kind of pressure we met on hold and as much ground and they're operating in a more decentralized matter that doesn't really most of the responsibility to to relieve pressure\nHe says groups such as al ... and the Islamic state group are adapting using the Internet to inspire attacks from remote locations\nUkrainian fighter jet crashed in western Ukraine Tuesday military officials say both pilots on board were killed including one from the U.S the jet was taking part in a joint exercise with us and other NATO air forces this is NPR News\nEuropean Union countries are meeting in Luxembourg Wednesday without an agreement and how Britain will leave the block it's scheduled to depart march twenty nine\nA major issue is how hard or poor as the Irish border should be a new council president Donald Tusk is urging British prime minister Theresa May to think like a free spirit and come up with something creative to solve the impasse\nIn Nevada brothel owner reality TV star and aspiring politician Dennis Hopper has died NPR's Leila Fadel reports his death came as he was seeking a seat in the state legislature\nHalf died at the law French one of his several brothels in Nevada\nThey Seventy two year old was best known as a showman famous for a late night reality TV show that if legal prostitution business that used to err on HBO in a recent interview with NPR health described to lay people spoke about him in the most populous town in the district where he was running for state office\nGet us off as the Trump throw [noise]\nHe's famous he's got nerves to steal your legs girls\nIn recent months he caused an uproar that got national attention when he beat a three term Republican state lawmaker in local primaries and appeared poised to win a seat in the Nevada state legislature and the funding NPR News Las Vegas\nSome major financial and health care companies issued strong earnings report Tuesday that sent stock prices soaring that that was up five hundred and forty seven points just over two percent the NASDAQ was up almost three percent I'm neuron NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast\nOffering artistic draws including St Pete's Dali museum pitcher who collection and the museum of fine arts more er visits saint Pete Clearwater dot com elder\n[noise] it's good to have you tuned in\nFor good listening here on this Tuesday evening checkups cues piano trio was coming up with a trio so we see this is David ten and bomb with a very short subjects your first from Harrison\n\n\n\nIn ...\n\n\n\n\n\n\n\n\n\nMm Mm Mm\n\n\n\nMm Mm\nMm\nMm Mm Mm Mm Mm\n\n[noise] loop Harrison music Syrian aid for Frank Rickles worse way there by David ...\nTonight's classical music is supported by beard a financial partner guiding families businesses communities in other institutions since Nineteen Ninety or to be a bigger dot com shows more information [noise]\n\n\n\n\nI\nThis is eighty nine point five W. N. C. K. Nantucket Nantucket tone for NPR News in classical music online at Nantucket NPR dot org\n\n... von ... was ... primary patronage throughout his life and it's thanks to\nHer commissions are financial support me in so many ... works but when she asked him for a piano trio work for the classical wind up of piano violin and cello [noise]\n\nMm\n\n\nMm\nMm\nMm [noise] Mm\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise] Mm [noise] Mm\nMm Mm\nMm\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\nMhm mhm mhm mhm mhm\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise] [laughter] [noise] [noise]\nMm Mm\nMm Mm\nMm [noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\nMm\n\nMm [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\nMm\nMm\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise] [noise] Mm [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\nMm [noise]\nMm\nMm\n[noise]\n\n\n[noise]\nThat Dan\n\n[noise]\n\nThen just to get even more pain\n[noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise] [noise]\n\n\n\n[noise]\n[noise]\n", "year": "2018", "show_name": "Classical 24", "city": "Nantucket", "day": "17"}