{"month": "10", "state": "MA", "station": "WNCK", "content": "Eighty nine point five W. N. C. K. from just go\nTo medicate and around the world but then talking NPR dot org men talk it's local NPR station is eighty nine point five W. N. C. get\n\nOn the way this hour [noise]\nThe last completed symphonic work by an unbroken there\nI read a description that said ... symphonies one of the great musical torso\nWhen it does unfinished works that still lacking\nA limb or two we'll hear the does show that unfinished symphony humbling\n\nLive from NPR News in Washington I'm Janine hurt both sides of the political aisle or looking ahead to mid term elections fired up by the confirmation of Brett Kavanaugh to the Supreme Court\nSenate majority leader Mitch McConnell says the confirmation won't irreparably damaged the Senate chamber instead he says it's a shining moment for the ... he says he's proud of his Senate colleagues or the ...\nThe regulations\nWe've got me economy booming\nAnd we're making the long term\nWe've got me economy a booming\nAnd we're making long term damage changes in accord so will serve a new generation of Americans are very good what\nSpeaking on Fox News Sunday meanwhile in Delaware some people opposed to Kavanaugh's confirmation gather together today to voice their concerns Sarah Mueller from Delaware public media has more\nPurchase attended a small rally in Wilmington she's a descendent of those are not pay Indian tribe in Delaware purchased says she's concerned Kevin our rule in favor of businesses upper protecting the rights of indigenous people\nHe will vote for anything that protects international corporations it's what his track record set\nProjects that the lawsuit currently pending before the Supreme Court involving Alaska Native people could have implications for travel members in Delaware the case could place federally protected land under state control for NPR News I'm Sarah Mueller in Dover, Delaware\nIn Brazil afraid of far right politician one a commanding lead in today's presidential elections but retired army captain ... narrow failed to secure an outright victory which means he'll face his leftist opponent Fernando ... died in a runoff election October twenty eight he\nElection is opening divisions in the country between those angry about all scenarios massage innocent racist comments and those who like his comments on combating crime and corruption\nIn upstate New York twenty people died when a limousine barrel down a road running through an intersection and crashing into an on occupied SUV it's not clear how fast the two thousand one Ford Expedition limo was going Eighteen of the dead were in the limo the other two were pedestrians\nIt happened in front of a busy country store and cafe the NTSB says it's the deadliest accident in the country in nine years it is investigating\nFlorida's governor Rick Scott has declared a state of emergency and more than two dozen counties ahead of tropical storm Michael which is expected to turn into a hurricane late Monday or early Tuesday\nToday is a time to get a plan do not put it off there isn't any reason not to be prepared to keep your family safe\nThe governor also activated five hundred National Guard troops and warned residents that the storm surge could affect areas of the state that art and the storms direct path\nThe national Hurricane Center says right now the storm has maximum sustained winds of sixty miles an hour and it's about one hundred forty miles from the western tip of Cuba the storm could be a category to sort of the time it reaches the Gulf you're listening to NPR News\nIn Haiti rescue crews and civilians were digging through the rubble looking for survivors of last night's five point nine magnitude earthquake that hit the northern part of the country when a strong five point to magnitude aftershock hit the same area\nAt least twelve people are dead more than one hundred or injured the country's president said today he will make sure proper systems are in place to help the victims but Haiti is still recovering from the twenty ten earthquake that killed at least two hundred and twenty thousand people and destroyed much of the capital city\nThirty seven year old woman in Ireland has died of cervical cancer after the U.S company quest diagnostics botched to smear test from Dublin Joseph around has more\nI'm a victim who now made headlines earlier this year after her emotional interview on the national broadcaster ARD TV I Know I'm\nGoing to spend I don't even know if\nThe mother of five criticized prime minister lever editor for failing to protect the hundreds of women affected by encourage smear tests\nThe government had outsourced thousands of cancer checks as part of its privatization program the equivalent of received her terminal diagnosis in may and settled with quest diagnostics for more than eight million dollars she passed away Sunday Morning\nFor NPR News I'm Joseph for an end up one\nAt the weekend box office the comic book movie that I took the top spot shrugging off bad reviews and shattering box office record with an eighty million dollar debut in second place with forty one million dollars and estimated ticket sales Warner Brothers movie stars born\nWith the directorial debut of Bradley Cooper I'm Janine hurts NPR News\nSupport for NPR comes from the ... e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at H. E. C. S. dot org and listen to like you who donate to this NPR station\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n...\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\nYou're the Minnesota or their conduct by ... ... from every night by an ...\nComing up and just a moment we'll hear from four challenge\nThis is eighty nine point five W. N. C. K. Nantucket\n[laughter]\n[laughter] [laughter]\n\n[noise] [laughter] [noise]\n[noise] [noise] [laughter]\n\nHi this is Jean Miller from the community foundation for Nantucket inviting you to listen to eighty nine point five W. N. C. K. Nantucket NPR station W. N. C. K. Nantucket source for NPR News MORNING EDITION all things considered and in order to select men's meeting log onto Nantucket NPR dot org\nFor more information and tune into Nantucket NPR station eighty nine point five W. N. C. K.\nClaire Bryant some toward his daughter Caitlin solving humdrum buried before cellist in this piece by gene tonia when it's cold\n\n[noise]\n\n\nNa\nNa\nNa\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\nI mean they're all just Paul Janice eighty nine point five W. N. C. K.\nThe great American song book with your host Jon Benet assistant Sunday mornings at nine and six hundred eighty nine point five W. N. C. K. mental\n[noise]\n\nPens on a Dale ... Spain for just a couple of years in Eighteen seventies [noise]\nIn Eighteen Ninety [noise]\nAnd some of them died he died in January and who Cheney wrote this piece just a few weeks later in February\nChrysanthemum by the way the traditional flour\nGrief in mourning in Italy\nSpace chrysanthemums sniper teeny on the way with a ... string quartet [noise]\n\nLive from NPR News in Washington I'm Jim lock\nA limousine loaded with revelers bound for our thirtieth birthday celebration crashed outside a store in upstate New York killing all Eighteen people in a limo and to pedestrians National Transportation Safety Board chairman Robert Sumwalt called it the biggest us transportation accidents in two thousand nine NTSB\nIs very concerned about about safety on our roadways and are we are here the fact that the NTSB as here indicates that we're very concerned about this um you asked about the magnitude of this twenty fatalities is just\nHorrific I've been on the board for for twelve years and uh this is one of the biggest losses wife loss of lives and we've seen a in a long long time\nThe vehicle involved in the accident was an after market stretch limousine which often don't have safety measures including side impact airbags reinforce roll over production bars and accessible emergency exits\nPeople opposed to Brett Kavanaugh's confirmation to the U.S Supreme Court gathered in Delaware Sunday ... Miller from Delaware public media says one group is worried about possible biased toward corporations\nAnd purchase attended the small rally in Wilmington she's a defendant does not pay Indian tribe in Delaware purchased that she's concerned Kevin our ruled in favor of businesses for protecting the rights of indigenous people\nHe will vote for anything that protects international corporations it's what his track record set\nPurchased that the last few currently pending before the Supreme Court involving Alaska Native people could have implications for travel members in Delaware the case could place federally protected land under state control for NPR News I'm Sarah Mueller in Dover, Delaware\nRomania is attempt to ban same sex marriage in its constitution has failed after a poor turn out by voters in a two day referendum as Joanna Kakissis reports from ... arrest the powerful Romanian Orthodox church it back to change\nTheir meaning orthodox priest Sunday services urged voters to support that change which would define\nMarriage as between a man and a woman in the constitution\nMarriage is now a defined as between spouses\nRetired engineer Mario ... to ... cited the church when he insisted spouses cannot be of the same sex I don't like\nMentally as men and women who was the woman he voted for the constitutional change but hardly anyone else showed up to vote in his precinct there's not much you didn't see ... percent nearly fifty million dollars with a taxpayer money on this referendum he says and in the end it didn't matter\nFor NPR News I'm Joanna Kakissis in ... Romania\nBrazil's presidential election will be decided in a runoff between right winger ... narrowing leftist Fernando ... run off between the two top vote getters is required when no candidate wins a majority vote will be held October twenty eight this is NPR News\n[noise] leading experts in climate science conclude that new technology another untested methods are needed to take greenhouse gases out of the atmosphere NPR's Christopher Joyce says the technology is you have to be invented\nThe scientists were asked if it's possible to keep the planet from warming more than about two and a half degrees Fahrenheit above pre industrial temperatures that's a red line for dangerous effects on the climate\nThey conclude that current pledges by governments to simply limit emissions of greenhouse gases are not enough to stay below that line what's needed are new and potentially expensive technologies to extract those gases from the atmosphere as well as the vast new forests to soak up carbon dioxide from the air\nThe report is from the inter governmental panel on climate change scientific group that advises the United nations Christopher Joyce NPR News\nSecretary of state Mike Pompeo said that he had North Korean leader Kim Jong moon made unspecified progress Sunday toward an agreement for the nurse to give up its nuclear weapons there was no immediate indication whether Pompeo had managed to arrange a second summit between Kim and President Trump\nForecasters say tropical storm Michael has gotten a little stronger and is next expected to dump heavy rains over western Cuba before it makes its way toward the U.S Gulf Coast\nNational Hurricane center in Miami says Michael is packing top sustained winds of sixty miles an hour and is about one hundred forty miles southwest of the western tip of Cuba\nStorm is currently headed north at five miles an hour and could become a hurricane in the next few days your mark NPR News in Washington\nSupport for NPR comes from a dream wave maker of luxury massage chairs from Japan with Shiites you point detection and sixteen programmed massages including warning night and stretch sessions retailers nationwide more dream wave chair dot com Andy ... foundation\n\n[noise] Hi I'm ... I'm Glad to be here and I'm Glad you're here as well later this hour a look in the mirror in the mirror\nIn the mirror by our parents here pled at Letterman's in because with a ... mirror in the mirror make now it's the light texting quartet with consent Amy chrysanthemums by ...\n\n[noise]\n[noise]\n\n[noise]\nUm\n\n\n\nMm [noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\nMm\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise] movement a symphony number nine by Beethoven we hurts I'm In rental and the Berlin Philharmonic amass by Maurice doors like is coming up next mhm Mm\n\n\n[noise]\n\n\n\nThis is an because back from housing Nantucket thank you for supporting the island and listening to Nantucket NPR station eighty nine point five W. N. T. K. F. and\nWho you know the mass by Maurice ... sounds whereas here my voice is mentioning any skiing\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\nMm Mm\n\nMm oh\n\nOh oh [noise]\n\n[noise]\n\n\nMm [noise] ooh\n[noise]\n[noise] [noise]\nAnd\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\nMhm\n[noise]\n\n[noise]\n\n\nYou know mass primaries real slang you heard the voice of tension any skiing\n\n\nStory um miraculous element their brain scientists common mirror neurons challenge you face some part of your brain fires\nBut part of your brain players even if you watch me me say this is essentially what enables us to your empathy feel scared for someone else to do a smile on your belly laugh I\nMean I don't think like in a mirror in the same way you can hear this piece seemingly Mir Mir music", "year": "2018", "show_name": "Classical 24", "city": "Nantucket", "day": "08"}