{"month": "10", "state": "NH", "station": "WEVN", "content": "WABC Gore I'm One of seven point one\nW E v J Jackson Ninety nine point five W\nE v a cobra Ninety going through and W. E. B. Q. Littleton Ninety One point nine and online at an age\nWe our daughter word from New Hampshire Public radio when Peter below and this is the weekly New Hampshire news round up on the exchange\nThe two major party candidates in the race for New Hampshire is first congressional district respectfully disagree in their first debate residents gathered for a meeting on the controversial seacoast reliability project and two more bears are shot and killed after officials worried that can cause major traffic problems\nListeners you can call into the exchange and one eight hundred eight million to six four seven seven that's one eight hundred eight nine to an age PR\nYou can also send an email to exchange at\nAn age P. R. dot org or post on our Facebook page at an age PR exchange it's all one word there and\nWe're also streaming live video of this radio show so it is very easy to listen and watch\nCheck out the stream and our Facebook page and H. P. R. exchange and here to talk about the week's news an answer your questions are ... civic scholar in the school of arts and sciences at S. N. H. U. N. H. P. R. Lauren children and Kevin ... of the union leader thank you very much everybody for being here thanks for having me editor\nSo again listeners the number for you to call to join the conversation one eight hundred eight nine to six four seven seven we're going to start today talking about the debate between Democrat Chris Pappas and Republican Eddie Edwards so give us a call now if you'd like to weigh in on how they did\nWhen it hundred eight nine to six four seven seven so those two major party candidates met at an HP are this week to talk about where they stand\nOn the issues ahead of the midterms less than a month away one issue that came to the fore was Social Security or will start their Edward Said that it would be wise to quote weaned people off Social Security and Democrats leader pounced on that uh learn what exactly was Edward saying about Social Security\nYeah so actually because this has now become like the topic of the week between two camps\nSo let's listen to that yet\nWhen government makes promises has to fulfill the promises\nA senior should not be a um threatened or or concerned about their senior years when they're there to enjoy their life\nAnd I think we have a responsibility to make sure that we stabilize Social Security but moving forward we have to look at the way to start wing peeping off Social Security as well in the future\nBut uh right now we have to secure a Social Security because we made a promise to our senior so we have a a stand up and live up to that promise\nSo we bought meaning people off Social Security and she found her and I'm Talking about the future generations uh you know I I Believe that people should have more control over their own lives uh but right now to Social Security program as we understand that we have to secure that program so that makes sure the seniors are taking care of as we promised\nSo I think what he's what it sounds like you say yes he did say when people off of security I think he was trying to make a distinction between maybe in the future looking at that program differently\nUm but regardless he did say when people off their security and said the ... campaign jumped on that so quickly made a digital ad they've been like blowing up our inboxes ever since\nAnd then later you know the Edwards campaign came back and said that it's a smear campaign from the habits campaign and so it was you know you and I talk about this yesterday Peter that that that lander can headline of the day was that they respectfully disagree then they did they were there to very nice guys they were\nVery respectful and their disagreements but I'm Wondering if now we've kind of taken a turn and that the heat is on and that may be in the next debate we will see a little bit more fire between the two of\nThem Kevin yeah that's a really good point Loren and of course the next debate um this coming Thursday will be before the A. R. P. um so you can be sure Social Security around we'll be right back on the front burner it's not an issue that\nEdwards talks a lot about during the primary didn't really come up a lot uh it's\nUh the problem that conservative Republicans have would this discussion about privatization of Social Security in the future and the other words giving younger workers the ability to have freedom to craft their own retirement income sources is\nThey don't ever present echoing this I mean George W. Bush to back in two thousand is the last president to try and put his tone in the water and try and make day this is your work incidentally it was hurtful to Republican members of Congress think candidates for Congress\nIn the midterm and two thousand and two and I think Edwards is going to find the same problem get outta\nThere is an old saying in American politics that Social Security reform is the third rail of American electoral politics and you mentioned George W. Bush or after he was reelected in in two thousand and four\nReporters asked him how he was going to spend his political capital from being re elected and he said Social Security reform and they basically went nowhere and I think a a ... and the debate said it's a foundational program for now that's the reality it was interesting you can kind of get their\nTheir different perspectives on the issue of the Social Security cap raising the cap on taxes that you contribute for Social Security pappas I think said he supported possibly raising the cap\nA a a Edwards really said it had an interesting phrase that you know that that increasing taxes is almost a form of punishment and so there's some stark differences there on on on that program but also more broadly the role of government and providing\nServices or social safety net or what have you mean Edwards\nSpelled out a very conservative a notion of the role of a government in society um now we are libertarian state but that also is a swing district and it left me wondering\nYou know ... ... and beyond sort of a kind of a of values appeal how he's going to try to win over some of those independent voters that don't need to to win that district given how uh\nThe in the agenda that he laid out the allure and I was curious were were there any issues or points to these candidates made that kind of strayed from their parties learn [noise]\nUm [noise] the party line I I don't I don't know I mean it's it's such a weird time with party politics right now where I think that both parties are kind of in an ex essential crisis so to speak so\nI I think you know if you're a Democrat but you are more left leaning Democrat you kinda want Chris Pappas the more progressive on healthcare so to speak you want him to say I'm all for Medicare for all but that's not him he said universal healthcare which is kind of like a straddling of the two\nBut but I think to me um where we saw like I guess a partisan split or a\nI don't know that something that highlighted kind of like the divisiveness in our country right now is the way they talked about the quote unquote historic nature of if either of them when I'm I was really struck by the way that both of them talked about\nYou know if Edwards would be elected he would be the first black congressman from New Hampshire if Chris Pappas was elected he be the first openly gay Congress person from New Hampshire and so you know that's something that's like the go to headline for national stories about this race and yet neither of them really seem to care that much about it especially Edward so first\nLet's START I have some tape of this a first when I asked him outright Eddie Edwards who has this kind of resonated for you at all and he said no\nI think the ... the notion that we start to believe that we're special because of our\nSuch orientation or race or gender or we do a disservice to every born in this country you're not special [laughter] I'm not special because I'm black\nChristmas special because he's gay you're not supposed to 'cause you're a woman were special because what we get back to our our communities our nation and our families and that's what's defined 'cause that's what makes a special the fact that we go down this road of identity politics and we constantly trying to divide us\nUp into categories and believing that we have to protect one group of Americans will for another ... demonizing one group over another or promoting one group over another\nUh I I think it's time we get back to respecting all Americans\nSo you know my question was not in an attempt to be divisive in any way I can say that I I I think Mike I was just trying to get at this larger point that\nThat we're in this moment right now where both of you would have this historic pedal what do you think about it and then we move into this conversation of all lives matter versus black lives matter from Edwards and then on the flip side from pappas we hear when I ask him the same question that you know would this be meaningful to you here's what he said\nYou know it's a meaningful to me but I truly believe that\nWe're all in this together and that by telling your own story um you can ensure that other people are accepted or in their communities and can live their truth and pursue a healthy and successful life and I think that's what it's about at the end of the day about making sure that\nAre communities that feel marginalized um are brought into um the mainstream society and are able to participate in our democracy and are able to succeed in our economy\nAnd I think there are still individuals in our state who are feeling marginalized so if there's a member of the ... community out there who's questioning their place in our state are you know maybe the sense of really strong positive message to them\nSo yeah so then this ended up being an answer about your visibility of diverse candidate so I I thought that was a really fascinating changing\nIt was really interesting to me you know when I when the question was posed ... from what I've heard from\nEdwards before expected him to answer it exactly as he did but it didn't matter to him and he would make a a broader point about a special interest then but I Do think that box Chris Pappas in a little bit I don't think Bob is on a different set of circumstances would have said it doesn't matter to him personally and he did come back around at the end to his more typical answer about marginalized\nNomination for Neil Gorsuch and help bring that over the finish line she's been rumored to be and everyone from uh the next us the next attorney general Jeff Sessions gets ... to\n... uh the UN and back through this past week her name is popped up as well with Nikki Haley announcing that she's leaving uh we we certainly anticipate Ayotte's going to be involved\nAnd I think there's a sense among national Republicans that she was a rising star the loss caught everybody by surprise you know and they want to kind of get her back on that trajectory they don't feel like her political capitals completely\nDiminished at this point and you know you you think about Gene Gene seat right she lost to to send you a new and then came back and took the seat so it's not unusual for somebody to come back in and take us or even a a a cow Shea Porter in and out so you you never know\nOh All right well this is the weekly New Hampshire news round up on the exchange on H. P. R. what did they can ... learn children for joining us as part of the show thanks Lauren really appreciate in Iraq\nOr listeners coming up a group of New Hampshire legislators and renewable energy advocates issued their response to the governor's ten year energy strategy and HBO is Annie Ropeik will join us after the break for that conversation you can give us a call now and tell us what you think what do you think the governor's ten year plan or this new response to it the number is one eight hundred\nEight nine to six four seven seven email exchange at an H. P. R. dot org or post on our Facebook page at an HBO exchange which is where you can watch a live video of this radio program this is the weekly New Hampshire news round up Peter yellow we'll be right back\nIt's nine Nineteen you're listening to the exchange on N. H. P. R. NPR's popular current affairs program one day is coming to New Hampshire this month hosts\nAll of them don't miss your chance to see Johnson in person as well as an HBO Peter below at the Capitol Center for the arts in ... on October the team tickets at C. C. A. M. H. dot com\nSupport for an HP are comes from you our listeners and from Massachusetts General hospital using research to develop treatments for complex conditions all to help their patients get back to their lives Mass General revolutionizing care\nAnd New England college proud to host the ... series ten K. trail race on Saturday October twentieth\nAll proceeds to ... go to charity learn more at any seat dot edu slash community I'm ... food co-op with a reminder the shopping at the co op for healthy locally sourced products is like a vote to support local farmers and membership is not required conquered food co-op dot co-op\nThis is the weekly New Hampshire news round up on the exchange on an H ... n Peter below here in the studio with ... civic scholar in the school of arts and sciences at S. innate you an author of the website and age political capital Kevin ... of the union leader and joining us for this part of the show is an HP ours ... Hi Peter\nSo listeners give us a call if you have questions or comments about the week's news we're going to be talking about the seacoast reliability project in just a little bit so please do call now about that to get in the queue we'd love to bring your voice into the conversation what do you think of the project one eight hundred\nEight nine to six four seven seven but first we're gonna talk about\nThe response to the governor's ten year energy strategy cars and you reported on this week a group of New Hampshire legislators and renewable energy advocates\nUh they issued this response to the governor's plan and before we get to the response can you tell us briefly about what the governors ten year plan was\nYeah so they came out in April it's out of the governors ten year energy strategy for the state it basically calls for an all of the above energy strategy that puts rates first that's kind of a tagline and so this is about a fewer subsidies and incentives for renewables it's about allowing renewables to compete on what they describe as a level playing field with fossil fuels\nAh it also says you know if the state wants to meet rising demand and keep costs down it's going to need more pipelines and infrastructure we're going to keep Seabrook nuclear power plant open\nA and also that uh you know we we shouldn't be sort of picking favorites among energy sources and so a lot of renewable energy advocates saw that as kind of a lackluster support for for their side of things\nAnd so to bring their side up to the the forefront they've issued this response\nYeah that's right so many months later they've been working on this they say all on a volunteer basis kind of on their own time it it does show in the paper it seems like a very sort of homegrown type of thing which is always interesting to see so this is most of the house Democrats that are on the science technology and energy committee\nAnd then it was some advocates from like the solar industry hydro I'm a lobbyist for liberty utilities actually wrote a section about transportation all deliberate he says they do not have an official position on this plan which is not friendly to natural gas\nOn end this plan is is a big\nA roadmap to big renewable energy development it says that\nAh you know there are realistic steps that state could take sort of\nQuick and and big but realistic steps to uh seeing a hundred percent of our electricity powered by renewable sources by twenty forty ... and there's actually spell out all those steps it does yeah I mean each of the advocates wrote a little section they have they've pulled a ton of data from the state they did a lot of work that I miss\nHer learners you can't see so there's this big this binder stay and he has it in front of her and by the looks of just flipping through it there's a lot of small fond single space Texan so seems pretty detailed they have a lot of\nHas a lot of a pen to seize a and so they really say you know if we worked hard and and if you looked at this really seriously and had detailed policies that support renewable energy we could make this happen and they say there's environmental and\nSupport for an HP our live stream comes from you our listeners and from radiation energy a local employee owned company helping thousands of granite staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nThat bill was veto by the governor narrowly not overturned by the legislature amid the whole bio mass fight biomass is part of this plan incidentally which you know is not something all environmentalists are going to love\nA and so it was higher power another thing that is you know not universally popular among the renewable energy set but um it's sort of renewable energy version of an Olympic above approach a and it says we want to you know fossil fuels ASAP they're going to propose a carbon pricing schemes and the legislature next year\nOr want to support the federal effort to do that\nAnd um and they hope that you know the recent un climate report that was so dire in his you know really cast a pall over a lot of environmental discussions this week they hope that might sway some Republicans to their cars they hope there'll be more Democrats in the legislature next year who will vote for these bills and they hope they might be able to find some compromise with\nThe ... to administer Haitian though remains to be seen if the other side is willing on that front ... and and one of the the representatives sort of leading the charge on this is representative ... who says the state should not wait to start tackling climate change\nWe all know that this document shows us a path forward with good news we know that causes and we have the solutions both\nIn terms of policies and technologies\nSo dean what do you make of all this was fascinating to me you know I think in part it's because\nWe've had a Democratic governors for most of the last Twenty years and we haven't really is a state experienced the kind of whiplash that you often see and environmental policy when you have frequent changes between Republican ideology democratic ideology and so for the first time in a while we're experiencing kind of the sort of the paying ... over the renewables versus\nOther types of sources you know the Trump Administration and\nYou know Trump has been very high profile by focusing on coal not that we are going to have a lot of coal here but just this idea of more traditional sources are or at a minimum increasing pipeline infrastructure but we've seen in practice how difficult it is on both sides getting the wind project up and running a natural took almost a decade\nUh on the other hand these pipelines are increasingly just run into tremendous local opposition in different communities regardless of what part of the state we're talking about so it's a it's a it's a very difficult issue it's typically\nNot one that is at the top of most voters lists although there are people who were issue voters for whom this is incredibly important uh and so you often see and a lot of states where you have\nA more swing between parties a policy kind of going back and forth between well we're going to go all renewables an unknown are we're going to focus more on prices even if that means more traditional sources\nAnd so that's where we are now and I think we haven't had this debate in a while here in the state\nBecause it's been a long time since we've had a Republican governor who want it to moving a little different direction and one Bentsen was governor that was you know that was a long time ago now the technology was at a different place\nAny I I Do have the sense that decides here are kind of talking past each other which is frustrating to hear you know that these are Democrats come up with this plan several months after the governor's plan there was a ... of the president of the New England ratepayers association mark brown was kind of sitting there during some opposition research during this press conference and I talk to him afterwards and\nYou know he basically repeated the governor's lines to me about how uh you know any even short term increases treats even small increases will her poor people it'll hurt the elderly and especially businesses I think that's a really a main focus for\nThis new to administration and for supporters like the rivers association a and when I asked him if they see any\nThat can be done through energy policy he said they were going to say she doesn't consider climate change and its approach which surprised me and I think that you're going to see some of that tension start to come through this year potentially that for a lot of Democrats the things are inextricably now and and maybe we'll see that fight play out in\nBasically this is the latest attempt to try to as you say balanced the books on fishing games a chronic deficit on on search and rescue funding and so they most of their rest of your about half the rescues are for hikers most of those happened in the White Mountains\nWhich are federally managed and so they are asking the state's congressional delegation to sort of help them set up meetings with federal regulators to ask for reimbursements for rescues that happen on federal land\nCompletely unclear if this was going to happen it would be I as far as we can tell pretty unprecedented and honestly Glenn Norman do I think we might hear from here\nDoesn't seem too optimistic that it's going to happen I think he's been burned before\nThe oh we've got some some tape from a fishing game executive director Gwen Norman do he says he has a low expectations of getting federal money for this for this kind of thing\n[laughter] [noise] [noise]\nThey being of course the the federal government which will look at this and say well if we give it to New Hampshire we're gonna have to give it to everybody and be super expensive dean\n... and I'm curious do you have any idea if the number of rescues has increased in recent years I've always wondered if\nPeople are forced sense of secure a false sense of security also you can get on the Internet and look up to you know ten great heights in the White Mountains and not really think about what it means to be up above tree line I was always curious if if if that's part of the issue is because you often hear in the news you know that they contacted a officials are using a smartphone or a cell phone\nYeah I took her own turned on my major one time and you can simulate desperately looking at it by Google Maps try to figure out which does not work and so I actually don't know the answer to that question is if you're a fascinating question I think\nI mean the rescue seemed pretty constant if anything I mean and they have a lot of\nYou know one thing Norman do told me is that the the the big uh costs here come from a small fewer number of people but he described as idiots you know people who are who really go up mount Washington at three PM in October in shorts and are not prepared and then have to call nine one one in the middle of the night and that happens but\nThose are the expensive ones the negligent ones the ones that the state has to try to get\nSome money back from hikers for but that can't always happy and the money that it currently gets right now I thought was interesting to know that it comes from hunting and fishing fees and things yeah little you know a dollar on your ... or you're hunting and fishing licence or\nOn your height save car if you buy one of those hard yeah that's their sort of fundraising mechanism\nFor about ten years ago that was there so I remember those from you know let's have a high end card hired by a car to pay for everything and the number of people to purchase those cars but a\nWhich is sort of like insurance they mean that if you can't be negligent because he bought this ...\nAnd that that does that help too modest degree but um this is really about the legislature and the next governor stepping up and deciding how important is fish and game or to the ... uh two New Hampshire's identity if you will and I think it's pretty important I mean I um\nAnd in a lot of states you've seen a lot of states with a lot more dedicated funds to support\nThese kind of activities um and fish and wildlife than we have here we've been very reluctant as a state to allowed to do that that the legislature has resisted over the years all kinds of fundraising attempts\nTo dedicate more money to fish and game um but I think it's inevitable because frankly\nThis is often what happens which is to say often at the end of every two year budget cycle the general fund ends up bailing out the fish and game fun because it doesn't have enough money\nSo fishing game gets money from what's called money not otherwise inappropriate if and it's essentially the general fund you know and so I'm like I said lawmakers and the next governor I think and I think Norman do is trying to say this um there were\nAny the suggestion or ... tax which is obviously a hospitality tax it's a\nIt's a tax we basically a except for people who eat at restaurants we kind of off load to tourists that come into the state of why why shouldn't and it raises three hundred million dollars a year we're not talking about that kind of money why not dedicate a small portion of the room and meals tax to support fishing get\nGlen Glen Norman do said I you would think it wouldn't be too high a bar to give us one or two hundred thousand dollars for that tax wherever they were to make a whole and and you know this is it's not that fishing game\nCan't go rescue someone 'cause they don't have the money they're just going into the red to do it and that money is coming out of funds that they want to be using for other what they would consider to be more important activities conservation where fisheries research that kind of stuff and it's all depleting those funds and so they would like more consistent appropriations from the legislature instead of these periodic bailouts and\nGlenn Norman do suggested that that would be even more helpful potentially going federal ...\nAll right well we've got to take a break but when we come back let's hear more from Glen Norman do because he comments on the fact that two bears were shot\nUh because uh uh a fish and game officials worried that the bears were going to sort of run out the traffic on route three a residence though are a little bit upset about the way this was done we'll get to the details for that after the break this is the weekly New Hampshire news round up on the exchange\nOn an H. P. R. and Peter ... you can call in with your questions or comments about the week's news one eight hundred eight million to six four seven seven or send an email exchange at an H. P. R. dot org we'll be right back\nIt's nine thirty nine you're listening to an H. P. R.\nA gift to engage the are the er state plan is a wonderful legacy to leave for those who need a trusted source for news Hi I'm Sarah Alger director of major and plan gets for an HBO at any speed ... inspired you to learn more about your stage and your world so to wear your legacy gift inspired future generations email me\nAt ... at an H. B. R. dot org ... to learn more about including an HP are in your essay plants or go to an H. B. R. dot gift plans\nDot org and support for an HBO or comes from you our listeners and from the New England tap house grill and hooks it along with hip these farm offering farm to table dining from their scratch kitchen plus a large selection of specialty and local beers on tap and infield shaker museum hosting aside or festival\nOn October fourteenth with a variety of siders\nFood trucks farmers' market music children's activities in more shaker museum dot org [noise]\n\nThis is the weekly New Hampshire news round up on the exchange on an H. P. R. Peter below and we're speaking with our guests today about the week's news dean spill yo to civic scholar in the school of arts and sciences and that's innate you alter the website and age political capital and Kevin ... of the union leader give us a call now if you have questions or comments about the week's news\nThe numbers one eight hundred eight nine to\nSix four seven seven or this week to more bears were shot in Manchester a fish and game officials say the bears were a bit too close to the roads are the some nearby residents weren't happy they were hoping maybe that the bears could be sort of tranquilizing move that's happened in a few other cases\nA But Kevin the state of saying that really wasn't possible in this case\nYeah um this uh obviously not I'm a great week for I'm\nDr Norman do this is a controversy that obviously residents are very upset about you see on social media this basically blew up much like it did a year ago when governors who responded to a lot of that concern about\nDealing with a family of bears hassling homeowners in Hanover by having the bears physically removed him after a biologist had recommended\nUm the the bears be euthanized a in this case I think really why people are so upset is there really hadn't that wasn't that discussion here there was not really any debate uh\nThere were there there were reported sightings of bears on Monday afternoon late Monday afternoon in this neighborhood and that's what sent\nTo fish and game biologist down there Tuesday to check them out a biologist\nI'm a went in and ended up I'm\nYou said killing both bears and and I think that's what upset resident in so much here was is is in contrast that with hand over a year ago that was a process Dina remembered that went on for weeks where the bears were in the neighborhood and they were causing all kinds of problems going through trash in a town that already taken some steps in\nAnd we ended up moving um this didn't happen here boom one day later these\nResult of what was seen would hand over and they basically wanted to avoid having this kind of get out of their control by making it a big public issue with the media and TV and all that stuff and just do it quickly and there's just no room for no time for debate or losing control of the the the issue\nYeah well one of the things that the story that I think it did not look good for the state was that allegedly um the the official just first of all as in plainclothes and second of all just shut the bears\nLoaded them on to the truck and then did not want to talk to the residents who are ... wanting to ask them questions right then which seems like you know or state official you're doing some state business maybe I talked to a resident who has questions about [laughter] right\nAnd then on march red pickup truck I mean it didn't have fish and game um insignia on it so that that's where residents in the apartment area assumed it was a coach who would taking those bears until they were\nThree ... keen Ninety point seven\nW. E. D. C. ... from one of seven point one W E v J Jackson Ninety nine point\nFive easy ... cold truck ... point three and\nW. E. V. cute little ten Ninety One point nine and online at an H. P. R. dot org\n\nFrom New Hampshire Public radio I beat her be yellow and this is the exchange on an HP are\nThe game of baseball has a way of piling pressure on those who play it imagine you're the batter there are two outs and you are behind in the county and you are the teams last hope for winning the game for imagine you're pitching and you've got three runners on base in one last chance to end the innings\nAll you have to do is hit a spot more than sixty feet away it's about the size of sugar cube\nImagined the mental toughness it takes to push aside all your distracting thoughts and do what needs to be done\nThat mental toughness is the subject of former major league pitcher up to ... new book conquered native spent Thirteen Years and majors and many years now as mental skills coach for both the Boston Red Sox and now San Francisco giants\nHis new book is called Ninety percent mental an all star player turned mental skills coach revealed the hidden game of baseball ... thank you very much for joining me\nPeter it's great to be here I'm listening often to the to the station and the the programs that you have so to be part of that today is a pretty exciting\nThis is super exciting for me as a baseball fan I'm sure exciting for baseball fans out there as well but this book has to do with not just an approach to baseball Ben approach to life and we will get to that but we do want to bring listener comments and questions and as well so if you are interested in asking Bob a question about\nA major league baseball about his career about how to keep your head in the game so to speak give us a call the number is one eight hundred\nEight nine to six four seven seven one eight hundred eight nine to an HP are you can also send an email to exchange it an H. P. R. dot org or post on our Facebook page\nAt an age PR exchange all one word\nSo Bob when we talk about the mental side of baseball what are we talking about exactly\nYeah that's you know and and that's an important question because people trying to take it for granted like and even some of the players don't know what it is so\nUh you know with the three areas of performance when it comes to dealing with a lead athletes are all ... athletes at any level there's physical fundamental in mental players often find it easy to work on the physical and fundamental side the mental side compose is comprised of\nYour thoughts your actions your feelings goal setting journal ing confidence uh anxiety learning how to breeze um properly using imagery as a tool to him\nSupport for an HP ice live stream comes from you our listeners and from radiation energy a local employee owned company helping thousands have granted staters go solar\nRadiation energy is currently crawling their team of electricians and plumbers learn more at revision energy dot com slash careers\nForm and that given moment mhm so is a mental skills coach kind of like a therapist\nYeah yeah exactly absolutely there's a comparison to that for sure I think you know we always in the field have always tried to figure out what's the best name title for this position um you know performance enhancement coach mental skills coach sports psychology coach\nUm but it's like baseball counselor is essentially what I feel like I Am because\nYou know I've talked to the minor league players about breaking up with their girlfriends and players about boundaries with parents and coaches dealing with you know their own little drinking problems are being away from their family and then and then performance of being on the field so we do the same type of work\nA were master's level level certified so I I don't have a PHD I Can't call myself a psychologist I'm but I I have a masters in sports psychology and counseling so essentially you're right it is kind of like being a baseball therapist\nAnd it's easy to sort of imagine that ball players especially when we see close up shots of them on TV that they just look so confident and in the moment and ready to perform but they're human beings they've got lives off the field and it's easy for them to bring their lives off the field\nTo the field just like we could bring our lives outside of work into work\nYeah I mean the I think there's a perception of you know fancy players in a certain way they see 'em\nYou know as as players just like it's like we will get actors you know Denzel Washington or Tom Hanks or whatever it is we see them and characters like we know who they are but they play that character\nAnd I think athletes are the same way we ... we know them as the ball player but we don't know him as the person so I tell guys baseball's what you do it's not who you are\nAnd uh and that's what they do and they have negative thoughts they get anxious before games they\nThink they're never going to get another hit I'd pall mall or the nights leading all time high pleading hit on the hit list\nOr asked them what time do you ever lose confidence and he said yeah if I'm old for twelve not having any hits and twelve at bats I feel like I'm never going to get another hit and that's Paul mall at our hall of famer so if he's having those thoughts you know that everyone's having those thoughts\nWow so it takes a mental some mental health I guess to to get out of a slump like that but let me ask you about what things were like uh for mental health and baseball when you started um you were drafted in Nineteen eighty one and you you you started with the Yankees in Nineteen eighty six\nWhat was professional baseball like back then with respect to mental health and mental skills talking\nThere was none [laughter] so it was it was something that uh\nI I did a radio interview the other day in St Louis actually and and they mentioned that and and I could use that as being you know I'm from a small town in New Hampshire Salisbury New Hampshire went to ... high school you know we had\nA couple of hundred maybe two thousand people in our in our town and I go to New York I'm playing and living in you know New Jersey I'm commuting over the George Washington bridge and playing in New York I'm\nLike you know we're not in Kansas anymore you know like the wizard of Oz so it was really hard I Would have helped me a lot but there were no teams that had those positions then it slowly started in the late eighties gain some traction probably in the late nineties and since two thousand four has gone\nTwenty seven teams who have somebody's ... are providing this resource for the players\nAnd so it's gaining in popularity now\nYeah yeah and and the reason for that Peter's because you know the the ownership no one really it it's such a you don't know if that helps players because it's not a tangible thing you can't you can see a guy that puts on twenty pounds and get stronger you can see a guy that changes as mechanics\nYou don't know if this helps but it does you know you can't quantify it and I think the teams are always like why should I invest in something that I Can't quite quantify how do I know it's going to work well now as the field has grown and players are voicing how much this has helped more teams are using this resource\nYeah well you describe the scene in in this book Ninety percent mental where I Believe you were a at Portland sea dogs minor league game and you were asking the players how many among you think that your your hang ups have to do not with physical a fundamental things but with mental issues right and how many hands right now the\nI asked him I said I said uh how many players here feel like they're playing up to the potential uh none of them raised their hand and I said okay under the three following categories what is the reason why I did physical one guy raises and fundamental one guy raised as in mental\nThey all raised their hand and then I said what are you doing about it and they all looked at me dumbfounded because they were like oh my God I and so the you know there's one thing that have the resources that's another for the players to say hey\nI might be able to use this and that's a that's a gap that I constantly work to bridge with players now\nI'm In a very subtle way it's a it's not an easy job really because you're trying to\nHelp players that have already had a lot of past success they make a lot of money they have a lot of people telling them what to do and I'm just another resource so I have to kinda sit back and and wait and the minor leagues I can be much more proactive as I was that day with the Portland sea dogs but in the big leagues a little bit different\nOkay we're talking with a former major league are about to experience who's also a mental skills coach or for the San Francisco giants he worked with the Boston Red Sox for a long time as well what questions do you have\nAbout major league baseball it's mental aspect in particular but also Bob's career he spent Thirteen Years in the majors he's actually a one of the ... that apparently Bob in ... in your book you wrote fewer than or around two thousand people have spent more than a decade in the major size is it's a pretty elite club given how many people want to play prevent\nJobs at Nineteen only Nineteen thousand plus I've ever played that one day in the big leagues and a hundred and thirty five years and the only yeah less than two thousand have played ten years so\nI'm Still quite an opportunity to ask a former major league or your question about baseball give us a call the number is one eight hundred eight nine to six four seven seven one eight hundred eight nine to\nAn HP are you can also send an email to exchange it an H. P. R. dot org or post on our Facebook page in each PR exchange that's all one word or so for mental skills coaching in particular you mentioned that it's different when you're a working with rookies are people in the minor leagues versus the major leagues\n[noise]\nAnd support for an HP are comes from you our listeners and from crossroads academy a K through ... independence day school in ... New Hampshire hosting an open house on Thursday October Eighteenth\nLearn more crossroads academy dot org and the S P shows presenting singer songwriter Gordon Lightfoot the legend lives on tour at the colonial theater in Keene October twenty fifth tickets that colonial dot org\nThis is the exchange on H. P. R. Peter below filling in for ... and we're speaking today with Bob to experience who pitched in the majors from Nineteen eighty six\nTo Nineteen Ninety eight for six different major league teams you then went on to serve as mental skills coach for the Boston Red Sox and now served in that capacity for the San Francisco giants his new book is called Ninety percent mental an all star player turned mental skills coach revealed the hidden game of baseball\nAnd we're happy to take your questions and calls give us a call one eight hundred eight nine to\nSix four seven seven uh we get an email question from bill who ah who wanted to know a Bob ... players talking to opponents while they're on base or these conversations friendly banter or an opportunity to sort of chide or jibe with the other guy looks friendly and funny most of the time but is it\nYeah it is now and it's something you talked about a appreciate the question old school guys would never talk to the opposing player you'd run in different directions when I came up\nYou ran toward the outfield you never ran to the middle of the field where you might run into an opposing player or that bothers a lot of old timers now coaching players are out there talking before the game and hugging everybody and\nAnd uh so it's usually somebody that they they if they're Latin American player they played together with him and winner ball they may play together in the fall league somehow they're connected\nUm so yeah it's all cordial it's fun um\nAnd uh but it's something that some people don't\nLike [laughter] okay so ... not not trying to play ... a mental games with each other while they're on base now now now they're just yeah yeah okay uh let's go you've on north sudden you've on thank you very much for calling what's your question or comment\nRed Sox fan and I'm Wondering if the difference here is mental attitude more than skills which they already had\nHigh I appreciate the question um yeah they I think it's residual effects from my being there for Fifteen really what I think there was no I have a they have a great mental skills coach their lives through the years\nI think they they do have a from what I've heard they do have a pretty relaxed atmosphere Joey Cora has done a great job ah with his staff or ... been a long time bullpen guys very very smart and I'm Glad he's the pitching coach he's very\nUh uh he'd be I'm Glad he's in that position because he's more than a bullpen coach so I think you know culture and chemistry does come into play or they are different uh John had a different style of managing and connecting with the players and I think\nYou're seeing the the Latin players in the young players really uh feel more comfortable around the staff that they have and I think court could be responsible for that\n[noise] and we got a call from Dan in Concord Dan thanks for calling\nTalk of mining thanks for the opportunity I was curious about a whack elite athletes go through when they're injured for or have had surgery for a long time how is it different from\nYou know is it different from just normally having to be um um red alert and determined to get back and do you encounter you know do you count flying with a athlete or Korean chair and wondering whether they're ever going to make it back I Need to do\nYeah thanks than a that is when you're injured on the team you feel like you have a scarlet letter on your head loser I'm big el because you feel like you're not part of the team\nAnd you feel like your teammates you kind of project that out do you feel like your teammates see you in that way and what I tell the players that are injured as like the ... you know when you were playing did you look at the Andrew player that way and they said no and I said why he's though 'cause I have my own stuff going on\nAnd I said well that's the same thing now they're not worried that you're injured that you're a but what you need to do is focused on getting better and the the anxiety that comes from players that are trying to come back depending on the significance of the injury is real there's a lot of anxiety there's a lot of trepidation there's there's\nA strong hurdles that they have to go through a over time and and I think that I tell players that are injured there's there's three types of time there's baseball time time on the clock and then there's God's time\nAnd God's time will determine when you come back you know it's you can't rush things and the players are really impatient because they they don't like being hurt and not being part of the team be they're afraid they're going to lose their job\nAnd that means a lot of money in some cases so all of those things are are the full spectrum for the injured player\nMhm stock to rich in Concord rich thank you very much for calling\n[laughter] [noise] yeah Hi thanks for having me and I bought my wife very much very much enjoy doing jazz or size\nLo o lo or is there no thank you rich [laughter] um yeah my question is I I'm\nA little older now but I have done long distance running in my in my life I've even without attracting with a couple thoughts that made it the Olympics the thing that I find is that I can get excited about seeing my self improve for a while you know a year or two\nBut then it's like how do you how do you a stay at such a high level or work past just getting border you know it's the same thing and and may not see the improvement there for a while and that's where I find I lose it\nAnd get more disinterested in and yeah and not gain by\nMy goals well motivation is you know as you get older it becomes difficult to sustain that level of ability I think resetting you know I Would say the quick thing would be to reset your goals so that become more I don't know if they're more realistic but goals help motivation\nIt's like when you get bored with what's going on\nUm as as we age as athletes you know we're not going to be able to perform the same way we once did but our mind is always the you know twenty year old athlete and things we can do anything and that's that's why people at my age you know the get injured playing Thanksgiving Day football or pick up basketball is because our bodies aren't used to taking that [noise]\nBut ah so the quick part of that and I'm not sure if I'm answering your question correctly but uh you know resetting goals finding new motivation and maybe having a different expectation of what you feel like you should be doing versus what you what you really can do\nLots of great questions from listeners in have we welcome more if you've got them the phone number to call one eight hundred eight nine to\nSix four seven seven uh we've been talking a little bit this morning about a statements that sort of ... century you mentally or for for for the game we talked about um thoughts are becoming things and we get this question from Wendy who asked\nA Bob de your techniques work for sports other than baseball or are they baseball specific\nUh there for any athlete there for any person any athlete I think\nI've had a a a grand dad for lacrosse player at the University of Virginia or email me and say is is ... ... well this book helped my daughter even though it's baseball and absolutely because of the reason is I talk about the aspects related to performance\nThat you can put under any team or any individual sports team sport concentration confidence using breathing as a tool using imagery as a tool so those are all things that can be applied to other sports are absolutely\nUh we got a question from Greg in Salisbury Bob Bob how do you feel about ah the pressure that is put on kids to focus on a particular sport or and then a follow up question did you play more than one sport at ... high school\nI did a I played basketball I played soccer for a little bit but basketball and baseball mostly\nUm I don't like the pressure that's being applied to the children now um\nI understand you know the the new programs all the way through or are the programs that you know they're not going to go away I think but I uh I think players athletes young athletes need to sample different sports they shouldn't specialize until they\nBecome late teens may be their last year in high school if they have a career past that um you know I think one of the things that I read the other day that I'm a certain percentage of the first picked from the NFL Draft or multiple player multiple sport athletes\nUh colleges in teams look for the athletes now that played multiple sports because of such things like burnout and overuse especially with pictures a pitcher's those guys that log a lot of innings and as they are used in through college or the ones that are more susceptible to Tommy John injuries\nWhich are starting to happen earlier and earlier so uh I think it's a as a whole thing on education the ... of the parents about why do they play specialized sport what's the end result\nAnd not only is it costs but it's also cost and time for the family but it also does put pressure on the kids\nAre we've got a call from bill in where Neal thanks for calling\nGood morning thanks for taking my call Bob it's a pleasure to talk with you Hi Bill and I'm curious if a a a pitcher looking back on and on a finished career with a wall full of awards and accolades\nDot org\nSupport for an HBO ... comes from you our listeners him from Davis tire an auto service in Portsmouth providing complete car care services and new key and all whether tires Davies tire keeps you rolling right service appointments at Davies tire dot com and the valley and middles in building supply offering all types of flooring including hardwood vinyl tile limited and carpet\nInstallation available location information at ... dot com\n[noise]\nThis is the exchange on H. P. R. Peter below filling in for ... and we're speaking today with Bob to spray who pitched in the majors for Thirteen Years\nFor six different major league teams and then he went on to serve as a mental skills coach for the Boston Red Red Sox know serves in that capacity for the San Francisco giants his new book is called Ninety percent mental an all star player turned mental skills coach revealed the hidden game of baseball call now with your questions or comments one eight hundred\nEight nine to six four seven seven and we got an email from from David in Meredith who ah was asking um my son and I wondered what is happening when a skilled and talented pitcher who pitches extremely well suddenly has a game when he struggles to get the ball over the plate\nIs this a mental issue or mechanical issue at and or a mechanical issue that has a mental impact how how does a pitcher and staff address this during the game so a lot of questions they're mostly related from from David merits what do you think\n[noise] yeah that's a factual question Dave I think that it could be both um sometimes it's mechanical issue it's a flaw or\nA player may have something that picture may have something that he's doing that it can't quite correct so the dialogue in that case would be the role of the pitching coach saying who got to keep your body closed or you're going to\nDrive you know stay back over the rubber more\n[noise] um so the thought process would go with the picture if he was not throwing strikes what am I doing wrong Osama kept throw the ball over I don't want to keep walking these guys coach is going to get married then I'm going to have to throw a you know a pitch down the middle to this\nNarrative so so if it's a mechanical thing and the guys experience what am I doing wrong okay I can I can correct is making the judgment and then things go on to play [noise]\nUm the pitch if it's in a can or if it's a mental thing to start with lack of confidence you know sometimes this happens when the first guy that they face reaches base and now they get anxious about oh my God I got a pitcher the guy on first\nAnd then so becomes a mental so both of those cycles happened I think the the goal of the pitching coach is to identify mechanical issues\nAnd oftentimes the players won't their internal narrative is different than the external narrative ... so they won't tell the pitching coach that I Am afraid today I I have no confidence I think I'm going to\nYou know really stink he's never going to say that but if a player has anchors and that's where a case where I Would help them develop anchors breathing routines things that would help them regain focus\nSo that he changes that narrative and then he goes on and pitches it's\nAstounding how much power a mental block can have you you write in this book about one picture and I forget his name who just all of a sudden couldn't find the strike zone like not even close and it and it ruin his career right do you remember when I'm speaking about\nA false Steve Blass had ... killed I mean there's been there's been a few yeah the throwing issues a quote unquote ... I don't know if that's a great term for but people\nAre athletes throwing athletes baseball player softball player sometimes given this funk where they just can't throw it's like the their uh\nTheir arm their hand is somebody else's hand and that's something that I've actually talking with a couple of players about now that have that it's a really a tough thing to overcome but not really sure the orientation of it ah there's no quick fix to it but it's certainly a an area that\nMental skills people can help deal with the anxiety and and the the frustration of that\n[noise] ah yeah I remember you also wrote about Chuck now block grant the second baseman and I remember watching him\nOr in the in the late nineties I think he's playing for the Yankees at the time second base very close to first base for those of you who aren't baseball fans and it's a short throw relatively speaking he kept missing these thrill is yeah and I kept thinking icy missing these throws this is a little league thing but maybe it was a mental block\nWas deaf and that's why he went to the outfield and and um because of that because he couldn't throw that so it is a there is a mental block their unlocking that is is proven to be difficult\nYeah so you as a pitcher you weren't known for your your speed not necessarily but you've known for your accuracy and you could get pretty reliably put a ball wherever you want it why why was that important and\nFor you because I didn't throw hard you know right now is if you throw Ninety five to Ninety eight you can afford to make mistakes over the plate will say because you're faster than the hitters response\nI threw in the hitting speed so in order for me to have success I had to be able to pinpoint\nMy pictures with accuracy which started back to my childhood in Salisbury throwing balls against the schoolyard wallet solving Salisbury elementary school you know I've always working on throwing it targets because I had to uh that's how I Survived\nBatting practice to to find find the plate and to have a few reliable pitches one scene in this book I absolutely loved is I think you were working with a minor league team in us that the pitchers how many pitches do you have yeah someone raised his hand and said for ... maybe it wasn't you know someone else that these teams working\nNow it was I was that was you know I was when I was a player it was when you were a player and Ted semblance of the coach asked a pitcher we're doing a discussion\nAnd it goes really and he goes if you can get up and throws you know seven out of ten pitches over the plate will call consider that a pitch we'll put it in your back pocket so needless to say the guy didn't through his fastball over the plate seven out of ten times so but he had four pitches\nAnd so that's where it gets back to my command I could come in my fastball which made my other pitches better\nYeah a euro I there's a passenger that I really want to quote because it it seems to summarize how important it is to to have conviction but also a good\nA good country of pitches in your back pocket and see right a filthy fastball can make things easier because it allows the pitcher to miss spots and still get people out but it's a two part approach the physical part a step to in the process step one happens upstairs before picture winds up to throw the ball\nHe must determine what pitch he's gonna throw next into which location to the plate and once that part is finalized the conviction must be there to throw it only then when the conviction is forged in stealing resolve either physical odds of throwing a strike to the desired location greatly increased conviction plus execution\nMm yeah hey that's that's pretty cool [laughter] and you read that really well I should have had you read the the audio for me [laughter] well I I think that you know we have a saying the ball knows when you throw a pitch with conviction\nIt seems like the ball in those because you can make a bad pitching get hitters out when you throw a ball would timidity and fear\nThose are the ones that get hit it's like the ball and those so you have to be able to have conviction and your picture pictures you have to trust your first thought and that takes and that takes preparation you know you you have to know what you're doing I think now we can get into this whole other subject about analytics and pitch counts and all that stuff but\nPlayers today have so much information given to them that they often don't understand why and I think understanding the why you're going to throw a certain pitch is really important and it helps with the conviction\nEspecially because you can sort of imagine that a a hitter is trying to predict what you're going to throw next and I I read somewhere years ago that mark McGuire\nA sort of can predict with eighty five percent accuracy and that was why he was so good is the hitter sure someone's pitcher you sort of have to play this what you call a cat and mouse game yeah he knows that I Know that you know is that what you're going to throw next right how do you predict that\nUh we've got a call from Stefan ah I Hope I'm pronouncing your name correctly Stefan in God's Tom thank you very much for calling what's your question\nYeah thanks for taking my call I'm going to ask you about probably like I really think that my mind where mental lapse was great talking to the basement um how do you how to coach a player [laughter] problem\nContinue obviously was a physical thing um because he was able to do that for years before and then all of a sudden like a rolling in just couldn't do it anymore so I don't allow that continue and not just poor woman and work on and answer or mental\nUh well I'm not sure what the Yankees I'm\nA you know reasons for that word but I Would say initially you're paying them a lot of money um\nIf you if you know so that's that's not a reason but it is and the big leagues you're paying this guy you expect him to go out you think it might go away if you just keep playing them if you put them on the disabled list a and then you have to bring somebody else up\nYou know does that help 'em or does that hurt him I I think the the whole issue with the not the inability to throw is is so complicated that no one really knows how to do it you know Rick and kill couldn't pitch so he went to the outfield Chuck\nWhy the Yankees sounds like ... a big Yankee fan why the Yankees continued to let that happen I have no idea um maybe for the entertainment of the fans", "year": "2018", "show_name": "Weekly NH News Roundup", "city": "Keene", "day": "12"}