{"month": "10", "state": "NY", "station": "WRUR", "content": "Currently and remember singing will the circle being broken with our kids at the gravesite service for her mother June that connection to lineage has touched those outside the Carter bloodline too [noise]\nIn the early Nineteen seventies the song gave the California country rockers in the nitty gritty dirt band way to bond with their country and bluegrass idle says Jeff Hannah I'm One of the bands founding members\nWas as much about just getting to hang out with these folks who was making music with an playing music was opponents\nThe dirt band and its gas recorded more than three dozen standards most with one vocalist or another to lead singer but I Will the circle beyond broken may Bill Carter Jimmy Martin and re ache us each thing ever and everyone else joined them for the court\nThat roof number provided the title for the Nineteen Seventy two album became cultural touchstone Pena says he met listeners everywhere who responded to the way that the musicians bridge generation gap\nWar was raging in Vietnam right then and there was a lot of\nPeace marches going on and hippies versus the rednecks and there's a lot of the size of the just did not trust each other and hearing folks tell us stories like you know I had talked to my dad years and we sat down and his record became a bonding point for us that's deep stuff\nMusicians of the younger generation are still forging those kinds of bonds Valerie June a singer and songwriter broke through and the roots scene early this decade is proof\nI Know exactly where I first started and what would be a church in particular my grandmother's church the church of Christ and they're only about maybe thirty members but everybody sang it all together\nOn the coffee house circuit she picked up the guitar part from the Carter family version she found it inspiring but the song had crossed stylistic region on racial\nBoundaries such artist as the staple singers making their own\n\n[noise]\n\nThat's what study in a song like that as it traveled from my grandmother's church and from my ancestors are from the Carter family\nThat is what steady in one single song taught me that you might find that it's been done and so many different genres in so many different styles there are no rules and boundaries for music\nAnd it's not okay\nCalled broken [noise]\nLearning\nWith the circle beyond broken is still a rite of passage for budding musicians like six year old toddler Stella cope and her guitarist brother in a tiny upstairs for Herschel studio in the west side of Nashville she worked through the tune for the first time with her teacher dean and Richard since\nI was ready I was standing by my thing [noise]\nI don't know\nIf ... keep working at it maybe she'll be able to join longtime Brando I remember Billie Anderson in Opry circle Sunday Anderson has pondered the lyrics will the circle beyond broken over the years he\nSays he loves the imagery of the chorus but wouldn't mind it at the versus dwelled lessen the undertaker in his hers then I'm celebrating community\nI'd love to sit down with a couple of guys may be Vince Gill or somebody from the upper you know two or three of us and try to create a more all inclusive pause do vibe about our business about our people and the whole ... it'll we'll all\nGet together and ...\nWere the circle will remain unbroken for NPR News I'm Jewly Hight in Nashville\nWhen I I'm close\nTo home\nAnd the brain but then\nThey met during\nSupport for American Anthem comes from Sierra Nevada Brewing Company and family owned operated and argued over since Nineteen eighty proud supporter of independence thought whether that's on line over the air or in a bottle more it Sierra Nevada dot com and says\nOh yeah\nYeah yeah you're listening to all things considered from NPR News\n\nSupport for NPR comes from the station and from it less than a collaboration software company towering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more it at ... dot com\n[noise] from exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information at color guard test dot com\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and banking capital markets expertise along with the legacy of putting clients financial well being first learned more it Raymond James dot com\nYou're listening to double helix which I Am Rochester W are you are ... Rochester and it will be what's exciting if each to Rochester W are you are easy\nBroadcast partnership of the University of Rochester and double digits excite public broadcasting you'll be the road the joy with Maureen rich next to six a double you are you are and there's more of all things considered should hit here I Am Thirteen somebody\nOutside today mainly clear to start with increasing clouds temperatures in the\nThirties and slowly rising before morning tomorrow or no it's mainly clear sky fifty three degrees Rochester made that clear in hoping also fifty three\nAt six o'clock\nSupport for your public radio station comes from our members and trim turning stone resort and casino offering getaways including lodging dining and spa treatments details individual information available online at turning stoned ... you're listening to\nDifferent radio W are you are an HD Rochester W. I. T. H. FM an HD ethical or online at W. R. U. R. dot org I'm Maureen rich and I'm headed down the road to joy I Hope you'll join me\nGoing to start off the show with a tune from Leon Russell from his Carney album of classic blast from the past\nAll we really have really lonely again in the\nLoop be bold new\nJersey [noise]\nSeeing but you know they know man I mean we [noise]\nReally long them live man being\nRead in [noise]\nOh really do see the too\nFar away [noise]\nBeing close to you\nRun loose gum [noise]\nWe're trying you\nKnow got in a way [noise] [noise] well I'm\n... right [noise] this loan me literally [noise]\nGolf or do\nWe mean the real risk a the ... [noise]\nNo man or a town I'm and I'm\nRight [noise]\nKnew we were young [noise]\nReal along the way\nI read [noise]\n\n\nNo I don't know who to haul [noise]\nWhen you know being\n\n\nMm\nBrand new Carlisle from her latest released by the way I forgive you with the joke\nThe homes brothers and please don't hurt me from Nineteen nineties in the spirit of mobile than Elvis Costello in there with matter of time from the right\nStarted off with Leon Russell in this mess rate from Nineteen Seventy two Carney album\nSoon coming up next and the more so hope you'll stick around [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\nUm I'm from uh king [noise]\nTo Tom from\nNot to try to since she\nKnew that John du Jamal for many many new ... go to they can do that to\nI don't know\n\nWell I'm way is the you know not big news\nIn between and not knowing the bay yeah I mean\nThe you know in\nThe least we got to pay the\nAnd\nHe\nNa na na na na na na na na na na\nThey give the the ... and\nAnd ... you know the main the\nMain\nSupport for different radio comes remembered number beside the\nLive music venue in airport offering ground fearing casual dining Tuesday through Saturday what the monthly blues and root night singer songwriter showcase an open Jay performance line up online at airport beside dot com [laughter]\nThere will be no uh\nYou\n\nNo not yet your man\n\nIn oh he's rule\nA\n\nAnd laugh\nVe\nMan ... during the the ...\nMan with the\nUm ...\n\n\nAnd not no no no no no that are the reason I could\n\n... be a pre ... [noise]\nI'm a\nMouthing no better\nAre all you\nYeah\nOn me [noise]\nYou're telling\nKnow\nSaying they they [noise]\n\nA\n[noise] well\nNa na na\nMy doting with none none nothing from his album yeah and also yeah\nThe ... family banned in there with heartbeat and that's from the album kids raising kids turned out that that with Norah Jones and be here to love me from her feel like home album\nJD make fierce and coming up next\n... and that's from his left the good times role album and\nDoctor [noise]\nDa da\nDa da da\nDa da da da da da\nDa\nDa da da di di\nDi\nDi di di\n\nDi di\nDi ... ... ...\n...\nDa da da da da da\nDa da\nDa da\nKnow being a yeah\nI\nMean maybe the ... ...\nTo me and um the ...\n\n... ...\nShannon and unknown leaders have been to those who've\nIn and out of the city in the out of\nThe day I'm staying in\nOn me me and I'm at\nThat we heard one from Bob Dylan from the modern I seldom go under on the mountain before that it was at Dell from her Nineteen album covering a deal and to make you feel my love\nFrom two thousand eight you're listening to different radio W. R. U. R. S. H. G. Rochester W. I. T. H. F. M. H. D. in ... or a minus W. R. U. R. dot org\nHowever you're listening happier here I Am headed down the road to joy I'm Maureen rich and hope you take a ride with me that another hour to go so stick around lake street dive up next from their new was released freer so\nThis one's called shake shake shake\nOr\nAbout\n\nShame shame shame\nShame shame on\nDa\nDa da\nDa de\n... shame T ball you\nMan or you don't know out\nOf being a big man two\n\n\nWell do\n\nOn a leash\n\nNo\nShame shame shame\nShame shame they need new\nGame game ...\nShame shame shame\n\n\nYou know we'll\nOn [noise]\n\n\n\nMe\nShould\nIn a new loan\n\nGot ...\n...\n... ...\n[laughter]\nOh\n\nGod the ... from their self titled album the one that got away\nThe punch brothers before that with this again titled cuts dissolved ... who's feeling young now and the ... brothers singing to strangers from their paradise album started off this hour with lake street dive\nAnd shake shake shake\nBox gang up next year and different radio with a Jew from the Memphis album this one goal Cadillac wow\nOh man I've ever been married for ...\n...\nVery\nPain you know\nThere may have rain and none of them are young my\nMy little guy\nThe land\n\nMan we remain calm ... name\nMovies\n\n[noise]\n\nCan learn a\n\n[noise]\n\n\nMm Mm\nMm\nMm Mm\nMm Mm\nThem on the ship\nCall and then all of them I\nDon't know I still love\nAnd love\nMe my God\n\nThey can\nGet on the go to\nCall and\nOf them are\nOn the phone call oh no\nNo I'm\n\n\n\nGun on the go to you\nNo I don't call\nThem up a little\nKnown them calling\nLa\nIt is that he needed to\nChange\n\n[laughter]\n\n[noise]\nYeah you don't like it or not your manage\nName was about ...\nThe guy\nThey never ...\n...\nNine [noise]\n[noise]\nHi my\n\nNa goods and just try\nKnow minority [noise]\n\n\nGreenhouse\nJohn\n[noise]\n\n[noise]\n\n[noise]\n\nKnow [noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\nNa na\n... ... ...\n... ... ... ...\nBang\nIs\nKnow made no no\nAlone is\nThat the girls are way down on me\nAnd that may be\nStep and I'm about\n... ... ... ... ... ... ... do\nYou tell me what you ... ... ... ... ... ...\n... do you\nTell me that you mean the ... ...\n... do we watch\n", "show_name": "Road To Joy", "year": "2018", "city": "Rochester", "day": "30"}