{"month": "10", "state": "MA", "station": "WNCK", "content": "W. N. C. K. Nantucket misses WICK Nantucket on line to Nantucket NPR Dorjee\n\nNow why is it do you think that a French composer would write music for a place set in Italy\nAnd call the music English [noise]\nFirst of all the composer is only ... and in Nineteen Seventeen uh he embarked on a collaboration with a colleague for the dramatic stage\nThe play was the merchant of Venice\nAnd ... wrote the music\nAdapting for orchestral music by the burn journalists from England when you burn ...\nAnd others I Mindy ... there is some of that music coming up and just a few minutes [noise]\n\nLive from NPR News in Washington I'm Barbara Klein\nPresident Trump called Saudi Arabia's account of what happened to journalists democracy show gee credible for the first time Riyadh admits could show Jesus is dead saying he died in a fist fight with Saudi suspect and its consulate in Istanbul\nNPR's Deborah Amos reports the kingdom blame senior advisors for policy gone wrong\nThe Saudis now admit that there is a standing order to bring dissidents back to the kingdom by force\nHe's now admit that there's a standing order to bring dissidents back to the kingdom by force if necessary but the account lays the blame on the senior security officials who went beyond the order they killed this dissident journalist they covered up\nThe murder Turkish officials continue to search for a show just body meanwhile Republican Senator Lindsey Graham says he's skeptical of the Saudi explanation democratic Congressman Adam Schiff says he doesn't buy it\nPresident Trump is due to lead a rally in El ... Nevada this hour the last stop in a three day campaign swing for Republican candidates in the upcoming midterm elections Paul Bulger of member station K. U. N. R. report\nThe triple Merck the president's first visit to the northeastern part of the state which is widely considered a conservative stronghold according to campaign officials the president or use his aren't urge people to get out to vote for Republican candidates like an incumbent senator Dean Heller\nHoward the only Republican running for reelection the state won by Hillary Clinton twenty sixteen and it's considered by many to be one of the most vulnerable Republicans in the mid term\nOurs facing a challenge from democratic congresswoman Jackie Rogan in a previous visit to the states the president criticized rubbing referring to her as wacky Jackie for NPR News I'm pulled over in ... Nevada\nU.S intelligence officials are warning that foreign adversaries have already targeted next month's midterms NPR's Carrie Johnson reports a Russian accountant is the first to face federal charges\nFederal prosecutors say Elena ... sign of a conspired to defraud the United states authorities say she managed a budget in more than thirty five million dollars in debt targeting elections here and in other countries\nThe methods familiar Russian ... domain names and Facebook ads just so division on issues such as race relations and immigration\nTheir messages targeted people including former president Brock Obama and late Arizona Senator John McCain and they also mentioned special counsel Robert Mueller the man leading the investigation into Russian interference in twenty sixteen intelligence officials say the Russians are still on the attack\nBut they say there's no evidence foreign adversaries had been able to prevent Americans from voting or to change vote counts Carrie Johnson NPR News Washington\nSome forty thousand customers in the Florida Panhandle are still without power ten days after hurricane Michael roared ashore the company Gulf Power says all of them should be back on line\nBy midnight Wednesday this is NPR\nTens of thousands of protesters or choking central London demanding a second referendum on Britain's separation from the European Union among them London Mayor Sadiq Khan says things have changed since the twenty sixteen vote\nYou know the line is the truth is that it shouldn't be exposed on the will of the British people it's changing\nAn economic crisis in Zimbabwe is deepening despite the efforts of a new government ... reports\nThe government has introduced measures including Texas mentor to raise revenue for repayment\nOf missile defense in two thousand eight as soon as the crisis amid the replacement of these ... currency by the U.S dollar budget trade imbalance resulted in the shortage of the u._s. dollar this is gonna tribute to the current economic introduce you go to you know the government's moves it will be worse than\nThe last ... was seen as sharp spike in the prices of basic swim it'll be liberal supermarket shelves are empty would basically such as water into a bridge in short supply\nLow fuel accused Komen gas stations and these shortages medications for NPR News I'm ...\nA disappointment for lottery hopefuls officials say there was no winning tickets for last night's one billion dollar mega millions drawing it's now up to one point six billion and the next draw is Tuesday I'm Barbara Klein NPR News in Washington\nSupport for NPR comes from babble a European made language learning program Bible teaches practical conversation in Italian Russian Swedish and other languages available in the app store or online or B a B B. E. L. dot com and be any EKG foundation\n\nIt's always nice to have company for classical music especially on the weekend I'm Mindy Rattner happy to have your company on this Saturday coming up in less than ten minutes a great American pianist\nJoining the Atlanta symphony orchestra and conductor you will live ie in ... first piano concerto a soloist Andre watch\nIn the end so string quartet plays a a bit of a quartet by ... Strauss later on in the course of the hour [noise]\nNineteen Seventeen the first World War was still very much underway and own reroute boat was given an opportunity to have a little distraction and be creative at the same time he was approached a to write music for an adaptation of\nShakespeare's play the merchant of Venice and rather than um\nWrite a completely new score he turned to music by a sixteenth century English composers like William burden Giles foreign to me and he adapted some of their music for orchestra [noise]\nSo that became the sweet ... glasses says music by already rebel [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise] Mm\nMm\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\nMm [noise]\nNo no no no\nNo no [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nMm\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[laughter]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\nAndre watch that the keyboard with the ... the Atlanta symphony and chai cubs skis piano concerto number one\nNantucket NPR station eighty nine point five W. N. C. K.\nThe UPS Store now located at sixty one will come on in in the u._s. should bring a graphic design services was printing our phone numbers fiber wait three to five feet he ate for thank you\nWMGK Nantucket classical twenty four overnight on W. N. C. K.\n\n[noise]\nThe logic behind the name of this peace isn't all that up here [noise]\n\nWell there is the obvious and that is\nTo do it and the violin concerto number five\nWhat does that tell you exactly [noise]\nIt was one of a collection that Mozart wrote in Seventeen Seventy five [noise] and it bears the nickname Turkish\nA bit of a mystery [noise] Mozart did use some folk material but it wasn't Turkish ship was Hungarian [noise] go figure\nI'm Mindy ... there and we'll hear the whole thing about twenty minutes [noise]\n\nLive from NPR News in Washington I'm Barbara climb a procession of watermelon migrants attempting to flee to Mexico has shrunk to about a thousand people earlier this week an estimated three thousand we're attempting to cross over the border\nNPR Shannon van central port hundreds made it across others return to Guatemala for food and water\nThe migrants trade tempting to travel over Guatemala's border with many using ropes and rafts\nTo trek across in nearby river Mexico says only those carrying valid passports and he says are allowed to enter and according to us secretary of state my palm pale for Mexican police officers have been injured in a border standoff\nPompeo was in Mexico on friday to me but that's president and Foreign Relations secretary where he emphasized the importance of preventing the migrants from reaching the United states Trump has tweeted that he will send us troops to close the border of Mexico does not stop the caravan ... NPR News Washington\nMedia are saying turkey is continuing it's criminal investigation into the case surrounding Washington Post contributor Jamal ... G despite Saudi Arabia's admission\nThat the journalists died at its consulate in Istanbul and despite ... claim the matter is under its jurisdiction NPR speed\nDespite ... claim the matter is under its jurisdiction NPR's Peter Kenyon reports\nA pro government Turkish paper says any Saudi claim of jurisdiction over to show your case is false arguing that in Nineteen sixty three treaty grants jurisdiction to the host country in this case turkey late friday to Saudi said ... died in the consulate after a fight broke out critics say the new Saudis story doesn't match the evidence\nThat President Trump says he finds the Saudi explanation credible he also praises the kingdom which denied because she'll jeeze death for two weeks for acting quickly Republican Senator Lindsey Graham disagree saying he's more than skeptical\nAs his Democratic Congressman Adam Schiff and German Chancellor Angela Merkel calls the Saudi claim inadequate\nHundreds of thousands of protesters packed into central London today demanding another referendum on the u._k. pulling out of the European Union NPR's Frank Langfitt reports many Britain's are deeply unhappy with Brexit negotiations which are at a stalemate and running out of time\nWith a merger see the breakfast was from which included pledges of extra money for health care is turning into a disaster United Kingdom the European Union's rejected prime minister Theresa May's plans for leaving the u._s. have many in her own party in the u._k. is now at risk of crashing out to the European Union with no deal for a future relationship\nSome protesters wanted to stay in the ... others hope there will be a deal but want to see the details before signing off\nPrime minister may however has rejected holding another public boat which breakfast here say would be anti democratic\nFrank Langfitt NPR News London this is NPR\nSuicide bombers have carried out an attack in Kabul as Afghanistan holds parliamentary elections the first in eight years officials say several people are dead ISIS and Taliban militants had threatened violence\nFear or over fake news and its influence on elections is engulfing Brazil ahead of the presidential election a week from tomorrow\nAs NPR's Philip Reeves reports from Rio de Janeiro the messaging platform WhatsApp says it's taking immediate action to stop companies from sending mass messages to influence voters\nJust overweight for Maine's before an election runoff the ... a retired army captain from the far right is expected to win by a landslide\nThe controversy is being triggered by newspaper report and Brazil sang business executives have bankrolled ... messages spreading fake news about both so now does leftist opponent Fernando ...\nBoth in autos denying involvement\nThe scandals hung dodging the boss quantity of Hadiya motive for misleading election related materials spread on WhatsApp which has more than a hundred and twenty million Brazilian uses WhatsApp says his ... misinformation by closing accounts and using fact checkers\nAnd it says it's sending cease and desist letters to companies sending out about my ... Reeves NPR News ... NATO\nBaseball's National League pennant or will be decided tonight when the Milwaukee Brewers again take on the less Los Angeles Dodgers the winner will move on to the world series against American League champion the Boston Red Sox I'm Barbara Klein NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include Baird of financial partner guiding families businesses communities and institutions since Nineteen Nineteen R. W. Baird dot com has more information and the corporation for public broadcasting\n\nAnd Mindy rent near I'm Glad you could join me for some music on this twenty a day of October\nMozart's fifth violin concerto the one called the Turkish coming up and about Fifteen minutes we'd violinist and conductor Christopher Warren green and the London chamber orchestra\nAnd Sergei rough mind you know music on the docket as well not one of his big works like the piano can charity or the symphonies no we'll hear one of a set of six pieces played by a brass ensemble that calls itself except\nTorah\n[noise] I don't know too many people who give a name to their homes but a one time diplomats Robert Woods bliss and his wife Mildred who had been such good friends of Enrique Glenn now those around the time of the first World War\nA they had a house with a name and the state if you will in Washington DC called dumb Barton oaks and that's the name given to a concerto written for them by ... [noise]\n\n\nNo [noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\nThe dumb bart notes concerto my Tribune ski Christopher hug would lead to Saint Paul chamber orchestra\nToday's classical music is supported by Frank you're creating modern photo decor and gifts by printing photos directly on glass\nA fracture is image frame and mount all in one hand made in a carbon neutral Florida factory learned more at ... dot com slash classical\nNantucket NPR station eighty nine points fine W. N. C. K. house speakers\nBelieve every item in your home should be made to fit you from the blind to the shades and shutters from the bathroom to the living room from a home theater to the wind solar or wind bar they make sure everything fits you outfitters sixteens Mark Sanford in Nantucket [noise]\nHi this is Jean Miller from the community foundation for Nantucket inviting you to listen in eighty nine point five W. N. C. K. Nantucket NPR station W. N. C. K. Nantucket source for NPR News\nMORNING EDITION all things considered and then took its borders elections meeting log onto Nantucket NPR dot org for more information\nAnd tune into Nantucket NPR station eighty nine point five W. N. C. K. brings tears\nChristopher Warren green so Lewis and conductor of the London chamber orchestra in Mozart's violin concerto number fine the Turkish [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\nPartly something about afternoon highs fifty to fifty five ... forecast meteorologist Paul Janice\nHave UNC K Nantucket eighty nine point five WMGK\n\nBeethoven always seems to me like a serious kind a guy intense even\nMm Mm Mm oh but not in this movement [noise]\nIt sounds like\nIt's absolutely light hearted\n[noise]\nThis is a movement from Beethoven piano trio number seven one code orange do I'm Mindy Rattner the bows are trio plays it for us in about twenty minutes [noise]\n\n\n\nLive from NPR News in Washington I'm Barbara climb\nPresident Trump called Saudi Arabia's account of what happened to journalists Jamal 'cause show gee credible\nFor the first time Riyadh admits cause showed gee is dead saying he died in a fist fight with Saudi suspect at its consulate in Istanbul NPR's Deborah Amos tells us the kingdom blame senior advisors for a policy gone wrong\nThe Saudis now admit that there's a standing order to bring dissidents back to the kingdom by force if necessary but the account lays the blame on the senior security officials who went beyond the order they killed this dissident journalist they covered up the murder\nTurkish officials continue to search for cars showed jeeze body Afghanistan is holding its first parliamentary elections in eight years NPR's DEA had deed report several people were killed today in a suicide bombing targeting voters the bomber\nStruck a school that was used as a polling station it was kept open to accommodate voters who hadn't been able to cost that ballots O'Neill because electoral stuff hadn't turned up in the morning fearing attacks\nBut as I did turn up in defiance of the Taliban and ISIS he struck campaign rallies in the lead up to these elections militants also tried to obtain voting Scott a deadly attacks around the country\nThere was also confusion about how to use the new biometric systems and some days didn't have ballots because of the kind of surrounding the elections voting will now be extended to Sunday in some areas ... date NPR News Islamabad\nNearly eighty thousand customers in the Florida Panhandle are still without power ten days after hurricane Michael struck from Panama City NPR's Debbie Elliott has an update\nRecovery is slow going because of the scope and intensity of the destruction crews are working to restore phone service electricity and water and sewer systems mark Bowe and his chief of emergency services for hard hit bay county\nWill get it back um they'll never be the way it was but you will make it into the best community that we can and move forward that's all human beings can be\nGulf Power says it has already replaced fifty six hundred power poles knocked down by Michael's powerful wins Debbie Elliott NPR News Panama City Florida\nHundreds of thousands of protesters marched through central London today demanding another referendum on Brexit organizers say since the original vote in twenty sixteen new facts about the cost and complexity of the u._k. separation from the e you have surfaced\nConservative MP Sarah Wallace and joined the demonstrators everyone\nDeserves a chance to change their mind when they looked at the end of it is\nToday is is the biggest demonstration so far demanding a public vote on the terms of Brexit prime minister Theresa May has ruled out another public vote this is NPR\n\nThe universal postal union is warning American consumers will pay a heavy price if the Trump Administration goes ahead with its threat to pull out of an international postal treaty\nHis leash a slime reports from Geneva Washington claims the treaty benefits China at the expense of American business interests\nThe Trump Administration wants to renegotiate the treaty saying it allows China to mail small packages to America and heavily discounted rate making it hard for American business to compete\nAs senior postal union official warns Americans won't be able to send international letters or international packages if Washington pulls out of the one hundred forty four year old treaty he\nSays the U.S won't be able to access special codes needed to send and receive mail internationally and this will affect UPS that ... and other companies who also would lose access to these codes for NPR News I'm Lisa shrine in Geneva\nPresident Trump is wrapping up three days of mid term elections stumping for GOP candidates in next month's elections\nWith a rally in El Paso Nevada today the president has been trying to motivate voter turnout using reports of a caravan of Honduran and Guatemalan migrants heading toward the U.S border\nThe procession has shrunk from an estimated three thousand people to about one thousand and most are now held\nUp at the Guatemala Mexico border I'm Barbara Klein NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the logging meat is Brewing Company robbed supporters of the tiny desk contest and working to help bans reach more ears through beers more logging meters dot com and the corporation for public broadcasting\n\nAlways nice to have company for classical music I'm Mindy rent and they're happy to have you along on this Saturday a those are trio\nAnd about Fifteen minutes\nWhether they're recording of the piano trio number seven by Beethoven one called arch Duke also music for voices by the late American composer Stephen polish and there's this that may have been some\nWhen it was\nFirst performed this is a selections from the east or ... by Johann Sebastian Bach it's cold and my spirit being joyful here's Richard camp with Phil harmonious virtue of the [noise]\n\n[noise]\n\n\n\n\n... is a text by Henry Wadsworth long fellow by Steven polish steeped in the late ... conducted the choir up trinity college can't bring\nW. N. C. K. this message brought there by the ... walks to drop it on over to our website now I get lots of drought dot dom ... we're going to be or what to ship nationwide this holiday season your dog can be delivered to your dog at the very next day you're in [noise]\n... your headquarters for vegetables starters inspiring plants beach Barrett dinner to go practice strong community partnerships year round partly for my ... D hoping everyday celebrating a hundred and Seventy five years ... who's your partner\nThis is an ... back from housing Nantucket thank you for supporting the island and listening to Nantucket NPR station eighty nine point five and the K s and\n\nThose are ... from its early days made this recording of Beethoven's piano trio number seven the arch\n[noise] [noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[laughter]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nMm\n\n\n\nMm [noise]\n\n[noise]\nMm\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n\nW. N. C. K. this is WICK Nantucket online Nantucket NPR Dorjee\n\nFlowers are very important in Chinese culture to\nConsider the pie any\nIn the eye or as\nThe Jasmine slam or\nWhat kind of flower Steven gosh had in mind when he wrote this\nSorry to say it comes from a sweet called the Chinese garden the ...\nHey it comes from a sweet cold the Chinese gardens the movement is red flowers blooming all over the mountain\nPicture that as we hear guitarists me with the young later in the air\n\n\nLive from NPR News in Washington I'm Janine hurt as international call for an investigation into the death of Washington Post journalist ... ... is done will grow President Trump today is repeating his position\nThat he's not sure the ... government was involved Trump speaking to reporters after a campaign rally in Nevada says it's possible the Saudi crown prince was unaware of the killing but Trump says the multibillion dollar sale of US military equipment to Riyadh still needs to happen\nWater and fifty million dollars I think it's over a million jobs\nNot helpful for us to cancel it order like that\nBetter more that it hurts them\nThe Saudi Government says the journalist died as a result of a fist fight in a Saudi consulate in Turkey the official word on what happened to show gee has changed several times and as NPR's Claire Lombardo reports were leaders are skeptical of the latest account\nAccording to the Saudi Government could show she died in a brawl and the Saudi conflict in ... by officials initially claimed that the journalists walked out of the conflict alive Republican representative Adam Schiff of California I told the New York times he's received a classified briefing about the circumstances and the ... version doesn't match up\nRepublican Senator Lindsey Graham tweeted last night quote to say that I'm skeptical of the new Saudi narrative about Mr ... is an understatement unquote\nGerman Chancellor uncle and Merkel called the Saudi explanation quote inadequate in a statement world leaders have chimed in throughout the day with their own statements demanding further investigation Clarence embargo NPR News\nThe drop administration is trying to fast track and environmental review of projects that deliver federally subsidized water to farmers in the west have you restrict similar reports a new presidential memorandum is designed to loosen environmental restrictions\nRepublicans going back to the George W. Bush administration have tried to increase water deliveries to farmers in California's massive Central Valley project where water from snow fed reservoirs gets pumped south to arid farmland but those deliveries are perennially cutback due to attempt to protect endangered fish and drought\nThe president's order would speed up the current review of this as well as to other projects in Oregon and Washington\nIf environmental restrictions are loose and there will likely be a pro long legal battle and one of the biggest champions of this latest plan is deputy interior secretary David Bernhardt used a lobby for the Fresno based west ones water district one of the largest and most influential water agencies and the west Kirk Siegler NPR News\nPeople in a mass caravan at the Guatemala Mexico border or using ropes and rats to travel across the nearby river after Mexico refused entry to anyone without a ballot passport or visa others though are applying for refugee status in Mexico\nAnd Mexico is offering some uh forty five date visitor pass\nYou're listening to NPR News from Washington\nViolence has disrupted Afghanistan's long delayed parliamentary elections several people are dead many others injured after a suicide bomber attacked a polling station set up a at a school in Kabul today Jennifer glass has more from Kabul\nThe suicide bomber was trying to get into a polling station when he detonated explosives killing and wounding police and civilians it is so far the biggest single attack on the election\nThere's been a number of bombings and attacks around the country both the Taliban at Islamic state warned voters to stay away from the polls but Afghans have been defiant standing in long lines to cast their votes in a parliamentary contest that was supposed to be held three years ago it was far from perfect\nProblems with technology and logistics at polling stations opened late or not at all to the voting has been extended through Sunday at nearly four hundred voting sites\nFor NPR News I'm Jennifer glass in Kabul\nA frozen food and packing company in Minnesota is recalling more than two hundred twelve thousand pounds of ready to eat pork and chicken products authorities say the meat contains vegetables may have been contaminated with salmonella and listeria\nUs agricultural department says the products were shipped from buddies kitchen and sold in Arizona California Georgia Illinois Minnesota Missouri and New Jersey the USDA's as buddies vegetable supplier found that problem and he said so far there haven't been any reports of illnesses filed but they are urging consumers\nNot to eat the products I'm Janine hurts and you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations or their contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent thought whether that's on line over the air or in a bottle more it's the Nevada dot com\n\nI Mindy Rattner go ahead you could be with me for some music on a Saturday\nMuch of the hour is devoted to orchestral music by brooms not one of his symphonies but rather the second of the serenade in a recording by the Paris or Castro ensemble\nAnd um music the takes us to China and to Spain all in the course of this hour [noise]\nAnd this takes us to Italy or by way of New York and a recording that was made by Leonard Bernstein into New York philharmonic with William Hill him as a pickle oh soloist in this concerto by Vivaldi [noise]\n\n\nOr measure don't conduct the terrorists are Castro alone symbol on Saturday and the serenade number two I borrow\nMm\nMm Mm\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\nNo\n\n\n\n\n\nNo no no no no no\n\nNot\nSure and\n\n[noise]\n[noise]\nMm\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\nMm\n\nMm [noise]\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n[noise] Mm [noise]\n\n\n\nNot\n\n\n\n\nA\nSystem that's not\nThat much about that [laughter] [noise]\n\nNice to meet\n\nYou\n\n\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[laughter]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nThat's what\nTo get something to do\n\n[laughter]\n[noise]\nSo I don't know [noise]\n[noise] [noise]\nMhm\n[noise]\nGod [noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] are managed to do with the terrorists or Castro ensemble and the serenade number to buy a hundred us from", "year": "2018", "show_name": "Classical Music with Ray Brown", "city": "Nantucket", "day": "20"}