{"month": "10", "state": "MA", "station": "WNCK", "content": "Rain will end a showers friday that's your island forecast this was meteorologist Russ Marlene on the news room then\nTalked to a cottage hospital was on record opposing ballot question won in Massachusetts question one would place a limit on the number of patients are single nurse can be assigned to the time and impose a twenty five thousand dollar fine on hospitals would violate those ratios\nAre gr Margot Hartman president and CEO of Nantucket cottage hospital Saddam would question one would impose inflexible government mandates on our hospital would override the local decision making of our nurse managers and positions about how to best care for patients\nFrom the community bulletin board or free class will be offered the next three Tuesday's the great hall didn't talk it out for him it's titled how to deal in cope with change it will be led by life and career coach Janna Mars runs five thirty seven registration is required you to space limitations\nRed Sox Yankees meet again tonight\nThose are your Nantucket headlines jai ... eighty nine point five W. N. C. K. [noise]\nFrom NPR News in Washington I winter Johnston\nPresident Trump will crisscross the country this week in an effort to build support for Republicans ahead of November midterms\nNPR Shannon ... reports tropical whole campaign rallies in four states temple traveled to Iowa at Pennsylvania Ohio in Kentucky he's expected to tell the economy and urge voters to head to the polls in November\nOver the weekend at a rally in Kansas Trump celebrate at Kavanaugh's confirmation and ramped up his attacks on Democrats you\nI breed at Kavanaugh's confirmation and ramped up his attacks on Democrats\nMatch during our son is doing left wing\nOff four hundred and thirty five members at the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house ... NPR News Washington a un report is calling on countries around the world to do more to combat global warming\nAs Larry Miller reports scientists are warning of severe environmental changes including heat waves devastating storms droughts and the loss of species\nThe only ... says even keeping the earth's temperature rise to the two degrees centigrade targeting agree that the Paris climate change talks is too high when the world is heading toward of three degree rise the eyepiece she she says only by dropping to one point five degrees and the worst effects of climate change be avoided\nIts report says manmade C. O. two missions me to drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent now one eye BCC board member warns\nThere is only the slimmest chance of avoiding unthinkable damage to the climate system that supports life as we know it\nFor NPR News I'm Larry Miller in London\nPakistan's Supreme Court has heard the final appeal of the Christian Woman who's been sentenced to death for blessed to be NPR's ... reports that the merged as one of the most important cases in years to reach the Supreme Court there\nThe quarter we still have to judgment on the appeal and didn't say when it would be announced over the years the case against us your baby has led to the assassination of two senior officials when does the was noted by his buddy God who is now regarded as a news St by the religious right\nThe case also released a powerful extremist movement and their leaders wound of terrible consequences if BP was granted leniency\nNPR's reporting from Islamic by the death toll from a powerful earthquake and tsunami that struck central Indonesia nearly two weeks ago is nearing two sounds and search and rescue crews continue to come through mud and debris on ... island searching for survivors thousands of people are unaccounted for\nDr trading lower on Wall street at this hour the Dow was down forty two points the NASDAQ down eighty three B. S. and P.\nDown nine this is NPR\nHurricane Michael is pounding Cuba was heavy rain and high winds as it makes its way toward the Florida Panhandle Dave's Lenski at the national Hurricane Center says the storm is predicted to gain strength and the next few days\nWe do expect that it's going to the Gulf of Mexico was closer to the for the for the Big Bend area\nForecasters say Michael could come ashore along Florida's Gulf Coast as a category ... storm the unemployment rate is at its lowest level in nearly sixty years which means American retailers might have to try a little harder to fill their seasonal hiring slots this year NPR's Camila Domonoske reports\nThe beginning of autumn brings changing colors the start of the school year and a wave of temporary hires as retailers get ready for the holiday crush\nSixty five thousand workers for FedEx eighty thousand at Macy's target is looking for a hundred and twenty thousand but unemployment is low and American workers have more options than they used to consulting firm challenger gray and Christmas says companies need to offer either competitive compensation or perks\nAmazon recently announced all its employees including temps and seasonal workers will make at least Fifteen dollars an hour and target is giving new hires the chance to win a five hundred dollar gift card\n... NPR News\nStocks are getting canoeing to train lower on Wall street the Dow Jones industrial average is down thirty nine points at twenty six thousand four o seven\nAnd I sat composite down eighty five points the U.S in the five hundred down eight this is NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include progressive insurance offering its home quote explore some shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learn more at progressive dot com\n\nHere's music by retired Wagner from Des rankled this is a section called the ... of the gods into battle ... and it's played by the London philharmonic under age we built\n\n\nBalancing act is supported by lavender farm Nantucket health and wellness concierge offering personalized retreat at your home\nVisit lavender farm Nantucket dot com to learn more about their health and wellness surfaces\nComposer older Baird gr that's\nWas born about sixty five miles south of wrong in the town that was famous for producing beer\nWhen he was twenty two he followed the path to many ... musicians the day and he went to the end\nHe went to Italy after that for a few years in Paris and London kind of the world would travel but in the end he landed in Vienna which makes perfect sense when you listen to his music here specifically for one with the lending no sir players conducted by the tea is served\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\nHow old is your door that's looked to be eighty seven years old he died in ... Eighteen fifty in his lifetime but shelters with lots of ... percent mutation early on he was in the ... ... ... ... who became the friend and supporter of his music\nHe left behind some thirty opera a weapon that there's lots of chamber music in over forty simply today you heard the symphony number\nOne a jerk that's with the tea is ... and his London ... is our players\nLosing a loved one is traumatic planning a funeral I took it can be daunting John Lawrence funeral home is here too in ... in your time with need we do every detail with grace care and precision joins funeral how science your weight four to eight seven zero four\nHi this is talk it's town manager let me get to listen to a wide audience time all cash the check it would have to like ... meeting this Wednesday at six pm here an eighty nine point five W. N. C. K ... NPR station\nHere's a country that they told me about when he was asked to participate in the dedication of the renovated theater in the city of the so called the Consecration the health so what's your plate here by the Nicholas Esther how they see some\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\nIt may see some removing by late Thursday Afternoon\nRain will end a showers friday that's your island forecast this is a meteorologist Russ Marley\nFrom the news room there talking cottage hospital was on record opposing ballot question one in Massachusetts question one would place a limit on the number of patients are single nurse can be assigned in time and impose a twenty five thousand dollar fine on hospitals that violate those ratios\nDr Margot Hartman president and CEO of Nantucket cottage hospital to ballot question one would impose inflexible government mandates on our hospital would override a local decision making of our nurse managers and positions about how to best care for patients\nFrom the community bulletin board a free class will be offered the next three Tuesday's the great hall of the day and talk it out to him it's titled how to deal in cope with change it'll be led by life and career coach Janna Mars runs five thirty seven registration is required you to speak limitations\nRed Sox Yankees meet again tonight those are your Nantucket headline jibe ... eighty nine point five W. N. C. K. card from now in the form out the concerto number fine thank you had this now\nLive from NPR News in Washington I'm winter Johnston President Trump is keeping a top Justice Department official on the job for now NPR's Scott Horsley reports deputy attorney general Rod Rosenstein traveled with Trump to Florida earlier today\nRosenstein state has been a question mark for several weeks since the New York times published a story saying among other things that the deputy attorney general had discussed secretly tape recording the president last year\nRosenstein has denied that report Trump spent about thirty minutes talking with the deputy attorney general aboard air force one of the two men made their way to a police convention in Florida\nI'm traveling with rod I didn't know right before but I've got you know I mean I get along\nRosenstein job is politically sensitive because he oversees special counsel Robert Mueller's investigation of Russian interference in the twenty sixteen election Scott Horsley NPR News Washington\nHurricane Michael is intensifying in the Atlantic as it takes aim at Florida's Gulf Coast speaking to a law enforcement group in our land do President Trump today are transferred into heat caution\nHurricane Michael nears landfall we're working with state and local officials in larger take all necessary precautions and we urge all residents to be prepared to National Hurricane\nDoes your precautions and we're ... residents to be prepared\nThe national Hurricane Center expects Michael to hit the panhandle or Big Bend by mid week forecasters say it's likely to come ashore as a category three hurricane new laws aimed at the prevention of sexual harassment on the job go into effect tomorrow in New York NPR's Yuki Noguchi reports\nThe new laws take effect almost exactly a year from the start of the meat to lose Mitt public allegations of sexual harassment and the resulting Alister of many leaders in industry and government have transformed workplace culture\nThe new laws require every employer to conduct interactive prevention training of all let's workers every year it also requires employers to publishing provide their policy to employees and\nInform them about how to file complaints experts say while many larger employers already had sexual harassment policies in place many smaller ones are unaware that this new law also applies to them you can ... NPR News Washington\nThe national Transportation Safety board is working to determine the cause of the deadly limousine crash in upstate New York when does it said the limo rent a stop sign and go Harry outside of Albany on Saturday and slammed into a park SUV\nTwenty people were killed Eighteen in a limo and to the ... federal authorities said the accident is the deadliest us transport crash in nearly a decade\nStopped trading mixed on Wall street at this hour the Dow was up forty points than NASDAQ down forty the S. and P. five hundred up a fraction you're listening to NPR News in Washington\nThis year's Nobel Prize in economics is being shared by two American researchers one at Yale University and the other at New York university\nWant us to William ... dolls friends raping climate change in a long long macroeconomic analysis of the author has supported him rumor for integrating technological innovations in a long long macroeconomic analysis\nThat the ... with the royal Swedish Academy of Sciences making the announcement today in Stockholm\nVenom is the new number one movie on the domestic box office charts the site by feature took in an estimated ... million dollars over the weekend NPR's Trina Williams has more on the top five releases\n... big opening of the record for an October new release the characters associated with marvel comic book universe Sony Pictures brings the former Spiderman nemesis to the big [noise]\nOh for perjury [noise]\nI was sure Tom Hardy Michelle Williams in ... a Mitt starring this mix of science fiction fried action and a bit of wit\nA star is born remake with Bradley Cooper and Lady Gaga ... paces expectations for strong debuting number too small for drops to third wall last weekend's winter nights for the fourth the house with a clock and its walls also gets finishing\nTrina Williams NPR News\nI'm with her jumped in and you're listening to NPR News from Washington\n\nSupport for NPR comes from NPR stations other contributors include the ... foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available ... foundation dot org\n[noise] violinist un Jang of the Shanghai Quartet\nSays quote I grew up with many of the traditional Chinese folk songs and the popular music on\nThis album the album we're going to sample from next I played some of these pieces on the violin during the difficult days of the Chinese cultural revolution\nI asked myself why not arrange them for the string quartet which is the form I Love the most that way I can play beautiful Chinese music again and bring it to a wider audience is with my group the Shanghai Quartet here is un chunks arrangement of like a piece written by ... Jew [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\nThe Egyptian piano concerto that the ... number five fine commune cents off even half was the soloist with the ... leading the city of Birmingham symphony orchestra eighty nine point five W. N. C. K.\nDon't Ellen auto center and talk it's tradesmen count on for quality values election in service between twenty Seventeen and Eighteen F. one fifty up to fifty or three fifty four fifty super duty pickups and dumps Don Allen auto center twenty four published road\n\nDon't miss my show cross currents Scott would Myers Saturday and Sunday mornings on this station on the ... radio out get the latest public affairs and lifestyles cross currents brought you by then partners a global leader in marketing and communications on line that's been partners dot com\nHi this is talk of the town manager Libby Gibson listen to a live audience I'm old cast of the Nantucket motive select meeting this Wednesday at six pm here on eighty nine point five W. N. C. K. yeah tickets NPR station\nJust a little something for the nighttime in serenade by Mozart little night music\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\nLet me see some removing in by late Thursday Afternoon rain will end a showers friday that's your island forecast this was maybe ...\nFrom the newsroom then targeted cottage hospital was on record opposing ballot question one in Massachusetts question one would push the limit on the number of patients are single nervous can be assigned to the time and impose a twenty five thousand dollar fine on hospitals would violate those ratios\nEr Margot Hartman president and CEO of men talking cottage hospital\nSo dollar question one would impose inflexible government mandates on our hospital would override the local decision making of er nurse managers and physicians about how to best care for patients\nFrom the community bulletin board or free class will be offered the next three Tuesday's the great hall of didn't talk it out for him it's titled how to deal in cope with change it will be live my life and career coach Janna farmers runs five thirty seven registration is required you to space limitations\nRed Sox Yankees meet again tonight\nWas you're talking headlines I ... in\nEighty nine point five W. N. C. K. jet says that's something they feel is a very good description of music and we'll hear what that means that had\nLive from NPR News in Washington I'm Windsor Johnston President Trump is dismissing democratic calls to impeach Supreme Court justice Brett Kavanaugh speaking to reporters before heading to Florida Today Trump called the sexual misconduct allegations against cabin all at democratic hoax\nWhen you mention the just the United states of resource for the top sellers to stop if there's nothing wrong\nAny Trump\nPlans to host cabin all at the White House this evening for a ceremonial swearing in tomorrow the president will traveled to Iowa for a campaign rally NPR Shannon ... reports Trump will crisscross the country this week in an effort to build support for Republicans ahead of November's midterm\nTrump will travel to Iowa at Pennsylvania Ohio and Kentucky he's expected to tell the economy and urge voters to head to the polls in November\nOver the weekend at a rally in Kansas Trump celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nFor doing our son is\nDoing a left wing mop and\nAll four hundred and thirty five members of the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house ... NPR News Washington\nHurricane Michael is pounding Cuba with heavy rain and high winds says it makes its way toward the Florida Panhandle Dave's Lenski at the national Hurricane Center says the storm is predicted to gain strength\nMichael is going to continue quickly strengthening northward through the Gulf of Mexico and because of that it could be a major hurricane strength it approaches\nForecasters say Michael could come ashore along Florida's Gulf Coast as a category three storm by mid week the death toll from a powerful earthquake and tsunami that struck central Indonesia almost two weeks ago is nearing two salads and NPR's Lauren Frayer reports from ... near the epicenter\nOfficial say up to five thousand people may still be buried under rubble that earthquake triggered mudslides that wiped out three big neighborhoods\nAnd those bodies may never be found the government says it plans to call off all searches by Thursday and its considering declaring those three neighborhoods as national memorials which may never be inhabited again\nThat's drawing some criticism from survivors who want to locate the remains of their loved ones across Polly people are still sleeping in tents even if their homes are intact for fear of aftershocks\nElectricity is coming back on and military planes are landing at the damaged airport delivering aid Lauren Frayer NPR News new Indonesia\nOn Wall street the Dow was up thirty nine points this is NPR News\nFuneral procession for Spanish opera singer monster ... took place in Barcelona today who said that if he does reports\nThe day's rainy weather seems to reflect the mood is people from all over Spain that a farewell to one of the most famous opera singers in the world among those in attendance where the singers family and Spain's prime minister ...\n... it will be buried alongside her parents and Barcelona cemetery the funeral center was open to the public all day Sunday for those who wanted to pay their last respects\nBecause he had passed away this Saturday at age eighty five after starring and around Ninety opera roles she was born to a working class family in Barcelona and began showing her musical talent as early as age seven for NPR News I'm Lucy ... is in Barcelona\nFederal investigators are working to determine the cause of the deadly limousine crash in upstate New York twenty people were killed on Saturday when the limo plowed through a parking lot in the town upscale Harry near Albany National Transportation Safety Board chairman Robert Sumwalt spoke to ABC News\nWe want to look at the company itself or the limousine operator California we want to look at the driver we will look at the roadway configuration and see if there's any particular problem was that movie for us as\nThe limo was traveling to a birthday party at the time of the crash a vigil will be held tonight to remember the victims at last check on Wall street the Dallas up thirty nine points the NASDAQ down fifty to the U.S in the down a point this is NPR News from Washington\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nSurfing hydrated nursery Ninety One some of the road offers exceptional plants and personal service to learn more about their stories either galleries and videos and check current him and tore click on surfing high during the dot com surfing I joined a nursery serving in talk it since Nineteen Ninety\n\nW. N. C. K. Nantucket\nFrom NPR News this is all things considered ... Chang President Trump hosts the swearing in ceremony tonight at the White House for the newest justice on the Supreme Court\nBrett Kavanaugh will be on the bench tomorrow when the Supreme Court hold oral arguments he was confirmed over the weekend on a narrow party line vote and today the president told a group of law enforcement officers in Florida that Kavanaugh's rise to the high court gives Republicans a political boost\nAll over the country of rallies and people are loving that man and loving that George\nWill have more on how the political battle over Kavanaugh's affecting the mid term elections in a bit but first let's go to NPR's Scott Horsley have got to get a picture of how Kavanaugh's presence on the court will will shift the decisions will see over the next few decades potentially\nHe will certainly shift according to the right remember he was chosen from a list of judicial candidates drawn up by the federalist society and the Heritage Foundation\nChosen from a list of judicial candidates drawn up by the federalist society and the Heritage Foundation\nA list of reliable conservatives and that's something you couldn't always say about the justice she'll be replacing Anthony Kennedy\nKennedy of course was a Reagan appointee and generally conservative but he occasionally did side with the liberal wing of the court most famously on a string of gay rights cases but also for example in reaffirming the right to abortion\nKavanaugh is expected to be much more conservative and Kennedy and that leaves chief justice John Roberts now as the pivot point on the court to that's right [laughter] it'll be up to Robert to decide how much judicial restraint to exercise and then that will determine whether this\nShift is a gradual series of rightward steps or one big lead\nDo you think the very bitter confirmation fight we saw over the last several weeks has damaged the course reputation as a political body\nIt it certainly has the possibility to do that now we're going to have five conservative justices all appointed by Republican presidents four liberal justices all appointed by Democrats and\nTo the extent their decisions divvy up along those partisan lines the court runs the risk of being seen as just another political branch of government snap by partisans in robes rather than an impartial body that somehow above politics\nAnd it certainly doesn't help the Kavanaugh is confirmed by that extremely narrow vote with just one Republican one Democrat breaking ranks and the Senate\nAlso listen to how President Trump described the campaign against Kavanaugh today was a disc racial\nSituation brought about by people that are evils and he just didn't we'll tufted out together and I have to think the\nRepublican senators that fought so hard for this because it was an easy so you have the president they're talking about this in very partisan terms his press secretary Sarah Sanders also tweeted over the weekend that\nInstead of six three liberal Supreme Court under Hillary Clinton we now have a five for conservative court under President Trump that's certainly true enough but it doesn't exactly sound like neutral referee just calling balls and strikes\nNow to do was already quietly sworn in on Saturday shortly after the Senate confirmed him so what is the purpose of tonight's ceremony at the White House\nThis is a chance for the president to remind his supporters who is responsible for this choice and now in less than two years Trump is named too conservative justices to the Supreme Court\nW. N. C. K. Nantucket\nSupport for NPR comes from the station and from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself a visit main dot com [noise]\nFrom Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information at bills on dot a double us [noise] and from the any each case the foundation\nFrom NPR News this is all things considered I'm outfit Chang China has become the biggest lender to government on the African continent over the past decade\nThe money has helped build ports roads bridges airport and trains and he's our infrastructure projects that might have it never happened without China\nBut critics say the rooms are full of traps that could leave African countries mired in debt and beholden to the Chinese NPR's Eyder Peralta brings out the story of one big project in Kenya [noise]\nMy survey journey in Nairobi where the train station is quite easily the most impressive public building in the country\nIt's modern with ambitious whooping lines\nThe train runs from the capital city to the portable boss up in represents the biggest infrastructure project since independence for Kenya it was funded entirely with a three point two billion dollar Chinese long a Chinese company built it and the Chinese will operated for many years to come [noise]\nIs hard to forget at the entrance of every single wagon the Kenyan flag is flanked by a Chinese flag and as soon as I sit down here to strangers having a spirited argument about Chinese involvement\nThe jungle a marketing executive says Kenyans can learn something from the Chinese they built nearly three hundred miles of rail ahead of schedule he says he would drive past the construction site sometimes and he saw the Chinese working non stop\nAnd they would see how nice as I'm walking in the ... and the thing you need ... seats in the heated wanting lost its whole\nTrip that turned a poor country into an industrial powerhouse says and Kenyans would be wise to pay attention\nThat they can do a lot a lawyer\nTo pay attention that faith can do a lot a lawyer interrupting she says Kenyans do not want Chinese culture\nYou know we've got we've got people that they should have never really got to make their own\nAgenda is unconvinced Kenyans like to talk he says they like to take breaks Chinese are not like that\nThey will ... who's not enemy ... penguins oh he's a man be matching\nAs he talks another lady across from him jumps into the conversation\n[laughter] you know\nIn case you didn't hear it she says this guy is colonized\nWhat you do know is that when I wrote this train Kenyan media had been full of news stories about the real way\nThey had shown pictures of Kenyans being physically punished by Chinese managers they reveal that the only time a Kenyan worker had taken control of a locomotive was a year ago on opening day\nThey also raise questions about how costly this thing had been and how can you may not be able to repay the Chinese\nBut suddenly we look out the window at the vastness of soft on national park\nAnd in the distance which the elephant in the world they do tend to look at that and the acrimony over the Chinese and over the spending when it melts [laughter] what's happening\nHere in Kenya is happening across the continent the international Monetary Fund says forty percent of sub Saharan countries are at risk of that distress and China is playing a big role they've handed out billions for projects and places like Ethiopia Guyana in Mozambique\nThat no one else would touch\nIt means Ethiopia got a new rail line to the port of Djibouti in\nCanada has an expressway but there are also worries\nBy some estimates the Chinese loans have bumped up Djibouti debt to GDP ratio from fifty eighty five percent only between the years of twenty fourteen to twenty sixteen so we're talking about a lot of money over to China\nThat's grant ... Harris a former Africa advisor to President Obama he says these Chinese loans are also very different from other international loans because the terms are often secret\nWhat we do not have transparency on is what really is the collateral and the very scary case in point is Sri Lanka\nJust at the end of last year ... founded soap struggling to pay back its debt so they had that China a strategic port on the Ninety nine year lease so what happens if Djibouti can't pay back its support what happened to Kenya can't pay back its train yes GR\nOn sets a worry a development economist here in Kenya says the problem is\nWe don't know as a public intellectual who analyzes African and Kenyan economy in a weekly basis at no point how come across a document that can say oh so that's what he asked young somehow\nWe asked the Kenyan government what happens in case of default but they would provide no concrete answer\nWhere it says these types of deals worked for many government they let them build physical projects that helps him win elections and they are also clearly a source of income for corrupt politicians and their supporters but lately here in Kenya there has\nBeen public outcry African governments need me happy with the city but Africa but I'm not and fundamentally the sentiments on the grounds is really going to inform how successful and how will receive their initiatives are in the country as a home [noise]\nOr train makes it all the time to my boss up strategically important port on the Indian Ocean\nWe drive out of the station onto the wetlands across tall bridges on brand new paved roads all made by the Chinese\nChinese workers zoomed past us pickup truck goes or houses there too and also the sides behind twelve foot fences and guard towers we see apartment threat lanterns tell us they are Chinese dwellings\nWe end up at the top of a bluff Charles door is a driver like a lot of others here he thought he'd one day be working on the railroad but these days he says he's not even allowed in the gate to try\nTo find work I asked him if he's ever spoken to one of the ... new book ever live with them while [noise] what made you know\nHe says the Chinese have type cast them they think that all Kenyans are good for is to clean or to move rocks for construction\nSo building but if I was a dog on the Web and do that that's not what what are we done so I got no more than what they're doing there\nHe feels like something that was supposed to bring jobs that was supposed to bring pride instead belong to someone else in a proper NPR News ...\n[noise] [noise] [noise] [noise] [noise]\nMara we continue our series on how China is changing the world will visit in Mandarin Chinese language school in Pakistan\nOh boy do I mean I'm learning\nChinese so that I just got a job has been resistance district to get into fish here how China is making cultural inroads into Pakistan nutrients forming a decades old strategic relationship between the two countries that's tomorrow here on all things considered [noise]\n\n\nThis is NPR News\nWhen the Greek debt crisis hit many European officials supported letting a Chinese shipping company sick over agree for well now some European observers have progressed\nThey found there if they if they're if they find these things [noise] in Europe China is\nGaining a foothold in Europe autonomy that when the next MORNING EDITION [noise]\nMm\nTalk rules his party last year they're going to see him a lot less if they get their books he loses so much\nSo for Donald Trump whose entire persona is about always winning the November election could be the first time he's a loser or not Mara Liasson NPR News\nWe may not know what's gonna happen in the November midterms but we do know one thing Taylor Swift is voting Democrat\nIn a lengthy social media posts on Sunday the pop superstar explained why she would be supporting Democrats filled bread is in for Senate and Jim Cooper for the house she also slammed Republican congresswoman Marsha Blackburn for her record on women's and el GB T rights\nAnd all this from an artist who has famously refused to talk politics in the past we reached Emily ... of the Washington Post who's been following all of this welcome high earth shattering is is to see Taylor Swift make some political endorsement\nHonestly and an area where I don't know if anything can surprise me anymore it really is depressed me why the shock yeah so I think it surprised me and a lot of people because after the last few years there has kind of been\nA steady drumbeat to get Taylor Swift to sort of say anything political anything about the current environment and she never has and then all of a sudden Sunday she drops his Instagram posted there really lengthy almost like scorched earth a post about how she really feels about the upcoming\nMid terms and I was just not expecting that what's the response than like from her fans [noise]\nI've seen a lot of support from people who were honestly just glad she said anything I mean she has a hundred and twelve million Instagram followers and a lot of people don't really look up to her so there's a lot of support there's also of course\nThere's kind of his movement that have always thought maybe she was secretly a conservative just because she never said anything so\nThey kind of had to read into a lot of things she had never even said that there is some disappointment on that side today well\nYou tell us with did start out as a country music star which is a world that leans conservative but she's more of a pop star now so does have a broader fan base kind of free her to take more left leaning political positions now\nI think it did in some ways because when she made the break from Nashville in kind of declared herself going to the pop world\nShe didn't have to worry as much about you know country radio which still drives so much of the country music industry now or solitaire being played on pop radio and she'd have that's broader audience I feel like it may have trapped her a little bit and the way that\nBecause she still has this country than she did still want you to appeal to them\nBut I think she probably didn't feel more free overall to share opinions\nYou know she has a reputation for being extremely calculated when it comes to cure reading her image so what do you think why jumped into politics now what do you think is going on with her\nAnd that's what I've been trying this is the mystery of the day and I always had\nThat I had her mind from Italy that\nTaylor Swift always seems to be like twenty steps ahead of everyone else no matter what she does everything kind of have like a double or triple meaning when you really look at it\nI think in this case the timing probably was pretty strategic she just wrapped up her stadium tour in the United states you know she's done with their concert she doesn't need to think about the backlash for any of that so she\nPosted her message after this she kind of looted and her statement to events that have happened to her in the last couple of years and that's why she was speaking out\nUnless you didn't say but those were um I think a big one that's impacted her the most was her sexual assault trial when it kind of music DJ sued her after he lost his job because she said he groped her and I meet and greet line\nWhen she counters sued him for assault and battery and she ended up winning and I think that experience really really left a mark on her\n[noise] Emily yard is an entertainment reporter for the Washington Post thanks very much for joining us today hey thank you\nThis is all things considered from NPR News\nJust two days before saxophonist and composer\n... went into the studio to record his new album Hurricane Maria hit his native island of Puerto Rico\nDuring sessions breaks the known called family and friends for news about the devastation back home NPR's Michel ... says\nThe resulting album your soil onto this young or I Am the tradition has the MacArthur genius his trademark originality but the natural disaster also gives it emotional urgency\nMcGehee known had already planned for his eleventh album to shed light on Puerto Rico he's recorded many adaptations of its folk music in the past in this new eight parts sweet for saxophone and string quartet he showcases a different cultural tradition in each piece\nThis one Rosario is inspired by the rules are\nTraditionally said on folk instruments at funerals and other occasion\nThey know it's always a soulful player but with the hurricane hitting so close to the session his performance here with the spectral cortex\nTook on special feeling\nThey play his adaptations intense ridden the interaction\nAnd storing knowledge as a fervent prayer\nAs a fervent prayer\nThey know this blurring the lines here between jazz classical and Puerto Rican folk music\nFor that name he find much authentic spectral and engaging quartet well versed in contemporary views\nThey no one's classical minimal isn't can be complex was such a skilled musicians playing their hearts out though even dense idea unfold in a graceful Dan\nHere's Dana\n\nNo no no I'm\nThe most bucolic son on the album da is based on the type of rural folk music they known saxophone goes cinematic here gliding above the strings and sweeping down to move among\n\n\nIt's as if he's intriguing to take a closer look\nWith you saw a lot time does heal\nThe gals they known isn't just leaving a musical flags for Puerto Rico\nHe's composed deep tradition into new musical landscape and recordings so soon after Hurricane Maria hit\nThe resulting album is an imaginative and heartfelt tour of his home and\n\nYelled him by Mikhail ... is used to a lot for your own or reviewer was Michelle Mercer\n[noise]\nThis is all things considered from NPR News\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nRoom then talked to a cottage hospital was on record opposing ballot question won in Massachusetts question one would push the limits on the number of patients are single nurse can be assigned in time and impose or twenty five thousand dollar fine on hospitals would violate those ratios\nAre gr Margot Hartman president and CEO of Nantucket cottage hospital so dollar question one would impose inflexible government mandates on our hospital would override the local decision making of er nurse managers and physicians about how to best care for patients\nFrom the community bulletin board or free class will be offered the next three Tuesday's the great hall of didn't talk it out for him it's titled how to deal in cope with change it'll be led by life and career coach Janna forests\nYou cope with change it will be led by life and career coach Janna fires runs five thirty seven registration is required you to space limitations Red Sox Yankees meet again tonight those are your Nantucket headlines I ... W. N. C. K. Nantucket\nDissident most difficult most complex music in the world and people still come up ...\nLive from NPR News in Washington I'm jak spear President Trump is keeping up top Justice Department official on the job burnout bureau Scott Horsley reports deputy attorney general Rod Rosenstein traveled with Trump to Florida earlier in the day\nRosenstein state has been a question mark for several weeks since the New York times published a story saying among other things that the deputy attorney general had discussed secretly tape recording the president last year\nRosenstein has denied that report Trump spent about thirty minutes talking with the deputy attorney general aboard air force one as the two men made their way to a police convention in Florida\nI'm traveling with broad I didn't know ride before but I've gotten to know that I get along very well\nRosenstein job is politically sensitive because he oversees special counsel Robert Mueller's investigation of Russian interference in the twenty sixteen election Scott Horsley NPR News Washington\nThe large limousine that crashed over the weekend killing ... people in upstate New York failed in inspection last month and should not have been on the road that's according to New York governor Andrew Cuomo says state officials have moved to shut down the company that owned limo pending a full fledged investigation\nSo I think the owner of this young or for a seat has a lot of questions to answer is an ongoing investigation\nBite is there a possibility of liability civil late for him you know certainly\nLimo based on her two thousand one Ford Excursion apparently ran a stop sign slamming into an an occupied issue vie for the country store and cafe and go Harry outside of Albany to protest rings and all Eighteen people on the limo including four sisters were killed vehicles on its way to a thirtieth birthday celebration\nNobel Committee today awarded it's two thousand Eighteen price for economic scientists to to economists NPR's Nick fountain reports their work focuses on innovation\nAnd climate change normally today economists are waiting by their phones but NYU's Paul Romer\nTwo phone calls this morning and I didn't answer either one because I thought it was some andme call so I wasn't I wasn't expecting to direct\nRumors work is about economic growth and how to keep economy is growing his insight\nGovernments need to create the right incentives for innovation strong pat and systems for example he shares the prize with William ... of Yale whose work is on how economies interact with the environment and climate and similarly he says governments have to get the incentives right for example with a carbon tax\nAnd people have been listening his work has been used by the EPA and the UN's Intergovernmental Panel on climate change\nNick fountain NPR News New York\nPresident Trump's former communications director Hope Hicks has landed in New jobs will be taking over his communications director of the newly revamped Fox Company on Wall street today the Dow was up thirty nine points this is NPR\nEuropean airplane consortium Airbus has a new chief executive the company says its borders picked Jiang foul lead a replay CEO Tom Anders in April volley currently serves as president of Airbus commercial aircraft division he was a CEO of the Airbus helicopter division from two thousand Thirteen to last year\nVenom is the new number one movie on the domestic box office charts the psi phi feature took it an estimated eighty million dollars over the weekend NPR's Trina Williams has\nMore than ... big opening of the record for an October new release the character is associated with marvel comic book universe Sony Pictures springs to former Spiderman and him and his to the big one\nWhole have power to say\nSays Tom Hardy Michelle Williams and resume starring this mix of science fiction fight action in a bit of weight\nA star is born when he made with Bradley Cooper and Lady Gaga out paces expectations for a strong ... number two small drops to third while last weekend winter nights ... soft afford that house with a clock and it's ... also get to ...\nTo New Orleans NPR need Facebook\nAs a family knocking tend to just to have you share pictures and videos with your friends now the social media giant wants to get into the live video calling space\nCompanies announced its first brand new electronic device Porto camera equipped gadgets we'll make it easier to make video calls for to come in two different sizes will suffer between two hundred and three hundred and fifty dollars Facebook currently as two billion users\nI'm jak sphere NPR News\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com and the ... foundation\nBy leaps learned your headquarters for IRBs vegetables starters and flowering plants beach there and dinner to go practicing strung community partnerships year round but let's remember ... open everyday celebrating a hundred and Seventy five years with farm who's your farmer\nProgramming is under written by Robert circumcision with Berkshire Hathaway home services island properties providing professional skills necessary to achieve optimum results for his clients email Robert ... island properties Ari dot com\nW. N. C. K. Nantucket from NPR News this is all things considered ... Chang and you report commissioned by the United nations paints a guy or a picture of what climate change could do to the earth more wildfires drought food shortages massive destruction to coral reefs\nAnd this report said that could happen by twenty forty sooner than previously thought\nIt comes as more world leaders questioned the effectiveness of the Paris climate accord a landmark deal finding twenty Fifteen despite all that geography professor bill select the seas reason for optimism he's one of the authors of this report and I asked him to first explain the reports mandate\nIs to assess whether or not the goals of the Paris Agreement or potentially achievable and the results of the assessment illustrate that they might possibly be the assessment as to what in particular as to whether or not there is the infrastructure and physical system is available\nTo slow the rate of climate warming so that we only exceed or reach one point five degrees warming above the baseline level\nOne of the authors that this report says the next few years are probably going to be the most important in our history when it comes to climate change why is that what needs to happen just the next few years\nThe window of opportunity is open and with that we need to act in a way to lessen the likelihood of more significant warming and more significant impacts [noise]\nThere's a clear evidence that action now could forestall a greater impacts in the future and what kind of action give me some examples well the report speaks about potential transitions in a range of different systems that we have developed\nPhysicians and a range of different\nSystems that we have developed the energy systems transport systems a food supply so things like\nConsidering food consumption patterns I'm thinking about the carbon footprint of one's food um things like even as obvious potentially has increased use of electric cars or other you know less polluting modes of transport even the question of of lifestyle in terms of commuting patterns and\nTrying to sort of understand the broadly defined impacts of one's actions\nBut are any of these changes feasible\nWithin the next two decades\nBased older too that we assessed yes there's an increasing mobilization I mean the client for this report we're we're the nation states that being said some national groups you know non state actors or even ... states provinces or international organizations to name a local\nHas engaged in this discussion and I think that it's in the context of widespread engagement where the possibility for collective action or just\nIn the engagement wide enough and intense and that's because the the question now is political will President Trump has withdrawn to us from the Paris accord the front runner in Brazil's election now says if he does when he will do the same which is important because that would involve the Amazon so what political leadership is left\nTo make these massive changes your study says are absolutely necessary\nMy response certainly there is international leadership and in many quarters but also this is not a question that is going to disappear it is a question that will continue to press because the issues are present and growing I think what we're starting to see it as well is\n[noise]\nW. N. C. K. Nantucket\nSupport for NPR comes from the station and from logged me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com [noise]\nFrom exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at color guard test dot com [noise] and from the listeners to support this NPR station\nFrom NPR News this is all things considered I'm outfit Chang\nPhiladelphia is getting closer to opening what maybe the country's first facility where people can use illegal opioids and other drugs all under medical supervision\nAnd nonprofit has formed to launch the so called supervised injection sites as Bobby Allyn of member station WHYY reports Trump mistreating officials are watching and promising crackdown\nSince earlier this year officials in Philadelphia have been studying the idea of a supervised injection site where those struggling with addiction bring their own drugs and use under the watch of medical professionals\nThe creation of the nonprofit called safe house is the most significant steps so far in making that a reality one of the most prominent board members of the group is former Pennsylvania Governor Ed Rendell twelve hundred\nAnd Seventy Philadelphians died of overdoses most of them die alone in the year twenty Seventy so highest rate per capita of any big city in America we've got to do something to stop and\nOther cities grappling with the opioid crisis including New York to Seattle in San Francisco are considering opening a supervised injection site they haven't done so yet California Governor Jerry Brown recently vetoed a law that would help open one saying it would enable illegal drug use\nIts position shared by deputy attorney general Rod Rosenstein who told NPR in August that the Justice Department will not tolerate the opening of a supervised injection site in Philadelphia\nIt remains illegal under federal law and people engage in that activity remains vulnerable to civil and criminal enforcement\nMeasurements Rosenstein um incorporate or of the safe injection site nonprofit an incumbent arrest me first\nAnd Dell says his brazen position takes him back in time to the early Nineteen nineties when he was mayor and welcome Philadelphia's first clean needle exchange during the AIDS crisis but offering clean needles to drug users is one thing inviting them into a building to use illegal opioids is a different matter entirely\nRound the gold find with the AIDS project of Pennsylvania is another board member of safe house the new nonprofit she agrees that it's a controversial idea but the model has saved lives in Canada in Europe\nThe idea is if today we\nCan prevent that fatal overdoses and we can build that relationship of trust then maybe tomorrow or even later today we can encourage that person to get into treatment\nAlthough city officials are not directly involved with the nonprofit Philadelphia's mayor and district attorney support putting the site in Kensington the heart of the city's opioid problem the nonprofit has already raised two hundred thousand dollars but the city council a woman whose district includes Kensington Maria Sanchez is still on the than\nBefore we can talk about saving jacks\nBefore we can talk about savings exercise as a pool within\nOn a recent visit to Kensington the desperation was everywhere\nSyringes and drug bags strewn across sidewalks and train platforms people nodding off in front of homes exit Delhi's leaning against our cars this is how forty two year old ray describes reusing just his first name because he uses illegal opioids\nFor a brand new ground zero zombie lame and it's it's this crazy\nRaise wearing a pink shirt and shorts Phillies baseball cap\nHe says he'd go to the supervised injection sites because right now he uses next to stuff it in our way back yard or anywhere\nThey felt officials won't say yet when they hope to open the doors but one thing is clear they say is getting people like ray off the streets and into a medical facility means defying the Trump Administration\nSo be it for NPR News I'm Bobby Allyn in Philadelphia\nIt's time now for all tech considered\n[noise]\nThis month we're looking at our bodies the way technology sees them here in the U.S we're gradually getting used to facial recognition technology it's in our phones in some airport security systems on social media\nBut how good and and how secure is this technology to answer some of those basic questions we're joined by Alice O'Toole she's a facial recognition expert at the University of Texas at Dallas welcome thank you now I feel like I'm seeing facial recognition\nPop up a lot more recently not just on smartphones but in airport security systems for example law enforcement has also experimented with it was there some sort of technological breakthrough that allowed white or use of this software\nYes there has been a breakthrough or in the last five years or so there's been a new algorithm and it's modeled after the human visual system whereas older technology would do really quite well with well controlled facial images when elimination is good and the viewpoint is frontal\nThis new kind of algorithm is much better at being able to generalize identity across variable images so that crazy facial expression or that you know change in age and so on these algorithms really have the potential to be much better\nAt the task you one recurring issue though we keep seeing is\nFacial recognition technology that miss identifies people of color much more frequently than it miss identifies white people uh there was that one pretty embarrassing incident where Google tagged faces of black people as guerrillas\nI'm just wondering from a technological standpoint why do mistakes like that\nHappen [noise] yeah this is a really excellent point\nThe current algorithms learn by example and examples are basically many many images of a particular person and an accurate label and so you get what's out there and what's out there may not be equally representative of different races\nSo you're saying there just a lot more photos of white people in the databases these pieces of software read that's exactly right so how do you solve this problem technologically how do you make the Web I guess less racially biased you just flooded with more photos of people of color\nYes oh the answer to the question technologically is quite simple if you had equal representation of faces of different races we would expect it would be equally accurate how you make the Web on race biased that's a harder question\nSo even when facial recognition software does work when it is accurate\nThere are some troubling implications when it's linked to a database of images for example civil liberties groups worry that law enforcement could use this technology to target undocumented immigrants or to track protesters\nAs someone who really understands where this science is today how do you think about this\nUm is face recognition technology abused um that's certainly a possibility any technology has the potential for abuse whether or not the potential for abuse of this technology outweighs its utility\nIs something that has to be decided by societies and carefully looking at how it works and making decisions about what the right ways to use the technology are\nAlice O'Toole is head of the face perception research lab at the University of Texas at Dallas thank you very much thank you\nFor all tech considered comes from the ... providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and diabetes solutions an industrial scale learn more it's the three ... dot a ah [noise] and from ultimate software\nProvider of cloud based HR payroll and talent management solutions for the modern workplace learn ... software dot com ultimate software people first [noise]\nThis is NPR News\nWhen the Greek debt crisis had many European officials were letting Chinese shipping company over for some European observers have regrets\nFunds or if they if they find the same in Europe of\nSigning gaining a foothold in Europe are taught more [noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\nThere was no safety regulation how do I make a case that perhaps this is not a good idea I'll just tested on people and so he did\nNo one surprise if you feed people formaldehyde or snack or lead they will get sick and when you demonstrate that why does it still remains so difficult to outlaw formaldehyde arsenic or lead in food why was it just not an obvious thing that everybody got on board with right away\nAnd doesn't that sound like the most logical response so look you've ... you've poison people let's get that out of the food supply to the food industry\nHas been organizing itself to fight regulation probably at the point that widely starts these experiments and nine to you know to he had been advocating advocating advocating and working with Congress men to try to get some kind of basic consumer protection ... regulations out there\nIf nothing else labeling and\nAs he does these experiments and ads they catch the national attention which they did they were front page news there were songs and you know musical numbers about them every one is suddenly realizing that there was a lot of bad ... stuffing their food there's just a lot of bad stuff in their food and\nSo there was this in media push back\nRight to in which suddenly congressmen or on the side of food business or getting offered more money and the food industry actually organizers\nThey create a food Manufacturers Association and and and coalesce against making sure this doesn't happen and they were phenomenally effective\nAnd yet despite these long fought fights of spam decades today there isn't lead and formaldehyde an arsenic in food the way that there was a hundred years ago progress really was made\n[noise] yes once this\nFirst food safety law that passed in Nineteen oh six two years after a while a finished his\nFamous poison squad experiments wants that law went into a place\nWe started pulling stuff out formaldehyde when outsell a silicon said went out bore acts went out we are cynical it out right you really see government stepping up for some of these outlook extremely dangerous compound\nIs this book just one big argument in favor of government regulation [noise]\nIn part because it certainly\nShould be a reminder\nAh the before government regulation food was a constant unknown and often terrifying risk to American consumers and put our lives at risk but it's also I Hope just a good story it's a story of something that I Love\nI Love these kinds of stories it's a story of a single person who changes the conversation right and I think that's really important to we need to remember\nThat someone who is focused and even obsessive and and who stands up relentlessly for an issue can actually make a difference so I Hope it works on all those levels\n... new book is called the poisons squad one chemists single minded crusade for food safety at the turn of the twentieth century thanks for talking with us\nThank you so much for having me on [noise]\nTomorrow on MORNING edition Jerusalem has long been a pilgrimage site for people of many faiths after the U.S embassy in Paris a few months ago some religious American saw another reason to come they say the embassy represent something biblical\nThat story tomorrow on MORNING edition you can ask your smart speaker to play NPR or your local station by name [noise]\n\nYou're listening to all things considered from NPR News\nHow the top of a ballot can impact local races down ballot is the question more typically posed during presidential election years\nBut this year a controversial Senate candidate is running in Virginia and that could have an impact on whether Democrats take control of the U.S house Mallory Noe Payne of member station WBFO ts reports a few months\nBefore last year's deadly unite the Right rally in Charlottesville Republican Cory Stewart stood before a stage draped with the Confederate battle flag he told the crowd you was proud to be there\n[noise] not owners is [noise]\n[noise]\nThey were had made a name for himself by associating with white nationalist he wants to deport immigrants who may be here illegally and after the unite the Right rally he falsely claimed left wing activists for the violence\nNow he's running for Senate and inspiring I roles from Republicans like Matt Walton\nAs friends that are ... just frustrated at our really debating whether it's worth showing up\nAt the polls in November\nStewart is a local government official and a strong supporter of President Trump he's proud of stirring up Virginia politics\nOr speak to my mind and some people are afraid of controversy when they run for the hills of the first chance that somebody talk about something that's controversial I'm not like that\nBut those tactics haven't proved popular with most Virginia voters incumbent Democrat Tim Kaine has held a consistent double digit lead in the polls nationally Republicans don't expect the race to affect the balance of power in the Senate\nThe worry now is whether it could affect the balance of power in the house as many as four Republican controlled house seats in Virginia could be in play this election Democrats need to win at twenty three seats to take the house Stephen Farnsworth is a professor of political science at the University of\nMary Washington stewardess only collecting about eighty percent of the people who identify as Republican Farnsworth says this\nIs this close to election day expect that number to be above Ninety percent and\nThat lower level of support for Cory Stuart may mean at some Republicans will stay home and maintain some Republicans will donate money means that some Republicans won't show up to knock on doors and\nEvery door knocked every call made every dollar spent could make the difference [noise] one of those close races in Virginia fifth district\nA recent debate between Democrat Leslie Coburn Andrew Republican Denver Riggleman was held in a high school auditorium Jim Smith is vice chair of the Madison County Republican committee he shrugs off the idea that Stewart unpopularity could affect other candidates\n... rock solid that was one on one was for a job for a vigil liberty and that's really what we could build\nStewart has mostly been campaigning alone and other Republican House candidates have largely been avoiding him Denver Riggleman the GOP candidate in this district says the Stewart campaign had no impact on him positively or negatively\nCourse electro wasn't a great you know but right now I just see with his business schedule he's not going to be able to do the\nLittle man and other Republican House candidates say they're focusing on their own race in this final stretch to election day for NPR News I'm Mallory Noe Payne in Madison, Virginia\n\nThis is all things considered from NPR News\nLosing a loved one is traumatic and planning a funeral on Nantucket can be daunting John Lawrence funeral home is here to assist in your time of need we handle every detail with grace care and precision John Lawrence funeral home type zero eight four to eight five seven zero four\nOh\nMm", "show_name": "Classical Music with Ray Brown", "year": "2018", "city": "Nantucket", "day": "08"}