{"month": "10", "state": "MS", "station": "WMPN", "content": "And she said I\n\n\nBeen known to you\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\nOr you go pretender with mystery achievement on World Cafe also the tide is high from bloody and John Lennon\nJust like starting over gotta think are silly it's including W ... PRN lender Wisconsin ... NBA Anchorage, Alaska they support the world cafe thanks we produce the show the ws ... from the University of Pennsylvania in Philadelphia I'm glass thanks to listening to World Cafe World Cafe\nIs supported by visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum that you're holy collection and the museum of fine arts more at visit saint Pete Clearwater dot com\nAnd by isotope makers of fire studio the wireless portable recording studio that lets musicians and podcaster capture mix an added songs wherever and whenever inspiration strikes learn more at ... dot live\n[noise] [noise]\n[noise]\nDing ding ding ding\nDing ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding ding bingo\n\n[laughter] [noise] [noise]\nHi this is Chris daily inviting you to join me right here every Saturday for a prairie home companion we'll be joined by the musicians some yellow and others you might not know yet but we'll\nPlus a bit of comedy a new song of the week the powdered milk misgivings instance armor question I don't know if you're going to surprise them as well All right here each week on the prairie on Saturday five on M. P. B. music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi WMA Google W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be online duck\nGee\nDo listening to World Cafe on ... minutes to ... this hour in addition to the actual into diverse array of music we'd gotten prepared for you know I've noticed some quoted guitar playing like one of the greatest guitar riff that or maybe we don't go\nBan and you know we don't know when we know you're\nOne that second one was the Jimmy page\nBut I Do know very clashing performed still on after midnight\nSmoking and let's not forget the incomparable Susan today ski on you need to be with me\nGreat guitar playing today on World Cafe\nSo already mentioned the guitar part of the show that's like a huge contingent but I I think I Would be doing a disservice to the new Jimmy ... song and new Mickey that I'm going to be playing for you as well so you have some options in the world he got some rocky got some aren't the got some Indy\nAnd we're getting started with ... [noise]\nSo good nice deal one time one night\nKnow about what\nHe oh\nCindy Williams something about what happens when we talk if you know the answer to that question let me know how the court Elvis your town before that\nIf you missed any of our sessions you could check them out at World Cafe dot NPR dot O. R. G. one that I Am a huge fan of is with the ban the record company so if you're looking for some straight ahead rock and roll with just a touch of earnestness\nThere you're bad record company I'm getting better\nI'm I'm you know I'm ... now are you in a rat\n[noise] wow\n\nAnd they draw\nThis at all [noise]\nNah\nNah nah\nIn all of them a chance [noise]\nYou know I'll be I'll be happy with Iraq\n\n\n\nWhere would you miss the\nHuman they are on the way down at\nJust in the wild man them all trying to do with them away\n\nI'm right now I'm Better [noise]\n\n\n[noise]\n[noise]\n[noise] wow\nYou know\n[noise]\n\nMm Mm Mm Mm Mm Mm Mm gr\nBurner urban\nYou know where do you do when we know all\nDon with Johnny bombing in ... they do\nKnow the way down here I mean you know basically don't go\n\n\nYou know real to\nGet to Reno him like\nWhoa you know there's no\n... no\nMy maiden name and\nLand and you know so maybe we don't go\n\n\nNah\nWe don't\nYou know you know\nThe [noise]\nOnly [noise]\n\nYou know\nYou can\nYou imagine being\nSo good so good that guitar playing Susan ... who you need to be with me also them they'd be please don't go and I'm getting better from the record company coming up it's a family affair on World Cafe\nAu\nMy son being\n\n\n\n\nAnd then my\nOr is that right down man\nWill come\nAnd bomb in\nBay\n\nSt John John and John John John John in you know\nGave them in a\n'em in the\nBut may be\nA\n\nCage done rather acclimate jobs you know big by John and then you know they don't do the\n[noise]\n[noise]\n[noise]\n[noise]\nThey a lot of people\nListening right now to World Cafe who are very curious about this cover of gangsters paradise by Stevie Wonder we regret to inform them that it is an original called past time paradise recorded\nWay back in the Nineteen seventies from songs and the key of life and wonder had so many brilliant songs that were later sample by hip hop artist\nShe Mueller words with Giovanni before that putting the rats in the tradition of World Cafe\nK. R. V. ash Lafayette, Louisiana and K. I. S. U. Pocatello, Idaho partial each of the world cafe nationwide thanks so much for your support and we produce the show a W XP on from the University of Pennsylvania in Philadelphia my name's ... contributing house thinks you're listening to World Cafe\n\nIn the summer date Matthew told me about a band's latest album the departure of violent or you can buy see on the air from late ...\nMore Royce said to me if you don't leave this band Oregon [noise]\n'cause somebody has to be used in\nYour life performances by David ... band and encore edition and the next World Cafe [noise]\n... [noise]\n[noise] music fans have been around you know that there's always more new interesting music if you know where to look the discovery never stops and young fans reduction\nSnow the musical going to be under some connections between generations cultures\nRoots bones bone indie pop needed\nIt all close together\nOn Sunday night at seven\nOn MP being music radio stations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MP be music\nMuch an online at him be be online or gee [laughter]\n\n[noise]\nPretty safe to say musical composition is more ... than a sprint\nConvene a marathon there's usually a runner who keeps the pace for most of the race\n\nFor Mexican propose or my welcome chain worked on this ... for a long time but who managed to finish it after another composer beat him to the finish line with a different ...\nAnd at that point home team focused on putting together the folk themes harmonies that he wanted to you created this can change all of the south which you can hear just fine\n\nMy name's Andrea Blaine that's it's music through the night\n\nThen there's been a\nNumber of other\n\n\n\n[noise]\nMm\n[noise]\n\n[noise]\nMm Mm\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n... of the south with the philharmonic orchestra the Americas all under dental powers conducting popular sounds the not the guitar suddenly coming up music by Chopin\nMm [noise]\n[noise]\n[noise] ... now they say the ... the more scared so you do me is the piano\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nMm\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\nMhm [noise] [noise]\n\n\n\n...\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n\n\nMm\n... the\n... ... ... ... [noise]\nNa na\nNa na na na\nNa na na na na na na na\nAnd ...\nThe [noise] the the\nNa na\nMm\n\n[noise]\n\nNo\n\nMusic ... the nocturnal music ... Madrid Clinton Keno with Clinton to Boston rainy performing right here on music through the night time on the plane thanks for your company\nGet your ... any time he doesn't even have to be up for renewal simply go to your county office sign up when you get ... pushing the helped Bebe to educate informed entertainment\nFor deep camp camp Eby on line ... slash our cat\nWe'll see you on the ground\nThe stations have been ... music radio R. W. M. A. H. Biloxi debate you may ... ... you may you view\nW. M. P. in Jackson W. M. A. W. ... have you and maybe start W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at MVP on line or gee\n\nPicture's worth a thousand words how many musical no\nMost of the picture is his vision of heaven\nSixteenth century altering the [noise]\nThe composer Paul he was deeply moved by the work at the paint Timothy is concerned about music it's hard for me it's\nGood to hear what the sounds likes filtered through Petersburg Russia and the musicians\nWho just over half an hour\nRight here on music through the night\nI'm On the plane into a new company\n\nHere's the music for when played by the silver when it's fine and the bell not the second one of ...\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\nThe\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\nOoh\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\nBy the painter grew in his old and he wrote an Oprah based on the life of the ... and then that became a symphony which he used his teams from the Oprah\nThis section she picks the descent from across the Atlanta symphony orchestra with ... conducting\n\n\n[noise]\n[noise]\nMm [noise] Mm\n\n\n\n\n\n\n\n\n\nNah\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n... lovely inspired by the distant from the coldest portion of ... Green Belt alter peace pops into music ... piece there Mahler yeah labs symphony orchestra you made by your let me\nAnd then the music you and I think the page I just posted an article about other he thinks that have inspired school music I Would look at that\nBecause you know by ... skinny played the piano for this when he was just fourteen and then later performed Brahms piano concerto with the composer conducting brand man you can also must must be they can sell here's one of his work\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise] Mm\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[laughter]\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[laughter]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise] yeah they can have any brand new text take orchestra facts aren't they push the\nShallow me all the Indian Ocean hosted sounds Jewish every Sunday you present an entertaining our Jewish music and usually comedy the chance from New York from Israel\nWhen you just from Europe shouldn't Jewish some American South\nYes sir\nI Hope you'll join me I'm sounds Jewish name three PM in music radio beyond ...\nStations have been ... music radio R. W. M. A. H. Biloxi it'll be in may ... ... you may you view\nThere'll be MP in Jackson W. M. A. W. ... have you and may be struck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen on the line at M. B. B. on line or gee\n\nWe do is just around the corner so let's talk about\n\nMagic ... trees warm weather [noise]\nTend to me ... ...\nRight [noise] [noise]\nWell if it's not that you see where this music called spring is concerned he ran he chose to focus only on the first part of all that\nBut what kind of reports\nYou grow up in the evening flowers that about two things\nYou can learn a lot more about getting the spring late summer\n\nMusic for the hot now by the twins yeah this is contemplation\n[laughter]\n\n\n\n\n\n[laughter]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [laughter] [noise]\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise] [laughter]\n[laughter]\n[laughter]\n\n\n[noise] [noise] [noise] [laughter]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\nPretty exciting just teeny was the first musician every to own one of the famous Stradivarius violins and he may have played that Saddam to on a ... for ... my ... any time led by the violinist and we go to Santa\nIs you know did you see it's cold spring but it doesn't just picked a like the season of spring break meant we burst into a human life he said not a descriptive spring time but a human springtime seeking get your head right and that's when as you listen to the music\n[noise]\n\nMm Mm [noise]\n[noise]\nWhoa whoa whoa\n\n\n\nI'm\nNo no no\n\n\n\n\nWe're\nNot\n\n\nHow did he sees spring knocked a descriptive springtime buddy human one he said the new sell her money ...\n\nGreat orchestrating full flight is the most amazing thing pretty can lead to experience that real every week Hi this is Brian new house we touched down and terrific orchestra towns from Boston to San Francisco and get the best of Europe and Asia\nAll captured my encounter ... from American public media Sunday Morning at ten on MTV music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi debate you may ... ... you may you view\nTo be in the Jackson W. M. A. W. Rudy it'd be it may be struck W. M. A. V. Oxford W. M. A. O. ... chicken what's happening on MTV music radio and listen on the line at him be be online\nOr\nThe English poet TK chesterton had this to say about the Irish\nThe Greek games by your man gone mad\nFor older wars I marry\nAt all next song\nNo not that close but I'm not sure that it applies to think English inspired music taxes to put them into the twilight\nBased on the Celtic Mitt\nAlso wanted to marry the injury that she had other ideas the story involves some that isn't particularly side and the war that definitely Mary you're going to find out more later\nI'm Andrea blame [noise]\n\n\nMusic now by George pretty handle me we flush yeah ... ... with ... actually in the Academy of music\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nThe ... conjecture by retired strong civil was their race still with the Academy of London orchestra connected by Richard stand up and that's the name of Irish beeper me anything you\nKnow\n[noise]\n\n\n... fever was known as one of the most skilled violin players in his time his plane was judged the most difficult and that's a full of the period as you could imagine he wrote a lot of pieces showcasing has extraordinary talent is one of them\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nI buy fascinated with Ireland Irish legend that wants peace depicting one of those in the highlights right Thompson that to the ... ...\nThis week on a special issue\nSo the Mississippi ... Senate seats are up for re election in the general election state representative\nDavid barrier is going to unseat incumbent senator Roger Wicker in Mississippi it's time for change there's also a special election to fill the remaining term of service I talk in the second Amendment rights were\nVery important to me now to make sure we can talk to the right direction I don't think much too much and then there's a lot of stuff that are being discussed broadly at seven thirty pm on MP beating the\nStations have been Bebe music radio R. W. M. A. H. Biloxi it'll be ... ... ... you may you used to be in the Jackson W. M. A. W. we're ready to be in may be struck W. M. A. V. I. B. M. A. O.\n... ... what's happening on MTV music radio and listen online at him be be on line or gee\n\n\nNot pecan pie kept them all my dear and cause huge huge crowds seats [noise]\n... also requires a castle to burst into flames\nAnd also the appearance of sent me to vision [noise]\nWas that kind of tricky to get on stage\nAnd there's a scene requires skaters\nPeople skating\nTwenty this music comes later this hour you can you hear something from\nWhat must be one of the trickiest prince just teach\n[noise] there's music playing for you by the national team players I Am divorced from I can tell\n\nYou my my\nMy um\nI look\n\n\n\nOn\nOther one\n\n\n\n\n[noise]\nDo you remember when I\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\nMm\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\nUh [noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nMm Mm\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[laughter]\n[noise]\n\n\n\n[noise]\n\nYeah my friend bridge quite well known as having been the teacher of Benjamin Britten but as you hear quite the composer and his own right to piece of the north and Tony nice by David Lloyd Jones\nUp I had a pretty complicated oh\n\n\n\n\n\n\n\n[noise] music now by Jack Ma Myra bear this has got to come from one of the most complicated Oprah's ever composed in this segment\nFarmers skied across a link to bring food which has been paid for with money stolen from ... just don't ask just enjoy the music\n[noise]\n\n", "show_name": "BBC World Service", "year": "2018", "city": "Jackson", "day": "30"}