{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n\n\n[noise]\n\nWhat a great complements have rhythm guitar in Oregon that was Julian Casper with flipping time it was Samantha Fish on undercurrents with who's been talking Ellen jewel with I'm a little mixed up and Tracy lean Nelson with my baby Joanna\nIt's been a pleasure being with you this last hour for more information about anything that you heard you can check the playlist out at undercurrents radio dot net this issue number forty seven sixty six thanks to Greg make bigger Christina on his dad and joke Uri I'm ...\n... is made possible by your support thank you so much and also by the corporation for public broadcasting and envy one stations like Ken is Sam in clear lake Mason City Iowa and Wu K why in Lexington, Kentucky\nThis is native voice won the Native American radio network [laughter]\n\n\nThey're they're they're okay okay [noise] [noise] [noise]\n\n\n\n\n\n\nMm\nAn evening of Jazz Can be just what the doctor ordered to take the great Ella Coltrane Dinah my mom\nMakes and the contemporary giants like sure green more from Malone and Vincent joined me Marin Michelle the W. J. yes he's eating that seven to ten we\nOnly NPT me music radio\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP online duck or gee\n\nUnder ... like I said I'm here with you with some great music lined up for you we hear from ... ... a month to old Ninety seven's Jackson\nAlan and more and to get the ball rolling here as Eric Clapton [laughter]\nMm Mm Mm Mm\nReally arose\nLoaded into the school that was\nReal little runs deep as long as ... as a\nJob good\nMaybe she did\nDo is bring the roads deeper waters goals that is\nPain no no no no man who blew\nThe main\nThing to do big to live\nLast what it is\nBomb in the\nRegion or those who was in school but\n\nGene will do do good man\n\nJesus ball the gold and get a good man\nLot to do\nIn a bad the Muslim\nBrothers the\nOh oh oh oh well we were\nWhen\n\n\nWe see\nThe I Know mortal orchestra with honeybee also monthly gave us in San ... a meta thinking about my life and Eric Clapton brought us river runs deep\nIt's under current I've got to be under rocky Donny and ruby among fool are cute out but first here's native artist Robbie Romero [noise]\nReally [noise]\nTrading walking\nMuch [noise] so\nDid the friend\n[noise]\n[noise]\n\n\n\n[noise]\n\nHave been\nDone\n\n\n\n\nMm\nMm Mm Mm Mm Mm Mm Mm Mm\nOh yeah well [noise]\nI'm In a row to live a\n[noise]\n\n\n\n[noise]\nGrow their own\n\nKnow do a show\nOn a low\nShe made she rolls I can get a\nBill or even now you know throughout the young man and\n[noise] ... [noise]\n[noise]\n\nThis Jackson Browne you're listening to under ...\n\n\n[noise]\nYou about the young man was in college and this is sue sue the road but you know well yeah you know be you know was this all out\nOf the bag and you can you you would soon as she was right now which\nWe may be you know one of those\nNews the\nI'm\n\n\n[noise] [noise] [noise]\n\nMm Mm Mm\nMm\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise]\nAn instrumental version of millennium car from keep the cola it with Lindy or take on undercurrents with the comeback kid cue violin brought us by ...\nAnd Tim O'Brien gave us old Joe it's been a pleasure being with you this last hour having picked out the music for you I Hope you enjoyed it for more information about what you heard checked a playlist out at undercurrents radio dot net\nThis show number forty seven sixty six thanks to Greg and bigger Christina on his dad and Joe Yuri I'm going to be elected on\nUndercurrents is made possible by your support thank you and by the corporation for public broadcasting and envy one stations like Cape UPS lp in St Louis park Minnesota and W. M. A. V. in Oxford, Mississippi\nThis is native voice won the Native American radio network\n[noise]\n[noise]\n[noise]\n\n\nAttention all educators MTV has partnered with the secretary of state's office does\nThis year's promote the voter initiative or help your students learn important lessons about civic engagement while having fun in the classroom this opportunity is for K. through twelve students across Mississippi get them engaged with the ... election plus are an essay contest for more information about promote the boat\nOr just sign up your class or school visit\nMBP on line ... ...\nDecisions have been people be music radio R. W. M. A. H. Biloxi WMA Google W. M. A. U. Butte\nThere'll be MBA in Jackson W. M. A. W. Meridian W and maybe dark will W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him be be online duck or G.\nWe may H H de to Biloxi WMA E. H. D. too ... W we made you a G do viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. do Ackerman W. M. A. V. E.\nSee to Oxford WMA H H de to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA oh H. D. too Greenwood W. N. P. N. H. D. to Jackson\nW. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nWMA H H de to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. P. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nWMA H H de to Biloxi WMA E. H. D. to boot WMA U. A. G. tube viewed WMA O. H. D. too Greenwood couple un P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. P. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nWMA H H de to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nWMA H H de to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA oh eighty two Greenwood W. N. P. N. H. D. to Jackson\nW. M. A. W. H. D. too Meridian W. M. A. P. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nEthical is your home for the great American song book each week I'll showcase the best in local jazz in popular song the Nineteen thirties\nDo today from Frank Billy and Ella looks like curtailing Dianne Reeves and great reporter Margaret chill out and spend some time with after low Sundays and things on MTV music radio\n\n\nStations have been people be music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe start full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him he be on line duck or gee [noise]\nA great orchestra in full flight is the most amazing thing and simply cast lets you experienced that thrill every week [noise] Hi this is Brian new house we touched down and terrific orchestra towns from Boston to San Francisco and get the best of Europe and Asia\nAll captured my encounter a symphony cash from American public media Sunday Morning at ten on MTV music radio\n\nEverybody on their feet both in the audience and onstage as best they can if they're not playing to the word cello performance up South African national anthem of course I rode the star Spangled Banner\nGetting the music underway this broadcast coming to you from ... South Africa\nRuben from here on out which is a mixture of pieces from Ken in the western classical music and from South Africa because she was going to be joined by South African singers in one of the highlights of the program coming up and just to use the word commission or this to work from the south African composer\nBut they only have to begin working finish countrymen twenty two Ninety two movies you\nTo start this concert so well\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\nMm\n\n\n\n[noise]\n\n\n\nThat that\nThe other one\n[noise]\n\n\n[noise]\n\nFree on my broadcast\nRead you wouldn't be true even if I can use it can be\nNext is music from South Africa the premier of harmonious boon to by South Africa's bone Donny and don't Donna Reed is peace sets to music doesn't short sings of Nelson Mandela the father of modern South Africa who would have turned a hundred\nLast month or so that was it's remarkable young Vulcan the Sopranos I'm South Africa which among the ...\nOne of my favorite lines from the takes it says\nThe greatest living lies not in never falling back in rising every time we\nSo that's like one of the lines that I always find myself seeing even when I'm walking the street and\nResonates with me and I feel like you can resonate with anybody in the world you know it's not specifically for\nAs South Africa and that it can affect you can't change everybody's\nJust pieces for full orchestra\nEspecially up very busy percussion section and it's full of the rhythms of this culture which started in cycles over and over again intricate variety composer ... knows this might be a little tricky for American audiences on first hearing\nThe cannot use to all the details in just one policy so you've got to keep 'em which is why African music ends up being cyclical\nBecause with the mayor\nEach time it comes around you get to see another level of detail another level of detail another level of detail\nWe see each repetition\nDemeaning gets deep into deep\nIt's called Donnie ... Donna Reed is in the audience tonight very proud to hear the launch of his brand new piece some of the Texas from in Delhi you'll hear begins with I learned the courage was not the absence of fear that the triumph over it and the brave man is not he who does not feel free\nWas a socialist standing right next to ... for the premier next of harmonious boon to musical into Donna Reed\n\n\n[noise]\n\n\n\n[noise]\n\nSo for me\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\nIn a\nI'm alec and younger you are listening to a very special concert from the way down south Africa the Minnesota Orchestra is the first professional American orchestrate to be invited to play in South Africa\nAnd they are celebrating the one hundredth anniversary of the birth of Nelson Mandela\nYou can listen again to this concert with the Minnesota Orchestra in South Africa just go to our website your classical dot org slash sympathy cast\nIn just a moment for writer joy will ring out through the sanctuary of Regina Monday church and so what do South Africa when the Minnesota Orchestra it's the finale of Beethoven's ninth symphony it's up next on APN sympathy cast\n\n\n\nWelcome back APN symphony cast were and so what do South Africa with the Minnesota Orchestra on tour I'm Alison young and I'm going to send the microphone back to my colleague brand new house who was at the concert on this beautiful evening back in August\nYou're listening to the Minnesota Orchestra live and concerts and programs coming to you from sweater is part of a five city tour of South Africa that the orchestras making\nIn celebration of Nelson Mandela's center\nIn a few minutes the Minnesota Orchestra is going to be joined by fifty members of the Minnesota corral\nThe final movement of Beethoven's ninth and several South Africans on\nA local choir the ... singers joined them on stage here in ...\nAnd ... this week the Minnesotans top of South Africa and how to sing Beethoven's German South Africans taught the Minnesotans singing ...\nWhich is one of humanity is rare clicked languages corporate ... the tone that can be comical card westerners to master\nThese two choirs largely white and black struggled together laughter took tons of selfies started friendship the Minnesota drills artistic director Kathie Saltsman real\nYou meet people from other parts of the world and you were in their country in their own experience in their culture it transforms you in ways for the rest of your life and I think the fact that we have in the Minnesota corral\nSingers of all ages young people and singers who have been with the crop for many years to experience this together and to understand\nA little bit just a little what to journey is of other people in another country and especially in South Africa\nExperience their journey and understand is from them and then to scan side by side to sing with them will be an absolute fleet transformational experience we will walk away different people\nTo think it's been really missing\nThe orchestras coming back on stage or now is Regina Monday church where the final moments of Beethoven's ninth\nPrincipal base Kristin ... has been looking forward to this moment more than any other\nSharing the music of Beethoven's ninth symphony\nIn our concert that we're all in this life together\nReflects Mandela's message\nOf unity peace and harmony and I think that that\nYou know it gives me a shivers just even saying that but I think having this experience is\nIncredibly powerful for\nOf our country if you're getting with\nCalvin symphony number nine [noise]\nWho's the joy the Minnesota Orchestra conductor if I sit here\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\nDa da\n\nDa\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise] [laughter]\n\n[noise]\n[noise]\n\n[noise] what's your work you know just be on a potential for to ... pm so stay with the Cleveland Orchestra led by George sound does music through the night\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise] I\nNick scars and a week and I was really proud of myself\n[noise]\nAnthony divorce ox composed the string trio and just a week which\nMakes my scars she likes nothing at all\nYou was intended to be played by divorce I can tell on viola and two students on violins just for fun but it turned out that it wasn't as much fun for the students in fact the music was too hard from one of them so what was that proposed another trio that had an easier part of that\nI have to say I might just have given up and needed a scarf instead you're going to hear the harder trio and just five minutes right here\n\nThis music ... is a concert sweet with the subtitle the end\n\n\n[laughter] [noise]\n\n\n[noise] [noise]\n\n\nMm [noise]\n\n\n\nMm\n\n\n\n[noise]\nMm [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\nHalf\nAn hour\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\nMm\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\nYou can hear the al ... ... Syrian that's coming out I'm a ... piece orchestra music cheaper music in fact called ... thank you for me to say for you by the the un factual so\nNo cars will deter some national debt your story how enough that name once played string quartets with heightened and they'll turn and found out that was kinda\nNice but you could call it a classical super group of the time this is a piece of does your daughter means he gets a symphony which the unusual title of the transformation of the nice seeing hasn't he's attending\nDa da da da da da\nDa da da da\n\n\n\nDum dum\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDi di di Carli that is fun district stores I don't know why I Can't see that name clearly the transformation of life seeing his name off that piece subtitle can't Elaine was led by eight shepherd\n\n\n\n\n[noise]\nIt's music have the on stacked against it from the very beginning [noise]\nWC started writing symphony when he was just the teen [noise] now I have a feeling that he did that made me because it was sort of a thing to do if you want to be a composer [noise]\nHe got his first one [noise]\nThe problem is that there's a work by ... bc called simply today\nYou hear the music and you find\n[noise] it just means you buy the remarkable the grand jury called deep in movable do\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\nMm\n[noise]\n[noise] [noise]\n[noise] [noise] ...\n[noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n...\n[noise] [noise]\n\n[noise] [noise] [laughter]\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise] [laughter]\n[laughter]\n[laughter]\n[laughter]\n[laughter]\n\n\n[laughter]\n[noise] [noise]\n[laughter]\n[laughter]\n[laughter] [laughter]\n[laughter]\n\n[laughter]\n[laughter]\n[noise] [noise]\n\n\n[noise] ... music by Musashi ... not enough for them to be honest outfit print\nNow by the English composer Arthur bless you served in the British Army throughout World War one can you really did know things are a trench warfare\nKind of amazing blessed in marriage to begin a career right to music that's what he did and here's one of his pieces now or catch a study number three feet by the English noted you tell her money\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[laughter]\nAugust ... W sees abortion symphony the symphony you never finished but played for you there by the neo national orchestra you Michael conducting a bit of a triumph that I think if I had a birthday coming up for one of the world's greatest guitarists\nOh no no\nNo\n\n[noise] now that they run their role is one of the greatest guitarist of the last century he'll soon be celebrating his Seventy fifth birthday this is one of his many many recordings that Luigi ... guitar quintet number six he's joined by the academy Chamberlain some\n[noise]\nIs just going\n\n\n\n", "year": "2018", "show_name": "BBC World Service", "city": "Jackson", "day": "10"}