{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n\n\n\n\n\nFrom all things must pass George Harrison Ford why why\nNothing else in Kentucky for Iraq like that once you go all the way back to it you know the shrill\nWho I think we can agree influence George Harrison vibe remembering New Orleans a big challenge now in Tucson was here a little girl from American too and it was Robert Romero and French was born on the rats\nThat wraps up this hour thank you for being with us thank you for monitoring is becoming a senior homes and cars and workplaces we don't take that likely we do our best to be\nGood house rates for workers\nAnd recover works out for everybody\nTo a couple of quick things we ever played list on line to undercurrents radio dot net showing number forty seven fifty nine by the way or play which is totally mobile friendly and there's a real option the press weekend if you missed on because weekend on the air\nYou can stream it right there with the oil and everything after two hour special every weekend\nOr go to undercurrents weekend dot net things georgine ... cost along Christina on his dad and Joe Yuri agreement vicar support comes from the corporation for public broadcasting the fringe of under current interim envy one stations like\nKeep your W in Barrow, Alaska and WTO you are in Brighton rose Florida and this is ... voice want the dean of American radio network oh\n... ... ... ...\n... ... ... ... ...\n... ... ...\n\nFor Twenty years the world cafe looking forward to what's next to music and keeping an eye on the rich miserably past I'm David dye would live interviews of music do you need to know about I mean you may have never heard before but I'm sure to lobby the world cafe become Public Radio's Muslims who do popular music program\nDon't miss our next show today to a gym on M. B. B. music radio [noise]\n\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening\nOn MTV music radio and listen online at ... be online dot O. R. G.\nO. Ryan some deterrence I'm grading the richer welcome music from the bow deans up ahead vampire weekend low super seven to really go see a country Joe macdonald let's get started here with\nLord echo\nThat we\nAll\n[noise] and if you're\nA teacher and\n\nYour\nShow\n[noise] [noise] and\nJust getting by\n\nTo protect\n\n[noise]\nThat in [noise]\n\n\n[noise]\nMy morning jacket with a whole lot to black metal from circuitous all\nRecorded that in the gym with the church down the basement cold and they sit around the circle and played one of the SARS my morning jacket and it was country Joe McDonald would support the troops\nRich weird a lot of back in two thousand six and now we're a decade later he used to be right so after about you know human tool\nIt's under current some great record John Paul white they had that power weekend Bill Miller yeah let's take flight with the voting snow\nAlong with the you don't do\nNever change the woman who will be going to say ...\nI Am Buffy St Marie in this\n... I haven't\nAnd then did mention anything really think that sometimes\nTo change [noise] and\n\nNext day who who put out in the number who knew\nIdeal we could show\nYou know we do know that when this day and then I Do think yo I have the right she says\n\nWho wants\nI only learned about\n[laughter]\n[noise]\n[noise]\n\n\n... every year\n...\nOn that later\nMm\nMm I\n\nDon't know about\nThat\n\n\nDon't and then somebody or known that\nYoung man named borderline\nMan\nYou're not going to have on any like we\nUh\nI'm\nNot from Miami ...\nDo it in ... in ...\nBoys and\nYoung adulthood I've learned later we\nUm\nUh oh\nNa na na\nThat later on in my mid\n\nThat like I Know I'm On a lot of the guys on one\nHand well your your mom on here\nYou know getting then who am I here in the\nHe's not only an astonishingly good song writer but he can play the heck out of the guitar that's Bruce Coburn would bohemian three step from small source of comfort go Ga on undercurrents eyes wide open and it was Bill Miller\nStockbridge Muncie blind faith that's from chronicles of hope well this has been fun hope you enjoyed it and hope you get a chance to visit a subtle lying under current it's radio dot net yeah it'll look good on your phone your Patrick computer because it sort of adapt to do whatever you use\nAnd it makes it easy to find a playlist shouldn't but forty seven fifty nine\nOr stream the show and take it with you out of Radio Free\nAnd just remind you that undercurrents weekend also streams off at the site just click weekend and you can check gets weightlifting tickets would you would share the show which is co hosted by our colleague Gabriella cost a lot\nShe also helped out with this show along with Christine to understand and Joe ... a great with Becker its support comes from the corporation for public broadcasting from the fringe of under current and from envy one stations like can you when you and Albuquerque New Mexico and ... actually in Grand Rapids Minnesota\nAnd this is needed voice why the Native American radio network\n\nEvening and chance can be just went to a doctor ordered to take a great\nElla Coltrane diner mine among [noise]\nMake seemed to continue the giants like short greeting alone in dense [noise] join me in the army Michelle the double duty as seen any cats [noise] seven to ten we\nOnly NPT music radio\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP online dot O. R. G.\n[noise] [noise] [noise] [noise]\n\n\n[noise]\n\nOn TALK of\nThem all the while\n\nOn the wall you know and he didn't make me\nDa\n\nDa\n\nDa\n\n...\nNo no no no no no no\nNo no to\nLower\nThe machine is one of those\nMay be even though\n[noise] [noise] mhm Mm\n[noise]\nThat too [noise]\nMm\n[noise]\nMm [noise]\nMm Mm\nMm\n\n\n[noise]\n\nOh\n\nNo no no no no no no [noise]\n\n[noise] [noise]\n\n[noise] it Wilker since eight ball fell from side shell and that was the composition it would will send junior composition as a matter of fact light on the phone\nAnd before that we have the music all of her legs big band\nFrom wheel and the composition was entitled daughter next up we have music from ... from revelation oh boy this brings back so many memories with his beautiful wife at the time gene Kern is power and glory [noise]\n\nOh no no\nBoom boom boom boom boom boom boom\n[noise]\n\n[noise]\n[noise]\n\n[noise]\nDo they see\nTo the\n\n\n\nWe\n\nMy oh\nAnd\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\nNo\n\n\n\nNo ...\n\n\n[noise] the metropolitan jazz ... also known as in jail a reincarnation of an ensemble led by saxophonist composer arrange your Tom ... in Chicago from the late fifties to the eighties\nFrom the road to Europe place a beautiful rendition hum it might as well be spring thank you for tuning in and hanging out with me\nI Hope you've enjoyed the music that I presented to you right here on Jim is with the Alexander\nMr Mel Torme me from mail jazz singers from James and James he sees from this moment on\nTo me or you know only two were\nFrom this moment all\nWrong\nOh whoa whoa\nFrom the small but all\nYou've got the last time that I Need the money\nScandal that I Love those are\nYou got the arms do whole\nYou've got to live the kiss me good in a\nSmall one old\nThis law was you\nKnow what I Need so you got the ... but I Love you got the\n...\nLive they're just making\nBut you know I've\n\n\n\nAh\nNo no no no\nAnd um [noise]\nThank you so much for tuning in this is the Alexander had a wonderful time please share this music with two children I look forward to be with you again really soon take care of yourself\nUntil then take a nice long walk inhale positivity exhale negativity this is your life and this is Jane [noise]\nWhat can I say they have to ask me how\nTo\nDo what can I Do to food into you know\n\nDidn't mean to get in the marine who used to\nLive this key I wouldn't have you back I Do\nKnow\nIs maybe we're all we're right or wrong I\nDon't blame you\nKnow\nWhy should I pay by you\nJanine you\nKnew that I\nHad I had read\nWhat can I say the afterlife\nSide\n\n[noise]\n\n\nI Know that I read\nAnd I'm so sorry\nThe what can I say they have to say\nAnd\n\nDo what you we may H H E to Biloxi\nWMA E. H. D. to these WMA U. A. G. to be WMA O. H. D. too Greenwood so when you wouldn't be an HD to Jackson W. M. A. W. H. D. tumor radiant W. M. A. D. H. D. to acclimate W. M. A. D. H. D. to Oxford\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\nMm\n\n[laughter]\n\n\n\n\n\n\n[noise]\n[noise] the child prodigy Joey Alexander with Chelsea a bridge from his release countdown\nOn June twenty fifth two thousand three on the island of Bali\nHe originally you learned about jazz from his father who exposed him to a variety of classic albums from his extensive collection at the age of six joy began teaching himself to play piano using a mini electronic keyboard given to him by his father\nHe was immediately able to pick up the bill of the monks will need but he didn't stop there Julie's dad nurtured his gift to swing an improvisation by taking him to jam sessions with veteran musicians in Bali Angie guard to\nAnd that's how it started for young Joey Alexander along with Ulysses Owens junior on drums and Dan Kimberlin ... on bass and before that we had the luxury of voice\nOf Mr Louis Armstrong\nWith blue in the night\nHe was more music from Charlie Parker bloom dino along with dizzy Gillespie and Trump is the longest mark on piano curly Russell on base and buddy rich on drawn this was recorded June six Nineteen fifty in New York City [noise]\n\nShe [noise]\n\n... ... ... ...\n... ... ... ...\n... ... ... your ... you know one\n\n...\n... ... ... ... ... ... ...\n... ... ...\n\n... ... ... [noise]\n[noise] [noise] [noise]\nI'm going to get you on a slow boat you try to stay\nLow\n\nTo get you and cheap beer in my arms\n...\nDe la ... shows\nMe out into brining ...\nShot you\nKnow me and\n... ... ...\nYou know\nYou\nYou\nThe\n[noise] [noise]\nI'm going to get you ... you try\n\nTo address the water\n\nAnd throw the bums\nOut in the ocean where there is no more come I'm sure I'm now\nOh don't do that [noise]\n\n... ... ... ...\n\n...\n... ... ... ... I'm\nGoing to get you know oh no did\n\nGet you and keep in mind farmers\n\nLeave on\nThe bottom\n\nOut into the right there with a ... gun shy and they no\nNo no I'm going to get you on a\nBut did you\n\nKnow\n[noise]\nSlow to China from Chicago's taek from her latest release for you a company Tony Soprano on guitar and that was me\nAnd before that music from\nBob Dole in ... some sounds in the name of that track scoop ... what do you know yeah he's also the composer and bring your hands full\nThen you can join me Tony pinch yoga on John John cleaner guitar she'll be struck the right to work on sex and Kevin Ware on trial\nHe was my music from bill in Houston we do\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] never knew love like this before from Oregon ISI mo which consists of Jim Alfred sand on him and escape to Oregon Lawrence Barris on heritage he'll be one guitar Randy Marsh orange or\nI didn't know what time it was then I met him oh\nWhat a lovely time it was a sub I met was\nI didn't know what was you know how my mom\nLike the month of may it was about today it was\nA lot of young every minute every yo da lo\nFi off really touch hear your voice they are all your oh\nI didn't know what do you live what no\nI Want\nThe love and marriage was shining\nOut of your um well I don't know what I'm at is why I Know I'm no\nTime flies when you're having fun thank you so much we tuning in we really appreciate it please continue to share this music with your children thank you for supporting let me say this is J. [laughter]\n\n\n\n[noise]\n\nMm\nMm\nWMA H H E to Biloxi WMA E. H. D. to believe WMA U. A. G. to viewed\nWMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. tumor radiant W. M. A. D. H. D. to acclimate W. M. A. V. H. D. to Oxford oh\n\n\n\nThe on the\nPhone for\nA\n[noise]\nHow\n\n\n\n\n\nTrumpeter worry Hargrove for new CD the by at Wayne Shorter ... to ... along with Roy Antonio hard on Alto mercury on piano Rodney would agree the basis to Gregory Hutchinson on drums good line up for the fight and as we mentioned the Nokia was written by Wayne Shorter\nDuring the time to wait was ... Miles Davis in sixty the great second great quintet as it's called\n... miles from Nineteen fifty nine and the two that needs almost no introduction\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[laughter]\n\n[noise]\n\n\nWeighed in the water from Jim war field CD jazz land what a school for rendition of that\nDidn't work field there on Sopranos sex to row Stafford joining him on trumpet wonderful work on the habit be three by Pepe yucky vibrant lend him on drums and Daniel Sedona percussion\nThanks for joining us this hour hope you enjoy all the great American music we call jazz\nThey weren't finishing up with any jak law for his CD elevation\nBad reception [noise]\n\n\nWMA H H de to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford\n[laughter]\nNa na na na\nNa na na na\nNa na\nNa na na na na na\nNa na na na\nNa na na\nAnd again the CD called message here is a brain which too cold back in the day\nDa da\n\nDa\n\nNa na\n\n\n\nTo\n\n\n\n\nBack in the day to buy Brian Lynch who we heard on trumpet with the message that is for their CD the art Blakey along with Brian Ross moron centered Donald terrorists held to Robin Eubanks the Trump owners\n[noise]\n[noise]\n\n\nThe Count Basie orchestra under the direction of Frank foster at George in Arbor\nGershwin so foggy dirty and wanted to our own solar Carmen Bradford\nMr T. Stanley during the next from his G. G. I. years with the tea I label retailers label a classic album sugar people like Ron Carter within George Benson Freddie Hubbard on this recording for John gold dreams immigration\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]", "show_name": "BBC World Service", "year": "2018", "city": "Jackson", "day": "01"}