{"month": "10", "state": "MS", "station": "WMPN", "content": "\nGod guy a shot oh God the changes\nIn the law and the\n\nDa da da da da da\nA day well God those those guys that being\nA is a very thin\nNa na\nVe may will go back to me that\nThe ... I see\nA blast a well a lot of\nKid you know they was going on\nMe was that they that they\n\nDying in the back where you live like Kevin before that the care with Wendy time Maggie Rogers with light on things that are friends that can't be pie in sand point Alaska that we'd be our agent that were usually the NFL we make the show a W at the end of the University of Pennsylvania in Philly I tell you something or in this World Cafe\nWorld Cafe is supported by Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty route supporter of independence thought whether that's on line over the air or in a bottle more Sierra Nevada dot com\nNews from around the\nWorld around us and around Mississippi is what we using your on MTV think radio and we do a whole lot more such as live programming between thirty and new every day\nEntertaining programs on the weekends we make an investment in Mississippi so I Hope you'll make investments in what do you go to our website now M. P. B. online dot org or call one eight three seven to and thanks so much\nThe stations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him\nIt'd be online duck or gee\nYou're listening to World Cafe until the ... knock knock who's there\nHow many knock knock jokes do you expect me to know ... not nearly as many as there are many songs in today's show\nKnow uh\nYou know\nThe three members of the loan Bello are so large three parts that you could see where they've been singing harmony together their whole lives the members of the band first aid kit happen there just started [noise]\nPlus what happens when Nico case Katie laying envoy seniors get together and\nThe fleeting sounds a Fox is you know how many it's all coming up right here on World Cafe\nWe are going to listen to some Aretha Franklin circa Nineteen sixty eight album or we but now I think starting it up with old Ninety seven stances\nOn the on the floor\nBought it wants to [noise]\n\nThrilled about girls Q A with a smile\nOn vacation\n[noise]\nYoung\n\n[noise]\nYeah [noise]\nOn the it is you know the other phone just raised\n[noise]\n\nWant to do [noise]\nYou want to [noise] [noise] Mm\n\n[noise]\nOn\nI just would build\nTo be because we\n\n\n\nYeah\nBad\nNo one\nWants to know what we hear\n\nThe pain\nWhen will say that [noise]\n[noise] Mm\n[noise]\n\n\nGod\nWhat can I\n\nNo no no\n\nA movie [noise]\n\n\nAh [noise]\nNo no no that's\n\nMm\nMm\nMm\n\nWe promised you somewhere when he's that's it's a shame by first aid kit for that reason ... forever my friend and I can maybe tonight to dining three part courtesy of the loan Bello coming up and just a moment right here on World Cafe\n\n...\n... ... ...\n...\nThink so no no\nWell\n\nUm here's where\nThe man the\nMy head on the show I\nWent to my ...\nStuff like that\nOh\nMy ... and my heart is oh\nSo much of a news oh\nLet's go to um oh no\nI'm In\nI'm I'm\nI'm\nNa na\n\nUh\n\nThen moved to a\nNa\n\nNa\n\nKitty laying with outside myself from\nHer meeting album engineer if you are not listen to that start to finish\nHe'll appreciate keeping like differently I I before that you heard her singing with Nico case and lord ... case like beers with best kept secrets fleet Fox's are right around the corner and World Cafe\n\n[noise]\n\n\nHey you're listening to World Cafe until the ... in this song Robin techno up Wi Fi access things in that dream I'm as old as and now and still as star light reflected in fountains\nI wanted to freak you out but I Know exactly what Robin Green means it means the same thing as your dreams last night meant they may or sleeping your sleep boxes grown ups\nAnd uh [noise]\n\nShould be a matter there were no object to\n[noise]\n...\nWe see ...\nMan\nThey know\n\n\nYou're feeling sorry\nWith your clients\nOr whatever let's stay on your show\nAnd you know\nPeople are brought a lot [laughter]\nI Can't say\nDress you know and so yeah the two places in the middle when they hate the way you ...\n...\n... years to\nTry\nIs our own go\nIt's your brothers were\nThem alone or they\nThe only can then you have to get\nI don't know if you\n\n\nBrandy Carlyle the joke of by the way I forgive you for that Patty Griffin with heavenly day\nThinks or friends uh WG see as in Goshen, Indiana ETV radio in South Carolina members of the world cafe affiliates nationwide will make his show\nWe make it a W XP and from the University of Pennsylvania I Believe if you missed our session with three part beautiful harmony band now men you can find it on our podcast called World Cafe words and music\nI'm ... thank you for listening to the world cafe from NPR\nA gram cockpit of blurred soundtrack unit ... series the end of\nThe moral what's that about one boy one go ... less than desirable how you try not to try to guy blurry old and a half an adventure I ever ate joined Graham clocks in for an adventure and life to form it's on the next World Cafe\n[noise] [noise] [noise] [noise] [noise]\nHey there yes I'm Talking to you know obviously you can listen to the BBC Radio and we\nAppreciate your support but are you a member but I did you become a member of our members are\nPart of it makes it go and put them in ... fundamentalist countries will be me to tell people what programs you can hear 'em sit by and let others do the bill becomes the first thing to remember today by calling the eight eight three seven to yeah that's one eight eight eight three settle for for me to me\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. M. Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. ox\nThey owe ... chicken what's happening on MTV music radio and listen online and MVP on line or gee\n[noise]\nDo you think of classical music and ballet you probably think of Tchaikovsky right\nHe did ruled the roost when it came to Russian ballet but he wasn't the only one it's a bit of Russian ballet music lives in the catalog of ... [noise]\nIt's about a puppet named Patricia who comes to life in quickly interest a dangerous love triangle\nSounds like there's a lot of action in this ballet does [noise]\nYou'll get to hear the love the action and everything in between later this hour\nAnd give them a queen ... Patricia ... and more coming up on music through the next [noise]\n\nMusical intermissions during opera than ballets are known as ... or intermittency here's an Internet so by ...\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\nMm\n[noise]\n\nDid you see wrote that work back in Nineteen for on a commission to create a challenge for ... well you learn to come to NASA's meet that challenge down so easy didn't cheat\nCanasta was joins then that performance by the ensemble or the Twenty one they performed sacred and profane dance it by Claude Debbie ...\nWhen I think of the musically profane at least in the classical world musical burlesque come to mind you'll hear burlesque for violin and piano next\n\n\nBurlesque it's just a really fun strip tease you know it's an entire form in classical music musical burlesque exist on the catalogs of mini compose this you know\nWell here's one by composer you might not know she used it to slap a cup or a little pianist Virginia asking performs this musical burlesque with violinist Stephanie chicks\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n[laughter]\n\n\n[noise]\n\n\n[noise]\n\n\n[laughter]\n[laughter]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\nThe world last composer ... ... to ... she died tragically a young age of twenty five\nTo spider short time here on earth lovers of check classical music keep her at the top of their lists and you can hear why couldn't you know the musical burlesque like ... more my violin Stephanie Chase with pianist Virginia asking\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\nA grim conclusion to the tail up a puppet come to life named Patricia ... music therapy gorge trip and ski\nWhen you're trying to support it make a place for him he beat the radio you become more than a listener you become a part of the team and you know start any TB online dot org slash support make your plate and joined a theme that brings you programming for Mississippians by Mississippi\nTeam reports on news Paul across the state and the team\nTo use your voice support to make their plates and join our team\nThe MTV online dot org slash support\nThe stations have been ... music radio R. W. M. A. H. Biloxi there'll be a may ... ... you may you Butte\nThere'll be MP in Jackson W. M. A. W. Meridian that'd be it may be stark W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at ... be online duck or gee\n\n\nMother goose stories and mother goose right you've probably read a few or have them read to you once upon a time right well this week was inspired by a few things [noise]\n\n... wrote that originally as a to hand piano do it for children while he later orchestrated it and it's that version mostly played by adults that's more popular these days [noise]\nHe'll enjoy a beautiful performance Tibet sweet later this hour prevails mother goose and much more coming up on music through the night\n\n\nThe children rebelled wrote to mother goose for were actually brother and sister was used to work by tell them on for a brother and sister instruments the oboe end soon their company here by hops accord and this is tell them on the pet store all pollinators [noise]\n\n\n[noise]\n\n\n\n\nWith what they were supposed to do [noise]\nDo\nThat\n\nThey\n[noise]\n\n\n\nBut\nMuch about\n\n\n\n\n[noise]\n\nMm Mm\nMm Mm\n\nMm\nMm [noise]\n[noise] [noise]\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\nMhm\n\nMhm mhm\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\nAh [noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\nMm Mm\n\n\n\n\n\nA very lively excited audience there for a pianist Gilbert ... violent as you go to ... deal is Geraldine Walter and chill is David Finkel you just heard they performed the piano quartet Jamie flat by composer Robert ...\nAfter the string quartet was solidified by heightened a piano quartet like and what you just heard begin to see lots of attention as a sub genre on his own music like that for piano violin viola and cello continue to be really important parts\nOf the catalog celebrated nicely there especially in music of Robert ... that's probably his most performed work\nLots of great music on the way still to come the mother goose sweet by Maurice rebel and music for three guitars percussion in heart that's next\n[noise]\n\n\nMusic inspired by birds utilizes the flute most times right but the next ... composition is one for guitars harp and percussion I think you're going to enjoy this one it's a nice to look back\nAt a fund baroque style loved playing and composition is back early Eighteen century Spanish composer Santiago democracy up this is cannot ios canaries\n[noise]\n\n\n\n...\n\n\nBook inspired music today in hundreds of years ago way back in the ... period have lots and comment hardly don't you just heard a work titled cannot canaries by Spanish baroque composer Santiago dimmer see\n\nHim get McQueen this is music through the night thanks for coming along today's classical music is supported by beard employee owned an independent Barrett has kept clients financial interests first since Nineteen Nineteen R. W. Baird dot com has more information\nYou know my mother had her hands full when me and my five siblings were kids but we'd always quiet down for viewing of our favorite\nMother goose VCR tape I can still remember lots of those tendons and their various rebel once created a mother goose inspired piano competition for two children in his life\nAnd he later expanded it into the work you're about to hear the grownup ... perform here the mother goose sweet by Maurice rebel [noise]\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\nHappy ending to that musical tale of Maurice rebel you just heard his mother is sweet I'm Garrett McQueen thanks for joining me\nDrive time is going to the dogs and cats were working with local pet shelters around the state to provide them with pet food when you become a sustaining member and contribute ten dollars per month MPP will contribute ten bouncer pet food shelter partners ... to ... to make a contribution [noise]\nYour financial support helps keep quality radio programs on the air and help support local pet shelters around Mississippi that's MP be online dot org make your contribution right now\nThe stations have been ... be music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot org gee\n\n\nHoping this summer the world celebrated the one hundredth birthday anniversary of Leonard Bernstein [noise]\nHe was most famous for his work as a conductor but as you can hear he wasn't too shabby at the piano either [noise]\nSome of his more famous videos and recordings in which you see him leading the New York philharmonic from the piano that's what he's doing here in this piano concerto by ... [noise]\n\nYou'll hear Bernstein on double duty is so low esteem conductor in a performance of dissent about twenty minutes I'm Garrett McQueen Bernstein play shots to ... and much more on this hour of music through the night [noise]\n\nHere's a conductor less performance of music by mark ... D arcadian academy ensemble performs here his sonata number Twenty one\n... [noise]\n\n\n\n\n\n\nMm [noise]\n[noise]\n\n[noise]\nMm [noise]\n\n\n[noise]\n\nWell that's not that's not [noise]\nWell [noise] and I spoke with\nThat [laughter] [noise]\nWell I Wonder what many [noise] [noise]\n[noise]\n[laughter] [noise]\n[noise]\n[noise] [noise]\nWell both both [laughter] they were not\n[noise] [noise]\nYeah what what will you\nKnow [noise] [noise]\nWell it's also look\nAt what point will\nLook look look look\nNew\nBooks [noise]\n\nWell what\nAre known\n[noise] whoa whoa whoa whoa\nWhoa whoa\nWhoa whoa whoa\n\nWhoa whoa\n\n\nWhoa whoa whoa whoa whoa whoa [noise] [noise] [noise]\n\n[noise]\n[noise] ... well ... one\n[noise] well\n[laughter] [noise] [laughter]\n[laughter] [laughter] [laughter]\n\n[noise] [noise]\n[noise]\n[noise] [laughter]\n[laughter] well\nWe're not we're not that I'm\nThe I'm a dance when performing music by their namesake composer that's gone on the day is both search you just heard to perform his ... number eight in ...\nEarlier this week I had dinner with a colleague of mine Melissa and we got on the subject of piano music I Know a really wild time it sounds like huh [laughter]\nWell what I consider my favorite piano feature for really long time is this next one by Dimitri ... she was happy to hear that I Love this piece Jessica Lynch rooted for since Nineteen birthday in any you'll hear the humor in light hardness you don't always experience with South Dakota bitch\nLeonard Bernstein is the lowest end conductor here but the New York philharmonic this is the piano concerto number two by Dimitri ... pitch\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise] [laughter]\nEvery now and go for a long\n\nDon't know whether or\nNot I\n[noise] [laughter]\n[laughter]\n\n\n[laughter]\n\n\n[noise]\nHappy little accidents don't just exist in the\nPaintings of Bobby Ross if you listen to really closely to perform it to the Leonard Bernstein at the piano you'll hear a few but they don't ruin the performance or anything I think they make them even better and that was Leonard Bernstein with the New York philharmonic performing the piano concerto number two by Dimitri shot stick a bitch\nA Swedish Rhapsody wraps up this hour music next\n\n[noise]\n[noise]\n[noise] [laughter] [noise]\n[noise] [noise]\n\nJust music composer recovered Strauss ... dream like\nMaybe\nA\n\n...\nA a a ... or\n...\nYeah the the uh\nThe\nIs the issue is easy\n\nTo [noise]\nYeah\nOr the\n[noise] uh\nUh [noise]\nUh\nOh no no no I Know a or a\n[noise]\nA in a\nNew um [noise]\nOh uh\nOh uh\n[noise]\n\n[noise]\n\nOh [noise]\n\n[noise]\n\nUh I'm\nOh I'm a\nMovie\n\n\nOh oh oh it's a [noise]\n\n\n\n\n[noise]\n\n\nNo [laughter]\n\n\nHuge bravo to the Iceland symphony orchestra you just heard there from the Swedish Rhapsody number one like you go out they have ... thanks for listening\nWhere the research projects for your your your house your car something tasty and the kitchen for managing\nYour money back to the beach think radio has\nThe information you get it done right your financial transfer\nBe just the MTV Phelps while at the radio program me on the throughout the Mississippi should also support type on gas and the Internet screen showed that you can take it with you wherever you go visit him be beyond ... dot org and become a thing to remember what the gift of ten dollars per month\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA ... W. M. A. you view\nW. M. P. in Jackson W. M. A. W. ... W and may be struck W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen to\nMine at him be be online duck or gee\n[noise]\n\nWouldn't it be something to see the Andes mountain that majestic stretches landscape has inspired many climber explores alongside composer like ... ... [noise]\nHe was born near those Andes Mountains simpler route back in Nineteen twenty six after coming to the U.S to study what they are in ... he returned home to teach to write works like this one [noise]\nIt's his Andean folk dancing and you'll hear later this hour\nI'm Garrett McQueen music for ... and beyond coming up [noise]\n\nHow about you and I start our musical expedition over in England this is an English idle by English composer George Butterworth\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\nOnce upon a time my big claim to fame as a prep school student was playing the piece you just heard in the last gathering of the students you just heard performed much better than I did probably about William ... but the English chamber orchestra\nThat was the Hungarian pastoral thing to see by friends Doppler\nAnother musical fantasy fantasia by Louis they ... up next\n[laughter]\n\n[noise]\n\n[noise] [laughter]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\nFrank Wallace there in a performance of music uh sixteenth century composer Louis de ... de ... number nine\nWhen you listen to classical music I think it's important to consider the timeline\nNetwork is on the very early side up the timeline when it comes to music that you'll hear more regularly these days you'd have to fast forward about two hundred and Thirty years to get to this next work by Beethoven piano trio number four\nMm\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise] Mm\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] Mm\n\n[noise]\n[noise]\n\n\nMm\n\n\n\n\n[noise]\n[laughter]\n\n[noise]\n[laughter]\n\nYou know [noise] [laughter]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nA rare peak there and to the classical music born in ... you just heard a work by ... titled Andean folk dances and ... McLean\nWhere the research project for your in your house your car something tasty and get you what many\n... and the beach bank radio has the information you need to get done right your financial contributions\nTo get the help ski one with the radio program me on the throughout the Mississippi should also support the gas and the Internet screen that you can take with you wherever you go visit Jim ... beyond my doctor work and become a thing to remember which gifts ten dollars per month\nStations have been ... music radio R. W. M. A. H. Biloxi WMA ... W you may you view W. M. P. in Jackson W. M. A. W. ... W and may be stuck W. M. A. V.\nOxford W. M. A. O. Greenwood chicken what's happening on MTV music radio and listen online at ... be online duck or gee\n[noise]\nDepending on where you live it might be time to start thinking about locating that'll snow shovel it gives you a little anxiety like it does for me you might find comfort in this snow inspired music [noise]\nIt's by twenty century Chinese can post your chin page should each movement of his first symphony comes with a special subtitle\nThe subtitle that belongs to this movement is owed to snow\n\nYou'll hear performance from China and about ten minutes over to the snow and much more on the way\n\nFor you enjoyed that snowy piece of music you something a little warmer and much more plural this is the dance of the orange blossoms music of Eric coats Malcolm to borrow leads to the east of England orchestra [noise]\n\n\n\n\n\n\nMm\n\n\n[noise]\nYeah [noise]\n\n\n\nMm\nMm\n[noise]\n\n\n[noise]\n\n\n[noise]\n\nNa na na\nNa na na na na na\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nThe ... to the snow music composer ... ... ... you were to perform there by the China National symphony orchestra under the ... that's ... ... ... if you found that piece a little chilly ... Smith ... more ... next\n[noise]\n\n\n\nWhich musical Johann Sebastian Bach his or his real sweet number two featuring trumpeter Ron Smith [noise]\n\n[noise]\n[noise]\n\n\nFamiliar tune there by the boss you just heard ... big but the Scottish chamber orchestra in the capital sweet number two a performance by the nearby Lyndon Mozart players this next\n[noise]\n\nAnd give them a queen things for joining me here\nIf you're needing a little help getting going this morning this work by Antonio resent tea will give you the ... but gentle push you need this opening is nice and bouncy is you're about to hear the mundane Mozart players performers AT T's symphony ... s much traumatized bumped we won't\nWhat\nWhat's\nThat they\n[noise]\n", "show_name": "BBC World Service", "year": "2018", "city": "Jackson", "day": "26"}