{"month": "10", "state": "MS", "station": "WMPN", "content": "... ... ... ... ... ... ... ... ... you know the\nName and\nThen I\nA ...\nAnd they're doing your yeah have\nYou know Mm Mm\n[noise]\nMm [noise]\n\n\n\nVery [noise]\n\n... Hi Dan\nMentioned Adam by another man\nAnd you know my father and getting you know the same oh man\nMm [noise]\n\n\n\n\n\n\n\n\n\nMm Mm\n\nMm [noise]\n\n\n\n... ah here and they said you\nKnow ... ... ... ... and ...\nThey love it you know I mean do you do\nFor\nMoney\n[noise]\n\n\nBut I\nKnow they\n[noise] ... ...\nNow and ... and I'm\nNo no ... no\n... ... are they doing and na na\n\nNa na na\n\nNa na na\nNa\n\nNa na na\nI'm Annie\n\n\nMm Mm\n\nMm [noise]\n\nMm [noise]\nMm [noise]\n[noise]\n\nLovely kind of gospel inflicted number there from first aid kit from their new little ... called tinder offerings I've wanted you baby from Spain was seen him play make it out from a pretty mild ... lounge collection\nAnd all of these you know we'll be able to play with sugar forty seven eighty seven at undercurrents radio dot yeah\nWe'd ready to follow us on Facebook Instagram Twitter\nFor music news as it happens in some occasional insights into native culture I think our team Gabriella coastal and Christina understand and Joe Yuri agreement vicar and support comes from the corporation for public broadcasting\nFrom the friends of under cars and from envy one stations like WD or tea in ... Wisconsin in W. I. U. W. in Warsaw, Illinois and this is native voice what the Native American radio network\n\nThis week on a special issue both of Mississippi US Senate seats are up for re election in the general election state representative David barrier is vying to unseat incumbent senator Roger Wicker in Mississippi it's time for change there's also a special election to fill the remaining term senator five conference see\nThe second Amendment rights were very important to me now to make sure that we can talk right right I don't believe in much with my minutes on the issues that stuff's cuts are fan discuss friday at seven thirty pm on MTV TV\nStations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at impede the online dot O. R. G.\n\nO. rain it's undercurrents I'm Greg Mick vicar welcome music from Lydia love was on the way\nJoni Mitchell rate for the riff raff\nYou're gonna start going to check in with John mail and the blues breakers but first here's or they're black or you you were about ...\n[noise]\n[noise]\n\nKnow\nBit better job you can get\nThings dry out\nRead from your job and you know\nNot ... [noise]\n\n[noise]\n\nOh yeah\nWere just waiting on the\nWas we just went off [noise]\nOh what do we think we [noise]\n\nThese cameras ... core there from around the better off who do we think we are you're on a deterrence Lydia level is oh it was just awesome yeah ... boy crazy\nAnd it was the markets king bandwidth welcome round here from Carolina confessions hey hope you're doing well some deterrence I'm great\nMusic for you to a jump you enjoy going to be doing to get you through whatever you're dealing with her great for the riff raff coming up and Joni Mitchell now this is from wherever jazzy or phases God must be a book you\n\nThe the\nLeading to show ID he can\nAnd the warmer keeps trying\n\nYou live in the building to is in there and see which\nAlign very June to\nThe\nYo yo\nYo yo yo yo yo yo yo homey way way up and\nA when I\nYo yo yo\nYo Yo's family either\nWay\nWith a young when\n\nThat\n\nIt's under currents coming to you with support from the corporation for public broadcasting the friends are going to continue your support the station way to go thank you for having pains began band just around the band but first here's rate for the root for\n[noise]\nA ban on their high and my mom you know by ...\nBy\nGuinea pig out\n[laughter]\n\n\nI\nMy mom\nWhen they were no no\n\nTrue\nMom\nSharing\nYou can\nFunny\n\nI [noise]\nI'm sure you can\nCandy bar and\nThe word\nJerry Maguire [noise]\nOh\nDay\nAfter day\n\n\n[noise]\n[noise]\n\n\nHi this is arrogant start and you're listening to undercurrents sometimes they're Native American music on here to a\nWe just next I mean there [laughter]\n[noise] [noise] [noise]\n...\n... [noise]\nIn ... you\nKnow Ken coming here\nWhere thousands were\nGlued to the\nYou think your\nCan\nI Know\nWhen I was looking for\nKnow [noise]\nI was I mean to me\nYou know you're standing next to me [noise]\nJames ... gym in\nNew York\nBut you know the\nThe cheese or [noise]\n...\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nUm and\n[noise]\nUh\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\nFrom Puerto Rico means boy a Puerto Rico the name of that song from the album drum jams group will explore us your\nKill it'd be ... or ... together highlands meet the desert really with ... who knew what the euro from their cooperation from two thousand five our beloved land\nGreatly swimmers zero in the city and it was John mail and the blues breakers featuring Eric Clapton on that track oh you'll love that said for this hour we hope you'll keep on coming back until many friends and family about your co workers you are best advocates\nCan tell them about the website undercurrents radio dot net interplay list there shouldn't be forty seven eighty seven and a if you don't know you can have the plane as can be automatically every day on Twitter at on undercurrents\nThings start production team Gabrielle Acosta line casino understaffed and Joe Yuri I'm Greg me vicar and support comes from the corporation for public broadcasting from the fringe of undercurrents and from envy one stations like keep you see in St Cloud Minnesota and stations Wyoming Public\nRadio and this is native voice what the Native American radio network\n[noise] on the eve of an election watch for pope could be affected by technology\nThey have bought into this idea that whatever technology just says it's going to happen will in fact happened and it's going to mean bad thing for them they don't know what exactly bad things but it's going to mean bad thing\nI'm sure I Know I didn't mention politics and the economy [noise] next time I'm innovation hot [noise] today at noon on M. B. B. think great [noise]\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA Bentonville W. M. A. U. Butte\nW. M. P. N. Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\n\n\nWhat do you suppose that makes this music when Orson Welles salmon Gene Kelly [noise]\nWell the second per second\nYucky there in addition to being a composer in Syria saw Castro music also wrote music for some place [noise]\nBut I was lucky rubbed shoulders with movie stars and other Hollywood icon can wasn't afraid to write music purely for entertainment dollar funding [noise]\nThey're going to hear more about that when you listen to his ... concerto it's coming up later this hour [noise]\n\n\nThanks so much for joining me for music for the night this is a very soon if he's not going to be any\nGood not\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[laughter] [noise]\n[laughter] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise] they [noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n[noise] [noise] [noise]\n\n\n\nMm Mm\n[noise]\n... ... ...\n... [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise] Mm Mm Mm\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\nNah\n[noise]\n\n\n[noise] ... [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n... [noise]\n[noise] [noise]\nMm\nMm [noise]\n\n[noise]\n[noise] Mm\n\nNO NAME that maybe doesn't come immediately to mind when you think of composers the Spanish compose every ... they are ugly he didn't start composing for the guitar until the very end of his career pieces that he wrote then\nWere good enough to draw the attention of the great guitarist on this ... this is one of those pieces it's called into me deal the guitars tier is a little battle more haven't [noise]\n[noise]\n\n\n[noise] Mm\n\n\n\nMm\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\nMm Mm\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\nMm\n\n\n\nMm\n[noise]\nIntermediate\nBy the chanting I Believe that was the guitars true that the moral alright\nDon to flee music now quite extraordinary sniff music shock ... bare ... music for planes in films including Orson Welles is Macbeth and Gene Kelly in detention to the dance he was open minded to new trend to accept it influences from a lot of different sources\nHe blew is tightly controlled restrictions on himself the inspiration was only the nearest starting point of artistic creation for ... the rest came from discipline well here's the result of that the ... was composed in Nineteen thirty four begins with a bang [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\nIt began with a bang and it ends similarly Emmanuel ... was the last ... concerto with his tone how the orchestra led like David this is music through the night\n[laughter]\n[laughter] [noise]\nBy\n\nThen they\n\n\nGame\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise] it's not the gym it's long scene for you to switch the ... to go with Tina right here on listener supported music through the night and laundry in\nYour ... be time to be up for renewal simply county when you get to ... how do you keep pouring through can be\nFor me I'm lying orange last\nYear round\nStations ... music radio R. W. M. A. H. Biloxi it'd be ... ... ... you may you used to be in the in Jackson\nW. M. A. W. ... have you and may be struck W. M. A. V. I. W. M. A. O. green check out what's happening on MTV music radio and listen on the line and be be online or gee\n\n[noise]\n\nStock exchange began nice and southern ... playing just in people's homes within a year they were performing making their place called the three swans Catherine [noise]\nThat was back in forty four [noise]\nSeventeen forty for ten years\nAfter a while but the easier and having an audience is that\nSomething like a better home to many around town offered to renovate a one story building\nStyle matching [noise]\nThey are concerned this is talk of science named after that Neal hears or they find somebody in [noise]\n[noise]\nI never know where to content that's the title of the piece by general I'm a ... huge Boulder by\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nNo\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[laughter]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\nSince the number three by ... broke with some nights to give on ... ... ... ...\nAnd then the music to the night Facebook page I posted a link to the history of fat orchestrate you can also look at recent traffic on the Facebook page about being ... concert that never happened do you find out what your fellow listeners are saying\nNo no\nNo\n[noise]\n[noise] [noise]\n\n\n[noise] is it now by the composer Michael ... he wrote this piece on a cliff side overlooking the Pacific ocean in southern Mexico nice\nThe piano cheers turn the all right [laughter]\n[noise] [noise] [noise]\nHe\n\n\nThat may\nMain thing you know\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\nI'm really robust playing some fairly robust music like Alex ... Santa Monica turtle for flute and vitamin e minor George Michael ... was the violin is there much ts mountain on recording what a wonderful performance and read though was led by George Michael short\nShallow me off I'm Andy motion hosted sounds Jewish every Sunday are present in my ... been entertaining our Jewish music and usually comedy the jazz from New York you talk from Israel\nWedding dances from Europe devotional music Jewish song American show\nYesterday who shop\nI Hope you'll join me on shelves Jewish\nSundays at three PM on MTV music radio in the online\nThe stations have been people be music radio R. W. M. A. H. Biloxi there'll be a may ... ... you may you view\nThere'll be MP in Jackson W. M. A. W. Rudy that'd be it may be structural W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at him be be online\nDot org gee\n[noise]\n\nDamn smart ballet seems to thread a nice music composer Gabrielle peering name\nHe was an organist in nineteenth century friends since like\nSuddenly didn't have an awful lot of dancing in it [noise]\nYou know so he conducted the very first performance of driven skis fire buried Batman [noise]\nAnd he wrote this music which is from a sweet to dance if\nTribute to dance and stuff the baroque period [noise]\nSo what's your name is kind of frustrating dancer and did he really wants to men than the\n... century [noise] either way cooler will try to you I think that you're the sound of\n\nMusic now from ... ballet Sleeping Beauty this is the entry off the ferry\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\nMm\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[laughter]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [laughter]\n\n[noise]\n\n\nOh\n\n[laughter]\n\nYou see by composer enough motion is piano concerto number three Howard Chely conducting to Tasmania symphony orchestra Howard county dishonest\nBecause she's listeners supports had classical music today's classical music is also supported by double\nA meal prep service delivery fresh gourmet dinner table ready in Fifteen minutes with just one pen double does the prep work so you spend less time chopping and more time with family more double dot com slash classical\nAnd just a minute music by my no\n\nMm\n\nMm Mm\nMm\n[noise]\n\n[noise]\n[noise]\n\nI've been to music there from an Oprah Dolly jumps and we know that was some surprises of love the entrance of Venus was tough for music led by gene I'm On\nDid you know by French composer got real name the belly decor is the sweet to Castro pieces in the form of broke down since he was cheaper music Palm Beach\nAnd you\nKnow\n[noise]\n[noise]\n\n\nFor\n\n\nWhen the phone\nNumber ...\nDe da de\n\nDa da da da\nDa\nDa da da\n\n\nDa da da da na\nMm\nMm Mm\n[noise] Mm [noise]\n\n\n\n\n[noise] [noise]\nMm\n[noise]\n\n\nOh well good for the most [noise]\nThat\n[laughter]\n[laughter]\n[laughter] [noise]\n\n[noise] [laughter]\n\n\n[noise]\n\n[laughter]\n[laughter]\n\n[laughter]\n[laughter]\n\nEvery penny ballet to color with chamber music Palm Beach charming music for you this my morning\nA great orchestrating full flight is the most amazing thing it's simply the cat lets you experienced that thrill every week Hi this is Brian new house we touchdown and terrific orchestra towns boxed in San Francisco they had to get the best of Europe and Asia\nAll captured my encounter simply ... from American public media Sunday Morning at ten on MTV music radio\nStations have been ... music radio R. W. M. A. H. Biloxi that'd be MA ... W. M. A. U. U. W. M. P. N. Jackson W. M. A. W. Meridian W and maybe start W. M. A. V. Oxford W. M. A. O.\nIn on MTV music ray machine on line and be be online or gee\n\n\n\n\nAre you Frank gets called Frankie for race who gets cold we see [noise]\n\nFor some reason people like to use the menus sworn off name\nHappened to music too [noise]\nThey should just enough to find any piano but it got published as a sign of teen\nTo make it sound a little more accessible\nI Wonder what the composer France\nShould they be Frankie Schubert something that\nYou can hear the music in about twenty minutes\nGood morning my name's Andrea lane lots of music ahead this is part of town or yes on ... the ...\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nNot just any plane the plane outside of Granada in Spain a scene from the last ... music the plane loving guy\nTo London symphony orchestra was conducted by on their parents' signed the guitarist Christopher pocketing in just a minute music by ...\n[noise]\n\n[noise]\n\n\nNo no [noise]\n\n\nNo we're listening we used to listening to music early in the morning it's early Monday morning and I hope we're starting the week off well\nAnother way to apply the term early music and music of the ... or even any music renaissance she might say\nThis is another example of of early music in the sense that the instruments were going to hear playing our\nEarly versions of modern instruments the for the piano is the former owner of the piano as you would imagine and the violin being played here is a ... string original instrument Andrew ... is the most on the violin Richard III gar playing the for the piano in music by French ... oh\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\nHave you know how much money [noise]\n\nAnd ah\n[noise]\n\n\n[noise]\n\nKnow money [noise]\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\nTo\nA young man\nSay about it [noise]\nKnow from what we don't know [noise]\nMhm\nMm\n[noise]\n[noise]\n\nWas\nGoing to go\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\nBoom boom due\nWonderfully skilled playing from Andrew men's and the violin and Richard III guard to force the piano from Cuba violin sonic Pina number three\n[noise]\n\nMusic now by the book he me an ... from ... ... ... rather he had a sister apparently he was a really good horn player chances are he wrote this concerto for\n", "year": "2018", "show_name": "BBC World Service", "city": "Jackson", "day": "29"}