{"month": "10", "state": "MS", "station": "WMPN", "content": "A ban\nAnd fun\n[noise] when I once\nWant a mom to manage\nThese guys they just hang\nOver the\nMay the staples can you get to that you heard made a singing with ... and the first thing that set Nina cried power and in the middle stuck in the middle but dealing with things have changed\nThings are friends that keep the RG in Guam and W. S. G. E. in Dallas North Carolina members of the world cafe affiliates nationwide to help us make this show we make it a W X. P. N. from the University of Pennsylvania in Philly thanks again to our guest this hour catch the core old crow medicine show\nAnd our national correspondent powers Italian slender thank you for listening to the world cafe\nWorld Cafe is supported by visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum that you're holy collection and the museum of fine arts more visit saint Pete Clearwater dot com\nAnd by the luggage that's ruined company routes supporters of the tiny desk contest and working to help bans reach more years three years more ... dot com\n\nGlobe is your home for the great American just on the beach we all showcase the best in local jazz in popular song Nineteen\nThirties today from Frank Billy and Ella looks like curtailing Dianne Reeves and Gregory border my mortgage alone spent some time after low Sunday said shame on MTV music radio\n\n\nStations have been people be music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line\nOr gee [noise]\nHey you're listening to World Cafe until years later you walk into my living room and we king is one of my favorite artist she's basically in my living room all the time not physically in person but on my play last and she finally has me music that I'm so excited to share with you\nProduction bold incredible feel can you tell how you excited about playing your Emily King ... and another new Gen coming your way courtesy of Gregory Allen Cobb oh\nGregory road a lot of that song while living in a pop up van sand dunes national park in Colorado and it does feel like it's done in solitude called dark dark dark and it's coming up a World Cafe\nSo is\nNew music by Amy Ray of Indigo Girls and I'll tell you about Dave Matthews favorite board game but first we started off with pets in the may tells funky Kingston [noise]\nThey're\n\nLittle bit\nGod\nGod I\nMaking no\nDon't just do not do rejoice me [noise]\nHe's in his goal was twenty four friends before that sure feels good anyway by Amy Ray I'm ... I'm so excited to play this song by Emily King\nIt's a new one called remind me listen to how she execute this idea of when you're stuck in patterns of thinking or doing and then something or someone or some thoughts shakes you out of it just that is so good here is Emily gang or more cafe\nIn with the little guy\nBeen in the dog is the game shows me the yeah\nDon't know how she did you know\nAgain again\nYou\nMean\n\n\nTo [noise] try and when he goes\nOh billions of dollars to be given me a pleaser\nAnd\nOh my God how\nCan you know\nSomething\n\n\n\nKnow\nSomething\nThat can be\nYou\nSure\n\n\n\n\n\nYou know do we\nThings\nLet me let\nQueen you when\n[noise] [noise] [noise]\n\nAnd\nI'm\nA\nAnd he\n\n\nNa\nNa\n[noise]\nGod\nAnd gender\n\n\n\n\n\n\n\n\nChuck duck torture fish before that the Matthews band again and again pneumonia birch coming up on World Cafe\n\nHey you're listening to World Cafe and tell you ... Molly birch is channeling Billie Holiday's dusty Springfield and how she sang a song called wild\nThey she\nSays she goes [noise]\nThere goes my baby does she goes\nOh I should say [noise]\nI'm a grown man\nThere goes my baby does she does\nShe do\nI'm ...\n... ... and\nSaid the you know you know\n... we've been ...\nMm Mm Mm\nReally you know it is you know it is I'm such a long road we've been working on Mm\nMm Mm Mm Mm Mm Mm Mm\nAnd I have a dream [noise] Mm\n...\n... Mm\nWhen my sister's ...\n\nSays we hear is what I Know no ... no no no\n...\nNo I saw the ...\n\nOf being you know and you're\n[noise]\n[noise]\n[noise]\nYou know I'm ...\n\nAnd you know ...\nTimes ... times mine\nStruggle\n[noise]\n...\nMm mhm\nOr when I'm Alone [noise] Mm\nWhat else thrown off the weight of this ...\nWhen I launched so careful the things I ...\nThat's when a ... that's when I miss you know just when I miss you know who I'm a little\nMm\nMm\nMm\nHere is what I Know I'm here is what a no no ...\n...\n\n...\n\nNo no and you know man you\nWell I had a dream\nTo many than or in the sky Mm\nMm\nMm\nI guess I had a dream a ...\n... ... stood beneath an orange guy ...\nWith my brother and my sisters\nWith my brother and sister ... all the\nWith my brother and I ...\nI like the murder orange guy dark dark jak by Gregory Allen I took off before that I think Sarah Palin W. E. X. P. in Albany New York and South Carolina's ETV radio they make the show W XP and from the University of Pennsylvania in Philly and tallies later in the world cafe from NPR\n\nCalled me they they pay candy state and grew up poor in Alabama and use your voice to change our life toying with the gospel trail at a gym in the fifth floor\nBefriending Sam Cooke and eventually singing on stage with Elvis Presley candy survived domestic abuse and turned her paying interest on her latest record is called and stop all and they smell cafe [noise]\n[noise] [noise] yeah\nSometimes words are just not enough\nI'm Larry Gross gets mountain stage live performance radio from NPR's\nSaturday Night at seven on MTV music radio [noise]\nThe stations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. N. Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood\nAnd what's happening on MTV music radio and listen online at MVP on line or gee\n\nHave you heard of them marching orchestra I haven't but that doesn't mean or casual instruments don't march musically this Eighteenth century march his by Beethoven [noise]\n\nIn general Beethoven found inspiration from Turkish military marching bands when he wrote his own marches as you can hear though there's no band only a violin that'd be ... and the cello\nIt comes from a string trio Syrian neat and you'll hear it in about six minutes and ... this musical march and more coming up on music through the night [noise]\n\nIs a plural sounding work that might remind you of the month of march a musical poem by it then it did it\n[noise]\n\n\n\nMm\nMm Mm rules\n[noise] [noise]\nMm\n[noise] Mm [noise]\nMm\nMm\nYeah\nDo you go\nUm [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\nMm [noise]\n\nMm\nMm\nMm Mm\n\n[noise]\n\nMake any time\n[laughter]\nMm\nMm Mm\n\nMm Mm\n\n[noise]\n\n\nThen\n...\n\nMm\n\nMm\nMm\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\nI don't\n\n[noise]\n\n\nBeautiful music of Beethoven their sandwich by march it that was Beethoven's ... string trio serenade and so the military was the violinist there with Bruno to run up and viola had missed the last ... Fitch playing the cello\nHow about a nice ... by what her heart in orchestra coming up next\n[noise]\n\nAbout five minutes you're going to hear it can sure do for an instrument in the ... family it's the ... ...\nRight now the ... was you're used to hearing it takes the first raised in this really beautiful work by John Ritter when you hear his name most times it's in relation to cool music\nWell he knows his way around the orchestra too I think you'll agree after you hear this catching finch is the future hospice in this performance of the lullaby for music of John better\n[laughter]\n[noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n... by by composer John Ritter you just heard him leading since tonia company\nIf you left the elbow playing in that work by rather you're really gonna love this next concerto by Bob\nLove in fact it's a great word to use for it if you choose an instrument called the ... ... an instrument a little deeper than the ... with a really beautiful hinder sound\nBut guard ... snow plays the about the motive here with the new boss ... music come up like say this is the ... D by Johann Sebastian Bach\n\n\n\n\n... you know playing the ... the ... with the new box 'til they get music ... of life sick you just heard him in music by their namesake composer the ... concerto by Johann Sebastian Bach looking for a\nYouthful perspective on classical music oh I'm going to play that last transcendental attuned number seven it's very exciting an energetic and their party parties South Park and overall it's a pretty good key [noise]\nNo further down from the top joined me Christopher I'm running for our tenth anniversary CD each week right here on NPR Saturday morning at nine on MP be music radio\nStations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle Wu Mei Yu Butte\nW. M. P. in Jackson W. M. A. W. ... that'd be it may be structural W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him be be online duck or gee\n[noise]\nWhat could a composer from Bohemia possibly know about American classical music\nWhile the ... the answer is lots [noise]\nHe was one of the founding fathers of the spread of classical music in America\nInspired largely by the countryside of Iowa his catalog includes a new world symphony and American quartet and this American sweet [noise]\nYou'll hear performed from Hungary later this hour I'm gear McQueen divorce ... American sweet and more on this hour of music through the night [noise]\n\nHere's a North American performance you'll love the Canadian brass perform a ballad by hunters problems [noise]\nMm\nMm\n\n[noise]\n\nMm Mm\n\n\nMm\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\nMm [noise]\nUm\n[noise]\nA new release there by the ... string quartets they really sounded great in the music of ... of heightened you just heard a string quartet number fifty one Rachel Barton pine sings a song through her violin next\n[noise]\n\nMost songs have words but this one doesn't even need the mental Rachel button pie performs this song without words by Charles Brown [noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\nMm\nMm\n\n\nMm\n\nMm Mm\n[noise]\n\n\n\nIn a new album featuring Rachel Barton high she explores her relationship with the black American music like jazz and blues you can check out that feature on our website your classical dot org\nYou just heard an excerpt from that album sounded really believes he didn't it that was that song without words by composer Charles Brown Rachel Barton pine was joined nearby pianists Matthew Haykel\nI'm Garrett McQueen thanks so much for joining me the songs of America had a huge impact on on to name divorced shocked he used them to write his America inspired compositions here's one of them the American sweet by divorce shock [noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\nThe American sweet ... divorced shock\nEven ... music ... century to go to count fresh and alone\nEven contemporary every weekend Sunday ... you can hear a variety of modern performers treats can use it gets a living art form and put their unique imagine\nIt gets stamp on music than the Eighteenth century earlier I don't I Hope you can join us for some people will be\nSunday Morning at six or impede be music radio\nStations have been ... be music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at him be be online dot org gee\n\nThere's still plenty of fall left before things get too cold\nMusic like this is a beautiful reminder of what's to come [noise]\n\n\nIt's music by composer Glenn bird this Winnipeg native\nSurely knows a lot about winter knowledge that I'm sure informed this winter poet [noise]\n\n\nYou'll hear the Winnipeg symphony orchestra performed is in about twenty minutes I'm Garrett McQueen Glenn bears winter poem number one and much more on this hour of music through the night\nThere's music for the seasons and then there's music for the time of day or night in this case here's a knock chaired by August ...\nMm\nMm\nMm\nMm\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\nI Know\nThey\nThey\nThey\nReally been able to say I guess [noise]\n\n[noise]\n[laughter]\nFor [noise] for a for profit\n[laughter] [noise]\n[laughter]\n\n[noise]\n[noise] Mm\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\nOh really cool composition there by living Canadian composer Glenn bird I use the word cool intentionally that was his winter ... number one performed by the Winnipeg symphony orchestra\nMcQueen like so much for joining me this evening that piece was a little too chilly for you I think this next one might warm you up a little bit this is a love song by composer Philip road\n\n\n\nIf you've never seen Appalachia this time of year I highly recommend you try to make the trip there is nothing about the Smoky Mountains not to love especially in the fall\nOf the music you just heard was inspired by the beauty of Appalachia music up American composer Philip roads the veteran string quartet performed at a tune titled lots on\nLove and respect has been a bounding for women lately and the hash tag meat to era really important work I think really equitable work even being done across the board\nHopefully that work is being felt by these next performers Gillian Benet his speech you're here on heart but with the women's ... orchestra this is the heart country Tina by Joe Main title there [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\nThe light hearted personality up early twentieth century French music the country do you know for her ... main tie affair\nType this is Chris daily vitamins joined me right here every Saturday for a prairie home companion\nWe'll be joined by the best musicians something you'll know when others you might not know yet to produce the oil\nPlus a bit of comedy I knew some of the week the powdered milk biscuits it's soccer questions kind of a few surprises as well All right here each week got a prairie home companion Saturday sides on MP being music radio\nStations have been ... music radio R. W. M. A. H. Biloxi there'll be MA ... W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and may be start W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen on the line at him be be online\nOrg gee [noise]\nWay back in Eighteen Seventeen the composer by the name of Nicholas ... he wrote a tune for by Lynn that would become is most famous was like a priest that over a hundred years later inspired this work by ... [noise]\n... wasn't a violinist he was a pianist so he chose the piano to be the showcase of this Rhapsody based on that tune by packing [noise]\n\nHe'll here's Johnny today perform it with the Cleveland Orchestra a little later this hour I'm Garrett McQueen back in ... by ... coming up\n\n\nLike Nicholas ... the music of Henry personal has been borrowed across centuries well here's the tune of his in its original form it's called three parts on the ground\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n...\n...\n\n...\n\n\n\n\nThose are ... by composer Stanley my years it was used in the film the deer hunter I still haven't managed to sit down to watch that movie but I Am familiar with the scene that the music comes from so it's fun to see a younger Meryl Streep you heard a performance of the year\nBy ... Romero\nThis next work by rock mud enough has been used in several films the latest was the good wife from back in twenty Fifteen another film I Need to have to watch less\nWell the piece started its life from the states and the poor me you're about to hear Jenny ... is the featured soloist here with the Cleveland Orchestra this is the rapid city on a team up pocketing any by ...\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\nAh [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\nOh no no\nNo no [noise]\n\nDon't you love the drama of a soft ending like that that was the rap see on the back pocket neat featuring Johnny ... but the Cleveland Orchestra ...\n\nMusic has been around now that there's always more new interesting music if you know where to look the discovery never stops in young fans are excited snow the musical since a secret [noise] one hundred and some connection between generations cultures\nRude bumped home pot means\nYou know slips together\nHow bitter Sunday night it's seven\nOn MP be music radio stations have been ... music radio R. W. M. A. H. Biloxi there'll be MA boondoggle W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck W. M. A. V. Oxford W\nMay oh Greenwood check out what's happening on MTV music radio and listen on line and impede the online dot O. R. G.\n[noise]\nBoston symphony orchestra has been a bastion for world class music for over a century now in Nineteen thirty the ensemble turned fifty years old this music was the birthday gift [noise]\nThe gift ... was composer Howard ... it's definitely a modern era twentieth century work but the general a static from the previous\nCentury earned it its nickname [noise]\nHow are Hansen's romantic symphony number two in more on the way\n\n\nHe was a peek into the world the twenty first century choral music it's by composer Stephen ... ... ensemble performs here a piece called the old church\n[noise] uh\n[noise]\nUh\n[noise] uh [noise]\n\n\nUh\n[noise]\n\n\n\n\n\nUh [noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nJumping dignity has a sound on the boat so full so rich it seems like you could almost hold it in your hands really beautiful like you just heard him there with the Scottish national orchestra and it worked titled done by I Know Adler\nHas the mid term elections get closer the rock here things seem to get at least as far as the rhetoric gripe too important now more than ever to make sure you go out and vote and when it's time\nIn the meantime here's a piece of music that'll bring you a bit of much needed Pete's it's a new release by composer mark McKinsey from ... to me this is the prayer for peace\nYou know [noise]\nKnees [noise]\n\nUm\n\n[noise]\nMm [noise]\n[noise]\n\n\n\nWork described as a message of hope loves and beauty you just heard mark McKinsey prayer for peace that new release features metro Gordon Johnson with the studio orchestra\nWe recently did a feature on mark McKenzie and the recording you just heard you can read more about that at your classical data work another studio work is true the RCA symphony orchestra takes it away next\n[noise]\n\n\n\nAt the ... Center for the arts near Traverse City Michigan the interlocking theme concludes own musical performances\nWell that theme has a home in this music by Howard hands he'll here it is the second theme and his first movement is Hansen symphony number two nicknamed romantic the RCA symphony orchestra forums\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]", "show_name": "BBC World Service", "year": "2018", "city": "Jackson", "day": "19"}