{"month": "10", "state": "MS", "station": "WMPN", "content": "And more and to get the ball rolling here's Eric Clapton\n... ... ... ... ... s\nWell ... the\nLaw is ...\nReal little runs deep that all those goals that as a\nEvery judge look good\nBaby she runs the water's cold as\nPain no no no no man who blew\nThe main\nDean do may go to a few days\nLast ...\nThere really\nIs the law school and\n\nGene will we do do good and I'm\n\nSure you will was going to get a good man\nRonnie ...\nBe in a bad the Muslim\nBrothers the\nOh oh oh so they were\nWhen\n\nWe see\nThe I Know mortal orchestra with honeybee also mildly gave us in San ... a meta thinking about my life and Eric Clapton brought us river runs deep\nIt's ... I'm ... rocky Donny and ruby among fool are cute out but first here's native artist Robbie Romero [noise]\nRead [noise]\nTrading walking\n[noise]\nThe friends\n\nInsurance and [noise]\n[noise]\n[noise]\n\n\nRead\nNews\n\n\n\n\nMm\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nGold and blue yeah well\nI'm In a row twelve ain't no\n[noise]\n\n\n\n[noise]\nDo you\n[noise] your\nA job because they don't show\nAs a ... glow\nNation grows again 'cause my ...\nYear and a new jobs around the young man and your\n[noise] ...\n[noise]\n\nThis Jackson Brown and you're listening to under ...\n\n\n\n[noise]\nYou back to being a young man with the knowledge and this\nIs sue sue the wrong but you know well yeah you must be you know is this all out into the bag and you can you would sure she would run which\nWe may be you know one of those\nNews the\nThe question is\nUm\nUm\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\n[noise] [noise] [noise] [noise] [noise]\nAn instrumental version of millennium car from keep sickle law it was Lindy our take on undercurrents with the comeback kid cue violin brought us by ...\nAnd Tim O'Brien gave us old Joe it's been a pleasure being with you this last hour having picked out the music for you I Hope you enjoyed it for more information about what you heard checked a playlist out at undercurrents radio dot net\nDoes it show number forty seven sixty six thanks to Greg McVeigh gr Christina on his dad and Joe Yuri I've got to be elected on\nUndercurrents is made possible by your support thank you and by the corporation for public broadcasting and envy one stations like Cape UPS lp in St Louis park Minnesota and W. M. A. V. in Oxford, Mississippi\nThis is native voice one the Native American radio network\n\n\n[noise]\nAttention all educators MTV has partnered with the secretary of state's office does this year's promote the voter initiative or help your students learn important lessons\nAbout civic engagement while having fun in the classroom this opportunity is for K. through twelve students across the Mississippi get them engaged with the ... election plus are an essay contest for more information about promote the boat\nOr to sign up your class or school does it end he be on line ... ...\nDecisions have been Bebe music radio R. W. M. A. H. Biloxi WMA Google W. M. A. U. Butte there'll be impeded in Jackson\nW. M. A. W. Meridian W and maybe dark will W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him be be online dot\nO. R. G. W. we may H H de to Biloxi WMA E. H. D. too ... W we made you a G do viewed WMA\nWell ... to Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. P. H. D. too acrobat W. M. A. V. H. D. to Oxford\nWMA H H E to Biloxi WMA E. H. D. to boot WMA you a fee to viewed WMA O. H. D. too Greenwood W. N. P. N. A. C. to Jackson W. M. A. W. H. D. too Meridian W. M. A. P. H. D. too acrobat W. M. A. V. H. D. to Oxford\nWMA H H de to Biloxi WMA E. H. D. to boot WMA you a fee to viewed WMA oh eighty two Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. P. H. D. too acrobat W. M. A. V. H. D. to Oxford\nWMA H H E to Biloxi WMA E. H. D. to boot WMA you a fee to viewed WMA oh eighty two Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. P. H. D. too acrobat W. M. A. V. H. D. to Oxford\nWMA H H E to Biloxi WMA E. H. D. to boost WMA you a fee to viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. P. H. D. too acrobat W. M. A. V. H. D. to Oxford\nWMA H H E to Biloxi WMA E. H. D. to boot WMA you a fee to viewed WMA O. H. D. too Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. P. H. D. too acrobat W. M. A. V. H. D. to Oxford\nSunday paper route I'd say santhara now\n[noise] [noise] [noise]\nCan be afraid of mice with Richard Wolffe every player when he went to work in rats didn't want to hire we respected colleagues including ... and composer Johan and violin players contracts go there a teeny ... piece in doubt\nContemporary instead by bill ... also read sailboats at virtuous up musician across the globe collaborating on chamber music as well as playing in the top early music on trouble today here Eduardo egg last place for sell those music by somebody is like [noise]\n\n\n\nPeople just to have it could be I see them every sample defiantly ... early ... century where his first job working at Saint Marc said that when he was only ... years old you are marina ...\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\nMe too\n\nAnd that's what we're going\n\nTo\n\n\nBe the next town over the course of the nation\nMe to\n\nGo to the books are\nNot willing to try to do to go see\nThat it has to\n\nGo to the\nPoint that it's just a nice way\nTo\nTo\nChina\n[noise] [noise] [noise] [noise]\n[noise]\nThe\n\n\n[noise] the thing\nTo do because the\n\nLosing this did why do egg was played a ... by somebody is labeled vice subtitled the infidel there's an online article about Sylvia ... advice what's interesting information about the virtual solution is to ... life and career we put a link to it on our website Sunday baroque dot org along with a link to Eduardo egg\nWas this website so today's playlist page you're listening to Sunday borough [laughter]\n[laughter] [noise] [laughter]\n[laughter]\n\n[laughter]\n\n\n[laughter]\n\n[laughter]\nThis program is funded thanks to generous ongoing support provided by the friends of Sunday baroque who's contributors include the shelling Family Foundation incorporated child prodigy shall ferry rebel drew up to be one of ... to fourteenth favorite musicians rebel was from a musical family he played violin and hearts of course\nHis earliest composition tore his violence and not as ... and ... play rebel sonata subtitled ... del or the faithful one [noise]\n[noise]\n[noise]\n[noise]\nViolinist your Michael Schwartz in rebel baroque unsettled played is another by your money but the step one day\nIf you're on Facebook I Hope you'll lake and follow the ... Facebook page you can also look up more about the music recording read my ... and here today show again later this weekend Sunday baroque dot org\n[noise]\n\n\n\n\n[noise]\n\n\n\nAnd they were real cause supported in part by the John Moriarty Institute for ecology get spirituality at Sacred Heart university and I'm thinking he gay adult educational journey to Ireland you for three well let's twenty Nineteen John Moriarty Institute data work my\nWay to deal with people who come in with the when the when he became interested in the two and Nineteen Ninety eight he became music director candidates national Arts Center orchestra\nChoppy help for sixteen the this is Deborah forms of Johann Sebastian Bach third or Castro sweet [noise]\n\n\n\n\n\nI think I took Herman at the national Arts Center orchestra of Canada like Johann Sebastian box or Castro sweet number three\nSunday baroque has produced at the Richard pie guard many classical music production suite at W. S. H. U. public radio in Fairfield, Connecticut where the production team includes Julie for dino and Joelle struck\nWe also have help from Rick Andreas WG UC Cincinnati and Suzanne bona and this is Sunday baroque\n[noise]\nIf any intelligent life form ever discovers the disc aboard Nassar's Voyager and figure out how to play it even if you're a huge\nVariety of things including readings in many languages whales songs and lots of music\nThe rain forest musicians to Beethoven and most are\nThere's also musical you'll have to back to buy and coming up on Sunday corrupt you'll hear one of the performances that was included [noise]\nThe globe is your home for the great American song book each week old showcase the best in local jazz in popular song Nineteen thirties today from Frank Billy Elon talks\nLike Kurt Eli Dianne Reeves and Greg reporter Margaret Cho I spent some time with after glow Sundays I'd say my MPP music radio\n\n\nStations have been ... be music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line duck or gee\nIt's Sunday baroque I'm Suzanne Boehner\n\nSpace shuttles the international space station the discovery of water on Mars and ice on the moon there have been so many amazing technological feat and discoveries about our universe that can Nineteen Seventy seven NASA launched the Voyager space probe to study Jupiter and Saturn\nOn board was a twelve inch desk containing a variety of found for earth including music\nSince astronomy day is coming up on October twenty is we are featuring some of the baroque music included on that historic Celeste deal soundtrack as well as other out of this world performances [noise]\n\n\n\nWhat are the father of modern astronomy Galileo Galloway lived during the baroque Iraq\nAnd grew up in a musical household his father in ... and his youngest brother ... were both professional musicians Hussein is still Kimmo Fayette plays a sweet mine to get on your locale away\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\nThat that are Nicholas ... did the Swiss baroque soloist played Johann Sebastian Bach Brenda ... concerto number two first movement was on the disc aboard NASA's Voyager in Nineteen Seventy seven\nSo was a recording of this melody the ferry around my Anthony whole born plus her son lead music adult Jay\nOh cool\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n... directed music ... in a performance of the theory round the galley yard by the English composer Anthony ... boy you're listening to Sunday borough [noise]\nThis program is funded by the French have said they broke including the shelling Family Foundation incorporated if any intelligent life for never discovered the disc aboard masses Voyager and figure out how to play at the table here huge variety of things including Chuck berry's Johnny good Peruvian can type music\nAnd now the whole Indians nights a chance to end this performance by pianist Glenn Gould you'll have to ... first printed few from the well tempered clear ... to\n...\n\n... ... ... ...\n... ... ...\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nUh\nUh [noise]\n\n\n[noise]\nMm [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOh\n[noise] [noise]\n[noise] [noise]\n\n\n\n\nOh [noise]\n\nOh\n[noise] off\nOff\nOff\nOff\n\nOff\nOff\nOh\nAnd they're recording to their city New York ... stars heaven fifteenth century type my English church musician Walter ...\nIf you're on Facebook I Hope you'll light and ... Facebook page and if you want to look up more about the music you're hearing read my blood Gore checkout links related to today's program visit our website you can also here today show again later this week it's Sunday baroque\nDot org somebody broke his supported by the Richard ... find that hard for foundation for public getting providing support to institutions that are committed to making like in Connecticut including the heart school at the University of Hartford, Connecticut land marks and he'll get it in\nThis program is produced at W. S. H. here in Fairfield, Connecticut like Julie ... without them written on dress and cattle you choose your seat and Suzanne ... is is some paper round\nIn the early Nineteen nineties filing a claim hardcover began experiencing physical problems that his left arm isn't actually diagnosed with focal dystonia the left arm is the one a screen play or you just to think 'cause I Know 'cause he kept\nPlaying until he could reach himself to play a centrally backwards fingering that his right hand and Boeing with his eventually stopped playing and focus on conducting instead coming up on Sunday ... mostly\nA quadruple violin concerto\nThe great orchestrating full flight is the most amazing thing to simply Catholics you experienced that thrill every week [noise] Hi this is Brian new house we touched down and terrific orchestra towns from Boston to San Francisco and get the best of Europe and Asia all captured my encounter sympathy\nFrom American public media Sunday Morning at ten on MTV music radio\nStations ... music radio R. W. M. A. H. Biloxi W. M. E. W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online duck or gee\nThis is Sunday Burrell I'm Suzanne burner [noise]\n\nWhen George Frederick here don't suffered a stroke you had to work very hard to overcome paralysis regained to use it as here if anyone can appreciate the debt is getting a second ... performers career it's pianist Mary pariah light candles he also had to put it playing on hold a few years ago\nOf his own rehabilitation from a serious handed jury Murray pariah plays a key parts we buy towards Frederick handle today\n\n[noise] [noise]\n\n[noise] [laughter]\n\nFacing a career or threatening hand injury guitarists David Lazer stopped playing his instrument completely and started composing music instead for about a decade\nAnd then he found a new approach that allowed him to resume playing guitar for his comeback recording David lives near chose music by Johann Sebastian Bach he plays his own transcription of two movements for box lewd sweet B. W. B. nine hundred Ninety seven\n\n\n[noise]\n[noise]\n\n... of all let us Syrian twenty playing suite of anonymous Elizabethan Iraq ... music by ... and Kelly yard you're listening to Sunday paper route\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis program is funded by the friends of Sunday borough\nWho's contributors include Dr Louis type ... Connecticut\nAnd the early Nineteen nineties Reinhard capital began experiencing physical problems with his left arm in was eventually diagnosed with focal dystonia left arm is on a street player uses to think or the notes and so he stopped playing until he could reach trained himself to play centrally backwards bickering with his right hand and Boeing with his left\nThis is Ryan Hart Kimberlin music ... along playing a concerto for for violence like you said the Palin teeny\n\n[noise] then then they can do [laughter]\n\n\n\nMhm\n\n\nYou want to\n[noise]\n\n[noise] [noise] [noise]\n[laughter]\n[noise]\n[laughter]\n[noise]\nThink they're\nThe\nSame\nThing\nTo do that\n[noise] [noise] [noise]\nAnd I think that's true [laughter]\n[noise]\n[laughter]\n[noise]\n\n[laughter]\n[noise] [laughter]\n...\n\n\n[noise] [noise]\n[noise]\n\n[noise] [noise] [laughter]\n\n\nYeah that's very pariah played George Bittner candles their keyboards to me how many ... including one called doubled when heroes started these also noticed that your ... John this is the introductory symphony\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nMm [noise]\n[noise]\nMm\nMm\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\nMm ...\n\nAcronym played ... my seventeenth century German musician yo hungry simulate when he was living in exile Dennis if you're on Facebook you can find Sunday her up there too you can also look up more about the music and musicians were here today show again later this week at Sunday baroque dot org\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] oh\nWow\n\nSo directly supported by the John Moriarty Institute for college spirituality at Sacred Heart university announcing any gay adult educational journey to Ireland you force ... twenty Nineteen John Moriarty Institute dot org\nVenice, Italy has a long and oppressive history of musical celebrations in Christmas is one of the grandest\nSaint marks the silicon Venice was at the center of much of the action in the sixteenth century ... was one of the musicians who worked there ... and they get really contours players perform one of their namesake secret songs for Christmas\nNa na\n\nNa na\nNa\n\nBlended brand performed the battle here right Andrea Gabrielle e so they broke it supported by the Richard ... or ... foundation for public giving providing support to institutions that are committed to enriching lines in Connecticut including the heart school at the University of Hartford\nConnecticut Landmarks and the hills did museum this program is produced\nS H U in Fairfield, Connecticut by Julie for dino and Joelle struck with help from Rick under the WTC Cincinnati I'm Suzanne Boehner and this is Sunday baroque\nShallow me off I'm Andy motion hosted sounds Jewish every Sunday I presented it might be entertaining our Jewish music and usually comedy think jazz from New York to talk from Israel\nWedding dances from Europe devotional Jewish song marriage and shout\nOut [noise]\nI Hope you'll join me I'm Jewish Sundays at three PM on MTV music radio and TV on wind\nI'm an artist I like the bank I'm a chef or go like to join us how it's about what this season from northern [noise] that Robert St John wide waters and this week on power to power we are in a minute\nI'll be paying even gone along and I'm just going to\nJoin us Thursday night on power to pilot season three\nSee their ballot setting on MTV television\nStations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. B. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line duck or gee\n\n\nThis is Stephanie cats from a pie and American public media I'm Alison young and this week we catch up with the Minnesota Orchestra in concert from the west to South Africa\nI started to think about the Turing possibilities ... who I wanted to go with me that's a concern we all know that there are those regular ... London\nNew York ... and I thought that ...\nDo we really need to go to those places or is there a bit of the reason to come back to work so\nThat is Minnesota Orchestra music director ...\nHe says the idea for this tour began several years ago when he came to conduct a youth orchestra in South Africa it took no time before he fell in love with the country and their passion for music making [noise]\n\nMusic you're hearing the song every South Africa knows by heart is on the porch and\nThat it unstoppable train coming from South Africa\nNelson Mandela took up the song in prison and body his struggle against apartheid\nAnd the son took on a whole life and the new south Africa was born in Nineteen Ninety [noise] the Minnesota Orchestra carrying a fantastic\nMm\nMm\nNo no\n\n\nNo no\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\nUh\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nIn the face and a lot of her fans here tonight", "show_name": "BBC World Service", "year": "2018", "city": "Jackson", "day": "11"}