{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n[noise] [noise]\n[noise]\n\n\nNa na\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\nAlbert King born under a bad sign for that make it happen by the record company from all of this life here on World Cafe\nThanks are friends of WFDD in Dover, Delaware and W. N. Y. ... in New York City members of the world cafe affiliates nationwide you help us make the show we make it a W ... from the University of Pennsylvania in Philly and hey check out the ... on our podcast it's called World Cafe words and music\nI'm Talia ... thank you for listening to the world cafe from NPR\nWorld Cafe supported by the door is do charitable foundation whos clinical scientists development awards support promising early career position scientists and their research efforts to improve human health\nAnd by Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty route supporter of independence thought whether that's on line over the air or in a bottle more Sierra Nevada dot com\n\nOr your pet mom or dad well even if you're not here's your chance to make a difference for each person who signed up to contribute ten dollars per month we'll contribute a ten pound bag of pets to a shelter in Mississippi now if you're already supporting the beep way to go but if you contribute an additional sixty dollar\nGift country town and your name to make a difference today the number to call one eight eight eight to ... yeah that's one ... to ... for me\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA Google W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio when\nBush and online at him be be online duck or gee\nYou're listening to World Cafe until the ... the ban which\nThe mood hard but her Poon whatever you want to call her Monica western Kelly sure Ken Lay it\n[noise]\n\n\n\nAddressing tally he does write lyrics and he does think marriage but the way he played\nHer Monica and it tells you everything you need to know about the guy songwriting that was coming up and\n\nNot John and the ...\nRoseanne cash released a new song from her upcoming album she remembers everything got hurt or the wisdom skill being a veteran songwriter Roseanne cash coming up I'm OK\nHere's anyone by grace Potter covering at a James for a compilation called Muscle Shoals\nSmall town they found\n\nKnow me\nWell\nWhy not\nTalking\n\nThen in less\nNot natural\nA ...\n\n\nKnow\nWe're\nIn ... he\nWas do love the little\nAnd\nOh\n\nBull Durham bulls\n\nSo so long now than\n\nWe do we\n\nShe'll live [noise]\n\n\nJob\nThen saying\nWe stole waste all goes\nWell God thank you [noise]\n\n[noise]\nLike Trump's we spoke again from thank you for today by death cab for cutie before that Kathleen Edwards buffalo Russian Kelly with a new one called mocking bird you mean by Roseanne cash off her album she remembers everything coming up in just a moment um World Cafe\n...\nNo no no\n\nHe\nHe\n\n\n[laughter]\n\n\n\n\n\n\n\nYou say\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] maybe you\nKnow she she was\nHe did\nIt\nReally\nNina cried power ... before that talking head slippery people and Mickey with nobody stick around for a really wild take on what the radio is coming up on World Cafe\n\nWell I'll just get on the you know all my\nWedding then\nMean nobody so we used to be you\n\n\n\n\n\n\n\n\nThat's Chris Stapleton or if you're really good friends with them just the second one to know\nBefore that sure feel good anyway by Amy Ray thanks our friends at Texas Public radio in you guessed it Texas and Katie I ate in Columbia, Missouri members of the world cafe affiliates nationwide you help us make the shell thank you\nWe make a show a W X. P. N. from the University of Pennsylvania in Philly I'm Talia ... thanking you for listening to the world cafe from NPR\nThe green\nMountain man is a real Amelia meat from silver NASA less Molly or in Charlotte and Alexandros held their money in their new album magic ship in their\nFirst record in eight years making it involved a cross country friendship road trip and a whole lot of lab they perform live how do we around one might be a man next world can they\n\n\nBe be online dog Oregon is the website where you can make a contribution to your public radio station here this week thank you so much for your health and you're helping W just read because when you become a sustaining member at ten dollars a month or more\nTo Mississippi Public broadcasting we will contribute on your behalf ten pounds of feed to a local shelter across Mississippi so your contribution walk stumbling MPP online dot org\nThe stations have been people be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte W. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O.\nCheck out what's happening on MTV music radio and listen online at MVP on line or gee\n[noise]\nDidn't you love the characters classical music has created that if you might remember including the cracker come to life\nPeter who isn't afraid of rules and a woman named Carmen [noise]\nShe's the title character of an opera written by George this date back in the Eighteen Seventy to operate still perform these days but not often is the sweets drawn from it\nYou'll get to revisit one of those sweet seeing about six minutes and get the queen bee Jay's Carmen and more on this our music through the night [noise]\n\n\nYou know there's a lot of really great dance to music and carbon oh here's another dance attain do they get you warmed up\n\n\n[noise]\n\n\n\nMm\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\nA very appreciative audience they're listening to the Sergei ... national philharmonic\nMy ... Katz let them in a well known favorite by George ... that was his Carmen sweet number one George ... who would have been one hundred and eighty years old today you wrote a countless number of works but that one is when I think it's safe to call his most celebrated\nTheir performance from the orchestras great hall lover and Moldova\nIt's part of our weekly euro classics special hardcore broadcast the performances from festivals and concert halls across Europe be sure to join the next week same time same place for the next edition\nAnd the opera Carmen includes a number really beautiful ballad called romances or reminds us here's one by living American composer Daniel Godfrey the cat's a string quartet perform\n[noise]\n\n[noise]\nMm\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nBefore the double bass to claim to how does musical walking baseline those the job of the hops a court player as you just heard in the conclusion did that work there now the violence and not a number Olympic by our ... really performed by trio seminary\nAnd gear McQueen thanks for joining me he's a little music by recording Wagner this is his secrete idol\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nReally comforting conclusion to that music of record Wagner you just heard is Eighteen sixty nine secrete idol that piece served in part as a gift to his wife ... after giving birth to their son named secrete a really great gifts to receive their from one of classical music\nMost infamous composers and gear McQueen thanks so much for your company\nWe remind our listeners Karen now we've come up with the idea for each person you signed up you\nCan see the dollars a month in ... we will continue ten pounds at ... ... if you already supporting thank you\nContribute ... sixty dollar gift look into the ... and if you contribute signing your dollars get pounded the one counts in dollars meet the hundred down your financial support helps keep it'd be be programs on the air and help support local shelters across the state\nThe stations have been ... music radio R. W. M. A. H. Biloxi it'll be in a may ... ... you may you Butte\nThere'll be MP in Jackson W. M. A. W. ... have you and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G.\n\nChurches church services and church event sap inspired classical music for ages this work is one of the newer side relatively but it's still reverberates that age old spirit of music meeting church [noise]\nSpy composer oath to Reno ... he wrote this piece of music inspired by some of the stories he seemed to pick did on stained glass [noise]\nYou'll hear the sound see associated with those beautiful windows and about Fifteen minutes church windows spy we're speaking and more coming up on music through the ...\n\nDid you ever get in trouble for sleeping in church when you were a kid\nI'll be honest I did all the ... well here's a ... bar owner backs that might take you back to those days [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n... ...\n\n\n...\n...\n...\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\nThe famed film composer John Williams famous family could use your thoughts he's fallen ill and he's had to cancel a few dates he had lived up here still very speedy recovery for one of America's most important composers\nWell as you may know he was the name of the famous guitars from Australia who you just heard in musical Augustine barrio worked titled cathedral\nCathedral physically or very beautiful structures are they the stained glass in them can be quite inspiring you'll hear a musical take on those church windows next\n\n\n\n\n\n[noise] here's Keith Clark with the Pacific symphony in music up all to Reno ... this is a work of his titled church windows\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\nNow was injured Lawrence King with the heart concert and music of Johann Sebastian Bach that was his uh tallying concerto and asked him get McQueen thanks so much for joining me\n[noise]\nIt's Paul drive time twenty Eighteen and this one's all about community you're getting back to your community in\nTwo ways this time your financial support helps keep the NPT programs on the air and it helps support local pet shelters across the state you can go on line in P. B. online dot org for coal eight eight eight three seven to give\nAn eight eight eight three seven to ... for for the three\nThe stations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\n\nClassical music from Western Europe often draws on both elements he's got the people inspired\nFor the people well this work but just the Montgomery is a great American example of that idea [noise]\n[noise]\nThe Washington Post described it as a handful of American Folk melodies tossed into a strong wind cascading into humbling joy fully\nWhen you consider that an accurate description [noise]\nYou'll get to take a closer listen here in about Fifteen minutes the poll conspired sounds of Jesse Montgomery and many others coming up on this hour of music through the night [noise]\n\nJust the Montgomery as a composer violinist she's a member of this ensemble stinks virtual see\n[noise]\n\n[noise]\nMm\nMm\n[noise] Mm Mm\n\nMm\n\nMm Mm\n\n[noise]\n\nMm\n\nMm [noise] [noise]\n[noise]\n\n\n\n\n\n\n\nThe romance for viola an orchestra by max bra that Nineteen eleven composition of his was performed there by that include Smith with the Bergen fill in ...\nHe was a piece for strings written one hundred and one years later the twenty first century work by Jesse Montgomery called strong\n[laughter]\n\n[laughter]\nMm Mm\nMm\n[noise]\n\n[laughter]\n\n\n[laughter]\n\n\nMm\n\n\n\n\nMm\n[noise] [noise]\n[noise] oh\n\nMm\n\n\n\nWho knows how\n\n\n[noise]\n\n\n[noise]\n\nAlways a pleasure for me to present music by composers of color that was at work by a friend of mine named Jesse Montgomery I work a purse titled strum the strings are strong but hammered in this next piano teacher stay tuned\n\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\nMore [noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nIn my experience it's not the easiest thing to play in the orchestra or Chopin can share does but they're really a joy to listen to our ... you just heard the piano concerto number two by Chopin featuring a Lexus whites in bird with appears conservatory orchestra\nAnd ... McLean take so much for joining me\nAs you can hear MP beeping radio has gone to the dogs during this ball players Dr will you make a contribution to the radio do we make a contribution to local pet shelters around the state would there be sustaining membership of ten dollars per month ... be contributing piles of pet food to a local pet shelter think of it\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nA performance by one of classical music leading lady heart tissue under Clinton accepts you heard her in music of John Cage a work title in a landscape\nJoined the letter as easily won of classical music leading lady's as well as she gets leading the buffalo fill them out of work is true in a work titled eternal logging\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\nYou may have noticed a lot of borrowing ... French impression is a man that Nineteen oh five work titled eternal logging it's actually a check composition by ... just laugh Novak\nAre you paying mom or dad well even if you know here's your chance to make a difference for each party she signed up to contribute ten dollars per month we'll contribute a ten pound\nBag of pets to a shelter in Mississippi now if you're already supporting the beep way to go but if you contribute any position of sixty dollar gift contribute to town you're committed to make a difference today the number to call\nIn eighty two steps would be ... to be penalized for\nThe stations have been ... music radio R. W. M. A. H. Biloxi debate you may ... W. M. A. you view W. M. P. in Jackson W. M. A. W. Meridian W and may be struck W. M. A. V. Oxford\nIt may ... ... ... what's happening on MTV music radio and listen online at him be be online board jeep\n[noise]\nMost times the real bread and butter for aspiring classical musicians to see where Castro repertoire\nChamber works like this to do are among the most important of all works for when players\n[noise] [laughter] [noise]\n... he conducted the ... the premier of it back in Eighteen Seventy eight and it's been a joy for conduct Duran musician ever since [noise]\n\nYou'll hear the ... when the performance of it later this hour I'm Garrett McQueen ... serenade for wins and more coming up [noise]\n\nThe what\n\nHe was a little something for the violin appraiser lived by Edward too\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n[noise]\nWell you and I enjoyed that piece of music I got in my email a nice no region recipe for Luther Fisk as\nFar as I can see right now it's more of an acquired taste but I'm going to try it out anyway just to see whether the Norwegian music you just heard I think is good for anyone else in the region Rhapsody number two by Johan Halvorson\nHere's a little out of this world music by the band Coldplay this arrangement is performed by time for three the teen us oh oh\n\n\n...\n\nA little classical cross over the air you heard the ensemble tiny for three and an arrangement of a tune by cold play called us folk song released back in twenty eleven music by another British Band [laughter] and the BBC pull their money is next\n[laughter] [noise]\n\n\n[laughter]\n\n\n\n\n\n\n\n\nA nice gentle conclusion today a bit of mourning music worked titled abide by composer Cyril Scott morning news overnight is great for this next chamber work by divorce shock and I think you'll agree that's next\n[noise]\n\nI'm getting McQueen like so much for joining me\nHow often does your work require teamwork you know really working directly with colleagues in some sort of way or on some sort of project that you can't do alone it can be a real chance in ... in my experience anyway any musician who's tried to tackle chamber music specifically knows that\nWell he's music by divorce shocked that showcases some really great team work about the the inner solar Monica when\n[noise]\n[laughter] [noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n[laughter] no no no [noise]\n[laughter]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\nNo no\nNo no no no\nNo [laughter]\n[noise]\n[noise]\n\n[noise]\n[noise] Mm\nMm\n[noise] [noise] [noise]\n\n[noise]\n\nMm [noise] um\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise] [noise] Mm\n\n\n[noise]\n\n\nMm [noise]\n\n\nMm Mm Mm\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise] [laughter]\n\nNo no no no no no no no no\n[noise]\n\n[noise]\n[noise]\n\n[noise]", "show_name": "BBC World Service", "year": "2018", "city": "Jackson", "day": "25"}