{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n\n[noise]\n[noise]\n\nWhat a great complements have rhythm guitar in Oregon that was Julian Casper with flipping time it was Samantha Fish on undercurrents with who's been talking Ellen jewel with I'm a little mixed up and Tracy lean Nelson with my baby Joanna\nIt's been a pleasure being with you this last hour for more information about anything that you heard you can check the playlist out at undercurrents radio dot net\nThis issue number forty seven sixty six thanks to Greg make vicar Christina on his dad and joke Uri I'm ... do you like us denying\nUndercurrents is made possible by your support thank you so much and also by the corporation for public broadcasting and envy one stations like Ken is Sam in clear lake Mason City Iowa and Wu K why in Lexington, Kentucky\nThis is native voice won the Native American radio network [laughter]\n\n\nThey're they're they're okay okay [noise]\n[noise]\n\n\n[noise]\n\n\nMhm\nAn evening of Jazz Can be just what the doctor ordered takes a great Ella culturing Dinah my mom\nMakes and the contemporary giants lightning sure [noise] read more from Malone and Vincent joined me Marin Michelle the W. J. yes he even the seven to ten we\nOnly NPT me music radio\nStations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP online duck or gee\n\nUnder ... like I said I'm here with you with some great music lined up for you we hear from ... ... a month to old Ninety seven's Jackson Brown and more and to get\nBall rolling here's Eric Clapton\n... ... ... ... ...\n[noise]\nReal erodes the\nLoad is ...\nReal little runs deep that all those goals that is a\nJob good\nBaby she did\nA breather runs the\nWater's cold and it's\nPain no no no no man who blew\nThe name\nThe new normal to me to live\nIn a row last what does\nBottle really bad\n... was in school\n\nGene will go do good and\nGina ball was going to get a good man\nA lot to do\nIn the bed the Muslim\nBrothers the\nWhen\n\n\nThe I Know mortal orchestra with honeybee also mildly gave us in San ... a meta thinking about my life and Eric Clapton brought us river runs deep\nIt's ... I've got to be you know rocky Donny and ruby among fool are cute out but first here's native artist Robbie Romero [noise]\nRead [noise]\n[noise]\nTrading walking\n[noise] so\nDid the friends of\n\nOf insurance and [noise]\n\n\n\nDrop of water under the tree and\n[noise]\n\n\n\n\nThey would turn\n\n\nMm Mm Mm\nMm Mm Mm Mm no\n[laughter]\n... oh yeah well\nI'm In a row twelve ain't no\n[noise]\n\n[noise]\n\n[noise]\nKnow telling a joke\nA route the glow\n... grows a kid in my eyes to\nSee all around here and now you know throughout the young man and\n... [noise] ...\nKnow [noise]\n\nThis Jackson Browne than you are listening to under ...\n...\n\n...\n...\nNew book being a young man with no this is sue sue the road but you know well yeah you might be you know is this ... rather\nThan you can you would soon as she was ruined known that you\nWere maybe you're going to\nNews the\nQuestion is\nUm\n\n[laughter] [noise] [noise]\n[noise]\n[laughter] [noise] [noise] [noise]\n\n[noise]\n\nMm\n[noise] [noise]\nMm [noise]\n\n[noise]\n\n[noise]\n\n\n\nMm\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise] [noise] [noise]\nAn instrumental version of millennium car from keep the cola you'd with Lindy or take on undercurrents with the comeback kid cue violin brought us by ...\nAnd Tim O'Brien gave us old Joe it's been a pleasure being with you this last hour having picked out the music for you I Hope you enjoyed it for more information about what you heard checked a playlist out at undercurrents radio dot net\nDoes it show number forty seven sixty six thanks to Greg make bigger Christina on his dad and Joe Yuri I'm going to be elected on\nUndercurrents is made possible by your support thank you and by the corporation for public broadcasting and envy one stations like Cape UPS lp in St Louis park Minnesota\nAnd W. M. A. V. in Oxford, Mississippi this is native voice won the Native American radio network [laughter]\n\nMm\n\n\n\n[noise] attention all educators MTV has partnered with the secretary of state's office does this year's promote the boats initiative or help your students learn important\nLessons about civic engagement while having fun in the classroom did opportunity is for K. through twelve students across the Mississippi get them engaged with the ... election plus or an essay contest for more information about promoting the boat or just sign up your class or school visit MTV on line ...\nStations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nThere'll be impeded in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online duck or G. O.\n\n\n\n[noise] [noise]\nThere are many reasons why Johann Sebastian Bach is remembered as a master of the keyboard\nFor what he wrote lots of music for\nMany of those works like this one in four performance art and education\n\nIt's from book one of his wealth tempered clear I must be fun to learn what such well crafted music\n\nYou'll hear a well crafted performance of it in about ten I'm Garrett McQueen since ... and ... featured on this hour of music through the night [noise]\n\nThe Wilton ... beer is just one of many works put together an aide to like set isn't or casual arrangement of a piano exercise by divorce shock [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n... ...\n... [noise]\n[noise]\nAnd\n\n\nThen ...\n... ... ... ... ...\n...\n\nIn the\n[noise] [noise]\n\n\n[noise] um [noise]\nThe\n\n\n\n[laughter] [noise]\n\n[laughter]\n[laughter]\nTo\nBe in the\n[laughter]\n[laughter]\n\n[noise]\n\n\n[noise]\nJust to\nThem\nIn the kids to\nDo [laughter]\n[noise] [laughter]\n\n[laughter] [laughter]\n\n[noise]\n[noise] [laughter]\n[noise]\n\nAnd\nThey\nTend\n\nTo tend to tune\n\n\n\nIn for me [laughter]\n\n[noise]\n\n[noise] [noise] [noise]\n\nAnd\n... them to\nDo\n\nThe person [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [laughter]\n[laughter] [laughter]\n\nI\nCan understand\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [laughter]\n[noise]\n\n\n[noise]\n\n[laughter]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[laughter]\n\n[laughter]\n\n[laughter]\n\n[laughter] they they\nTend to do [laughter]\n\n[laughter]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [laughter]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\nThey tend to stay\nIn the\nCity to go\nTo the to the root cause you to\nDo\n[noise]\n\n[noise] [laughter]\n\n[laughter]\n\n[laughter]\n[noise]\nA\nMovie for a minimum\n... do\nYou\nLook at the end of\nMen [noise]\nKeyboard instruments were once tune to play in only one key at the time if you can believe it was around the Seventeen hundreds instruments that could be played in any keep started to appear\nTo describe it being well tempered you just heard music from one box wells tempered clear music written in every keep those elections were formed by Pierre ... phone I\nMissed this last Russia poop itch takes away on the chill up next\n\n\n\nTo them\n\n[laughter] no\nNo no no no no never\n[laughter]\nHave get McQueen whose miss this law washer Povich with the symphony orchestra the union radio they performed the cello concerto number one by Comey things so\n...\n\nKnow those\n\n\n\nMm\n\n[noise]\n[noise]\n\n\nNice older recording there of the cello can turtle number one by Comey sing song\nShallow me off I'm Andy motion hosted sounds Jewish every Sunday all present in quite the entertaining\nOur Jewish music and usually comedy think jazz from New York [noise] hip hop from Israel\nLady dances from Europe devotional music [noise] Jewish song American South [noise]\nYes sir shop\nI Hope you'll join me on sounds Jewish Sundays at three\nPM on MTV music radio BBC on line\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA Google W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot org gee\n\nIt may be hard to imagine but back in the late Seventeen hundred in Austria the movers and shakers were only in their twenties\nThe twenty five year old count as Antoni ... received this piano teacher from a twenty year old mutts are\n\nThe tough herself was a fine pianists his was supposed to talk of course they built mastered this work\nAnd used it as a teaching piece when you love to learn to play do\nYou love hearing it later this hour Mozart's ... concerto and more coming up on music through the night [noise]\n\nYou know there's always something to learn from listening in playing music for example the word or they also maybe one you don't know the rivers to the singing nature of music here's an audio so by Alexander or Tunisian\nMm\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nBe read by myriad sounding music theory it's not music a record Wagner though it's music by his son secrete Wagner though the overture to an upper he wrote called the secret Linden tree\n\n\nYou just heard ... ... with the Manhattan chamber orchestra they performed in ... him and feuding tune number ten that's the tent in a set of Eighteen pieces written in the mid ... century design in the fashion of the Eighteenth century\nToday's classical music is supported by progressive insurance suffering snap shot a device that adjusts insurance rates based on safe driving habits now that's progress to learn more progressive dot com or one eight hundred progressive\nProgressive harmony shined beautifully in this piano concerto number eight by Mozart\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\nMozart giving the orchestra the final word in that piano concerto number eight ... performed there with the London symphony orchestra I'm Garrett McQueen\n\nA great orchestra in full flight just the most amazing thing in simply can't let you experienced that thrill every week Hi this is Brian new house we touched down and terrific orchestra towns from Boston to San Francisco and get the best of Europe and Asia\nAll captured my encountered that simply cash from American public media Sunday Morning at ten on MTV music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MP be music radio and listen online at him be be online duck or gee\n\nYes and this from someone said ideas come to me from outside of me like a gift to Brahms took those gifts and created some of classical music for the most beautiful works including this one featuring viola [noise]\n\nThe viola as an instrument is all too often overlooked where the butt of musical jokes have they'd be all the players around the world and across time think brooms wholeheartedly for this gift\n[noise]\nYou'll get to enjoy this musical gifts later this hour the ... the number to Brahms that much more coming up on music through the night [noise]\n\nSome musical gifts didn't come from composers but rather the people traditional music here's a traditional works titled waltz after last ... in ... [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[laughter] [noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\nMusic inspired by the town of Nottingham when you think of that town it's really significant to English folk culture Robin Hood for example\nHead stomping grounds ... he and his Mary band of these more shade of green known as Lincoln green that tune you just heard is titled Lincoln green they used to England orchestra performed it there and they were founded in Nottingham not coming to borrow who wrote that music\nAnd ... McLean thanks for joining me\nFrom the woods in England to the cities of Germany in music of Brahms everyone loves the symphonies and his famous concert overtures but his chamber music mix up you know a really important part of the catalogue as well here's an example is below sonata number two\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\nUm [noise]\n[noise]\n\n\nMhm [noise]\n\nMm [noise]\n\n[noise]\n\n[noise]\n[noise]\nOh I don't know why not\n[noise]\nOn the phone call\n[noise]\nWas on [noise]\n\n\n[noise]\n\nMm\n\n[noise] [noise]\nMm\nMm Mm\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n... ... ...\n\n\n[noise]\n[noise]\nMm [noise]\n\n\n\nMm [noise]\nMm [noise]\nMm [noise] [noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise] Mm [noise] Mm [noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise] no no no no no\nNo actually um [noise]\n\nI'm going\nBe\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\nI mean\n[noise]\n[noise]\n[noise]\nKim ... cash E. N. N. Robert led been featured in music by John Brown now since ... number two I'm getting McQueen thanks so much for joining me\n\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA ... W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on the line at him be be online dot O. R. G. [noise]\n\nHave you ever listen to a piece of music and wonder if the composer himself or herself could pull it off not all composers could but the composer of this music certainly good [noise]\n\n[noise] what's his name was Paul intimate there's music for nearly every instrument\nAnd his catalog that according to legend he could play on the intended instrument\n[noise]\n\nYou'll hear Eleanor Bennett's performance of this music he wrote for heart than about twenty minutes Paul intimates heart sonata and much more coming up\n[noise]\n\nBut I could certainly play everything he wrote for the keyboard but maybe not arrangements that is music for other instruments his music Abbas performed by the ... good ... brass on some\n[noise]\n\n[noise]\n\nYou know in the kitchen you've got to be careful about doubling or tripling recipes right it's not always a matter of simple math well it is a matter of simple math in a way when music for six is expanded for many more you just heard the Scottish national orchestra performing arrangement about string sex tapped by regard\nStraps music for one performed by one coming up next\n\n[noise] [noise]\n[laughter]\n[noise]\n\nI've never had the opportunity to share music by Paul intimate with us I'm really excited for you to hear this work if he has lots of his music it can be a little challenging but I think you'll find this one is relatively easy on the ears and this is the harp sonata by Paul intimate Eleanor Bennett is the featured soloist\n[noise]\n\n[noise] [noise]\n[laughter]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[laughter]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nWell known\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\nWell [noise]\n\n\n\n\n\n\nYou just heard the stock cold ... led by the late ... Bush just been ski we lost him back in June of this year they performed Alexander ... petite sweets and get acquainted\nWith the globe is your home to the great American song but\nEach week she'll be the best in local jazz in Tucson Nineteen thirties today from Frank Billy ... LA looks like Kirk Eli Dianne Reeves and Gregory border market jello did spend some time with after low some decent shape and BP music radio\n\n\nStations have been ... music radio R. W. M. A. H. Biloxi it'll be ... ... ... you may you Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G.\n\n[noise]\n\nThe name what's gone on these boats are it is well no and write the most well known even in classical music\nWell it takes more than knowing is named to execute is music properly [noise]\n\nWhat are the things that takes his exact precision Mozart knew exactly what he wanted every time he put Clooney to paper Isaac Stern knew exactly what ... every time he put both to string [noise]\n\nIsaac starting in the Bronx men will perform this musical Mozart in about twenty minutes Mozart's violence now the number thirty six and more on the way [noise]\n\nYou say yang offers that same precision but on the guitar here she is and music ... ... ... ...\n[noise]\nNa\n\n\n\n\n\nNa\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\nWow wasn't that so much fun to listen to him a Johnson is a clarinet is described as having a magical combination of talent hand sure I think those things came through really well\nYou just heard her with the English chamber orchestra and the variations on a Swedish here by Bernard crucial\nCrucial style as you may have heard is kind of reminiscent of Mozart's music by Mozart for violin and piano is next [laughter]\n\n\n\n[laughter]\n\n[laughter]\n[noise]\n\nMusical ... this is a must when it comes to the music of ... this performance ... them in this one I\nChristine they perform here the violence another number thirty six by ... [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[laughter] [laughter] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n\nThink that's the\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise] [noise]\n[noise] and\n\nMusic like a nice stroll wanted autumn afternoons hopefully you'll have one of those to enjoy seeing you just heard Mozart's buying land sonata number thirty six\nBy Isaac Stern but panacea theme from a topsy turvy little to buy Denise his next you're going to love it\n[noise]\n[noise]\n\n\n\n[noise] think about musical color and the weight instruments can really make you think about how color is an important part of classical music I think you'll hear plenty of that in this music by Denise plant it's titled ... [noise]\n[laughter] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n[noise]\nNo\nI don't know what\nWe're [noise]\nWe're [noise]\n\nWe're [laughter] [laughter]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n", "show_name": "BBC World Service", "year": "2018", "city": "Jackson", "day": "12"}