{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\nOh\n\n\n\nBrandy breaker and Matt home\nWith you in all the jazz orchestra from together that was my Stella which was composed an arranged by match home in Randy breakfast eight feet think you'll really enjoy this music\nThere absolutely no dome moments and you're going to be taken on a right now the lifetime so enjoy it and let us know when you come back to earth and you've heard it right here on jazz with the Alexander\n\nSolo piano from Mitch ...\nFrom Seattle image you every time we say goodbye\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n...\n...\n[noise]\n[noise]\nWMA H H E to Biloxi\nWMA E. H. D. to be double you make you a fee to view WMA O. H. D. too Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. too ...\n\n[noise]\n\nDon't know that in many in the United states but they should\nHave been\n\nThey are not on\n\nBut\nThat's missed Michelle Thomas what marmaduke from her project is title I take real me with Neal algae or on guitar to work off on Barry sex Alex bed knock on base Clark farmers also on base Darren scores on drawn\nAnd die before the Charlie Parker composition job well done this time\nNext step we have music from a ... big central her latest release a cause dance and that's the title of this song\n\n\nFrom ... ... ...\n\nMm\n\n\nMm\n\n\n\nRibs\n\n[noise]\n\n\nPeople have\nTo cook for people to come in the book\nThat could be\n[noise]\nDo you go\nTo the to the people who may be\n[noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n\n\n\n\n[laughter]\nMy gosh you know do\nYou like to be with my dog and all that\nAnd I thought I was telling the truth I\nBet it\nIs but good me when he was just a lot about what this is my ...\n[noise] if I\nCould be the way it is you\n[noise] that was never really nice piece by woody Herman from Jan and Jan's if I could be received in coming up next is a favorite of mine that I'd like to share with your Quincy Jones I had a deep deep to sign this and I hope that you can join\nIt's from the project in title cool um Atari\nAnd it was actually recorded seventies\nAnd sometime ago Quincy took a public position in a in a record album by calling it this is how I feel about jam and that assertion of his musical philosophy was kind of a paraphrase to the biblical reference a punt this rock I built my church for obviously Quincy's foremost thing is\nFeeling and that's the way I feel this particular ... um Atari along with Quincy Jones is the beautiful voice salaries\n[noise] here's Quincy Jones and his wife distract from the title track cool um Atari ooh\n\n\n[noise]\n\n\n[noise]\n\n\n\nWhoa whoa\n\n\n\nUh\nI'm [noise]\n\nI'm On a\nTime [noise]\n\n\nWell\n\nDa\n\nDa\n\n\nDa\nDa da da\n\nDa\n\nDa\n\n\nDa\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\nMm\n\nDeadly Owens Aaron right to ban people calling taken us how thank you so much for being with me\nHope you've enjoyed the music looking forward to being with you again until the please take care of yourself go out and take a nice long walk inhale positivity exhale negativity drink water share this music with your children live every minute put yourself in it because\nThis after all in your life\nHere sassy Sarah von expressing my sentiments every time we say goodbye until we are together again this is the Alexander and this is Jay\nRoot done we say good bye [laughter]\n[noise] [noise]\nOh yeah no\nNo no me them well you do when your knees yeah that that and a\nDream about it\nI guess you know\nBe in just about\nWhat\nThe ... you know or maybe do my\nVery good at the time we say hey I just love\nWhen say a woman\nWho was go\nGo beyond the\nKnees they oh wow you know\n\nWhen you on there that that you end up ...\nW we may H H de to Biloxi\nWMA E. H. D. to W. made you a G do viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. tumor radiant W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford that's\n\n\n[noise]\n\nMan with a new language\n\n\nIn the\n[noise] that's Josh Nelson\nThe sky remains in this project is basically about\nThe architecture and the beauty of Los Angeles\nMany people think Los Angeles doesn't have any history or any real history they think LA is a rapid compilation of strip malls fast food joints in parking lot with a Fifteen minute memory\nBut if you take the time to look between the surface then you find the rich and fascinating history of a city like no other but often this history as hard to see because the physical structures have managed and too often we\nTo make way for re imagined tomorrow but the sky remain the same way that is the title of Josh Nelson project and it is wonderful that was entitled the architect and along with Josh on piano we also have\nThere's Anthony Wilson on guitar Josh johnson on Alto facts and Chris Lawrence on trumpet Bryan Walsh on clarinet bass clarinet Larry goal dings on him and be three Alex bona Hamlin base\nDance Chanel on drugs and Aaron surf city on percussion prior to that we had smoked sessions release of Vinson herring hard times along with Cyrus Chestnut\nGuess sushi ... and Carl Alan and that was a mogul Miller composition eastern joy Dan here's music from spider say last from like glass and this is you better watch yourself with that one you better watch\nYourself was that one\nMhm he's got away you won't suspect\nYou did your\nMom [noise] you\nWhat you should check and it just seems like he's sad [noise]\nAnd someone left GMO Stan Lee ... you\nWhy\nDo yeah mom slow ... before you know we did you know\n\n\n...\n... ... ... ... ... ... ... ... ...\n... ... ... ...\n...\n...\n... ... ...\n... ... [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] ... son barber from the music in the night taking us out that was serenade in the mood in June moved to thank you so much for joining me after Peterson taking us out when I hear music this is the Alexander and this is Jay\n...\nI Hope he knew all the\nMoney to buy music all the the ... morning raise up there the rat allowed the mail man I'm miss the show that music a minority find new music singing August ... role in this guy\nThat we're getting all the copyright nearby\nSo there is my favorite mellow day you remind me in jail or phoning me when\nI hear your new book zinc mine had he buys me Zeke anytime I think my Wilders row and then I get me out of bed and say I'm the is\nThe\n\n\n\n\n\nOver\nThere my name's Brent mellow they give you my name's Jill phoning me\nWMA H H key to Biloxi WMA E. H. D. to boot WMA U. A. G. to be you'd WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D.\nDo Ackerman W. M. A. D. H. D. to Oxford\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\nAnd Dave Holland on base CD is called like might hear each ... to future\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nMm\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise] [noise] Mm\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] or [noise]\n\nNo\n\n\n\n\n\n[noise]\n\n[noise]\nPeter Bernstein wide at disease club Coca Cola twenty Fifteen\nAnd he was too cold all too real and are real good group there with Peter on guitar Brad build on piano Christian McBride on basic Gregory Hutchinson on drums from this to CD sat\nOn the spokes sessions label called science lives you weren't listening to jazz with ... and it's great to have you with us we're going to take things down quite a bit now\nWith the great jazz trio in this instance the leader is Hank Jones as it always was for the great jazz trio the basis to your use George rats and a drummer we heard earlier in the hour right hates\nThey did a CD dedicated to songs that were associated with Billie Holiday\nCalled flowers for lady day we're going to play a cut their rendition of a song that lady did recorded less than a year before she died with the great Duke Ellington live concert at the plaza hotel in New York City the Tunis called don't explain\nAnd if you haven't heard Billie Holiday and Duke Ellington do this together on that album she that out it is utterly showing and beautiful\nThis rendition is beautiful do here's the great jazz trio which don't explain\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [laughter] [noise]\n[laughter]\n\n[noise]\n\n[laughter]\nYou can't beat the blues Kenya Lou Donaldson knew that had to use the blues as a basis for the Joan hip hop\nWe heard it down there by Tim war field on gender Sharell Stafford on trumpet FBI hockey on hand to be three does great work on the having to work at all through this CD\nWhy wouldn't lend them the drummer by run played with a pretty good habit be three player joy deep breath and just go for a long time and Daniel so doughnut God percussion\n\nIt's been our pleasure to bring you the great American music we call jazz we hope you enjoy it at all they've won here thank you for joining us we go out this summer with walk weiskopf from his CD the way you say it and coffee and stones [noise]\n\n[laughter]\n\n[noise]\n\nWMA H H E to Biloxi WMA E. H. D. to boot WMA U. A. G. to view WMA ... H\nHe too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford [laughter]\n[noise]\n\n\n[noise]\n\n\n\n\n\nHeck no bleach to each of the ... which done by the Cory weeds little big band\nThere is a weapon or twelve people in this Dan Rather than sixteen or Eighteen piece big bad but they sure do sound like a big joke towns and the conductor bill coon the ranger had both like to East Village\nAnd of course ... we still going on ... also John ... trumpet to solve all of us there and the CD by the way scold explosion\nJust from the Cory weeds little big band some great stuff on here some standards and also a certainly are some things that you might not hear all the time like ready and able from Jimmy Smith minor mishap like comics when it gets a lot of GOOD Music on ...\nYou're listening to jazz when they won here's Larry Corey out and wage earners to contribute to the great queen of Egypt effort teaching\n\n\nBall or\n\n\nMm\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\nYeah good stuff from John David called slowly but surely that's for me to see the changes over time with John that the ... the basis and draw could record on drums slowly but surely John Davis\nYou're listening to jazz would have one here is mighty good stuff in the from David stat head Newman\nThis is from the CD song for the new man John Hicks is on piano Curtis Fuller on trombone John medic on basic Jimmy cop on drums when I fall in love\n[noise] [noise]\n[noise] [noise]\n[noise]\n... [noise]\n...\n[noise]\n... ...\n...\n... no no no no\n\n[noise]\nMy mom had a\nYou know on\n\n... and\n\n... ...\n...\n... ...\nYou\nHow they make some names come around [noise]\nMhm\n\n\n[noise]\n\n[noise]\n\n[laughter]\n\n[noise]\n\n\n\n\nMhm mhm mhm\n\n\n\nMm no not\n\nA\n\n\nThing [laughter]\n\n\n\n\n\n[laughter] Mm\n\n\n\n\n\nMm\n\n[noise]\n\n\nMm\n\n\n[noise]\nEither walk through and it may decide on hold just one of those things\n\nThank you so much for joining us this hour and we hope you enjoy all the great American music we call jazz they won't miniature up with Doug Web from his indeed the bright side and the dry\n\n\n\nWMA H H E to Biloxi WMA E. H. D. to boost WMA U. A. G. to viewed\nWMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. D. H. D. to Oxford\nDum de ... from his C. D. L. A. meetings\nAnd a two dedicated to was that the proprietor or running Scots the famous one didn't jazz club Pete king to scold Pete kings heart\nAnd along with our turtle or have I have spent base the lottery ... yeah I don't have the we streak William guitar Garcia on drums and right now the rabbit on Congo's\nA special guest shows up on a couple of cups on this CD L. A. meetings ... it's definitely worth checking out your unless you make the jazz with Dave swan here is kind of sex player Sam do one and a tune by on Tony will Carlos beep pretty state\n\n\n\n\n\nShame Dylan for the CD out in the open and to stay for Antoni will Carlos ... being\n... Peter Zach on piano your she walking on base and really drawing on drums\nAnother Turner player did a beautiful version of three straight Joe Henderson at UCD double rainbow all music voucher will be on that CD people like you ... ... talk I think Christian McBride joining Joe on that recording\nAnd you're listening to jazz with the one here is drummer Eliot ... he's worked at Chris Cheek used the Turner player here Mike equipped on piano and worry loaded on base regarding chickens too good by\nNa\nNa\nNa\nNa na na na na\n\n\nNa\nNa ... oh\n\nI'm\n\n\nThe Brandenburg Concerto number four ... new book college ... moves become of lakes [noise]\nListening on ... ... what the doctor ordered a great ... Coltrane mine mine among\nMixing like short read more from Malone and then for joining me marrying Michelle the W J yes he [noise] seven to ten we\nOnly ... music radio\nStations have been ... music radio R. W. M. A. H. Biloxi W. M. A. E. bimbo W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be online dot O. R. G.\n[noise]\n\n\nThey often come and that everything old is new again as indeed music from other earlier hearings consumption like a time machine reminding us of years gone by will also revealing\nYour ... aspect to do that show renewed or experience with every\nHearing which is why musical performance sometimes is called interpretation because every plane should be different from every\nOther but I couldn't get away every\nWeek with clean machine music over and over so\nIn today's program we're going to share some truly do adventures the new dumps in Oregon created for the intimate Sharron to design a Christ Church Lutheran in Minneapolis or didn't excerpts from it to the doctor will cost you\nKnow there are other recent installations too at the immaculate conception the ruins Springfield, Illinois and holy trinity ... Minnesota\nAnd an instrument that truly has been made new again the you only an Skinner mammoths built in Nineteen thirty five re installed in recon figured auditorium space at the University of Minnesota\nAnd Brazil sounding with much greater presidents an impact than ever before will contrast before and after\nAnd find out what's new here\nPipe dreams from American public media I'm Michael Barone do stay with me [noise]\nContinuing supportive pipe dreams is provided in memory of Wesley seat doubly by his family\nWith additional support from Walter McCarthy whoever humid and the grey stone foundation Gen ... on behalf of her Family Foundation the art market camera for him to be a jar key foundation in celebration of the life of Martha ... camera\nAnd from listener contributors to this public radio station\nSport also comes from Patrick Jay Murphy and associates incorporated a stove Pennsylvania\nAnd ... ... S C I F total pipe organ resources of eerie Pennsylvania\nMembers of a poll by the associated pipe organ builders of America which is a collaborative of designers creators had maintained there's a pipe organ founded religious and educational institutions concert halls and residents throughout the United states and beyond\nThe scope of resource guide and remember prospectus available a P. O. B. A. dot com\nAnd now let's find out what's new today on pipe dreams [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n...\n\n[noise] [noise] [noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n...\n[noise]\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n... D [noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\nNa na\n\n\nNa\nNa na\nNa\n\n\nNa\n\n\n[noise]\nSome of the softer at the grand herself Chavez ... adoption pipe organ we just this past may in the summer than designed Christ Church ... Minneapolis\nWere ... Peterson ... professor at Luther coverage in court I played the ... concert last may\nAlso knew to Minnesota is an organ that holy trinity ... in New own made by South Dakota builder John normally\nAs you will notice the ... or the more lives than those in Minneapolis but perhaps not quite so much as you get Springfield John Ryan what is it gets too was for the ... concert series you'd do on his program included some charming variations ... to this time of year\nWith the changing seasons but deadly bucket variations on the west rose summer ... century Irish too I think you'll find it will get you quite rightly the organs stops and\n\n\n[noise]\n\n[noise]\nWhat was the good old days of the century American contribution for the old variations there on the last ... summer many gems from Japan of do the book who was foremost teachers and ... of the nineteenth century America there's music played\nJonathan Brian ... costs you're on the new John ... pipe organ at holy trinity cathedral in ... Minnesota but now you're ready to just last year\nJonathan Brian tours international aid but he is also the newly appointed director music at St Michael in all angels church in Dallas texas we're exploring some recent instruments here and they're listening to watch new today on pipe dreams from the American public media\nYou can see pictures and to fight for background about ... features and our players to we have that detail on line ... pipe dreams dot org and this is program Eighteen forty I'm Michael Barone it's always a pleasure to be able to share this music with you\nParticularly in this next incident at the University of Minnesota in Minneapolis north ...\nFor him has been and continues to be a major elements of the schools original core quad wrangle\nIt was the main ... space in years gone by five thousand feet auditorium with the Minneapolis symphony in the Metropolitan Opera use to form that calculus graduation there were accompanied by the sound of one hundred and eight rank your audience Skinner pipe organ\nThat had been installed early in the Nineteen thirties [noise] this is your ... represents the grand aesthetic of that day rich and colorful and powerful\nBut unless you were president ...\nWhen the Oregon was played at Northridge\nMost people would probably totally unaware that a pipe organ existed at all in that space posing for manual console usually getting way below the floor of the pits\nBrought up on a hydraulic lift when needed the pipes all were tucked into a chamber above the percentage you spoke through an ornate real\nIt was a thrilling if somewhat diffuse effect\nCertainly like no other in the states\nBut you had to know to ask for it if you will know recently\nIn search of a new purpose in used for North ripped the building on the weather major re allocation main auditorium space was made smaller by half\nBut the organ for bands happily and know speaks much more directly into the much less cavernous environment refurbish by the only bigger company of Connecticut\nThis marvelous aliens ... will be showcased ensue performances the weekend of October twelve and Thirteen\nMinnesota Orchestra concerts on those evenings and special free demonstrations of the newly audible intricacies of the ... hundred and eight ranks pipes on Saturday morning October thirteenth\nAnd open control Saturday afternoon details are hatch P. C. A. G. O. dot O. R. G. look under your bench and they give you a sense of\nUh the somewhat otherworldly opulent sub the original shout here's a Nineteen Ninety recording that I made a concert by university organist dean bill Myer playing a ... by former university composition professor Paul fact\nThis is more than pennies from heaven\nShown comes down on you like ... lightning\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]", "year": "2018", "show_name": "BBC World Service", "city": "Jackson", "day": "07"}