{"month": "10", "state": "MS", "station": "WMPN", "content": "You don't know I\nGo to\nNa\n\n[noise]\n\n\n[noise]\n[noise] have you on the you know\nWants you to\nKnow and the you know me tell\n\n\n... a\nSeason Jean [noise]\n\n\nNa\nNa\n\n\n... you know you're not\nYou know\nNo no no\nShe means\nNo\n\nNo\n\nThat's army men who civil wars with poison and why before that lord here on the night we met here on rock cafe thanks to our friends at W. H. E. R. in Syracuse New York ... W T and Odessa, Texas members of the world cafe affiliates nation wide who helped make the show possible\nHey how to listen to that I Know my sandwich\nWith chips or has a\nThat is Leon Bridges that's on the record exclusively for rock cafe no original tearing you can find that on our podcast called World Cafe words and music our whole session with Leon Bridges he wants to hang out with you there you know who else does this woman I'm pop music sweets cousin\nAnd I'm I'm at the table but I'm just a wee a cousin that's Christine in the queens so you got pop music is weird 'cause then you got Leon Bridges singing songs about sandwiches with the chips on the side that you want to subscribe to our podcast I Know\nIt's called World Cafe words and music you can find it wherever you get your podcasts and if you ... you can help your friends discover World Cafe at thanks so much for lifting the shall we make a WPN and the University of Pennsylvania in Philly\nAnd ... and this is about cafe\nWorld Cafe supported by visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic drugs including St Pete's Dali museum the holy collection and the museum of fine arts more at visit saint Pete Clearwater dot com\nThe globe if your home for the great American song what each week old showcase the best to local jazz in popular song the Nineteen thirties today from Frank Billy an ally looks like Kurt Eli Dianne Reeves in great reporter market July spend some time with after glow\nSundays had six my MPP music radio\n\n\nStations have been ... be music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. M. Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\n[noise] hey you're listening to world\n... ...\n... singing and do it with Nicole Atkins on their latest album please well with others but she's not kidding you not only played well with others coordinate well with others we're managed to get nine different health thing and writes us with her on that record hardworking busy people like a goal\nLike John Paul light shoulder rope to fear since you've ever tried to get nine people over for dinner on the same night and you know what an amazing the that is but it's not six degrees of Kevin Bacon one degree but symbolically [noise]\n\nTo recover that tune ... and more coming up on rock cafe\nHop along ... coming up later on in the hour or two but first do you ever want to scream at the top of your lungs what's going on\nYeah we're not one where\nMm\n\nWhen I knew a\n\n\n\n[noise]\n\n\nThat's still a blog with cautionary tale before that in another life you went off your a lens out in the collaborations that one featured Nicole Atkins here on World Cafe\nYou know when you shake a big bottle of seltzer on the way home and then when you try to open it you have to stand over the sink you're sort of like in the throes of an elemental or at least in the cabinet and all the carbon dioxide is rushing the service and try to get out to me that is what the latest album by hop along ... park your head off dog\nSounds like it's a prime example of a prior to things\n\nOh\n\nOh\n[noise]\nWell I don't\n\n\nThe the issue where\nThe ...\nTo do\n\n\n\nBunny there with me she can't before that sort of a spiritual musical sibling to bunny ... for instance Quinlan hop along with prior things stick around to hear one off the latest record my new moon by ... that is coming up on World Cafe\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\nRead Nate Germany\n\n\n\n[noise]\nMargot break with a little pain before that the replacements can't hardly wait we're playing one degree of Tim Buckley when we get back to World Cafe\n\n[noise]\n\nHey we'll come back to World Cafe um ... you are going to hear two versions of a song called I never asked to be ... it was written by Tim Buckley originally performed by him and his original version is coming up in a moment where you think you really be able to hear the intention behind the words that he wrote\nIn a very different way than you could hear them undiscovered by best Orton and the chemical brothers that air\n\nOh [noise]\n\n[noise]\nAnd they\nBe\nBe\n\nMay be the main thing is [noise] they may be [noise]\n\n\n[noise] [noise]\n\n\n[noise] [laughter]\n[noise]\n\n...\n\n\n\n\n[noise]\nAnd [noise]\nDo you do one thing [noise]\n\nAnd they know that can live on a game when you\n\n[noise]\nYeah it is\nMood [noise]\n\n\n\n\n\n\n[noise]\n\nAnd [noise] [noise]\n\n\nThat's some Aretha Franklin for you closing out the show baby I love you before that Jeff luckily liver you should've come over race here on World Cafe thanks to our friends at NBA eighty nine in Reno nevada and WG see you in Fort Myers Florida members of the world cafe affiliates nationwide who make this show possible\nThank you we make the show a W X being from the University of Pennsylvania in Philadelphia I'm Talia ... we've got a pod cast its World Cafe words and music you can find a whole bunch of our interviews that you might have missed on show hey thank you so much for listening to the world cafe from NPR\nDoing most relationships so you only hear one side of the story the ban hearts as a married couple made their latest record during a hard\nTime when they weren't sure what would happen if their relationship or with their career songs have all the urgency of working through it from both sides [noise] let me tabby and then he gave her to tell their story at heart [noise] run live in the next World Cafe\nI'm Larry Gross from Albuquerque saying why women's radio NPR\nSaturday Night at seven on MTV music radio\nDecisions have been people be music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nThere'll be impeded in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ...\nMine duck or gee\n[noise]\nDo you remember the story of Martin Luther nailing his religious dissent stood that church door that had been led to the Protestant Reformation movement as well as this means that [noise]\nIt's Felix Mendelssohn spit symphony he wrote for the three hundredth anniversary of one of the reformation movement key documents religion meeting music in a really interesting way [noise]\nTo work as a nickname the reformation symphony and you'll hear it later this hour I'm Garrett McQueen musical Mendelson in more coming up on music through the night [noise]\n\nYou know plenty of motor beard he wrote terms of church music during his life alongside a few secular works he's an excerpt from an opera he wrote back in the sixteen forties\n\n\nMm\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nMusic you could describe as having a beautiful aroma pope hurry on things of Mozart's music of Louis spore still to come Mendelssohn spit symphony and worked described by composer has already been that's next\n[noise]\n\nIf I see the word ... to you what comes to mind\nI immediately think of a Latin and flying carpets my lord earlier this week that a radiant horses are I think to always something new to discover well here's the moravian music by composer Francisco today got it's called the Arabian Caprice\n\n\n\n\n\n...\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n... leading the London symphony orchestra and that performance of Mendelssohn symphony number five his reformation symphony I'm Garrett McQueen\nLooking for a youthful perspective on classical music oh I'm going to play the alleged transcendental attuned number seven it's very exciting an air traffic and their party in parts of South Park and overall it's a pretty good [noise]\nNo further back from the top joined me for it to pro running for our tenth anniversary seen each week right here on NPR Saturday morning at nine on MP be music radio\nStations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online duck or G.\n\n\nBeethoven was really great at music of course but also networking among the books he rubbed elbows with during his life where kings queens and even Russian czar he wrote this piece and dedication to what\nThat lucky czar was Alexander the first he didn't need Beethoven's help to be any more popular but\nHaving a set of chamber works a dedicated to you doesn't hurt does it\nYou'll hear one of the works and that set in about five minutes I'm Garrett McQueen Beethoven's violin sonata number six and more coming up music through the night\nHere's a dedicated piece by Lou Harris and it's called el ...\nNah\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nMm\n\nMm\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [laughter]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nThink about the way your day is shaped probably a nice soft insurance which you waking up in bed huge swells in the middle at work or your other activities and\nIt usually ends the way it began right there in bed at was music that had a similar shaped musical modus Missouri risky dont over there\nRiver Moscow and give them a queen thanks for coming along\nThe composer Edward elder was a kid he wrote a few musical sketches into a notebook and put them away for many years well when he was all grown up he went back to those sketches and created two new composition and one of those does this week called the won W\nThe other is his nursery sweet here it is formed by the Indianapolis symphony orchestra\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\nMaestro Raman leopard there with the Indianapolis symphony orchestra you just heard them performed the nursery sweet by sir Edward Eldar I'm Garrett Micheline\n\nEven ancient music for centuries ago since ... into my\nEven contemporary every weekend Sunday perhaps you can\nHear a variety of modern performers treats can use it gets a living art form you put their unique imagine it gets stamp on music fan the Eighteenth century earlier and it came down and I hope you can join me for some people will be\nSunday Morning at six on MP be music radio\nStations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. N. Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\n[noise]\nBeen speaking about modern off\nWas around he ended up in the United states well he spent much of his time thinking about his homeland of mother Russia [noise]\nThis piece of music was born from some of those ideas it's described as a summation of his entire catalogue it uses rushing him says one of those excerpts from some of his earlier works completed in Russia\nYou'll enjoy this American perspective of a Russian homeland in about six minutes rock modern ops symphonic dances and more coming up on music through the night\n\nIt was a performance by Russian pianos make out planting if he performs Rondo by Carl Philip Emmanuel by\n[laughter]\n\n\n\n[noise]\n[laughter]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[laughter]\n[noise]\n\nMhm\n[noise]\n[laughter]\n[laughter]\n[laughter] [laughter] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\nMonday Night\nI'm not trying to\nWhat\n\nDo\nWhen when [noise] when [noise]\nWhen I was when you talk about [noise]\n[noise]\n\nWhen when when the number [noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\nYeah\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n[noise]\nUm [noise] [noise]\n[noise] [noise] [noise]\n[noise]\nThat was Henry personal theory queen sweet I'm Garrett McQueen thinks we're listening\nTo this is Chris stealing a bike joined me right here every Saturday from prairie home companion\nWe'll be joined by the best musicians something you'll know when did you might not know yet but we'll\nMust have been a comedy I knew some of the week ... biscuits each summer questions if you were surprised some as well All right here each week on a personal Saturday sides on M. T. V. music radio\n\nStations have been ... music radio R. W. M. A. H. Biloxi it'd be you may ... ... you may you view\nThe MPs Jackson W. M. E. W. ... it'd be it may be W. M. A. V. I. W. M. A. O. ... chicken what's happening on MTV music radio we listen online and you'd be be online or G.\n\n\nWay back in the baroque era of classical music improvisation was huge this off the cuff style is one more associated with jazz these days but it still live in a way on the classical side in the form of fantasy [noise]\nMusical fantasies like this one by WC were meant to sound like the soloist is improvising\nThe notes are indeed written on the page but it's fun to hear what composers like WC came up with [noise]\nBill here this performed by Johnny today in about ten minutes I'm Garrett McLean but they'd be seeds fantasy for piano when orchestra and much more on the weight\n\nUse music by a leader French composer ... who's like this is a work up his title ... performed by the jealous of the Berlin Philharmonic\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\nNo no no no no\nIs Johnny today with the Leone national orchestra indebted BCS fantasy for piano in orchestra the ... takes the stage next in music Beethoven\n\n\n... McLean thanks for joining me concerning this next composer Mozart once said watch out for this boy one day he'll give the world something to talk about well the boy was lipstick from Beethoven this is a string quartet number three performed here by the ... ...\n\n\nMm [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\nMm\n\n\n[noise]\n[noise]\n\n[noise]\nMm\nMm Mm\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\nMm Mm Mm\nMhm mhm Mm\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\nMhm [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\nMm\n[noise]\n[noise]\n[noise]\nGoing to do [laughter]\nNo no no [noise]\n\nNice understated conclusion to that otherwise very energetic string quartet by Beethoven you just heard that one performed by the Amadeus string quartet I'm Garrett Micheline like so much for joining me\n\nMusic has been around you know that there's always more new interesting music if you know where to look\nThe discovery never stops and young fans excited you know the musical secret [noise] undercover some connections generations cultures\nRoots pop maintenance\nYou know flips together how bitter Sunday night at seven\nOn MTV music radio stations have been ... music radio R. W. M. A. H. Biloxi WMA ... W. M. A. you view\nW. M. P. N. Jackson W. M. A. W. Meridian W and may be stuck for W. M. A. V. Oxford W. M. A. O. green check out what's happening on him\nThe music radio and listen online at him be be online dot O. R. G.\n[noise]\nClassical music like oh art in a way is filled with interpretation violinist by the Greta thanks a musical interpretation it's a combination of her personal beliefs and the composers probable intent\nThe composer of this work I think would have really appreciated her interpretation of [noise]\nIt's music of Carol ... the energy and excitement of this work is perfectly interpreted by violinist like by the screen\nYou'll hear her performing in about six minutes I'm Garrett McQueen shame and skiing and more on this Eric classical music [noise]\n\nInterpretation is very important when it comes to older works to like those of handle here's a bit of handles music interpreted by the Apollo fire baroque orchestra ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n\n\n\n\n\n[noise]\n\n\n\n[laughter] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[laughter]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n[laughter] [noise] [laughter]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]", "year": "2018", "show_name": "BBC World Service", "city": "Jackson", "day": "05"}