{"month": "10", "state": "PA", "station": "WVYA", "content": "And translators W to want to a T Clark summit W to eight nine ... W to zero seven eight Williamsport and don't need to seven eight eight ... listener supported public radio\nSupport comes from the artist soap and house weekend I'm ... twenty four artist exhibiting a variety of unique our treasures at twenty locations studios are open ten AM to six PM October ... through the eight five seven to seven eight two or three three to four artist tour dot com\nCloudy this afternoon with high in the lower seventies clouded this evening with a slight chance of showers lows in the mid sixties and mostly cloudy on Sunday with a slight chance of showers are thunderstorms in the afternoon eyes in the upper seventies this is double ...\n\nLA opera Amiri made possible through the generous to port of Los Angeles county supervisor she ... LA operas production of Moby Dick was made possible in part by a generous gift from Avon and Gordon Getty with special underwriting support from Murray each song\nThe following program is a production of classical K. U. S. C. a listener supported radio service of the University of Southern California\n[noise]\nHow did you say ... welcome to LA open up on our [noise] I'm so happy that you are joining us as we present on me one of the use of some kind of used by bless you called K. U. S. C. blind\nHome on the news and the ... the ... billion in downtown Los Angeles [noise]\nWhen you're seeking drama come together on the stage do some magical combination [noise] think credible beauty an emotional power of the human voice goes straight to our hearts creating memories that last a lifetime\nThank you for listening I Hope you enjoy this performance\nAnd now they will come our host of morphine [noise]\nThank you fluffy to them and go and hello again from a music center in Los Angeles today's performance offers a sea faring voyage based on a classic tale\nAnd opera by composer Jake ... in the British gene sheer it had its world premiere in Dallas in two thousand ten [noise]\nThe story follows Herman Melville Eighteen fifty one novel regarded by many as the single greatest working American literature\nFrom its famous opening line call me Ishmael too is dramatic conclusion a hundred and thirty five chapters later Melville themes are as fast\nAs he is not always epic\nCentral plot follows a sea captain global crossing\nThings are as vast\nAs his novel is epic\nCentral plot follows a sea captain global crossing quest to find and kill the giant white whale the destroyed his ship and bit off his leg\nBut the novel is about so much more fear in prejudice the limits of human knowledge fate versus free will man versus nature and the consequences of madness\nHow then do ... and share distilled this massive work into a three hour opera\nFirst they streamline the action by using only the sections that take place entirely at sea\nDiscarding do set on land\nAnd while the novel has dozens of characters the upper primarily concentrate on five of them\nThe wailing captain Ahab obsessed with revenge Starbucks at about a family man who hopes to keep captain ... madness in check quake quake a Polynesian harpoon or hit a cabin boy and finally green horn a newcomer aboard a ship\nMusically the opera futures boisterous courses for the ship's crew focused do ... and small ensemble and express an arias for the principal characters\nReaction of the first act set entirely at sea takes place aboard the ... or wailing ship from Nantucket\nIts newest memories Green Hornet and his very first voyage\nAfter we could see Green Hornet is both fascinated and frightened by a tarp lunar quick way South Pacific Islander\nQuick legs prayer son ... is the first thing we'll hear in the opera\nAll the crew members look forward to the money to learn from this wailing voyage\nCaptain Ahab strides forward to address the men a commanding figure with a peg leg carved from well bone\nHe reveals its true mission\nTo find and destroy the monsters white whale the bit off his leg during his last voyage and as an incentive captain Ahab says he'll reward the first man to spot Moby Dick with a goal to balloon\nWhich he dramatically nails to the mass\nStarbucks the captain's first made is the only one who realizes that they have the mission will put them in grave danger\nThree long months pass at sea without a hat allowing the crew to hunt until Moby Dick is found\nAs the men broke restless and racial tensions lead to violence Starbucks is able to persuade a have to let the manhunt\nDuring an ensuing pursuit one of the wailing boats cap sizes and hip is thrown overboard\nQuick quick rescues the boy but the ordeal has driven the lab to madness\nQuick way to strengthen compassion however make\nA great impression on green horn and the two men form a strong bond of friendship [noise]\nNevertheless they have obsession continues to grow he can think only of killing Moby Dick\nAnd one Starbucks tries to reason with him he had threatened him with a\nGun later Starbucks finds the captain sleep in his cabinet picks up a gun and reflects on his captains madman\nSimply by pulling the trigger Starbucks might survive to see his wife and child again\nAnd he would have saved the rest of the crew was well slowly however is the first that comes to an end he puts the gun down\nEnergy hunter more things to leading role of captain Ahab tenor Joshua Guerrero is green horn and baritone Morgan Smith Starbuck the role of quake quake is performed by baritone most on who wanna\nWe'll also hear Malcolm McKenzie and Matthew O'Neill and stuff and flask the ships second and third mates with the front of Jacqueline\nEchoed the only woman and a half from the ... of the cabinet [noise]\nAnd we offer as music director James Comey is the conductor of the performance which was a forty five at the center for billions November [noise] more information about his performance in food production photos in a complete tasks lifting\nGo to LA opera dot org\nNovember two thousand [noise] more information\nAbout his performance including production photos in complete tasks listing go to Eli opera dot org slash Moby\nNice for common has made his way through the orchestra pit where he'll know conduct the first act nobody operas performance of Moby Dick by Jake ... in gene cheer\n\n\n[noise]\n\n\n... the\nOther one way\nOr the world I\nKnew\nWho we\nA\nMan\nHe would just be aware of\nWhat's\nGoing\n\n\nOn in\n\nOh my gosh [laughter] [noise]\n\n\n[noise]\n\nOh\n\nIt give us they don't\nSee\n\nDon't\n[noise]\n\n\nThey're all in the navy\nWhen\nWe're in a remote row after\n\nRow raising it takes\nA lot better than what\n\nWe read the whole game [noise]\n\n[noise]\n[noise]\n\n[noise]\n\nAll they\nWhy why\nIt gets me about one\nThing I I think the\n\n\n\nI Know\n[laughter]\n\nI Know\nThat\nBe\nTo be willing to do when you\nYou're young you don't you just don't like it you\nBe like hey I Know I mean do\nThey have been\n\nMany\nJust want to live [noise]\nOh oh I heard\nA lot of it as far as we All right oh\nYeah I don't know what they say\nIt's not really easy is it not maybe it's not like and all of\nA of\n\nA\nProblem with the\nA lot I Know\n\nI go out on our website is\nI\nSaid and\nOh\nUh\nOh I I\nI I\nI don't know I\nMight I might say\nThat the reason why we're going\n... and I don't know\nWhat I mean I\n\nI I [noise]\nThat was why was my wife\nDied on me and my ah the\nWell the Greek restaurant row\n[laughter]\n\n[noise]\nOh\nNo\nNo no\nNo I mean\nI\nLove what\nThey\nWere written more than one [noise]\nNeed to\n\n\nChange\nThe way\nThey do\nTo\n\nChange\n\n\nThe ...\n\n\n\n\n\nWhile I\nWas the\nUm [noise]\n\n\nWe want to talk about\nWhat we know\nWhat [noise] [noise]\n\n\nAre\n\nNot going\nI mean I\nRetired I even\nTried to tell\nStuff I I did\n\nWhy do you\nWant\nSay that you want\nThe wire\n\n\nAnd why why why why one\nOne or\n\n\n\nWas on this might be a brand name you know when I\nWas reading in law ...\nWhy why a ...\nOh\nMy God oh\n\n\nMy God oh\n\nWhy na\nNa na na na na for our\nOwn people\n\nAlong oh what\n\nLot and I mean\nRely on the\nNew\nMommy\nAnd a bomb\n\n\nMaybe\nWhen uh I I'm a member\nGod\n\nOh\n[noise] it's all on\nHold for\n\n\n\nNumber\n\n\nThe phone\nWho\nKnow slow\nOn the on off of who you know how much you need\nTo be [noise]\nSweet\nCorn oh\nOoh we'll\n\nOh\nOh oh oh\nOh oh\n\nLa la la la\n\nKnow\n\nI didn't see anything in that a\nThat are coming\nUp on the on the phone\nTo\nBe on\nThe\n... you know there was a lady\nLast night by by this law has already\nDied on me I can just log on what on your heart can we rely\nTop\n[noise]\n\n\n\n[noise]\nAh I\nDo not go through that and that's argued about\n... like the way you know\nWhat they what they were\nSo we're\n\nLow world but you\nWas a\nThat I Would like [noise]\nOh I don't know how I\nAm\nIn la la la la la la la la\nLa la la la la\nLa la land that was\nGoing on\nYou know I I [laughter] I I\n\nA a [noise]\nCaesar or we're\nA\nMany\nUh [noise]\n[noise]\n\n\nMy [noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\nAnd and then\nYou just heard that they don't want to engage\nIn a\n\nWay the law\nIs on a\nI I\n\nThought that was\nLike whoa whoa whoa\nWhoa\nWhoa\nWhoa\n[noise]\n\nMe I'm a I'm a I'm\nI'm a guy\n[noise]\n\n\n\n[noise]\n\n\nUh\nI'm a I'm a [noise]\nA\n\n\nLight up on the [noise]\nThe one\nWho\nRecall the\nThe\nNa na oh\n... or\n[noise]\n\n\nOr [noise] or on\n\nHey must speak with you\n\nWell I'll use to get [noise]\nMost of the morning to\n[noise]\nAnd also\nWhat was that she has to be\nReceived [noise]\n\nI [noise]\nNo I\n\n\nBought\n... no\nNo\n\n[noise]\n\n\n\n\n\n[noise]\n... off\nThe money to try to come forward with the\n...\n[laughter] [noise]\nWhat was the oldest\nOne who wants\n\nTo go\nOff in a\n\n\n\n\n\n\n\n\n\n\n\nOh\nOh [noise]\nCaptain\nAhab professors from a bench against the elusive white will inflate his first may Starbucks to contemplate murder in the first act could only offers production of movie did a composer Jake have you and the British genes your\nNo I\nWas you know so well why\nNot be a good\nThis role model oh\nWe are\n\nWhere are they going\nTo be a\nLot of talk about oh that's what they had a friend of mine that by\n\n\n\nTime and I I\nI I I I really\nLiving in a\n[noise]\n\nA one\nMan\n\nWho\nWrote\nWho I'm a horrible\nMore than\n...\n...\nThe\nOne\nIn my\nJob but you\nKnow the camera [noise]\n\nEvery\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\nWe're going to [noise]\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n[noise]\nOh oh it's\nA [noise]\n\n\n\n\n[noise]\nAre you\n\nKnow [noise]\n[noise]\n\n\nI Hope I'm doing\nDo you know what I\nI put\nOn I think they\nAre what\nAre the\nSame way [noise]\n\nDon't know what I\nRead or number take your friend the one we're\nAll they\nYeah oh oh\n\nOh oh oh\nOh I\nThink we [noise]\n[noise]\nOh do\n\nYou owe more money than the\nMole oh well All right All right we'll run the bullet oh why they\nRing up there\nIn\nThe rain and then there were a lot more and more I think they will not\nLet alone medication I'm suffer the oh\nAs bad as they do I do I do as well and\n[noise] I don't know no one\nDon't buy any more\nWay beyond any more money on the\nLine [noise]\n\nAh\n\n\n\n\n\n\n[noise]\nThought well wait wait\n\nDon't\nTell\nMe what you do\n\n\n\nReason why\nThey\nWell I thank\nYou [noise]\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nWell I my\nMind but\n[noise]\n[noise]\n\n[noise]\nMm my\nI'm Sorry [noise]\n[noise]\n[noise]\n[noise]\nI'm In\nOregon we\nUsed\nTo me I I don't know\nMaybe\n\nBe you\n\nI think well I Know you don't\nThere's also a I have\n\nThis thing is most of my\n\nMind\nOh\nOh\n\nCool [noise]\n[noise] [noise]\nOh my on my own\nAround and then I get is maybe [noise]\n[noise]\nI was in the audience you\nThis oh\n\nGod\nOh\nGot to read I don't\nWant to change that it's just\nNot be all for the call\nShe really I'm not going to see if we don't know what\nSee in the\n\nWhole I think\n\nIt is I\nDon't know what they're saying well hey I'm a I don't know what's going\nOn in\nThe day or\nA bottom line\nAnd I am I Am too hard\nOn on the news\nI mean I I fly right\nLa\nLa\n\nLa la la de ... much interest you have a\nLot\n[noise]\n[noise]\nOr you say it's not really knowing what we go oh boy I saw a\n\nLittle all\nOf them was a\n\nOh ...\nUh\n\nThree point nine or ...\nOr ...\nWhy is it is for the call and tell us about\nWhether or\n\nNot the\nOnly way I mean I'm\nA I\nMean the our board I\nMust be our the recall I mean by\nMy\nIn laws are man whoa whoa whoa\nWhoa whoa\nHey ha ha ha\nHa ha ha ha\nHa ha man\n\nI don't know who\nYou know [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\nOn on the\n\n\nOne\nThat\nWe\nWould all the\nTime and ah [noise]\nI wouldn't go away any\n\nWhat they call I think you know somebody\nThat's what\nThey want to have a little town called ...\n\n... what\n\n\nOh oh oh\n[laughter] well\n[noise]\nWhen\n\n\nMy wife [noise]\n\n[noise]\n\nMm [noise]\n\n\n\n\n[noise]\nIn\nHis maniacal discrimination to kill the monstrous white whale captain Ahab loses everything he shift his crew and his own life for me a single survivor lived to tell the tale of Moby Dick free will now calls himself he's my [noise]\nThis is losing the belly operas Moby Dick by composer Jake heavy immigrant is gene chip [noise]\nJay hundred more than the roller captain have with Morgan Smith is his first made Starbucks\nAnd Joshua Guerrero as ... [noise]\nWe quake was performed by ... wanna jak when ... was hit the cabin boy Matthew O'Neill nothing McKenzie with flask and Nicholas\n... things almost half from Gardner [noise] be hurtful nice touch tango and done with a foreign by some other key and a two day on the ...\nWe also heard Todd Strange as the mental could sailor and James Martin safer as the Spanish they have [noise]\nThose are Jake heavy and the French Jews sheer have collaborated on several works together\nProduction throughout the United states has also been performed in Australia and Canada [noise] their latest offering it's a wonderful life which beard at the Houston offer in two thousand six team\nWill be saved by San Francisco hopper later this year Vicky is also the composer be offered dead men walking which in the past two decades is that nearly sixty production\nFive making is one of the most popular offers of our time [noise]\nAre\nConducted James common has been LA offers music director since two thousand [noise] the concert master of the Los Angeles off of work history has Roberto ... is the director of the Los Angeles off before [noise]\nFinishing his performances in Los Angeles energy hundred Morris has previously if you're just half and a half trillion San Diego and San Francisco the two thousand a month and he was highly praised for disappearances eat fried at the metropolitan offering this new production of the rings I felt [noise]\nThis production of Moby Dick was saved by Leonard phobia directed the offers twenty cents\nFor you to combat falling in offering me the production of every five [noise] production a movie with the spy Leonard direct could be offered twenty and we'll preview in Dallas [noise]\n\nAnd we offer on Eris production of USC and only offer under the leadership of general director of the music director James common in President and CEO Christopher ... [noise] the audio producer Dorothy China ... billion was red ... with engineering by ...\n[laughter] my field but actually [noise] round half producers really offer his mark ... with the the executive producer company McConnell and the technical director mark half [noise] let me think of Murphy\nThanks for joining us for our final offer on her broadcast of the season we hope you've enjoyed listening [noise] where ...\nThis broadcast of LA opera on here was made possible for the generous before of Los Angeles county supervisor\n... LA operas production of Moby Dick was made possible in part by a generous skip from Avon and Gordon Getty with special underwriting support from Murray H Tom\nThis is WBAI eighty nine point nine of fat and W. vi age do you want Scranton Wilkes Barre he's old WTY eighty nine point seven FM Williamsport WTO\nEighty ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township shrimp live a W. V. I. dot org gee you're arch and information station listener supported public radio WBAI a\nCloudy for their main or the afternoon with hides in the lower seventies clouded this evening with a slight chance of showers lives in the mid sixties\nAnd mostly cloudy on Sunday with a slight chance of showers or thunderstorms in the afternoon hides in the upper seventies you are listening to double ...\nSupport for WBAI comes from the citizens voice provided loser in county with breaking news every day for the past forty years the citizens voice thanks their readers who received news at home or on the go the citizens voice here to stay more information that citizens voice dot com [noise]\nTrench Schubert wrote some of history the greatest art sons but they're they're hardly his soul contribution to vocal music and the next Chicago Symphony orchestra broadcast ... conduct Schubert intimate math and eat flat major\nAlso music by ... and ... next time with the the S L crisis any on a\nSunday at ten pm on W. vi yeah\n\nGood afternoon I'm Larry ... thanks for tuning in and coming up in just a little bit the next edition of the politics show from NPR than at five the day's news on all things considered for some music from next week's opera ... of John Donne oh here's the powerful do after being Gino up day\nFeaturing soprano ... with ten or just a ... with a product ... conducted by Emanuel deal\n[noise]\n\n\n\n[noise]\n\nOh man or woman would need that ...\n...\nOn the\nNews media does\nDo you want to bring in\nLow rules oh\nWilliam supported WTY eight eighty nine point seven FM in Mansfield a W T I O eighty eight point three of them were like well I'm ... ... Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator in Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I.\nCloudy this evening with a slight chance of showers lows in the mid sixties mostly cloudy on Sunday with a slight chance of showers are thunderstorms in the afternoon highs and the upper seventies most equality and Sunday night with a thirty percent chance of showers and thunderstorms lows in the lower sixties\nAnd partly sunny on Monday with a thirty percent chance of showers and thunderstorms highs and the upper seventies you're listening to W. vi eighty nine point nine FM [noise]\nThis is politics shell from NPR there are four weeks to go before the midterm\nElection but\nWhen\nAre going to stop and get out and vote in November\nDo everything we can just win baby there are four hundred and thirty five house and thirty five Senate seats on the line every weekend leading up to the mid term we are here to guide you through what could move to vote this November\nI'm Scott Detrow this week the most divisive Supreme Court nomination in a generation and suicides above what effect will Brett Kavanaugh's confirmation battle have on the mid term\nAnd with President Trump saying men are being falsely accused across the country well Kavanaugh backlash from conservative men help Republicans draw even with Democrats in the desperate [noise] plus a look at how the midterm results could change immigration [noise]\nAfter this news\nLive from NPR News in Washington I'm Barbara Klein amid protesters shouting in the Senate chamber senators have confirmed Brett Kavanaugh as the justice of the Supreme Court\nThe vote follows a bruising nomination process that race sexual misconduct allegations against Kavanaugh a few minutes ago before the roll call vote got underway Senate majority leader Mitch McConnell said the allegations have now been put to rest\nThis historically tall mountain of evidence adds up to one clear message judge Brett Kavanaugh is among the very best our nation has to offer\nThe will make the Senate and the country proud\nSenate minority leader Chuck Schumer has a different take\nFrom start to finish President Trump's nomination a Brett Kavanaugh to the United States Supreme court has been one of the saddest moment in the history of the Senate\nThe vote to confirm Kavanaugh fifty two forty eight protesters are still gathered outside the U.S Capitol and the Supreme Court that when to take their battle to the mid term elections\nSecretary of state Mike Pompeo is preparing for his fourth trip to pee on young to meet with North Korean leader Kim Jong on NPR's Anthony Kuhn reports from pale stopped in Japan Today along the way\nPale met with his counterpart tomorrow kono and prime minister Shinzo Abe's in order to coordinate their positions on North Korea in killing young Pompeo will try to arrange your time and place for a second summit between Kim Jong un and president Donald Trump the two sides remain deadlocked over the sequencing of steps leading to Pyongyang's nuclear disarmament\nNorth Korea has rejected us demands that it provided a full inventory of its nuclear weapons programs South Korea meanwhile suggested the U.S signed a treaty formally ending the Korean War in exchange for North Korea closing its main nuclear\nFriends South Korea meanwhile suggested the U.S signed a treaty formally ending the Korean War in exchange for North Korea closing its main nuclear plant palm pale will stop in Beijing and so on his way back home to brief leaders and those capitals Anthony Kuhn NPR News Beijing\nFrench officials tell NPR China is detaining the head of the international police organization Interpol on suspicion of financial fraud and other charges manning hung way was reportedly missing since late last month NPR's Eleanor Beardsley reports\nThe south China Morning post reported friday that sixty four year old ... home way was picked up by Chinese authorities when he arrived in Hong Kong in September\nAnd actually ... said the matter concerns French and Chinese authorities but in a later statement Interpol secretary general you're going to stop\nThat he wants an official response from Chinese authorities to address concerns ever ... wellbeing before being elected to Interpol in two thousand sixteen ... Hong way was vice minister of public security in China\nThis is NPR News\nSpanish opera singer months ... one of the world's greatest Sopranos has died in her home city of Barcelona she was eighty five\nSpain's king Felipe is expressing condolences calling ... legend of universal culture with an unequal voice the BBC's Danny ... report\nMumps or a couple of years voice was paying for your power [noise] I've heard here in which he needs Madame busted my [noise]\nHiroshima humble background to come to the world's greats opera houses ... may take key international breakthrough at New York's Carnegie Hall in Nineteen sixty five when she had to replace it probably in the title role of don't exist you create your own job [noise]\n\nStanding ovation last minute but she reached out beyond the will to vote for two most famously singing the G ... Barcelona with the lead singer of\nQueens ... appeal to her home city and the ... the most the Ninety nine [noise]\n\nQueen guitarist Brian May has posted a message on Instagram saying ... was an inspiration to the group and Spanish ten or Jose Contreras says ... had a voice of great range and the ... technique\nI'm Barbara ... NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station\n\nCloudy this evening with a slight chance of showers lows in the mid sixties mostly cloudy on Sunday with a slight chance of showers are thunderstorms in the afternoon highs and the upper seventies most of the quality of Sunday night with a thirty percent chance of showers and thunderstorms losing your lower sixties\nAnd partly sunny on Monday with the thirty percent chance of showers and thunderstorms highs and the upper seventies you're listening to WBAI eighty nine point nine FM\n[noise]\nIs the politics shell from NPR I'm Scott Detrow the October surprise came from the U.S Capitol Kavanaugh Supreme Court confirmation came into why\nThis is the politics shell from NPR I'm Scott Detrow the October surprise came from the U.S Capitol ... Supreme Court confirmation came into why of course\nBut I Will nominate judge Brett Kavanaugh to the United states [noise] just to\nHave an all looked like he was writing to the finish line allegations of a decades old sexual assault during the confirmation process into the most contentious in a generation we're going to rush to put someone on the Supreme Court with this cloud hanging over the capital and Christine Blasey Ford told their sides of the story to a national audience\nPushed onto the bed and Brett got on top of me\nI categorically unequivocally just deny the allegations against me by\nSenators loudly accused the other side of dirty politics what\nYou want to do is destroyed this guy's alive hold this seat open and hope you win at twenty twenty\nNow just weeks before voters head to the polls Kavanaugh is headed to the Supreme Court that became clear when three of the four remaining undecided senators voted to support Kavanaugh\nMr President\nI Will vote chicken for judge Kavanaugh\nHas the final vote tally became clear protestors warm the couch [laughter]\nWhat a lasting impact of this on the court on the national mood on the mid term election to talk about all of that we've got congressional reporter Kelsey Snell White House reporter Ayesha Rascoe and political reporter Tim Mak\nEverybody hey there right so it's pretty clear by the slimmest margins Brett Kavanaugh is headed to the Supreme Court Kelsey walk us through when that became crystal clear on friday\nIt became crystal clear within a matter of minutes when Susan Collins the Republican senator from Maine announced on the Senate floor after more than forty minutes of talking\nThat she was going to be supporting Kavanaugh and then just a few minutes later Joe mentioned the Democrat from West Virginia announced that he would also be supporting cap it on and that brought us to very clearly locked in yes votes\nAnd we're going to circle back to ... in a moment but fifty one forty nine is how that key cloture vote had played out earlier friday or at the time we thought there was still a chance that people could change their mind but but ... was that really a clear moment where it was like okay this looks like it's probably going to happen\nIt did look that way there was a few moments where we were chasing around Senator Tim and I were standing and different ... different parts of the capital trying to find people like Senator Jeff Flake a Republican of Arizona and counting we mentioned the mansion\nIf we're finally formally viewing Supreme Court is justice partisan and tribal as everything else where does that leave us\nYeah that's a really good question and I think that the only way we're going to find an answer is just to wait\nThat was NPR's Kelsey Snell Ayesha Rascoe and Tim Mak thanks everybody\nThanks glad to be here say fine Thanks This is the politics shell from NPR I'm Scott Detrow it's time now for race of the we\nRun into the United States Senate fifty seven people of color or need your help we will never found out why and if we by the way\nEvery week we focus on one race in the country that speaks to a larger theme playing out and races all across the country and this week we're looking at the Florida Senate ran off my ... with us as well as the ... and diminished go\nWalk us through what race we're talking about so we're looking at the Florida Senate race here where Democrat Bill Nelson who's a three term democratic senator and a former representative he's been there a long time and he's trying to hang onto his seat he's running against Rick Scott who's term limited as governor and served two terms in Florida\n... what have you been seeing in terms of both poles and and what you saw reporting there this week\nIt's a race is really tight I think it's largely because of the opponent that Bill Nelson the singing in Rick Scott\nAnd I had multiple Democrats tell me you know look I don't like Rick Scott I'm not going to vote for him but this guy is running a masterful campaign in terms of just being visible and specifically being very attentive early on in the Latino community I met a woman can be as far as I actually had met her before\nDuring the twenty sixteen campaign she adamantly doesn't like Trump\nHe told me hell no she's not voting for the Republican candidate for governor\nBut you know she she sort of has had this\nLittle bit of an evolution on Rick Scott here's what she told me about him initially\nLet me be very honest with you at risk up in the beginning the his governor for electing\nSo she did not like him she says that she just didn't think that he was necessarily going to be good for the state based and everything that she had her she referred to herself as a Democrat but she's at a change in major part she said because\nGoing to be good for the state based and everything that she had her she refers to herself as a Democrat but she's had to change in major part she says because she's Puerto Rican and she's seen how many times he has gone down to visit Puerto Rico after the hurricane ...\nHis show me he's working from ... to his show me what he'd do\nAn awesome what can you step back and remind us how critical the Puerto Rican vote is in Florida\nYet it's still an active it's will tell me there are over a million Puerto Rican voters in Florida now and the population has really grown and in part it's actually grilling wild bill Nelson has been a member of Congress and to some folks within the Democratic party who have been a little bit critical of bill Nelson's visibility within this community\nHave said hey look maybe he doesn't fully understand the magnitude\nOf this community power within the electorate\nYou know when you're talking about the Puerto Rican community Rick Scott\nYou know she broke very quickly a right away with President Trump after Hurricane Maria and after President Trump said that the numbers that came out about how many people died in Puerto Rico we're wrong and he said that he stood with the people of Puerto Rico and like you noted has been there a number of times\nSo this was a close race Nelson and Scott held their first head to head debate this week ... you were there what did you see\nYeah and and the debate I should point out was being hosted by the local TV station he was broadcast in Spanish which you know to what we've been seeing sort of speaks to the significance of the Latino electorate there\nThere were a couple of major issues that came up\nHealth care came up time and time again and we've seen this you know in in states across the country Bill Nelson really hit Rick Scott specifically on the fact that while being governor he did not expand Medicaid and that that has actually affected a number of Floridians\nThe other issue that came up a lot was immigration and Bill Nelson basically accuses Rick Scott of being his hard line on immigration\nYou know on the other side Rick Scott is saying that the bill nothing really just wants to have open borders\n... one of the big themes of of race or the week is that these races aren't happening in a vacuum the similar trends but similar voters throughout the country that is really the case here in Florida as well because this was not the only statewide race and and we've seen that that other races are having an impact on the Senate race\nAbsolutely in fact I had one Republican operative tell me that one of the big reasons why you're seeing Nelson suddenly very narrowly lead in the polls or you lead in the last four polls for example very very narrowly in within the margin of error but that's a shift\nThe reason for that they said as the energy and the governor's race being on the side of Democrat Andrew Gillum he said that if this is an election about energy that's where the energy is and was killing at the top of the ticket they said that's something that could carry Nelson over the finish line\nRight and and since it's Florida I think we can be pretty confident her probably stay a narrow race between now and election day this is one of the most fifty fifty a fifty fifty states across the country or a Dominican tomorrow thanks so much You're welcome and alcohol thank you thank you that is the politics show from NPR we'll be right back\nBaritone saxophonist real Parker brought our and be sunk into the female studio ... joined me for jazz fan from the ... studio in Williamsport Saturday Night and I understand\n\nAnd the next fresh air weekend Temer Jenkins talks about writing and directing her new movie private life during Catherine hunt and Paul Giamatti as a couple in their forties trying to have a baby\nFresh air weekend hammer Jenkins talks about writing and directing her new movie private life during Catherine hunt and ... as a couple in their forties trying to have a baby by any means necessary and New Yorker staff writer ... talks about Mark Zuckerberg and the crisis at Facebook join us\nTomorrow evening of six on W. V. I. A. F. M.\n\nSupport for NPR comes from the station and from the ... foundation expanding opportunities in American cities through grant making and social investing more at ... dot org\n[noise] from the symbol Family Foundation supporting shutter proof a national nonprofit dedicated to ending the devastation of addiction and transforming treatment and America learn more it shatter proof dot org\nAnd from the ... and James they'll nights foundation helping NPR advance journalistic excellence in the digital age\nWell I say that it's a very scary time for young men in America when you can be a\nView of something that you may not be guilty of\nWelcome back to the politics show from NPR rooms gotten\nFrom what's happening here has much more to do that even the ... of the more just\nWe're here with a special broadcast and through the mid term election so far this year there's been a lot of talk about it being the year of the woman but in the wake of the Brett Kavanaugh's confirmation fight a lot of Republicans and suddenly talking about a backlash to all of that the blood\nDrenched jihad against this innocent man there's good and decent man\nWe're fighting now that the if you were a white male it's okay to be against white guys you're out your\nDoor that's all I didn't get paid for them in and said this polls show male voters are suddenly energized\n'cause I think it could easily as well turn out to me the era of the man who feel like a target as on their back all the time and it's not fair\nAnd it may have a lot to do with calls from President Trump saying the real victim of the me too movement is innocent men\nA person who was never meant that I did things that were horrible and they're firing me from my job mom I don't know what to do\nWhat do I do what do I do mom\nIs this backlash real and what does it mean for the four hundred thirty five house seats and thirty five Senate seats up for grabs in the next few weeks we've got White House correspondent Tamara Keith political correspondent Asma Khalid\nAnd political editor Domenico Montanaro here to sort this all out hey everybody hey hey there how's it going so Domenico we saw a shift in all of this over the last few weeks especially when it came to how President Trump talked about that you saw President Trump act very timid lead toward\nChristine Blasey Ford in part because the White House wasn't sure how this was going to play politically\nBut certainly she was a very credible with this well\nGuess what that change in fact our NPR NewsHour Marist Poll that came out this week found a twelve point up tick enthusiasm\nAmong Republicans those Republicans who are saying that the that this election it was very important when we pulled them back in July it was sixty eight percent now that's eighty percent and it's largely driven by Republican men yeah what stood out to me in in that poll was\nIn what's called the generic ballot so who are you more what party are you more likely to vote for in the mid term yeah there was a six point jump among men now they were more likely to vote for Republicans that for a Democrat just in the past week yes there\nIs this your way in the past week and that is absolutely has everything to do with the Kavanaugh hearings yeah there's a certain amount of backlash that has taken place you know they're so much focus so much of our focus and everyone's focus following the hearing was on how women reacted um it's\nBacklash that has taken place you know they're so much focus so much of our focus and everyone's focus following the hearing was on how women reacted um especially women on the left and there were women coming forward telling their stories that were women volunteering for campaigns and they there was a big surge in campaign donations\nBut there was something else happening two men were\nAngry to and we just heard all of those uh clips of President Trump over the last few days you just did a story on this this isn't a new thing from President Trump\nBig moment [laughter] of energy\nAmong Republicans and then it goes well\nOr whether this is you know the python is now a bunch of liquor python and anger as ... as a motivating factor is much stronger in the moment than it is among them that's political editor Domenico Montanaro White House correspondent Tamara Keith and political correspondent Asma Khalid thanks everybody You're welcome you're on [noise]\n\nThis is politics shell from NPR I'm Scott Detrow\nIt feels like every week there's always one major story that dominates the news so each week we take a few minutes to talk about some of the stories you might've missed him to do that we always have Ron Elving Iran to be with you got to some of the things we're going to talk about what had been big deals and other weeks but this week just no room for anything but Brett\nKavanaugh so let's start with this in the middle of all of this partisanship in toxicity in the capital they actually got a lot done that's right the Congress passed an\nAuthorization bill for the Federal Aviation administration for the first time since twenty twelve it's got a lot of money in it to run that agency and hold its functions but we'll concerned consumers most is the focus on passenger complaints for example cramped seats the width of the seats and the leg room\nFAA now has authority to set a minimum average is giving a bigger seats in Congress has not yet giving you a bigger seat and neither has the FAA but they now have the authority and the direction the policy direction from Congress\nDo do that also ah to ban cell phone talking in flight on all flights you might have thought it was but there are some airlines that allow it and ditto for each cigarette you might not have thought they were allowed but they hadn't been covered previously in terms of the ban on smoking\nAll right and another big thing that happened this week one one of the topics that have just dominated the Congress is bipartisan concern about the opioid epidemic and how to deal with it that that got done to this week\nPerhaps the main thrust of the bill Scott has renewed effort to stop the shipping of synthetic opioids things like ... there were twenty thousand deaths from a fencing all related overdoses\nAnd just a couple of years ago and to prevent the introduction offend no would really be a big big difference so the post office has new authority the government's going to really make this a priority\nThey're also going to lengthen the support period for Medicaid patients eligibility for treatment\nAnd abroad and eligibility for all substance abuse for those treatment programs and also there's going to be more money and more emphasis on research to find a non addictive painkiller\nOkay shifting gears this week the state department announced a new policy starting this month diplomats who wants to bring their same sex partners to the U.S will have to be married\nThat's right they'll have to be legally married to qualify for that second base so that's a change in policy that had been in place since two thousand nine because you see the same sex marriage is legal in less than ten percent of the countries that send them ... and diplomats to the United nations\nSo those people the people who work for the United nations are going to account for roughly half the couples that the state department estimates will be affected\nSo that they Portman says this is about treating everybody the same if you're a heterosexual couple right now you can't get a visa for the second person without being married so this is intended to level the playing field of course the differences\nYou can get a heterosexual marriage and just about any country in the world but in fewer than ... percent of the United nations countries is that possible\nSo is there a plan for for people who live in a country with that same sex marriage or can you just not bring your partner they're going to be exemptions for certain kinds of diplomatic personnel\nBut that would not appear to apply to most of the United nations personnel so that's where it's really going to be felt that NPR's Ron Elving catching up on some of the news we miss this week as he does every single week here on the politics shell from NPR Nike Ron thank you [noise]\n\nAnd as I said that his politics you from NPR we're going to take a quick break and be right back\nIn the shadow of contention confirmation process\nI've had that his politics you from NPR we're going to take a quick break and be right back\nIn the shadow of a contentious confirmation process the Supreme Court start its new term I look at some of the contested cases coming on and Brazilians head to the polls to pick their next president\nThe front runner a highly controversial right wing ideologue who has divided Latin America's biggest democracy Sunday on weekend edition Sunday Morning eight to ten on W. V. I Am much\n\nCloser this evening with a slight chance of showers lows in the mid sixties mostly cloudy on Sunday with a slight chance of showers are thunderstorms in the afternoon highs and the upper seventies most of the quality of Sunday night with a thirty percent chance of showers and thunderstorms lows in the lower sixties\nAnd partly sunny on Monday with the thirty percent chance of showers and thunderstorms highs and the upper seventies you're listening to W. vi eighty nine point nine FM\nSupport for NPR comes from the station and from the any each Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at H. E. C. S. dot org\n[noise] from New York has foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at our kids foundation dot org\nAnd from the listeners who support this NPR station\nWelcome back to the politics shelf men the are I'm Scott Detrow were on the air every weekend with a special broadcast through the mid term election\nAnd every week we dig deep into an issue that galvanizing voter babies being ripped out of their mother literally ripped out of their mothers are [noise]\nThis week immigration they're bringing drugs [noise]\nThey're bringing crime there rape is\nPresident Trump launched his campaign with a controversial hard line stance on immigration and voters latched onto\nNumber I made that speech and I was badly criticized oh what's so terrible what he's turned out I was a hundred percent right that's why I got elected [noise]\nBe carried that immigration talk into his presidency and turned it into policy President Trump moments ago side of executive order that\nWill affect the separation of parents from their children as a major backlash tonight against President Trump's travel ban the president's message of fear got Republicans out to vote but it's his policies as president then may turn Democrats out at the\nBeating heart of this election is border security we have to dig into all of\nThis my co host off Mulholland sat down with NPR's John Burnett and Mara Liasson John covers immigration is based in Texas ... one of our national political correspondent\nHello to you both either high [noise]\nPresident Trump began his administration with you know what somebody just kind of get pretty mean spirited policy of the travel ban it was one of the first things he did in office and even more recently the summer there with his and he should have a family separation this was a huge low point for the Trump Administration\nIn part because they had to roll back a policy that they said was not a policy and many people were incredibly upset even people within his own party he\nHas a summary of where the policy itself stands at this point\nThere's still several hundred kids that are in us custody and new shelters around the country and health and Human Services which is responsible for ... for finding a false\nSeveral hundred kids that are in us custody and new shelters around the country and health and Human Services which is responsible for ...\nFor finding a foster homes for them and sponsors has said it's taking us a long time we have to do all these criminal background checks we have to fingerprint everybody in the household not just the family member who wants to take the child back but the larger question of what you did this achieve its\nGoals the goal was to act as a deterrent I'm really to shock potential immigrants into not coming to the U.S and I had an interview with chief of staff John Kelly a last may and he said that explicitly to me\nA big name of the game is deterrence if if their family separation stands as a pretty tough ... could be a tough deterrent a would be a tough deterrent um\nA a much faster turnaround on asylum even though people say that's cruel and heartless to take a mother away from her children yeah I think a cruel and heartless or I wouldn't put it quite that way the children will be taken care of\nAnd so obviously the numbers that are referred to earlier about the jump in the family units and unaccompanied kids crossing the border over the summer the shows that it didn't have a deterrent effect\nStill my sense of how this may at all affect the mid term you know they make up of Congress because this issue again is one that I Would argue and an out talking to voters um has somewhat again faded from the conscious and\nIf the debate is about border security Republicans win in other words if you're talking about abolishing ice which sounds like dismantling our border security system than Republicans when if you're focusing on separating kids from their parents Democrats win\nBut family separation is over now and over now right and so the of the president's onto the executive order 'em and so I hear it down in Texas all the way from the attorney general's race to congressional races to the the big Senate race um they use family separation as shorthand", "show_name": "Opera", "year": "2018", "city": "Williamsport", "day": "06"}