{"month": "10", "state": "PA", "station": "WVYA", "content": "Translators Wu onto a G ... summit W to eight nine ... sundry W to zero seven eight Williamsport and only two Seventy ... wells borough listener supported public radio\nMusic by women could vote was was that the president or featured on WB I regret long my mother told me wrote the holy writ large in the world is the culture and more on the afternoon listen as Hollywood Moms usually by composers such as Clara Shuler and Joan\n... grand concert Sunday up to the um on the on a public meeting\n\nWelcome to the San Francisco operate international radio broadcasts I'm your host Diane ...\nToday's performance features done at Saturday's delightful comic opera don't ... the cats\nIn his performance from October twenty sixteen features married seal moral Heidi stover Lawrence Brownlee and Lucas me jump\nMaestro ... leads to San Francisco opera orchestra and chorus in this production by little wrong pay\nOf the sixty six operas pen by the incredibly prolific composer guy tunnel donut savvy in his fifty years of life don't plus quality is number sixty four this late career comedic Jim premiered at the ... Italian in Paris in Eighteen forty three\nStylistically similar to the licks her love doing it said he's much better known comedy of eleven years earlier don't ... is one of the last great examples of the nineteenth century tradition of Italian up or a booth for\nThis story centers on an age old plot device from the Italian theatrical style known as ...\nAn elderly man who unwisely pursues a much younger woman\nIn this version of the story the wealthy bachelor don't go out and I he's furious with his young nephew in air Ernesto who insists that he wishes to marry this rightly young widow new arena\nDemise or leave ... disapproves of her because she has no money that's called a result too did some hair at his rebellious nephew and get married himself so that he can fire a new air\nDr ... test a seeking to steer stubborn friend ... away from a disastrous decision\nThe talents of the clever no arena to help us while I realize his own falling\nUnder mallet testers guy to snow arena masquerading as an innocent young woman from the condom qualities tricked into thinking he has married her\nBut at the moment the fake marriage contract assigned nurse\nYoung woman from a condom squabbling is tricked into thinking he has married her\nBut the moment the fake marriage contract you sign an arena abruptly change him into an ill natured spit fire\nAll this happened to the next one and two of ... which will be performed without intermission\nIn the capital here ... Murata wrote as don't touch\nId stover as new arena Lawrence Brownlee as Ernesto and look at each him as Dr ... ... on the podium leading the San Francisco opera orchestra in X. one into um ... [noise]\n\n[noise]\n\nMm\nMm\n\n\nMm\n\n\n[noise] oh\n\n\n\n[noise]\n\n\n\n\n\nWhether\n\n[noise]\n\nGoing on\nOh my God yes you're right I mean they\nAre given the motor\nWe don't mind what about the you know when they\nReally don't know that you know\nOn the windy city beautiful there's nothing that you know I may not\n\nReally big believed to be a tough one button up seniority to monitor the\n... yeah [noise]\n\nYeah I'm going I'm going to be a reason you go into the you know what do you use it on\n... street mall\n\nIn it for some people there to see\nSo what do they eat\n\nWho knows what was that there is the\n... when they when they don't really\nKnow\nHa ha ha ha ha ha ha ha\nHa ha [noise]\nOn your\nOn\nYour program that you were breached not no room I don't know what\nWas the last I\nKnow most of the you know when they're gone and you'll be a pretty broke or nearly the\nYeah\nYou do boating\nWe\nTalking about the real\nScience that right now\nAnd you know\nThey wouldn't know what it is very much\nThe three of those will be basically critics I regret to bring my own I'm\nGoing over there must be something really caught up I'm going\nOh my God it's like\nOh I\nFive I'm going to be\nSeniority\nJust\nThing we don't know what I heard yesterday [noise]\n\nUh\nUh all of them all day oh\nDay on ... the\nName [noise]\n\nMan\nNudity so you know all the way that well\nYou know a lot of the\n\n\n\nWar on women you know we\nReally do I\nDo any more now\nWere you know I\nKnow a\nReal or\n\nYou go oh\nThe\nRobot rely on oh why\nOh\n\nOh oh\nOh\nOh uh [noise]\nRight\nWell\nDa da da da da da da da da da da da da da da da\n\n\n\nDa\nDa\nDa na\n\n\nDo well on very don't or\nOh no I\nMean\nHe walk na do what many outlaw\nThe mom [noise] me\nOh\nMan on the law\nWell we want to\n\nGo up and they will\n[noise] [noise]\n\n[noise]\n\n[noise]\nNot supposed to talk\nI'm going to be a lot of people who may well they\nSaid\nWell those are all\nAround [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n... ... ...\n... it all\n\n\nOh your your [noise]\n\nThey don't really know what they\nMay not remember if it makes it quite like that you\nKnow people will have\nDo what I didn't want to go to the\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\nThe only one that\nCorn well most\nThem both\n\nIt puts\nA lot more when they\nAre not\n\nAs\nGo on for a phone call [noise]\n\nWalk across the bus [noise]\n\n\n[noise] they don't even know\n\nShe wants to know what she called me and he asked for her to go visit you know\nThat may\nYou know whether you're ready to cut back [laughter] and my problem\n\n\n\n\n\nDid have oh I see better do\n\nYou what's your what's your ... to ... ... ... ... ... ... again so\nA dollar [laughter]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\nAre you going to be [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] yeah I'm On the line [noise]\nOr is he told me the most important\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] I get a job for\nThree years [noise]\n[noise]\nUm [noise]\n\n\nOh well I don't know [noise]\n... all the all sure\n[noise]\n[noise] [noise] [noise]\n\n\n\nRight\nYou know you'll be on the runway and\n[noise]\n\nYou know uh [noise]\n\n\nOh\nNo\n[noise]\nYou know your\nEars don't let\nYou know the whole you know he didn't know what it's like I won't be\nReleased once thought he [noise]\n\n\nHe chewed could bring them I don't know what\nTo do [noise]\n[noise]\n\nThe one change I think the only sport I Love him the money will go to\nDavid this is one\nOf the\n\nMissing a nice way\nTo you because they don't\nHave the\nForty ... view that the uh let's see what else did I not by New York [noise]\nWhy they only pay off [noise]\nSee you did you go Martin they both work but I don't know what to do\n\n\nYou know\nIf you were saying how do you go\nOh man I remember they were able to [noise]\nWell [noise]\n\nIt's really fun [laughter]\nWho they\nWere So Mara oh [noise]\nYeah\nI mean it's simply not going to be sports [noise]\nUh [noise]\nOf the roost in order to be the ... [noise]\nBe\nAble to bring up man [noise]\nGrade school pretty good how\nAre you all for the New York said on the economy and all\nThese ...\nOn the border very often so\nYou know oh [noise]\n\n\nWhat part of\nA couple of nights\n\nWas going on and on their own Richard\nUh\n[noise]\n\n\nGood for your own thing I'm Sorry\nGood for all of\n\n[noise]\n\n\n\n\n\n\nHow\nThis works they may have been\nGood there must be very\n[noise]\n\n\nWhat I\nThat's\n\nYeah oh\nWere they were they were they were like what\nWell I\n\nDon't\nHer to Gregory\n\n\n\n\n\n\n[noise]\n\nUsually rains and dump it finally formally shiny white turned into a temperamental tyrant as the curtain\nLowers for intermission here at the war memorial opera house I'm Diane nickel leaning and you've been listening to act one and two of doughnuts Eddie's opera don't ... in this international radio broadcast from San Francisco opera recorded in October twenty six team\nIn the cast we heard ... ... as an arena Lawrence Brownlee as er net stone and Lucas meet them as Dr ...\n... he led the San Francisco opera orchestra\nThe noted Larry Tanner Lawrence Brownlee made his along the way to San Francisco opera main stage debut as Ernesto in this production\nOur new arena Heidi ... had suntan major rules with the company since her debut in twenty ten as Susanna in the marriage of Figaro her varied repertoire has ranged from handle to Verde as well as leading roles in showboat and Sweeney Todd\nAnd Italian baritone ... make his company debut in twenty Thirteen in the role of another grouchy senior citizen Dr ... low in the barber of Seville\nDon't touch while he was first performed at San Francisco opera early in its history back in Nineteen twenty nine but it's been over Thirty years since the piece was last\nHeard here in Nineteen eighty four\nFor more information about San Francisco operas past and current season visit archive dot ... dot com as we prepare for the third and final act of ... let's take a short break for station identification\nThis program is syndicated by the W. F. empty radio network Chicago\nShe's WBAI eighty nine point nine O W vi age do you want Scranton Wilkes Barre he's will and will you be why eight point seven if in Williamsport ... any point trip that means for Mansfield W. P. A. U. Ninety One point five\nSultan WTY eighty five point seven FM Williamsport elite T I O any point trip and means for Mansfield and W. P. A. U. Ninety One point five FM Palmyra township ... W. B. I. dot orgy\nWith translators in east Roseburg in Ninety four point three up him loose bird one hundred point one of them in Bethlehem at one point submit them\nYour arts and information station look they're supporting public radio WBAI\nRain for the remainder of the afternoon with hides in the lower forties rain this evening with losing the upper thirties\nClaudio on Sunday with the thirty percent chance of mourning showers highs new lower fifties and cloudy on Sunday night with white showers likely lows new lower forties you're listening to WBRC eighty nine point nine ...\nProgramming on WPRI young is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor and associate degrees an exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work [noise]\nThree of ... know arena upped the ante in her play acting as pets qualities ... free spending wife\nIn the wrong thing he's clever production inspired by Italian film comedies from the Nineteen fifties and sixties she quite literally turns the hapless ... household upside down but the last straw comes when his protests result in her giving him a slap\nAnd ... is now thoroughly set up\nSuspecting that she will meet her secret lover in the garden that night he plans to catch the guilty pair and Dr ... tested pretends to play along with the scheme\nAll ends happily and this quality learns the true identity of his supposed bright relieved to be freed from his hoax marriage he gladly can sense to the union of Ernesto an arena and firmly resolve to remain a bachelor\n\n\n\n\nLot\nMore [laughter]\nThat's what\nWe were in the New York where are you know [noise]\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise]\n\nWhite you know like equal gives even me you're lucky you are not strong we are so I go out on your\n... your mother was\nThe only thing that gives you must be\nWhy don't you agree to be you know\nI think it what does it take to the opening\nYou're much what we're talking to you know it costs for all you need to be sick and we are\nGoing to be checked to see them but they also don't\nRespond to double did you pick your bones you don't tend to go to New York New York from I don't you\nAll for sports at all ... All right you know\nAn awful lot\nSince you don't need to respect what did I\nMonitor\nHot it'll be nice you know\nResolve\nAnd I don't know [laughter]\n[noise] like\nOn I saw it on\nThe\n\n\nYeah you ... ...\n... ...\n\n[noise]\n[noise]\n\nYeah [noise]\n\n\n\n\n\n\n\n[noise]\nHe more easy\n\n\n\nWho I Know you're not a robot came here they come for the\nWhat am I\nI'm not\nMarried I'm\nI'm just oh\nOh oh oh [noise]\nOn Long Island new\nYork he may be they Martin don't take me\nDown the\nMeeting son who ... who did you\nMeet somebody Norfolk where's\nThat oh did you see that was\nThe\nMain thing that I Do not knowing you know people who am I ... ... ... ... ...\n... ... where there are some very\nHere's somebody who\nI to record on\nBest seller [laughter]\nOr you want to know why they can't get off the\nTopic I don't know\nKnow\nThey're all the way I Am a hell\nOf a\n\nA lot of\nWhy he's asked me do you feel like\nNo no [noise] the one who\nWon the ... lodge\nRio de la\nI'm On my knees nearby you know I'm ...\nI'm a\nI'm\nMommy\nA on I'm On [noise]\n\n\n\n\n\nOh ...\n\n...\n\n\n... you\n\n[noise]\nThe\nLa la la la la la la la la la la\nLa la la la la la la la\nLa [noise]\n[noise]\nOh\nWhoa\nWhoa whoa\n\nWhoa whoa\n\nWhoa whoa\nWhoa whoa whoa whoa whoa whoa\n[noise]\n[noise] [noise]\n\n\nNo\nOh\n\n\n\n\n\n\n[noise]\n\n\nUm [noise]\nJust total recall for your job\n\nYou're\n\nGoing to law\nSchool right now what do you\nGo\n\nHome I don't want to know\nAbout men usually I'll be on a\nWeekly basis\nI think\nYou\nReally [noise]\nAny\nBody which is\nWhere your woman you\nKnow\nThat's\n\nAll right all the while there was you know they don't\nReally know what\nI'm low water\nNo no we don't know if you're the one who\n\n... no no we don't\nHold on one thing you know what the what I mean a pool they\nJust don't want to do for the\nNew deal post ...\n... you're very good in order you know but it would be most all the memories\nAre in a boat\nOr they're going to last\nProbably\nWhat do we\nWe don't even know that oh you're the\nYou\n\nWe'll be right because\nWe are really two\nYear old movies go\nThere for\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\nMm\n\n\n\n\n\nMm\nMm\n\n\n\n\n\n\nUm\n[noise]\n\n\nMm Mm\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\nMm\n\n\n\n\n\nMm\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nStreaming live at W. V. I. A. dot org we have a translator in clock so much at Ninety point three of them your art\nAnd have him in Mansfield a W T I O eighty eight point three of them were like well I'm ... Ninety One point five of them streaming live at W. V. I. A. dot org we have a translator in clock so much at Ninety point three of them you're arts and information station listener supported public radio W. V. I. S.\n\nRain this evening with Lowes in the upper third clarity on Sunday with a thirty percent chance of mourning showers highs in the lower fifties cloudy on Sunday night with Late Show is likely lows in the lower forties\nPosted cloudy on Monday with the thirty percent chance of showers highs and the lower fifties and partly cloudy and Monday Night with Lowes in the mid thirties you were listening to WBAI eighty nine point nine ... [noise]\nThis is off the shelf mentally are we are a little more than one week away from the mid term election\nWhere\nWe gotta stop it out and voted\nIn November do whatever you have to do just when they they're four hundred and thirty five house and thirty five Senate seats on the line every weekend leading up to election day we are here with a special broadcast to guide you through all the news that could affect the vote this November\nI'm Scott Detrow it's been another week of dramatic headlines about a new poll from NPR and its partners shows the midterms have reverted back to the same dynamic that have been driving the race all year\nDemocrats are talking a lot about health care and Republicans are pushing back\nWe'll take a close look at what exactly Congress and the Trump Administration did to change the Affordable care\nAll that and more after the news\nLie from NPR News in Washington I'm Luis give me a gunman opened fire during a baby naming ceremony at a Pittsburgh synagogue this morning there are dead and wounded suspect in custody Meg inherits of member station ... W E s Jay has more\nResidents of the traditionally Jewish neighborhood at squirrel hill on the east end up Pittsburgh had been told they can finally leave their doors steps Halloween incident prompting tears screams and a lot more questions than answers there's still a wide perimeter set up around the synagogue where at least three congregations meat and share space for a variety both ends and services\nPittsburgh public safety director Wendell hits ranks at the FBI will take the lead on the investigation and we'll be treating it as a hate crime\nIt's a very horrific crimes and that's one of the worst that I've seen and I've been on some plane crashes which is very bad\nNotes of condolences and concern have been pouring into the city for NPR News I'm Megan Harris in Pittsburgh\nAt a campaign stop this afternoon President Trump condemned the attack\nOur nation and the world or shock and stunned by the grief [noise] this was an anti Semitic acts you wouldn't think this would be possible in this day and age ...\nTrump speaking in Indiana as law enforcement officers press ahead with their investigation and to the explosives that were sent to democratic officials were learning more about that such that NPR's Greg Myre reports\nRun Louis says he represented Cesar ... four or five times what he described as routine low level cases like shoplifting and altering his driver's license\nLow he still represents other members of the ... family and said they were deeply distraught over the allegations he was behind the threatening packages the lawyer says the family often urge they opt to seek mental health treatment but that he always resisted\nRefused to even get diagnosed but his family and anyone who interact with them can she he suffers from something\nHe refused to even get diagnosed but his family and anyone who interact with them can see he suffers from something\nSad is expected in court Monday in Miami Greg my ring NPR News Fort Lauderdale Florida\nFederal authorities have been released in hundreds of asylum seekers and family to cross the border illegally an Arizona from member station KCUR Jay Z and Phoenix Matthew Casey has the latest\nCiting volume in a court settlement the limits how long children can be detained federal immigration authorities started releasing families to churches and activists in Arizona\nNow the releases are also happening in Texas and California pastor bell Jenkins founded a San Diego based coalition that can provide about one hundred shelter beds he says the group may need five times that number\nIf we could turn over the you know every two nights we probably could handle it we're we're going to happen if people are going to get stuck in the system so to speak\nJenkins says families stay at the shelter longer when sponsors back out his coalition is trying to find more beds for NPR News I'm Matthew Casey and Phoenix\nDitches NPR the American civil liberties union is suing a county clerk in western Kansas for having only one polling place in a town of twenty seven thousand people\nDon't mean oh gee a dean of member station Katie Warren the Kansas news service reports the lawsuit alleges an undue burden on the town's majority Latino population\nThe ACLU is seeking a temporary restraining order that would be open to the these original polling place by November ... county clerk Deborah Cox close that location and opened another outside town last month dodge city resident Alejandro wrangled Lopez is a point is\nA lot of people are still not informed and don't know about this issue and don't know the polar location has changed\nWrangle Lopez says they can't afford it time off to wait in long lines at that overwhelmed that the only polling place for NPR News I'm domino Jia dean in Topeka\nA month long meeting of Catholic bishops at the Vatican has concluded Pope Francis acknowledged the clergy abuse scandal and closing remarks saying that it was true that there were sinners and the church but he claimed that the Roman Catholic Church at itself\nBecome a victim of persecution through what he called quote continuous accusations too dirty that church newly revealed charges of abuse and cover up has created turmoil at the Vatican\nFriday the U.S conference of Catholic bishops distributed a letter from a federal prosecutor in Pennsylvania asking churches across the nation to preserve all files related to sexual abuse complaints\nI'm Lewinsky is on the NPR needs Washington\n\nSupport for NPR comes from NPR stations other contributors includes the air in Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent thought whether that's on line over the air or in a bottle more it's the Nevada dot com\n\nRain this evening with Lowes in the upper thirties clarity on Sunday with the thirty percent chance of mourning showers highs in the lower fifties cloudy on Sunday night with the Late Show is likely ... and the lower forties\nHosted cloudy on Monday with the thirty percent chance of showers highs and the lower fifties and partly cloudy on Monday Night with Lowes in the mid thirties you are listening to WBAI eighty nine point nine Afghans\n[noise]\nThrough the politics show from NPR News I'm Scott Detrow we ended up being about one big thick bombs mailed the Democrats who have criticized President Trump criticized\nWe ended up being about one big thing the bombs mailed the Democrats who have criticized President Trump has been criticized back by president\nHillary Clinton for a bomb was watch was not a lot of the way George Soros the ledge Maxine\nWaters and we want to\nProvide found in a mailbox help like officials including former president Veronica Obama and Clinton where a man\nHas been taken into custody in the mail bombing case just a few days ago the midterm seemed to focus on immigration and that caravan of immigrants making its way to the U.S Mexico border\nGerman you have some very big and before that was the contentious confirmation battle for justice Brett Kavanaugh but through all those twists and turns a lot of important factors have remained constant high democratic enthusiasm to vote mobile approval rating for the president and a lot of political history\nIndicating Democrats should be poised for big wins in the house just a week and a half to go before\nElection day we're going to step back and take a closer look at the race for control of the house of representatives\nYou that we have NPR's Dominican much narrow Tim Mak an Danielle Kurtzleben in the studio everybody hey so let's start with the fact that historically and given some of the big picture trends Democrats really do have the wind at their backs let's walk through why exactly that is\nWhen presidents during their first midterms they lose a heck of a lot of seats on average is just as a matter of and we've heard President Trump actually posit publicly why that is\nNot I get your license [noise]\nIn some of it has to do with frankly with the fact that people got their guy over the line they got their president and then they sort of a back off and the ... is perhaps the content and settled in and the people who are most motivated or the people who are most upset with the policies of the new president is putting in place\nFun facts on that so Gallup crunched the numbers a little bit earlier this year and they found that\nWhen the president's approval rating going into the midterms is below fifty percent and Trump's according to our latest holds thirty nine percent the president's party averages a loss of thirty seven seats in the house which by the way Democrats need fewer than that in order to take the house so when the president has approval over fifty percent\nHis party tend to lose only fourteen ... still alive but not nearly as huge one\nDemocrats have been incredibly enthusiastic all year ever since President Trump took office but in recent weeks we've seen Republicans finally getting engaged getting enthusiastic as\nAnd Johnny A voter suppression of who can and can't vote has become a huge issue in this race especially as early voting has begun why is that\nKevin Abrams has sparred over voting for years and it's getting more and more attention as the selection comes closer more specifically one issue that's drawn a lot of controversy is these voter registration applications that have been held up because of the information on them doesn't exactly match other government databases\nAnd the registrations that have been held up in that list there's a disproportionate number of people of color\nAnd this has drawn a federal lawsuit Kemp says it's all blown out of proportion that it's just a move to excite the Democratic base and he actually points the finger at Stacey Abrams ended a group that she founded called the New Georgia project which has done a lot of voter registration he says that\nHer group is responsible for these messed up applications there are on the list definitely some fakes or some errors like people named Jesus Christ that live on ... street as complex to point out but the issue has really persisted for a long time it continues to be a source of debate in the race\nLet's talk about the issues for a little bit what are the voters that you're talking to focusing on\nHealth care and education are really big in the race and and jobs although Georgia's economy has been doing pretty well and the current Republican governor Nathan Deal is pretty popular race has been an issue in this race or maybe not totally at the forefront but very close ah there was a report pretty recently\nThat looked back in the archives and found that Abrams participated in a a flag burning the Georgia flag back in the nineties that at the time that the Georgia fly had the Confederate flag on it as well\nTwenty six years ago as a college freshman I along with many other Georgians including the governor of Georgia for deeply disturbed by the racial divisions ... that was embedded in the state flag without Confederate symbol\nAnd eventually that Confederate symbol was removed and she pointed out that the governor at the time was actually pushing for the Confederate symbols to be removed as well\nThis is one of the top tier national\nRaces this year a lot of people paying attention to it a lot of a likely democratic candidate for president in two years have made a point of going to Georgia to campaign for Stacey Abrams what isn't\nSo you are a lot of people paying attention to it a lot of a likely democratic candidate for president in two years have made a point of going to Georgia to campaign for Stacey Abrams what is it about this governor's race it's getting so much attention given all the other races going on all across the country\nWell Georgia is one of those states that has been traditionally Republican but there have been signed that it could be moving away from that certainly the demographics suggests that it could be a more of a center right state\nJohnny you've been covering this race since the beginning less than two weeks left what are you thinking about are looking for the final days of this race\nMy big question right now is how well is Abrams reaching and communicating to voters who may not be using gauge and don't usually vote in the mid term elections\nAbrams has gotten a lot of attention in the national media the fact that she would be the first African American female governor is a big deal but campaigns done a really good job of labeling her in a simple way but she just too extreme for George eight\nStates have room for just a big spending tax rating liberals she's an extreme even campaigned with them and\nIt's clear and concise people can understand what he's getting out there Abrams I'm not sure has done the same with camp and so my big question is you know Abrams talked a lot about her policy proposal she's very smart\nBut how well does that reach people in Georgia and maybe a more rural parts of the state that don't have access to as much education or resources are they going to be motivated in the same way that maybe they were for President Obama back in two thousand eight\nAnd people compare this election to like the Obama wave that that uh Abrams needs to inspire voters and the same way that Obama did in two thousand that Obama did not win Georgia in two thousand that he lost by about two hundred thousand votes so that's a huge hill that Abrams has to climate she's going to win\nThis race or we will have answers to all those questions in less than two weeks That's NPR's Domenico Montanaro as well as Johnny Kauffman of W. A. B. E. Johnny thanks so much for talking to us yeah thanks for having me this is the politics show from NPR we'll be right back\nNow back out such [noise]\nWith his release of met the nice in Nineteen fifty five Louis Armstrong reinvigorated his popularity [noise] I'm Sasha Feinstein joined the protest standards from the W. CIA studio in Williamsport Saturday Night at nine and ... [noise]\n\n\nAnd the next fresh air weekend the cap with Melissa McCarthy she stars in the film can you ever forgive me and their biographer\nTurned literary for germs and on their front paws they know the playboy preacher and there will be blood and the moody teenager and Little Miss sunshine directed and co wrote the new film adaptation of Richard forwards novel wildlife killing tomorrow evening in six on W. V. I. A. F. and\n\n\nSupport for NPR comes from the station and from twenty three and me a personal genetic service working to help people understand their DNA learn more at twenty three and me dot com slash NPR radio\nFrom the Charles Stuart Mott foundation for more than Ninety years supporting efforts to promote it just equitable and sustainable society more at ... dot org\nAnd from the John us and James Alan nice foundation helping NPR advance a journalistic excellence in the digital age\n[noise] walking back to the politics\nDon us and James Bell night foundation helping NPR advance a journalistic excellence in the digital age [noise]\nWalking back to the politics show from NPR I'm Scott Detrow rare with a special broadcast every weekend through the mid term elections to guide you through everything you need to know what the election this close people are focusing on the whole to try to get a sense of what might happen on election day\nJust about a week from everything ... showing dealing with the one point lead well within the margin of error real clear politics however has\nIt at a dead heat and the president's poll numbers are going out running neck and neck as is the race to watch on election night the new NPR PBS NewsHour Marist Poll confirms enthusiasm is high for both Republicans and Democrats and if you weren't sure already confirmed this this election is all about president Donald Trump\nAnd you know I like to look at it falls only when we're winning I Do like um otherwise\nVery me now to talk through this with NPR's Dominican to narrow and Danielle Kurtzleben hey All right\nSo about a month ago we had to pull out and it got a lot of national attention because it showed a lot of good news for Republicans this new polls this time around looks like Democrats are going to be happier people reading it\nWell it looks like essentially that the Kevin confirmation fight and all that it did to fire up Republican has kind of faded to be perfectly honest\nOr it looks like we've returned to the fundamentals and that's something I've been hearing from Republicans quite a bit when you look at the landscape for the house races for example the vast majority of those races are being run in places that Republicans hold seats and that has not changed\nLet's get to the pool and the numbers are their medical what are the biggest takeaways for you looking at this point\nThe big thing is that President Trump is seen as the biggest factor in A People's vote and really the numbers are kind of remarkable even when you put them in historical context two thirds of people say that Trump is either a major or minor factor in deciding their vote in less than two weeks on November six\nCompare that to twenty fourteen when Republicans took back the Senate\nJust forty seven percent of Americans said that Iraq Obama was a factor in their vote\nThat the twenty point jump that's a big deal and more people this time around say that they're motivated to go vote for Democrats because of their impressions of President Trump than in twenty fourteen when people said that their impressions of President Obama made them want to go vote for a Republican\nSo I mean President Trump is campaigning saying of voters if I'm On the ballot you know this was about me get trying to get its supporters to the polls but this result shows that this was a negative\nIt depends on who you're talking too though right I mean people in either party Democrats and Republicans once again already in their corners Trump may be affecting their vote off and he is\nAnd you know for Democrats makes them less likely to vote for Republican more likely to vote for a Democrat for Republicans vice versa interestingly in the poll the independence or where you see the interesting gender gaps on this for example when you act independent voters\nHow important is Trump to your vote your fifty percent of independent women saying he is very important compared to twenty eight percent of independent men that's a bigger divided and you see among Republicans or Democrats likewise when they say okay so how's Trump going to affect your vote\nFifty percent of independent women say more likely to make the vote for Democrats thirty three percent of independent men say that\nSo when we talk about gender divide and this is important this year\nYes women are a driving factor we do have the potential to hear across the board for there to be a bigger gender gap in this year's midterm are as big of a gender gap as we've seen in a very long time but that said it's not just about gender it's also about party democratic ... democratic women alike disliked Trump and are going to vote Democrat\nYeah I mean when Daniel talks that independence they really are an import\nMen and democratic women alike disliked Trump and are going to vote Democrat\nYeah I mean when Daniel talks about independence they really are an important factor here and that's because President Trump has really done very little to reach beyond the base with a lot of what he's talked about and the gamble here among Republicans and a lot of Republicans I talked to that they said look independents young voters Latinos\nYou know they don't turn out to vote as much in midterm year so you know if the goal is to drive up the base and this is going to be a base election which is a gamble than they need to fire up the Republican base with a lot of these cultural issues\nAs fast in last month's of Seventeen and the first few months of twenty Eighteen so if anything that the government has been doing can further that trend of both parties seem to think that's worth doing and that's at least one hopeful story this week we're talking about how this\nIs the the rare period where where both parties are on the same\nPage but that doesn't mean there hasn't been any criticism\nRight that's right and there was a lot of disagreement in the process of putting this together people saying look what we need here is to back up and take a much more holistic approach to the entire question but just\nStitching together all these different programs I kind of pastiche of good intentions are that's ultimately not going to be good enough and that that may well be true some people say there needs to be a great deal more money put into all of these programs that it's really just a drop in the bucket against the size of the problem as we've seen but here again the consensus in the\nMore money put into all of these programs that it's really just a drop in the bucket against the size of the problem as we've seen but here again the consensus in the end was let's pass what we can let's put as many dollars in as we can if we can only agree on that stitched together patchwork programs for let's say at least do that\nThat's NPR's Ron Elving every week he catches us up on some of the stories that we might have Mitt thank you Ron thank you Scott\n[noise]\nThat is the politics shell from NPR we're going to take a quick break and be right back among the fallout from\nPackage bombs Santa prominent Democrats or national dish or how is the rhetoric and politics and media shaping the way we talk to one another and it's been Twenty years the Harry Potter for the which readers looking literary legacy on the ...\nFrom Washington and around the world and Sunday on we can be on\nSunday Morning eight to ten on W. V. I Am [noise]\n\nRain this evening with Lowes in the upper thirties clarity on Sunday with the thirty percent chance of mourning showers highs in the lower fifties cloudy on Sunday night with light showers likely lows in the lower forties\nPosted cloudy on Monday with the thirty percent chance of showers hides in the lower fifties and partly cloudy on Monday Night with Lowes in the mid thirties you are listening to WBAI eight eighty nine point nine ...\nSupport for NPR comes from the station and from the Annenberg Foundation committed to supporting educating and engaging communities in the United states and globally for more than twenty five years learned more at Annenberg Foundation dot org\n[noise] from the Kauffman Foundation working together with communities and education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful or online at ... dot org\nAnd from listeners like you who donate to this NPR station [noise]\nThan a few hundred Fifteen they'll have [noise]\nFrom NPR's Scott Detrow\nHere with a special broadcast every weekend through the mid term election\nAfter all the votes have been Sally meets weekly focused on one issue on voters' minds health insurance reform becomes law in the United states\nIs [noise] this week health care for my first day I'm going to ask Congress to send me a bill to immediately repeal and replace disasters Obamacare [noise]\nWith the Democrats ... Republicans found one of their best talking point they used it again and again\nWe're going to unify because we all every Republican ran on repealing and replacing it we're going to keep our promises\nThat does seem within reach when Republicans gained control of the White House in addition to the house and Senate but\nThe Republican effort to repeal the Affordable CARE Act has failed harsher repeal of Obamacare failed by a single voter away today\nAfter seven years of promises to repeal and replace Obamacare it came down to just from one vote the final vote forty nine to fifty one\nIs the Democrats who feel like health care is an advantage for them Democrats have talked about healthcare all election and the polls indicate that voters want to hear about it\nThat has Republicans on defense and we're going to talk about all of that with NPR's Scott Horsley and Danielle Kurtzleben guys hey Hi so let's take a few minutes here to talk about health care because all year we've been talking about how Democrats the healthcare as their best issue with voters which is ...\nSo let's take a few minutes here to talk about health care because all year we've been talking about how Democrats the healthcare as their best issue with voters which is so striking because from twenty ten on after Obamacare passed\nDemocrats were really on defence when it came to health care and they lost a lot of seats because of it so let's start with this how are people feeling about the state of health care right now\nI Would say concerned bare minimum but if you're a Democrat you're much more worry I mean one thing we do know I can tell you from both being on the trail and from polling data is that\nBoth Republicans and Democrats are worried about the health care system worried about access worried about costs but Democrats are much more worried and this is reflected in what voters tell you and it's reflected in ads Democrats have just been running more health care ads throughout the entire midterm cycle than Republicans have\nDetermined to fight for affordable festival healthcare and not take it away\nLike three hundred thousand North Dakota nice to have the preexisting condition that used to mean no health insurance now the retina is match with Morsi's losses to take away health here from people with preexisting condition\nAnd what Democrats are targeting is the assault that Republicans have waged a over the last two years on the Affordable CARE Act Republicans of course campaign saying they wanted to repeal and replace the Affordable CARE Act they weren't able to do that thanks to John McCain's thumbs down in the Senate\nBut the Trump Administration has been steadily wheeling away at the Affordable CARE Act for the last going on two years\nAnd it's worth pausing for a moment and walking through all the different ways the Trump Administration and Republicans in Congress have had tried to undermine the Affordable CARE Act or have tried to replace the Affordable CARE Act because a lot of the ads\nCome down to you voted to do this and Republicans are responding no I didn't so let's start with actions taken by the Trump Administration\nScott what are some of the biggest things that President Trump has done on his own to affect the Affordable CARE Act\nThey have offered up a variety of alternative insurance plans mostly sort of skimpy or plans that would be cheaper and might appeal to younger healthier people a book could also have the effect of raising prices for older sicker people\nThey have done away with the marketing budget to try to encourage enrollment in the Affordable care act's a health care marketplaces\nThey have ended subsidies for insurance companies which has had the effect of driving up premiums on the a C a marketplaces and then Congress as part of their tax overhaul did away with the tax penalty for people who don't have insurance so all this sort of\nBeen an attack on the a C a insurance marketplace\nWhich despite all that has proven to be pretty resilient a sign up so stay pretty level since before the Trump Administration came in\nAnd the most recent census data says we still have a about Ninety One percent of the American public covered by health insurance\nDanielle of course most of twenty Seventeen was focused on Republican attempts to repeal and replace Obamacare they ultimately failed but what should we know about what was in those bills how the house bill that passed and how the Senate building didn't pass because of John McCain would have changed Obamacare\nOne of the biggest things that's most salient in this election cycle is what that built those bills would have done to pre existing conditions this is what Democrats are attacking Republicans on and so many of these ads saying that\nRepresentative so unsettled voted for the Obamacare repeal and replace spell that they'll what has done away with your protection for pre existing conditions and Scott Republicans\nRunning for reelection are defending themselves from these attacks and an interesting way basically saying how dare you insinuate I don't care about people with preexisting conditions\nAnd that's right but it's interesting that Republicans are on the defensive here this is really the mirror\nThere you insinuate I don't care about people with preexisting conditions\nThat's right but it's interesting that Republicans are on the defensive here this is really the mirror image of what we've seen in the past few election cycles when Republicans were on the attack going after the Affordable CARE Act promising to repeal Obamacare and Democrats were largely\nStaying quiet they knew that the Ford will correct wasn't terribly popular at that point\nNow we have voters saying well they might not love Obamacare writ large they do like various provisions of it and you've got Democrats running about half their ads defending those provisions including the GOP on the defensive\nWhen you look at television ads when you compare pro Democrat to pro Republican that were put out this year oh democratic ad yes like Scott said more than half of them have been about health care this is according to the Wesleyan Media project which tracks the saying here's how in building Democrats feel this year that's compared to\nFrom twenty ten twenty twelve twenty fourteen twenty sixteen in those years roughly seven to ten percent of democratic ads are about healthcare Democrats did not want to touch healthcare during that time now this year they are all about it\nIs the same time we have a group of Republican attorneys general who have gone to court in Texas to try to strike down the Affordable CARE Act two of those state attorneys general happened to be running for Senate one in Missouri and one in West Virginia\nJosh Hawley the Republican Senate candidate in Missouri has been running ads saying oh I definitely would protect\nPeople with preexisting medical conditions even though he's gone to court to unwind exactly that protection in the Affordable CARE Act\nEarlier this year ... we learned our oldest has a rare chronic disease preexisting conditions we know what that's like and I'm just calling I support forcing insurance companies to cover all preexisting conditions\nWell that is a statement that you could argue is very much at odds with a lawsuit that he is a part of to unwind the Affordable CARE Act if you're just joining us You're listening to the politics show from NPR I'm Scott Detrow here in the studio with NPR's Scott Horsley and Danielle Kurtzleben talking about health care", "year": "2018", "show_name": "Opera", "city": "Williamsport", "day": "27"}