{"month": "10", "state": "AL", "station": "WSGN", "content": "Let's see if we are connected to the same word that's what I think we're heading towards they're not all connected to the same word but but they're they're all missing a word\nNot a word not a word George let's do word lessons are words well her let her\nDo we keep the lettuce and the same order are we supposed to just insert a letter wherever neither\nNeither a frame\nYeah\nEmail and email oh eight I ... I really enjoy your time Dan ... of the [noise]\nThey\nDon't always for that they can all take a viable as a prefix and Barry tone a C. O. N. G. U. E. finger\nI don't know rock through a very bad deli everyone has [laughter]\nHis finger sandwiches [laughter] [laughter] ...\n... ...\nWhich [noise] that's it I had a sandwich finger than when I get one of his voice [laughter] not gonna sandwich hands and tomatoes and ... with a scar thirty to twenty nine Arnie steam just\nBarely in the lead we go on to round to the contribution of WC a listener ed foster of ... Massachusetts it's the first of the says you bluffing rounds played with a little musical help from our friends Zoe and John Zemin Arnie each person on your team will receive a card\nOne of those cards gives the actual definition of a real but unfamiliar word the poor souls who received the other two cards will have bought a few seconds to make up a definition on the spot good enough to fool berries team ten points are up for grabs to bury if he can spot the truth teller or do you Arnie if he kept\nA few moments musical enhanced to come up with a definition for the word to\nMosques bunker M. O. S. S. B. U. N. K. E. R. mosques bunker so we in John\n... [noise]\nA new season begins for all of us here at says you and this November as the mice that are migrating and the bears are hibernating Santa love we're both in village yes to live shows tickets for Montana will be released this week you get yours before the snow begins to fall\nCheck online for tickets an old the grisly details as always says you dot net that's essay while yes Y. O. U. dot net\n\n[noise]\nDo you blame it on base John's even on guitar Samara Oregon keyboards and rubbing salt on percussion and drums thank you so much guys for giving us a few moments with the word\nMust bunker MOSSAD B. U. N. K. E. R. let's go first to Carolyn most bunker it is maintenance\nMan slang for a stalled elevator filled with cubicle workers end an awkward silence\n[laughter] it's Archie brother\nGot to go fix the mosque bunker gets pretty right than there\nAre right it's a stall elevator\nIt's a it's a a fish in North America that I really couldn't sell because it really stinks to high heaven so it's been used for many years to make fertilizer and sometimes more oil's\n[noise] sometimes what\nOils what effect it had more oil was not an oil you know make a boy when I was in my [laughter] well\nI think the fish I sticky fish\nOr all of what are you at [noise] well that's the word leftover from the early days of ... you know cave exploration meaning a shoe caked with algae from exploring in the dark and damp ... algae cake\n[laughter] [laughter]\nWell there you have a very it's either a shoe caked with algae a stinky fish or a stalled\nElevator which one is it\nThey all smell to me [noise] a frenzy when you've been off in a [laughter] installed elevators do you have any idea\nTony and I are inclined to this stinking\nFish we are indeed you're inclined to think that a mosque bunker is a fish that smells and could be used for for\nIts it's also more that is the only one which seems to have\nKind of relationship to the real world if you know what I mean it's all the others are ... so specifically attuned to a problem that I don't think\nYou'd find them in the dictionary I mean imagine what's going on that's bags yelling that when we're not by her and the algae coverage you again I just think certain ... certain objects never get words because they're just not as significant enough you know they don't get\nTo make it as a book just dumping book she didn't address your [laughter] I'm up All right yeah\nWe will go with arteries definition that mosque bunker is a fish that smells bad but makes good fertilizer\nArnie ... they think that most bunkers a stinky fish would have thought that I just reporting what is your guard say it's as\nA North American fish [laughter] not very tasty kind of shed like mostly use for oil and fertilizer\nThere's an interesting footnote on my car [noise]\nTaught the pilgrims to plant with their crops not too far from here [noise]\nThat are score now is thirty nine to thirty with berries team surging into the lead and please help me thank our hardworking scorekeeper today that's Terry is oh bell William [noise]\nLet's continue our around by round reconstruction of the very first episode of says you with a reprise of its third round which was a round up says who\n... ten points simply named the author of each of the following lesser known lines and you're not you should be able to work out the authorship from the style and substance\nCarolyn who wrote this your wig fits very well the ... D looking at her with an expression of admiration it's the shape of your head as does it\nWell All right that sounds a British it's the shape of your head as does it in a sense of ... yes is this Alice in wonderland who wrote it is the quest otherwise ... Carol [noise] where were you know [noise]\nThat is from through the looking glass and actually it's from a chapter was deleted nobody wanted to read about a wasp in a week so how'd you get it [laughter]\n\nTony who said this your vote your dome vote your ignorance vote your wasted vote put in an administration in Washington DC that has seen fit to pass every kind of legislation imaginable saving you until last then filibustering on top of that\nCould be Sinclair Lewis [noise]\nUh no it's not Sinclair Lewis good yes it was set in Nineteen sixty four thousand\nA year oh oh well then it would be a a Goldwater\nPerhaps would you like a hint of yes in that same speech he also said\nI don't usually deal with those big words because I don't usually deal with big people I deal with small people I find you can get a whole lot of small people and whip hell out of a whole lot of big people\nYes what's his name who got shot yes oh oh yeah it's actually ... the governor George Wallace Wallace George walls anybody on the other side\n[laughter]\nWould like to whip the hell out of big people in Nineteen sixty four you know it was\nAlright yep whether it is the ... sign language of law without ethics or language designed for the estrangement of minorities hiding it's racist plunder and its literary cheek it must be rejected altered and exposed\nYou have a year on that one yes ma'am Nineteen Ninety three it was an acceptance speech and acceptance speech she has been for a prize surprised Tony Morrison blue", "year": "2018", "show_name": "Says You", "city": "Gadsden", "day": "05"}