{"month": "10", "state": "AL", "station": "WSGN", "content": "Check online for tickets and all the grisly details has always had says you dot net\nEssay why or why do you not from the [noise]\nMusic of Syria Smith begin to fly by night trio violinist series Smith big and discover guns with Tara chambers shell thank you so much [noise]\nThey have given us a little time\nNationally first go to Carol\nExcess and academia is full of some odd archaic sounding terms and access mess is this age during which usually confidence graduate student is barely adequate\nAccess miss is the Mendoza Line of higher education the grad students fat and two\nThirty nine it's you know places man or Ninety seven ... could be done\nSo it's the kind of slipping competency of a graduate student that emperor everything's temporary phase okay if you don't have enough says that might be it or it might be Murray's definitely\nWell I I Wish I could tell you more about this for the comes Karen's right it does come from academia I guess comes from the field\nOf philosophy and so I guess it's from a ... or perhaps symbolic logic but if you have a proposition that ... that's not proven but that relies on other propositions which have yet to be proved\nThen you've got an accent ... so it's a it's a proposition that relies on other yet unproven proposition to delete\nKey provinces right it was your name is Lee ... [laughter]\nA proposition that is based upon other propositions yet to be proven it's like man evolved from Sam\n[laughter]\nMy study of philosophy was limited to James Brown lyrics so I really don't you know I'm not qualified to talk about\nAll right that might be the definition or maybe what we have\nWell the Kurds gave this weird thing here this example which I think I get it kept there were no in costs a blank since we're very film literate audience it's the quote I'm shocked shocked to find that gambling is going on in here\nAnd that is ... ... us some sour grapes the fame refusal of something kiwi desired\nSo it could be sour grapes it could be a proposition that is based upon other propositions to be proven for the temporary state of a graduate students bury your team gets to play with the\nTeam well I something breweries left eyebrows [laughter] which is always tell what he's lying [laughter]\nKnow [laughter]\nBut I'm Glad that you would monitor my healing you know the lady death protests like how many times do you tell us what he has six that tells us ally there wasn't twenty I didn't understand Caroline I I didn't understand her and it's all\nBasically she was trying to say that it's a temporary bad pitch to graduate students have which would basically cover the entirety of my graduate [laughter] yeah\nI actually think ... is it something like the uh where Caesar or declines the offer the current three times\nOkay and so uh I don't think it's the best example\nWhere we know a says that wind and gets his winning but I think it is I I Would believe if he'd use Caesar\nInstead of right now I I was leaving it in a heartbeat yeah so I'll leave so you're you're going for the the triple the triple statement of\nThe three main refusal of something keenly\nDoes but as it does it have to come in threes when no no no no All right you know what I'm going to go for that to okay yep\nWill go because it it's sort of sounds snooty will go with [laughter] All right ... they have chosen to go with your definition because it sounds snooty what does your card say\nSnooty great no sour grapes insane refusal something keenly desired [noise]\nI agree with Barry the memory you got to work on that eyebrow worry about that I've written for coming up\nWith the highest come to bury Caesar not ... to ...\nYeah that's where I thought you were going comes from the Greek to affect indifference ten points to various team for that let's move on out around the three which is a contribution W GBH listener Bob Mandeville of Boston, Massachusetts it is also various teams chance to have a little fun at the expense of the English language\nWonder if you will correctly defined the following word has two will last ten points to Carolyn\nIf you can sniff out the rose among for one\nThing if you ... seconds to come up with a definition for the word\nSuccessful lights G. O. X. O. P. H. I. L. I. T. E. talk suffer light books [noise]\nA sneak peek out our upcoming season says you is hitting the Montana rather live performances\nIn Bozeman and Billy where the buffalo roam more is it the by whatever the answer we are sure to like bring us your definitions in derivation ... learn to live for tickets good lead details hit on over ... says you've got mad that essay why why do you got [noise]\n\nVery big in the fly by night trio giving us a little bit of time with the word ... T o X o the H. I. L. I. T. E. talks awful like yeah what have you got for\nIn a time of ancient Greece around the time of the first Olympics you might encounter I'm somebody who pursue sporting endeavors and\nUm they might call themselves a talks awful like a\nYou know I'm getting to that because they might use themselves as an archery enthusiast\nTalks awful like Kay\nNamed Joe Greek get out of the way my bow and arrow\nI'm a ...\nAn ancient Greek archery fan ensues enthusiast thank you that might be it or it may be what caused some tests\nFor ... um smaller versions of the type of Mexico they give off a poisonous yeah that'd be from\nI've never seen anybody I'm certain\nThat caverns [laughter] want encourages people to go that you don't like it or lick the rocks\n[laughter]\nOr take them home [laughter] oh my God you learn so much as always in the small still lag whites and blacks to lag might teach has little to like the lead ... yes yeah that could be it or it could be what Barry has for\nSocks off all life is a plant that has\nBeen manipulated to make it appear to be a miniature of itself\nYou may recall talks like in the uh cherish the children's\nDad put up a Christmas tree so proud for all the world to see the world to him all things seem them when it's children's solve the tree was too tall he's no fool he took a tool and took doing self the kitchen stool talks awful\n[laughter] [noise]\nSo that's moving moving [laughter]\nWe have a miniature plans we have miniature rock formations\nAnd we have ancient Greek archery enthusiast and Carolyn you get to have fun with those or it has been such fun", "year": "2018", "show_name": "Says You", "city": "Gadsden", "day": "12"}