{"month": "10", "state": "CO", "station": "KRCC", "content": "The answer waited long discriminated against racial minorities\nAnd require them to pay told to be able to\nI'm Audie Cornish concerns over voter suppression in the mid term this afternoon on all things considered from NPR News all things considered today at three thirty PM\nProgramming on Ninety One point five to your cc is supported\nBy CBO charter high school offering college prep courses advanced placement and a variety of arts electives appointments to learn more about CBO may be scheduled at any time more information is available at ... charter school dot or this was southern Colorado's NPR\nStation to your C. C. C. C. H. D. Colorado Springs ... you see see law hunter tc CEO structural M. T. W. CCF them woodland park\nNo agreement equals real crisis today on the world\nMarket woman the Trump Administration says it will soon give official notice that it's pulling out of a thirty year old arms control treaty with Russia that's got some experts worry\nIs the world's two largest nuclear powers and moved to a place where they say we don't want to have public legally binding agreement that limit what we do with nuclear weapons\nThat is a real ...\nAlso a new film brings to life some old footage from World war one thing that jumps out at you as as a people\nDon't Charlie Chaplin spit on duty free cause any real people with all the new offices and subtleties of human beings to the story behind it they show not grow old that and much more coming up today on the world\n\nLive from NPR News in Washington I'm Lakshmi sang a major investment conference allowing for billions of dollars in sales is underway in Saudi Arabia however in recent days and weeks a flurry of individuals and organizations including prominent Americans have backed out\nNPR's Camilla dominance ski report certain guests are distancing themselves from the Saudi crown prince who is widely suspected of ordering a hit on the Washington Post columnist who died inside the Saudi conflict in\nTurkey Saudi Arabia's future investment initiative was all set to attract CEOs from across the world then journalists democracy oh gee disappeared and ... and turkey said there was evidence Saudi Arabia hadn't killed many Americans pulled out of the conference including the CEOs of blacks\nDemocracy oh gee disappeared and assemble and turkey said there was evidence Saudi Arabia hadn't killed many Americans pulled out of the conference including the CEOs of black rock and J. P. Morgan Chase and treasury secretary Steven Mnuchin\nBut there's still a crowd gathered in Riyadh including business leaders and heads of state Saudi Arabia says it's signing fifty billion dollars worth of deals on the first day of the three day conference mostly through the state oil company\nAnd appearance by Saudi crown prince Mohammed bin Salman was greeted with applause he told reporters the event was going well with quote more people more money ... NPR News\nThe crown princes appearance at the conference came shortly after he and his father king Solomon reportedly receive the slain journalist sons the state run ... press agency says the royals express their condolences\nPhotographer capture the image of the crown prince shaking hands with ... Sala reportedly has been barred from leaving Saudi Arabia since last year\nSandra Day O'Connor the first woman to serve on the U.S Supreme Court confirmed she's in the beginning stages of dementia possibly Alzheimer disease NPR's Nina Totenberg tries to describe part of what would become O'Connor's legacy you know I really don't know a\nWay to express the sort of bursting joy\nThat it it was for women when there was finally a woman on the court and she was such a an able figure she understood that if she failed as she put it it would close the door for women everywhere\nThat's NPR's Nina Totenberg Austin, Texas residents are running low on drinking water most shell of member station KU team has this update\nThe silt the floodwater rolling into Austin reservoirs it looks like chocolate milk and makes it a lot harder to treat than usual Austin water utility director Greg Missouri is\nWe've been reducing capacity at those plants to try to treat this high ... or very cloudy water it's of a level that we've never experienced in the history of our utility uh and it's been a real\nStruggle Austin is under a boil water order and mandated conservation the city of San Antonio has lent Austin or water tank or to help fill up city storage tanks meanwhile many restaurants were closed in stores are having trouble keeping bottled water on the shelves for NPR News I'm Mose Buchele in Austin\nThis is NPR the Connecticut Supreme Court says state police must release\nWritings and other belongings of the men\nThe Connecticut\nSupreme Court says state police must release disturbing writings and other belongings of the man who shot twenty children and six educators at Sandy Hook elementary school in two thousand twelve Davis Donovan memorization W. S. H. E. reports state\nPolice sees the gunman's belongings from his Newtown home shortly after the shooting among them or journals violent stories and to spread sheet ranking mass murders\nState police then rejected a freedom of information request from the Hartford currents to view the items now Connecticut's highest court has ruled five to zero in favor of the newspaper and the state's freedom of information commission\nIt said the shooters belongings aren't exempt from state open records laws it's not immediately clear when the items will be released\nFor NPR News I'm Davis Donovan in Connecticut\nVolunteers and police officers are carefully searching cornfields the woods and swamps and bear in Wisconsin for any clue to a Thirteen year old girls whereabouts authorities have expanded the search area for Jamie clause\nShe was kidnapped last week her parents were found dead in their home near barren which is rural community about eighty miles northeast of Minneapolis authorities say they believe the girl is a victim not a suspect and her parents deaths\nLiberal billionaire George Soros is still waiting to hear from investigators about the source of the bomb that was found in his mailbox that his suburban new property authorities are reviewing surveillance video to find out if the bomb was male or delivered some other way before the clothes the Dow is down one hundred twenty five points about half a percent this is NPR\nSupport for NPR comes from NPR stations other contributors include the law firm Cooley L O L P with officers and the U.S Europe and China cooling advisors entrepreneur as investors financial institutions and established companies around the world where innovation meets the law\n\nThe world is supported by time share exit team founded on the belief that valid contracts must have a reasonable term exit options at time share exit team dot com\nAnd by babble a language ... the teachers real life conversations in a new language like Spanish French or German babble ten to Fifteen minute lessons are available in the app store or online at babble B a B B. E. L. dot com\nA marker woman and you're with the world thanks for being with\nThe app store or online and babble B a B B. E. L. dot com\nMarker woman and you're with the world thanks for being with us as Tuesday\nDrop administration says it is serious the U.S will soon officially pull out of a major nuclear arms treaty with Russia it's an agreement the U.S signed with the former Soviet Union more than Thirty years ago earlier today during his visit to Moscow national security adviser John Bolton confirmed the move\nI think this recognizes that change reality and I think given Russian violations of the treaty as well you have to rely on the facts on the grounds of is it\nThe I. N. F. agreement that's back to Nineteen eighty seven I enough stance for intermediate range nuclear forces it puts restrictions on the U.S and Russia from testing and producing certain types of nuclear missiles Heather hurl bird is with the think tank New America as the\nThe word intermediate implies on in the days of the Cold War and these were were missiles that were that were designed to fight a war between the U.S and the Soviet Union on the territory of Europe and understandably Europeans really didn't like that idea very much so in order for the U.S to maintain facing\nAnd other defense programs aimed at the Soviet Union from European territory Americans thought it would be smart\nTo have this deal which would make it harder to accidentally on purpose wind up in a war that would\nDecimate incinerate Europe and leave the u._s. and Russia relatively untouched and for twenty five years this treaty was a huge success in in making a nuclear exchange in continental Europe unsinkable\nAnd you know what's really happened in the last say five to ten years is that tensions have ratcheted up\nAnd Russia has changed its its military posture I'm In ways that are at odds with the treaty Russian say the U.S has introduced defensive um\nMissiles civil liberties that are they say are at odds with the treaty and so the idea of of war and even nuclear war in the heart of Europe isn't as unsinkable as it was when the treaty was signed and for most of its life\nSo some people wearing in on the U.S pulling out of this deal have called it the most severe crisis in nuclear arms control since the Nineteen eighties uh other people have been more tempered how do you see them move\nI think that that statement\nIs a little overblown and I would be careful and saying what the most severe crisis has left another more severe one ...\nThink that that statement is a little overblown and I would be careful in saying what the most severe crisis is left another more severe one come along quickly behind it um look\nThere's no question as I said that that Russia is is violating the terms of the treaty is is building weapons and testing weapons that explicitly violate the terms of the treaty so you know it's fair I think for supporters of the Trump Administration to say no that's the real crisis\n\n\nYou're listening to the world [noise]\nThe world is supported by as low business banking redesigned by entrepreneur is more entrepreneur is with digital tools to run your business including built in enjoy things mobile deposit and online account set up learn more at as low A. C. L. O. dot com\nAnd by babble a European made language learning program the Bible teaches practical conversation in Spanish French and German and other languages available in the app store\nOr online at ... ... ... dot com [noise]\nNinety One point five K. R. C. C. can be with you wherever you go oh you need is your Android device or I downloaded free Ninety One point five ... mobile\nAt Google Play or the ... or just search for K. R. C. C.\nHey everybody this is ... this is Chris ... hello this is Michael from Trump spread everything in Ninety One point five K. I. C. the music Kevin ... need Ninety seven Ninety two week\nNPR on Ninety One point five to your cc is supported locally by Ninety One point five or so you see underwriters who realized the benefit of reaching Ninety One point five 'til your cc listeners for more info on your business underwriting was gay or see see called seven one nine four seven three for eight zero one\nBy the Colorado Springs school hosting a pre K. through twelfth grade open house in school showcase featuring the arts\nSciences and family entertainment Saturday November tens one to four pm more at the S. S. dot org\nI'm Mark a woman and misses the world it is\nEntertainment it Saturday November tenth one to four pm more at the S. S. dot org\nI'm Mark a woman and misses the world\nIt is a huge number of people all walking together five to seven thousand migrants across the board of this week from Guatemala into southern Mexico\nFrom here in the U. S. it's become a political issue ahead of the midterms President Trump strikes they conspiratorial tone when he says hardened criminals and middle Easterners are heading toward the U.S those claims have no evidence by the way\nThe Mexican government is handling the situation as a humanitarian one Danielle beyond the former spokesman in President Enrique Pena Nieto's government he's now a political consultant\nBeyond says Mexico's government is currently walking a tightrope\nOn the one hand you have your ally and your biggest partner putting pressure on you\nAnd also recall and I think the fact that you need to protect your own borders and you're you're only allowed but on the other hand there is like the whole movement in the public opinion of Mexico saying guys we should treat the Central America as as we require the America treats our Mike Rounds up on the north\n[noise] what about ... right now we're seeing Mexican police in riot gear some of them look like they're ready to go to battle what rights do the Mexican immigration laws give the migrants right now we're traveling through the country\nLooked for decades Mexican southern border has to be very ...\nMeaning that we have like four years hundreds of thousands of immigrants from South and Central America traveling through Mexico\nWe have heavily invested is a country and our southern border there to provide more facilities for legal crossing to provide humanitarian be set for those try relate to the north\nAnd yet Mexican police fired tear gas at some of the migrants enclosed aboard or did you see that as a serious effort or just for ...\nWhat I see that Mexican police work or not they were having the shells and and the guy says but they were not carrying guns because that was the limit they said like they didn't want cash for these clashes so\nThe Mexican police had no live ammunition could Mexican police and security stop the migrants if they want it to could they forced them back south\nThey could do that my guess is that they Mexican on Thursday we'll try to negotiate with them in order for them to apply for humanitarian be says\nDaniel how do you think most Mexicans view the Central Americans passing\nIn order for them to apply for humanitarian be says\nDaniel how do you think most Mexicans view the Central Americans passing through Mexico right now are are they welcoming them would they accept them if they were to stay\nOn the one hand you'll see that a lot of people that go among the poor even like working class people trying to curb the immigrants providing them with\nFood shed their what their we could be not do their own country for their case we were the country that received so many Europeans particularly Spaniards fleeing from CBS wires and World War two but you'll still see some sectors in Mexico city seeing these\nPeople are coming to steal our jobs\nFor Mexico is not so easy just to ignore or scrapped the U.S points of view in in this issue we are countries that are heavily dependent upon each other Fifteen hundred billion dollars per year trade\nBut on the other hand Mexican public opinion they are not happy with the fact of the government just taking orders from another government ... so the Mexican taking\nOrders from the White House in Washington is ... Daniel beyond is a political consultant in Mexico city he's also a former spokesman in the government of president Enrique Pena Nieto Danielle thank you for your time\nHappy to talk to you Michael\nYesterday President Trump announced that he would make cuts in U.S foreign aid for three Central American countries Guatemala Honduras and El Salvador they've been receiving the said since twenty sixteen and it's expected to go down by nearly forty percent in twenty Nineteen that means cutting tens of millions of dollars in financial assistance to the region\nWe wanted to know what that eight actually goes to Sarah\nAppears is with the migration Policy Institute in Washington\nSo what has its aid been used for what what was it earmarked for and how was it used\nTo use very wide variety of issues I mean one of the biggest issues when you're talking specifically about the night and triangle country is the alliance for posterity they say is a program that arose out as a separate migration crisis that we had into that than fourteen when a lot of it and it contains ... arrived at our southern border\nPresident Obama at that time and knowledge that in order to really address migration you need to go to their cars and and look at what's going on in these countries to cause people to to it\nIn order to really address migration you need to go to the root cause and and look at what's going on in these countries to cause people to to fleeing and really have this mass exodus\nThe alliance for prosperity is designed to increase economic prosperity in those countries and strengthen institutions because there's a lot of issues with corruption so that's one of our our major programs going into these countries and and one of the programs that the president you know in reality is threatening to the end\nSo regardless of how much eventually get stripped out of all the this budget lawn for a Guatemala Honduras and El Salvador can the Trump Administration or any other administration without approval of Congress just slash an aid package to a country\nLooking at the law as it might be possible that he has the ability to transfer maybe ten percent of what has been appropriated but no he cannot do that unilaterally and of course because Congress isn't in session now if he really wanted to to end it to these countries he'd really need to wait until they come back in session after November\n... or how political do see this move being as it's only the Trump believes will play well with Republican voters prior to the midterms\nYeah absolutely President Trump ran on immigration he saw that issue when him the election and I think he thinks that it is a good one for Republicans going into the midterms so this caravan effectively as a political gift to him and Republicans\nIn that they can play this up they can play themselves up as the party that is hard line on immigration and that will\nSave the country quote unquote from this caravan\nTrump made this announcement yesterday have you heard any news from Honduras or El Salvador Guatemala about what could happen if as much as forty percent of the say gets caught\nI think the northern triangle country in Mexico as well are are doing a good job of trying to\nWeed through what's coming out from the president and what's coming out in the press and and try to stick to what's actually happening on the ground they recognize that we have a very eminent election in the country and they're just trying to stick with what they think will will actually come so I haven't heard a lot of\nReal concern on the ground up around that aid\nAnd just because it seems so unlikely that that Congress would go through with a threat like that\nAnd what is your organization the migration Policy Institute planning in terms of strategy to to take this on anything\nFor us we're really looking at those reforms to asylum like I mentioned\nIn Policy Institute planning in terms of strategy to to take this on anything\nFor us we're really looking at those reforms to asylum like I mentioned earlier we actually published a report last month advocating for certain reforms to the asylum system including changing a silent for individuals who are applying at our border like this caravan so that\nAnd it operates more efficiently because right now if if anyone in the care of and apply for asylum they'll likely be\nPlaced in our immigration court backlog which stretches on for years so lovely waiting in the United states and then way down the line and immigration court judge will have to pick up their case and started from scratch and see if it's in sincere I sign on an application\nIn reality we'd like to see it and more efficient system operating at the southern border so where we're working really hard to to kind of push out that idea and and\nStress the importance of granting asylum to those who married at\n... policy analyst at the migration Policy Institute in Washington Thank you for your time thank you for having me\nBut some school officials say these students can succeed in other settings and wind up as an adult students like those who are Twenty one in classes would fourteen year olds they're new Gucci is Modesto school superintendent she said that adult program shouldn't be considered negative move\nIf you build an adult and program such that they're learning all the skills necessary\nThan adults at can be a bridge for these students she says especially if they can't get up to speed in high school but Merce said during adult add would have ripped her away from her high school other refugees students wondered just two and went to school board meetings asking to change to age limit rules\nFor some of the students it was her first time pushing for change in the U.S through the evening\nSo my name is Ali Shah bra and now I'm from Syria I'm Nineteen years old and I'm a super senior high school\n... my ...\nMy name is ... I came from Afghanistan um and I came to me I just said I was about to turn Eighteen the age shouldn't be the problem to reach out goals\nHi my name is I asked I Am from Syria I'm Eighteen years old I work hard to\nAnd the age shouldn't be the problem ...\nHi my name is ... I'm ... I'm Eighteen years old I work hard to learn English on his book make and gets migrate up I just have to graduate from high school I think\n[noise]\nThere's an awful lot of the California legislature to help newcomers students\nI Want to change how long the policy to be changed and then once it has to be given a fifty and not be like me\nIn the end the Modesto school board change its rules in June students could apply for that super senior year through age twenty California has a new law along these lines to\nBut these policy changes came too late for Murtha she didn't have enough time to take the class of ... her dream college the University of California Davis but it was to get their eventually\nGoing to go to college I'm actually going to do all the things on like in a study harder because I'm sad about it if you set about something and then you want to do it but you can't\nBecause of obstacles day you're like Stacey that's going and what are the more\nFor now she's working\nAnd just like when she had to stop school before because the war in Syria she won't let obstacle keep her from going after her dreams for the world market share is Modesto, California\nWill be hearing stories all week about immigrants getting education and getting a head here in the U.S you can find out more and tell us your own story or the world dot O. R. G. slash brain game room\nToxic water in southern Iraq because what we're going to discuss with my next guest and to be honest during our conversation and it was hard not to think about Flint, Michigan that's where officials decided to save money back in twenty fourteen by switching the city's water source very bad idea of the pollution problems that followed made residence sick\nYears later many of the good people of Flint are still drinking bottled water\nNow to southern Iraq where people are facing a similar crisis reporter bell true is a correspondent for the British newspaper the independent she spent some time in the marshlands the southern Iraq this past summer\nIt's an opposite of a magical landscape it's almost hard to put into what you're talking about ... kilometers a beautiful marshland about having to move between\nThe areas on on faith in these very narrowed channels that are flying firearm costs to read\nAnd it took me about having to move between the areas on on those in these very narrow channels that are flying by Ron ... read [noise]\n\nAt a very extensive cultural areas that but also wildlife as well in the ... haven't dry for being destroyed by police and you've got both the Buffalo Bills that king fishes tariffs and beautiful but old sort of into laced in these free the people that live that the marsh Arabs to\nHave a very very ancient history\nThey lived at in these kind of read stones we taught even with that families they often have you know young buffalo the cost of living in the actual re talks with them and they've been living the same kind of life for ... for generations which is relying on the grounds on the soil on Buffalo's\n[noise]\nAnd that's over the massive E. impacted now at the mosque loans are rapidly drying up\nAnd as the voices in the coming you know swampy polluted so the mess\nYou also get to the bottom about what's behind the water shortages we're seeing in Iraq Today\nWas speaking to experts they basically said to me that this was the contamination of multiple different issues that caused the kind of perfect storm the is the nightmare Iraq right now I tend to voice that we're looking at festival climate change which is impacting the entire Middle East region\nThe conflicts of course a rocket to struggle free you know buckled against so called Islamic state to occupy areas and destroy each boats infrastructure plea to the environment that is also international gums and finally that the internal problems of rampant corruption\nYes with some sort of pressures on the water so can you tell us about one family you met in the marshes and how they're coping well I'm One\nOf the biggest problem is that the families are facing in the marshes that they basically rely entirely on the books that buffalo trade\nAnd the issues in terms of the moment is it needs that ... thing but it's pleaded insulting started speaking to one father of twelve children ... two years old he's being displaced three times this summer because he's had to try and move his entire family with all that buffer like two areas to find to to find clean water\nHe said oh pays Fifteen buffet I mean nine to buy he said to me they just go into the reeds and die before they died they go blind\nSo that's a sort of echo Ray's numerous stories I spoke to them on science and not just in the mosques on both sides are up north in the Green Belt south of Baghdad farmers roasted saying the same thing to me because they've got so much problems that I was on it and uh\nSynthesizer up north in the green boat south of Baghdad farmers roses saying the same thing to me because they've got so much problems that\nShe and her and I did my never forgotten but\nHow much that dilemma that we live and let them into the ... and that might be going on at the\nCream is saying who's forty eight he told me the last one I was in one hundred she went blind and then died from ... to coming up drying wells his that he ... of ... tend to does it and he's in understanding that on his farm land it was\nBasically just a dusty bowl that he was attempting to file [noise]\nWhen it sundown and used to ferry which is just south of Baghdad is his name is ... to ... like that in the background you can probably hear him say a farmer trying to pile his lungs\nSundown says pretty dogs but he can tell\nThere's something not quite right but the feels that he's trying to plow\n\nHe said he lost everything on ... about three quitting must've issues in Iraq\nSo these water shortages of already created a whole class of refugees are what are the numbers and what is the tipping point in terms of mass exodus like when and if there is no more water\nWell I couldn't quite believe the statistics when I was told this by I'm a senior official need violent ministry and she had to get him to repeat it to me three times rate than English and Arabic but he said to me the next year\nAs many as four million people could be displaced because of the shortages which is more than ... million more than a displaced from the crisis over the so called Islamic state\nJust in southern Iraq or from from the region ... what was he talking about\nFrom Iraq from across Iraq but that's still a million more than a displaced by the occupation of varies by the sequel to stay out of course the offensive to get rid of it\nIt it sounds like water may have been one aspect of the recovery after the war it feels today like water is central to the recovery\nAbsolutely and this is something that I'm at the point that I wanted to make when I was looking at the series which doesn't discovery wrong it covers the whole Middle East we often thing called voice or is it it's something that is is it still need that to come and say when people talk about conflict they think about\nYou know bombs people eating shelter people needing medical supplies the water is essential for life\nYou know and this is what's being shown in Iraq and then they stick stream way to get it\nUh people eating show to people needing medical supplies the border is essential for life\nYou know and and this is what's being said in Iraq and then they stick stream way to get to quit it's controlled it conflicts people if they don't have water they caught me if they have to have to go to them and they have to do something you know I think ... second hand accounts if it's a different tribes actually coming to places like actually having firefights protests applied\nTo a ... video that machine to me is to try to create fighting for it it will come out if the irrigation canal you know we've already seen conflict on ... this is just going to be more complex at a time when you were already struggling matchup and have a security and it does impact the west you know as we've seen with the rise of groups like ISIS\nBuilt true is the middle east and North Africa correspond for the independent in the u._k. Bill thanks very much for telling us about what you saw it with water situation in Iraq really appreciate your time and key by the way the sound you heard in our interview courtesy of bell true and the independent [noise]\nCairo puppet master brings in Egypt since singing legend back to life\nBut still ahead you're on the world [noise]\n[noise] hey thanks for listening this is David Draine Hi I'm Steven Inskeep I'm Rachel Martin say there is Joshua Johnson the host of one day\nAnd time Abigail vaccine joined me and my co hosts weekday mornings for news and cultural coverage on Ninety One point five K. I. C. C. [noise]", "show_name": "PRI's The World", "year": "2018", "city": "Colorado Springs", "day": "23"}