{"month": "10", "state": "CO", "station": "KRCC", "content": "In in the inside your was shaking I knew there were effect on that point because everything was\nShaking I thought just hang in there and I save everything was going to be OK\nStrengthening building codes after hurricane Michael this afternoon on all things considered from NPR News for all things considered today at three thirty\nPM programming on Ninety One point five K. R. C. C. is supported by Colorado College where lifelong learners\nFoster relationships with students and professors working side by side to attain a liberal arts education\nMore about lifelong learning at Colorado College dot edu\nThis was southern Colorado's NPR solution to your C. C. C. C. H. D. Colorado Springs ... hunter ... M K W CCF them woodland park\n\nWelcome to heresy class where palm or high school social studies teacher ... she'll be answered questions about our upcoming election today we ask who's on the ballot this November\nThis year in Colorado were actually voting to replace governor John Hickenlooper who is term limited\nJared poll is a democratic congressman from Boulder is running against Walker Stapleton the Colorado Republican treasurer there of course are a bunch of other people on the ballot as well we're also going to vote to elect a new Congress person from the fifth congressional district\nRepublican Doug Lamborn is the incumbent and Stephanie Rose Spaulding is the Democratic challenger and yes there are the people you could vote for\nIf you want to find out go to go vote Colorado dot com and take a look at a sample ballot\n\nWill join us next week when we discuss how we actually get our ballots and the mechanics of voting\nLie from NPR News in Washington I'm Lakshmi sang President Trump is warning against rushing to judgment in the case surrounding Jamal ... g's disappearance could show gee was last seen weeks ago walking into a Saturday consulate in Istanbul but never walking out\nThe Washington Post columnist you with us resident was critical of Saudi crown prince Mohammed bin Salman Turkish authorities think he was tortured and killed by Saudi hit men which the kingdom the night NPR's Mara Liasson reports that for now President Trump seems to be giving the Saudi royal family the benefit of the doubt\nPresident said he'll be brief soon by secretary of state Mike Pompeo who's on his way back from meetings in Saudi Arabia and turkey President Trump has compared the Saudi royal family to\nBe brief soon by secretary of state Mike Pompeo who's on his way back from meetings in Saudi Arabia and turkey President Trump is compared the Saudi royal family to Brett Kavanaugh suggesting that they've both been considered guilty until proven innocent today he was asked whether those statements gave the Saudis cover\nOf a given caboodle would that being said Saudi Arabia's a very important ally of ours in the middle east\nThe president also said he thinks audio tapes of what could be ... torture and dismembered meant at the hands of Saudi Government officials probably exists and that he's asked the Turkish government to share those tapes with us investigators Mara Liasson NPR News the White House\nThe death toll from a mass shooting at a vocational college in Crimea is now up to Nineteen and Russian investigators on the scene scene Eighteen year old student was the gunman they say the assailant open fire at the college encourage before he took his own life more than forty people were wounded officials say they're no longer characterizing the attack as an act of terrorism\nIt has been another difficulty for residents in those states batter by hurricane that claimed at least twenty nine lives and left dozens of people on accounted for Michael made landfall with one hundred and fifty five mile per hour winds on Florida's panhandle last\nWeek residents in parts of the panhandle are still waiting for power in cell phone service to return NPR's Hansi Lo Wang reports some rural communities are just starting to receive help\nFEMA has been sending teams of search and rescue specialist like Adam sheets of Virginia task force one in Jackson County sheets multiple trailers damage from the storm on the same property where he brick house still stands\nSaul family's grown at home or a third of a ... in order to get assistance from motor we have some medical issues\nHundreds of families are still sheltering in school buildings around the region on July ... NPR News Jackson County Florida and is it\nFiguring out a way to rebuild from the storm were not difficult enough survivors also have to guard against losers\nThe Panama City news herrell close to bay county sheriff's office saying officers have been arresting roughly ten people every night on suspicion of stealing from homes and businesses that are still without electricity some areas of bay county or putting looters on notice with spray painted signs that read losers will be shot\nBefore the clothes the Dow is down Ninety One points at twenty five thousand seven hundred six this is NPR\nAfter years of debate and funding worries California's rolling out its earthquake early warning system shake alert is attended to\nAfter years of debate and funding worries California is rolling out its earthquake early warning system shake alert is intended to warn people in California Oregon and Washington state what a big quakes about to hit democratic congresswoman Judy Chu says fifty pilot projects are operating to cover public transportation hospitals schools and other critical sectors\nTrains an elevator as can be stopped so passengers are safe gas lines can be closed it to a gym so that we can reduce the risk of fire and every second certainly count\nShe says Congress has committed more than forty five million dollars for the new earthquake alert system and more money is expected this year the long running voice of big bird and Oscar the grouch on Sesame Street is retiring NPR's Andrew Limbong reports actor Carol ... leaving the children's program after fifty years\nDaily daily ... has been a part of Sesame Street since it started in Nineteen sixty nine\nTo ... has been very\nA newly laid an egg right here on science will be three\nSpinning dedicated his life the puppetry even met his wife Deborah I'm a set of Sesame Street and twenty Fifteen he told NPR that he was close to his characters including yes big bird but also Oscar is pretty much ah I think I Know how he thinks because he thinks exactly the opposite of what I think is the\nWay to be [noise] to current Sesame Street actors you step into the big bird at ... rolls into Limbong NPR News\nI'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com and the ... e Casey foundation\n\nSupport for the world comes from time share exit team helping people negotiate releases\nFrom timeshare commitments learn more at time share exit team dot com\nMargot Wurman and you're with the world it is hard to get beyond the lure details behind the disappearance of Saudi journalist ... two weeks ago he went into the Saudi consulate in Istanbul to take care of personal business and was according to Turkey's version of events ambush killed and dismembered by a team despite\nBoth to take care of personal business and was according to Turkey's version of events and Bush killed and dismembered by a team dispatch from Saudi Arabia is that the government says it's investigating the Trump Administration is saying give the Saudis time and they will tell us what happened\nSecretary of state Mike Pompeo said as much after meeting Saudi officials including crown prince Mohammed bin Salman\nHigh stress the importance of\nThem conducting a complete investigation disappearance of democracy\nAnd they made a commitment to sort of do that but I said I Would be a thorough\nAnd transparent investigation will all see there was also that that made a commitment that they would show the entire world the results of their investigation [noise]\nThey also indicated they would get this done quickly so that they could begin to answer questions\nThe pressure is on the Trump White house to hold Saudi Arabia accountable but it's tricky there are deep ties between Saudi Arabia and the United states the U.S has long relied on Saudi oil for starters more on that later in the program the relationship that was also about money and there's lots of moving between the U.S and the Saudi kingdom\nSo let's start by following the money two parts to this Saudi money invested here in the U.S and also how reliant Saudi Arabia is on us investment I asked Steven Cook about that he's with the council on Foreign Relations\nIn twenty six teen mom had been ... ... something called the vision twenty thirty which is this great transformation plan for the country that essentially\nPoll Saudi Arabia away from an economy that's reliant on Petro chemicals to one that has more diversified in a central piece of this\nWas to make Saudi Arabia attractive to foreign investors and they have pursued a variety of multinational companies in high profile executives to come and take a look in Saudi Arabia and what they're doing in order to create what this plan vision twenty thirty cause any investment hub\nSo in the past year what are some of the big names in American business that the crown prince as kind of focused on\nWell he's focused on rubber on apple and Google on the big tech companies that Saudi Arabia sees itself as a country that I'm going to be a player in the twenty first century\nAnd uh where are you a player but in the tech sector and they're being discussions with all of those big companies also Facebook\nOn establishing significant presence is an investment in Saudi Arabia\nSo we got to remember the crown prince coming over to the U.S last spring spent three weeks here\nSignificant presence is an investment in Saudi Arabia\nSo we got to remember the crown prince coming over to the U.S last spring spent three weeks here toward the Google alphabet campus was Sergei brand how successful as it were us corporate giants rushing in\nIt was a very successful trip from one perspective it was the crown prince is effort to translate much of what she had discussed back in Saudi Arabia and in conversations with U.S officials and bring it to American corporate interests and he was received an extremely warmly\nSo can the U.S economy run without Saudi oil stick around the world\nThe world is supported by as low dedicated to those who make build and do more offering mobile business banking with tools for freelancers and entrepreneur including built in endorsing mobile deposits in online accounts that I've learned more at A. C. L. O. dot com\nAnd by babble a European made language learning program babble teaches practical conversation in Spanish French German and other languages available in the app store or online at B. A. B. B. E. L. dot com\nSouthern Colorado's NPR station Ninety One point five to ... you can be with you wherever you go all you need is your smartphone download the free Ninety One point five ... mobile apps do go play or the ... app store [noise]\nHey everybody this is the ... this is Krista hello this is Michael from from spirit we seem to Ninety One point five K. I. C. C. news extending the engine need Ninety seven Ninety three\nProgramming on Ninety One point five K. or cc is supported by the cultural office of the pikes peak region inviting listeners who celebrate arts month this October by having at least one new cultural experience with family or friends details at peak radar dot com slash arts month\nBy Ninety One point five K. or cc members throughout our listening area thank you for your supportive southern Colorado's NPR station Ninety One point five key or see see online at K. or CBC dot O. R. G.\nI. marker worm and this is the world Brazil just held elections the newly elected Congress rep\nDot org G A marker worm and this is the world Brazil just held elections the newly elected Congress represents a major shift to the right and then there's the presidential race which in eleven days is headed to a runoff\nThe candidate who's leading the polls after the first round would be Brazil's most right wing leader since the country emerged from military rule in Nineteen eighty five here's more from Catherine Osborn in Rio\nBrazil's presidential rivals have one thing in common so far it their campaigns have been defined left by what they are for than what they are against\nIt is a moment of extreme discontent with the political establishment\nThan we've\nGot to clean it out as a protest or at a recent rally in Rio\nIn Brazil dozens of sitting lawmakers have been implicated in a corruption scandal unemployment is at twelve percent and violence is on the rise\nMany Brazilians believe it's the fault of the leftist workers' party for P. T. the party held the president for Thirteen Years until president Dilma Rousseff was impeached and removed and twenty sixteen\nIs definitely the ... I think is a criminal organization\nThat's lawyer Henry at crude men because the workers' party candidate Fernando ... is in the run off at the end of the month she'll be voting for congressman an ex army captain ... year both so NATO\nIs not as worse as coming back to the power\nBoth all NATO is on the far right and his store rose as a worker's party became mired in scandals he maintains he's a rare ethical figure in Brazilian politics that despite his repeated praise for the men who bring in torture centers during Brazil's dictatorship\nBoth in defense of the dictatorship has sent tens of thousands of Brazilians into the streets ... [noise]\nHere's demonstrator and translator but the the past [noise]\nUnbelievable that we have in two thousand in a pain to go back to what we were trying to do in the sixties [noise]\nThe first round of voting neither ... nor had died gave much detail about what policies they would enact as president and they've never held a public debate in part because both of them was stabbed on the campaign trail and hospitalized ... who told me a new\nPolitical scientist on a cold enough I should I used to says both so NATO has done a better job of tapping into voters fears especially fear of violence\nPolitical scientist on a cold enough I should I used to says both so NATO has done a better job of tapping into voters fears especially fear of violence both NATO promises that he would implement hardline security measures to stop Brazil's homicide epidemic asking them without the media\nBoth also positioned himself as a defender of socially conservative values eventually says and that's one over many of Brazil's poor who used to vote for the left\nBoth wanted an even better in the first round than the poll suggested he would and he's leading and pulled for the runoff it surprised many Brazilians who'd considered him too radical for mainstream appeal now some are scrambling to debate the potential consequences of his proposals wherever people well\nWith that [noise]\nEmbryos low income neighborhood my group of residents as a result to talk politics at their monthly give away a free books shoes and children's clothes\nI had my last\nOne is journalist she's marching she's thirty three and she thinks both modest proposal to loosen gun control who make her and her neighbors live more violent not laughing she strikes up a conversation about both of NATO with a woman looking through the donation\nNo matter\nCall me\nThe woman is a retired janitor\nHer name is Antonio their head and she thinks it you\nSee them all the time I thought it would not\nSay ... says she wants things to change she voted for both tomato and the first round but this time she says she's not going to vote for either candidate she started voting both ... might not bring the changes she wants ...\nTruck driver cloud you have to do all through stop by says he's leaning toward both a model but he's still undecided fifty fifty he says could go either way\nVoters like these may ... to victory\nMachines that's Brazil's left law to be supporters when it retreated from grassroots work in for neighborhoods they might solve it and it's called ... which\nShe says it's these neighborhoods that would pay the highest price it's both a model when [noise] for the world's Catherine Osborn in Rio de Janeiro\nCatherine mentioned Brazil's military dictatorship it lasted for Ninety\n[noise] for the world's Catherine Osborn in Rio de Janeiro\nCatherine mentioned Brazil's military dictatorship\nIt lasted from Nineteen sixty four to Nineteen eighty five some Brazilians are actually nostalgic for that time but it's an era many others would like to forget Frederick afraid does teaches history at North Carolina State University in Raleigh he says years of military rule in Brazil involve brutal repression during that time about\nFour hundred and thirty four people were killed or these appeared in more than a hundred thousand people were arrested for political reasons and many of those where at some point tortured\nTen thousand people left the country so life is not very easy for people living in Brazil during that time who had political idea that were against the military regime including my uncle was one of the four hundred and thirty four people who are these appeared and killed during that time\nOh my gosh I mean it doesn't sound like something Brazil really wants to repeat so what do you think it is about that period that some people in Brazil are nostalgic for that seems to be resonating when ... talks about it\nWell I think the main issue is that Brazil never reckon with its military dictatorship past and the military controlled the process of transition from dictatorship to democracy\nIn Nineteen Seventy nine they passed is abroad amnesty law that prevented anyone involved in human rights violations working for the regime to be prosecuted for eternity so unlike Argentina\nOr Chile Brazil never prosecuted military bowl in the dictatorship the military involved in the extrajudicial killings and the torture\nSo Brazilians have developed this idea that there was a time without crime without economic problems and I think that both so now is trying to tap into that\nWhen both so NATO started his political career for many years he was as fringe figure in Britain in politics but given the current political crisis and economic crisis in Brazil he managed to become popular because\nHe's a message of law and order and return to what some people see as does go they era\nAren't there people ... who are alive today who were tortured under the dictatorship and are now talking about cultural icons and Brazil like a ton of ... were tortured these are important people in Brazil\nAre many people were tortured there is still alive and that's not a secret but they think that was the price to be paid\nThese are important people in Brazil there are many people were tortured there are still alive and that's not a secret but they think that was the price to be paid\nFor I don't know the economic boom that Brazil experience in the Nineteen seventies for example ... recently went publicly\nAgainst both are now saying that he's phrasing for dictatorship is a very bad for the country but people are not listening people are really thinking that at the time not to listen to cultural items to journalists to media\nIn a way it's kind of like the same thing that people experience during Trump is trust who off media distress fraud intellectual they want to listen to this populous message\nFrederick off right does teaches history at NC State University Thanks very much thank you [noise]\nMJ Akbar as accuses are more than a dozen senior women journalists colleagues he'd worked with as editor several Indian publications Akbar denies the charges and does even filed a defamation lawsuit against one of the journalists Priya Romani she says she looks forward to seeing him in court\nThis one case as part of something bigger though over the past week the me too movement in India has really ignited as more and more women have used social media to tell their tails of sexual harassment assault and even rape ... with the BBC in New Delhi I asked her to tell us more about the women who've been speaking up\nThe former ... they on a screen right to stay on a journalist and I think the biggest impact that has happened is they joined us journalists who have come forward and talked about that have ...\n... hands of one particular place in Greece just designed and who was junior ... ... in the cutting government these women that he counting dad hiring Stevens in hand to different people from stand up comedian to\nMusicians to editors make as active\nAs I never ever in my ... years of my life never ever seen HUD any single ... didn't they just coming out in recounting I think there was movement of evolution in the not\nSeen heard anything of that thought back room in the just\nComing out in recounting as if there was a moment for evolution in the lives of these professional women who just wants to talk and diesel woman who already counting their experiences of you know Twenty years back or twenty five years back account of me come just seem violation of their personal space and buddy\nI'm really cares about timing why now I mean was there an article experts say that pulled the lid off the problem or did the women just spontaneously start talking there cruise\nBut I think since the beginning of last year the whole me too movement which began in Hollywood it did gain momentum across the guilt India started talking about it but what she was a trigger point recently is an account for young woman who talked about her experience with a standup comedian\nAnd that actually kind of see no good hole but ...\nAnd a lot of difference in men and suddenly some want to come from India they meant industry it went on to the press and that is when it became really intense lord of the men came out together and especially when they started talking about one particular person that was the moment ban\nIt just felt that it is ... and ... one of those moments when people come out dog and then it fills out\nWhat's been public reaction alike to me to however women reacted andme man\nI mean I don't know how to put it you know for the audience so just just I Know but it is a moment which is good a mixed reaction their loads and loads of women and men who are extremely exonerated and\nThey feel that this is a moment of truth in India which has been updated for so long and it has been extremely brave of these women who have come forward media is also been supportive but\nThere's also mean is more criticism off some of the ... and some of the women coming forward and there is some kind of backlash from some water that you know the name of going forward and be brave that it's going to affect a lot of men who were innocent but I think overall the support has been demands an orderly test\nReally given that impetus to women voice and it also tells us what feminists politics can do to social space\nSo I just want to ask you one more thing because there have been several incidents in recent years that have prompted national conversations over a sexual assault and abuse\nIn India I think of a twenty twelve gang rape of deal to sing a she was given the name nearby oh there was a lot of media attention in India all over the globe but then after the trial for the perpetrators international discussions\nThat kind of felt like that news quietly went away\nThere was a lot of media attention in India all over the globe but then after the trial for the perpetrators international discussions it kind of felt like that news quietly went away and then there'd be another attack that wouldn't get much attention just situated for us what's happening now and what feels kind of like a pattern up to now is this different\nIn twenty two has been the same as they happen and thousands of men women came out and treat protesting and demanding stricter laws in our life there\nWere changes it became most strict definition of rape was why didn't but has that did use violence against women know if you look at the data the number of violent incidents against the woman has not gone down this is also true that more than a coming forward to to ... cases of violence\nBut stick laws because I Know of course you know the last days that if there is a rape or juvenile afoot young person than hanging is always option captive punishment is something that in government supported people in gender has supported the government of India that yesterday such a genius nine that people should\nBut it does something feel different now\nI think what is it different is that people are talking about that they've been coming forward I think that is a big move and there is much more as a nation that\nYou cannot just lie down and take it I think for me as an Indian woman this is a big change it has taken a very long just to realize that this is a problem and\nThat just has to be deserted and each one of us have to come forward and do it at every possible point also ... and it's something which is which is a big victory the seat of indicated definitely\nThe BBC's Rebecca ... in New Delhi thanks very much for your time thank you [noise]\nEr nurse ... out of India and drops us in North London in the u._k. but it's also about women taking the initiative in this case we're talking about a gym run by women were exercises mixed in with a hard edged political message the rules Alison Herrera has the story [noise]\nThe first thing you notice about full search him the last uh stuff no pedal belt know treadmills it's no fancy crops that class in the middle of what looks to be a meeting room it's just a large black Matt and a pile of boxing gloves [noise]\nAnother thing you notice in Seoul star is there are guys working out here it's mostly women doing that\nThe way you see women kind of oil to the king of pattern muscular bikini dating like cable\nIt's mostly women doing that that's the way you see women kind of oil Dr King all tandem muscular in a bikini doing like ... what can we try and counter that by showing\nHow women really to\nThe the defiant and a fit and healthy\nThat's co owner ... she opened this gym two years ago it is cold wet but amongst dream was to create a place where women would feel comfortable and learn some basic self defense in classes led by women\nThat goes I said it was a few minutes but we didn't want to find is completely so it's not something that we embrace and and I teach is\nWhat is in blazing do muscles start tee shirts it's politics so\nIs breaking up part of solidarity\nSoul as in solidarity solidarity among different kinds of people from all backgrounds to want social change and the big red star in the middle of the T shirt\nIt don't see the the socialists started the red star they see on the ... and branding\nLamont it's training people at Seoul start for what she sees is a bigger fight and ideological\n[noise]\nThat's really August twenty Seventeen neo Nazi rally in Charlottesville, Virginia before it turned violent and the counter protester was killed [noise] ... gym in London open before that but like in the U.S there's been a rise in far right nationalism in the u._k. [noise]\nJust last month far right activists held an anti Muslim rally in Sunderland a city in the north east England [noise] interested in ... [noise]\nAt\nThis rally in Charlottesville there were counterprotesters shouting down racist chants and clashing with marchers [noise] poll amount\nSays that's why the motto at so star is training together for the struggle\nIn this current plan ... climate when it's necessary that people are able to defend themselves\nLamont proudly advertises that this is an anti fascist Jim she believed it's time for the left to toughen up its image and she support the anti fascist militant groups like ...\nI went to present the left as strong as bold as confident and I think there's a tendency annex it worries me that there's a tendency to operate a little bit from the victims position [noise]\nKick boxer and as you Kelly teachers self defense here\nPart of it is thrown jobs and punches yes but she says\nKick boxer and as you Kelly teaches self defense here\nPart of it is thrown jabs and conscious yes but she says it's also how you carry yourself\nAnd sometimes you do need to fight that and present yourself as a confident and capable lessons\nThings like that because the ... [noise]\nEven though it's old star space it small classes like this one are packed it seems like the message of training people to be strong both physically and politically it's catching on for the world and Alice in that letter London [noise]\nWhy average life expectancy is growing in Spain and yes it involves oil extra virgin olive oil you're tuned to the world\nSupport for the world comes from apple or language out the teaches real life conversations in a new language like Spanish French or German battles ten to Fifteen minute lessons are available in the app store or online at that will be a B. B. E. L. dot com\nAnd from legal zone dot com offering a network of independent attorneys in tax professionals who can provide the advice needed to get through the daily grind of owning a business more legal zone dot com slash world\nIf your duty area or just a little forgetful and you'd like to know when your favorite program airs on Ninety One point five parents teach the visit our website where you'll find", "year": "2018", "show_name": "PRI's The World", "city": "Colorado Springs", "day": "17"}