[{"month": "10", "state": "AZ", "station": "KAWC", "content": "A century feature that women find the most attractive and which is most important for them in terms of selecting a lover and actually how a man smells\nUncovering the invisible secrets there on this week's big picture science [noise]\nEasy evening at seven on K W the eighty nine ... [noise]\nAWAC is mad at or football team will be having a home game against no College of Utah this Saturday afternoon out to a Veterans Memorial stadium which is located at sixty nine Ninety eight use twenty four street near the you make a news you can bring your details at ... dot com\nIt's eight o'clock and you were listening to K. A. W. seat Yuma K. A. W. Peter Parker eighty eight point nine up in in ... a WC dot org service of Arizona western college for more than forty five years\nBringing NPR News to the Colorado River communities of la pause and ... counties\nBrochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world joined K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine Wednesday\nK. A. WC and retired Arizona highways publisher when Holden at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty seven and St Paul cultural center\nFor information visit K. A. W. C. dot org ... made possible in part by a grant from Arizona humanities\nClear skies in the forecast for you this evening low of around sixty six are expected was sunny skies tomorrow has reaching up to Ninety five degrees what's it called northeast when that will be blowing throughout the day in the evening clear skies Loeb around sixty one sunny tomorrow with high is reaching up to Ninety four in a coma variable wind throughout the day\n[noise]\nLive from NPR News in Washington ... Stevens a fifty six year old Florida Man is facing charges of sending Thirteen potentially explosive devices to a prominent Democrat and critics President Trump\nIs NPR's Miles parks reports the suspect was arrested after the discovery of three more packages earlier today\nShe's or say Iraq is charged with interstate transportation or an explosive illegal mailing explosives threats against former presidents threatening interstate communications assaulting federal officers he faces up to forty eight years in prison if he's convicted according to the Justice Department\nSick along criminal record according to public data including a charge related to a bomb threat in the early to thousands\nPresident Trump spoke about sex arrest saying quote these terrorizing acts are despicable and have no place in our country that we must never allow political violence to take root in America Miles Parks NPR News\nPresident Trump says he doesn't plan to contact former President Obama or anyone else targeted by the pipe bombs Trump says it's not his fault that one of his supporters is allegedly behind the threats speaking to reporters before heading to in North Carolina rally the president says he wants to focus on the upcoming mid terms\nI think that they were having a great deal of\nRightfully so but now we have to start at the moment the\nTrump later accused the media of gloating over the package bomb storage to score political points against him and against the Republican Party\nThousands of people from Central America are still walking through Mexico toward the U.S border to seek asylum but their numbers are getting smaller coordinators of the caravan are rejecting a proposal by Mexico's president for the migrants to apply for refugee status in the country [noise]\nMeanwhile the Pentagon is preparing to send hundreds of active duty troops to a border patrol agents at the U.S southern border when the asylum seekers arrive\nA new report from the nonpartisan government Accountability Office shows disparities and help schools prepare students for college NPR's lists a nap when he has details\nHigh poverty schools and smaller schools were less likely to offer advanced classes like calculus or physics according to the research\nThose schools were also less likely have advanced placement or Eighteen classes that allow students to earn college credit these are really rigorous classes they can they're taking you know in high school and the idea is\nThat they will help better prepare them for the rigors of college that's Jackie you know the with the G. A. L. in addition to preparing students these classes are also like most public four year colleges are looking for during the admissions process students not taking that may be less competitive when it comes to applying to college\nI listen to any NPR ...\nYou're listening to NPR News\nAre you in some of the national park officials has two people killed after falling from a popular overlook punch about eight hundred feet in a very steep\nAre you in some of the national park officials is to people killed after falling from a popular overlook punch about eight hundred feet in a very steep terrain park spokeswoman Jamie richer says rangers retreat the bodies with the help of the California highway patrol helicopter\nA tourist spot at the pair after they had fallen from a granite cliff thousands of feet high it's unclear when the victims die\nAnd they have not been identified\nThe ashes of Matthew Shepard finally have a final resting place some Twenty years after he was murdered in Wyoming for being gay NPR's Tom Gjelten reports that shepherds ashes were interred today at the Washington National cathedral\nThe Nineteen Ninety eight murder of Matthew Shepard came to symbolize crimes have hate and anti gay bigotry his parents did not interrupt his ashes previously for fear of the site would be desecrated\nSpeaking at the un tournaments ceremony data shepherd said he was relieved his son could now rest so important that we now have a whole\nA home that others\nCan visit [noise]\nThat is safe from\nHaters Matt shepherds ashes well rested in the cathedral crypt alongside those of about two hundred other notable figures Tom Gjelten NPR News Washington\nAnd a dino virus outbreak has claimed the life of an eighth child ... New Jersey rehabilitation center where twenty three people have been afflicted state health officials say the strain of virus is associated with communal living arrangements I'm shape Stevens NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home at ...\nDot com\nClassical music begins next year on king a double you see any point nine FM indicate you double you see that ordered\nIt said oh six\n... to Yuma present but you just said but it's probably best celebrating craft beers from around the region would live music ... and ... games it will be some or all from five to nine PM at ... stadium if you'd like more information you can reach us at Ninety three or four seven six nine zero\n\nGates that\nGetting ready\nConsciously she lives\nDodge uh gee what she's smiling\n\n\n\n[noise] into the lights from vocalist sunny Wilkinson\nInto the liked embodies the theme that life it's often fraught with challenges and seemingly insurmountable obstacles but strength and perseverance can deliver you into the light where wisdom and beauty about the love for family and the strength enjoy it rain\nA company by her husband Ryan Newman a piano\nAnd for the ... on bass and Larry uncle treat on drums and before that we have music from the bassist Ricky Rodrigues\nThe title track from looking beyond Ricky Rodriguez is accompanied by Adam Rogers on guitar Louis porno my piano obit cold beer on drums Myron Walden on Alto\nWith special guess W Sanchez on tenor Peter Rodriguez on trumpet Obama Lou I'm Lindy on by real ... here's music from bill Evans wealth for Debbie\n\n\n\n\n\n\nDa\nNa\n\n\n\n\nNothing is sweeter than gene Ammons also known as a joke on a ballot my ... heart\nBefore that Jim elemental jackass dream quaint at the ... the ad featuring the beautiful voice I'm Sheryl Wilson with the ...\nCurrent ailing special guests with banker my salary should watch it from upward spiral dishes from one island to another from nine\n...\nWe choose between\nThe ...\n...\nAnd this\n\nWay", "year": "2018", "show_name": "Best of the Village Jazz Series", "city": "Yuma", "day": "27", "locations": [["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Holden", 64.33718, 13.53844], ["Arizona", 34.5003, -111.50098], ["Washington", 38.89511, -77.03637], ["Florida", 28.75054, -82.5001], ["Iraq", 33.0, 44.0], ["America", 39.828306, -98.5795], ["North Carolina", 18.38078, -65.95739], ["Mexico", 23.0, -102.0], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["U.S", 39.828306, -98.5795], ["California", 34.68743, -116.78467], ["Wyoming", 43.00024, -107.5009], ["Washington", 38.89511, -77.03637], ["New Jersey", 40.72816, -74.07764], ["Washington", 38.89511, -77.03637]], "not_found": ["guitar Louis"], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Arizona", "Arizona", "Arizona", "Arizona", "Arizona", "Washington", "Florida", "America", "U.S", "U.S", "California", "Wyoming", "Washington", "New Jersey", "Washington"], "out_country": ["Holden", "Iraq", "North Carolina", "Mexico", "Mexico"], "in_state": ["Arizona", "Arizona", "Arizona", "Arizona", "Arizona", "Arizona"], "out_state": ["Holden", "Washington", "Florida", "Iraq", "America", "North Carolina", "Mexico", "U.S", "Mexico", "U.S", "California", "Wyoming", "Washington", "New Jersey", "Washington"]}, {"month": "10", "state": "AZ", "station": "KAWC", "content": "In the Nineteen fifties the girl who took apart radios for fun wanted to tackle advanced math\nHer guidance counselor had other ideas why do you want to take calculus to just going to grow up and have babies how she became a pioneering astronomer any way on the next big picture science [noise]\nTo the evening at seven on key WC eighty nine ... [noise]\nIn observance of Hispanic heritage month assemblies library will host the ... annual division between the art work of art is it continues through October ... you got the San Luis branch library and Seventy five six seven you you can find further details you my library dot org\nIt's eight o'clock and you are listening to K. A. W. see you\nTuesday evening at seven in ... the eighty nine ... than [noise]\nIn observance of Hispanic heritage month assemblies library ... annual mission featuring the art work of art is it continues through October fifth you got the San Luis branch library ... Seventy five six seven you you can find further details you my library Donald lord\nIt's eight o'clock and you are listening to K. A. W. seat Yuma K. A. W. P. Parker eighty eight point nine up in in ... a WC dot org a service of Arizona western college for more than forty five years\nBringing NPR News to the Colorado River communities of low pause and ... counties\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and reviewed publications in the world doing K. A. W. sea and retired Arizona highways publisher when holding at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty seven and St Paul's cultural center\nFor information visit K. A. W. C. dot org ... made possible in part by a grant from Arizona humanities\nWhether in Parker tonight mostly clear skies in the forecast the low around sixty two and a calm west northwest breeze sunny skies tomorrow with the higher Ninety One and a light variable breeze\nIn Yuma tonight clear skies but the low around sixty eight in northwest window five miles per hour tomorrow sunny skies behind your eighty nine and a south south west window five to ten miles per hour\nLive from NPR News in Washington ... Stevens\nMania was Senator Susan Collins says she'll vote yes to confirm Supreme Court nominee Brett Kavanaugh Karlan says Christine Blasey Ford's testimony that Kavanaugh sexually assaulted her when they were teenagers was compelling but should not be the judge off the bench\nThere are some who argue that given the current special counsel investigation President Trump should not even be allowed to nominate a jazz says that argument ignores our wreaths and head straight\nCollins says the Supreme Court confirmation process has been declining for over Thirty years and she hopes the Kavanaugh nomination is where the process is finally hit rock bottom meanwhile Alaska Senator Lisa Murkowski says after agonizing over Kavanaugh's nomination she decided to vote president during tomorrow's confirmation vote\nAnd Chicago police officer Jason Van Dyke has been convicted of second degree murder and sixteen counts of aggravated battery and the shooting death of a black teenager as WB easy St Patrick Smith reports Van Dyke was let out of the courtroom in handcuffs\nVan Dyke shot teenager Laquan McDonald sixteen times and two thousand fourteen shooting was captured on video shows McDonald walking away from police and Van Dyke unloading his gun continuing to shoot even after McDonald's falls to the ground\nDuring the trial that I took the stand and tried to explain why that video didn't match up with his perception the jurors spoke to the media after the verdict on the condition that their names not be revealed and they were asked what they thought a Van Dyke testify this is a juror number two four or five\nHis testimony was incredible to me\nHe was trying to remember stuff that he's saying that maybe wasn't from\nVan Dyke now faces at least six years in prison for NPR News I'm Patrick Smith in Chicago\nUs job growth continued last month the ongoing demand for workers pushed the nation's unemployment rate down to three point seven percent level not seen and nearly half a century but NPR's John Ydstie reports that the pace of\nThey thought a Van Dyke testify this a juror number two four or five\nHis testimony was incredible to me\nHe was trying to remember stuff that he's saying that maybe wasn't true\nVan Dyke now faces at least six years in prison for NPR News I'm Patrick Smith in Chicago\nUs job growth continued last month the ongoing demand for workers pushed the nation's unemployment rate down to three point seven percent level not seen and nearly half a century but NPR's John Ydstie reports that the pace of job growth slowed in September\nThe economy added just a hundred and thirty four thousand jobs in September the smallest months they gain any year Sarah houses senior economist at Wells Fargo says Hurricane Florence was partly to blame but workers are also getting harder to find\nSo we think is given how scarce flavor is that we're likely to see that the trend in in hiring continue to flow\nEconomists have been predicting a slowdown in hiring for a while as the number of potential workers on the sidelines of declines still the average job gains over the past three months to remain strong at a hundred and Ninety thousand a month John Ydstie NPR News Washington\nMost street stocks close lower today on worries about rising ... and interest rate the Dow Jones industrial filled a hundred and eighty points this is NPR News\nA navy veteran in Utah accused of sending suspicious letters to President Trump into defense officials\nIs charged with threatening to use a biological toxin as a weapon thirty nine year old William Clyde Allen mailed on bulbs containing ground Castro beans the poison rice and has made from the pie product of castor oil production\nThe nation's largest mattress retailer is closing seven hundred stores as it seeks chapter eleven bankruptcy protection court documents show that Houston based mattress from\nHas more than a billion dollars in liabilities and more than fifty thousand creditors mattress from has more than three thousand us stores and has been aggressively expanding award winning Claymation animator Wilmington has died from Oregon Public broadcasting April bear has this remembrance\nThen wanting Academy Award in Nineteen Seventy five for his short film clothes Monday's in twenty Seventeen he noted in a documentary it was the first time and stop motion project with every nominated for an Oscar\nHave to remember that this is a time when around the world Ninety eight percent of animation was to D cell animation you know the classic uh looney tunes tons of them\nSo just to even create an experiment with this was way out there and\nSubsequent any wins and hid Claymation commercial promoting California Raisins propelled them since the top tier of the global animation community paving the way for dozens of original features and short\nSentence family said Thursday he died after a twelve year battle with blood cancer he was Seventy for NPR News I'm April there in Portland, Oregon this is NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the artists foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at arcades foundation dot org and the corporation for public broadcasting\n\nAnd it said I'm sick stay with us for a night of beautiful jazz here on K W CD point nine FM and K. A. W. C. dot or\nDo you mean county library will be hosting a live performance of the territorial chapter of the Arizona old time fingers association it will be next Tuesday October night from three to five at the main library which is located at twenty ninth to oneself twenty first driving Yuma it'd be like more information you can contact us\nAnd its partners at ... foundation dot org and the corporation for public broadcasting\n\n... stay with us for a night a beautiful jazz here on can you do when you see the point nine FM and can you do when you see Don or\nDo you mean county library will be hosting a live performance of the territorial chapter of the Arizona will type figures association it'll be next Tuesday October night from three to five\nAt the main library which is located at twenty ninth to be one twenty Bruce driving you it'd be like more information you can contact us at night to eat ... for seven six nine zero Mm\n\n\n\n\n\n\n\nMade made a movie\nWhen you tell me well\nIs ... in the mid\n...\nMy heart\nOver the ...\nTo ...\nMusic\nMom how\nOver the ... the numbering\nMusic in\nNeeding new you know we'll\n\nLying in the\nMountains or riding on you\nWhen you leave them in any way\nNeed\n\n\n\nThe\n\nMy man named\nKnow if you're\n\nBeautiful rendition of sky lack from refined barber the music in the night\nWith the beautiful locals of Darren Tucker Rosalind Barbara on Sopranos or sex Matt in dollar piano jak I ... on bass Derek Philips are drawn\nFollowing up with another new release for pet Martina from formidable due to Duke Ellington sound with pet Martina or guitar ... aren't Oregon and Carmen and tore junior or draw\nEnjoy the music [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]", "year": "2018", "show_name": "Best of the Village Jazz Series", "city": "Yuma", "day": "06", "locations": [["San Luis", 22.14982, -100.97916], ["San Luis", 22.14982, -100.97916], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Parker", 32.7593, -97.79725], ["Washington", 38.89511, -77.03637], ["Alaska", 64.00028, -150.00028], ["Chicago", 41.85003, -87.65005], ["Chicago", 41.85003, -87.65005], ["Chicago", 41.85003, -87.65005], ["Washington", 38.89511, -77.03637], ["Utah", 40.23384, -111.65853], ["Houston", 29.76328, -95.36327], ["Oregon", 44.00013, -120.50139], ["Portland", 18.13333, -76.53333], ["Oregon", 44.00013, -120.50139], ["Washington", 38.89511, -77.03637], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Oregon", 44.00013, -120.50139]], "not_found": [], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Arizona", "Arizona", "Arizona", "Parker", "Washington", "Alaska", "Chicago", "Chicago", "Chicago", "Washington", "Utah", "Houston", "Oregon", "Oregon", "Washington", "Arizona", "Arizona", "Oregon"], "out_country": ["San Luis", "San Luis", "Portland"], "in_state": ["Arizona", "Arizona", "Arizona", "Arizona", "Arizona", "Arizona"], "out_state": ["San Luis", "San Luis", "Parker", "Washington", "Alaska", "Chicago", "Chicago", "Chicago", "Washington", "Utah", "Houston", "Oregon", "Portland", "Oregon", "Washington", "Oregon"]}, {"month": "10", "state": "AZ", "station": "KAWC", "content": "Wednesday November seventh from five thirty to seven at St Paul's cultural center\nFor information ... K. A. W. C. dot org ... made possible in part by a grant from Arizona humanities\nThe human county library welcomes Melissa Stevens with the horse introduction to scraping or a software program for writing with more organization an option the word processor cores meets on Monday October twenty second starting out six PM at the human library twenty nine fifty one ...\nThis is eighty eight point nine FM K. A. WC Yuma K. A. W. P. Parker indicate a WC dot org a service of Arizona western college were more than forty five years we bring NPR News through the Colorado River communities of ... and ... counties it's eight o'clock\nSo many little bite of news you get throughout your game all things considered fills in the gaps between the day's most important stories so you get the what's the last midterm election only about twenty percent of voters under age thirty showed up at the polls and the wives can only say young\nGet the what's the last midterm election only about twenty percent of voters under age thirty shut up at the polls and the whys ... young people move around a lot and they often feel rough invested in local election here the bigger picture on all things considered every afternoon from NPR News [noise]\nClear skies tonight in park slope around sixty three degrees some north wins of five to ten miles per hour winds will continue into tomorrow with mostly sunny skies and high near Ninety degrees in human tonight clear skies ... around sixty seven some north winds of five to ten miles per hour\nMore wins tomorrow's sunny skies a high around Ninety degrees thanks for listening\nLive\nFrom NPR News in Washington I'm Jim Huck\nSaudi Arabia is acknowledging the death of journalists ... cars showed gee at the Saudi consulate in Istanbul that's according to a report by the Saudi state news agency which says Eighteen people are under arrest including to advisors to the Saudi crown prince President Trump offering this reaction\nI think it's a good first step and said they said it's a lot of people a lot of people involved that I think it's a great first step\nUntil friday's turnabout Saudi Arabia had maintained that the Washington Post columnist left their consulate freely and that his whereabouts were unknown\nThe Justice Department has charged a Russian woman over allegedly interfering in the upcoming us elections as NPR's Ryan Lucas reports this appears to be the first known case against Russians in connection with this year's midterms\nThe woman identified as a ... a sign of a is charged with conspiracy to defraud the United states for her a legit role and a Russian scheme to interfere in the American political process including the twenty Eighteen midterms court papers allege that she worked as the chief accounted for a sprawling Russian influence campaign\nThat effort included that same troll farm that faces charges as part of special counsel Robert Mueller's investigation\nProsecutors say could sign of a managed the finances of operations I used to fake social media posts so discord among Americans the case against or is being handled by prosecutors in Virginia not the special counsel's office the forty four year old ... is not in us custody she is believed to be in Russia Ryan Lucas NPR News Washington\nThe U.S and South Korea have suspended another military exercise the give nuclear talks with North Korea a chance to proceed as NPR's Tom Bowman reports there are still concerned about American troops readiness\nThe suspended exercises called vigilant A's and it was supposed to be good in early December it's an ear exercising involves more than two hundred military aircraft\nThe Pentagon said in a statement that both the U.S and South Korea are committed to modifying training exercises to make sure troops already\nThe last month the new commander of U.S forces in South Korea army general Robert Abrams told senators they're already has been what he called a slight degradation and the readiness of U.S forces to defend against North Korea attack because of the suspension of another military exercises in the summer\nPresident Trump said that exercise will be provocative\nBarring a term used by North Korean leader Kim Jong il and Tom Bowman NPR News Washington\nUs home sales fell on September ... the most in over two years as the housing market continued to struggle despite strength across the broader economy the national association of realtors says existing home sales drop three point four percent home sales have now fallen for six straight months\nOn Wall street friday the dolphin a sixty four points higher and while the NASDAQ Composite sank thirty six points and the U.S and the five hundred lost a single point\nThis is NPR News\nThe University of Southern California is agreeing to settle claims of the former campus gynecologist abused women\nNPR News\nThe University of Southern California is agreeing to settle claims that a former campus gynecologist abused women during the exams over the course of his nearly thirty year career from member station KPCC adult Guzman Lopez reports\nUSC has agreed to pay two hundred and fifty million dollars to settle five federal class action lawsuits earlier this year hundreds of women accused former campus kinda colleges George Kendall of touching them inappropriately during exams among other things one to Austin is us sees interim president\nWe really deeply regret any ever comfortable and safe or Mitch treat it in any way and we don't have the actual University in\nThe settlement is unlikely to end us seized abuse scandal about five hundred women had sued us see in ... in state court lawyers for some of those women say they reject that settlement because the amount is too low for NPR News I'm ... ... in Los Angeles\nThe European and Japanese space agencies are sending twin probes to the planet mercury and hurry on five rocket loft or the two spacecraft into orbit friday night marking the start about seven your journey to the solar system's innermost planet\nWhen they reach mercury and twenty twenty five the two probes will independently investigate the surface and magnetic field of mercury\nGame is to build on the inside gain by NASA's messenger probe which ended its mission and twenty Fifteen\nAfter a four year orbit of mercury I'm Jim Huck NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors includes the ... Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent thought whether that's on line over the air or in a bottle more in Sierra Nevada dot com\nYou're tuned to K. AWAC eighty point nine FM and Katie WC dot org\nClassical music begins next it said oh six\nHuman county library present solar viewing on the patio and the interview the sun through the library silver telescope to observe sunspots prominence is an players that will be next Thursday October twenty fit that three PM at the library won three to six east south ...\nOh\n\nMm\n\n\n\n\n\nMm\nHey that was back to back Chicago royalty that was George ... and Chico Freeman from all in the family enter orchestrate ... a company by some of the best of Chicago's musicians Kurt Browning piano heritage and banking on base\nJaime Drake on drums in percussion retail Weber an hanging percussion my column on on guitar Joel Jenkins on drums with George ... guitar and Chico Freeman on tenor an Sopranos or sex\nAnd before that we had the king himself Mr Willie picking\nFrom it's about time della by starlight with Mr Willie picking up piano Dan Shapiro on base Robert shy on drones more music coming up to sit back relax and enjoy this is Jay\n...\n... ... ...\n...\n... ... ... ...\n...\n... ...\n... ...\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise] ...\nNot [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\nMm Mm Mm Mm Mm Mm\n...\n... ...\n... ... ... ... ...\n... ... ... ... ...\n... ... [noise]\n\n\n[noise]\nMm\nThere's no snow ...\nWhen this no\n\nHow much she had me about\nFifteen [noise]\nI Can't remember\nThose waste is sham\nYes what they said\n[noise]\nKnow\nI'm with now come\nAnd vain they do\nNot know\nMan\nShow when it when\n\nShe made\nHe's the man\n\nIn her\nAre using the mouse\nUsing the mouse or\nNo on on the\nRich troubles ...\nAnd\nSure you'll see me my love\nNot on the phone\nWith his toy present ...\nIn\nThe mountain my lunch\nBreak because you know ...\nIn\nA huge\nYou up and say\nYeah and\nThat's where you'll see me Muslim\nNon on the street\nWith its struggles and\n...\nAnd\nThat's where you see me as a\n\nNon on the\n...\nSo don't go around in\nMount ...\n...\nJust live your friends said\n...\n\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] uh\nThe older\n\nYou know\nWe're talking with the\n\n[noise]\n\n[noise] and then the\n...\n...\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [noise] but\nWith\n\n\nAll\nThings\nSome great\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise] but\n\nBut then\n\nOn\nThe [noise] for\n\nTalk of\nThe reason\nWere going to\nThe plane\nFor what's going", "year": "2018", "show_name": "Best of the Village Jazz Series", "city": "Yuma", "day": "20", "locations": [["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Washington", 38.89511, -77.03637], ["Saudi Arabia", 25.0, 45.0], ["Istanbul", 41.01384, 28.94966], ["Saudi Arabia", 25.0, 45.0], ["the United states", 39.828306, -98.5795], ["Virginia", 38.34982, -81.63262], ["us", 45.99696, -118.49854], ["Russia Ryan", 54.0933, 42.2741], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["South Korea", 36.5, 127.75], ["North Korea", 40.0, 127.0], ["U.S", 39.828306, -98.5795], ["South Korea", 36.5, 127.75], ["U.S", 39.828306, -98.5795], ["South Korea", 36.5, 127.75], ["U.S", 39.828306, -98.5795], ["North Korea", 40.0, 127.0], ["Washington", 38.89511, -77.03637], ["Us", 45.99696, -118.49854], ["U.S", 39.828306, -98.5795], ["us", 45.99696, -118.49854], ["Los Angeles", 34.05223, -118.24368], ["Washington", 38.89511, -77.03637], ["Chicago", 41.85003, -87.65005], ["Chicago", 41.85003, -87.65005], ["Mount", -5.85746, 144.23058]], "not_found": ["Kurt Browning"], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Arizona", "Washington", "the United states", "Virginia", "us", "Washington", "U.S", "U.S", "U.S", "U.S", "Washington", "Us", "U.S", "us", "Los Angeles", "Washington", "Chicago", "Chicago"], "out_country": ["Saudi Arabia", "Istanbul", "Saudi Arabia", "Russia Ryan", "South Korea", "North Korea", "South Korea", "South Korea", "North Korea", "Mount"], "in_state": ["Arizona", "Arizona"], "out_state": ["Washington", "Saudi Arabia", "Istanbul", "Saudi Arabia", "the United states", "Virginia", "us", "Russia Ryan", "Washington", "U.S", "South Korea", "North Korea", "U.S", "South Korea", "U.S", "South Korea", "U.S", "North Korea", "Washington", "Us", "U.S", "us", "Los Angeles", "Washington", "Chicago", "Chicago", "Mount"]}, {"month": "10", "state": "AZ", "station": "KAWC", "content": "Mm Mm\nVultures with your question both calling every tastes are going to win many popularity contest and they have another unsavory habits euro hydro says which is a scientific euphemism for snooping on your legs in order to keep cool but\nVoters are nature's cleanup crew tackling are biased who's with soldiers and other animals on the next big picture science\nTo the evening at seven on gay WC eighty nine ... [noise]\nThe Germans of Hispanic heritage month assemblies library will host or fifth annual division between the art work as hard as it continues through October fifth you got the least branch libraries\nAnother unsavory habits euro hydro sis which is a scientific euphemism for snooping on your legs in order to keep cool ... per nature's cleanup crew tackling our biases with voters and other animals on the next big picture science\nTo the evening as an unpaid NBC eighty nine ... [noise]\nIn observance of Hispanic heritage month assemblies library will host or fifth annual exclusion featuring the art work of art is it continues through October fifth you got the family's ranch library and Seventy five six seven you you can find further details you my library Donald toward\nA service of Arizona western college for more than forty five years this is K. A. W. see humor K. A. W. P. Parker eighty eight point nine of them and K. A. WC dot org ... NPR News for the Colorado River communities of ... and ... counties\nIt's eight o'clock [noise]\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and rebuild publications in the world\nDoing K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty to seven at St Paul's cultural center for information visit K. A. W. C. dot org this have been made possible in part by a grant from Arizona humanities\nSixty percent chance of showers in human tonight with mostly cloudy skies ... around Seventy degrees fifty percent chance of showers in the area tomorrow with partly sunny skies ... eighty one sixty percent chance of showers in Parker tonight with partly cloudy skies low around sixty four tomorrow eighty percent chance of showers throughout the day with a high near Seventy nine degrees\n[noise]\nLive from NPR News Culver City California I'm Shannon Van Zandt hurricane Michael the category for storm that hit the Florida Panhandle this week before moving up to dump heavy rain on Georgia the Carolinas and Virginia\nHas destroyed some communities Florida Senator Bill Nelson says the town of Mexico beach in Florida was completely leveled\nThere's no barrier island out there to protect the\nWhole force of the wind and the ... water that came and what you see our houses that are no longer you see\nThe concrete slab of the house and that's all that's left\nPresident Trump says he will visit Florida and Georgia next week to assess the damage from the storm as it passed through Georgia tropical storm Michael also devastated several states crops from member station WBUR a B. E. and Atlanta ties named Sean reports most of the damage was in southwest Georgia\nHurricane Michael or right before those in the states farmers had started harvest for the season specifically for the cons peanuts and cotton George's agriculture commissioner and Gary Black says he's not one farmers cotton crop in South Georgia\nIs are worth ... I have seen gotten that were being harvested yesterday it was an outstanding ... three by the lake or you can ... you know where the rest of it was harvested by the store\nState officials say at least fifty three poultry houses were also destroyed in five counties in southwest Georgia Georgia pecan growers experienced major losses last year during Hurricane Matthew for NPR News I'm his name Sean in Atlanta\nAnd West Virginia former state chief justice ... free that's been found guilty on charges of fraud witness tampering and making false statements to federal agents and save missed it chip West Virginia public broadcasting reports the trial is part of a nearly year long scandal that's engulfed the state's high court's lottery was\n... says by the store state officials say at least fifty three poultry houses were altered destroyed and five counties in southwest Georgia Georgia pecan growers experience major losses last year during Hurricane Matthew for NPR News I'm this name Sean in Atlanta\nAnd West Virginia former state chief justice on the law free that's been found guilty on charges of fraud witness tampering and making false statements to federal agents and Dave Mistich of West Virginia Public broadcasting reports the trial is part of a nearly year long scandal that's engulfed the state's high court\n... with some guilty on eleventh charges and not guilty on ten others the jury deadlocked on one additional charge the federal investigations them for more than three hundred and sixty thousand dollars worth of renovations to offer the Supreme Court office\nThe jury found the justice also use the resources for private gain including computers furniture and vehicles in lied to cover up his wrongdoing lovers will reasons in January and could spend the rest of his life behind bars one of the west Virginia justice pleaded guilty in August to a single kind of fraud he also awaits sentencing\nFor NPR News I'm Jay miscarriage in Morgantown West Virginia\nRussian officials are investigating the cause of this so use rocket breakdown which forced to to make an emergency landing about Ninety seconds after lunch the cosmonauts on board the rocket are in good health\nThe two crew members were heading print six month mission on the international space station when an emergency escape system kicked in and this is NPR News\n\nThe annual meetings of the international Monetary Fund and World Bank are wrapping up in Bali, Indonesia and Steve Wagner reports treasury secretary Steve Mnuchin and Federal Reserve chairman Jerome Powell had been getting an earful on President Trump's trade policies\nFinance ministers and central bankers from a hundred and eighty nine member nations have been discussing challenges facing the global economy and their focus has been on fractious trade relations as the IMF lowered its forecasts for world rose\nManaging director Christine Lagarde warned the global economy would take a significant hit if true dimensions worsen she or just the U.S and its trading partners to de escalate and fix the system not break it\nThe administration is not backing down it is raised tariffs on half\nOf China's five hundred and five billion dollars in exports to the U. S. added this annual gathering Malaysian warned Beijing not to devalue its currency to gain a competitive advantage\nFor NPR News I'm Steve Wagner\nRising tensions in the lead up to Brazil as presidential election had been linked to several of violent hate crimes according to the AFC news agency supporters of leftist candidate Fernando ... have been targeted\nIn one case a woman had a swastika carved into her flash by supporters of far right presidential candidate ... both in our\nBrazilian association of investigative journalism and it's also recorded more than sixty physical attacks on reporters both ... has been leading in the polls and Brazil\nI'm ... NPR News in Culver City California\n\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointment on line at home advisor dot com\nAnd it said I'm sick stay with us for a night of beautiful jazz here on K W CD point nine FM and K WC Don war\nYou knew from the ... crossing national area will present\nSupport for NPR comments from NPR stations or their contributors include home advisor matching homeowners with home improvement professional sport variety of ... projects from minor repairs to a major remodel homeowners can read reviews the local pros and book appointments online at ... dot com\n... stay with us for a night a beautiful jazz here I Can't eat all you see the point nine FM and can you do when you see John war\nTime you knew from the ... the national heritage area will present ... it'll be the Saturday starting at noon at the heritage library three fifty South Sudan avenue in Yuma for more information easy call us at night to wait three or four seven six nine zero\n\n[noise]\n\nOh\nNa na na na na\nDa\nNot in Manhattan\n\n\n\n\n\n\nThey\nPay\n\n\n[noise]\n\n\n\n\n\n\n\n... Oliver Lake in his big band from law would balance and bank bumping me against the wall\nAnd before the music from Cassandra Wilson ... silver pony that was titled the nice silver ... Cassandra Wilson on boys Marvin ... on guitar ... days\nHurling Riley on drums Jonathan but piece on piano lake um bomb a low low on percussion Ravi Coltrane on sexism mixed up we have music from Terry Collier from what color is low\n[noise] you're going to miss your candy main\nMm\nMarvin ... on guitar where'd you know beyond days\nHurling Riley on drums Jonathan but these are piano lake um Bible Lola on percussion Ravi Coltrane on that because all mixed up we have music from Terry Collier from what all of his lungs are you going to miss your candy me\n... ...\nMm do ...\nDo do do do you do need to be there to begin the meetings and we tend\nThe maiming you're buying marijuana\nAre there any American and my I mean even in your\nOwn a\nDo take\nThe Mr ...\n\nNot\nTo\nEast and the men\n[noise]\nShe she\n\n\nOf the bombs are buying a bottle", "show_name": "Best of the Village Jazz Series", "year": "2018", "city": "Yuma", "day": "13", "locations": [["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Parker", 32.7593, -97.79725], ["California", 34.68743, -116.78467], ["Georgia", 41.99998, 43.4999], ["Carolinas", 14.96655, 145.64914], ["Virginia", 38.34982, -81.63262], ["Florida", 28.75054, -82.5001], ["Mexico", 23.0, -102.0], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Georgia", 41.99998, 43.4999], ["Georgia", 41.99998, 43.4999], ["Atlanta Georgia", 33.749, -84.38798], ["South Georgia", 33.45876, -90.15081], ["Georgia", 41.99998, 43.4999], ["Georgia", 41.99998, 43.4999], ["Atlanta", 33.749, -84.38798], ["West Virginia", 38.34982, -81.63262], ["West Virginia", 38.34982, -81.63262], ["Georgia", 41.99998, 43.4999], ["Georgia", 41.99998, 43.4999], ["Atlanta", 33.749, -84.38798], ["West Virginia", 38.34982, -81.63262], ["West Virginia", 38.34982, -81.63262], ["west Virginia", 38.34982, -81.63262], ["Morgantown", 39.62953, -79.9559], ["Bali", -8.33333, 115.0], ["Indonesia", -5.0, 120.0], ["U.S", 39.828306, -98.5795], ["China", 35.0, 105.0], ["the U. S.", -14.60485, -57.65625], ["Beijing", 39.9075, 116.39723], ["Brazil", -10.0, -55.0], ["Brazil", -10.0, -55.0], ["Culver City California", 34.02112, -118.39647], ["South Sudan", 7.5, 30.0], ["Yuma", 32.72532, -114.6244], ["Manhattan", 40.78343, -73.96625]], "not_found": ["Hurricane Matthew"], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Arizona", "Arizona", "Arizona", "Parker", "California", "Virginia", "Florida", "Florida", "Florida", "Atlanta Georgia", "South Georgia", "Atlanta", "West Virginia", "West Virginia", "Atlanta", "West Virginia", "West Virginia", "west Virginia", "Morgantown", "U.S", "Culver City California", "Yuma", "Manhattan"], "out_country": ["Georgia", "Carolinas", "Mexico", "Georgia", "Georgia", "Georgia", "Georgia", "Georgia", "Georgia", "Bali", "Indonesia", "China", "the U. S.", "Beijing", "Brazil", "Brazil", "South Sudan"], "in_state": ["Arizona", "Arizona", "Arizona", "Arizona", "Yuma"], "out_state": ["Parker", "California", "Georgia", "Carolinas", "Virginia", "Florida", "Mexico", "Florida", "Florida", "Georgia", "Georgia", "Atlanta Georgia", "South Georgia", "Georgia", "Georgia", "Atlanta", "West Virginia", "West Virginia", "Georgia", "Georgia", "Atlanta", "West Virginia", "West Virginia", "west Virginia", "Morgantown", "Bali", "Indonesia", "U.S", "China", "the U. S.", "Beijing", "Brazil", "Brazil", "Culver City California", "South Sudan", "Manhattan"]}]