{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\nMy mother\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\nBut when when when\n\n\n\n[noise]\n[noise]\n\n[laughter]\n\n[laughter]\n[laughter]\nTemperamental instrument mastered their performance a from a corny one can Jacqueline de I'm In Baughman what's the soloist with the Academy of St Martin in the fields led by Iona Brown\nThis week on a special issue\nFolks of Mississippi US Senate seats are up for re election in the general election straight representative David barrier is trying to unseat incumbent senator Roger Wicker in Mississippi it's time for change there's also a special election to fill the remaining term senator beside conference see the second Amendment rights are\nVery important to me you've got to make sure that we can talk with right right I don't believe the government to micromanage on the issue of stuff's cuts are fan discuss friday at seven thirty pm on MTV TV\nStations have been Bebe music radio R. W. M. A. H. Biloxi WMA ... W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen on line at MVP on line or gee\n\nThe less traveled\nIt's an idea that intrigues me and if there's a choice to be made I one of those people who often chooses them less obvious option maybe you are to\nYou know picking them less popular thing [noise]\nWell that's what this music is\nYou see George ... wrote to Romanian route to these\nNumber one is really popular played a lot number two\nI guess which one this is [noise]\nI Hope you're going to like and it's coming up at the end of this hour [noise]\n[noise] [noise]\nMy name's Andrea bland good to have your company thanks for joining me this is part of ... string quartet\nMhm mhm mhm mhm [noise]\n\nMhm [noise]\n[noise]\n\n\nYeah\n[noise]\n\n\n\nThey just won the world series so to acknowledge that there is a post on the music and like Facebook page about classical music in baseball yes there can be a connection check out what our colleague Mark Jacobson has to say about that and listen to this\nTechno known since the number three played for you by the Boston symphony orchestra and ... ...\n... ... ... ... ...\n... [noise]\n\n\n\n[noise]\n\n[noise]\n\nMm\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\nOh\n[noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\nMm\n\nMm [noise]\n\n[noise]\n\n[noise]\n\n\n... ... New York a straw with music from problems is symphony number three the second movement I'm just now since conduct things\n\n[laughter]\n[laughter]\n[laughter]\n[laughter] and then the then\n[laughter] [laughter]\n[laughter]\n\n[laughter]\n[laughter]\n[laughter] [laughter]\n[laughter]\n\nI'm In a game\n\n\n[laughter]\n[laughter] [noise]\n[laughter] [laughter] [laughter]\n\n[laughter] [laughter]\n[laughter]\n\n\nKnow and make\nSome money\n\n\n\n[laughter] and then the thing\nAnd [noise]\n[laughter] ... ...\n...\nVery few pianist of ever recorded ooh a heightened piano sonata there's more than ... John ... is in the process of doing that and that was his performance a pianist and that's the number eight\nMusic now by the German composer Robin Folkman he knew both problems and children and\nHis music kind of fit somewhere in between the two I think here's the north west Germans philharmonic was an overture painful\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\nChallenge in Africa Romanian Rhapsody number two I don't know serious and introspective that was a Monte Carlo philharmonic what's Lawrence Foster conducting I'm Adrienne plane\n\nAt the globe is your home for the great American song what\nEach week I'll showcase the best in local chance in popular song the Nineteen thirties today from Frank Billy ... looks like Kurt Eli Dianne Reeves and great reporter Margaret chill out and spend some time with after low Sundays at six and BP music radio\n\n\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at MVP online dot O. R. G.\n\nIf you're one of those creative people who sits around waiting for inspiration to strike Chuck ... says you're doing it wrong [noise]\nGood morning I'm Jeff that's where the there is no doubt the Chicago ski wrote some they boast inspired music ever written but he always said the secret was having the willingness to beat you inspiration\n\nThey had the chance to hear some of ... is fired music coming up later this hour from the national symphony orchestra Ireland [noise]\n\nYeah it's one that passed the overtime for today's edition of the composers date book\nWell this is the composers date before October twenty nine I'm John Zach [noise] on today's date in Nineteen twenty three the comedy team\nWith Lauren Miller and Aubrey ... where the star attraction in a new musical they got written called running wild which opened at the colonial theater at Broadway in sixty seconds street\nIn their day Miller ... where the African American equivalent of Abbott and Costello where\nThe ruling party [noise] the plot of run wild\nLike many Broadway musicals of that day was flimsy to southern con men on the run head north to St Paul Minnesota but they find the natives too strange and the climate too cold so they returned home\nDisguised as famous spiritual [noise] about this plot provided an excuse\nFor comics get just to be sandwiched in between snappy song and dance numbers the latter invariably involving luggage show girls prior to opening night every one predicted that old fashioned love will be the shows big musical hits\nGood luck with habit a totally different dance number ... go to the show's supposed to be done [noise]\nJohnson called this tune Charles after the dark side hometown many recent African American immigrants to New York city west side [noise]\nDollars it traces back to the west side of Africa hours and hours on the answer to that\nWhatever source this catchy rhythm may junk famous rapidly became the signature to for the roaring twenties\nA decade of fibers bathtub gin and all that jazz\nComposer state book is supported by mongoose online test prep ACT\nSupport online prep smart go far destroyed the right at ...\nCom slash ACT\nComposers date to use the production of ATM\nReminding you that all music was one [noise]\nFormer bastard the king's music real voice exist simply number two from ... English concert\n\n[noise]\nMusic from Eighteen century England the second the eight known symphonies by William voice that was the English concert directed by her ...\nWhat's more great music is on the way Murray pariah plays a suite of Chopin piano piece as well so if you're the academy in Egypt music like when the Brandenburg Concerto spy you wants to Boston bar all that and more coming up hope you can stay with me\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise] I think all of ... orchestral sweets uh began life with the idea of being sympathies before they branched into another direction this is from ... orchestral sweet number to step in Sunderland conducts the national symphony orchestra of Ireland [noise]\n\n[noise]\n\n\n\n\n[noise] Mm\nMm Mm\n\nMm\n\n\n[noise]\n\nBut uh\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\nDo not\nBelieve\n\nIt\n\n\nOr\n[laughter]\nHe Mendelssohn ... insurance not often heard in the same work the clarinet and it should be the ancestor of the ... played by Daniel and Andreas Austin solver music budget which mental\nIn the west we have a concept that's called program music it's music that tells a story pictures an exhibition Peter ... will for good examples in Chinese classical music most every piece is a program that sells a story like this one called red flowers in blue\n[noise]\nTraditional Chinese met will be called red flowers in blue played by the Shanghai court yet\n[noise]\nNa\n\n\nNa na na\n\nNo\nNo\n[noise]\n\n\n\n\n...\n\nGo on what\n\n\n\n\n... or ... na na\n\n\n\n\n\n\nThe opening ... from Beethoven symphony number one but by the English chamber\n\nSometimes words are just not enough I'm Larry Gross gets mountain stage live performance radio from New York\nThat'd be Ninety seven on MTV music radio [noise]\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi debate you may ... ... you may you used\nTo be in the in Jackson W. M. A. W. ... W and may be struck W. M. A. V. I. W. M. A. O. ... check out what's happening on MTV music radio and listening on the line at him be be online\nOr gee\nYou might want to think twice before sitting down to a game of poker with the conductor you never know whether or not these bluffing [noise]\n\nGood morning I'm Jeff that's where they for many years Bernard hiking served as music director for the concern about workers drew in Amsterdam back in the Nineteen eighties the government threatened to cut funding for the orchestra hiking threatened to resign gets you won that yeah [laughter]\n[noise] but\nI think maybe it's conducting debut in Nineteen fifty for that age eighty nine we still going strong elite the concern about what the strip in music by bums coming up intend to\n\nNormally when you see the words can trigger grow so you're talking about music of the ... era but this one is from Bob squarely in the middle of the twentieth century they march finale from ... Williams concerto gr so [noise]\nNa na na\n\nUh\n\n\nI'm from I'm from Memphis buckle down\nNo no no no no no no no no no no no\n[noise]\n[noise]\nNo no no no no no no no no no no\n\n\n\nNo no\n[noise]\n[noise]\nAnd do something about the\n\nNumber [noise] I don't\nRun the finale from the serenade number two by on his problems the oil concern about orchestra conducted by Bernard hiking\n[noise]\n\n[noise]\nMorning I'm Jeff that's where the thanks for joining me for music today still to come visit from one of the late symphonies by heighten from the ... district also the New York ... some spots plays Sweden lighthearted when pieces ... bear\nFor most of the whole of my life I've always considered the heart sort of a women's instrument but like everything else like used to be a man's world a lot of famous Eighteenth the nineteenth century\nMale players here's a modern ... by the name of ... like the ... here's this arrangement of Spanish serenade\n\nThe [noise]\n[noise]\n\n[noise] Mm [noise]\n\n\n[noise]\n[noise]\n\nSo funny [noise]\n\n\n\n[laughter] we're just going\nTo do\nWith the\n\n\n\n\nConcert to each from a ballet the premier Paris Ninety nine years ago the three cornered hats for men will define the Chicago Symphony orchestra conducted by Fritz writer\nNewton ... who the menu is remembered as a virtuoso violinist or Castro conductor a venue when those local men with the great interest\nIn everything having to do with India and the menu was a large border bringing on yoga but Indian classical music to the west without you you menu and you might never heard of the downward dog eared rabbit Shankar for the better\nVenue when he was one of the violin players in this double concerto by dumping of double\n\n\n\n\n\n\n\n\nFrom a collection of violin concerto it was called let's throw our Monique Cocco music by Antonio to all the the ... to ... an orchestra the players were duty menu in and Leland Chen backed up by the polish cheaper\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nThe opening the bus from some of the number one hundred one ... the London symphonies ... projects to heighten that was the silver Modi or district conducted by Leonard ...\nLooking for a youthful perspective on classical music oh I'm going to Play Doh Lynch transcendental to number seven it's very exciting an energetic and their party parts of South Park and overall it's a pretty good [noise]\nNo further than from the talk joined me Christopher running for an anniversary see each week right here on NPR Saturday morning at nine on M. P. B. music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi debate you may ... ... you may you view\nW. M. P. in Jackson W. M. A. W. ... W and may be struck W. M. A. V. Oxford W. M. A. O.\nCheck out what's happening on MTV music radio and listen on line and impede the online dot O. R. G.\n\nAs it turns out some conductors how 'bout you more lasting legacy than others [noise]\nGood morning I'm Jeff trustworthy Fifteen or Twenty years after conductor George sell it passed on these and courage director of the Cleveland Orchestra lamented it still happens we play a great concert church so it gets a ...\nTowards building the Cleveland Orchestra into one of the great orchestras in the world\nAre so much the Clevelanders in one of the sharks are modern dance is coming up\n\nFrom the ... by labor delete here's the beautiful flowers do act\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\nSome instrumental music but those are much better known for his operas ... or ... or destroyed by a ton of doughnuts that'd be good to ... play the ... the Rios symphony orchestra\nSays listener supported classical music for your Monday I'm justice for the buddy you got to stay tuned\nGreat performance from violence James and this is on the white stuff was played for Chrysler June oh also a performance Rob guitarist recently off the injured reserve sidelines we'll hear some music played by me looks covered dog but later in the hour\n... workers to George self conducts here's one of the slow walk dances but often the divorce [noise]\n[noise]\n[noise]\n\n\nOne of the slow dances from the first set of those dances by ought to be into or truck that was the Cleveland Orchestra conducted by George so\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n[noise] well still to come this morning performances from trumpeter Wynton Marsalis and from a guitarist below ... car a dog which before we get to an Arab Copeland pieces written for a high school band\nFor Tripoli musician you end up with it they mentioned a pretty interesting looking passport stamps and the violence James Dennis play the costs are just to get the night in Kuala Lumpur Malaysia serious joined by pianist at birth Laurel for June bug Fritz Chrysler [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Jackson", "day": "29"}