{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n\n\nDecisive playing from the Norwegian chamber orchestra conducted by I own a brown Benjamin Britain's simple symphony which as you can hear is not that simple till I'm Andrea ... thanks for your company\nShallow me off I'm Indian Ocean hosted sounds Jewish every Sunday all present in quite the entertaining our Jewish music and usually comedy the jazz from New York you talk from Israel\nWedding dances from Europe devotional Jewish song American South\nWestern shop\nI Hope you'll join me on south Jewish Sundays at three PM on MTV music radio in the wind\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA ... W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck W. M. A. V. Oxford W. M. A. O. ...\nCheck out what's happening on MTV music radio and listen online at MVP online duck or gee\n\nAre you a morning person or a nice how\nAm I talking to you and the very early morning having been here all night so\nI guess it's safe to say that I Am a bit of both [noise]\nNow the composer Edward el ... also sort of have a disease that I'm at a bit on this question\nBeing a morning person our NATO he wrote two wonderful pieces\nOne cold night song\nMorning song [noise]\nDo you know which one misses\nGot about five minutes to the site and then all will be a\n\nLittle bit of early music now played by that the Iraq sold the waste in the eye to eye as the violinist in music by play for it and personal [noise]\n[noise]\n[noise]\n\n\n[noise]\n\nMusic by you on Christian box and the number ... played by the Academy of St Martin in the fields\nAnd the music to the next Facebook page I posted a pretty lovely musical cartoon about awesome and it just a minute how music from Estonia well his Disney's\n\n[noise]\n\n\n\n[noise] did you know by the Estonia and composer terrain yes creek this is ... ...\n... again and again you can get to the ... [noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] I'm\nLike I saw that one\n[laughter]\n\n\n[noise]\nNo no no\nNo no no [laughter] um [noise]\n[noise]\n[noise] [noise]\n\n[laughter]\nHow fantastic harvest music ... creek that was from his three folk song is called sing sing sickle performed by the Estonia in philharmonic chamber choir conducted by Paul ...\nDoes this listener supported classical music today's classical music is also supported by T Rowe price offering a stiff Egypt\nTesting approach that examines investment opportunities first hand institutions advisors employers and individual choose T Rowe price T Rowe price messed with confidence\nWhat's his name he shared divorce gift melody I think that piece was called a night and I was saying was played for you by the Prague symphony orchestra\nMusic on a smaller scale now this is by switch Chrysler originally a violin these days she's a piano transcription of meet the right or lumps joy mhm\n\n[laughter]\n[laughter]\n\n\n\n\n\n[laughter]\n[laughter]\nMm\nMm Mm\n\n\n[laughter] [laughter]\n[noise]\n[noise] mhm\nMhm Mm\n\nMhm [noise]\nMhm\n\n\n\n\n\n\n[laughter] [laughter]\n\n\n[laughter]\nMm\n[laughter] [laughter] [laughter]\n\n[noise] [laughter] [noise] [noise]\n[noise]\n[noise]\n[noise] [laughter]\n[laughter]\n\n\n[laughter] [laughter]\n[noise] [laughter]\nNo\nNo\n\n\nNo\n[laughter] [laughter]\n\n[noise]\n\n[laughter] [noise]\n\n[noise] [noise] [noise]\n\n\n\n[laughter]\n\n\n\n\n\n\n\n[noise] ...\nWow I'm almost like that better than the original really flamboyant arrangements for its Chrysler's leap is right or no joy if guinea ... once the pianist their\nFleet can change along the way in just a minute right here my name's Andrea Blaine it's so good to have your company this Monday morning\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n\n[noise] you know by ... ... temporary ... sorry but lived and worked in Paris player a composer and teacher wrote a dozen contaminants but the flu this is number eight Andreas doing in the summer\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[laughter] that from my ... was flipped concerto number eight hunch that my I conducted the meanings team for ... or ... or join once the flute Celeste I'm Audrey thanks for your company [noise]\nA great orchestra in full flight is the most amazing thing and simply can't let you experienced that thrill every week Hi this is Brian new house we touchdown and terrific orchestra towns Boston to San Francisco and get the best of Europe and Asia\nAll captured my income sympathy can from American public media Sunday Morning at ten on MTV music radio\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at impede the online duck or gee\n\nIt is the classical music equivalent of getting your picture on the cover of Rolling Stone [noise]\nA good morning I'm just those were the grammar stone magazine is a pretty big deal in the world is classical music with Rolling Stone is to rock and roll was down ...\nBeen around for a long time they build themselves as the world's authority on classical music since Ninety three phone magazine as recently unveiled\nTheir winner of the twenty Eighteen or just of the year [noise] you're recording from violent as Rachel plugging\n[noise] it is one minute past the overtime for today's edition of composers ... book [noise]\nThis is the composers they cook for a job or twenty seconds Jon\nGeorge ... candle is credited with inventing the organ concerto back in the ... century\nKendall was a virtuoso performer on the Oregon and as a special added attraction during the London performances of some of his biblical oratory ... one of handles can share those would be used as a kind of intermission feature\nDisturbed to showcase handle skill as an organist and perhaps to give a singer is a chance to catch their breath between sections of New York tore [noise]\nToday in Nineteen Ninety a very different kind of Oregon concerto premiered on a CBC Radio broadcast from the Calgary organ festival competition\nSnow Walker by American composer Michael Cole grass is cast as an impressionistic musical picture of the far north\nAnd the fortitude humor and spirituality of candidates needed any with people [noise]\n\n\nThe work is dedicated to hardly ... what's the author of never cry Wilkes a story of life in the far north may popular in the Disney movies\nHolding both cries from a trombone if you're in coal grasses score along with surging winds about polar landscape and vacations have in your throat singing Komen eating in a rambunctious dance finale\nIt's all a very far cry from Eighteenth century London but still in the tradition of handles virtuoso show pieces for a master organist\nComposers date book is supported by a goose ... online test prep for the ACT that's\nDesigned to boost scores students can get video lessons practiced question expert support online that's smart go far and enjoy the ride at ... dot com slash ACT\nSuppose your state book is produced by the American public media in conjunction with the American soldiers forum reminding you that all music was one [noise]\n[noise]\n\n\nIf you ever find yourself from that mission to seek out every available recording the multi ... seasons can sure does you're going to need to clear up a lot of space on your computer\nThat's a brand new one from grandma stone magazine ... teams are just of the year Rachel ... the boiling what's the break in spring from the four seasons spy Antonio ...\nInterest uncertain may was a mathematics professor turned conductor who founded this orchestra a hundred years ago this year Nineteen Eighteen years on certain ... and ... the last ... months to play Murray struggles burning song about gesture\n[laughter]\n\n\n\n\n\n\n\nMm [noise]\nMm [noise]\n\n[noise]\n\n\n...\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nSo what are the set of national dances about the English composer William old when he wrote a set of English dancers to set an Irish once and that was a suite of Scottish dances William opens music played by Gavin Sutherland and the oil about like ... yeah\nThere was a ... by you on the Boston box number two hundred eight it's all about the joys appointing there is however a peaceful part in that taught us that is a lovely melody that's come down to was with the title is she makes safely graves who's music you wants to Boston bar the pianist he's Angeles you\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise] [laughter]\n\n... ... ...\n... [laughter] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\nSomebody numbers dirty Jew Jew major by Scott I'm at the U.S Mozart Jane Glover conducting London Mozart player\n\nMBBS online dot org is the website where you can make your contribution to your public radio station here this week thank you so much for your health\nAnd you're helping don't believe this week because when you become a sustaining member at ten dollars a month or more to Mississippi Public broadcasting we will contribute on your behalf ten pounds up\nTo a local shelter up close Mississippi so your contribution watched doubling MPP online dot org\nStations have been ... music radio R. W. M. A. H. Biloxi it'll be in may ... ... you may you used\nTo be in the in Jackson W. M. A. W. we're ready to be in may be struck W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at him be beyond ...\nOh gee\nWell all I have to say is if it's good enough for Martin Scorsese it's good enough for me\nBut ... says he directed to one of the world's\nGreatest boxing films Robert Deniro stored in the story of Jay ... raging bull\nUse the new original music was all borrowed from the upper composer ... ...\nIt's probably the most famous of Moscow nice work the same as future met so it's coming up later this hour from the ... district\nClassical music on a Monday morning I'm sure if that's what he thinks for joining me today\n\n\nThere's a fine group of early music players the band is called uphold those banquets here to play a couple of students from John played ... English dancing master\n\n[noise]\n\n\nWell I'm not a [noise] [noise] [noise]\n\n[noise]\n\n\n[noise] na na na\nNa na na na na na na\nNa na\nNa na\nNa\nNa na\n\n\nNa na\nNa na na na na na na na na na na na na na na I'm [laughter] why not [laughter] not mad about that\n\nToday is the first day of the legendary pianist and composer from ... in the state the people who's like we just heard was ... when it was American students in Massachusetts boy named Arthur ... ...\n... books for the birds Sarah Nate Eugene corporate conduct in the north Texas treat players\nSome cheaper music we buy two artist\nSeparated by geography the pianist is from Argentina martial art reached the point when the ... the ... name is ... ... but really no language barrier there playing picked up in the second ... from Beethoven's spring summer\n\n\n[noise]\n\n[noise] Mm\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise]\n\nWell [noise]\n[noise]\nMm\n\n[noise]\n\n\n[noise]\n\n\n\nPianist mark our riches are in something of a reputation for canceling concerts at the last minute these days her contract says that for\nConcerts are always planned but never guaranteed a she was a present on time for bed recording worked hard Risch at the piano you don't Kramer violin like the second book from the violence in the first time the spring so not by Beethoven\n[noise]\n\n\n\nA baroque you're a tribute to the patron saint of the city of Paris the bells of St Genevieve by Moran my right by the early music samba cold the specter of the ...\nJust it'd be dirty was certainly one of the most prominent upper composers abs day a man whose life was living in music oddly enough dirty did not want any music played to the funeral I somehow doubt that his wishes were observed\nIs a rare piece of instrumental music from the upper master dirty little since Sonia played by the symphony orchestra of Milan\n\nKnow what\nI remember when I\nWas wondering what the number one number\n\n[laughter]\nNo no I'm not\n\n... what ... what what what\nA symphony but one that sounds very much like it could have been lifted from the music written for one of the wellness composers operas civilian sci major budget ... Verde though it was somebody bistro Milan conducted by Ricardo shy\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\n[noise] [noise]\n\n\n[noise] like I'm Jeff that's where they go out you could join the classical music on a Monday morning very well may well be the world's most frequently recorded one player talk was retired from the stage could still teaching the horn says playing a difficult piece on the Warren is like driving fast on the slick road\nYou're already does he was very check well in the Academy of St Martin in the fields with this worked the journal by human caught\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n... that's from the ... the number one the titan by Christopher smaller the Chicago Symphony orchestra led by Bernard hiking\nWhen you contribute to be the your financial support helps keep you be be grow groups on the air\nTo become a sustaining member we get ten dollars per month and the Beagle contribute to the towns of ... to to look at shelters around the country but you can go to your favorite social media network posted pictures of your pets not using ...\nPets is it in the ... the word play your support for him to be\nIn for your community stations have been Bebe music radio R. W. M. A. H. Biloxi there'll be a may ... ... you may you used to be in the in Jackson W. M. A. W. ... have you and may be struck W. M. A. V. I.\nW. M. A. O. green ... chicken what's happening on MTV music radio and listen online at him be be online or G.\n\nComing up this morning a musical souvenir from what nowadays is all last profession [noise]\n[noise]\nWell good morning I'm Jeff that's where the cussing one would have to go backwards in time to be fifty or sixty years\nBefore you could go to clubs but here the millionaire cry of cigars cigarettes to Peru Los classical music most famous appearance of the cigarettes girl it's from the sport by Edward law though the cigarette bulls coming up later in the hour from Monte Carlo storm on it [noise]\n[noise] [noise]\nThe smoke just you got ... if you'd never started don't start [noise]\n\n[noise] 'cause little modern or ... music from China part of a sweet called the ... said this is the dance of the twenty four murder may\n\n\n[noise]\n[noise]\n[noise]\n\nAh [noise]\n[noise]\n\n[noise]\n\nMhm\n\n\n\n\nMm mhm\n[noise] [noise]\n[noise]\n[laughter]\n\n[noise]\nNo no no\n\n\n\n\n[noise] that's missing from the civilian ever to be ... by height Rick ... bared north German radio so modern conducted by from ...\nMm\n\nBoston Baroque is one of America's oldest really music orchestras one of the mothers listed on their website is that they are striving for new messiah year after year\nTheir annual Christmas Time performances of handles messiah or sort of go to the event in Boston season begins on December seventh surprisingly as of last night's seats were still available\nHis Martin proven to lead Boston broke this time it's music from the very queen by Henry personal\n", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Jackson", "day": "22"}