{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\nTaxpayer in Seventy strengths were the English string orchestras by William how\nDry time is going to the dogs and cats were working with local pet shelters around the state to provide the pet food what do you become a sustaining member and contribute ten dollars per month MPP will contribute ten pounds of pet food shelter partners go to ... to make a contribution\nYour financial support helps keep quality radio programs on the air and help support local pet shelters around Mississippi that's empty be online dot org make your contribution right now\nThe stations have been ... music radio R. W. M. A. H. Biloxi W. M. A. W. M. A. you view the MP in Jackson\nW. M. A. W. Meridian W and may be struck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him BP on line or gee\n\n[laughter]\nI find that it's sometimes difficult to kids just one piece of music complete dean represents a composer\nNot but um\nYeah I usually find that kind of gas\nMuch ... takes everything that you might expect something like a bulldozer refunding EMTs and puts it into one sweet\nKathy these snakes [noise]\nThe most interesting things about the sarcastic one fashion after sweet I'm the music is that it's actually not their composer named more about that later this hour on the line\n\nGets gets excited and cast and that's\nWhy [noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\nMm\n\nMm\nMm\n\n\nNo no\nNo\nNo no no\nNo\n\n\nVery there at the end of music that can be some that was the city though they're not putting all the fan I guess the city of Birmingham symphony orchestras ... Romo and Stephen Hall was the piano they're very\nAgile stinkers green tea there too [noise] oh like\nSteak is a city that we talk about a lot to classical music and had so many great musicians who lived there for their buck Mendelssohn come to mind immediately it's one of the great centers of European ... music making in the nineteenth century too young Dennis composed and\nYou've got a [noise] would have been thrilled when Mendelssohn had got a second symphony born there in Eighteen forty four by the famous line to get help orchestrate here's the finale all that money\n[noise]\n\n\nYou\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise] well [noise]\n\n\n[noise]\n\n\n\n[noise] Beethoven king Steven over the true with the London symphony orchestra conductor by Michael ... Thomas [noise] now they're English orchestra now the English concert concerts rather with their conductor Andrew Mandy and music by cp ... you know\n\n\n[noise]\n[noise]\n\n\nMm\n\n\n\n\n\n[noise]\n\nMm [noise]\n[noise]\n\n[noise]\n\n\nThe chatter how sweet ... with the Israel chamber orchestra conductor die down in ... I'm Adrienne thanks for listening\nWe realize our listeners care about pets so we've come up with a win win idea for each person you signed up to contribute ten dollars a month to ... we will continue ten pounds a pet a twist shelter in Mississippi if you already supporting Bebe thank you you contributed additional sixty dollar gift will contribute to ten pounds in your name and if you contribute five\nHundred dollars to me at the pound it had been one thousand dollars means a hundred pounds your financial support helps keep indeed be programs on the air and help support local pet shelters across the state\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\n\nFor a decade or or the best fringe orchestra in the world was not from France\n\nSure if that's where they in the Nineteen fifties and sixties and the leadership\nWas from Motor City usa\nVoting off the trick is simply the orchestra with music friday manual sharp [noise]\n\nIt's one of the past the hour time for today's edition of the composers they ...\nIs the composers date book for October twenty third I'm John Zach Franco American relations somewhat strained in recent times had a high point on today's date in Nineteen fifty nine when the Detroit symphony under the eminent French conductor ... gave the first performance of this music by the eminent American composer Walter Piston\nPiston had studied composition in Paris with the famous French teacher not move on Jay the great French\nComposer ... so perhaps this was a very astute pairing up composer and conductor in any case to help celebrate the ... festival parade and the Detroit orchestra we're in Massachusetts for the premier of pistons three New England sketches\nThat are ... sweet whose movements were entitled to seaside summer evening and mounted piston said the programmatic titles serving abroad sense to tell the source of the inspirations reminiscent says even dreams that provided the otherwise musical ... of one New England composer\nPiston was born in Brooklyn Maine and Eighteen Ninety four taught for many years at Harvard had a summer vacation home in Vermont and died in Belmont, Massachusetts a Nineteen Seventy six\nSo we certainly was a bona fide New England the poster\nBut he wants to ask is the dust bowl more American than say a corner in the Boston at the Newseum\nWould not a ... village furnishes American background for composition\nHas the great plains\nEven some of the most striking hallmark uh pistons music remains it's quite cosmopolitan style and neo classical porn\nPerhaps of used to famous French teacher composers date book is supported by ... online test prep for the ACT it's designed to improve scores students can get video lessons practiced\nQuestions an expert support unlike PetSmart go far and enjoy the ride at ... dot com slash ACT composers date book is produced by Eighteen yeah American public media and the American composer sport remind you that all the music was once new [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\nThe abortion rights holder and the orchestra ... was the ... concerto but I'm also but nobody was there or to classical music on a Tuesday Morning I'm Jeff Foxworthy thanks for joining me to\nMeet you in the nineteenth century there were certainly many public concerts but there was another different kinds of music a much more intimate level the German shepherd a name for a house music was what was called chamber music can away here's an example of that the ensemble whole house was\nLike the finale some string quartet number one but mental\n\nMm\n[noise]\nMhm\n\n\nThere were\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\nAfter forty years or more in the ... the business that was the last one heightened would ever right deal when the ... is simply the number one hundred for Gerard shorts conducting the Scottish chamber orchestra\nThat\n[noise]\n\nSounds like a magic written or some ceremonial occasion some don't yet for for Trump it's an orchestra by yourself to really Adrian chancellor and the district cold last certainly see the bumps Hungarian Dances began their lives as a suite of piano piece as your restrictions\nLater you're three of them from the nurse German radio symphony\n\n[noise]\n\n\n\n\nNa\n\n\nNo no no no\nNo\nNo\n\nThree of the Hungarian dancers by Brahms John Elliott Gardner at the north German radio symphony\nOr your mom or dad well even issue not here's your chance to make a difference for each party she signed up to contribute ten dollars per month we'll contribute a ten pound bag of pets to a shelter in Mississippi now if you're already supporting the way to go but if you can treat me any mission of the dollar gift\nCountry town you're committed to make a difference today the number to call ... ... yeah that's one eighty three to four\nDecisions have been Bebe music radio R. W. M. A. H. Biloxi WMA ... W you may you view\nW. M. P. in Jackson W. M. A. W. ... W and may be struck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him be beyond\nRyan duck or G.\nElvis had his entrance music the blues brothers did to why not some interest music\nFor the gods debate you Norway\nAnd there's great adventure [noise]\nMorning I'm Jeff that's where they just as basic from the first of the rings psycho hoppers by regard Wagner\nThe entry of the gods into whole whole lot from tossed writing bowls coming up later this hour from the New York philharmonic\n\n[noise] now for something completely different\nHis is with the three traditional Chinese folk songs [noise]\n\n[noise]\n\nUm [noise]\n\n[noise]\n\n\n\nMm\n\n\n\n\n\nA new American studies at the University of Southern California here he is with the national symphony orchestra idol one step in Sunderland conducts music by ... [noise]\n\n\n\n\n\n\n[noise]\n\n\nLive\n\n...\n...\n[laughter]\nWho\n\n\n\nDo need\n\nYeah this is David Fraser noted modern interpreters music by John Sebastian Bach is often compared with the late Glen ... but I'm not exactly sure how David feels that David Freed the piano the German chambers storm ought to be opening a keyboard concerto by ... by\nThis next music takes us into the region salon seen post World war two jumper say wrote this in Nineteen forty seven this background music for Harris restaurant he called the speech the sooner we use songs groggy Jay serious but without wait\nIt's called the shepherds our [noise]\n\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[laughter] [laughter] [laughter] [laughter] [noise] [laughter]\n[noise] [laughter] [noise] [laughter]\n[noise] [laughter] [noise]\n[noise]\n\n\n[noise] Mm [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n[laughter]\n[laughter]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[laughter]\n[laughter] [laughter]\n[laughter]\n\n\n[laughter]\n\n\n\n\n[laughter] [laughter]\n\n[noise] [laughter] no\n[laughter]\n\n\n\n[laughter]\nThere\nSome French music around the middle of the ... century shepherds our by showing Francais in performance but he got to be on so\n\n\n[noise] [noise] well\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\nFrom Wagner is opera dust red and gold that was the entry of the gods into the hall from Sudan beta and the New York philharmonic\n\n... so why would you want to contribute to MPP during this week when when you contribute to Mississippi Public broadcasting you're contributing to a better insulin Mississippi whether that's children that are respected\nBy ... TV programming whether they're touched by our education outreach programs whether rigid dogs who are listening to news program here an MP be think radio you're making a difference with every dollar you get at M. P. B. online dart board that's M. P. B. online dot org ...\nStations have been Bebe music radio R. W. M. A. H. Biloxi that'd be MA visible W. M. A. U. U. W. M. B. in Jackson W. M. A. W. already W in may be struck W. M. A. V. Oxford W\nIt may oh ... chicken what's happening on MTV music radio and listen on line at MVP on line or gee\n\nA brand new century sort of demanded a brand new kinds of string quartets\nCould work I'm Jeff that's where they reached rebel and called to see\nWhat was their own shrink returns and put a few years of each other ruined the twentieth century these were really remarkable departure\nType I Wish that had been pioneered by heighten\nThe morning I'm Jeff that's worthy of classical music on a Tuesday Morning coming up to Julliard string quartets\n\nSome string music from my much earlier time a trio some other by our country look really performed by the personal courtship\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nDo that\n\n[laughter]\n\n\n\n[noise] [laughter]\n[laughter]\n\nOh\n...\nOh\nGod\nKeyboard that they bought the American composer Louis Morrow got truck called the ... may recall also done this Colombia Philip Morris was the pianist\n... European classical music is on the way but we're going to stay on American soil next this piece\nBut what are the earliest symphonic posters a native born American George whites feel Chadwick born in Massachusetts a Nineteen sixty four largely self taught there'll be audited classes at the New England conservatory it would later become its director\nThere is a music rather from the Seventy never to by George chat with me but you every conducts the Detroit symphony\n\n\n[noise]\n\n\n\n\nMaybe your feet and the Detroit symphony orchestra that was the second ... from the simply never to be a lot about the American composer George Wakefield shed\n[noise]\n\nDreams the priest was a noted American conductor a few years ago in his mid seventies as a black man in a wheelchair victim of polio\nJames overcame a number of obstacles in his career career took 'em all over the world series in Sweden James decrease conducts the ... most of the New York strip can this overture by ... [noise]", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Jackson", "day": "23"}