{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\nMm [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\nSome works offer a break to certain sections or a certain musicians in the orchestra the work you just heard ... not so much everyone has plenty to do in rebel ... think Louise sweet number two when you just heard proposal thereby the Rotterdam symphony orchestra ...\n\nMusic has been around you know that there's always more new interesting music if you know where to look the discovery never stops in young fans are excited snow the musical speaker [noise] one undertook some with connections between generations cultures\nRoots rock movies when you pop needed\nAll flus together\nOr bitter Sunday night at seven\nOn MTV music radio stations have been ... music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him Bebe on line or gee\n[noise]\nWhen was the last time you got up with the specific intent of greeting the sun\nIt can be a magical moment much liked this music\nThe composer behind it is John ...\nAmong the most ... pieces there's this one from a ballet called the white haired girl the section in particular welcomes sunrise\nYou'll hear performed by the China National symphony orchestra later this hour\nMusic to welcome a new day in much more coming up [noise]\n\nA sunrise is one of those things that I Believe it's better when shared especially between two people just a little piano music for to the watts from ... sweet for two pianos\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\nNa\nNa na\nNa\n[laughter] [noise]\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\nThey'll continue to grow so number six by George Frederick handle ... English concert\nJust as the sun was beginning to set on the life of handle things weren't getting started for Italian composer diminish ...\nHe found himself most comfortable riding opera there over eighty them they made this catalogue his the overture to one of his earlier ones it's called the fanatic for ancient Rome and [noise]\n[noise]\n\n[noise]\n\nUh\n[noise]\n\n\nClassical music inspired by classical room you just heard maestro Kevin ... the Toronto chamber orchestra in the overture to the fanatics for ancient Roman ... music composer ... ...\nA young one is common to hear this time of day right but what about aside a musical side by ... sits next\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n[laughter]\n\n\n[noise] [noise]\n\nThree pieces were orchestrated by Edgar ... ten and exciting and well tonight performance nearby the b._b._c. ... Monica under maestro poll Daniel\nIf you're up early to enjoy sunrise this next to work is perfect this is a tune called greeting the sun by composer young chick ...\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nThe symphony number for indie by Johan Christian boss the Eighteenth child and youngest son of the famous Johann Sebastian Bach I'm getting McQueen and that will be box tomorrow [laughter] hope you have a great day\nMississippi students are going to the polls this month to participate in a mock election for the upcoming Senate race teachers there's still time to register students for the promote the voter initiative which provides a variety of ways to learn about civic engagement if your school or classes already registered\nLet the voting begin deadline for submitting votes since October twenty six more information and it'd\nBe the online dot org ... by MTV and the Mississippi secretary of state\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot org gee\n\nI don't know very much about the composer Joachim Ross so I did a little digging last night\nIn a review of some of his symphonies her grandmother phone magazine the critics said\nIf his music falls easily on the ear\nIt can often go out of the other ear rather too easily [noise]\nI Know that doesn't exactly make you want to stick around so I'll add that looks mental sin and especially ... leaders and mentors to rocks and that in the end he was quite influential this morning let's try movement from a symphony he called winter I must say I was like [noise]\n\n[noise]\nThis is the composers date book for October Eighteen I'm John ...\nBack in Nineteen fifty eight the state of Minnesota was celebrating its centennial and they decided to commission a symphony in honor of being paid for\nWith so many Norwegians in the state\nOf the good idea to ask and what we could closer to write a Minnesota symphony [noise] better the high road ... [noise]\nMost distinguished composers that day who just been granted Norwegian Lakewood in New York state ... first class [noise] the Minnesota symphony was deep roots\nEight it's premier occurred in North Dakota tore him in Minneapolis today in Nineteen fifty eight with the Minneapolis symphony but by on top of the rotten [noise]\nCapacity audience four thousand gave Steve ... a warm welcome\nFor his part see Bruce was equally gracious and suggested his Minnesota symphony was meant to be not only an occasional\nCelebrating the settlements as Roosevelt Midwestern Americans face\nThe music intended to have more universal significant\nYou said my whole life has been a preparation for writing this work\nWith a map of Minnesota above my desk and look all my thoughts and feelings concentrated on Minnesota history\nI dived into the work\nProved decreasing we fascinating because I became aware that it was simultaneously growing into a history of mankind [noise]\nComposers big book is supported by ... online test prep for the ACT that's designed to boost scores students can get video lessons practiced questioned some experts support\nOn line prep smart go far and enjoy the ride at ... dot com slash ACT composers date book is produced by AP yeah American public media and the American composers for reminding you that all music was one [noise]\n\n\n\n\n\n\n[noise]\nOh\n\n\nYou're welcome Ralph was a late bloomer when it came to writing symphonies but when he got started he really stayed focused on that genre he was thirty nine when he broke his first symphony and sixty one when he wrote his last that was in Eighteen eighty three from that last symphony known as winter\nYou heard the second movement disability number eleven was about to radio symphony orchestra conducted by Mario ... Sagal\nThis morning's classical music is supported by Baird providing global financial resources in marketing expertise to clients the world over our W they're dot com has more information\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [laughter]\n\n\n\n\n\n\nHold them by our was a from a finch fridge family excuse me of music producing composers they were important for about a two hundred year span starting in the Fifteen hundred that was a village dance and it was played on the luge by Ron McFarland\n\n\nNo\n\n\nNo\n\n\n\n\n\n\nNo\n\nLet's stay in France but move forward a few centuries with the ... on like ... years blended military players James ... is the ...\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\nMm [noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nYeah the ... members of the sa ... music from Sweden that was the ... I wrote mine Melissa ... thing really\nShallow me all the Indian Ocean hosted sounds Jewish every Sunday you present the entertaining our Jewish music and usually comedy the chance from New York from history\nWhen he dances from Europe should Jewish stone American South\nYes sir\nI Hope you'll join ... Jewish Sunday three PM on the radio\nStations have been ... be music radio R. W. M A S H Biloxi there'll be ... ... ... you may you view to impede Jackson\nW. M. A. W. ... have you and may be struck W. M. A. V. I. W. M. A. O. green ... chicken what's happening on MTV music radio and listen online at ... be be online\nOr gee\n\n[noise] my father loves music and he was pretty ... he played the piano and had a sweet baritone voice\nI started piano lessons when I was seven and for the most part my dad stayed out of the way when I practiced but every once in a while he gives me a little advice on what he thought the character of the peace talks to be [noise]\n\nOne of his favorite catchy kids which sassy and looking back I'm sure he felt that this was a treat I could conjure up without too much trouble [noise] in high school when I was working on this ... turkey chair to say let's see I think that means more cash\nThey're\nNot the advice good morning I'm Melissa how things turned on the way to make it to or\n\nYour city and I think you'll recognize doctored up to it by Beethoven played by Alfred brindle\n[noise] [noise] [noise]\n[noise]\n[laughter]\n[noise] [noise]\n\n\n\nDon't know\n...\n[laughter]\n\n\n[laughter]\n\n[laughter]\n\n\n\nMm\n\n\n\n\nMm\nMm\nMm\n[noise]\n\n\n\nAnd arrangement of green sleeves performed by Ensemble Galilei these fourteen minutes past the hour new so what is it the Eighteenth of October ... Marcellus has a birthday today he's fifty seven\nEsperanza Spalding another excellent musicians thirty four today in sports [noise] Martina no ... is sixty two\n[noise] it was in the Eighteen thirties and forties set the waltz really took Europe by storm and in Vienna Johann Strauss senior and his sons lead the way\nThey walk to work faster and more likely than their predecessors and pretty soon the ball ... were full of dancers here's a very popular votes ... junior his voice it's spring\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\nThat was the piano folk opera orchestra friends that were toy so was the conductor and the music was the voices of spring waltz by Johann Strauss junior music for cello solo cello actually by Bach is on the way in just a minute with yo yo ma [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise] no\n[laughter]\nMm\n[laughter] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nHigh hill country not the happy memory for you with the pomp and circumstance march number one by Edward el guard that was David didn't at the Baltimore Symphony orchestra\nRight\nA great orchestrating full flight is the most amazing thing except for the cat lets you experience that thrill every week Hi this is Brian new house we touched down a terrific orchestra towns Boston to San Francisco and get the best to Europe and Asia\nAll captured my encounter ... from American public media Sunday Morning at ten on MTV music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi there'll be MA ... W you may you used to be in the in Jackson W. M. A. W. we're ready to be in may be struck W. M. A. V. Oxford W. M. A. O.\n... ... what's happening on MTV music radio and listen online at him be be online or gee\n\nI can barely a Swiss twenty four when he read a French translation of ... [noise] once he got his hands on to copy he couldn't put it down [noise] he went to the news in the theater in the street everywhere\n[noise]\nThat obsession led him to compose eight seems compounds which she sent off to go back on the response was not very good so he set the music it's time for almost Twenty years [noise]\nBy the time he went back to it too was long dead and barely ... reworked what he'd written into a dramatic legend that he called the damn nation of south [noise] coming up in five minutes in March that were thrown in the last minute good morning I'm ... ah\nThe ensemble framework pieces from the lovely park books [noise]\n... ... ...\n[noise]\n[noise]\n\nMm Mm\n\nMm\n\n\n\n\nMm Mm\nMm Mm Mm Mm\n\n\n\nMm Mm\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] no\nNo\n\nNo no\nNo\n...\n... ...\n\n\n\n...\n\n\n\n\nMm ...\n\n\n... Mm\n[noise]\n\n\n\n[noise]\nMm\nMm\n\n\n", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Jackson", "day": "18"}