{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\nMm [noise]\n\n\n\nOh [noise]\nThat's I've seen is there a third of all three number speak he's three about to tell the pictures dying away the philharmonic orchestra conducted I Jeffrey Simon we also heard spring that was the first one and the aggravation off the kings the second of those three to tally pictures\nInto music for centuries ago contempt rush into my\nEven contemporary every weekend Sunday corrupt you can hear a variety of modern performers treat the music as a living art form and put their unique imaginative stamp on music on the Eighteenth century\nToday about that and I hope you can join me for Sunday borough\nSunday Morning at six impede be music radio\nStations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte there'll be impeded in Jackson\nW. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at him be be online dot org gee\n\n[noise] have you ever thought of trading places with someone else\n[noise]\n\nI was little I wanted to be Scottish and I imagine trading places with my Scottish pen pals because an element of raided identity Senate\nThe composer Edward NATO was born and raised in France but he's most famous composition is this something spaniel it's full of Spanish sounds\nYou'd have to ... famous Spanish Brits also ironically moved to ... the young man I thought of himself as more French and Spanish they're going to hear the results of the Spanish and French crossed wires\nHalf an hour [noise]\n[noise]\nThis is music behind the bitter cold courts and number two you hear the ... so quite that\n\n\n\n[noise]\n[noise] did you find the race right now in the mornings some of the gesture played by the Minnesota Orchestra\nAnd then they ... only do\nWe change the pace drastically now lovers and Brahms music will often tell you that some of his most personal and revealing pieces are the ones that he wrote for the piano\nWhen you do just that the yourself now this is one of his ... cities for piano many pariah is\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n[laughter]\n[noise] [noise] [noise]\n[noise]\n\n\n[laughter]\n[laughter]\n\n[noise]\nMm\n[noise] Mm\nMm\n\n\nMm [noise]\nUm\n[laughter]\n[noise] mhm\nMhm [noise]\n\n[noise] [noise]\n[noise] oh not such a change of pace than from the previous run out of work that was the ... Rapid City with the pianist Mary pariah Rhapsody opus won Nineteen number for\nA Spanish the returns in about twelve minutes and to keep your music ... beaches back as well shortly\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\nMm\n\n\n\n\n[noise]\n[noise]\nCheaper music Palm Beach with me since I wrote the niche and ski from fragments segments retro ... [noise]\nHe's got this with composer got stuck and plenty of numbers six ... Michael Snyder conduct the real ... now\nThe warmer climate Edward ... but the French composer ... he admired the music of Spain put elements of it into this music which he calls ... ... he used to run to the west is ... ... [noise]\n[laughter]\n\n\n\n\n\n\n\nThat at the needs of cocaine team is that the Israel philharmonic orchestra led they met\nWith Edward law does something the Aspen yelled at random from that ... ... the amazing dining totally and it was just almost on the way as well is this time for the French one it's one of Mozart's compared to stick around to find out which one\n[noise]\n\n\n[noise]\n\n\nWell\nUh\nNo\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n[laughter]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\nMy my my my\nMy\n[noise]\n[laughter]\nWhen does it definitely has to find her movements have another ... ever I think when contention about three miles conducted the Israel Cincinnati David Joni when someone someone West I'm Andrea Blaine it's been a pleasure to have your company thanks so much for joining me\nThis is Chris daily inviting you to join me right here every Saturday for a prairie home companion\nWe'll be joined by the best musicians something you'll know when others you might not know yet but you know plus a bit of comedy I knew some of the week the powdered milk misgivings instant song request and if you knew surprises as well All right here each week on a prairie home companion Saturday at five on MP be music radio\n\nStations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood chicken what's happening on MTV music radio and listen on line at him be be online duck or gee\n\nJulius box marvelous Brandenburg can share those give us a glimpse into the evolution of modern or kiss real composition [noise]\nBack in the ... the concerto wasn't necessarily a virtuoso solo show ... as we think of it today\nThe word frequently referred to a work in which musicians perform in ...\nBrandon ... number three was composed for three violins three ... three cello space in hopes according to the upper strings service boats soloist at a company fluidly transitioning between roles wrote the piece\nIs Jay us box at his best\n\nThis is the composer staple of the day we celebrate the birthday of an American POWs name might not now but whose music you probably recognize him as a smile\nMe boy she named rarely appeared on our gang and law firm than I Do but his musical use the last ...\nWas she was born in ... Minnesota on today's dated Eighteen Ninety three by was already had accomplished in is that organization by Fifteen a professional ranger composer and pianist\nCompleting musical studies in Chicago in the company I'm able to go on Americans concert tour pioneered\nLike rebels does it scare\nIn Nineteen twenty three he joined us after the decrease talking on the company supervising their east coast recording session in Nineteen thirty he was appointed to make your musical director in charge of Hollywood, California activities\nAnd willingness to pass any that he wrote it oversaw the recording of music for the famous\nBut do you produce a lot of help looked studio [noise]\nNike forty five you back to New York and became the pistol contractor for the NBC Radio network\nYou worked closely with conductor are too skinny and even traveled with the famous Italian conductor which toscanini NBC symphony David Cross country tour Nineteen fifty [noise]\nThe way she retired in Nineteen fifty five\nWho died in Fort Lauderdale [noise]\nComposers day cook is supported by the goose online test prep the ACC that's designed to improve scores students can get video lessons practiced questioned the experts support on line\nSmart go far and enjoy the ride at ... dot com white [noise]\nSuppose your state is produced by a B American Public Media's inject you with\n[noise] [noise]\n[noise]\nMm\n\n\n\n[noise]\n\n[noise]\nMhm [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nNo blood in eastern style by Alexander gloves at all it was the St Petersburg string quartet\nThe sex work by Emanuel separate was one of his last major completed work so he said about this he had a piece that were what you hear the orchestrated version this is a little piano piece which I think it's quite amusing and which I have counted about one hundred Thirteen different ... should be bright and crazy\nYou\n\n[noise]\n\n\nMm\n\n[noise]\n[noise] [noise] [noise]\nWell\n[noise]\n\n... three by chance bucket was Lucy ... cologne led by writing her ...\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] music inspired by impressions of Spain the area from the images ... orchestra the second to the three orchestra images easily the most popular music but WC report by the ...\nMusic has been around you know that there's always more new interesting music if you know where to look at the discovery never stops in young fans which scientists know musical since the secret [noise] one hundred twenty some connection between generations cultures\nRoots rock bottom indie pop neither\nThe whole lives together\nI bicker Sunday night at seven\nOn MTV music radio stations have been ... be music radio R. W. M. A. H. Biloxi there'll be ... ... ... you may you Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be stuck W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MP be music radio and listen online at him be be online dot O. R. G.\n\nI'm doing composer myself type\nLiving in northern Italy Croatia early Nineteen forty\nA devout Catholic his great great grandfather had been Jewish\nDissipating trouble when the Nazis invaded in Nineteen forty three\nTaber gave manuscripts of his more serious music to an Italian physician friend today in Milan me [noise]\nHybrid was arrested deported die the dollars spent so December thirty first Nineteen forty four but his music remains safe with the immediate family who themselves had to flee when the communists took control of the region\nDecades later me get your son delivered the music personally the joy and fled to music director of the buffalo philharmonic\nAnd you'll hear some of that music later this hour [noise]\n[noise] the Austrian composer ... was a devoted fan of shoe box and composed in that style luckily he was also pretty stubborn following\nSounds no real reason to have all along with the changing musical styles of his day you can put three string quartets composed over about a fifth year period fifty years and they all sound kind of saying\nHere's the menu at from the string quartet number one [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\nYeah what we can do the the holiday is number six\nFamous music by she'll pets do you ever had to shut up he was up here and from the middle of the nineteenth century to some metallic and broke from luggage Eli you're on the right Lindbergh players\nAnd\n\n\n[noise] ... players can shepherd overnight a GOP for about ...\n\n...\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\nYeah that's a great overture that was a will see me from his wasn't opera il mature from the Italian girl in Algiers that was the national philharmonic orchestra\nWell remarkable story this next work and how this music has survived the composer more silk type or I did ... during the second World War the piper had managed to somehow deliberate manuscripts up his music to a friend named Milan meet each\nWhose son Enrico study music because the young boy what type so now ... decades later the elderly and Rico me teach boy taking lessons hand delivered type bricks manuscripts to Joanne ... in order to save this music to somehow find a way to let live on\nAnd along with the buffalo philharmonic orchestra and a whole lot of people behind the scenes they did just that over about five year period in the early to thousands and here's a sampling of what we gain from their effort this is the first movement from type of symphony number three\nRight\n\n\n\n\n[noise]\n\n\n\n\nNa na\n...\n... ... what do\nYou do oh\nNeed to go through but also was supposedly often seen in the audience of audiences of Mozart's opera is he was the son of a bricklayer coming from a true working class family and the overture to the Olympiad imposed a in shipping the navy for one of his over sixty operas [noise]\nIt was the check cheaper philharmonic orchestra and we close out the hour with the first ... concerto by regard stuff the third movement here her mom\nLike the White House [noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\nI\nA\n\nMan [noise]\n[noise]\n\n\n\n[noise]\n\n\nRight\n\nAround\nThe third movement from the horn concerto number one by record Strauss written when he was Eighteen that was her mom element like corn\nAttention all educators NPD has partnered with the secretary of State John Kerry who is\nThis year's promote the initiative to help your students learn important lessons\nAbout should they can gauge meant plan on having than in the classroom ditch African unity it's tricky to twelve students across Mississippi to gauge the ... election plush ours an essay contest for more information about promote the boat where did you sign up your class or school did you\nNPD on line ...\nStations ... music radio R. W. M. A. H. Biloxi debate you may ... W. M. A. U. Butte\nW. M. B. in Jackson W. M. A. W. ... W and may be stuck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him Bebe on line or G.\n\n[noise]\nNo I mean we\nHad to switch or good turned Seventy five this past summer he's been all over the world performing out a whole lotta pianos each one unique good says some you only have to play a few seconds and you realize you're going to be just fine very comfortable on average though usually takes a few hours and that's about all the time you get before\nPerformance [noise]\nOf course there are a few pianist who travel with their own instrument taking no chances but good says there's a certain interest and the sort of sporting feeling of trying to make friends with each instrument as it comes along and it would you can do\nA [noise]\nA word to well season for oh\nWho was here to play Beethoven this\nThis is some incidental music that from ... for a play called ... which premiered in ... in Eighteen twenty three\nRows of ... was brought up an income veto as a shepherd is by the mariners widow and the story concerns her attempt to reclaim per se role and this is the hunters course and it's the chamber orchestra of Europe along with the ... wire [noise]\n\n\n\n\n\n\n\n\nUm [noise]\n\n\n[noise]\n\n\nAm [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\nSwashbuckling that's the word that comes to mind when I hear that music the pope did do that from the ... by ... regal the ballet which premiered in Eighteen fifty six in Paris it's loosely based on board ... poetry or the pole in the course there\nYes swashbuckling spectacle about the adventures of the chief of course they're called rat who saves his blood in the door from being so it was the London symphony orchestra there and still I\nMean here at Seattle so not a part of the piano sonata by Beethoven and some music from you ever ... just to get\n\n[laughter]\nNo\n\n... number Twenty one by ... the Beethoven was composed and Eighteen all for it was dedicated to his good friend a patron ... volts the\nDistrict protector in bold than the one who arranged for Beethoven to study with hide in the other states you know that's why we call it that this is the third movement the fight all the the window and its pianist Richard good\n\n\n", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Jackson", "day": "02"}