{"month": "10", "state": "MS", "station": "WMPN", "content": "Singers of all ages young people and singers who have been with the crop for many years to experience this together and to understand\nA little bit just a little what the journey is of other people in another country and especially in South Africa to experience their journey and understand this from them and then to stand side by side and sing with them\nWill be an absolutely transformational experience we will walk away different people\nTo think so it's been roaming\nThe orchestras coming back on stage or now is Regina Monday church for the final moment of Beethoven's ninth\nPrincipal base Kristin ... has been looking forward to this moment more than any other\nSharing the music of Beethoven's ninth symphony\nIn our concert that were on this life together\nReflects Mandela's message\nUnity peace and harmony and I think that that\nYou know it gives me the shivers just even saying that but I think having this experience is\nIncredibly powerful for us for sure [noise]\nOf our concert beginning with\nBeethoven symphony number nine [noise]\nWhat was the joy the Minnesota Orchestra conductor by your sweater\nCoaching for joining the members of the Minnesota around\nSide by side multiple best to conduct Beethoven's ninth symphony find them\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\nMm Mm\n\n[noise]\n\n[noise] [noise] [noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\nMhm\n\n\n\n\nMhm\n\n[noise]\n\nMhm [noise]\nMhm mhm Mm [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\nMm Mm Mm\n\n\n[noise] [noise]\nUh\nOn a on\nA [noise]\nSo upset because\nThey don't speak people's [noise]\n\nGave you the best way to do with the\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\nOh\n\n\n\n\nAbout right now among the whole\nSwap deer center see a ... from\nThe baritone who jumped in my ...\nPrepared for the performance\nPieces from South Africa and these are mostly\nTraditional tunes that everybody here is to recognize immediately because those are the first one guy and he told us that are with South African recognize something they're going to sing along they might even dance along to keep you posted on how that goes with the traditional tunes dressed up for this occasion to new arrangements it starts with\nA couple of Zulu folk songs and they've been most together and this one is called two\nRoosters cruelly and these are folk songs one rooster crowing after another telling everybody to get up get on with your day gets started we have to get\nWould we have to get water we have to go\nIt cuts are coming to buy from sweater continue this also conduct members of the Minnesota Orchestra and acquires\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\nUh [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nUh\n[noise]\n\n\nOr [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\nFinal ... D printed broken pieces tonight to honor a new system in Minnesota Orchestra ... ... ...\n[noise]\n\n\n[noise]\n[noise]\nMhm [noise]\n\n\n\n\n\n\n\n\n\n\n\n\nMhm [noise]\n\n\n\n\n\n\n\n\n\n\n\n\nMandela you are the lawyer the weatherman you were\nThe war in the in the\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nThe one movement symphony number seven by ... ... with the Minnesota Orchestra\nThe times of London hail to the Minnesota Orchestra not ... complete survey of ... stay wrote with these recordings I smoke vents confirms his status as our greatest living civilian irreplaceable\nI'm Alison young you've been listening to the Minnesota Orchestra in the spotlight on symphony cast and the concert portion of Stephanie cast they were on a historic tours in South Africa we caught up with them in silhouette of South Africa music from the United states from Finland\nAnd also from South Africa some music written specifically for the occasion\nYou can listen again from our website just go to the symphony cast page and your classical\nThanks to producer Bradley all talk technical director Zack wrote an audio producer Michael Osborne and thanks also to brick wall east of the south African broadcasting company\nA pianist into the cast is produced by ... [noise]\nI'm Alison yellow fever again next time on symphony can [noise]\nThis is a pie and American public media sharing the power of classical music\nFor Twenty years the world cafe has been looking forward to what's next in music and keeping an eye on the richness of the past I'm David dye would live interviews and music you need to know about I mean you may have never heard before but I sure did lob the world cafe has become Public Radio's most listen do popular music\nProgram don't miss our next show but I tend to be be music radio\n\nStations have been ... be music radio R. W. M. A. H. Biloxi\nThere'll be MA boon bull W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line duck or G.\nToday in Nineteen fifty three at the ... music festival in Germany one of the most famous twentieth century examples of music\nFor the birds had his first performance this was a piece by the French composer Olivier messing up for what orchestra and title no they they did was do or the awakening\nThe birds [noise] musical themes for this work we're all based on missing precise notation of the songs of thirty eight different French bird [noise]\nThe pieces structure progress is from ... to ... stay with the bird\nIf you will awakening occurring precisely Cory I'm at the first like in the spring day [noise]\nEspecially on the crust of\nBird songs in nature is rooted in deep or the state\nSome I think is the grand rounds of my life\nI'm a believer so I think we're just got to those who have no faith\nBird song to those who dwell in cities that had never heard that make rhythms for those who not only military marches or jazz and the colors for those who've seen not composers date book is supported by a goose online test prep for the ACT that's designed to improve scores\nStudents can get video lessons practiced question experts support online smart go far and enjoy the ride at ... dot com\nSlash ACT composer state book is produced by a pi I'm American public media in conjunction with the American composer spore reminding you that all music was once new [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n... the first piece in the final book as a very yeah very grander scale sweet ... like two or three dances in one movement Jeanette singular piece ... he just loves Cole was conducted the Cincinnati Symphony orchestra\nOne writer describes Maurice rebelled deal as liquid poetry hound that description yesterday I was pretty yeah I think you'll agree to you'll hear rebelled Asia do in less than ten minutes\n[noise]\n\n[laughter]\n[noise]\n[laughter] [laughter] [noise]\n\n\n\n[laughter]\n\n\n\n\n\n\n\n\n\n\n\n...\n\nIf you know one member of the ... family is probably Francois that though is by his uncle it's a ... by Louis ... brand Andrew Lawrence king performed\nI've heard before that it's hard to be lukewarm about a ... you either love it or you don't I don't know if that's true especially when enterprising conductors and rangers take on a bright and create something new from it\nThat's what Peter Brian or did with the knocks else recording label few years back his focus was on Tchaikovsky this is an arrangement of some of the music from Tchaikovsky first opera boy a voter [noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise] one of five friends he was commissioned to write my small theatre in Venice early in his career was inspired by play called the marriage contract and truck you know ... took that same title for he's a ... version\nYour what your to the marriage contract by Russia the Christian vendetta conducted the project ... orchestra\n\n\nMm\nMm Mm\n\nMm\nNo no\n\n\n\nNo no\n\n\nThe\n\nMorning I'm Alina see Thursday treating you well if it's still too early yet there's like helps news that's rough edges it's the third movement from a search clarinet concerto [noise]\n\n\n\n\n\n\n\n\nMm [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [laughter]\nYou know Richard you a play called William Shakespeare that's music by ... cool our the Danish radio symphony orchestra performed with conductor Michael Schmidt is on\n\n\n[noise]\nWell Robert Frost two roads diverge didn't the yellow wood in sorry I could not travelled by [noise]\nThose words could well have been words to live by four composer shop we know\n\nWho knows to roads diverge off non Trump whose life\nWould compose music or when he pursue a life as a leader in this church\nAt points in his life was devoted to the church and talk for sure that's the path you take but then the siren song of music would call his name again\nWhat are the ultimately choose well music you know here's some of the Fifteen minutes [noise]\n\nAnd later a secrets marriage expose I'm Alina see good morning this is ... Corrine\n[noise]\n\n\n[noise]\nMm Mm Mm Mm\n\n\nMm\n\n\n\nMm\n[noise]\nMm\nMm\n\nMm\n\n\n\n[noise] affection from Bob ... by Ernest block that section called rejoicing Stephen ... cello Sam Haywood piano Joshua Bell violin\nAnd Joshua Bell and Sam Haywood are performing tonight in university park and Pennsylvania to recitals from Greek and pro coffee of there's more information that Joshua Bell dot com he is the music director of the Academy of St Martin in the field\nThey're on tour in Russia together next month\nThe Academy of St Martin in the field has conducted by its founder next to this morning's renewable Mariner here's a scare itself from Charlotte who knows symphony number one [noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n... by Alexander glad no one movements from glass announced Sweet Valley the name of the year he conducted the Scottish national orchestra\nIf you have a younger sister you know just how great they can be of course they can be frustrating to since they somehow seem to get all the attention younger sister who steals the spotlight he Domenico chi morose his comic gone for the secrets marriage she doesn't mean to of\nCourse they never do like she doesn't anyway the younger sister in this story is married\nSecretly and that section is the ... point around to the whole part of the opera which was a huge success and its premier in Seventeen Ninety to the opera is the secret marriage the composer and medical tomorrow so here's the overture\n[noise]\n\n\n\nMm Mm Mm\n\n\n\n\n\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n\n\nWell\n\n[noise] the greatest symphonic work ever composed in the United states so it's a reporter for the New York evening post road after the premier performance von ... symphony number nine from the new world that supports moves me from that simply ...\nThe Philadelphia Orchestra performs with conductor those ...\n\nNo\n\nThey all have turning points in our minds moments when for whatever reason our view of the world is changing\nMoments Wayne for whatever reason we change\nFor English composer in the ... branch one of those moments with the end of World War one\nWhen you're worried that the bridges whole perspective shifted and not surprisingly the sound of his music shifted\nEnglish maybe the devoted to never mean tunnel harmonies became much more interested in this election\nUp this morning something from the moment's peace framework Frank branch made that combination of chef\n... east coast cherry right in Fifteen minutes\n\nLater something glittery Ninety ... this is not glittery client had wonderful performed by any chance a clear you\nKnow\n\nA movie or\nMm\nMm yeah\nI'm Still a\nRaw do a too\n\nLong I lost my well\nA nationally\nOwner oh [noise]\nOh I see\nMy um\n\nWhere where do you\nKnow\nA little\n\nUm\n[noise]\n\n\n\n[noise]\n\n\n\nMade in Berlin and that's the name of band ensemble which features violinist reach in and tell us Stephen Collins who also composed and peace inspired by air except tea and truck you know real CD is called a new piece action\nFrom the U.S have heightened living and working at the after ... for decades was not what you'd call well tropical his music went everywhere though\nAnd some heightened French music comes your way in just over half an hour this is some very English\nMusic inspired by traditional English folk song Frank Bridge in Nineteen sixteen composed a new piece for string quartet this is a version for larger ensemble a Frank Bridges cherry right\n\n\n\nHe was string orchestras conductor where's your belt and arrangement for string orchestras of a pre apiece Frank Bridge composed four string quartet originally it's called cherry right\nCherries for breakfast sound pretty good I think fish for breakfast not not as appealing to me personally see what you think though when a musical trout flops year Wayne about twenty five minutes\n\n\nMm Mm\n\n\nIt's violinist pit gets to come in performing with the English chamber orchestra performance among twenty over all these violin concerto in C minor", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Jackson", "day": "11"}