{"month": "10", "state": "GA", "station": "WUWG", "content": "I saw thank you for listening to classical music on GDP come next time take care and they\n... and beyond fishy bb radio on line AGP be news dot org I'm Tom Barclay it's eleven fifty nine hope you have a pleasant evening will keep you company with classical favorites and we'll start Monday morning with MORNING EDITION at five AM this\nIs listener supported G. P. B. that means people who listen just like you're doing right now provide the most important an unreliable share of the funding that keeps the programs\nYou rely on and enjoy on the air\nI Am done Barclay and it's our fault sunrise\nAnd right now I Hope you'll join our public radio community\nCPB is stronger and better with your support quick\nAnd easy to give on line ... ... dot org for coal eight hundred to two to four seven eight and\n\nFrom the University of west Georgia Ninety point seven FM Wu WG paying to W. W. G H Street Gerald Ford of Georgia Public broadcasting radio network\n\n'cause people walking to a bare code would\nGrand staircase\nMoves along above tall oak trees ... waste pits cloud to obscure the radiance\nTo which they're blank black ... tips reach out\nAnd fully speak\nI'm Carrying a child's not by you know the trans figured and I\nLive from NPR News in Washington I'm Jim hawk NAFTA the north American free trade agreement will be a trial out or what Raman after all that's been turban jak reports us and Canadian negotiators struck a deal just hours before midnight deadline\nNews sources in Canada say there is a deal pending final approval candidate will sign on to the agreement already reached between the U.S and Mexico more than a month ago\nAnd he was sources in Canada say there is a deal pending final approval candidate will sign on to the agreement already reached between the U.S and Mexico more than a month ago a senior Canadian source close to the talks as the independent dispute resolution mechanisms stands\nCandidate will have a full culturally exemption and Canada will make what's described as modest concessions on access to its dairy sector\nWashington is also given some leeway on one of the more contentious issues President Trump's use of national security to justify punitive tariffs\nCandidate will get an exemption on his auto exports to the U.S the issue of steel and aluminum tariffs is still up in the air for NPR News I'm Dan carp and check\nIn Toronto California's governor has signed the country's toughest net neutrality rules and the law from member station KCPW Huey Ryan levy reports\nThe regulations and Mr Obama era rules that prohibited Internet providers from blocking speeding up or slowing down Internet traffic\nAnd from charging more for faster service the Federal Communications commission voted to repeal those rules last December and the author of the California law says with out federal support it's up to the states to in his words protect the Internet\nRyan levy reporting within hours of the signing the U.S Justice Department began a lawsuit to stop California's net neutrality law in March the latest clash between the Trump Administration and the state which has sparred over environmental immigration and other hot button issues\nThe Trump Administration says it is not micromanage during the new limited FBI investigation into sexual misconduct claims against Supreme Court nominee Brett Kavanaugh\nWhite House press secretary Sarah Sanders says the administration has allowed the Senate to dictate the terms and scope President Trump initially opposed the investigation but he and Senate Republicans agreed to it after fellow GOP Senator Jeff flake said he wouldn't vote to confirm without one\nNPR's Mara Liasson says right now Kavanaugh's nomination doesn't have enough Republican votes to win confirmation\nRepublicans don't yet have the votes but every Republican I've talked to doesn't expect the FBI investigation to turn up anything new even Jeff Flake said I'm a conservative he's a conservative I plan to support him unless they turn up something and they might\nNPR's Mara Liasson reporting rescuers are struggling to reach victims in several large coastal towns in Indonesia that were hit by an earthquake and tsunami and authorities fear the death toll could go way up at least eight hundred thirty two people are confirmed dead\nIn Asia that were hit by an earthquake and tsunami and authorities fear the death toll could go way up at least eight hundred thirty two people are confirmed dead but nearly all of those are from the town of pollute on the outskirts of the damage soon you're listening to NPR News in Washington\nThe ... Nobel Prizes begins Monday with the physiology or medicine prize\nThe gender gap will be one focused since the first prizes were awarded in Nineteen oh one eight hundred Ninety two individuals have received one by just forty eight of them have been women after the medicine prize on Monday the royals Swedish Academy of Sciences will announce the Nobel in physics on Tuesday and in chemistry on Wednesday\nThe by an annual writer cup international golf tournament wrapped up Sunday and France as Jake's that gather all reports from Paris European golfers of taking back the title from the United states\nItalian golfer Francesco load of an audience of the winning point for Europe within victory over American Phil Mickelson\nMickelson conceded actress tee shot went into the water on the sixteenth whole of the albatross course at the Gulf nastier now outside Paris\nAfter Europe dominated Saturday morning session the U.S team led by Jordan's faith and Justin Thomas played well enough in the afternoon to stay in the running for the when\nArabs started the final round with the ... fleet in the U.S came close to victory taking three of the top five single matches to draw within one point\n... Olsen of Denmark took his match against these in Spanish golfer John rom defeated superstar Tiger Woods and a pivotal match Romney said it was the best feeling in his life for NPR News I'm Jake scanner oh in Paris\nAt the weekend box office the comedy night school made its debut at number one the animated small foot came in second the house with the clock on his walls came in third followed by a simple favor\nI'm Jim ... NPR News in Washington\nSupport for NPR comes from Americans for the arts committed to transforming America's community through the arts and arts education supporting the nonprofit arts industry which employs four point six million people nationwide learn more at Americans for the arts dot org\n... and ... I'm Glad you're here thank you for listening to talk ... ... we're going to hear next to his great gory in chant\nThe snake Kristen the composer at the peace we're going to hear next to his Gregorian chant its performance features the New York chamber orchestra a performance conducted by Arthur early\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nStory of a trans figured at night now a woman taking a walk with her blood confesses to him that she's carrying a child and it is not his child\nBut tonight trans figured as he says I Will love this child as my own and their life begin together right down here the trends figured night with the least of ... and the ... music by our culture and bank\n\n\n\n\n\n\nCan be geared night by Arnold checking back we had ... Lewis and challenged at least ... front and center\nFor anything in tonight's music we Bruce lending scan piano for me ... metamorphosis ...\n[noise]\nHis members to poor did keep ... be wearing a T station radio network you can listen online at ... dot org and you can find us on Twitter at my ... and Georgia Public broadcasting on Facebook thank you for listening\nYou for too many to listeners supporting ... followed by Dr when we all joined together to keep the\nBroadcasting on Facebook thank you for listening\nThank you for tuning into listener supported G. P. B. it's our fault fungi when we all joined together to keep the programs that you're listening to enjoy on the air right here on the TV\nI'm Leah Fleming inviting you to join us at the G ... dinner with a convenient affordable monthly contribution it's easy for you and if ... you can also make a one time gift to report what counts most is that we hear from you right now and go to ... dot org and click on donate our policy that eight hundred to two to four seven eight\n\nFrom the University of west Georgia because Ninety point seven F. L. W. W. G and W. W. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\n\nOoh\nBecause those are his music was an amazing organ\nHe was born was perfect pitch and he gave his first public concert at the age of just\nHe was also fascinated with science and travel and wrote essays poll reviews\nHundreds of pieces as well the only a handful of those pieces of music are well known\nWhat does the music of someone so diverse and gift it\nYou hear what some of it sounds like in just\nHalf an hour right here\n[noise] live from NPR News in Washington I'm Jim ... the Supreme Court is back in session Monday but with Brett Kavanaugh's nomination still up in the year only eight justices will be on the bench NPR's Nina Totenberg says that raises some interesting issues\nThere are quite a few very important cases pending in front of the court that it has not yet decided to hear\nAnd interestingly the court has already put off any decision on whether they will hear those cases so so the kinds of cases that are big five to four cases very often [laughter]\nWhether it's illegal or unconstitutional to discriminate against gay people in employment for instance that signed up\nVery often [laughter] whether it's illegal or unconstitutional to discriminate against gay people in employment for instance that's on the potential DACA but it has not yet been granted by the court what has been granted are a bunch of cases that are\nVery important or they could be very tiny procedural steps one way or the other\nNina Totenberg reporting dozens of people protested the high cost of insulin outside the ... headquarters in Indianapolis on Sunday Bram Sable Smith reports Eli Lilly is one of three manufacturers have been stolen and the only one located in the United states [noise]\nHis parents have been going has more than doubled since she's asking twelve alone a\nSingle ... the lifesaving hormone costs more than two hundred and Seventy five dollars without insurance those type one diabetics you need insulin to live in several ... a month organizers of the protests like Elizabeth Easter founder of the nonprofit T. one international said those prices put into and out of reach for many Americans\nAnd sun it's kind of face at the track pricing crisis in America because\nWe literally die without it we're fighting for our lives\nThe protesters also called on Eli Lilly to be more transparent about how much it cost to make one vial of insulin and Eli Lilly declined an interview request for NPR News I'm Bram Sable Smith in Indianapolis\nCar explosion that Ron downtown Allentown, Pennsylvania has left three men did\nThe blast could be hurt for blocks around the city's downtown sports arena with car parts and body parts drone around the white area Lehigh County district attorney Jim Martin says the Federal Bureau of Alcohol Tobacco firearms and explosives is leading the investigation\nWhere you have a high degree of\nRegret it was probably\nBesides ATF the FBI is also assisting the investigation authorities release no information about the possible causes of Saturday nights blasted including whether it was a bomb\nA referendum on changing Macedonia is name one overwhelming support Sunday but low voter turnout highlighted the hurdles that still remains for the Balkan nation to join the NATO alliance\nOver Ninety percent of voters approved changing the country's name to North Macedonia the agreement now needs to be approved by Macedonia is parliament Greece than needs to ratify it\nThis is NPR News\nA group of migrants who were stuck at sea and bad weather for five days of arrived in multiple after being transferred to a Maltese naval vessel from us\nA group of migrants who were stuck at sea and bad weather for five days of arrived in Malta after being transferred to a Maltese naval vessel from a humanitarian rescue ship the multi is government says the fifty eight passengers will now be relocated in coming days the France Germany Spain and Portugal\nJust hours after California Governor Jerry Brown signed legislation on Sunday to restore open Internet productions known as ... neutrality\nThe Trump Administration began a legal challenge the Federal Communications commission repealed the rules last December marking a win for Internet service jobs like Comcast Eighteen and the and the rise in\nMajor league baseball's regular season was supposed to end Sunday but ties top two divisions mean the regular season will be extended for one more day good Huey these Ryan levy explains\nThe Los Angeles Dodgers and Colorado Rockies finished the season tied atop the national league's west division setting up a tie breaker game on Monday the winner will take the division and get to host a first round series against the Atlanta Braves the loser left to go on the road for a playoff game against the loser of Monday's second game\nThe Chicago Cubs and Milwaukee Brewers tied for first in the national league central so they will also play a tie breaker the winner will have home field advantage threw out the national league playoffs the loser will be one game away from elimination\nThis will be only the tenth season since Nineteen sixty nine that uh one game tie breaker has been needed and the first time that two such games are necessary for NPR News I'm Ryan lady\nI'm Jim hog NPR News in Washington\nSupport for NPR comes from the Charles Stuart my foundation supporting efforts to promote adjust equitable and sustainable society and it's home town of Flint, Michigan and communities around the world or at ... dot org and that listeners who support this NPR station\n\n[laughter] thank you very much for joining me my name's Andrea ... I've got a bit of a cold I think you can hear that I Hope it doesn't bother you too much\nAnd I hope it holds out and the voice that is for the rest of this hour on music for you great music coming up as well as food can tattoo on the way and just a moment there is a main night overturned by risky costs enough and I know we're not anywhere near name but the music is just wonderful [noise]\nMusic is a ... concerto by Romano ... Keno and it's going to be paid for you by teams\nYeah but the music and wonderful\nMusic is the ... concerto by Romano PS two Keno and it's going to be played for you by team's goalie it's about forty years since he left of the Berlin Philharmonic he was principal flute born in Belfast quite an extraordinary trajectory of a career for a musician\nHe went on to pursue a career as a solo artist she made a huge number of recording as you know they of course is one of them used to lift even at the is conducted by cutting ... ... ... ...\nJust James go away with established even as the music by Romano pitch and teen oh that was the concerto kids she set her up ahead it's me and it's nighttime\n[noise]\n\nYou know by ... opera called me night it's based on a story where character wants to marry but the trouble is opposed by his own father the queen of the water Sprite steps in and it's a happy ending here's the music the overture\n\n\nMore\n\nOh oh\n\n\n\n...\n\nNa na na\n\n\nWell well\n\n\n\n\n\n\n\n\n\n\n...\n\n\n\n\n[noise]\n\nThat can be so sounds and Ernie symphony play by the mellow ... orchestra\nPitches member supported G. P. P. we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nOne recent highlight conduct you're describing the stresses the thinking\nReally tricky music and you got to get to the end of it touched that that final campaign crash and the big explosion of the Death Star happened up the right moment\nReally tricky music and you've got to get to the end of it such that the vinyl Tam Tam grass and the big explosion of a death or happens at the right moment [noise]\nYour support inside the music you hear the\nCPB dot org and click giving\n\n[noise] from the University of west Georgia Ninety point seven FM Wu WG and W. W. G. H. G. Carroll that part of Georgia Public broadcasting radio network\n\nOh [noise]\nIt's an expression we use when we're reminded of something that we merely forgot or something from long ago [noise]\nFrom any violence state funding Leopold our\nIs a definite laughed from the past [noise]\n\nGo to the most important violating teachers ever many violent students still struggles with king exercises [noise] and [noise]\nOur himself as a wonderful player\nConcerto by his settled Russian Alexander glass enough was dedicated to him [noise]\nTonight [noise]\nLive from NPR News in Washington I'm Jim hawk NAFTA the north American free trade agreement will be trying lateral agreement after all it was Dan ... reports us and Canadian negotiators struck a deal just hours before midnight deadline\nThere is a deal pending final approval candidate will sign on to the agreement already reached between the U.S and Mexico more than a month ago a senior Canadian source close to the talks as the independent dispute resolution mechanism stands\nCandidate will have a full cultural exemption and Canada will make what's described as modest concessions on access to its dairy sector\nWashington is also given some leeway I'm One of the more contentious issues President Trump's use of national security to justify punitive tariffs\nCandidate will get an exemption on his auto exports to the U.S the issue of steel and aluminum tariffs is still up in a year for NPR News I'm Dan carp and track in Toronto\nFor the weekend California Governor Jerry Brown science cerebral\nSteel and aluminum tariffs is still up in the air for NPR News I'm Dan carp and check in Toronto\nFor the weekend California Governor Jerry Brown science several new bills into law that were born out of me too movement\n... from member station ... in San Francisco reports the new laws are focused on women in the workplace\nThe laws including ban and confidentiality agreements in secret settlements in cases involving sexual harassment or discrimination\nAnother requires corporations based in California have women on their board of directors in a rare signing message Browne acknowledged flaws in opposition to that bill that writes that quote recent events in Washington DC and beyond make it crystal clear that many are not getting the message\nOn his letter copy the U.S Senate Judiciary committee which is considering judge Brett Kavanaugh's nomination to the Supreme Court for NPR News I'm Sarah Varney in San Francisco\nLawmakers in the west Virginia Senate are set to act as jurors in the trial of a first for impeached state Supreme Court justices has Dave Mistich of West Virginia Public broadcasting reports the impeachment trials are the first in those states since ... Eighteen Seventy five\nJustice Beth Walker was named and only one article impeachment adopted in August by the house of delegates that article names all the justices collectively for failing to one another accountable and failing to provide administrative oversight senators need twenty three thirty four votes to convict and remove a public official from office\nThey must have been reporting one was hurricane Rosa we go into a tropical storm late Sunday with Winslow into sixty five miles an hour as it heads towards northwestern Mexico and the southwestern us\nFlash flood watches are posted through Wednesday for areas including southern Nevada southeastern California parts of Utah and the western two thirds of Arizona\nHeavy rainfall cars at Las Vegas Phoenix in Salt Lake City with possible flooding and slept Kenyans Rosa is centered about two hundred miles southwest of point to Eugene and Mexico is heading north north east at twelve miles an hour [laughter]\nThis is NPR News\nAbroad group of Catholics in France is calling on the French Parliament to investigate sexual abuse and the Roman Catholic Church Jay ... reports from Paris\nThis month a report commissioned by the Catholic Church in Germany revealed more than thirty six hundred victims had been abused between Nineteen forty six and twenty fourteen now French religious leaders former government ministers lawyers and\nRevealed more than thirty six hundred victims had been abused between Nineteen forty six and twenty fourteen now French religious leaders former government ministers lawyers and victims are behind that petition asking French Parliament to open an independent investigation into abuse in the Catholic Church\nIn a statement to ... falls pass the author said the only a parliamentary commission can shed light on the past to prevent things from happening again\nBoth the archbishop of the Paris and huh I've told French media they support investigations if it will bring closure there's recently been more focused on abused and the Catholic Church in France in twenty sixteen Leone archbishop affiliate Bob around was charged along with six priests for covering up cases dating to the Nineteen eighties\nFor NPR News I'm Jake ... in Paris\nThree men are dead after a Pennsylvania car explosion which is being termed a criminal incident by the local district attorney the explosion in Allentown as being investigated by the Federal Bureau of Alcohol Tobacco firearms and explosives\nThe FBI and local authorities are assisting the blast occurred just a block from Allen towns PPO center sports arena\nDistrict attorney James Martin telling reporters at a news conference Sunday that there is quote a high degree of confidence the perpetrator was probably killed them against the authorities are to confirm whether a bomb was involved I'm Jim hawk\nNPR News in Washington\n\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight ws dot ORG and the listeners who support this NPR station\nNew airplane it's great to have your company thank you so much for joining me\nThat his music through the night and what better music to play it and no ... music\nAnd we hear the word knock turns we most probably think of Frederick Chopin and the wonderful pieces that he wrote under that title but the friendship those are from the ... wrote wonderful now turns to this is a selection of those now that's a pianist Paul ...\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n\n\n\n\n\n[noise] [noise]\nMm Mm\n[noise] [noise] [noise] [noise] [noise]\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\nOrioles\n\nTo be peaceful piano music seems to know what's next turned oh constantly wants to be honest now she's feeling a bit chilly\nPiano music by from these criminal ... was a selection of a knock turned oh Crossley wants to be honest\nNow if you're feeling a bit chilly that's common enough thing at this time of year it is October or very nearly but to its deep tomorrow for the composer living arson and you hear the music that goes with us in just a minute\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nThe ... the writer\nOr\n\n... and ...\n\n\n[noise]\nWell [noise] [noise] [noise] [noise]\n...\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n\n\nGot enough of the leading force in promoting classical music that incorporated Russian elements such as members\nSupported TPP we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening distance listener\nSupported TPP Hi there I'm Ricky ... inviting you to join the public radio family listeners like you who value G. P. V. as a source of news conversation and entertainment make the programs do enjoy possible that's precisely why we're coming to you now during or fall\nFund rise please go now to G. P. B. dot org and clicking donate at the top of the page or call us at eight hundred\nI fully why we're coming to you now during our fault find rise please go now to cheat TB dot org and clay can donate at the top of the page or call us at eight hundred to two two forty seven eighty here support right now in any amount is so important and banks\n\nFrom the University of west Georgia Ninety point seven FM Wu WG pained W W G. H. B. Gerald Ford of Georgia Public broadcasting radio network [noise]\n\nHow on earth do you begin to make an opera [noise]\nWell in the case of this work ... Copeland open the book of evocative photograph of [noise]\nCourse sharecroppers in the southern states [noise]\nThe basis of this story\nFor the music well\nThat was up to Copeland and his cast\nAlto tenor bass and the Mets soprano [noise]\nTitle of the work is the tender land [noise]\nYears through the music summit laser them\nI mean for the night\n\nLive from NPR News in Washington I'm Jim ... in Indonesia preparations are underway to bury hundreds of those killed in friday's earthquake and tsunami on the east central island up civil way see as Michael Sullivan reports the death toll from a twin disasters now stands at more than eight hundred thirty\nIndonesia's president job I Would do toward the hard hit city of ... on Sunday where the majority of the confirmed deaths occurred said rescuers are having trouble reaching survivors in part because of a lack of heavy equipment we have to do many things soon he said but conditions do don't allow us to do so\nMedical supplies food and water or immediate concerns\nPower and communications with several affected areas have yet to be restored\nAnd authorities fear they'll find many more dead when they reach several areas closer to the epicenter of the magnitude seven point five quake in Palo dozens of people are still believed to be trapped under the rubble of two hotels and the law that collapsed during the quake at least five foreigners are among those missing\nDozens of people are still believed to be trapped under the rubble of two hotels and the law that collapsed during the quick at least five foreigners are among those missing\nFor NPR News I'm Michael Sullivan in Bangkok\nFirst lady Melania Trump is setting off on a weeklong tour of the African continent NPR's Eyder Peralta reports this is her first major solo international trip\nFirst lady Melania Trump is scheduled to visit gonna Malawi Kenya and Egypt Trump will visit schools and hospitals and learn about programs funded by the U.S in a recent speech at the un Trump said during her domestic travel she has seen many great programs that help American children\nAnd I believe we can adapt to a cage many of those programs oversees\nThe Trump Administration has had a rocky relationship with the continent the president has been reported speaking disparaging Lee of some of the countries and the last top official to visit the continent former secretary of state Rex Tillerson was fired at the end in historic ... NPR News Nairobi\nNobel Prize winners are being announced in Stockholm and Oslo over the coming weeks Teri Schultz reports the words are dealing with criticism this year over the number of female recipients as well as a sex scandal in the Swedish Academy\nThe rollout of Nobel Prizes starts Monday with medicine Tuesday is physics and chemistry on friday the much anticipated peace prize will be awarded\nThe Nobel Committee does not disclose the names of the three hundred and thirty one peace prize nominees but has revealed about two thirds are individuals one prize will be missing this year literature the Swedish Academy that chooses the winter has been incapacitated by allegations of sexual abuse committed by the husband of one of its members\nAn investigation and shake up of the institution forced it to postpone this year's awards he's currently on trial for rape\nThis scandal is also highlighted gender disparity India wards of the eight hundred Ninety two individuals who've received a Nobel Prize is just forty eight have been women for NPR News I'm Teri Schultz\nListening to NPR News in Washington\nCalifornia Governor Jerry Brown signed the nation's toughest net neutrality measure Sunday requiring Internet providers to maintain a level playing field on line\nThe move prompted immediate lawsuit by the Trump Administration the U.S department of justice wants to stop the law in its tracks arguing that it creates burdensome anti consumer requirements that go against the Trump administration's approach of deregulating the Internet [noise] Chicago\nTracks arguing that it creates burdensome anti consumer requirements that go against the Trump administration's approach of deregulating the Internet [noise]\nChicago blues legend oldest rushed died Saturday he was eighty four NPR's Eric Westervelt reports that guitarist influenced the likes of Eric Clapton Stevie Ray Vaughan and the band Led Zeppelin oldest rush help define Chicago's electric blue sound and the Nineteen\nFifties sixties with it I Can't quit you baby all your love I miss loving and from\nRussia's\nReally left handed guitars drunk upside down below ... at the bottom of the cat he helped him and no two ways you other blues guitarists Eric Clapton told me and a twenty fourteen interview was something about that ... has\nHad a call ... ... and the oldest rushed to come to complications from a stroke you suffered in two thousand three Eric Westervelt NPR News\nAt the weekend box office the comedy night school made its debut at number one the animated small foot came in second the house with a clock on his walls came in third followed by a simple favor\nAnd nine [laughter] I'm sure mark NPR News in Washington\nSupport for NPR comes from the NPR stations or their contributors include the Annenberg Foundation committed to supporting educating and engage in communities and the United states and globally for more than twenty five years learn more at Annenberg Foundation dot org and the corporation for public broadcasting\n[noise] had morning and You're welcome to the music my name's Andrea Blaine hope everything's good with you I've got a little bit of a cold and that's coming across and the voice but so far so good [laughter]\nAnd we know that music is all about relationships or very often about relationship and I think it was really true with Mozart when he was\nThe head in Seventeen eighty four by an Italian composer cultures that the party\nMozart took an a liking to him straight away thirty is a good honest fellow Mozart wrote I have played a great deal to him and composed and variations upon an air of heads which please Tim exceedingly well I'd be happy if Mozart composed an air on the tune of mine [noise]\nHere's those very variation on Saturday Mozart solo variations on homemade ...\nComposer Aaron ... mine she thought it was very very on top of the most all of a actions on ... on on you know I think the ...\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n\n\nThe man variations I Do love the variations I was by most times some of variations on a tune by far the only one on you know which means like land\n\n[noise]\n[noise]\n\n\n[noise]\n\nNah\n\n\n\n\n\n\n\n\nSweet of music from Aaron ... tons of ... the tender and this is member\nSupported gp beat we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening\n[noise] Hi I'm Sarah is asked evening classical host on TV I get to share a musical stories in to the sec Amy [noise]\nThey know that went really brings us together\nListening to music to relax to commute to be lifted transported\nTiny kind of road when words\nLeave off easy to get\nYour support keeps the music here for you [noise]\nPretty gp dot org and click donate\n\nFrom the University of west Georgia Ninety seven F. L. W. W. W. W. A. G. H. G. Carroll part of Georgia Public broadcasting radio network\n\n\nThis is a pretty familiar some music by Spock played on the piano\nNo clear aware that box never played on a modern piano much less composed for one\nOf his keyboard music adapt to it very well [noise]\nThere's quite a few panic to even specialized in playing Bach music\nOn the contemporary piano\nPlayer on this recording made more than one version of this music so he improved on his first attempt to record it [noise]\nThis is the second new and improved version is coming up for you in just five minutes [noise]\nLive from NPR News in Washington I'm Joe heart the Supreme Court is back in session today about what Brett Kavanaugh's nomination still up in the year only eight justices will be on the bench NPR's Nina Totenberg says that raises some interesting issues\nThere are quite a few very important cases pending in front of the court and it has not yet decided to hear and interestingly the court has already\nYou very important cases pending in front of the court that it has not yet decided to hear and interestingly the court has already put off any decision on whether they will hear those cases those are the kinds of cases that are big five to four cases very often [laughter]\nWhether it's illegal or unconstitutional to discriminate against gay people in employment for instance that's on the potential DACA but it has not yet been granted by the court what has been granted are a bunch of cases that are\nCould be very important or they could be very tiny procedural steps one way or the other\nNina Totenberg reporting today marks the one year anniversary of the Las Vegas shooting that claim fifty eight lives and injured hundreds when a gunman opened fire from an upper floor of the Mandalay Bay resort and casino\nAs NPR's Bobby Allyn reports the city is planning a day of reflection which will include dumbing the light so long the cities gleaming Las Vegas strip\nAt ... pm the same time that wealthy gambler Stephen Paddock began his shooting rampage the city's famous casino corridor will darken\nAs the marquee dams thousands of residents like lawyer Paulina ... will remember an act that is considered the deadliest mass shooting in modern American history she says the fast moving resilient city is bouncing back from the tragedy\nBut not to let this act of terrorism I think it is that this crazy act violent that stop I enjoy it left to say\nThat it didn't leave a note he wasn't connected to a terrorist group he had no mental health record a year later investigators say they remain bewildered about his motive Bobby Allyn NPR News\nCar explosion rocked downtown Allentown, Pennsylvania has left three men did\nThe blast could be heard for blocks around the city's downtown sports arena with Kurt parts and body parts strewn around the wider area Lehigh County district attorney Jim Martin says the Federal Bureau of Alcohol Tobacco firearms and explosives is leading the investigation\nWhere you have a high degree of the\nNight it was so\nBesides ATF the FBI is also assisting the investigation authorities released new information about the possible cause of Saturday nights blast including whether it was a bomb [laughter]\nCanada and the United states have reached a deal for candidates to stay in a free trade pact with us and Mexico trade officials for both countries say the renegotiated deal will result in free markets I answer a trade agreement was reached after weeks of bitter hype\nOfficials for both countries say the renegotiate a deal will result in free markets answer or trade the agreement was reached after weeks of bitter high pressure negotiations that rushed up against a midnight deadline and you're listening to NPR News in Washington\nWas a presidential election on the horizon the president of camera and says the extremist group Boko Haram has been expelled from the Central African nation but as NPR's Eyder Peralta reports ... still faces serious domestic problems\nWill be up was rallying in the northern part of camera room when he declared that the terrorist\nGroup football around\nThe enemy has held says it is time to rebuild\nBut who is one of Africa's longest serving president is also facing and increasingly ... situation in this country's English speaking regions after decades of tensions last year a separatist movement declared war on the government\nAnd since then hundreds have been killed in clashes with security forces election day is October seventh\n... NPR News Nairobi\nA group of migrants who are stuck at sea in bad weather for five days of arrived in Malta after being transferred to a Maltese naval vessel from a humanitarian rescue ship the Maltese government says the fifty eight passengers will be relocated in coming days to France Germany Spain and Portugal\nJust hours after California Governor Jerry Brown signed legislation on Sunday to restore open Internet protections known as ... neutrality the Trump Administration began a legal challenge the Federal Communications commission repealed the rules last December marking a win for Internet service giants like Comcast\nA TNT ... I'm Jim ... NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the artists foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at our cars foundation dot org and the corporation for public broadcasting\nStefan ...\n[laughter] well now calling all piano nerds can and the pianist who first recorded by petite has for cable or in the late Nineteen nineties performances\nPiano nerds ... can\nBe honest to first recorded by teachers for key words in the late Nineteen nineties\nPerformance is kind of stood out he had a particular way of playing that emphasized clarity and technical skill and possibly some over the top in those troublesome times as many Twenty years they can re recorded those petite his anti incorporated some changes\nAll the repeats are observed he kind of temper his Christ articulation and he thinks all a little bit more like God to see what you think about the performance but she didn't ... three\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\nMember\n\n\n\n\n\nAny\nMoney\n\n\n\n\n\nMinutes\n\n\n\n\nLater\nA\n\n\n\nThe\n\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nMm\n\n\n\n\n\n\n\nI\n\n\n\n\n\n\n[noise]\nI personally performance I think a music by ... by party to number three ... studied and reconsidered his earlier recording of the work all the good I think\nComing up a dense sweet after ... by someone that you might not expect\n[noise]\n[noise]\nOr\nOr ...\nOr\n\n\nNah nah\nNah nah\n\nNah\n\nAnd\nMm\n\n\n\n\n", "year": "2018", "show_name": "Classical 24", "city": "Carrollton", "day": "01"}