{"month": "10", "state": "GA", "station": "WUWG", "content": "It ... of the ... the number one in the major originally for keyboard by Johann Sebastian Bach I'm Sarah ... thanks for your company tonight till next time take care and they\n\nResults on election night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be alive all night watching the close races around the country listen on election night the wake up and hear what the outcome means for America on MORNING\nEdition critical election central coverage NPR News\nJoined us for all the results on election night starting at eight Iran gp\nFrom the University of west Georgia because Ninety point seven FM Wu WG pained W. W. P. H. D. Gerald Ford of Georgia Public broadcasting radio network\n[noise]\nKnow those cop buddy movies where one of the two guys prepare as always about to retire\nAnd he's always like I don't want to take on this case I'm two weeks from one tier with [noise]\nThe idea that we don't exactly do our best work when we're close to retirement\nCommon when we're just kind of phone again at that point right suffice to say Brahms was not in that mode\nROMs final symphony he was forced [noise]\nIndeed a find a way to make your\nFinal ...\nLive from NPR News in Washington ... President Trump and first lady millennium are scheduled to visit Pittsburgh Tuesday is the first funerals are held for victims of the Pentagon's massacre White House spokeswoman Sarah Sanders says Trump has ties to the Jewish community\nPresident has the grandfather of several Jewish grandchildren's his daughter is a Jewish American and his son in law's a descendent of Holocaust survivors\nThe president is the grandfather of several Jewish grandchildren and his daughter is a Jewish American and his son in law's a descendent of Holocaust survivors\nTomorrow the president and first lady will travel to Pennsylvania to express their support of the American people and grief that Pittsburgh community\nThat birch democratic mayor says at the White House you contacted victims families first to see if they want Trump there at this time [laughter]\nCustoms and border protection officials in Texas are preparing for the arrival of asylum seekers from Central America Mallory Falk from member station KNPR WG reports from El Paso on a new CPB operation\nIn the morning CBP officers temporarily blocked traffic on several international bridges between El Paso and Ciudad Juarez video from the local news outlet shows officers dressed in tactical gear\nSomewhere masks and carry rifles others hold shields uh local border protection spokesperson said these officers were performing operational readiness exercises\nCBP commissioner Kevin michelina and told reporters the entire effort is called operation secure line\nNot allow a large group to enter the United states in an unsafe unlawful manner\nAnd my grand caravan is still hundreds of miles away from the border but ... says his agency is preparing for one had to buy it for NPR News I'm Mallory fault in El Paso\nMeanwhile the Pentagon is sending fifty two hundred additional active duty soldiers to the southern border ahead of the Margaret caravans arrival\nThat's reportedly more than double the number of American forces battling ISIS extremists in Syria [noise] search and rescue efforts continue in the job of see where a lion airplane carrying a hundred and eighty nine people crashed minutes after takeoff early Monday\nIndonesian authorities acknowledge there are probably no survivors at least six bodies have been recovered incentive to Carter for identification\nNPR's Julie McCarthy has the latest\nIndonesia's president greed and grieving relatives looking for answers rescue crews worked through the night searching for the wreckage of the Boeing seven thirty seven max eight and updated model of boys widely sold jet the c._e._o. of lying air said that the new planes are flown only since August headed unspecified technical issue in a previous flight\nThe pilots reportedly requested a return to Jakarta shortly after take off but lost contact\nIndonesia's search and rescue agency posted photos of debris including crushed smartphones books and parts of the fuselage lion air has had a string of accidents and it's nearly twenty year history\nDid photos of debris including crushed to smartphones books in parts of the fuselage lion air has had a string of accidents and it's nearly twenty year history but not since two thousand four have any been fatal Julie McCarthy NPR News manila this is NPR News\nThe suspect in the pipe bomb mailings targeting critics of President Trump is being held without bail pending another hearing on friday teaser saying made his initial court appearance since his arrest in Miami last week on Monday authorities say he kept a list of intended targets [noise]\nU.S officials are urging the European Union to reconsider its plans to challenge do terrorists on imported aluminum\nUS ambassador Dennis ... says the move would undermine the WTO's liability he made the remarks that a WTO meeting Monday ahead of hearings on disputes over the Trump administration's tariffs transcript at the meeting shows Shay expressed hope that the u._s. can reach a deal in the matter\nAll street stocks opened higher Monday but plunged by afternoon sending lewd chips and the NASDAQ down nearly one percent NPR's Jim Zarroli reports at the drop came after news that the U.S may impose more terrorists on China\nThe Dow is up three hundred and fifty two points at one time in the morning but in the mid afternoon word came that the trade war with China might be intensifying and the Dow dropped as much as five hundred and sixty six points\nIt later recovered part of the last big exporting companies like Boeing were hit hard and so we're tech giants like Amazon which fell more than six percent of the day\nNetflix lost about five percent [noise] the Dow is falling ten percent in less than a month and there's now a negative territory for the year Facebook is down thirty percent from its all time high Jim Zarroli NPR News New York\nAnd I'm ... NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites who pointed faction and sixteen program to massage years including warning night and stretch sessions retailers nationwide more ... dream wave chair dot com Andy any case the foundation\nConducted [laughter] ... good evening\nWhere there's been quite a bit of time with Brahms this hour we'll settle into his somebody number for coming up with um the orchestra who was recently called the most vital\nThis hour we'll settle into his somebody number for coming out with the orchestra who was recently called the most vital workers truck in America while that's a pretty high complement to learn more about that in just a few months\n[noise] party at the song from the stocks buying corn gold diggers renting wanting\n\n\n\n\n\nGoing on [noise]\n\n[noise]\n[noise]\n\n[noise]\nOn the phone [noise]\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\nMm Mm [noise] [noise]\n[noise]\n[noise] [noise]\n\nUh\n\n... or\n...\n[noise]\n\n\n\n\n\nOh why\n\n\n\n\n\nWell\n... ...\n\n\n\n... ... ...\n... ... ... ... ... [noise] well\n\n\n\n...\nOr\n\n\n\n\n\n\n\n[noise]\nPitches member supported keeping the we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G.\nThis is members supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nFor election night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be alive all night watching the close races around the country listen on election night the wake up and hear what the outcome means for America on MORNING edition\nCritical election central coverage\nJoined us for all the results on election night starting at eight here on G ...\nFrom the University of west Georgia business mind be point seven F. L. W. W. W. W. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\n\n\nPretty safe to say that musical composition is more of a marathon than a sprint\nIn a marathon there's usually a runner who keeps the pace for most of the rain [noise]\nMexican composer Manuel ... worked on this ... for a long time\nBut only managed to finish it after another composer beat him to the finish line with a different concerto [noise]\nAnd at that point and say focused on pulling together the folk themes in the harmonies that he wanted to use and created this concerto of the south\nAnd what you're going to hear and just five minutes [noise]\nLive from NPR News in Washington ... be accused gunman in the Pittsburgh synagogue massacre is being held without bail NPR's Quil Lawrence reports on the suspects first court appearance on Monday\nShowing real expression forty six year old Robert Bowers entered the court handcuffed and in a wheelchair still recovering from surgery after gunshots used to stand in an exchange of fire with police he was surrounded by federal marshals you spoke only to respond Yes sir or when the judge asked him if he understood the charges against him twenty nine counts including murder\nThe police he was surrounded by federal marshals you spoke only to respond Yes sir or when the judge asked him if he understood the charges against him twenty nine counts including murder and federal hate crimes bars as no criminal record and very little history on social media other than recent post against Jews and immigrants in an online forum\nOn numerous firearms all apparently legally registered the next hearing the case of set for Thursday Quil Lawrence NPR News Pittsburgh\nInvestigators say the man charged in the pipe bomb mailings to prominent critics of President Trump kept the list of intended targets authorities began to notify people on the list Monday after Cesar ... first court appearance David Weinstein is a former federal prosecutor who says this is not necessarily an open and shut case\nThey certainly need to prove what his intent was the need to prove how and why he started these people they need to prove to some degree depending if at any extra charges whether or not these devices were actually going to work with another qualify as weapons of mass destruction\nAnd other package bomb apparently meant for CNN was intercepted a male facility in Atlanta on Monday so far fourteen unexploded packages have been recovered [laughter]\nOne person reportedly died as a new group of migrants from Honduras waded across the river into southern Mexico on Monday as NPR's Carrie Kahn reports the group hopes to catch up to a larger caravan that's heading toward the U.S border\nWading through the Muddy Waters that message at bay river between Guatemala and Mexico the group was followed closely by a low flying federal police helicopter apparently trying to create waves in the water and discourage the crossing one safely on the Mexican side of the river the group was allowed to continue north\nFurther north that much larger group numbering and the thousands continued their journey to the U.S border President Trump has not let up on his condemnation of the caravan he told Fox News he will build tense everywhere so migrants who make it to the U.S border and ask\nFor asylum will stay until their claims are finished the defense department says it will send fifty two hundred troops to quote hard in the U.S Mexico border Carrie Kahn NPR News\nSearch and rescue operations in Indonesia or being stepped up in case there are survivors of the lion air crash\nAnd a statement that just don't carriers said that human remains collected in twenty four body bags have been sent to in Jakarta hospital for identification crews have also recovered wallets cash and other personal items special equipment is being used to try to find the planes hole and flight recorder\nThe bowling seven thirty seven with a hundred and eighty nine aboard plunged into the job of seat shortly\nSpecial equipment is being used to try to find the planes hall and flight recorder the bowling seven thirty seven with a hundred and eighty nine aboard plunged into the job of seat shortly after take off this is NPR News [noise]\nZealand's parliament closed briefly on Tuesday after a strong but deep earthquake struck the country's Northern Ireland U.S Geological survey says the magnitude six point one Templar was centered about forty eight miles east of the town of new climate than most felt as far away as the south island there's the ... quake monitor\nSays more than Fifteen thousand people felt the quake there are no immediate reports of damage your casualties that rain is expected in central and southern Italy Tuesday following severe storms already blamed for at least four deaths\nAs Christopher live save reports officials in Venice say that as much as Seventy five percent of the historic city is flooded the city of\nCanals is used to ... them or high water at this time of year but a combination of torrential rain and high tides have swollen the surrounding lagoon by more than five feet above sea level\nAs age ... seawater spilled inside ... those water bus service was suspended because the boats could no longer fit beneath the bridges\nThe governor of the surrounding region has warned that the flooding risk reaching levels last seen in Nineteen sixty six when the entire cities of Venice in Florence were completely inundated in great works of art destroyed severe wind and rain as hammering much of the Italian Peninsula for NPR News I'm Christopher ... in Rome\nChina's reversing a decades old ban on trading of products made from endanger tigers and rhinos under the new rules rhino horn and tiger part could be used for some medical and cultural purposes and those classified as antiques could be used and cultural exchanges with approval\nBut may not be sold at market or via the Internet this is NPR News in Washington [noise]\nSupport for NPR comes from Americans for the yards committed to transforming America is communities through the arts and ours education supporting the nonprofit arts industry which employs four point six million people nationwide learn more at Americans for the arts dot org\nCanada very\nWelcome to music through the night time Andrea Blaine happy to be here hope I think well when you get tired music to set us moving this hour ... ... and wanted to write a guitar concerto for under ... for a long time on the east of course the greats\nOur Manuel ... say wanted to write a guitar concerto for ... for a long time understood all of a of course the great Spanish guitar but he lacked confidence I suppose he was a bit intimidated um\nAnd what finally spurred him on to finish it was another guitar concerto by a composer called cost and the way the Tabasco whose music we also play here music to the night\nThat music was also premiered by Tovia well that was exactly what Manuel ... needed to get moving with this concerto does Tiller\nWas here is ... ... villages and the fill her money out\nOf the orchestra the America's is conducted by ...\n\n\n\n\n\n\n[noise]\n\n\n... ...\nMm\n\nNa\nThe\nYeah\n\n\n\n\n[noise]\n[noise]\n[noise]\nIn the\n\n\n\n...\n\n\n...\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\nNa\n\n\n\n[noise]\n\nTo remind me a little bit oh ... tons Midsummer Night's dream ... music she'll ... scared so number for you the lead the piano [laughter]\nThis is listener supported classical music music through the night my name's Andrea ...\nDays classical music is also supported by western hotels and resorts dedicated to empowering your wellbeing while on the road was signature wellness programs designed to help you stay in control while traveling western let's rise more at ... dot com\nWe said no by Luigi ... played by quick ten to ... [noise] Mm\n\n\n\nPuts his members supported TPP we're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my GP beat and George\nWe're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening\nNow is the perfect time to clean out the garage and get rid of that car you no longer need\nWill face the coming months with a fresh start and by donating you're used to guard a G. P. B. feel even get a tax deduction called eight seven seven GP be one car or donate securely on line a G. P. B. dot org slash cars and thank\n\nFrom the University of west Georgia Ninety point seven FM Wu WG aimed W. W. A. G. H. B. Gerald Ford of Georgia Public broadcasting radio network\n[noise]\nThe picture's worth a thousand words how many musical known\nOne of the picture is a vision of\nSixteenth century alter the [noise]\nComposer Paul Hinder mental as deeply moved by the work of the painter ... music as part of the results [noise]\nTo go here was having sounds like filtered through painters brushes kind of musicians notes [noise]\nIn just over half an hour\nRight here on music through the night\nLive from NPR News in Washington ... Stevens\nRobert Bauer is remains in custody after his first court appearance as being arrested in the ... of eleven people at a Pittsburgh synagogue from member station W E s say only hearing reports that the suspect is facing twenty nine federal counts including twenty two that could carry the death penalty\nSat in a wheelchair during the five minute arraignment wearing a blue sweatshirt in handcuffs he spoke in a clear voice when the judge asked if he understood the charges lodged against him those charges include fatally\nAnd are in men wearing a blue sweatshirt in handcuffs he spoke in a clear voice when the judge asked if he understood the charges lodged against him those charges include fatally preventing people from practicing their religion which is a federal hate crime us attorney Scott Brady spoke with reporters after the hearing\nOur thoughts and prayers continue to be with the victims families and with the community\nAnd rest assured we have a team of prosecutors\nWorking hard to ensure that justice is done\nPowers is set to return to court for a preliminary hearing Thursday he's being detained without bail for NPR News I'm only herring and Pittsburgh\nGroup of army support troops is heading to the southern us border they are to assist efforts to deal with the migrant caravan expected to arrive from Central America that day two hundred active duty soldiers and all are scheduled to arrive there by the end of the week\nThere'll be supporting the customs and border patrol and building basically rushed to camps along the Mexican border customs and border patrol officials are still trying to figure out exactly where these camps will be and they're also I'm told could be some detention facilities along with these camps\nNPR's Tom Bowman reporting meanwhile another group of asylum seekers is trying to catch up to a larger caravan heading to the U.S border one person in the new group die while crossing the river from Honduras to Mexico\nA new study finds some misconceptions about who is most concerned about the environment and NPR's Dan Charles reports researchers say that worries about the environment appear highest among minority groups\nThis study documents a big gap between perception and reality when it comes to environmental concerns among different racial groups when people were asked whether they themselves are concerned about the environment non whites said yes more often than whites poor people were more environmentally concern than the wealthy\nYet all the groups believe the opposite that white people and wealthier people care more about the environment\nThe authors of the new study which is published in the journal pie NASA this misperception could affect people's behavior if blacks and Latinos feel that their own social groups are not so concerned about the environment they may feel less free to act on their own beliefs\nDan Charles NPR News\nSearch continues for lion air crash survivors authorities in Indonesia are also using special equipment to try to find the planes holding data recorder doubling seven thirty seven plunged into the job of seat early Monday but the hundred and eighty nine people are bored at least two dozen body bags containing remains have been sent to Jakarta this is NPR\nSeven plunged into the job of sea early Monday with a hundred and eighty nine people are bored at least two dozen body bags containing remains have been sent to Jakarta this is NPR News [noise]\nGerman citizens are coming to terms with ongoing Merkel's decision to step aside in two thousand Twenty one after current term as chancellor expires but as NPR's Soraya Sarhaddi Nelson reports Merkel's political opponents say she shouldn't wait that long\nChancellor Merkel said she has to answer to the growing number of German voters who have delivered her conservatives blow after blow in recent regional elections thoughts on on the mentioned for dean she said I Know there are a country is tough silly and that she's grateful to have been at her government's helm for Thirteen Years\nShe added she won't stand for reelection as her party's leader and December but she will continue as head of the German government\nBut leaders of the main opposition party the far right alternative for Germany\nSaid they weren't satisfied so is it ... the ... parliamentary coach and I leave why do they even Nakhle acknowledges that you oppose she polls are intertwined medical should resign as chancellor psoriasis are hiding Nelson NPR News\nNow says Parker solar probe launched in August has gotten closer to the sun than any other spacecraft before it on Monday Parker surpass the helium to record of twenty six point six million miles set back in Nineteen Seventy six [noise]\nIt was just surpassed its predecessors speed record as well and that's just says it'll keep getting closer to the sun until it flies through the outer atmosphere passing but then Fifteen million miles next week\nParker is expected to make twenty four close approaches over the next seven years ultimately coming within three point eight million miles of the sun this is NPR News in Washington [noise]\nSupport for NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast\nOffering artistic draws including St Pete's Dali museum but your who collection and the museum of fine arts more er visits saint Pete Clearwater dot com through the night\nMusic but Paul him into on the way this hour ... Mahler inspired by a very specific piece of artwork\nBut before that music by the German composer Frederick Ernst fat SCA might not be a very familiar name to us and if it's at the same time as Beethoven Schubert\nIs it by the German composer free drinks are SCA might not be a very familiar name to it in the same time as Beethoven Schubert and\nIn the company that we're about to hear we get an opportunity to hear how his music compares with those two contemporaries cars and the number two is played by the north East German radio so harmonic\n\n\n\n\n\n\n\n\nWell [noise]\n\n\n\nUh\n\n\n\nMayor\n\n\n\n\n\nHer\n\n\n... ... ...\n\n\n\n\n\n... ... ...\nWhat\n\n\n[noise]\n[laughter]\n\n\nAnd that lovely inspired by the distant from the cross portion of ... alter piece Paul intimates music mouthpiece their Mahler yeah lots of symphony orchestra you led by your levy\nAnd then the music she was a nice Facebook page I've just posted an article about other paintings that have inspired classical music have a look at that\nYou know by ... can he played the piano for list when he was just fourteen and then later performed a Brahms piano concerto with a composer conducting brave men don't can also wrote a lot of music in self here's one of his work\n... [noise]\n\nOr\n\n\n[noise] or\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNo\n\n\n\n\n\n[noise] the earliest drunken Sarah needless to Brandon texting orchestra ... to ... this is members deported TPP where in Eighteen station radio network you can listen online or TPP dot org and you can find us on Twitter at my GP beat\nAnd Georgia Public broadcasting on Facebook thank you for listening\nPeter single here and if you're in your heart I Want you to try something ruin the windows are all still decide to take a good smell\nCan you smell that that was the great cologne experiments of two thousand for it you should not have gone with the dollar store for that one boy you can lose that old car smell my donating your vehicle one of your favorite causes like public radio it only takes a few minutes and just like that you've supported the station and well you are on your way to a life of center smell\nTo to ... dot org slash cars and thanks [noise]\nFrom the University of west Georgia because Ninety ... Wu WG aimed W W G. H. B. Carol ... for the Georgia Public broadcasting radio network\n\nWinter's just around the corner so let's talk about\n\nFlowers and trees warm weather\nChair and ...\n\n\nDid you see where this music called spring is concerned he really chose to focus only on the first part of all of that\nYou girls have leaves and flowers and things [noise]\nYou can learn a little more about did he sees spring later this\n\nFly from NPR News in Washington ... Stevens President Trump and first lady Maloney a plan to visit Pittsburgh today is the first funerals are held for the eleven people killed in a massacre at a synagogue White House spokeswoman Sarah Sanders says Trump has ties to the Jewish community\nThe president is the grandfather several Jewish grandchildren daughter is a Jewish American and his son in law's a descendent of Holocaust survivors\nThe president and first lady will travel to Pennsylvania to express their support of the American people angry that Pittsburgh community leaders\nOf a liberal Jewish group of signed a letter saying Trump should stay away until he denounces white nationalism a rabbi at the synagogue where the shootings occurred as the president is welcome there they won't Pittsburgh democratic mayor says the White House you contact the victim's family first to see how they feel about Trump's visit [laughter]\nI'd already said this aspect into pipe bomb mailings to critics of the president kept a list of intended target these are saying is being held without bail after an initial court appearance in Miami yesterday [laughter]\nCandidates in a closely watched race for a seat in Kentucky six congressional district based off last night and they're only debate ahead of next week's midterms Joss jeans with member station ... reports\nThat some of the deepest divisions in the contest or over the issue of health care\nIn a state that is so large coverage gained under the Affordable CARE Act voters in this swing district dark hearing the debate over health reform play out again Monday incumbent Republican ... health law as failing to state\nThere's one choice in the end and exchange and unattractive their high premiums high deductible and they've known that works\nLooking at the bar sad to twenty ten health law as failing to state\nThere's one choice and the and the and the exchange unattractive their high premiums high deductible and they've now networks\nBut bars democratic rival political newcomer immigrants edits Republicans who are sabotaging the law\nWe need to number one elected leaders who want to make the system work\nNot tried to undermine up for purely political purposes\nPolls show a tight race in a district President Trump won by Fifteen points for NPR News I'm Josh James in Lexington, Kentucky\nAnd his first interview since being elected Brazil's president elect John ear both and arrows says he plans to tackle his nation's crime rates the BBC's Kate Walsh in reports from Rio de Janeiro both an arrow also says he may I ask a well known anti corruption judge to serve in his cabinet\nJohn ... to to get his fast paced election in the tax code TV network and buy one of Brazil's biggest evangelical leaders\nHe relied on the supportive religious groups in the run up to these elections well known to his promises to get tough on growing vine and Mr ... said he wanted to try new gun laws by the end of this year before he even takes over\nHeels as anyone did well known federal judge said Jim ... who's been in charge of corruption investigation operation come watch to be nominated to either the Supreme Court hole is justice minister [noise]\nThe BBC's Katie Watson reporting\nYou're listening to NPR News [noise]\nU.S officials are urging the European Union to reconsider its plans to challenge to tariffs on imported aluminum he wasn't bath or Dennis ... says the move would undermine the WTO's viability he made the remarks at a meeting Monday head of hearings on disputes over the Trump administration's terrorists\nOut transcript at the meeting shows shape expressed hope that the u._s. can reach a deal in the matter in talks with Canada and Mexico\nA new analysis of satellite images shows almost all of Haiti's original forests are gone NPR's Dan Charles reports that researchers say the country's deforestation could be complete within Twenty years\nThe researchers say deforestation in Haiti is driven by poverty peasant farmers cut down trees to turn the wood into charcoal which they can sell Thirty years ago about four and a half percent of Haiti's lab mostly on mountainsides was covered with true native forest\nBy two thousand sixteen it was down to just one third of one percent before a station continues even in national parks official statistics show\nBy two thousand sixteen he was down to just one third of one percent to the fore station continues even in national parks official statistics show larger areas of forest but that's because they include land with just small patches of trees according to the new study published in the journal P. N. A. S.\nMany types of native wildlife including frogs and lizards or disappearing as their habitat fat ships Dan Charles NPR News\nBritain's treasury teeth and it's in the new tax on the revenues big Internet firms Philip Hammond says it's signed it profitable global tech giants pay their fair share for public services in the u._k. ... percent tax revenue generated from UK users takes effect ... two thousand twenty two [noise] this is NPR News [noise]\nSupport for NPR comes from NPR stations other contributors include the candy and Lucy lenient family who appreciate that for three decades NPR has helped them to better understand a complex nation in the world through it in depth coverage of events ideas and cultures and the corporation for public broadcasting corner\nThank you so much for listening for tuning in for joining me my name's Andrea ... music through the night\nWhen you hear the word ... you're probably thinking immediately of Chopin I Know I Know I Do and the wonderful pieces that he ... with that title no turned you make music ... wedding ... but the French composer from these two ... two\nWonderful one accident and you hear the selection of them now the pianist here is Paul ...\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\nUh\n\n[noise]\n\n\n[noise] [noise]\n\n\n...\n[noise]\n[noise] [noise]\n\n[noise]\nOh\nOh constantly with music by Trump cease to know that was the selection I'll turn to the beautiful\nMusic through the night my name's on the plane is listener supported classical music today's community can also supported by global meal prayer service delivering fresh corn me dinner ...\nThat are ... and Fifteen minutes would just one pan gobbled up the pipe work so you spend less time chopping and more time with family through more than doubled dot com slash classical\n[noise]\nPretty exciting to the beach are teeny was the first musician to own one of the famous Stradivarius violins and he may have played that Saddam to on a touchy needs violence numbers for play by a group called ... ... ... talk led by the violinist Enrico ... thunder\n... W the it cold spring but it doesn't just picked a like with these in the spring spring meant we burst into a human life he sat down to descriptive springtime but a human springtime sees you can get your head round that one as you listen to the music\nOh\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nSpringtime bought a human one he said the new ...\nSays his members\nSupported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening [noise]\nYou know showing your car can be a hassle but ... is a whole different story but I was taking off your hands off your driveway and turn it into public radio and maybe even a tax deductions ... all those the marketplace up here is how to do [noise]\nEight seven seven GP be one car or donate securely on line a gp dot org slash cars and thanks [noise]\n\nFrom the University of west Georgia business mind be point seven F. L. W. W. G. I. N. W. W. G H Street Gerald Ford of Georgia Public broadcasting radio network\n[noise] [noise]\nThe English poet ... chesterton had this to say about the Irish [noise]\nThe great Gales of Ireland are the men that God made man from all their wars or marry\nAnd I love that quote but I'm not sure that it applies to this Irish inspired music\nArnold access to empower them into the twilight\nWas based on the Celtic miss\nThe king of all sir I wanted to marry did read that she had\nThe story involves some singing that isn't particularly sad\nKind of war that definitely is Mary [noise] are you going to find out more later\nI'm Andrea ... says music\nLive from NPR News in Washington I'm shave Stevens a week of mourning formerly begins today for victims of the shootings at a synagogue in Pittsburgh\nAs NPR's Sarah McCammon reports the first funerals will be held today for three of the eleven people killed in the attack brothers Cecil and David Rosenthal were in their fifties and known for their regular attendance at the tree of life synagogue Sharon ...\nEleven people killed in the attack\nRather see still and David Rosenthal were in their fifties and known for their regular attendance at the tree of life synagogue Sharon rise ... Ralph's sugar funeral home which serves Pittsburgh Jewish community\nI don't know anybody that didn't know that\nAnd they had a mile and a hug or a wave for everybody\nThere wasn't dollars will be laid to rest after a joint funeral service I separate funeral is planned for Dr Jerry Rabinowitz at sixty six year old local physician who was among the eleven killed Sarah McCammon NPR News Pittsburgh\nInvestigators say the man accused in Pittsburgh and a gun massacre expressed hatred towards Jews during the rampage and after his arrest as NPR's Eric Westervelt reports some human rights groups are now urging politicians to rethink hyper partisan rhetoric they believe is fueling an atmosphere of the er division and hate\nThe Anti Defamation league's is twenty seven teams saw an historic sixty percent rise in anti Semitic incidents in recent a deal report shows that online anti Semitism continues to grow during this year's midterm election season says the group's George selenium\nWhen anti Semitic rhetoric or dog whistling is really allowed in our public square without condemnation it really gives the green light to anti Semite ... in a slum of foods to keep spouting it an acting on it the reality is that words have consequences for a\nDeal and other groups are now calling on politicians to redouble our efforts to tone down hyper partisan an ad hominem attacks they say is only inflaming national fear and division Westervelt NPR News\nThe Trump Administration is asking the Supreme Court to delay the start of the first trial over the citizenship question recently added to the twenty twenty cents as NPR's Hansi Lo Wang reports that dozens of jurisdictions in groups to file multiple lawsuits over the controversial question\nThe first citizenship question trial is scheduled to start on November fifth in New York City but the Trump Administration says it should be pushed back so that the Supreme Court can reviewing new request initiation once the high court to block lower court orders allowing testimony of two senior Trump officials to be considered\nThe plaintiffs however say the depositions of commerce secretary Wilbur Ross and Justice Department official John Gore are critical to proving their claims that Ross misuses authority over the census and discriminated against immigrant communities of color by adding the question\nFor us it said the question is needed to better enforce the voting rights act a little long NPR News New York the fares\nTo fifty two hundred US soldiers are heading to\nThey are by adding the question for us it said the question is needed to better enforce the voting rights act a little long NPR News New York\nThe first to fifty two hundred US soldiers are heading to the southern border ahead of a micro caravans arrival from Central America the troops are to provide logistical support for border agents this is NPR News [noise]\nSearch and rescue efforts continue in the job of sea for victims of yesterday's lion air jet crash however Indonesian authorities acknowledge that there are probably no survivors and NPR's Julie McCarthy reports at least twenty four bodies have been recovered and sent to Jakarta for identification\nIn Jakarta Indonesia's president greed and grieving relatives looking for answers rescue crews worked through the night searching for the wreckage of the Boeing seven thirty seven max eight\nAnd updated model of bullies widely sold jet the c._e._o. of lying air said that the new planes are flown only since August headed unspecified technical issue in a previous flight [noise]\nThrowing seven thirty seven was carrying a hundred and eighty nine people when they plunged into the seat just minutes after take off from Jakarta yesterday morning\nSouth Korea Supreme Court says Japan's nip on steel and sue me ... metal Corp\nShould pay for victims of forced labor during World War two colonial rule\nToday's decision comes after five years of deliberations on steel calls the decision deeply regrettable Japan's foreign ministers threatening counter measures saying the ruling violates Nineteen sixty five treaty that was supposed to settle the issue and restored diplomatic ties\nChina's rehearsing a decades old ban on trade of products made from endangered tigers and rhinos under the new rules rhino horn and tiger parts could be used for some medical and cultural purposes\nThose classified as antiques could be used in cultural exchanges with the approval but may not be sold at market or exchanged over the Internet\nI'm Shay Stevens NPR News in Washington [noise]\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects for minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home at ... dot com\nAnd the Academy of music\nYou're very welcome to the music this hour my name's Andrea ... music through the night\nAnd I hope you can settle and stay for a while\nI Hope you can stay for a while you can buy Gabriella ...\nThe piano and Clinton improvised so the ants in face improvisation number three comes completely off\nFor you\nKnow [noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\nMm\nMm Mm Mm\nMm\n\nMm\n\n\n\n\n\nMm\n\n\n\nMm\nMm\n\n\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n...\nI Love that the whole interests table sweet by ... the barrel band conducted by Jerry ...\nKing that ruled Ulster and the northern part of Ireland wanted to marry a girl cold dead but she ran away and married someone else after seven years of happiness she's tricked into coming back to ... and there's a war between her husband's plan and the king\nThere's not a happy ending and the story Arnold box wanted to compose an opera based on it and this toned poems parts of the work that he did on it it's called into the twilight just took the oath to orchestra led by Bryan Thompson oh\nOh\nWhoa\n\nAll\n\n...\nOver an\n\n\n", "show_name": "Classical 24", "year": "2018", "city": "Carrollton", "day": "30"}