{"month": "10", "state": "GA", "station": "WUWG", "content": "... for strings any major like aren't any divorce shock here on ... that was a medic more so than chamber orchestra with Scott you conducting\nI'm Sarah ... take care and I'll see you next time\nThey just as David Greene host of MORNING EDITION I'm here to talk with you about that poking the one that keeps reminding you support public radio you can support the programs you love by donating your used vehicle\nThat old car truck could be worth hundreds of dollars to the station all you have to do is call and you might even receive tax deductions to G. P.\nB. dot org slash cars or called eight seven seven GP beep one car can bank [noise]\n\nFrom the University of west Georgia because Ninety point seven FM Wu WG aim to W. W. G. H. G. Carroll good for the Georgia Public broadcasting radio network\n[noise]\nGave much rent out a little in return you don't have to look\nDanish composer who were had kind of a hard Scrabble upbringing his family was poor\nStill managed to get a musical education and became the most successful Danish composer of the nineteenth century\nSo from the department of composers who deserved to be better\nAre pretty number seven ... noodles Gunther\n\nLive from NPR News in Washington I'm nor rom secretary of state Mike Pompeo is on his way to Riyadh Saudi Arabia\nHe's expected to meet with the king to discuss the disappearance of Saudi writer ... who hasn't been seen in public since he entered the Saudi consulate in Istanbul, Turkey nearly two weeks ago\nTurkish authorities say they believe he was killed there to show that Jay has been living in the U.S and wrote for the Washington Post\nUnfolded in Istanbul, Turkey nearly two weeks ago Turkish authorities say they believe he was killed there to show the J has been living in the U.S and wrote for the Washington Post\nHundreds of people are still in shelters days after hurricane Michael's slammed into the Florida Panhandle it came ashore last Wednesday as one of the most powerful storms on record to hit the continental us NPR's Quil Lawrence has more on recovery efforts\nTarps and chainsaws are in high demand as residents clear fallen trees and patch up the holes in the ruse made by hurricane Michael's one hundred fifty five miles per hour winds electric generators or sought after with power companies still tentative about when the lights might come back on [laughter]\nThere's no cell phone signal and much of the region locals have been getting tips from radio stations about where they might find gas food and water distribution and medical care traffic\nIn and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flew into the pan handle from all over the state Lawrence NPR News Miramar Beach Florida\nPresident Trump visited Florida and Georgia Monday to view the devastation he said the government is doing all it can to help the survivors [laughter]\n\nAt least Seventeen deaths in four states have been blamed on this storm Microsoft cofounder Paul Allen has died at the age of sixty five from complications of non Hodgkin's lymphoma\nAs NPR's Martin Kaste reports the tech billionaire help define the early ... personal computers and went on to shape the look of his hometown\nIn those early photos of Bill Gates and Paul Allen it's a bearded Allen who looks like the grown up starting in the seventies the two childhood friends parlayed their computer hobby into the world's most important software company providing the dos that ran IBM's another PC clones\nIllness forced Allen to seed control of the company to gates but his Microsoft shares made him a billionaire and then the succeeding decades he became a major influence here in Seattle as owner of the local football team and as a real estate Baron\nAllen spent millions on brain research and causes such as Ebola but also on memorabilia of his youthful enthusiasm ... science fiction and rock and roll\nMartin ... NPR News Seattle\nOnce the largest retailer\nThe ... of his youthful enthusiasm ... science fiction and rock and roll marching ... NPR News Seattle\nSears once the largest retailer in the world is now in chapter eleven bankruptcy and plans to close stores and eliminate jobs to stay in business at least for now and this is NPR\nTrial is underway in Boston this week claiming that Harvard University discriminates against Asian American applicants\nAnd an opening statement Monday lawyers said the school deliberately ranked Asian Americans lower on a personal rating use to measure trade such as courage and likeability a lawyer for Harvard denies any discrimination\nThe archdiocese of Washington has published the names of twenty eight clergyman credibly accused of sexually abusing minors as far back as the Nineteen fifties along the whys of member station WBUR AMU reports\nOf the twenty eight religious leaders accused and the new report some have multiple accusations of abuse more than half or convicted for their crimes and many have already died\nThe news comes just days after Pope Francis accepted the resignation of archbishop of Washington cardinal Donald Wuerl who's been accused of covering up sexual abuse scandals during his time as the bishop of Pittsburgh [noise]\nThe survivors network of those abused by priests criticized the timing of the release a group called the move a quote hastily assembled PR stunt men to distract from worlds resignation for NPR News I'm Alone and why is in Washington\nFederal regulators are proposing prescription drug company so advertised on TV they're required to include prices\nHealth and Human Services secretary Alex ... says patients deserve to know what a given drug could cause when they're being told about its benefits and risks a trade group says including the prices could discourage people from seeking medical care I'm nowhere rom NPR News\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects for minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home and visor dot com\n[noise] actually feel that it is always good to have you long for some late evening listening [noise] I think we will not disappoint a symphony by the nineteenth century Danish composer noodles God to coming up what is that you're saying\nThe lady was [noise] I think we will not disappoint a symphony by the nineteenth century Danish composing you got to pick up what is that you say that is not familiar name to [noise] uh well let's see if we can't rectify that with some mixed airing but I should have on the way was later\n[noise] ... with some really in a few minutes and this is Ronald Lewis the impromptu number for most Ninety ... [noise]\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\nI think it was Mickey can and they still her money or baroque orchestra get universal number six by our ... currently\n\n[noise]\n... Danish classical music and um\n[noise]\nMention Danish classical music and I'm putting ... Nielsen usually comes to mind Neal got into his are easily the best known a composer nineteenth century Denmark\nThis is neither God doesn't symphony number seven point here by the Stockholm syndrome you gotta wonder the baton of maybe a year me\n\nNo\nOh\nOh\n\n\n\n\n\n\n\nThat was pretty number seven on noodles gone to maybe you're going to Stockholm some funny I\nJust as members supported TPP we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening now\nHe dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening\nNow is the perfect time to clean out the garage to get rid of that car you no longer need\nThe pace the coming months with a fresh start and by donating your used car to G. P. B. feel even get a tax deduction called eight seven seven GP be one car or donate securely on line a G. P. B. dot org slash cards and bank\n\nFrom the University of west Georgia because Ninety point seven FM Wu WG paying W. W. P. H. D. Carol ... part of Georgia Public broadcasting radio network\n\n\nWhat do they feel are bringing player of an instrument the ... for example [noise] an intimate for which there isn't a lot of home at the time [noise]\n[noise]\nGreat music of your own [noise]\nWe're hearing these my music already color and they're using that as\nBasis for your own [noise]\n\nPut on Tony ... the composer music that and it worked really well for him\nThere's proper [noise] find out about [noise]\n\nLive from NPR News in Washington I'm neuron six days after hurricane Michael had parts of the Florida Panhandle are still without electricity or potable water and NPR's Quil Lawrence reports many are still missing after the storm\nOf people are still living in shelters thousands or starting the painstaking process of trying to file insurance claims were hired contractors or get assistance from FEMA\nWhile the search for survivors is over poor phone and Internet service has made it difficult for people that their loved ones no they're okay and the devastated town of Mexico beach it's still not clear how many of about two hundred people who stayed through the storm\nWell for people who have their loved ones no they're okay and the devastated town of Mexico beach it's still not clear how many of about two hundred people who stayed through the storm might not have survived\nEleven thousand military personnel and their families evacuated from ten to ... air force base which took a direct hit they're still waiting for permission to get back to their homes on the base where Lawrence NPR News Miramar Beach Florida\nPresident Trump visited some of the devastated areas in Florida and Georgia Monday agriculture secretary Sonny Perdue is also there he said the damage to pecan growers in southwest Georgia will be felt for generations\nPerson on trees role she said oh so was it was all worth a whole lot\n\nOf us are breaking\nThe storm struck the Florida Panhandle last Wednesday as a hurricane one of the most powerful storms on record to hit the continental us\nA joint Turkish and Saudi investigative team search the Saudi consulate in Istanbul, Turkey Monday nearly two weeks after journalist Jamal 'cause she\n... she'll God she entered the building and apparently never came back out he's feared dead secretary of state Mike Pompeo is on his way to Riyadh Saudi Arabia to meet with came to discuss the disappearance NPR's Michele Kelemen reports\nWashington Post columnist Jim ... show was last seen entering the Saudi conflict in ... earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to the show gay Trump says he spoke by phone with king Solomon and sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord ... to the consulate and killed him there and\nThat case is draining us relations with Saudi Arabia though Trump has made clear he doesn't want to disrupt lucrative arms deals Michele ... NPR News the state department\nTalks are underway in a village at the border between North Korea and South Korea with military leaders from both sides as well as representatives of the United nations command\nThey're discussing effort to disarm the demilitarized zone one of the world's most heavily fortified frontiers the two Koreas have also agreed to halt military exercises every move landmines from the DMZ\nThis is NPR News\nA federal judge in Los Angeles Monday dismissed\nWhole military exercises and remove landmines from the DMZ this is NPR News\nA federal judge in Los Angeles Monday dismissed a lawsuit by Stormy Daniels the adult film star had sued President Trump for defamation after he tweeted that she had to lie about being threatened to be quiet about an alleged affair the judge said the president was protected by free speech laws\nAnd the U.S Supreme Court has declined to hear an appeal of California court decision requiring paint companies to pay for the removal of lead paint an older California homes from member station ... D versus shave reports\nSure wouldn't Williams and no industries and con agra will have to pay four hundred and nine million dollars into a fund addressing lead paint in ten cities and counties across California teams Williams is a county council Santa Clara the jurisdiction that brought the case Eighteen years ago\nThe pay manufacturers of filed appeal after appeal they made motion after motion and finally we are now in a position to be able to actually move forward and clean up this toxic would pay from thousands of homes\nA statement from sure wouldn't millions and con agra says the company should not be held liable for selling products that were lawful at the time for NPR News I'm or as a shed in San Francisco\nPacific gas and electric says it hopes to restore power as soon too about sixty thousand customers who lost its Sunday the California utility had deliberately cut off power as a precaution\nUtilities are concerned that high winds will topple power lines and ... wildfires I'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the size Sims foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size assumes foundation dot org\nYou'll symphony orchestra\n[noise] good to have your company thank you so much my name's Andrea Blaine and I hope you can settle down and stay for the music while anyway [noise] composers his next music was known as the ... of the oval\nAntonio ... was an amazing over west and he clearly noticed that there wasn't a lot of solo music for his answer\nAntonio ... was an amazing oh boy and he clearly noticed that there wasn't a lot of solar music for his instruments so he wrote his own and uh that screen as far as things wind except often his music\nWas really difficult to play because he himself with such a superb player\nNevertheless it's lovely stuff and the team that's going to play this music for you know ... on the ... and ... bargain on the piano are well up to the challenges\nIs a concerto based on themes from a popular don't attend the opera called ... ...\nNot\nA\n\nAh yeah [noise]\n\n[noise]\n[noise]\n\n\n\n\n\nMm yeah I think you hear what I was talking about earlier Antonio ... he wrote his own music and he was an amazing ... and the only problem is some of his music is so difficult\nIt's beyond the reach of ordinary mortals that however with ... an amazing old blessed with pianist Gabriel Bergen and on the music through the night Facebook page I just posted an article I bumped and buy Heinz ... find out what he thinks about the ... as a solo instrument\n[laughter] today's classical music is supported by Barrett employee owned independent and Barrett has kept plant financial interest interest first since Nineteen Nineteen R. W. Baird dot com has more information\n\n\n[noise] well by Alexander ... in Asia [noise]\n\n\nOoh\n[noise]\n\n\n[noise]\n\nWho\nNa\n\n\n\n\n...\n\n\n\n\n\n[noise] oh\n[noise]\n\n\n\n\n\n\n\n\n\nWere were\n\n\n\n[noise]\n... pitches member\nSupported G. P. P. we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening ...\n... here in in your car I Want you to try something wrong with the windows ...\nAnd Georgia Public broadcasting on Facebook thank you for listening ...\n... here and if you're in your car I Want you to try something roll up the windows ... take a good smell\nCan you smell that that was the great cologne experimental two thousand for it you should not have gone with the dollar store for about one boy you can lose that old car smell my donating your vehicle one of your favorite causes like public radio it only takes a few minutes and just like that you've supported the station and well you were on your way through life better smell\nVoted G. P. D. dot org slash cars and banks\nFrom the University of west Georgia with his mind be point seven FM Wu WG and W. W. G H Street Gerald Ford of Georgia Public broadcasting radio network [noise]\n\n\nMusic was composed for the festival of Britain\nWhich was a celebration aimed at raising morale\nAdding a feeling of postwar recovery\nAnd the British Isles Nineteen fifty one\nThe part of the festival was a national exhibition showcasing industrial and cultural achievements London's royal festival hall was part of it\nThe conductor Thomas Beecham called the royal festival hall as I\nCalled a a giant chicken coop\nMusic Robin Milford festival sleep well some of the very first music ever played in that chicken coop\nAnd you'll hear later this hour\nLive from NPR News in Washington I'm neurons and Google has canceled plans to attend to Saudi investment conference after the disappearance of well known Saudi journalist ... NPR's Emily Sullivan\nReports the cancellation is the latest pressure placed on Saudi Arabia since ... a critic of thought I policy it was last seen entering its consulate in Istanbul earlier this month the Turkish government alleges he was killed\nPresident Trump is threatened sanctions if the thought I real court just behind ... disappearance the thought I say they'd retaliate even further Google Cloud C. E. O. Diane green has an offer to reason for her cancellation the company said earlier this year it would open\nDid they retaliate even further Google Cloud C. E. O. Diane green has an offer to reason for her cancellation the company said earlier this year it would open five innovation hubs in the kingdom\nOther prominent companies have also pulled out of that investment summit including ... Morgan last year's conference generated lots of excitement about doing business in Saudi Arabia Emily Sullivan NPR News\nSecretary of state Mike Pompeo is expected to land in Riyadh Saudi Arabia and about an hour is scheduled to meet with the king about the disappearance\nPresident Trump Monday solver himself the devastation caused by hurricane Michael in the Florida Panhandle last week after reviewing the wreckage by air he visited a distribution center and Lynn have an outside Panama City and describe what he saw part to believe\nThings for years but it's hard to believe when you're\nAbove if they don't want to do that so\nHe later visited neighboring Georgia the storm is blamed for at least Seventeen deaths in four states a federal judge has dismissed a lawsuit against President Trump from adult film actress Stormy Daniels who claimed the president had to famed her earlier this year on Twitter NPR's Jessica Taylor reports\nDean sued over a tweet Trump sent in April thing Daniels was lying about being threatened in twenty eleven\nNot to go public with her story of an alleged sexual encounter with Trump but in his ruling the federal judge wrote that the tweet quote constitutes rhetorical hyperbole normally associated with politics and public discourse in the United states but it's protected by the first amendment in a statement and Trump's attorney called this a total victory for the president [noise]\nDaniels' lawyer Michael ... they would appeal the ruling and other legal action over a nondisclosure agreement Daniels signed would proceed Trump has denied any sexual encounter with Daniels but did finally admit to reimbursing his lawyer for a hundred and thirty thousand dollar payment to Daniel's on the eve of the twenty sixteen election\nJessica Taylor NPR News Washington\nSears is now in chapter eleven bankruptcy it proposes to shut down about one hundred forty two of its seven hundred stores by the end of the year and lay off thousands of employees and attempt to stay afloat Sears was found in Eighteen eighty six and grew to become the biggest retailer in the world you're listening to NPR News\nThe Russian Orthodox church says it's severing all ties with the medical patriarch Kate of Constantinople\nThe Russian Orthodox church says it's severing all ties with the medical patriarch Kate of Constantinople the state of the global spiritual leader of roughly three hundred million orthodox Christians\nAs comes in response to it as soon as you can buy the patriarch Kate to allow Ukrainian clerics to establish an independent church\nThe Nigerian government says is llamas have killed a female aid worker they were holding hostage after a deadline expired on Monday three women were kidnapped by militants from territory held by the Islamic state in West Africa last march may be said for Honda dogwood reports\nThe militants had set a deadline of Monday for the moms to be made well they would execute two women aid workers and a Christian school go ... twenty four year old midwife at a health care center supported by the red cross\nAn honest look so I'm just looking for UNICEF were abducted along with another aid worker to feed ... Ahmed when militants stormed the northeastern town of Ron ... much it's a place where there are tens of thousands of refugees\nFood on um it was killed last month with the kept distracting the lives of the remaining two colleagues if the government to continue to ignore them\nThe baby says for Honda dogwood reporting Paul Allen is dead at the age of sixty five along with Bill gates Allen cofounded Microsoft the world's biggest software company\nBut to had a falling out in Nineteen eighty three and Paul Allen became a philanthropist who also invested in conservation and professional sports his company said he died Monday in Seattle of non Hodgkin's lymphoma I'm nor rom NPR News in Washington\nSupport for NPR commerce from NPR stations other contributors include vivid St Petersburg Clearwater along Florida's Gulf Coast\nOffering artistic draws including St Pete's rally museum but your who collection and the museum of fine arts more at business saint Pete Clearwater dot com beings spring song\nVery welcome to music through the night my name's Andrea Blaine hope everything's good with you [noise]\nMusic by Frederick DNA is now one of the English composers has music I really do admire Thomas Beecham called deal is the last great apostle and our time of romance emotion and beauty in music and all of that I think his presence and present in this music here\nIt's a daily basis dance Rhapsody number one played for you by the born with\nIn music and all of that I think his presence present it to music here it's dealing says dance Rhapsody number one played for you by the board much to connect the Cincinnati orchestra rather Richard ... ...\nAll\n\n\n\n\n\n\n\n[noise]\nMe too this our music by Robin Milford for the festival of Britain but music now\nAnd some by Mozart now sometimes composers change their minds in the middle of writing something and that's exactly what happened\nTo the ... number eleven originally intended for pairs of clarinet horns and the citizens but Mozart heard when Dr ... had just been formed the Viennese court any added ... to\n\n...\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\nI don't know whether we're going over to the point where we're going\n\nThere [noise]\n\n\n[noise]\n\n\n...\n\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n\n\n[noise] [noise] [noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nYeah\n\nWe're we're we're a long\n[laughter] [noise]\n[laughter] [noise] [noise] [noise]\n\n[noise]\n\n\n\n\nThe the one\nRiver\nKnow\nDo but\nThe thing\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\nOh\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\nSounding though they're having rainy quite a lot of fun they are his chamber orchestra and music by multari serenaded number eleven\nNow we moved to the English composer Robert ... he was born in Nineteen eighty three and she could think of as he lived through some of history's most trying times World War one and two for us to talk of his life was marked with tragedy as well on a personal level\nBut they weren't goes composed for a happy occasion a festival in Britain that happened\nTo celebrate the end of World War two here is milk birds that double sweet\n\n\n\n\nI'm Andrea plane\nJust as members supported TPP where an Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening [noise]\nYou know showing your car can be a hassle but ... is a whole different story but I was taking off your hands were off your dry\nThank you for listening [noise]\nYou're showing your car can be a hassle but ... is a whole different story but I was taking off your hands for off your driveway and turn it into the public radio and maybe even a tax deductions\n... resolve the host of marketplace here is how to do [noise]\nSeven seven GP be one car or Sunni securely on line a gp dot org slash cars ten thanks [noise]\n\nFrom the University of west Georgia business mind be point seven FM Wu WG pained W W G H Street Gerald Ford of Georgia Public broadcasting radio network\n\n[noise] imagine being called to the French Mozart um\nFrom ... while I was burdened with that nickname mainly because he can post a lot of pride and also because he was a free man [noise]\nHe was also came keyboard player and young and dynamic as a musical fourth most so much like Mozart in fact\nHowever there's quite a big difference between the two composer than this concerto is a clue\nYou're going to learn more in half an hour [noise]\nI'm Andrea blame that his music through the night [noise]\nFrom NPR News in Washington I'm neuron secretary of state Mike Pompeo just arrived in Riyadh Saudi Arabia\nHe's to meet with the king to discuss the disappearance of Saudi writer ... who hasn't been seen since he entered the Saudi consulate in Istanbul, Turkey two weeks ago turkey the Saudis say they believe he was killed there to show 'cause she has been living in the U.S and wrote for the Washington Post\nSix days after hurricane Michael's slammed into the Florida Panhandle there are still people missing and thousands of homes and businesses with electricity President Trump visited Florida and Georgia Monday to view the devastation he said the government is doing all it can to help the survivors\nVisited Florida and Georgia Monday to view the devastation he said the government is doing all it can to help the survivors\n\n\nAt least Seventeen deaths in four states have been blamed on the storm\nTens of thousands of homes and businesses lost power in northern California by design Pacific gas electric ordered a blackout fearing high winds will toppled trees and power lines and spark wildfires the until he already could be liable for billions of dollars in damages caused by wildfires this year\nPaul Allen died in Seattle Monday at the age of sixty five along with Bill gates he founded Microsoft to the city of Seattle He met much more Carolyn Adolph of member station K O W reports\nSeattle was his city a fisherman and playing builders before Microsoft\nAfter Alan left Microsoft in Nineteen eighty two he kept the transformation going he the scientific Institute in Seattle and just development companies can transform to see you again by building Amazon's massive headquarters on Twitter Amazon founder Jeff Bezos said\nHe was relentless to the end I'm Carolyn Adolph in Seattle\nThe Trump Administration is proposing to export coal and gas for military bases on the west coast John Ryan from member station ... W\nReports interior secretary Ryan Zinke he told the Associated Press he aims to use military bases or other federal sites to ship fossil fuels overseas\nOr our allies have horrible reliable bond surgery\nWest coast states have blocked coal exports Washington governor Jay Inslee says he won't let the Trump Administration kid around environmental laws\nThey have to show compliance with state and federal laws we have the right to protect our water in our air\nThe coal industry views exports has a lifeline as domestic use falls for NPR News I'm John Ryan in Seattle\nFears ones the largest retailer in the world is now in chapter eleven bankruptcy it plans to close ... stores eliminate thousands of jobs and stay in business at least for now this is NPR News\nFederal regulators are proposing prescription drug companies to advertise on television they required to include prices health and Human Services secretary Alex aids or\nRegulators are proposing prescription drug companies will advertise on television be required to include prices\nHealth and Human Services secretary Alex aids or says patients deserve to know what a given drug could cost when they're being told about its benefits and risks a trade group says including the list price and commercials could discourage people from seeking needed medical care\nRural Americans are as concerned about drug addiction as they are about the economy NPR's Alison Kodjak reports on a new poll from NPR the Robert Wood Johnson Foundation and the Harvard th Chan School of public health\nThe poll shows that about a quarter of the people living in rural areas said drug addiction or abuse is the biggest problem facing their communities [noise] that's about the same share that side of the economy as their biggest worry\nThose two categories overwhelmed all the other responses in the survey of Thirteen hundred people who live in rural areas but even with those worries people say they have a positive outlook about their future Robert Blendon is the professor at Harvard's th Chan School who directed the pole\nIn terms of the future at least half of people are quite optimistic\nMost of the people who responded to the survey said they are doing better than their parents and the majority said they expect their kids to do even better Alison Kodjak NPR News\nIdaho is looking for a new fish and game commissioner blight Fisher resigned after pictures from his vacation andme MBBS went viral on line he had posed smiling in the family about booms that he had killed in his resignation letter Fisher said he had made some poor judgments I'm nor rom NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include twenty three and be\nA personal genetic service working to help people understand their DNA learn more at twenty three and made dot com slash NPR radio and the listeners who support this NPR station now\nThey say that ... practice makes perfect and that's possibly by Brahms wrote up to violence in office\nUp to five violence and not as\nWhich he never actually published before composing the work that we now know as his first violence and all that if you follow me he was forty six years old snuff number one is about to be performed for you by the violence Stefan jak you with the pianist max eleventh and this is music through the night I'm Andrea of land\n...\n... with the pianist max Latin music through the night I'm Adrienne\n...\n\n\n\n\n\n\n\n\nMm ...\n...\n\n...\n\n\n\n\n\n[noise]\n\n\n\n[noise] Mm [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\nThey\n[noise]\n\n\n\n[noise]\nWay\nOr ... lovely heartbeat by a contemporary of Mozart's music through the night\nSays his members supported TPP where an Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\n[noise] hey this is David Greene host of MORNING EDITION I'm here to talk with you about that poking feeling the one that keeps reminding you support public radio you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station or you have to do is call and you might even receive a tax\nDeduction G. P. dot org slash cars or called eight seven seven GP be one car can banks\n\nFrom the University of west Georgia Ninety seven FM Wu WG aimed W W G. H. D. Gerald Ford of Georgia Public broadcasting radio network\nSo\nConstantly called the father of Russian music\nTo have its drawbacks\n\nFor counseling guy means being remembered more for his influence on composers like rent the course of an authority ski and for his own music\nHe played viola enemy out really well so it's no wonder then he wrote for both of those instruments well also and in Fifteen minutes\nYou'll have a chance to appreciate link from one of his own compositions I Hope you can stay nearby\n\nLive from NPR News in Washington I'm neuron\nPresident Trump says he's aware of reports that the Saudi authorities may be ready to admit that Saudi journalist ... died after an interrogation that went wrong\nSources quoted by various media outlets say the Saudi teen who questioned him at they're constantly stumble exceeded their authority because she'll get she went missing two weeks ago the BBC's mar glowing reports\nF outlets say the Saudi team who questioned him and they're constantly stumble exceeded their authority because she'll get she went missing two weeks ago\nThe BBC's mar glowing reports from us dump all off the two weeks of ... and denial it seems if us reports that to be believed that the Saudis are preparing to announce that ... was killed off to a botched interrogation\nThat tiny with President Trump's remarks yesterday that king Solomon has suggested road kill is what behind the journalists death\nThat would be plenty of skepticism towards post claims why would a forensic and post mortem X but be positive is Saudi teams ... only to interrogate Mr ... G one report said be carrying a ... saw the\nBBC's mark low in reporting secretary of state Mike Pompeo is in Riyadh Saudi Arabia where he's expected to meet shortly with the king to discuss the disappearance defense secretary Jim Mattis is in ... city Vietnam on the way there he said President Trump supports him one hundred percent\nThis comes after Trump told sixty minutes Madison might leave his job\nPresident Trump visited Florida and Georgia yesterday they said for himself the devastation caused by hurricane Michael last week agriculture secretary Sonny Perdue is also there he said the damage to the con grows in the southwest Georgia will be felt for generations\nPercentages of dollars you're also going to say you know so we were all those worth a whole of civility blown law\nThat they were looking for a minute\nI mean there are breaking\nThe storm struck the Florida Panhandle last week it's a hurricane one of the most powerful storms on her record to hit the continental us attorney general Jeff Sessions is criticizing a federal judge's order in the lawsuits over the news citizenship question on the twenty twenty cents as NPR's Hansi Lo Wang reports\nCommerce secretary Wilbur Ross says he approved the citizenship question so that the government can better enforce the voting rights act internal memos and emails however showed that law was not driving the administration's push for the question during a speech Monday at the Heritage Foundation attorney general Jeff Sessions said those lawsuits should be judged based on those documents\nThat were on the page don't have a motive they are either permitted or they are not but the judge decided to own a frog all all of the inner workings of the cabinet secretaries and mind\nUs district judge ... has said that Ross his intention\nThe judge decided to own a frog all manner workings of the cabinet secretaries and loaned\nUs district judge ... has said that Ross his intent and credibility are directly at issue and then he should be questioned under oath to maintain public trust in the census you along NPR News\nThis is NPR talks were held today in a village at the border between North Korea and South Korea was a military leaders from both sides as well as representatives of the United nations command they're discussing average to disarm the demilitarized zone one of the world's most heavily fortified frontiers\nThe two Koreas have also agreed to halt military exercises and remove landmines and guard posts within the DMZ\nAs of today a visa MasterCard and American Express are in violation of the law every time one of their cards gets swiped in India NPR's Lauren Frayer reports from Mumbai\nAnd new Indian law requires international companies that process any financial transactions to store data on servers inside India only\nIt's a policy called data ... and U.S companies have lobbied hard against it\nBut India wants to control the data collected from its one point three billion residents meets a MasterCard Amazon and pay pal or among several companies that have asked for more time to comply some of their anti fraud mechanism he's servers outside the country where the purchase takes place\nThe Reserve Bank of India has so far refused to grant extensions and may now imposed fines on international companies Lauren Frayer NPR News Mumbai\nPacific gas and electric says it hopes to restore power is soon to tens of thousands of customers who lost at Sunday\nThe California utility had deliberately cut off power as a precaution utilities are concerned that high winds will topple power lines and sparked wildfires Pacific has been blamed for some of the California is most destructive wildfires I'm nor rom NPR News\nSupport for NPR comes from dream ways maker of luxury massage chairs from Japan with shootouts viewpoint detection and sixteen program to massages including warning night and stretch sessions retailers nationwide more a dream wave chair dot com MBA me eat Casey foundation\n\n[laughter] very welcome to the music the music through the night time Andrea Blaine there's dance music as a sort of the nature of this hour there's a ... concerto stick around to hear what that's like\nDance music of the nature of this hour there's a ... contest to stick around to hear what that's like\nCould I have I was one of the few composers to successfully pursue a completely different career from music outside of the musical we're not together in ... case he was an engineer and the pay with her\nI said something from his composing career to play is called a ... um are also played for you by camera nor to ...\n\n\n\n\n\n\n...\nOr a school who\nLive\n\n\n\n\n\n\nA\nWho\nWas\n\n\n... ...\n...\n\n\nLet's\n\n[noise]\n[noise]\nMm\nDon't\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n\nMm Mm\nMm Mm Mm\n\n\nMm\nMm Mm Mm Mm\nMm [noise]\n[noise]\n[noise]\n\n\n\n...\n... ...\n... [noise]\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n...\n\nKnow\n\n\n\n\nThere used to\nOh\n\n\nNa", "show_name": "Classical 24", "year": "2018", "city": "Carrollton", "day": "16"}