{"month": "10", "state": "PA", "station": "WVYA", "content": "This is W. B. I. F. M. eighty nine point nine and W. B. I. F. M. H. D. one Scranton Wilkes Barre hateful and\nThat will you be why eight eighty nine point seven FM Williamsport W T I O eighty eight point three F ... Mansfield and double UPA you Ninety One point five ... pack\nWith translators in ... point three and pots bill at Ninety four point nine and on the Web at W. V. I. A. dot org\n\nKill Gore Texas like what you might call a tourist destination is modest town of fewer than Fifteen thousand residents boasting a small college notable perhaps as the home of famed pianist Van Cliburn but in the Nineteen thirties [noise] do ... was a boom town\nThe heart of the vast east Texas oil fields discoveries than oil is still very much a part of the president's economy\nThe city's culture\nSince the profits from oil allowed for amongst other things the creation of some remarkable musical instruments there why I visit to kill Gore and why you should too\nTo hear pipe organ built by the famous Boston from of aliens Skinner\nInstalled throughout the region by the Williams family a remarkable groove organ technicians and most importantly designed by a colorful ... character\nWithin a ... year for the voice in an organ pipes his name Roy Harry and the instruments over which he minister dish in Mississippi\nThe year for the voice in an organ pipes his name Roy Harry and the instruments over which he minister dish in Mississippi and Louisiana as far as Washington DC but particularly in east Texas around killed or\nThese has become legends and to celebrate them the east Texas pipe organ festival was established ... years ago the next festival coming up this November eleventh through fifteenth and to give you a taste of why kill ... is an important place to be\nToday I'll share excerpts from the twenty Seventeen festival\nRecorded at St Mark's ... rules Shreveport First Baptist church Longview and\nWhere it all began at first Presbyterian Church in killed or\nWith a chance to hear marches and dances fantasies and to cut is much more\nWe reflects on what's truly are east Texas treasures do stay with me I'm Michael Barone this is pipe dreams from American public\nContinuing supportive pipe dreams is provided in memory of Wesley seat Dudley by his family\nWith additional support from Walter McCarthy clever you into the gravestone foundation from Gen ... on behalf of her Family Foundation in front of the art Martha ... under the age are key foundation in celebration of the life of Martha hulings camera\nMr contributors to this public radio station provide support as well as does parking Oregon builders of Duluth, Georgia and Parsons pipe organ builders of kind of dig when New York who are members of a poll by\nThe associated pipe organ builders of America collaborative designers creators and maintain has a pipe organ found in religious and educational institutions concert halls and residences throughout the United states and beyond\nAnd they pulled the resource guides and member prospectus is available at H. P. O. B. A. dot com\nOkay away we go to first Presbyterian Church in killed or where Alan Moore is in the Curtis Institute get started with a lively discarded by Cleveland based composer and Wilson celebrating east Texas treasures [noise]\n\n\n\n\n\n[noise]\n[noise]\nOh\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\nThe east Texas ... Seventeen we are at first Presbyterian Church in ... Texas Ellen Morrison has started off with a boisterous ... by A.N Wilson to be but\nIt's good to which we are listening to Korean family memorial Oregon was built by aliens ... was living in Seventy three in the Nineteen forty nine was\nListening to Korean family Morrell Oregon was built by aliens Skinner has their opus eleven Seventy three in the year Nineteen forty died\nIt was really Perry's first project for the company and do your books to Seventy three racks ... does include pipes struck the churches previous Boulder head coach or ...\nIt was division at the ear of designer and voice your Roy Perry that brought things together into very special way\nHis success in ... resulted in many other LDS Skinner contracts for Mr Perry at for the Williams family who did all the technical education not least of which is just a few blocks around the corner of first Presbyterian St lukes United Methodist church killed over\n\nOr or a or a or a\n\n\n\n\n\n\n\nWe took a lot of drama that are not sure whether all was thinking of the beautiful ... of this or the spy really galaxy bearing that they may be a bit of both the\nDoes seem to spiral and surely is beautiful and it's likely way composition by Paul ... played by the composer of the alien Skinner Oregon at St Mark's Episcopal cathedral in Shreveport, Louisiana which is always a must hear stop during the east Texas pipe organ festivals each year\nThe twenty Eighteen east Texas festival get underway on Sunday November the living ... runs through Thursday the fifteenth double feature at all star cast a guest are just\nHad the usual collection of Roy Perry voiced instruments plus some surprises and also great sociability you can find details with a link from us either a pipe dreams dot O. R. G. or direct east Texas organs festival dot com easy enough I'll be there again\nThe pipe dreams dot O. R. G. or direct path to east Texas organ festival dot com easy enough to be there again this year keeps that makes a difference\nThat I look forward to the great type what happy to be sharing with you these east Texas treasures courtesy of the twenty seven teams festival recordings made by like credit colleague beat the snake\nLike Michael Barone this is pipe dreams for the American public media\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\nOh\nOh\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\nA\nLittle too need an e by George ... ball mark Dwyer played it on the four main you will ... organ at First Baptist church in Longview, Texas\nIt's the next ... after your first Presbyterian he'll go or to highlight the gift chip designers Bush avoid Perry sober ball model that piece in the style of Eighteen century composer John Stanley\nWho like sold the ball you know the twentieth century was organist at the temple church in London where George likely ... played this next as opposed to its feathers the on the two Engelberg often some to the text that begins when in our music God does glorified\nAgain mark Dwyer performs at First Baptist church in Longview, Texas\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\nOr [noise]\nOr [noise]\n\n[noise]\n\n\nOr [noise]\n\n\nOh\n\n\n\n[noise]\n\nHad a premier performance there of the ... to dance by Charles Callahan in Oregon too wet conditions by the east Texas pipe organ festival in memory of Nora Williams, Oregon technician before it's their first Presbyterian Church in killed or Texas by David basking field and Thomas gain or\nThat it's ... by the way it would likely have been the very first time that ... Williams and her husband Jimi would've worked with Roy Perry on an organ installation the success of their collaboration over several decades\nHas become legends Williams family did the technical work Roy Perry the designer and voice of these instruments\nLittle back story Roy Perry had come to work at first Presbyterian Church when the multiplicity of oil wells in town required that the old church building be demolished at the new one built\nOn the lesson tempered piece of land that that new church got a new motor Oregon and it required to it seems a new person to play on it that was really Perry\nDid later after the war one thing led to another in the Nineteen forty nine alien Skinner instruments was installed and\nWell he got his hands in that process and the result is as they say history that Perry's musicianship had previously been polished by studies with another text organist living in New York City so named Hugh McCandless\nIs remembered for most of the things this next charming miniature which is titled dreams Eleanor is in place for it features the French horn stop in at the end the chives to\nDeath to dad Alan will play a piece by his teacher predecessor at the Curtis Institute John Weaver based on the hymn tune she knew nobody for all the seats in quite a number of states will come marching in if you listen closely\nAnd you can tune she knew nobody for all the seats [noise] quite a number of seats will come marching in if you listen closely but first dreams by human came at first Presbyterian Church she'll go text [noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n", "show_name": "Pipedreams", "year": "2018", "city": "Williamsport", "day": "14"}