{"month": "10", "state": "PA", "station": "WVYA", "content": "... W. B. I. F. M. eighty nine point nine and W. V. I. F. M. H. D. one Scranton Wilkes Barre equal WTY eight eighty nine point seven ... Williamsport W T I O eighty eight point three F ... Mansfield and W. P. A. U. Ninety One point five percent Palmyra township in lake woman pop packed\nWith translators in ... Ninety point three and ... ... Ninety four point nine and on the Web at W. B. I. A. dot org\n\nType marches in a truly forward you count towards passage prepare for the future to honor the pass which after all is the sound ... which are owned experience is built [noise]\nCertain mile ... do require acknowledgement and in this year twenty eight teams\nAnd so we might revisit the work of several composers have stature were born one hundred two hundred\nFour hundred and fifty years ago a civilian you would ... those brussel blended French German or the ... tradition tradition treat deep cuts republic scores Cedric feel more poor real logic to repress which two blocks heart a few\nMore Oscar American to conduct your organism ... contemporary of civilians\nPass breaker promoting its ... season others with\nNames known and unknown to fight our content here and I do invites you to stay with me for the adventure Michael Barone wondering anniversary today\nAnd bill will provide our content here and I do invite you to stay with me for the adventure Michael Barone honoring anniversaries today on pipe dreams from American public media\nContinuing supportive pipe dreams is provided in memory of West receipt Dudley by his family\nWith additional support from Walter McCarthy whoever you listen to the gravestones foundation Jim ... or be happy with her Family Foundation the ... the HR key foundation in celebration of the life of Martha hulings camera\nBut the strict contributors to this public radio station\nOr their support comes from ... pipe organ incorporated a Orangeburg Missouri and ... and it got pretty pipe organ builders of ... California members of the ... the associated pipe organ builders of America\nThe collaborative of designers creators and maintained there's a pipe organ trail in religious and educational institutions concert halls and residences throughout the United states and beyond\nThe puzzle resource guide the member perspective is available at A. P. O. B. A. dot com well to begin to caught a break Christian Airbus who was born in Fifteen sixty eight that's four hundred and fifty years ago\nHe was revered as a teacher was engaged by the city of ... in Germany but it's a silver chapel in ... broke Austria or this funky fifteenth stop Oregon from Fifteen fifty eight ...\nThe right heart drought we'll play for music of Christian Airbus\n[noise]\n\n[noise]\nIt'd be a tally in style by a German composer to caught it on the seven tone by Christian Airbus ... Berg\nRight how'd you shout plates on the ... Oregon at the silver chapel up in brook Austria the instrument ten years older than ... Airbus himself whose birthday it was four hundred and fifty years ago\nIt's the four hundred birth date of ... ... ... that we are the next day he was active at ... ... cats what's true in Brussels\nIs remembered for a single it's very impressive book of organ pieces from which ... draws a cerebral richly decorated ... the wider recorded on the debate of Oregon at Holy Cross church in ... oh\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\nMaria that's twelve operas amongst them Romeo and Juliet and particularly sauce which still are performed\nAnd yes there was a little funeral march of a merry that's helping Hitchcock made famous on TV but ... ... ... hundreds and hundreds of songs quite a bit of instrumental music virtually all of it forgotten today\nThat's what I'd call attention to a very unusual piece which was inspired by a pretty young woman who happened to play a part\nThat's what I call attention to a very unusual piece which was inspired by a pretty young woman who happened to play upon the pedal piano which was experiencing a bit of a book in mid ... century France\nThis young lady goes through her beauty and your talent that fell to the attention of Seventy year old Charles ... who wrote for a country ... sweet\nAnd do the pedal piano is not much in fashion these days the piece does work very nice the pipe organ in front of ... plays the switch Chicken Little much which is in the spirit of the no freedom it borrowed conducts the English to talk to them on the court construed this recording made at English dot because he will\nOrange to the ready fellas that celebrate Charlotte who knows bicentennial in Grand style here well\n\n\nNo no\nNo no\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\nYou played theatre organ first studied church music with the church is noble St Thomas church in New York City and composition at Columbia University where he later taught also at the union seminary\nJust ride was a very important figure on the American Oregon scene in the post war period and I think\nNearly every Oregon is probably knows throw rights pre ... brother James air it's very sweet thing\nBut uh I probably you're not familiar with this next door which requires a virtuoso technique and gets it in this performance the introduction ... and few which show right road early in his tenure as organist at St Paul's chapel Colombia\nWas inspired by Bach of course but also probably by shows order Canadian colleague Healy willing\nThere's another connection here in the instruments that will be played a part of the show writes helped design the aliens in Oregon was installed at Lincoln Center is ... I'm On a call back in the sixties\nAnd that instrument later was incorporated into a larger organ that was founded what until recently was called the crystal cathedral in garden Grove California\nAnd it is there that another great American church musician and virtuoso Frederick swan recorded the peace some years ago there over sixteen thousand pipes and this instrument two hundred and eighty one ranks than about absolutely sure that everything will be heard but I think we can count on Fred to find interesting combinations\nAnd make use of the recurring variations in the ... to provide a natural outlet for the RO kaleidoscope of tonal color that this organ provides\nSo here we are honoring the composers sent tend to read this is the introduction ... infused by ... writes rhetoric swan plays and uh okay Fred letter rent a\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n...\n\n\n\nOr or\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "Pipedreams", "city": "Williamsport", "day": "28"}