{"month": "10", "state": "AZ", "station": "KJZK", "content": "Broadcasting from the campus of Arizona western college ... border radio Thirteen twenty eight oh a fake humor and border radio ABC dot org\nWe also broadcast on the Arizona community radio network eighty nine point five FM McKay Jay Z a Drake Williams Ninety One F. M. K. J. C. P. press gets Ninety point seven\nYou're listening to the Arizona community radio network on K Jaycee a painting act like type ... Ninety One percent in Haiti became Ninety point seven kingly\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary in ... Arizona thirty miles east of ... historic route sixty six she over ... rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day now divided up Tuesday historic route sixty six\nSupport for the Arizona community radio network is provided\nBy Grand Canyon define eight miles east of William's on the interstate forty walk among the deer feeding him right out of your hand the hundreds of animals that elk buffalo boroughs camel cool watching Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near William\nHi Ken Lay you're the host of the mountain gardener each week we cover the insider tips and church for local garden that's the mountain Gardner every Saturday and Sunday from tend to eleven AM\nAsked about the current political seemed to\nMe or character characters I bet you match before ... that you've met them before to find about fate and how it affects you whether or not you know from his new album ... king electric here's ... folk alley with next card to fall\nA minute\nNot\nThem day there's no\n\n[noise] to\nYou can really do\nAnything\n[noise]\n\nAnd you could be bringing\n\nAnd do\nDo do do\nDo do we go\nIf they don't know\nTo do make you\nKnow make you\nThe little\nFriends you know\nAnd na na na\nNa\nNa na\n\nYou say\nYou cannot fly\nWings on today\nIn the news yeah\nWay\nIn the service of Hispanic heritage month assemblies library will host a fifth annual our expedition featuring the art work of local or is it continues through October ... sees that the families branch libraries and Seventy five six seven you you can find further details you my library dot org\nSlight chance of rain before noon in human today was mostly sunny skies and behind your eighty three must occur in the evening with a low of around sixty three in Kingman sunny skies with a high and you're sixteen ounce steak us up to Twenty one miles per hour mostly clearing the evening with a low of around forty four thirty percent chance of showers in Prescott state partly sunny with the high end you're sixty one partly cloudy and the ...\nIn Flagstaff partly sunny a high near fifty three slight chance of rain and snow showers in the evening with partly cloudy skies and a low of around twenty six\nI'm only to see and youre listening to folk Kelly thanks for coming along this week hope you're doing well hope you're enjoying the music so far too and of course we've got a lot more to hear this week\nSo let's keep it going with some new sounds from Lucy Wainwright Roach now she is according to writer Kelly McCartney just a master of musical melancholy you can read Kelly's review of Lucy Wainwright roaches new album little beef at ... dot com right now it's also want our mobile apps\nAnd here's what that new release sounds like\nThe ... season\nSenate Sharon\nTwo hundred and forty one year\nEasy enough to ...\nCurious to know\nCan I can\nKnow me and\nThe ...\nThe teetering\nBall really well\nThe\nUn out on the street there are two I\n\nToo strange smell catching one\nWhat did he did he\nMiss honey saw\nAny fun\nSay say are firing\nSee yeah no we don't know it's kind\nMy ...\nMy all\nLong very na\nWho's training stretching the here you\nAbove a winning Warren ally ...\nAnd I don't\nBeen moved to try\nAnd so on a U.S her\nI I'll tell you by my\n... no no no\n\n\n[noise] sure then\nWe took a chance to\nThen then\n...\n\nSee any\nBy the Malay\nKey that\nWe\nThe\n\nA couple of tracks from little beef brand new recording from Lucy Wainwright Roach that's called trouble and start things off of July\nThere's a lot that went into the making of the recording little beef you can read Kelly McCartney is review it on our website also on our mobile apps and yeah you'll find links to our on now all of our social media pages to lots of ways ... great music and news stories in your life thanks to folk galley [noise]\nGregory Allen I cough is a Boulder, Colorado based musician and his new recording his first in five years is one produced himself at home\nCalled evening machines and there's just a gorgeous story about where the title came from check out a review it for Gary dot com right now this is Gregory Allen I cough a song called St Louis\nMovie where we saw\n... those to me the the ...\nMm\n\nWhen you can't get born and raised two Thirteen twenty am a new mom on your radio catches on line at border where are you a fee dot org oh you can use it turned out to search K O F F\nYou probably hear a thing on a regular basis the border radio is listener supported so too do you contribute to border radio thank you for making everything you hear I'm just station possible especially the students internship program he's raised a port a brochure\nFirst produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and re beard publications in the world ... joined K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty to set on at St Paul's cultural center\nFor information visit K. A. W. C. dot org this have been made possible in part by a grant from Arizona humanities\nThis is Kelly in two thousand nine cruise control ... got together with friends and formed the black lilies this Knoxville, Tennessee sex tat had some success together and ...\nRecorded and then changed and now they're back reinvigorated at the core cat a black ... new recording is one that's just the joy to listen to what's called stranger to me and from it to your song called rubber well\nOr in the background or the river down by hanging no\nMore NATO will be on my way down and I went through a ...\nMile after mile of new trees\n... how\n\nThe river rules\nNa na\nNa\nRiver road we'll know na\n\nNa\nFrom the no no way we're I don't know very plain\nYou can you know\nNow the mayor\n", "show_name": "Folk Alley", "year": "2018", "city": "Kingman", "day": "14"}