{"month": "10", "state": "AL", "station": "WAPR", "content": "\n\n\n\n\nRonald score conducting the New London orchestrate an L.\nAn alpine pastures by Vivian Ellis again part of that uses the theme for the old radio show my word well it's twelve o'clock temperatures in the upper sixties north upper seventies south high today ranging from below Seventy ... to ...\nThis is Alabama public radio in the service of the University of Alabama W. H. P. R.\nCute the art shows\nW. H. I. L. movie W A L F in Tuscaloosa\nW T two three ... Tuscaloosa\nEvery case at all I have now we are we are we are we I we are Alabama public radio [noise]\nLive from NPR News in Washington I'm neuron President Trump is again criticizing the Federal Reserve board for raising interest rates calling it a ridiculous policy\nHave interest rates going up but it's slipped that's much faster than certainly a lot of people including myself would have anticipated I think the fed is out of control I think what they're doing is wrong\nThe president said he knows more about interest rates and members of the Federal Reserve\nBut he said he does not intend to fire fed chairman Jerome Powell in the past twenty four hours the president has also called the Federal Reserve board crazy and logo the director of the national economic council Larry Kudlow and said the president is not trying to dictate policy to the fed\nThe Federal Reserve is expected to raise interest rates again at its December meeting analysts say it's not likely that will change because of today's report that the consumer price index rose one tenth of ... percent last month\nThe federal emergency management agency says it's focusing on search and rescue in the Florida Panhandle today as now tropical storm Michael moved north east over the Carolinas NPR's Brian Naylor reports\nSeem administrator Brock Long says it appears that the town of Mexico beach was ground zero for the storm he says his agency is working with the national guard and first responders to access the area\nToday is a big day for us when it comes to a truly helping people and try to ah prevent for the loss of life as a result of a you know what the Gulf Coast has\nThrough an estimated nine hundred thousand customers are without electricity in the region long says FEMA is also studying a tree ... several hospitals are out of commission the storm is tracking through the Carolinas today and whether officials are warning of possible tornadoes and more flooding in an area still\nFlooding in an area still recovering from Hurricane Florence last month Brian Naylor NPR News Washington or New York\nCourt has agreed to drop part of the criminals sexual assault case against former movie producer Harvey Weinstein NPR's rose Freeman reports\nAccording to a letter from the Manhattan District attorney's office a detective took a statement from a witness in the case but failed to alert the da de ... contradicts the account Lucia Evans had given her alleged assault by Harvey Weinstein speaking to reporters went genes attorney Benjamin Brafman says it plain for his client\nThe main with us and the district attorney's office why then defective let the investigation committed what we believe to be serious for the phone book\nIt's a step back for the prosecution but in a statement the da's office says the case is quote moving full steam ahead there meaning charges against Harvey once again include predatory sexual assault hit next court appearance is scheduled for December rush Friedman NPR News New York\nIt's another down day on Wall street the Dow is down a hundred and eighty four points the S. and P. as down Twenty one and the NASDAQ is down six points [noise] this is NPR News\nThe government announced today that Social Security recipients will re SUV received two point eight percent more starting in January the increase in benefits reflects the higher cost of living with the adjustment known as cola the average monthly Social Security payment for retired worker will be fourteen hundred and sixty one dollars next year\nTony nominated lyricist and liberate us Ira gassman died on October ... at the age of Seventy six Jeff Lunden reports\nThe New York native had many careers she was just stand up comic a newspaper columnist and in advertising executive gifts been coined the phrase bounty the quicker picker upper\nBut writing lyrics and scripts was his passion in the Nineteen seventies he co authored the off Broadway satirical review was a nice country like you do in a state like this\nAnd he teamed up with composer sigh Coleman on the life of Nineteen Ninety seven Broadway musical\nThat looked at pimps and prostitutes in previous Times Square [noise]\nHave you on a day gasping also wrote radiant baby an off Broadway musical about\nArtists keep hearing for NPR News I'm Jeff Lunden in New York\nAstronaut or no Russian cosmonauts are safe after an emergency landing in conflict on today they're spacecraft was launched there but a booster rocket failed\nSales shortly after that caused the rescue capsule beaded disconnected from the building and follow the earth officials say the two states travelers are in good condition there were being sent interstates to joined the crew on the international space station I'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and it was about who pair premiering October twelfth on prime video\n[noise]\nOne wise man says it feels like a tree and others says it's ... but another says it's a silk cloth so what the heck is it\nThe Oregon Symphony has the answer with a piece of music about human perspective by Ken gee bunch on the next performance today from a piano [noise]\nAnd then by the way will be coming up in about an hour at one o'clock here on a PR\nI'm David duff it's twelve of six and support for this hour that we call something old something new comes in part from the friends of Birmingham botanical gardens allowing opportunities to explore Alabama's reach bio diversity through its certificate in native plant studies program\nClass registration and more information at BB garden dot org slash see in BS and\nWe'll begin the hour with a violin concerto by Louis store is violin concerto number five ... violin and the Berlin radio symphony\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\nAnd then\n\nThen\n[noise]\n\nAnd\nUm [noise] [laughter]\n\n[noise] and um\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\nUm\nI'm a\nLimited da\nDa da\n\nDa\nDa\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "show_name": "Something Old, Something New", "year": "2018", "city": "Selma", "day": "11"}