{"month": "10", "state": "AL", "station": "WAPR", "content": "\n\n\n\n[noise]\n\n\n\nThis is Alabama public radio in the service of the University of Alabama W. H. P. R. selling ... P. R. Michael shelf\nW. H. I. L. movie Wu A L FM Tuscaloosa\nW T two three ... Tuscaloosa\n... or I may though we are we are we are we are we are Alabama public radio [noise]\nWashington I'm Lakshmi Singh investigations are underway in the New York city area in Washington DC into suspicious packages such a prominent organization that political figures yesterday and today\nTo federal law enforcement officials tell NPR the packages addressed a liberal billionaire philanthropist George Soros former president Brock Obama and the two thousand sixteen democratic presidential nominee Hillary Clinton are quote similar in nature\nBut it's still too soon to say if the incidents are connected to each other or the suspicious package that prompted an evacuation at the CNN broadcast center in New York today moments ago police commissioner James O'Neill disclosed more details about that\nAre starting off since identified a device that appear to be a live explosive device\nIt might be de ... responded to secure the device in removed it for investigation\nAdditionally there was an envelope containing white powder\n... security device and remove it investigates\nAdditionally there was an envelope containing white powder or was discovered as part of that original packaging and we're in the middle of investigative right now\nNPR's David Folkenflik is following developments in Manhattan\nCNN anchors puppy her Lewin Jim Shooter were hosting the program why from there said at the center of the networks Manhattan newsroom when alarm went off to signal to evacuate the building\nThe networks had to throw the hosts in Washington DC\nHer loan shooter picked up their live broadcast from the streets near Columbus Circle\nThe anchors had been talking about a series of suspicious packages addressed a prominent liberal political figures earlier this week an employee of liberal investor and philanthropist George Soros called police after identifying a pipe bomb in the mailbox and his suburban home outside New York city\nThe secret service said intercepted suspicious packages center former president ... Obama and former secretary of State Hillary Clinton David Folkenflik NPR News New York\nThe White House is condemning the attempted attacks on former President Obama and former secretary of State Hillary Clinton and peers Asia Roscoe has more on the Trump administration's response to the\nWhite House press secretary Sarah Sanders says the suspicious packages sent to Obama and Clinton were quote terrorizing acts\nShe called them despicable in a statement calling for those responsible to be held accountable to the full extent of the law\nThe packages which contain potentially explosive devices were intercepted by the secret service during routine screening procedures\nThe suspicious devices come as political tensions run high ahead of the November midterm elections President Trump has repeatedly referred to Democrats as an angry mob while political figures on both sides of the aisle have\nFaced threats of violence Ayesha Rascoe NPR News Washington\nThat Saudi crown prince is making the rounds among prominent leaders attending his investments in Riyadh the event is being held under a cloud of suspicion surrounding the Saudi royal families involvement in the death of us based journalist ... earlier this month this is NPR News\n\nThousands of migrants most of them from Honduras are still pushing north toward the U.S border they said about before dawn from southern Mexico the group which the un estimates to be around seven thousand faces more than a thousand miles of travel\nAre hoping to cover a very small fraction of that over the coming hours many of the migrants including people of all ages individuals\nMore than a thousand miles of travel\nAre hoping to cover a very small fraction of that over the coming hours\nMany of the migrants including people of all ages individuals and families say they left home because of violence and poverty but some were too tired to keep going Mexican authorities say an additional five hundred migrants have accepted the offer it to be bused back to their home countries [noise]\nEuropean Union lawmakers had voted to ban a wide range of single use plastics in an effort to fight pollution and sees and waterways that may Nicholson reports that member states will also be obliged to recycle Ninety percent of plastic bottles by the year twenty twenty five\nAnd he's a welding majority in the European Parliament has such the motion to ban plastic products which therapy vantage alternatives\nThan usual states set by twenty Twenty one plastic heightened such strolls in boats and pulled us tiring phosphates contain it will no longer be permitted on the market the legislation will also affect fishing that's considered a major collisions in the Mediterranean Sea and the Atlantic ocean\nMeaning that they will need to be produced using different materials the Lakers have also added products made if ... found on the basis that they didn't break\nDown city for NPR News I'm Esme Nicholson in Berlin the Dow is down one hundred Ninety One points this is NPR\nSupport for NPR comes from NPR stations other contributors include constant contact who's automation feature allows small businesses to deliver emails or a series of email campaigns to their customers learn more a constant contact dot com and the any Casey foundation\nDuring the friends of W A L and help with the ... back in public radio joined afternoon of good food beer trivia and music with proceeds benefiting the radio station you love\nYou been takes place Saturday October twenty seven from two to five PM id which city Brewing Company in Tuscaloosa bosses include fits architects left hand so company in Tuscaloosa tickets are available at root city Brewing Company on line and at the a bit\nMore information at a PR dot org slash the top of it\nGood afternoon it's twelve oh six times for something old something new here on NPR\nAnd today something ... something new supported in part by the Tuscaloosa symphony presenting a little night music speech ring to Mozart CERN aids to usher in the holiday season coming up on Monday in November nineteenth that first Presbyterian Church\nMusic the drink to Mozart Sarah ... the holiday season coming up on Monday November nineteenth ... first Presbyterian Church tickets and more information that she is a long line dot O. R. G.\nAnd we'll begin things this hour with some music for the guitar music by Enrique grad Otto says poetic waltzes they're formed by Tom Kirsten\n\n\nSee\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\nTo\n\n\nThen the\n\n\n...\n\n...\n\n[noise]\n\n...\n\n\n\n\n\n\n\n[noise] [noise] Mm\n\nPoetic waltzes by Enrique Granada does there were performs on the guitar by Tom cursing\nI'm David Dopp it's twelve twenty two they say something old something new and the hour today is supported in part by ... gardens and home presenting fall outdoor cascading chrysanthemums daily November tense through the twenty first\n... drink cascades of chrysanthemums on bridges and balconies and arranged in floral towers in Sears throughout the gardens information that bell in grants dot org\nAnd support also comes in part from State Farm agent Allison harder at mobile offering the full range of financial services in addition to auto home motors health and life insurance\nOnline that Alice in order dot com [noise] this piece\nBy Michael wailing called the shadows of October kind of a metaphor in a sense for the latter years of life as the shadows began to set in the ... Michel Estrin the shadows of October by Michael Wally\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nYes\n\n\n\nMm\n\n\n\n\n\n\n\nMm [noise]", "year": "2018", "show_name": "Something Old, Something New", "city": "Selma", "day": "24"}