{"month": "10", "state": "TN", "station": "WPLN-FM", "content": "This is Ninety point three WPN land Nashville public radio Ninety One point five W ... in Ninety One point seven W. H. R. S. Cookeville get the latest stories from WPN lend news throughout the day and connect with National Public radio via Twitter and Facebook at W. P. L. N. dot org\nYou can also find scheduled for all of our program channels and listen to a live stream of any of our programming on line learn more about connecting with Nashville public radio at W. P. L. N. dot org\n\nMissing grass breakdown it's a natural number between twelve and fourteen\nBut it's far more than that\nThrough the ages it has been shown and feared for sinister quality\nIt's a number that engenders stifling superstition\nDid just that just lose bad luck\nAnd our a harbinger of dreadful things to come\nSuperstition bad luck and dread no wonder that number has provided fertile ground for bluegrass local expiration\nDates and they help with Don Riggs me well strong the box cars Katie pin and tasty legs will be venturing into the world of Thirteen [noise] coming up\nThis it was a bright cold day in April and the clocks were striking Thirteen edition a bluegrass breakdown\nBack in the old days when hangings we're a public spectacle the gallows were built with Thirteen steps\nOn a blazing hot day on July seventh Eighteen sixty five Mary ... climb those steps to hang with three others for the assassination of Abraham Lincoln\nShe would become the first woman to be executed by the federal government\nUntil the end cheaper claimed her innocence to this day many consider she was unfairly tried and sentenced the evidence against her was sketchy and it didn't help that she was a suspected Confederate sympathizer and met her boarding house was alleged to have been a safe house for rebels spies after\nClimbing those Thirteen step she was placed to the right of the others a place of on her when she complained about the binds on her arms being too tight bag men remarks\nOh Chris Stewart tells a story in their teams that\n[noise] [noise] [noise] [noise] this mounted high who\nWell\nTo the sound of the\nMiddle of the guys who voted on top of the presidency today I Will ... ... ... and don't you\nRead the mind you know the ... I can stand in the bank but\nMy mom about it as a loose do the same man it's just\nA one man pulled the trigger to man told ... dream man will hang with me and third change that we were climbing\nMarriage against a well\nMaybe not sixteen\nYear we did a Prince George's county\nTrouble there were few\nJohnny ... really bad\n\n\n\nCivil registry\nPassed without ever as friends on muscle\nDefend the law to watch store\nWhere he had\nWhen I saw was\nWell it is through ... killing so good\nTo hear it you know\n... with my last breath we don't let\nThe\n\nThird dreams that\n\n\nOr steward in that country singing Thirteen steps the story of Mary ... tragic death taken from his cricket man release\nWell howdy friends and neighbors day digs here welcome you to bluegrass breakdown in a tough ... grinding look at the numbers Thirteen no one really knows how the numbers are in such state in the far east reputation some say it's a reference to do this is scarier who's the thirteenth person to take a seat at the last supper\nOn friday the thirteenth Thirteen those seven king filled the force of France or the arrest torturing and murder of the knights Templar\nOthers theorized that has something to do with the solar calendar twelve months in linked being adopted over the lunar calendar of Thirteen\nWhatever the reason the numbers Thirteen has someone usually heavy baggage it's also notes that number is Don Riggs be illustrates with little white cross out on highway Thirteen\n...\nYears\nThe audience will re created this ...\nUm prayers and stand up to him you know not only shelter our loved ones from Hong\n... out on my team\nGame man\nGirls marine\nParable ...\nMostly\nLittle hot crawl sound on highway player\nRead you a she and her breaks to\nPlan for that friday night or down at school from\nHand sewn Freddie\nCounty and beating\nDown on the high wire sun dried again\nNow why ... Hi Tina\nOur game and a baby girl and a\nBull legs would be terrible\nMan on my crawl salad\nHas to grow news like close to the highway\nLive why ...\nDid we play to it helps to bay to\nShare with the world are most ... blue loans\nDown the hallway\n\nMm\n\nWhere ... investigating truth ... could phobia fear of the numbers Thirteen so we had buildings with no thirteenth floor products with nearly eight Thirteen on their labels along with a healthy fear a friday the thirteenth you maybe just\nYou're the box scars ...\nDo you remember\nHer that Red Bull non\nDo the December\nLost their lives\nLet me expand the man doesn't mind\nOn gay marriage playing in\nNext day\nIt was founded on the beach to\n... ...\nYour ...\nWhat I ... I'm Still you\nLove me I'm In a\nBehind the cockpit\n\n\nAnd tavern in town\nThat bombs me around then she ... she has been shown\nSerena street in town\nThat I aged ... down\nStory a mile\nNa na na\n...\n... and\nThat while three around dancing fan guy and then the band golf and\nA mom and dad and my big brown and how they do the do dads the ban go in and said she ran or\nAnd drugs and wine\nNa na na na\nNa na\nDa\nDa da da\n\nNa\nIn there and it's all in\nBack while three around all\nMen young men the\nA guy on the ground\nThat the men do\nThen the bad guy or\nThat you met a man and one\nAren't paying the bird\n... ... ...\nNo no no no no no no no no no\nQuarter can't drill playing that just a few feet shy of the speed of light on eight Thirteen from his shadow CD\nI'm David eggs and we'll be looking at the number Thirteen appearance in bluegrass story in song upon or return from a break\nHere on bluegrass breakdown\n\n\nWe have returned with a number Thirteen still nine fixing to unveil a rash of songs mentioning that dreaded number including this country gentleman classic from Nineteen Seventy one\nThe words came from a song someone handed to bilk lifted at bills request John ... wrote a new melody bill recorded this song in Nineteen sixty five but didn't release the same until after Nineteen Seventy one\nThere was an episode of rod Serling twilight zone that mirrored this song but the storyline had been around since the late Nineteen century these are the gym in bringing Mary home\nBut Thirteen Years ago today a wreck just down the road or darling Mary last July and we miss or so\nI was driving down along the road or the dark and stormy night man when\nI went a little girl about\nI thought oh and she got him back in in ...\n\nShe said my name is Mary man's home gym they can be how\nYou must have been much more I don't know\nThere was something on the screen on a trip out\nShe says oh man I ... in the back on me at all or no\nNever forget that no I don't mean to me how\nI was in the driveway where she\nGot out I go\nLove to do\nBut I just I mean the ... the bag was\nI Love a around or\nMaybe in the U.S and uh in\nA light show from the\nUp the dog\nThen the lady ... brush her what\nShe said it was nice to go to a lot of your\nThird oh let's go to Rick ... who\nI ... into a whole thing to ... and the kindness and ...\nAnd that's why it was banned and bringing their name whoa\n... ...\nSounds there goes my hair green ...\nMan ever saw\nSolid gold in my head in the Latino vote on it may be\nI guess ... na\nI just remembered ally Thirteen word to say goodbye Atkins in Loudermilk with we'd run their self titled mountain fever excursion\nIn the country gentleman went first with bringing Mary home there's actually another burst to the original urge that the jets apparently forgot about when they recorded the tooth too with a night shown from the porch someone opened up the door\nAnd as I Walk towards the house I wondered more and more what happened to that little girl so frightened in for lord\nGood I've just been dreaming bringing Mary home you're hearing about last verse\nRadio Nashville, Tennessee where the breakdown is produced by Scott Smith we've got to pass programs bluegrass breakdown dot com and can be reached at bluegrass at W. P. L. N. dot ORG\nIt was Jimmy Rogers last blue yo and it's probably no coincidence it was his third cheap blue yo this is tasty looks and blue yo number Thirteen when they can fool out of me\nBomb\nOh no\nThat she can say", "year": "2018", "show_name": "Bluegrass Breakdown", "city": "Nashville", "day": "07"}