{"month": "10", "state": "NY", "station": "WOR", "content": "That's great and have you started production yet or where are you in that part of the process\nI have the first production run minimum order a minimum and minimum quantity that could have orders five thousand unison for Eighteen different styles and colors available in my ... [laughter] them\nOn your website where do we find these\nThey will be on our website I just received them and the website is be updated so by the end of the week all the different styles are going to be on the website as mobile with with a Z yes mobile with usa ...\nM. O. B. I. L. E. W. i.s the U. S. A. dot com crash and we'll be able to order 'em at the end of the week yes awesome I Know what I'm getting Richard for Christmas\n[laughter] limited as to the surprise [laughter] I don't know I'm going to get one of everything leaders here today I'm into it a lot of that credit card [laughter]\n\nNo matter what no [laughter]\nI didn't want an awful stuff [laughter] end\nOf our pitch time that was fantastic Damian thank you and uh we're going to take a break W O R seven ten\nThere's never been a better time to start your own business the opportunities are infinite and only limited by your imagination and enthusiasm gearheart law we believe the most successful companies all have one thing in common they start with a solid foundation\nFirst gearheart law has years of experience\nProtecting entrepreneurs ideas and brands using patents trademark and copyright protection so if you have a new consumer product a new software application that you're planning to build or sell for a brand or company name that you want to protect contact the experts at W. W. W. dot gearheart log dot com are professionals\nWill create at customs strategy designed to fit\nYour needs and your budget all of our attorneys are passionate about protection license and qualify to represent you before the United states patent and trademark office down starch or project without calling us\nFirst visit gearheart law dot com together we can change the world visit G. E. A. R. H. A. R. T. L. A. W. dot com is that has been read by an attorney spokesperson passage\nTo profit continues with Richard and Elizabeth year hard\nGlad to have you back to passage to profit on W O R we've come to the end of our presentations this evening and they were all great\nThey for a great presentations and now I promise not to take out another credit card to pay for [laughter]\n\nI'm so glad that we had such great people in our show all talking about one of my favorite things money\nAnd remember everyone to go to the passage of profit page at your heart law dot com that's spelled G E A. R. H. A. R. T. L. A. W. dot com and there you can vote for your favorite project\nSo the pitch us we have this evening the first pitch was Janet Ryan spectra spray global\nVitamin spray second pitch was Delaware and Barbara Davis the wheel ram assembly for changing tires which I Confess I don't really understand but everybody that has ever change a tire is like oh my God this is going to change everything and and\nI'm Damian winter with mobile whiz which is a very cool product that I think that we all need\nSo now go to the passage to profit page on the ... law websites both a G. E. A. R. H. A. R. T. L. A. W. and make your choice remember you can only vote once and you have until next Sunday at seven pm to vote this evening's pitch contestants will also receive a passage deprive a T shirt\nAnd the best overall vote getter for the month will receive an Amazon gift card\nAnd before we sign off thank you to everyone who participated today an Adam for being our special unexpected guests but it was pretty cool how many here I Love hearing the pitches each week and you know I'm not going to be able to vote on which one is my favorite because I Want them all and love the tired things for richer\n[laughter] she's saying we'll rooms resume [laughter] like I Would you change that might not anyway I think\nThese inventions really show human ingenuity at its best and they always say that every week but I really feel that way and that's what I just love about being in the entrepreneurial space\nOr maybe you could give us some final tips here on what are they\nThree things that our listeners should know about credit and maintaining good credit\nI Would think the the first thing would be understand the ... credit in good credit come from it's more of an internal issue um if you have bad credit you need to look at the reason why you have the credit is utterly observation\nIs that you're about spending um you know address the internal issues related to the credit issues themselves secondly I Would say parents do a better job of educating your kids are related to credit information\nUm there's so much stuff out there um there are so many predatory lenders are waiting for your kids and college as Richard said earlier I'm not sure you educate them understand too\nThat there are ways to build credit without going into bed and applying for like I said earlier there's ways to report your rental history there's ways to save money and bill credit at the same time so I look at the different options twenty Eighteen no one should really have shady credit\n[laughter] Elizabeth had mentioned are some contest good us this morning via text about getting a second credit card and he said well one of the justifications for was well helped me build better credit and my response to him was well that sounds like an advertising\n[laughter] bad for you to court [laughter] So Adam ... any parting words\nYes I'm One of the things I thought of was fuss about a pitch is that each of them how to target audience um this it's very easy to be very very ... there are lots of very very bright people in this world um but each business I Do have to have an in customer\nOr a price in customer can afford to pay\nAnd reason weren't contributes to the ... in in general because it doesn't it doesn't make sense about ... could influence the way we think about the pitchers and uh I totally agree with one of the credit she can probably tell a bubble else take responsibility for your credit position\nI don't live to learn to do it for you it's your money\nAnd spend it wisely forward wisely\nThat's great advice and um I remember once I was reading a book about photography\nAnd the author of the book was something of a ... he was a brilliant photographer some beautiful black and white pictures but he talked about the equipment trap that photographers can get into just buying new pieces of photographic equipment and you go to the catalog\nYou get all excited about it and you you spend money on your on your hobby and he said I Would not buy a piece of equipment for photography unless I thought about it at least for two months before actually\nExecuting the order and making sure that this was a piece of equipment that I really needed and he said I had recently spent six months debating on whether I needed a second pair of tongues for my dark\nRoom that sounds like you [laughter] know one more [laughter] when we moved\nTo New Jersey from Atlanta and housing prices were unbelievable ten times that we were paying in Atlanta for the same thing the bank okay that's for double what we thought we could spend and is real estate agent was showing us these houses that were like\nI don't really think we can afford this in the bank was like oh you know so we bought a house half of what the bank said we could borrow and we were really glad we did because then when Richard started his business we had the money for that\nYou have to kind of plan for a rainy day right and you have to be a little conservative\nBut you also have to be smart I mean it was a good investment for us and I'm I'm Glad that we did that\nAnd Elizabeth who likes to spend money to do with a little bit more than I Do is kind of taught me it's okay to have fun once in a while and enjoy the fruits of your labors too so you can't be so constrained that you never enjoy anything either I wouldn't be on your part and joy\n[laughter] credit\nCards can be a trap they can be a necessary evil for your business as long as you know you can pay it back but\nYou're losing money every month when you're paying a credit card so in that\nNo now you've had your lecture for today [laughter] we would like to thank you and all of our pictures and our producer email us ... and our sound engineer rod Barrett who really makes the sounds good on the radio and\nOur media made in Kenya Gibson and the whole I heart teen and don't forget to join us next week for another excellent speaker and another round of pitches and your listeners can start thinking about what your pitch will be\nAnd don't forget to like this on Facebook Instagram and Twitter this is Richard and Elizabeth your heart and I hurt with passage to profit W O R seven ten the voice of New York [noise]\nThe proceeding was or paid programming W a large airing of this program constitution either an endorsement of the products offered boy the ideas expressed Shelley you are you a ex kill eight detail in New York\nSays talk station you'll see rated number one seven\nAnd W. O. R. voice of New York and\nAnd we have fifty five degrees at nine o'clock at evening I'm sue guys men former CIA director John Brennan says he believes that Saudi Arabia is likely behind the disappearance of Washington Post journalist ...\nTo into because we're in New York City and choices because we truly believe you have choices can call us at two and two choices I Would talk about a sixteen\nYear old man this is a religious man he was born in Israel and they came with a sarcoma he's married he has twelve children they came with his wife or a valuation of a recurrent five boroughs sarcoma circle Missouri cancers of the connective tissue and we talk about a lot because usual treatment doesn't work very well and so many people come\nHere for treatment of their sarcoma the first I was diagnosed Twenty years ago the mess in the shoulder\nAnd Rick courteous surgery it didn't work cancer grew back the flying key as\nMetastases and the ... pelvic bones spine even on the lip is a big lump the size of a marble on his lip get a massive massive his pelvis his eyes are basketball's unbelievable I one point I put my arm around him and his masters just sitting in my hand like a basketball\nAnd because of the masses he has difficulty walking walks with a Walker he's had numbness the leg he's dropped forty pounds he went from two hundred and forty to two hundred and two pounds and he had this a mass and the hip growing he had pain and he's got a narcotics and he's been one of the biggest\nSuper duper hospitals in New York City and they just caught on him they cut a little bit here they cut a little bit there that cut on his arm that cut on the shoulder for the cancer these big masses are keeping on growing and not doing anything about it he has cancer growing through the say curls\nFine and then the pelvis has a fracture in his left hip this elliptical Asian which means that cancer's eating through the bone and he's been the biggest hospitals and no one's taking on this\nThe problem I examined him hit a mass\nAt the bottom of the stern them as a big mess at the how was it a big mess on his lip is they'll pass it all up like a big marble that's all cancers cancer growing through the skin his mass\nAnd the power of us was huge and well he's been around town it's been that all the big hospitals super duper pooper scooper Z and they weren't able to help him there are treatments or surgery and stomach therapies did not help him he came here first started this massive\nMassive the power was really it was a huge one of the largest cancers rhubarb are treated\nAnd we followed up because it's all up scans people often ask Dr leader was how do you know your treatments work and how do I know my treatments work and that's a very common question and everyone pretty much gets the same answer that is that we follow up every patient we get follow up imaging scans blood tests physical exams cancer marker so you know\nAnd unlike most places we gave me the reports in your hand so if you came to us and get a\nCAT scan or PET scan usual you'll have the report\nIn your hand the same day so you can go home and study it so you can see it's the gobbledygook were telling you that in an independent radiology group is independent lowly evaluating your cancer your treatment and you take home that report and analyze it which\nIs so different than most every other cancer place which doesn't give the reports are often obscures the results thought here\nWe are straightforward we believe we work for the patient we do not work for the president of the hospital or the pharmaceutical industry or the drug company or the surgeon you ever won bars because we're an independent cancer treatment center independent cancer treatment center means or independence\nOf a president or hospital telling us how well we should do with our patients that we have to cut on them are filled the operating rooms or do this no\nEvery patient is treated as if they are the president of United States of their body and to me and to us each patient is the president of the United states of his or her body so for this man with\nMet a static stage for sarcoma but not all the super poop or big places in New York and their treatment doesn't work finally here at Radio City New York he's had successful treatment in Spain is relieved at the mess in the lips going away and the big monster masses\nPower but as a spy is finally going away after years of unsuccessful treatment for them to delete Herman if you want to make an appointment to get a book with\nA DVD we are books about brain tumors body cancerous prostate cancers while I get a second opinion a strategy of radio surgery we have multiple DVDs we have them to the multiple languages so many reasons to give us a call at two one two choices if you want to one two choices that's to one to\nTwo four six four to three seven and if you want\nMore information some people want two or three books as well then\nCome into our office were open Monday through friday normal work hours come into our office at Thirteen Eddie for Broadway or in the middle of Manhattan close to Times Square and Harold square and Macy's in Penn Station and fourteen subway lines one two three four five six say see and Q. R A M B. the seven\nAn ass and all the trends that come in New York all the subways all the buses we made our office to be convenient for you over I pack\nFor cancer treatment most prefer effect of non invasive well tolerated outpatient therapy\nThat Dr lead them in the radio surgery par News Go to\nFirst in America first in New York first for you with\nBody radio surgery Dr lead them in hits your cancer with no cutting no bleeding Lederman has decades of experience with primary and met a static large or small cancers\nFrom head to toe cancer treatment with possibly a second chance for you even if chemo radiation or surgery didn't work or isn't tolerated\nGoals are best results and quality of life\nMeat duck to lead them in these New York's only Harvard trained triple board certified radiation oncologist called two one two choices two one two choices to meet Dr Lederman most insurance as Medicare Medicaid accepted free book the DVD to super convenient Broadway in thirty eight\nIn Manhattan meet Dr Lederman to hit your cancer called two one two choices two one two choices\n[noise] looking back to the radio surgery our doctor Gilead him in the leading cancer prostate cancer ... in New York for ... native brain radio first America\nIn the western hemisphere ... radio surgery you can also call Dr Lieberman at killing killing them for free informative and DVD hey Dr Lederman why\nWe are back fend them happened to be with you and I would take about a fifty five year old woman she was born in New York state she has two children she has a breast ...\nAbout three years ago she had a biopsy was okay shed her uterus your mood or two thousand four team that was okay and then two years ago she started coughing and that a chest X ray and those CDs scan that every three or five months she had a growing mass in her lungs and of\nCourse I should say not of course but she is a smoker most\nLong tumors cancers aren't smokers but not all of them some of them are people that second hand smoke and summer and people who never smoked a number a second hand smoke but she had a growing mass in her lungs for two years members has only fifty five and well she had a biopsy in the ... showed\nAdded no carcinoma let's say\nCancer real cancer aggressive cancer at one of the super\nDuper asparagus hospitals in New York City and she was seen by threats ... surgeon and he told her she had to have surgery\nAnd she declined which means you'd rather die than have surgery and she asked her there and the other options and he told her no wild I wasn't a very good answer by a super duper surgeon at a super duper hospital he could have told\nHer doctor Lederman was first in America with body radio surgery such a Lederman has treated thousands of lung cancer is with invisible beams of radio surgery to attack the cancer he could have told her that that's what they should have told her he could have told her look if you want to remember he used a perfectly fine surgeon\nBut if you open up the long that's anesthesia and hospital on incision and the fighting the long and chest tubes and pain and probably a week in the hospital and the recovery ... doctor Lederman you come in there at twelve o'clock and get a treatment and by twelve Fifteen year over at Macy's or times\nSquare or you'd do without cutting out without bleeding so it's a big difference between Dr Lederman pinpoint\nRadio surgery and surgery and that super ... for a place\nWell she came in and we're viewed or pathology review scans reviewed her pet\nScans she had a PET scan done\nAbout four months ago she continues to smoke and I advised her to stop smoking of course her way there's a hundred and sixty five pounds she gained five pounds recently or hide is five foot six she had her last semester period when she was forty seven when she had a hysterectomy but hot flashes started at age fifty one\nUh shed some headaches we offered MRI which she did not watch it a needle biopsy four months ago so she has a real cancer in the long biopsy proven mass and\nWe spoke about all the options I'm happy to speak about all the options of course someone can choose no treatment of cancer grow to me that doesn't make much sense or she could have surgery which was seen it a perfectly good\nPlace a perfectly good surgeon if she wants someone to open up or chest but she didn't want that\nShe wanted pinpoint non invasive treatment we pioneered that we have the most experience and every doctor says you go to the physician with the most experience and who has the most experience of America well that is they clear point so we saw her she decided yes she wants to get going\nWe offered treatment and how to do work well who made a star tactic frame\nCustom made for her found the tumor relationship to her body and the frame and then computerized everything and sending thousands of beams and visible beams to attack the cancer and I can tell you that our success right where we attack the cancer is quite high the most commonly can stop or shrink or make that cancer go away for the rest of her life\nOn saying well Dr later my what do you do that they don't do and I said well number one we give you information you've been at all those hospitals and no one passed out the information to show that the surgery for a Gleason seven will give you a sixty percent success rate compared to our Ninety percent none of them gave you that and none\nOf them showed you the with open surgery robotic surgery most likely this man who's a husky strong fifty seven year old man plus likely he'll lose his sexual function and most likely you'll lose urinary control I don't think you ought to be a fifty story building paying in your pants I don't think so and\nThen she said well if he had surgery is going to be out four to eight weeks I said well that's probably right and some people never go back or some people don't make it through surgery we know that as well and she said well what do you do differently I said well each patient\nIs unique each doctor is unique and each doctor has his own or own style and we tabulate\nOur data and we give our data to patients and she saw that with us he has a Ninety percent chance of being cancer free and it's probably even higher because as a low PSA that he's working\nThree eleven on the high rise buildings putting together the steel beams and I said if he came to us he works at ... yards who are just a few blocks away I said if he could have is treatment at two o'clock and go to work at three o'clock it wouldn't miss a day of work compared to having surgery four to eight weeks and\nLosing is sex life probably using as urinary life and all these sixty percent success rate compared to our Ninety percent what a difference\nAnd she said how do you do it's actually I said well\nI'll show you how you do it we use a star tactic frame to treat patients and we put in radiation seeds and then we do it each doctor is different each doctors unique each doctor as their own style and then they showed her famous hospital in York pa tries to copy our work at it\nIn his category our success rate is Ninety two percent and that famous hospital in that same category trying to copy our work is Seventy two percent she said I always I said what each doctor has its own\nStyle and methods and just like an art form to like your husband is a steel worker and probably not every steel workers exactly the same or that every artist is the same ... piano players to say this is our data this is why it's so important and this husband\nAnd wife had investigated so many hospitals up and down the east coast they took his so seriously they were smart to investigate it get data to think about it or not\nTo jump in there were so smart and one of our listeners I Believe recommended they come to search for Broadway for a fresh second opinion and I believe that there are grateful that I think that they now understand that the risks are so great and that robotic surgery or open surgery or nine weeks of radiation will not\nGive them what they want they want I Believe the best chance to be cancer free\nThe best chance to keep sex life had urinary lived to keep their marriage and to keep his work\nAnd most likely with us that can happen and most likely it will happen and that's why we work as a team\nWith great people at Thirteen it before Broadway every day treating patients with cancer and brain tumors\nNew cancers recurrent cancers small or large most anywhere in the body that's why we have a book where we spend months and months to put it together that book was on prostate cancer we also have a book called on body and brain cancers and You're welcome to call her office at\nTwo one two choices two one two choices which is to one to two four six forty two thirty seven and get the book with DVD or male to at no charge or you can come in income and during the work week Monday through friday and get multiple book with many of our listeners pickup multiple booklets in the hand\nThem out to their friends and neighbors they had them out of church or synagogue or mosque wherever to make sure that they're\nFriends of other people know that there are choices out there so important for every person every person that always talking about a gentleman who's forty four years old the carrying with his wife and daughter he works\nAt a professional company finishing floors\nYeah chest pain yet a mass in his chest years ago Twenty years ago and he had Hodgkin's lymphoma money received treatment and he's done well and then recently had a mess in the right neck and he had radical surgeries ... cancer it was at one of the super duper biggest hospitals and the cancer traveled traveled\nTo the lungs and to the left opera long in the lower long and it\nShowed square Amos carcinoma and then he went to one of those super is going on so many super duper big\nHospitals and other super duper big hospitals found cancer and the trachea they were biopsy and were\nPositive for cancer the patient started chemotherapy and then stop chemotherapy 'cause he just couldn't take it he said tightened the ... voice has changed a difficulty swallowing is way now is gone down ... two hundred and eight pounds\nIt was two twenty five before with a high to five feet eleven yet nodules almost a year ago diagnosed and the trachea he had a biopsy showing that proving that then\nThey open up part of his lung and cut out part of his laptop for logging lower long at one of the\nBig hospitals and uh well\nDo you learn a lot of lessons here that is that you don't need surgery to treat stage for cancer we could have printed the mess\nIn the long noninvasive leave without cutting or without bleeding our success rates very high would have voided the hospital stay and the infection and the bleeding in the chest to been losing his lung capacity when surgeons removed part of the lung you remove part of your\nLung capacity their ability to breathe that no one wants that that's another reason we brought body radio surgery to America when every hospital every doctor every facility thought standard treatment was okay\nOne doctor stood up and said no\nThere's patients like this man who was a mess in the logging why don't we just treat the mass with pinpoint treatment\nAnd avoid opening up his chest and the void him losing as long as a void that hospital stay in a void the pain and the anesthesia the chest to but the ivy isn't the bleeding why not and that's what most commonly happens here\nAt radio surgery in New York were printed tens of thousands\nOf patients were located searching for Broadway we information to send and we treat patients like this man even in the trachea so luckily for him he came are going to stage 'em up we're going to see where the cancer is going to talk about options when clearly the surgery that super duper\nBig place doesn't work their chemo doesn't work they've cut them open repeatedly and the cancer keeps on growing\nFinally he's come to thirty for Broadway registered in New York home of stereo tactic\nBody radio surgery in the western hemisphere times after Lederman I'm a board certified doctor actually triple board certified board certified in medicine medical oncology radiation trade at Harvard Medical school but in New York for Thirty years practicing the license in New York Thirty years\nTreating your friends and neighbors even if you probably didn't know about it so often I Walk down the street and say hey Dr Lederman you treated my aunt well probably I did and that's just how it is you can call\nOffice if you want at two and two choices to one to two four six four to three seven to one to two four six four to three seven you on a book with DVD or employment renting a short break\nI'm Johnny brags and I'm here with Dr lead them in my prostate cancer doctor ten years ago I had prostate cancer today I'm cancer free my PSA zero\nThank you Dr Lieberman I Know the power of prostate cancer my uncle died prostate cancer must step father died of prostate cancer a no prostate cancer can be devastating that's why I went to the doctor Lederman\nFor ten years my cancer has gone my sex life works my year in every life works\nI was able to avoid radical surgery and all the complications with Dr ... treatments my prognosis is great I'm happy that I went to ... lead them in the changed my life you can see Dr lead them to call him at two one two choices two one two choices\nThirteenth eighty four Broadway at thirty eighth street even takes most insurance is Medicare Medicaid see Dr Lederman two one two choices two one two choices\nWelcome back to the radio surgery our doctor Gilead I'm In the leading cancer prostate cancer ... in the first the New York for ... brain radio surgery first in America\nAnd in the western hemisphere body waiting surgery you can also call Dr Lieberman at killing killing for free informative look like and DVD hey Dr Lederman whereby\nWe're back and then we have more patience is cause more things to learn again you can call her office if you want for an appointment or a book with\nNumbers you know it was two and two choices talking with a man and it's really a sad story is Seventy six years old and he's widowed he has seven children is is to have diabetes and high blood pressure and cholesterol\nHe never smoked but he lived with a smoker for forty seven years it's another case we talked earlier today about a person who got smoke exposure from their dad lived at home for Twenty years lots of smoke this man's\nSpouse was a smoker for forty seven years his late wife and she died of smoking related cancer now this man\nHas a cancer of the power which is a smoking related disease he's now coming in with a coffin voice change in regard to ... and his weight went from a hundred and eighty down with a high to five foot ten hit a biopsy is ... cancer he had a PET scan and\nI should tell you by the way this all happened last year he had a force centimeter mess on his voice box and involvement of the right neck and left slack and growing so he came to me about a year ago yeah the mess in the next ... cancer he had a PET scan\nThat can lead or no cost them ... cancer treatment it's all our patient articles are your best result avoiding radical surgery maintaining your thoughts will end urinary function on your life\nMost insurance Medicare medic loudly and thirty eight in Manhattan Dr lead them in in New York only Harvard trained tripled board certified radiation oncologist ... to ... to ... to ... to me Dr leader ran for ... cancer treatment\nWelcome back to the radio surgery our doctor Gilead I'm In the leading cancer and prostate cancer ... in the first New York for ... native brain radio person in America\nAnd in the western hemisphere finding radio surgery you can also call Dr Lieberman at killing killing for a free informative and DVD paid doctor Lederman why\nWe're back I was talking about the man who came in with his loving son he was born in Azerbaijan you're Seventy five years old is three children a year and a half ago abdominal pain and vomiting and his son have colon cancer and metastases\nTo the liver had a colossal million a biopsy showing cancer so close to me is one thousand opened up and the employees in a little plastic bag on the surface of the abdomen\nSo it by passes the cancer he had a biopsy showing that it was indeed cancer then he started chemotherapy a year ago and it worked for a few months and then it stopped working so this is a typical story of stage for cancer chemo usually works at the beginning because the cancer never saw chemo before the cancer\nOnly saw nothing before so usually when you give chemotherapy at the beginning it works but then after a while the cancer outsmarts the\nChemo and that's what happens the chemo worked for a few months and then the cancer just outsmart of it and started growing and growing as strange because he had stage for cancer this ... to me it\nWas doing perfectly fine with it and then the doctors than the patient decided to reverse the cost to me well\nIt took him to twelve weeks off of treatment they stopped all treatment for twelve weeks to reverse the ... so he had met a set of cancer for twelve weeks he had no treatment now what do you think that cancer is going to do for twelve weeks while you're reverse in that ... to me by ...\nA few guesses using the cancers going to go on a holiday it's going to go on a ... says it's going to go to the Riviera or it's going to keep on growing well the cancer kept on growing and he took three months off to reverse\nThe coal laws to me could have stayed with a lot to me it was doing perfectly fine with it and those three months to cancer grew like crazy and they tried\nMore chemotherapy and by then the cancer and outsmart the chemo also just kept on growing like crazy then they try to do therapy because of the family heard so much about how great the amino therapy was well if you look at the data for him you know therapy you'll see that it's a very expensive and for most people it doesn't work and that's the same as what happened and this\nPerson he tolerated poorly and that didn't work and he got so we got him into therapy got hospitalized pneumonia you lost thirty pounds and now he's\nWith me and his family brought him his biopsy proven\nOut of no cars no much meta static in the liver and he's a week and his family wants him to have a\nChance and well we always offer people chances are always offer all the choices to anyone who comes in and he could have choices and the choice that you could have more chemo which he clearly doesn't want to kill every meal therapy which he clearly doesn't want peace had surgery repeatedly it to not help him he could have no treatment or ...\nThat's an option and he could have our treatment to try to shrink the cancer and relieves symptoms that's another option and we talk about all the options to every patient I'm not afraid about talking about all the options to everyone talking about a forty nine year old man this is the man is from Jamaica and Jamaica's one of the hotbeds\nOf cancer I met with the government there and\nUh they say they have the highest rate of prostate cancer and cancer and was lots of cancer in the Caribbean people ask why is that really know why but this is a forty nine year old man these blacks has increased risk of prostate\nCancer and he's from the Caribbean also increased risk because he's married he has two kids he has diabetes he was seen by his doctor at a high\nPSA was set in for a biopsy petty officer on ever Gleason seven cancer multiple corps positive that he has a diabetes any of the high blood pressure and his weight is two hundred and five pounds is five foot eight and he's otherwise okay\nExamined him as ... as the U.S say Seventeen Gleason seven cancer and his surgeon out there at one of the big places is pushing them to have surgery well does this\nLook of the day though for a category ... look at the data because that surgeon was pushing them to have surgery but the surgeon never showed him the day that well here's the data it's on page four of our book for the most famous surgeon in America appears say ten to twenty to chance of being cancer free at ten years\nThirty percent which means Seventy percent chance this forty\nNine year old man would not make it cancer free ten\nYears the surgeon ever told him that the surgeon never told them that those cancer most likely would come back\nThe surgeon never told him most likely the surgery would cause sexual problems\nAnd urinary problems and you know what that means ... news but then he came here and we showed them the options and we showed them how to get better success of the void the radical and most likely to keep the sex life and your life and that's the treatment that he was and\nThat's another benefit of coming to radio ushered in New York and you can have the same benefits by either coming or you can call her office at two one two choices and get a book would get a DVD get an appointment if you've got a mass\nOr a lump or a cancer of difficulty urinating or want to get a check for your ... checked for your breast or check for your lungs\nFor heavy smoker actually there's there are studies show you can reduce your lung cancer death rate by getting screenings scans and we certainly participate with that if that's something that you want so there's lots of reasons to come to\nSearch for Broadway Broadway and thirtieth street in Manhattan\nWhere we are an independent cancer treatment center that means we work for you and not the drug companies at the hospital president we work for you and we take most insurance is Medicare Medicaid and we just want to come by and get the book with DVD You're welcome to do that as well about a man who is a Seventy\nFour years old he has a large lung cancer and liver cancer abnormality and he came to us for treatment because he has his cancer in the long and ... what are\nThe biggest hospitals in New York City with so I guess the funniest they'd be strange for maybe ... maybe he knows better he works in one of the biggest hospitals he works for seven to three shift there's work there for decades and he comes here to radio surgery new\nYork for his care 'cause we staged them up we found a colon cancer on PET scan there was not ever detected that that hospital where he works in where he used to get his medical care so lots of reasons even hospital staff from the big hospitals\nIn New York City come to search for Broadway for their care for his about a study cancer and there's good reason she comes in gets his treatment and then goes home usually means his wife it's\nVery romantic he meets his wife around four four thirty in our office they sit together get the treatment and then they have dinner and head home together so loving family loving man and wife getting good care out patient here at radio surge in New York\nTo call her office at two and two choices to one to two four six four to three seven in July the fourth of the DVD and appointment or other questions corps officer two one two choices are really shy like talk and\nYou can send me an email my email is ... eldest one name ... bad ... and why does or\nArtists and wide Oregon our website as listeners and save lives and dot com because listeners save lives such as Lederman thank you God Bless you by no\nThanks protesting in to the radio surgery hour with Dr Gilead Herman and myself if you have questions before next week's show or want to free informative booklet end DVD just contact Dr Lieberman at two one two choices that to one to two four six four to three seven that to one to\nTwo four six four to three that\nDr Lederman first in America\nExcept no imitation for cancer treatment is Dr Lederman first in America with radio surgery for newer recurrent primary or met a steady cancer even prior chemo surgery or radiation didn't work or isn't tolerated\nInnovative non invasive cancer treatment with no cutting no bleeding I'm Dr Lederman decades of experience thirty eight and Broadway in Manhattan for brain buddy and prostate cancers called two and two choices most insurance Medicare Medicaid accepted call Dr Lederman\nTwo and two choices two and two choices to hit the cancer\nThe proceeding was paid program W allies airing of this program constitutes neither an endorsement of the products offered boy the ideas expressed selling you will are are you at ... eight feet there in New York\nNew York wants us to talk stations meals rated number one seven ten W O R voice of New York Hi\nIt is fifty five degrees at ten o'clock good evening I'm sue God's then\nLeft his field correct and of course we've seen the recent um ... of ... and the other two young I'm\nWork is and the buck an industrial area or in Israel and uh it's becoming a very sad situation there for innocent victims just trying to live them everyday lifestyle\nOf being stabbed to death and executed\nIt's interesting that violence in times where the\nPopulist sentiments are coming to the surface in the United states in Great Britain with respect to the influx of um migrants from Middle Eastern countries in um in Israel who herself is surrounded by um\nArab countries the popular\nSentiment with in those nations are being challenged by the minority who is in a leadership I'm of the um typically the opposing party or the party not in power who are very vocal\nCan at times we very violent here of course in in in the United states we have\nLeadership like Maxine Waters from the house of representatives like Cory Booker senator from my state of New Jersey all endorsing and encouraging um violent uprising among or groups of minority in a in that respect they mean minority in numbers\nOr who disagree with the direction the country is to is going it so\nLast ditch desperate attempt by people who have lost power to regain not through the ... a democratic system but through the system\nOr a mob violence\nAnd we see this word the mob have you noticed Cindy the mob is now becoming a bad word\nMob every time we've seen it thrown about uh CNN or MSNBC over the past week people have been called out by people like a Don Lemon head over there at CNN or a a Joe blow hard over at the view they are all opposed to that word the mob and why is it\nI'll tell you why is it ... it's because it ... it basically takes that word and now\nAttaches it to the liberals who are trying to derive those who are running the country will who were elected by us the people so it is um I think a wave what's coming as a wave that's\nReflected in other countries taking you know they saw us take the lead\nAnd we in effect to follow the great Britain's lead when they had the whole brags that election so I think the populist view is is taking back what stairs in the country that they want to ... run by the residents of the country the legal residents of the country\nAs we speak\nThirteen hundred ... are on a caravan coming up through central and South America coming up to Central America and uh and Mexico now a caravan of people this is a an opportunity for cameras to the position\nOn the border when this caravan arrives\nAnd it's a photo op it's a photo ops people who are in desperate ... in desperate times or who are facing impoverished meant or ah or or crises in their country they don't come in a caravan they come in dribs and drabs this is a photo opportunity for those who are\nCollectively seeking to resist ... that's the big word and the big effort [noise] well\nYou talk about resist them going to bring it a little closer to home as some many of your listeners know I'm very involved in the New York state geo pay and just a couple of days ago antifa\nI'm broke windows and destroyed the doors\nOf the headquarters of the New York um city geo pay which is the headquarters for a ... mile an hour who's running for governor and several of the assembly and state Senate candidates running on the Upper East side and\nThey promise to do more in fact today a statement came out from the New York state chair ed Cox\nUh demanding that something be done by Andrew Cuomo even condemning it he has done nothing about it which just goes along the lines of\nWhat you started\nWith a Israel and brought into the United states the Democratic party is losing themselves and they are very well aware of it especially after the Kavanaugh hearings we see it in the um new polling in Texas with Ted Cruz\nWe see it in um even in New York I Know congressman leaves Eldon has taken a big lead Marsha Blackburn in Tennessee and this is becoming the way they see it the ratings are going down all over the place except that facts\nJust now Tucker Carson's book took over this week the number one position over I'm\nBob Woodward's people are getting very smart white suburban women that the Democrats were leaning on for the midterm blue wave upcoming and in big numbers to the red side because they want\nTheir families protected they don't want their husbands their sons their uncles their children anybody associated with them being accused of false allegations and having their lives\nDestroyed isn't interesting though that the um\nPopulations that were solidly Democrat or now shifting focus this is a bit of mice by Kanye West visit to the oval office this past week Kanye West was saying things Kanye West the rapper\nOr who is certainly not a political figure of first and foremost has come into the world of politics simply for announcing that he was a fan of President Trump's\nHow could that be how good a black man in America think differently than most black people in America\nHow could they walk independently and consider other options to what the Democrat Party has represented to them and here is a very very prominent\nA black man saying no I have some I have a different take on what's going on I support this man I think he's\nDoing good for us as well as all Americans he's lowered taxes for small businesses and the middle class a historic unemployment lows ... among all Americans including\nHispanics blacks and women he's deregulated he's cutting new trade deals with Mexico and Canada when people said that it couldn't happen he's fostering peace and North Korea he's doing things that are\nBy and large good not only for black Americans or Hispanics or women but for all Americans\nWell there's a ... today is that really be ignored by the media\nThat they want to make it that Kim chi dashing as mad at her husband the truth of the matter is he wanted to discuss prison reform and he will be a spokesperson for this and the future\nIs their first at the White House and actually I Love meeting actually brought about somebody\nComing out of prison so that you're not listening to\nThat making skits on Saturday Night live about the hat that they're not discussing the facts the history and the issues at large\nAnd that is why close to forty percent of the African American community and twenty Eighteen is going to be voting Republican and or conservative\nIt's amazing that um the party or doesn't seem to remember that we are individuals' first I Am an American of Dominican and Italian descent\nI M A Roman Catholic\nI basically don't I Am not all of those things singular and uniquely I Am a combination in conglomeration of all of it making me an individual\nAnd I think that what's gotten lost all of this is that we are individuals we don't belong to Spanish population is Jewish population is black populations we're from the American population and the most important thing that I think is being\nUm sacrificed is that each of those factions and leadership that\nRepresents those factions is doing so I'm by\nTrying to make them out as oppressed victims and we are not oppressed victims we stand independently with our own belief systems whether we are black Hispanic Jews were Americans we want the country to survive and thrive and um I think that ah it's\nComing to a head it really is I think we're all coming into that understanding that we are we are collectively strong and we do not um we do not dissect our society into a groups of people we are one and the same Americans\nWell when you say that uh I'd look towards the campaign of Antonia ... junior because he discusses that\nHis family on Italian immigrants they came here legally they made independent financially financial wealth legally he's in Hollywood blacklisted because he is\nWell it first happened you know after I did the NBC dateline with Lisa Myers a and they had held that until after the impeachment process was over I I mean I went back into the woodwork I put my head down\nAnd went to work every day and you know and became a very successful businesswoman [laughter] but ... all of a sudden after I'd been quiet for so many years\nHere comes Hillary Clinton in two thousand ... staying with her statement that all victims of sexual abuse should come forward and be believed and we're with you on me that when it\nAll over me and I saw a woman you of all people cannot say that after what you get to the victims of your husband and so I thought what am I going to do so I asked my grandson to show me how to use Twitter and\nI because I didn't know how I thought I did but I didn't\nAnd in the morning after he showed me which was January this six uh two thousand six day I got my phone now not only do Twitter on my phone and\nI typed out\nUh I was thirty five years old when Bill Clinton the Arkansas journey general raped me and Hillary trying to silence me I'm now Seventy three\nAnd it never goes away and that was a heartfelt comments but I had not said anything that I had not said you know Twenty years previously it was what I had told in the NBC dateline interview so I thought well that looks good I think I'm going to tweet that and\n... tweet and my God all hell broke loose\nThat and I have to worry that made us so we have not yet heard and I'm so glad that you're telling it right here on Jersey ... Joe that Twitter allowed you to actually break free get off\nA ... no one else could control your access to the airwaves and to those who you want to share your message ... you were in total control and it was simply by\nTweeting pressing the button I just got on Twitter by the way I Do I Need to come out you were ahead of it um but that's amazing\nAnd you know the phone I mean within a minute my phone I I had no idea the power of Twitter I\nMean it was ... and it was worldwide and I just thought well I'm going to answer this but I had no idea and the third phone call that I received was from my son and he's an attorney and he said mom what did you do and I said I have no idea\n[laughter] that's great [laughter]\nJuanita why did you feel when you thought so many of the Senate as like Feinstein\n... and ... and ... who is so outspoken against Kavanaugh\nAnd was so ready to um blame you know plates the guilt without any evidence that was quite a ball in the same people around when you had your issues brought up and they change it quite differently had how did you feel at that\nOh I was I right in fact I went to Washington to the hearings stood outside I couldn't get in and of course a list of ... but I didn't I couldn't get in and they are just saying senators and congressmen that\nIn uh Nineteen Ninety nine\nWorry fused completely to read my record uh for the impeachment they would have nothing to do with it as much as Henry Hyde\nAnd share first said we're not going to bring this woman into the here and she's not going to be a part of it the place before you vote just read her record there are credible there there's credible evidence that we have a right to stay in the office of the president and\nNone of them would not one Democrat read my record\nAnd so here we are in twenty Eighteen right before a mid term election that is\nI Would say arguably the most important mid term of certainly my lifetime\nUh where we have the minority which refuses to let go of power that the people have said is you know the arraigned is over a and they are using every tactic in the book and among those tactics are setting\nA pockets of people against each other in this case the most profound to pockets men verses women\nLegality versus due process these are being set against one another in a spectacle before the entire country\nAnd you found your um you know your your your entire the reason that everyone knows your name Juanita is this one event in a lifetime of many events I'm sure that are noteworthy and uh obviously of import\nAnd this one event so do you see that somehow as\nA sure calling really and you are rising to it and doing what you're doing now\nOh yes yes I'm On Twitter every day many hours a day trying\nTo follow Hillary and Bill Clinton and despair almost everything they say you know that has anything to do with sexual assault if you also saw her on CBS um uh this week I think it was yesterday or today when she was saying\nThat Lewinsky was an adult and uh she didn't think that it was a power thing with her husband it was consensual I like to fill out of the chair\nI mean this woman has lost it she cannot face reality that her husband is a sexual Davey it predator\nI mean he is the worst and she I don't know if she lied about it for so long that she actually believes it but I think she's losing her mind\nSo I guess he will be on line to get tickets for the new bill and Hillary Clinton will pull a\nNo no I I certainly won't and I'm Wondering now with her out there speaking like she is such idiotic statements if you know how successful that will be I can see that being cancelled before or it even gets halfway through\nI tend to agree with you well let's let's put a Hillary in the rear view and talking about you ms ...\nWorking all the things that lie ahead because you just recently attended the women for\nUh the uh women for America first saw it and you were a speaker over at the a conservative conservative activists\nAnd friends are imposing a more symposium over at the Trump Hotel right what's in your future in terms of speaking engagements the everything lined up or anything you want to share here ... beyond the book of course\nCan we tell them way he uh tell our audience may going tomorrow night\nOh yeah I'm I I was invited to go to the diamond truck the premier of Democrats and I'm excited\nTo the diamond itself okay yes eyes tiny wait to get they didn't buy it jumped in determine heads\nOkay two of our favorites as well and okay so yeah I've got your Venus lined up and the book of Korea\nI could tell you will so that when Nita is is she happened to be extremely strong and she is a tremendous ... to ... uh willy and for Paula Jones and for other victims\nAnd she really is a voice for all of them because she has been everywhere it seems like you have a brand new Korea the past few weeks\nOh listen I'm so tired [laughter] this is hard on the\nSeven I Can't get to talk to you [laughter] well I've seen you I guess your next um I've seen you and you've done your interviews\nOn TV so you know you sit bottle that you're not you're looking pretty darn good so uh keep that out to a ... it's a pleasure to have you always have a friend here in Jersey joke show I was ... gross for having um you know\nJoined us as well and are you are welcome any time on the Jersey joke show\nMs ... thank you so much\nAnd I just wanted to tell you that we are putting the bulky better puts that my son that how I Survived being made by Bill Clinton on the Jersey jokes website so that our audience can purchase the book\nAnd spend time in detail reading math because as we are going to keep discussing false allegations and investigations and taxpayer dollars with warm FBI investigations\nMaybe I didn't learn that this is a history of hiding the truth\nAnd exposing pull off fake lies slapped with a better word\nAnd every time that happens it demeans those who are telling the truth so a right\nAnd also let me tell you real quick I have a petition now I Need a hundred thousand signatures to investigate the sexual crimes of Bill Clinton and my purpose in this I mean I I'll never get\nI'll never get him in court about my rights statute of limitations is over but I'd like to see an investigation of Bill Clinton for all of the sexual assault that each committed\nUh for the benefit of all residents of New Jersey because as a New Jersey and one thing that obviously we all look forward to getting to learn about the candidates how is that possible when one of them refuses to appear at a uh a forum where there during the debate\nAnd it it goes even deeper than that Joe ... she's refusing to engage with anybody with opposing ideas from uh uh she ... only appear it's something that's that's a involves people that are within her echo chamber that a share of the use of the far left\nOr as she does and you know to to me as an elected representative you have to be able to engage meaningfully a and an exchange of ideas in order to benefit your district you have to be able to work with people that have different views new entering opposite party than you there's no blue wave coming there there there is no\nUh you know a magical ah is set of circumstances that's going to end up with the Democrats taking Congress this year I really think that uh outside of their own a echo chambers on the coasts or you know no one is buying their message of open borders and radical\nSocialism which has been pushed and this aggressive in your face a\nMaxine Waters is cause for ... a\nResisting and a shaming and and publicly harassing people imagine Hillary Clinton coming out and saying that uh there is no there is to know stability for public and Eric Holder making the comment ah you know ... it's not when they go low we go high when they go low we kick them\nOr you know that sort of shows that the attitude on the highest echelons of the Democratic party right now aggression resistance a and it totally flies in the face of all the things that the\nPresident Trump and the Republicans are accomplishing for the American people putting more money in people's pockets where the relative time of peace in the world there aren't a accessible on conflicts with peace through strength\nUh right now we we're we're doing great on trade deals with just renegotiated NAFTA candidates now I'm ...\n[noise] uh so many wonderful things happening what you're translating the great results and I'll take results of resistance any day but the big story right now or that's been going around does the revelation of a possible\nA cover up of a sexual assaults are in the Murphy campaign in ministry edition I'm sure you've you've heard the news [noise] ah I'm very disappointed to see that my opponent has not yet answered my call to demand a full investigation and the governor Murphy's hiring practices and both his campaign and ms ministry Russian and what\nWas done or when Katie Brennan came forward or an alleged that she was raped\nBy a a fellow member of Murphy's campaign who who also obtained the job and and there's ... ... you know a couple of weeks ago uh when when news broke you know came out and the saddest part about this guy's or is that the list bread and went to the authorities immediately after this happened\nOh you're on the record now and uh in the interest of time uh Darryl I got to say I'm I Am hoping that what you said and the intention you've drawn to it here tonight or even out the field a little bit because there is no need to not have a debate is every need for the origins of New Jersey to hear both sides\nAnd I appreciate your calling in and setting the record straight an evening out the field Donald ... is now for Congress in the twelfth district of New Jersey\nThank you my pleasure thank you everybody I'm\nSo interesting so the opponent Bonnie Watson Coleman is refusing to uh even debate Darryl\nMock mile an hour is running for governor of New York has the same situation with Andrew Cuomo so I I mean this is the tactic although they'll say that on CNN I think the one place that it was what was on CNN when Ted Cruz said he wasn't going to go on to a CNN when they attack\nVery wise remember after the Parkland shooting that CNN basically use the\nTheir town hall to assault Marco Rubio and a spokesperson for the n._r._a. or forget her name\nI ... and you know or jog yeah right yeah and she also does a a talk show I'm\n... and I see what they see what they do in the uh governor Senate race with that Bill Nelson and Rick Scott\nYeah this is all this is a a theme that is playing out across the country I'm Dana lashed excuse me\nThe spokesperson for the ... who was practically um ... she needed security to leader out of the uh the town hall for so long a lead by CNN I was an ambush it was a terrible terrible thing\nBut um so this is a a\nA theme that's playing out and we predicted that seemed to be everything they could do to basically deflect information or um uh attention from the headlines and I have to say a ... it's become worse than I thought it ever would or could\nI think it's going to get worse I don't think it's getting any better I've seen it myself like that actually I'm working on a campaign where I had to have security because ah the upon it was quite a hostile hostile and\nI been attacked and threatened\nAnd you had an incident even on Facebook where you had your ideas I'm suppressed\nCome back we spoke more than once yes so yes it's it's unfortunate but I think that ah with the\nThe way that would that is not going to materialize on the blue side\nBut we'll uh gain strength on the right side I think that may be after this election uh some things that um we're we're supposedly done deals are going to be revisited and reassess because I think this country is in a\nPattern of changing restoration\nWell I had been told I Can't confirm it but from enough good resources that is going to be some changes going on in Washington\nDo you want to elaborate on that would do when I'm having\nIt members are not going to be there anymore and there'll be some new people there\nAre great rebuilt or expect that you'll elaborate on that on your next resume which you might want to speak about now um do you have your guests lined up or\n... well yes uh on uh the\nTwenty eight I Will be co hosting and our special guest is going to be none other than the mood Kim self Anthony Scaramucci and many of you who have followed me now that\nLast march I was on it together with Anthony Scaramucci so it's going to be a quite a different reunion\nI Am looking forward to that and obviously you're always welcome here so that's going to be interesting um remember everybody that you can Twitter on Twitter following me a Jersey joke show W O R seven ten\nYou can email me a Jersey Joe twenty Eighteen or Gmail dot com of course like the Jersey just show page on Facebook and to visit\nThe Jersey Joe Show dot net website and send you weren't you do the same\nFirst of all you can find my articles or three times a week on the times of Israel and probably once a week or so give and take on Israel national news um on Twitter and Instagram as Cindy's corners and on Facebook as Cindy gross Cindy's corners as well\nYour everywhere or you Cindy and you can always of course I'm ... you should always come on word a\nFacebook because what we do there is we lined up our most popular and responses to our shows this particular week it was prayer in the oval office people love the fact that prayer is coming back to the oval office um with Dr ... was released to he joined\nA the the ... the president in prayer so that was very well received and it appears that the Latinos I'm across the country are also I'm digressing and leaving the Democratic party and will not pull the lever for Democrats from what I Am told in my kitchen research so a lot\nIs going on that's not reported final word\nI'd like to just invite and if you are listening as if you mean the New York area next Sunday night I'm going to be receiving a very special award from the Rachel's children's reclamation foundation and\nIt's going to be special and the fact that the special guest speaker is going to be the em Ali ... best friend he was the forty five year old um activist who was murdered a couple of weeks ago for information Cindy's corners edge emailed that Tom\nJersey Joe Show see all next week thank you folks goodnight [noise]\nThere's been a ... program sponsored by Jay is on the media incorporated W O R airing of this program constitutes neither an endorsement of the products offered over the ideas expressed\nYou are you a few ape detail New York\nOr Mrs boxing you rated number one seven and W. all our voice of New York and high\nIt is fifty five degrees at eleven o'clock that evening I'm sue guys when President Trump says there will be severe punishment if Saudi Arabia is behind the disappearance of journalists ...\nIn an interview with CBS is sixty minutes Trump didn't elaborate on how his administration might punish Saudi Arabia if in fact they're responsible for the Washington Post columnist disappearance Turkish officials belief to show he was killed and dismembered inside the Saudi conflict and stumble earlier this month\nGoldman Sachs may two hundred million dollars in one day by simply shortening the market now imagine that we did a little piece of it I'm not going to be greedy\nYou know but if you start to learn how to ... like the banks do then it's amazing that all of a sudden you can start learning a skill that can make money and not have to sit there and think about a second job or to get into a little bit later\nBut one of the ways I look at this and I get this analogy all the time when people are just simply trading one direction or they're waiting for the markets always go up it's like a car imagined that you were told you can get in a car tomorrow and you can drive somewhere but you can't put the car and reverse\nYou got to go in a lot of circles eventually going to get there but you gonna waste a lot of time energy and money getting to the same place if you simply had all the tools to get you there faster so a lot of what I'm seeing our students learning for the first time is it they're becoming\nDirection ... they don't care if it goes up down or sideways as long as the markets are moving they can learn how to make money and what a lot of them are seeing right now is they could create more freedom for themselves because they're able to make money no matter where the markets go\nYeah absolutely and I love I Love the analogy of the car and there's so many so many other analogy that we could pull into this that in in I always say in real life you know outside of the are investing life\nIn our normal everyday life we there's no way we buy a car that didn't go on a verse right but so many times we find ourselves in investments that only have one direction or one avenue where they can profit you know this the same thing you go back\nDo are you know go back to high school education and where was your stock picking class where it was how to balance a checkbook class writes a lot of it was a check but\nI just dated myself victory over there but it is it is true though I mean the we we really didn't have that stuff and so we're left to to rely on the quote unquote professionals truly guide us through this process where unfortunately they make a commission off of these transactions they say unfortunately kind of tongue in cheek there because that's okay with me that they make a commission that's\nThat's what they do for a living you know real estate brokers make a commission when they sell real estate so stockbrokers should naturally make a commission when they sell stocks\nBut when we buy a home it is up to it was up to the individual to make sure that they're buying the right home for them in the right market place in the right area that the right payment the right everything it's up to the person to do it\nThe broker just completes the transaction and unfortunately it's up to the person to also make sure that they're making the appropriate decision when it comes to their investing but when it really boils down to about Ninety nine percent of the world\nHasn't ... they spend more time analyzing the menu when they go out to dinner than they do analyzing what investments to to select\nIt it just puts his behind the eight ball and it's something that I think if we did a quick give away with a few more of these passes we could probably make a dent in and help people start making better investment decision I think it's a great idea let's do it All right well right now I've got a half day class coming up in your area that have take classes where you'll see exactly what it takes to generate more consistent income in the market\nUnderstand how the market works I understand what the risks are involved with a lot of different investments out there and how to capitalize capitalize on the upside down and have their classes about three hours long and so you'll be investing three hours of your time to really raise that financial IQ and start getting better and returns\nOn your investments now just a second you're gonna have a chance to win a set of passes to one of these half day classes to get your phone's ready and if you are driving now is a good time to pull over\nIncluded with your passes it's going to be the professional insiders kit now this kid is packed with lessons from some of our top instructors lessons on topics like enhanced in your retirement strategy how to make money when the market goes down income generation capital preservation crypto currencies and much much more the professional inside of it makes it so you can get started right now\nColors ten through twenty we need you to call now and reserved those seats the number is eight eight eight nine three zero eight seven to three that said it eight nine three zero eight seven to three if you end up being colors nine or Twenty one sorry about that but hit us up at ... a Wall Street dot com and see if you can score some passes there\nWe are up against it need to take a quick little break Larry what do you have for saying\nLet's talk about more about the same thing we're talking about here but I Want to focus on income doesn't require you having to get a second job call that passive or supplemental income and we'll talk about that right when we get back to Larry\nIf you can invest just about three hours to open yourself to strategies that can make you financially secure for life would you do it\nFor over Twenty years on line training academy has transformed lives worldwide with their exceptional trading and investing education and they would like to invite you to a free half day investing class near you\nHere's one one racing graduate had to say\n... to me has taught me that he got to have a plan and they gave me the food is maybe a better trader a better plan or I'm a better father\nLed online training academy help you pursue your financial goals so you could have more time to focus on what really matters\nThe kid there Saturday because I'm I'm available now and we can eat together as a family um I get my trading Diane and that they're happy\nAre you ready to start living the life you've dreamed of learned more visit us on line at O T a Wall Street dot com that's OT a Wall Street dot com\nWill come back and if you're just tuning you miss Larry Jacobs director of a structure development and top instructor at ... trading me really shut the life on consistent returns in the market\nSo one of my favorite topics though talking about consistency in the market\nSo many times I'll run into different traders different investors and they've had some success they've had some success in the market but they really had a hard time duplicating it and that ends up being the key really in anything that we do is how can we make money consistently ugly make money over and over and the financial markets are no different it's all about that consistent approach being able to make\nMoney as the markets are going up being able to make money as the markets are going down and also being able to make money as the markets are going sideways we need to be generating income whether it's income for today or income for tomorrow in this segment we're going to spend a little bit more time talking about the income side of things but whether you're just tuning in\nMaybe your first time listening or maybe you've been with us for the whole show get excited the best is yet to come and learn a lot of our listeners like we're talking about are are are looking to replace their income with trading investing some are looking to upgrade their lifestyles with a little additional income\nAnd and you can even call it maybe that's that supplemental side that you were talking about a few minutes ago and and some are looking for this to go beyond that supplemental and be their primary source of income\nAnd I've even heard people say that they're number one goal is to be able to fire their boss now now whether they're going to or not you know being in that position where you can make that call you know that starts to be that primary source of income but what are some of the key things that you guys worked with students who are looking to supplement or they're looking to even build this is a primary source of income that's a great\nQuestion right you know what I find with a lot of our students they first come into the academy thinking they want to make a lot of money when reality what they're looking for is freedom we've been doing this for over Twenty years we have over forty and fifty thousand students now in the academy and what we find over and over again especially coming to this class\nIs that they are really looking for freedom as I mentioned that could be they want to leave a job they don't like they want to spend more time with their families\nThey really are looking to kick a vacation make people now are so nervous about going on vacation because they'd lose their jobs if they even took a day or two off we're living in this constant stream of stress right now and what I'm finding is a lot of our students who come in thinking they want to make a lot of money\nIt's really about that freedom and it's funny I got him Adam was one of my students\nAnd he actually did just what you said he wanted to come in here he was miserable at work and he finally got to a point we could trade and actually go into his boss and say I have enough\nAnd I had enough think about that to be comfortable enough so if all this did right now is bring you one really profitable to trade when it'll be worth just coming in and exploring the opportunities here\nAbsolutely just kind of chicken things out and seeing what it can do for you and that whenever we talk about the half day classes whenever we talk about anything even at the half the class we always talk about risk versus reward\nAnd really specifically when you ... back to the half day class you know they have to classes or three hours long and see if you end up winning a a set of tickets to one of these you really investing three hours worth of your time and what if\nWhat if that three hours worth of your time was able to show you how you really could replace your income or how maybe you could raise your income by ... percentage so that you could have that financial freedom that Larry it was just talking about and that's really\nKind of the key to all this and you know what you were touching on was was the freedom side and and really those conversations go go fairly deep with with individuals one on one where you say you know what are you looking to accomplish this I go I Want to make an extra thousand bucks a month and that's a pretty quick conversation but then you say why\n... why do you want to make an extra thousand bucks now that financial freedom conversation starts where you know you ... it's a it's a nice detailed process of well you know what my kids do this and I want to do that and there's all these goals that they want to start accomplishing\nAnd part of what you need usually to accomplish those is a little more time one of the ways that helps you have a little more time is to have income coming from somewhere else having that supplemental\nSide of income you know where there's lots of different ways where we can build out the supplemental income it can be through a passive channel it could be through an active channel it can be through commodities it could be dropped as it could be through stocks\nBut one of the things about it is is we ... is one of these you always talk about I guess I should say Larry is is how multiple streams of income are are really kind of crucial throughout this whole process and you know the the average millionaire I think has has five or greater\nStreams of income and so when you think about it like that that is that those those pieces supplementing each other if one goes away it's really no big deal you just get strategic and you build out another one now it's also one of the reasons why the the word job Jay obese stands for just over broke because if we just have one stream of income and it goes away well we're we're in her city\nRight we're in stress city we're we're we're scrambling hopefully we've got a little bit of savings to buy us little time but it ended up being that kind of that that that downward spiral or even just stuck in that rat race so to speak of well if we lose our job hopefully we have some savings we use our savings while we find another job and then we just\nIn another job and doesn't the cycle probably just continue building out these multiple streams of income or or something that seems to be a not something that seems to be something that can create that nice safety net Annette nice piece of stability\nWho are really out there trading they do have their retirement accounts and and when I talked to our students I'm hearing a lot of people say you know number one they either don't have enough money to retire on you know our number to those that do they're not quite sure really how to continue the growth\nAnd to protect the downside right and that's really that point you were getting at a before he took the break and so I'd love to give you kind of giving you the floor here to take that back over border some of the things you and your instructor team are doing with investors to help make sure they have income for retirement\nAnd the number one mistake that most people may cause they think they can do this on their own then they wind up coming back and realizing they need the education so we start talking to our students about is how\nThey can start creating a strategy for success when it comes to the retirement right now you know it's funny when the market started to go down this week a lot of my friends call me and they started going what does this mean they started getting all nervous now one student emailed me and said Larry do you see this is a bad thing in fact\nMost people who know what they're doing they're elated that this is starting to happen most people waiting ten years\nFor another market correction why because statistically the markets always tend to correct about every ten years or so last major when we had was obviously in two thousand eight here we are in two thousand Eighteen so what's now becoming more important than ever\nIs it took people about six years to recover from the last correction\nPeople out there listening if you don't have six years right now well you're planning to retire\nYou don't have anything saved right now you need to figure out how to create a plan to help protect you and a lot of our students come in the door\nReally nervous about I don't have enough money to start well you know what they're doing right it's pretty fascinating they're starting to learn how to trade other asset types like futures in ... and they're saving that money from trading and they're starting to fund their retirement accounts\nSo again a lot of people first thing they always say is like the mortgage I've got the kids' college up on\nTheir retirement always comes last so we start to teach her students read out of the gate\nThat they can come up with a plan they understand most importantly\nWhat you are in need is because a lot of people the one size fits all does not work when it comes to retirement you can't just do this you first have to figure out what your needs are learn how to manage that need most importantly how to learn some really important risk management and how to protect that money\nAnd then at the end of the day you'll have enough to retire on based on what you need not someone else who's telling you what you need\nAnd you're talking about the kind of the cycles with the markets go through the big ups in the big downs and we do generally have a crash about every and we call them crashes but we do generally have a nice big drop in the markets about every ten years\nAnd one of the things about that is if you go back and look at um how often\nThey're forty fifty sixty percent drops and so kind of that average uh that we can expect is about fifty percent if you go back into two thousand and eight new kind of measure that you got about a fifty percent drum Becky fifty eight percent about fifty eight percent you go back into their early to thousands fifty say the same thing\nAnd so if we come to here and we say OK here's here that's kind of what we can expect again that's kind of the new normal\nThat the thing that I went through with my father about ah we had a conversation about this you know back in about two thousand and eight\nOr you know we're talking about drops in the market we're talking about drops and accounts and and one of the things that we're we're kind of walking through was\nIf somebody had a fifty dollar if somebody had a hundred thousand dollar account and they lost fifty thousand and they lost fifty percent will they lost fifty thousand so now they're account value is that fifty thousand that happened in one year and that drop happened I think it was fourteen months total rights\nThat happened in pretty much just a year it went down when they take that average rate of return on the way up and let's just be very very generous and let's say somebody is averaging ten percent on the Web that's ten years just to get back to break even 'cause when you take a hundred and you turn it into fifty\nTo take fifty and turn it into a one hundred requires a one hundred percent return on our money and so one of the conversation we're talking about was how long does it take the average person to really even get back to break even after going through a big catastrophic drop like that\nSo one of the scariest things right now is that people just don't have a plan that don't know what to do they haven't been educated and so unless you're really sitting there thinking about this and say to yourself fool me once shame on you fool me twice shame on me and\nAlbert Einstein had one of the greatest quotes was the definition of insanity is doing the same thing over and over again it's amazing how many people are not willing to spend a little bit of money to get themselves educated to invest in themselves\nInstead of taking this big roller coaster ride and think about it Ryan going back to two thousand and eight if you knew when to get out of the market and locked in profit\nAnd then in two thousand nine you were sitting in cash it could've been one of the greatest time of your life right now so we had a three hundred percent increase since two thousand nine yet most people had no money because they lost it all in the correction\nYep absolutely one of the things we can do to help a few people really start to identify where to get in and where to get out where to protect where to grow is get them out to one of the half day classes you ready for a little give away let's do it right now we've got half the class coming up in your area and a half the cost of ... going to see exactly that how to generate more income how to keep that retirement account growing\nHow do I identify these turning points up down or sideways\nSo you'll know when to buy and you could know when to sell you could you could go back to the old know when to hold them know when to fold 'em type of the conversation on just a second you have a chance to win a set of past as one of these half day classes to get your phone's ready and if you are driving\nRight now is a great time to pull over included with your passes is going to be our professional insiders kit that is packed with lessons from some of our top instructors\nThe professional insider kitten makes it so you can get started right now the ... century twenty we need you to call now and reserved those seats\nThe number is eight eight eight nine three zero eight seven to three that said it eight nine three zero eight seven to three if you end up\nBeing colors nine or Twenty one sorry about that but hit us up at ... Ga Wall Street dot com and see if you can score some passes there\nNow Larry I always I always said everybody when and I tried to say it on the show as much as I can well you have two dollars or two million dollars adapt to classes where you really get to see exactly what it takes to really get that money working for you and you're talking about it earlier as far as having our money working smarter for us and that's just doing the right things with our money\nYou know we've always also been talking about the market's being at all time highs and the risks that we have in there and then my dentist office I bring this up a lot on the show but it just it's so true inside of the financial markets that might Dennis off as a kid shout out to Dr are buckle there's a plaque on the wall and every examination room where it says\nFor don't worry about your teeth and they'll go away you\nKnow being that same situation here that unfortunately has been proven true time after time minutes don't worry about your money don't worry about your retirement account and they'll go away\nYou know well let's just think about what people are doing right now in this moment we've been told that every two weeks is supposed to be investing in an Ira or some type of arrests\nFiremen plan which is great and then nothing against that but what people are not paying attention to is where they're investing that money and for the last two years people investing all time highs and so think about it you're at an all time high\nWeek after week that's when you're investing your money and all of a sudden the market corrects will that correction is going to impact the first amount of money or the last amount of money that you basically have invested into\nSo now you've put majority or money in the market the last two or three years when it's been higher and higher and it takes a tremendous fall and this is why we said it earlier the market falls three times fast and then it goes up\nAnd as a result people see that fifty percent evaporation of wealth and that immediate sea of seeing that freaks out now let's take it a step further\nWhen the market goes down that dramatically like it didn't in two thousand eight what's next the loss of jobs the forfeiture isn't housing dividend cuts evident cuts so all these things\nHave a greater impact than most people believe and yet there are people out there that continue every single day to roll the dice and take a chance and said this won't happen to me\nYeah there's a huge risk out there and then a huge need for multiple streams of income and not just today but multiple streams of income throughout our life throughout every stage of our life\nTo create that stability and one of the things we can do to really help people get kind of jumped started ended his multiple streams of income lifestyle is to get 'em out one of the half day classes we still got a few passes here we can give away let's do it right now I've got to have to class caught up in your area they have their classes where you'll see exactly what it takes really keep that retirement account growing\nMake sure we have income for today income for tomorrow and really generating and focusing on building out those multiple streams of income when the second you're gonna have a chance to win a set of pastors doing these half day classes switch phones ready and if you are driving now is a good time to pull over\nIncluding with your passes is going to be a professional insiders kitten other kids packed with lessons from some of our top instructors lessons on topics like enhancing your retirement strategy how to make money when the market goes down income generation ... capital preservation crypto currency is much much more\nThe professional insider kitten makes it so you can get started right now\n... century twenty when he did a call now and reserved those seats the number is eight eight eight nine three zero eight seven to three that said it eight nine three zero eight seven to three if you end up being colors nine or Twenty one sorry about that but hit us up at ... Ga Wall Street dot com and see if you can score some passes there\nWe've got to take a quick break we'll be right back Larry where they have\nA force next let's talk about the lifestyle of a trade or a lot of our students are so happy they can move out of where they were to where they are now let's talk about what they do my favorite part\nOf every movie is behind the scenes editors cats that's what we're going to do when we come back from this break actually heard on the lifestyle of a traitor right\n\n", "show_name": "The Dave Ramsey Show", "year": "2018", "city": "New York", "day": "15"}