{"month": "10", "state": "NY", "station": "WRUR", "content": "Lately a lot to do well\nShows you know\n\nA three and\nKnow they and they um\nMarlboro\n\n\n[noise]\n\n\nOpening up for that that we have a rash of new opera her American classics release called aunt last and her ... her version of my baby just cares for me a giant panda grill squad for making better lived and traveled to make it better with her the title track of\nWhat's around when I made last year and um Japan steep and a three man parish that really ... arrangement there from ... Stevens coming from a collected artist tribute\nTo Joni Mitchell got one more song with the Beatles\n... [noise] no\nI mean I Know [noise] because you see\nYou lean more on the [noise]\nIn the season [noise]\n[noise]\nThat old Bob [noise]\nJamil noted on this\nI Know you [noise]\nKnow had\nYour\nWheels they've turned in church for years taking you from home to work to the library and home again when you're done with them and you don't need them to the W. argue our vehicle donation program they'll help spend the music in conversation that inspires the song the vehicle doesn't have to be running to propel public media into the future\nLearned more at W. R. U. R. dot org Lashkar\n\nMovies live music food drink ballet opera an art in the little leader at two forty eats avenue pads at all or current Showtime and upcoming events have been a little dot O. R. G.\nUh\nThis is members supported public radio W. R. U. R. S. than an HD Rochester you can also go public on line yeah W. R. U. R. dot\n[laughter]\nRight\nHe came\nThey\nJust keep going [noise]\nOn the jury to change your whole comedy from somebody ... and ... ... ... ... per dorm on the news all the young boys or did you did you all due to the junior Detroit who are willing to cut costs you\nDo for the armored it a father struck barefoot Barbara most grow up to the grocery store joined it all year long you're going to do with you or your normal school\nDidn't they didn't\nDo a\n[laughter] [noise]\n\nNah\n\n\n\nAre you going\nTo be on your own as I have not\nThat I have a town I'm trying to say is that a lot a lot better than\n[noise] I\nThought that the money to go\n\nI lost my my no don't worry about it in a\nBody\nThe Bush na na na na\nNa na I Know\n[noise] that\nGoes in the Bible on as I\nDi di di di di di di\nI live by last Saturday\nSunday I don't\nWe got out in\nWorld they don't do it in a lower body\nPlayed by Sean na na\nNa I Know\n\n\nA guy by by Saudi\nMoney by but I don't know\nAre you going on in\nWorld and I'm Mary\nVery shocked me they don't\nDie\nDown the line at\nBy a guy on\n[noise]\n[noise] [noise]\n[noise] um [noise] so much\nThe fruits Barbie or Google ... ...\n... ... ... ...\n... ... ... but I mean Google\nAnd the dog for a plan\nWhen my my ... going to stop by\nThe name ... may not\nThat\nGoing to\nNo one then there are\nNa na na\n\n...\n... my man I Know\nMy God you know from my\n... ... ...\nIs good but he ... me I\n\nNo\nDon't get me wrong I Want\nTo go\nGet\nSupport for double you argue our digital media comes from our members\nFrom capital ... a small batch come boots your brewery located on railroad St ... meets flavors like ginger meat and more open to the public on Saturdays from tend to to what growl are available to go on line at cat Boucek dot com\n\n\n[noise]\n\n[noise]\nNo no no [noise]\n\n\n[laughter]\n\n[noise]\n\n\n\nNa na na na na\nJohn\nLady John Donne\nI\nLove to\nYork ...\nNa ...\n\nBe a huge huge ... come to the to the\n... to the lake\nAround you know the answer to\n\n...\nIt might reduce queen na\nI\nKnow I\n...\nMeet ya da da\nDa da da\n...\n... ... loan foods that I ...\nI have a\nOr true in that role as well ... she's been\nOkay we've got an order special birthday was crushed here for ... ...\n...\n... ... ... ... ... ... ... ...\n... well ... ... for your ... are there any way we run our we sure are very happy birthday\n...\nThey don't have any money on and you don't believe you know then on Monday maybe ... maybe ... na na na na na na na na na na na na\nNa na na\nNa na na na\nIt's the one that they\nDon't need to be in the yard na\nNa na na na na na na na na na na na na na na na na na na na\n\nNa na na na ve Seventy they didn't say\nIn the media you know I'm never read yeah we'll be ended um na we there are going to love who then\n\nNa\nNa na na na na\nNa na na na na na na na na na na na na na na na\nNa na na na na na na na na na [noise]\n\nWhat am I ... and ... your birthday through my ... not ... Brian McDonnell\n... or is there a ... it's thirty nine minutes you're you're right you got to get your body All right let's move ... ... ... ...\n... ... Marie ...\nNear ... is the first ... right right\n\nMhm Mm much girl whose whole\nOh they were for\n\nThe last ...\n... or\nOr are you\nBody\nNah\nMoney or you know minimal man to\nReopen today on the wall\n\nAlong the other hand\n\nHand washing\nBaltimore\nMan\n... we're going to be treated the lawyer for ... plus ...\nSupposed to be able to\nPut a victory ... literally he\nWill be who um\n\n[noise] and [noise]\nI mean\n... Muslim man by such a funny man\nHe had a tree we\nSaw all of them all [noise]\n\nMan\nMuch of a man\nNo no no no\nNo no no no\nNo no\n... no\nAnd they are\n... no no no no no\n\nMaybe [noise] you know there's not enough [noise]\n\nBelieve it will do is ... [noise]\n[noise] [noise] but I still middle of all the the thing is\nThat [noise]\nYou know ... ... oh\nOh yeah I'm a I'm\nA\n... a nominee\nI'm a I'm a\n\nNa\nNa na\nOn so what\nOn that thing on\nBought it but not not we\nNot as bad dumped on and on and on the\nCall that monitors\nWhen they are not not that I needed\nStuff that we're not ...\nThe new bankruptcy don't be paying for\nNone of\n\nCome on\nBut I Do\nThat\n\n[noise]\nAnd [noise]\nMeant\n\nTo be able to\nAbout nine\n\nMy fish for friday\n...\n... ... or\n... or a bit for for her ... girl right\nSure something a little ... the disturbed by the\n... [noise]\nFrom I'm from early on [noise]\n\nGetting in Mali ... stone and on and then the money and\nMeans who who's coming up you know\nBe a little bit ahead of the day\n\nOh my pleasure\nBlow up into the new\nWorld order you know they said do you have to\nBorrow billions cool\nMm\nWho am I but not\n... ...\n\n\n\nOkay we've got or you can you hear me in ... a year on cameras turned me on the right to work\nUh yes I Am to disrupt ... John's show\nEvery week [laughter] well they left you alone for about a month and a half your undisturbed medical [laughter] I was on a trip to it like it was wonderful\nSo um what's going on\nWhen I got some great news um we looked at our boys [laughter] um we\nHave achieved a certain level of recognition in Italy or with the Italian distributors are they know that I'm I'm a serious person then we have a serious program and um so we're this month I'm I was able to get\nThe American premier\nOf any Tanya movie that just as hot off the presses\nI'm\nA movie that hardly anybody ever heard up because it's so new that it didn't make the rounds yet so I'm On October twenty four seven PM at the little theater\nWe will premier or a movie called I Am Tim pet stuff we'd the great actor mark ... or those will be there to come see the movie or wouldn't remember Michael J. leaning for movie a low key or he was a scoundrel there and he was also a scoundrel when the movie's some low\nUm and he was a cook a cop in a movie or the place that we showed in July it's one of the most loved the actors ... always plays the scoundrel but it's a love of a scandal in this movie he plays a billionaire\nThat I'm a gets arrested for a\nTax evasion and instead of going to jail he buys himself one year all with community service at a home for the homeless a homeless shelter\nAnd um so the whole thing is a well he learned some humility or will eat teach the homeless people how to make money you know very\nWeird way and it's a fabulous comedy um and we are happy to say that we are hearing Rochester the premier\nOf this movie in the United states after us it'll go to the festival circuits are all over the United states know all the cities that have Italian festivals but we got it first from so if you want to free tickets\n... your two or three you got to ask John nicely\nTo probably be two or three if you call a within a pair of tickets you know I just want to run for your partner your mate for your life or whatever you call them and you can enjoy this\nMovie and the camaraderie that goes on before and after you get a left and right ticket [laughter]\n\nOoh\n...\n\n...\nQuestion\nI'm In I'm calling from oh\nAutomatically\n... man [noise] oh\nNo well in a long\nTime do they start you\n\n\nOther changes\nIn India in\nLondon throwing in today man I\nKnow\nHe does he\n\n\nShe she\nNa na\n\n\n...\nMembers me no I was a CD that drove me just brought in totally ... small ... beautiful I mean of course mean she can she gotta be gotta be born in that morning that\nNurses Seventy four Seventy four yeah like I just\nI'm older than her oh he's chasing after her no no she she she does she hurt her ... or ... or the charm huh no ... well they did that she sent together with other people too but a lot\n\nSo much for the star but she's more than somebody for because I was a child when I was listening to her and so there's got to be at least seven eight years between ... right yeah\n\nMe that they're going to\nTo do is they don't know\nWe have all these\nHave you been gone\nI\nDon't know no one that'd be that'd be fun you\n\nFor the good old ... ...\nHave you been gone\nKnow\nWhether she doesn't do\nYou call it what did he did not let\nThe when I look at him and\nWas going\n\nKnow they'll be able to be a\n\n\nSay maybe there'll be a\nTime\nKnow\nI'm\nJob that that would be a\nShe hated middle of all you know nothing about\nO\nDa da da da da da da\nDa da da da da da na na na na na na na na na na\nKnow oh\n\nThe bunny normally I don't\nThe Russian news\nBump into\nAt all you\nI'm I'm a mom\nLaw you know\nOut a\nOh\nDa da da da da da da\nDa da\nDa da da da da\n\nAre they getting any calls the remarks\nYup yup which you're correct right right ...\nOh yes we um we had a couple of phone calls and uh we just kept on give me that gets away so that was a that was good and John Will repeat the name\nBut can you hear me and we didn't even talking to my ... okay you start to like you were dumb uh-huh right or wrong [laughter]\nAnyway so I'm I'm as I said I'm very proud that we were young usa premier\nOf this movie um uh the last movie that we had a ... ... is that good just been on so it was very very well and the\nAnd the movie was very well liked by everybody uh I I I'm not saying that you're going to be able to like every single movie because people different people different they\nBut so far uh we've had some excellent excellent response from a ... about everything that we've shown so which do you do the job or twenty four and a little theater than others John\nThank you Tony in oil rich region Don ... your ... will be at the box office on the ... or ... perform [noise]\n\nNation I negate\nKey to get in any new\n... who didn't have the money making\nDown I mean I knew\nPunch in\nThe city\nNeeded smiley too\nDay or when I get you mom man I share a plan how are they going to\nAnd I said I got bad\n... shareholders\nThe gym moving in movies and you don't\nHave time to play any time many many ...\nOf us about should we try to let me take you let me ask", "year": "2018", "show_name": "La Dolce Vita", "city": "Rochester", "day": "13"}