{"month": "10", "state": "PA", "station": "WESA", "content": "We want to thank some folks who have donated and the last a little bit of time we've got Calvin and Indiana PA he says\nIn these trying times in depth and objective news can be refreshing thank you Calvin we've got mark in Pittsburgh we have Cameron and Bethany in tunnels veil they say we'd like to think the fellow NPR nerds for donating\nYou Cameron in Bethany we love NPR nerds and we've got Vincent in Greensburg or I'm Sorry deacon in Walter from Greensburg thank you all for giving to W. E. S. A. at your support matter it's so much you can join them by giving at for one to six Ninety seven to nine five five\nOnline at W. E. essay data than\nLike food like wine want to learn about wine well we have a little partnership with food and wine magazine that ends in twenty minutes if you give seven fifty a month on the sustained her plan Ninety dollars all at once more and more\nWe will thank you with a twelve months a year long subscription to food and wine magazines so you're getting all things considered plus a little extra food and wine to enjoy it with\nFor one to six nine seven to nine five five but the offer ends and twenty minutes W E S H ... FM\nAnd don't forget there was a challenge in effect right now is getting twenty contributions by seven PM unlocks a one thousand dollar contribution from B. J. and Jeff ... we are half on our way we have ten contributions to go\nThe goal is twenty contributions in the next twenty minutes give now in your contribution will help us clean that one thousand dollars so we can put it to work\nFree to explore free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nIs seven PM unlocks a one thousand dollar contribution from B. J. and Jeff ... we are half on our way we have ten contributions to go\nThe goal is twenty contributions in the next twenty minutes give now in your contribution will help us claim that one thousand dollars so we can put it to work\nIn a in all things considered and all the programs you love from NPR and W. E. essay called for one to six nine seven to nine five five or give on line ... W E S H ...\nAnd don't forget about the monthly sustain are planets the monthly giving plan is kind of kind of good way to give you listened throughout the year you can spread your contributions throughout the year and if you stop and think about the fact that we're asking\nFor five dollars seven fifty ten dollars a month and you probably listen forty fifty sixty times a month if not more right once or twice a day maybe three times a day you're listening a lot ... five or ten dollars a month is probably worth it for one to six nine seven twenty nine fifty five W. E. S. A. dot FM\nYou listen to W. E. essay and NPR to feed your needed to learn new things that also fills your desire to know more it's a continuous lupus peaking and satisfying your curiosity about the world and how it works\nThere is a direct relationship between the barrette subjects you hear on W. E. essay and the amount of listeners support we receive it's expensive to bring you the world\nPlease help us offset those costs with your contribution now you can give at for one to six nine seven to nine five five or you can give on line at W. E. S. said that offense\nAnd we're looking for ten more contributions here in the next Ninety minutes to earn this one thousand dollar challenge grant please take a moment to give now help us sort of the thousand bucks for one to six nine seven twenty nine fifty five\nW E s say is supported by Duquesne University offering eighty undergraduate majors in feels like education health care business music liberal arts and more faculty mentors an internship opportunities are designed to prepare students for success in the workplace\nMore information is available on line ... D you cue dot E. D. U. [noise]\n\nIt's been awhile since there's been news of health care policy Obamacare specifically the portable CARE Act but there is some news this week for the first time since the AC became law eight and a half years ago now premiums are going down for most policies sold in the federally run exchanges a present and a half\nFor next year in fact and on top of that there are insurance companies that are going back to do business on those exchanges only a couple of years after ... church companies had been leaving marketplaces ... explains what's going on their\nPremiums are going down a little next year because they went up an absolutely insane amount this year\nPlans his premiums are going down by one and a half percent on average in twenty ninth team went up by thirty six point nine percent on average in twenty eight team\nLarry Levitt is senior vice president at the Kaiser Family foundation\nYou know these premium decreases are really about returning access profit\nInsurance raised premiums so much a year ago because they were very freaked out\nAnd there was a lot going on back then there was a repeal and replace debate President Trump was out there talking about the law collapsing\nCongress and the president ended certain subsidies for low income Americans so to prepare for that and for just chaos generally insurers raised rates a ton and then things turned out to be not as terrible as insurance companies start first\nAbout returning access profit\nInsurance raised premiums so much a year ago because they were very freaked out\nAnd there was a lot going on back then there was a repeal and replace debate President Trump was out there talking about the law collapsing\nCongress and the president ended certain subsidies for low income Americans so to prepare for that and for just chaos generally insurers raised rates a ton\nAnd then things turned out to be not as terrible as insurance companies thought for starters Republicans failed to fully repeal Obamacare many insurers may feel like they've weather the storm a little bit Sabrina ... is a research professor at Georgetown University she says Congress is probably not going to try to destroy Obamacare again\nSecond leap as some federal subsidies ended other federal assistance programs kicked in or let says most people didn't appreciate that would happen so what we size that enrollment\nActually stayed remarkably stable this\nYear in fact according to the Kaiser Family foundation insurance company profits are higher than they were both for Obamacare some insurers are returning to markets they demand and\nThe correlate points out yes insurance premiums will fall by one point five percent next year but they're still thirty plus percent more than they were last year in New York I'm Rebecca shore for marketplace\n[noise] [noise] [noise] [noise]\nLet's do the numbers [noise]\nHard to do the Dell or two hundred and eighty seven points one and a ten percent this radical is the twenty five thousand three three none of that decade a hundred and sixty seven points at a to point to present\nSeventy four Ninety sixty us in the five hundred thirty eight point one point four percent twenty seven and sixty seven for the week though to five days gone by the Dow dropped for points you said the NASDAQ brother four and eight percent the U.S in the five hundred bucks for ten percent General Motors off one wants to present day for food one in nine ten\nPercent both automakers have seen their manufacturing costs rise since the U.S imposed tariffs on steel and aluminum as we haven't telling you to back us\nUp to us food and Drug Administration restated his previous folks on cutting the nicotine content of cigarettes Phillip Morris drifted down to test present Algeria about one in seven ten percent bond prices fell you on the ten year treasury note roasted three point one six percent you're listening to marketplace\nMarketplace it supported by Charles Schwab who believes the modern approach to wealth management starts with asking questions and providing straightforward answer is Charles Schwab on your tomorrow learn more and Schwab dot com and by Drexel\nUniversity Drexel University is academic design and transformative cooperative education program prepare visionary leaders to address the challenges of a changing world\nMore at Drexel dot edu slash ambition can't wait and by western digital everywhere data lands from personal devices to global organizations western digital feels the innovation necessary for a brighter smarter future learn more\nData makes possible dot com western digital creating environments for data to pry\nToday's programming is supported by oil and stuff in in a celebration of attempts anniversary of dining restaurant in wine bar chef owner Sonia Finn presents a daily changing menu of salads small plates and fin crust pizza from sustainable ingredients information is available that dynamic hyphen P. G. H. dot com\nThis is the W E S safe fall membership drive as a non commercial nonprofit radio station and we rely on listeners like you\nSaid the most important part of our income please help pay for your future W E essay listening by giving now at for one to six nine seven to nine five five or you can get online\nFree to pursue the re to explore we're Ninety point five W E s say Pittsburgh's NPR News the sound of a free press\n[noise] this is the W E S safe fall membership drive as a non commercial nonprofit radio station and we rely on listeners like you\nTo the most important part of our income please help pay for your future W E essay listening by giving now at for one to six nine seven to nine five five or you can get on line ... W E s say data than I'm Kathleen Davis here with John sat and\nLeadership circle members BJ and Jeff ... have put up a thousand dollar challenge grant to help us wrap up this Friday 'cause friday afternoons friday evenings are tough people were thinking about the weekend and they said you know we're going to help you out we're gonna help you earn\nThe gift of twenty pledges you need if if you get a thousand or you'll get a thousand dollars if you can do that by seven o'clock this evening were seven away seven contributions in the next Thirteen minutes or in just a thousand dollars we're hoping you help us joined it or or earn it for one to six nine seven to nine five five W. E. S. A. dot FM\nNPR and W. E. essay reporters ask a lot of questions\nMyself included and with every answer comes information at bay usually more questions as well it would be impossible to provide you the information from all of these questions and answers if we had to program at around commercial\nThings to your support of W E s say we can give complex news stories the time that they need\nYou can give today at for one to six nine seven to nine five five or on line ... W E S H ... than\nWe're asking you to become a sustaining member or monthly giving planned and we have people were sustaining members for as little as five dollars a month and up to a hundred dollars a month in more it's a recurring charge to your credit card or coming right out of your checking account\nI Would urge you to think about the hundred dollar a month club it's the new way to join the leadership circle and are you not only get to come leadership circle events and meet people like Joshua Johnson and Wade Goodwyn when they come to town", "show_name": "Marketplace", "year": "2018", "city": "Pittsburgh", "day": "12"}