{"month": "10", "state": "PA", "station": "WESA", "content": "And the Wu say Logan the other side for ten bucks a month we give you the W E S a stainless steel reusable strives to thank you give\nA if you want to pick a safe for example the good question what we will send that to you or along with the stainless steel straw as a thank you gift but that only goes until seven o'clock why not do it while you can get your gift tripled at for one to six nine seven to nine five five W. E. S. A. dot FM\nNPR became the best source for news because it has the best source of funding you\nYou put those correspondence in the field you put the inquisitive people in the news anchor chair and you put the most demanding people behind the desk all with your contribution to W E s say we provide news that gets to the root of the issue it's not always easy\nBut we bring you stories with heart as well we tried to bring balance to your day\nCall us right now with your vote of support for one to six nine seven to nine five five or W E s said ...\nAnd we're looking for new members especially during this two for one match we're asking you make that first ever contribution to the radio station fifty dollars is tripled to a hundred and fifty dollars you get the idea we're hoping that you'll take just a couple of moments we uh we're getting close to being out of two for one matching money is not going to last until seven o'clock\nI'm guessing that's going to last about five more minutes and then that is it so if you want to get your gift tripled this is the time to call it the last two for one match the membership drive for one to six nine seven twenty nine fifty five W. E. S. A. dot FM\nWe talked to people all the time and we talk about the benefits that they get that they feel they get from listening to W E s saying from listening to NPR your fellow listener say things like this it's a smart way to use my time it connects me with others who share my values I look forward to hearing new things every time I tune in\nWhat I hear is authentic and genuine\nNow does any of that sound like you will those listeners are also givers their members joined them by making a contribution of your own\nHelp keep NPR and W E s a strong by becoming a member on line at W. E. S. A. dot FM or calling us set for one to six nine seven to nine five five we are really\nReally liking that there's a good question book that we have a creative just for this membership drive people from Pittsburgh\nAre very proud of their history they're very proud of their ... as well and love telling stories about the city the history of the ... and when people get stumped they've been writing W E essay and saying I've got a good question about Pittsburgh we've gone and found the answers\nAnd we've put them in a book for you as well as putting them on the radio and that book is now I think you get to the membership drive a hundred page book\nAnd it is available for a ten dollar a month contribution if you gave right now for one to six nine seven to nine five five W. E. S. A. dot FM\nListener supported counts for about half of the funding here you're donations and investment than the programs you enjoy so you decided the amount and then you decide what best fits your budget joining us now for\nRead it for free to explore we're Ninety point five W E s say Pittsburgh's NPR News the sound of a free press\nU. E. S. dot ... last call on the two for one match we know the money will be gone the next time we talk to you so two for one this is your chance if you're on the phone and the next minute on the Web you can get your gift triple W. E. S. A. dot FM for one to six nine seven to nine five five\nToday's programming is supported by chat um university Chatham is hosting a graduate open house edits eating whole campus for programs and sustainability and food studies on Sunday October twenty first the open house was followed by the sustainability and the future of food conference open to the public details at Chatham dot edu\nOr a\nCouple of economic indicators you look forward to every month when you're a business and economics journalist seriously you do one of them is called ... the job openings and labor turnover survey through which we learned this morning there are more open jobs in this economy than at any time since the government started keeping track almost Twenty years now\nIt's more than seven million jobs if you're curious seven point one for a million technically and we're going to dig in a little bit on one slice of this labor economy with a whole lotta now hiring science out their transportation marketplace adjusting hose on that\nThe transportation sector includes jobs and ride sharing railroads airlines and the big one delivery Sarah ... men at the NYU ruined Center for transportation set the demand for delivery has been going up year over year\nWhich increases the amount of ... vehicles in every city and across the country\nThat demand is force companies to beef up their shipping capacity and strategy just today Macy's appointed the c._e._o. of UPS to its board of directors ... ship matrix says the failure of toys R. us and the troubles at Sears have taught retailers a lesson\nSupply chain logistics transportation is the key element in achieving customer satisfaction\nBut just because there are job openings and shipping there's no guarantee there'll be filled for example there's a big shortage of workers for trucking companies because Evan rally at the University of Minnesota's Carlson school of management people\nAre wary of investing too much now and and being a truck driver\nYesterday the shipping company J. B. hunt said it raised wages by ten percent to attract new drivers and on friday UPS is holding a hundred and Seventy job fairs across the country still really says that job seekers no these positions could be automated and the long run\nIf you're young and you're investing their future and you don't want to make a investment in a career that it's gonna be disappearing overtime\nAnd for now salaries are still low average pay for truck drivers rose by one point nine percent of the last year below the rate of inflation in New York on Justin how for marketplace let's do the numbers [noise]\nWell it was really happening music Dallas five forty seven today to an attempt present closed and twenty five thousand seven Ninety eight an ad that game two hundred and fourteen going two and a ten percent Seventy six forty five as in the five hundred fifty nine points tuna ten percent twenty eight or nine corporate profits and that jokes were bored if you're looking for approximately causes health insurer\nUnited Health shut up foreign seven tenths presented after posting better than expected third quarter profits and raising its forecast for the full year signature of three point nine percent tech claw their way back for some reason was the software maker adobe fled the nine and a half percent today Microsoft for three and a ten percent bond prices rose to build on the ten year treasury note failed a three point\nOne six percent you're listening to marketplace marketplace is supported by personal capital helping over one million people plan for retirement with their online financial tools you can download the personal capital Amman to link and see\nScreaming on WGN appointed by Carnegie Mellon university integrated innovation detail on a master's program [noise]\nAny dot edu flash I I I\nEnd user in mind fresh works as used by more than one hundred and fifty thousand companies around the world to see Iran I T service software fresh works dot com\nAnti crime and I was helping businesses attract retain engage employees through cloud based human capital management dot com crash into the workforce innovation networks\nIt's marketplace Ninety point five W yeah say Pittsburgh's NPR News station fourteen minutes before seven o'clock fourteen minutes before done with fundraising for the day we're fundraising because it's how public radio pays for everything you hear is how we run the radio station pay for the programs do the local news that's important to you\nPlease as the membership drive is winding down make your first contribution to renew your support it for one to six nine seven to nine five five or online at W. E. S. A. dot FM\nI get to do the best part of this break I think people I wanted to thank Janice in Pittsburgh Robert from bred for woods George from Pittsburgh a new member a new sustaining member of Ninety point five W E essay and Elizabeth from from a beaver I thank you Elizabeth for your sustaining membership is well\nNew members sustaining members all members are important to making this franchise strong into keeping W E s a an NPR on the air here in Pittsburgh\nWe do so appreciate your support and thank you very much if you're not a member yet if you're a sustaining member and you'd like to maybe make your contribution to little greater now's your chance go to online on W E s said an fmri called us at for one to six nine seven to nine five five\nOne of the things that W E s a has been spending more time on is investing in political reporting in government and accountability reporting and as south western Pennsylvania has become more and more important to national elections and the the these are these races are having a local and state wide and national impact\nWe've been trying to bring you more coverage of the news around\nThe politics here but also bringing you more live coverage including the debates\nYes the are coming up next right after marketplace we'll have live coverage of the Conor Lamb Keith Rothfus debate this was a really contentious raised in southwestern Pennsylvania as the redistricting basically just changed all the lines and changed all the borders and\nYou know it stands to really change the political balance here in western Pennsylvania our own Chris Potter is on the panel for tonight's debate in so we'll look forward to the top of the hour in about eleven minutes you've got eleven minutes to show your support\nFor hard news journalism on W E s a it for one to six nine seven twenty nine fifty five and online a W E S H ...\nAnd we've got eleven minutes until two for Tuesday is over you make a contribution right now and pick up any thank you give to ten dollars a month we throw in the as a second thank you gift we throw in the brand new reusable stainless steel straw from W E S H comes in his own couch its little struck cleaner it's like a bottle brush cleaner that goes into the straw", "year": "2018", "show_name": "Marketplace", "city": "Pittsburgh", "day": "16"}