{"month": "10", "state": "MS", "station": "WMPN", "content": "No one will\nDo what I was on\nDay that\n\nDone though we know what\nI'm going to be down\nAround\nThe\n\nAge\nNa na na\n\n\n... Mm Mm Mm\nReally\nThere or black\n\nYes they really are as great as they found big bad dude you daddy with that she had her if you ever get a chance to hear them why they're just fantastic it was ... from ... ... with\nThe elderly ... by not and aliens you gave us Neal could I ... at the top of that fact\nIt's been a pleasure being with you this last hour for more details about the playlist checkout ... radio dot Matt and this this show number forty seven eighty thanks to Greg make liquor Christina on his dad and Jim Carey I'm ... like I did I and\nI Do parents is made possible by us support thank you and by the corporation for public broadcasting and envy one stations like Kay Jaycee eight in the millions Flagstaff, Arizona and cayenne you out in the law to Alaska\nThis is needed voice wind the Native American radio network\n[noise]\n[noise]\n[noise]\n\n\nThat the globe is your home for the great American song what each week old showcase the best in local jazz in popular song the Nineteen thirties to today from Frank Billy in LA\nLooks like Kurt Eli Dianne Reeves and Gregory Porter markets you'll spend some time with after glow Sundays at six months MPP music radio\n\n\nStations have been ... be music radio R. W. M. A. H. Biloxi there'll be in a may ... W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W it may be struck full W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at him be be online dot O. R. G.\n\nMm\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\nThat'd be Oliver Lake Oregon\n... now have you know anything about Oliver Lake and has long history at the vanguard of all kinds of improvised music and his association with the black artist group of St Louis in the Nineteen sixties and then later with the association for the advancement of creative musicians\nIf you know some of that and you hear the words Oliver Lake in Oregon court that in the same sentence\nThan you would know do you expect something a little different and that's what this is a very different organ quartet also featuring Freddie Hendricks on trumpet Jericho dot org and Jonathan Blake on drums for about two thousand ten recording called plan from the Oliver Lake or getting a quartet\nBefore that we are the band that Peter or skin put together in two thousand Seventeen are actually two thousand sixteen I'm mistaken this one's been around a little longer than that it's the album in praise of shadows from which we heard a song and titled what if\nWhich like all the other conversations on this recording was written by the keyboard it in this group pardon of stepped in\nAnd you're and um all those anybody anybody you're listening to on this hour you're hearing on jazz with Neal tester\nGlad to have your long we're going to get to some music from Vincent Herring most recently released from the book was Jackie Allen something from the Christian McBride big band and speaking of big bands this one\nA popular recording and one that has a track a lot of attention since it came out in the summer of two thousand Seventeen\nThis is John ... and the monkey stripped from the album volume two and here featuring Kamasi Washington on tenor saxophone and Conrad her way gone trombone amongst composition evidence\n\nNah\n[noise]\n\n[noise]\n\n[noise] [noise]\nWell\n\n\n\nShe\nAnd she she\nShe she she\nShe she she she she she she\nShe she ...\n\n\n...\n\n...\nDa da\n\n\n\nDa da\nPianist shy he no bras Julie from the album am a nation that is his debut album I Believe he's a a certain percentage am I'm a ... mile I think you could hear some of that in the piece that we just listen to called cute little capital\nWhich also featured a well I should tell you that a shot he you know roughly is from Azerbaijan and here he works with the French drummer Andre ...\nAnd then also with the American bases James comeback so it's kind of transatlantic trail that shot he no ... leads on this album imagination\nJust before that we hear from Jackie Allen her most recent album is called the roads fingered dawn featured songs written for her by her husband the bases tons stern who you heard there along with um the richest in on drums jak Brad field on bass clarinet\nAnd John Moulder a guitar and before that to start up that we heard from the markets are led by John easily hurt solos from ... Washington on tenor saxophone from Conrad her way gone trombone and the bases bench shepherd grab the little the spotlight\nOn that the rendition of evidence with like all the songs played by the monkey strip on both volumes of their music\nWas written by a lot of these monk what gets trip so it gets you out and put that together all of that here on jazz with Neal test year where we have a reason music from another a bass player named Jeff Stigler coming up in just a couple of minutes\nWhich allows me a little bit of time to remind you how you can get in touch with any of us from the jazz network you can write to us directly chair of this radio station or you can also reach us by writing directly to jazz network at W. F. M. T. dot com That's William Frank Mary Thomas dot com\nAnd we would of course love to hear from you also gives me enough time to slip in some things sure there are several little interest to show tracks on this album that Sean Maxwell the other ... put out in two thousand sixteen\nWith this group called new tomorrow that's also the name of the recording which advocates on trumpet and met Nelson on keys juniors Paul on base and the drummer still below\n\n\n[noise] [noise] [laughter] [noise]\nIn in\nIn and do you do to burn the Quran from winter to do do do do do do do do\nAnd ... and ... and ...\nThem\n\nTo do and then during the boom\nBoom boom boom boom boom boom boom boom boom boom boom boom boom boom\nCourts that led by just single or here's Vince and hearing\n\nVillage of the most is do they\nHe has\nDog you know to do that and you need\nKnow that he needs to\nGuess there are we going\nRead all new to you and me\nA ride down and talk to me\nNot lead to just walk going me\nAt all but when I go through\nGet the news that you wish that they were using my shoes\nShe's the queen like a mother\nHe said again I said nothing\nWe both looked down at the moment passed there between us why don't you convert the rabbi said mildly\nAs suggesting fish for lunch [noise]\nWatch I looked up to see if he was smiling but he wasn't become a Jew he told me calmly become a Jew and I'll give you my blessing then I'll help you with the money I'll send you to study to become a Ravi\nMe why not you know when I met you that God had sent you to me for some reason\nMaybe this was it who can understand God we can only follow the path\nThat he has written in our hearts no I think I can see what are you voting yours become a Jew [noise]\nMary Lee Matt I thought the most ridiculous thing in my whole ridiculous life leader didn't want to rabbi\nShe didn't even want a Jew she wanted me and how can I be a rabbi if I didn't believe\nBut if I some chance God did exist\nAnd how can I refused to play the hand he helped me with the stakes so high how could I not bet my life\nAnd if there was nothing\nIt was true I did not believe in God but I was beginning to believe in miracles miracles and whatever the opposite of miracles\nTerrible wonders yes this life is a whirlwind and what can guide us through it not our eyes\nNot our ears not our brain what difference does it make what we believe\nOkay I said [noise]\nMy hand guiding me to my feet his eyes were set wet blazing heat squeezed my shoulders\nMy son you said\nIs to me right on the mouth I felt his beard on my lips\nNo go he said go to her\nIran\nI didn't go back around the block I ran out the door and across the street and cut through the neighbor's yard I jumped over their bushes I stopped for a second to younger flower a big orange flour the best one out of the ground roots and all\nA car honked and someone yelled and the dog started barking in Iran pass them across the valley and over the wall back to where my wild bride lay sleeping [noise]\n\nMichael your a red eye gentile by David Gordon\nI'm hope Davis thanks for joining me for selected short\n[noise] Mm\n[noise] selected shorts has produced by Jennifer Brennan a radio producer is Sarah ... Matthew love it's our literary consultant the readings I recorded by ... Smith I programs presented at the Getty Center in Los Angeles or recorded by Phil Richards our hosts are recorded\nArgo studios in New York City are mix engineering is ... ... our theme music as David Peterson's that's the deal performed by the dear Dorothy Peterson ground support for selected short is provided by the ... foundation sponsor of the rain award for short story\nThe seedlings foundation\nThe Henry nice foundation and the ... foundation\nAdditional support is provided by myth on how court publishers of the best American short stories edited and twenty Seventeen my Mac ...\nSelected shorts is also supported in part by an award from the national endowment for the are\nThe program is also made possible by the New York state council on the arts with the support of governor Andrew Cuomo and the New York state legislature\n... dot com is a proud sponsor of selected shorts ... dot com delivers New York original toasting bagels coffee smoked salmon Bob ... and more throughout the fifty states Puerto Rico and the Virgin Islands visit them on the Web at ... dot com flash shorts\nAdditional support for this program comes from the station in public radio international stations nationwide\nSelected shorts it's produced by symphony space and it's distributed by NPR I public radio international [noise]\nOh you\nAnd evening and Jazz Can be just went the doctor ordered takes a great Ella culturing dine on my own in ...\nNicknamed the contemporary giants like sure\nRead more from Malone and been joined me marriage is Michelle the W. J. yes he evening that seven to ten we\nOnly NPT me music radio\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line duck or gee\n[noise]\nWelcome to after glove on your host Margaret chill up this week we take a look at the songs of the Ira Gershwin song book one of the best word Smith so the twentieth century have Ira thanks for the lyrics to embrace W someone to watch over me let's call the whole thing off\nAnd they can't take that away from me\nHe worked mostly with his younger brother George\nBut this hour we'll also hear his collaborations with Jerome current Harold Arlen incurred file sung by Frank Sinatra Ella Fitzgerald Johnny Hartmann and more it owes so nice the ... song book coming up next on after glum [noise]\n\n\nThings that come to a pretty bad um oh my\n\n\nGoodness knows what did they say oh no no\nNo the\nThing [noise]\n\nMovies\nI don't know very no\nYou like the gym [noise]\nYou're almost\nDo in\nWill\nNot let me know Latin\nThat rely on that\nKnow\n\n\nThey yeah ... funny\nHe will\nBe\nThe\n\nNew well\n... oh\nI'm In my mid\nWho was\n\nOh the go\nTo ... well\n\nOh no\nMe neither\n\n[laughter]\nHear Kathy\n\nNineteen [noise]\n\nOoh yeah in the\nSpeech\n\nMy the me\n\nToo me too oh for me [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\nMe neither [noise]\n\n\n\nYeah [noise]\n\nMm yeah he really needs to be\n...\nOh my\n[noise]\nNot\nToo sure\n\n\nBlossom Deering in Nineteen sixty one with a marvelous version of George an Irish when someone to watch over me\nIn Nineteen twenty seven the Gershwin brother scored another hit with the musical funny face the breakout songs from that show was wonderful I'm really getting lyric by Ira\nHere he translates overwhelming passion into an inability to pronounce the entirety of several words it's wonderful it's marvelous and so forth\nThis version ... Fitzgerald also includes one of the ... where Gershwin chops up words like passion fashion an emotion into cash cash and emotion an idea that he got from comedian Walter ... what\nHe was almost six Gerald with wonderful on after [noise]\n\nYou in my\n\n\n\nYou\nKnow [noise]\nYou should\nSee [noise]\nDo see [noise]\n\n\nYears\n\n[noise]\n[noise]\n\nUse it\n\nI'm Glad that my name is ... ... you would be\nTo capture me\nBut you had such versus you wore down my resistance\nThat was well [noise]\nBig and brave enhance so\nNo\nNo no\nNo\n...\n... ... ... ...\nBack to introduce them by mark a gym even looking at this book\nIra Gershwin this hour coming up we'll hear some of IRAs collaborations with songwriters who were not as younger brother George Ira Gershwin wrote lyrics to over seven hundred songs in his career\nAnd in Nineteen fifty nine he put together an annotated allergy to some of his best known song lyrics on several occasions providing some background in some\nInsight into the mind of the nearest is in Nineteen thirty five George and I really worked with not was dubose he worked\nFor arguably the most significant worked date the opera Porgy and Bess\nShepherding some of their best and songs like summertime\nBest you as a woman now and I love she or he\nThe song and going to play for you now however is one that\nI wrote and George worked on alone without a contribution from Hayward\nGeorge wrote a blues the opening morality to the song and I gave it the dummy title of it ain't necessarily so meaningless lyrics that just happened to fit that morality\nBut then I thought that maybe the character sport in life what do you use this phrase to startle some religious folks about their beliefs and the song grew from there he was ... with that song\nFrom Porgy and Bess now we didn't necessarily settled\nInane Nassar's man really Sal [noise]\nGet a necessity than it is so [noise]\nThe thing is that John lying\nTo read in by\nInane Sarah nice so [noise]\nAnd then they let us know\nHey [noise]\nWell no not um [noise]\nShe thought they were going to know\nWho to name down die\nHis name\nBut oh man\nLived in a way\nIn a way [noise]\nHe made his\nThe issues that due\nJune I mean\nYou know way of [noise]\nThan three [noise]\nIn this too\nTo low sparrows dodge\nShe ... she came\nFrom that too many [noise]\n\nYeah\nIs a low low\nAnd\nThing that you're lying\nTo read in the boon\nInane\nAnd he's you know [noise]\nHitting this\nAnd this\nThis\nFrom the opera Porgy and Bess that was George ... song it ain't necessarily so some by Peggy Lee\nNot long after Porgy and Bess ... brother and musical partner George passed away that was the year Nineteen thirty seven I wrote withdrew from songwriting for four years after his brother's death\nAnd returned only at the insistence of composer Kurt file vile and Gershwin collaborated on the Nineteen forty one musical lady in the dark\nIt's musical was later made into a film starring ginger Rogers and included songs like the saga of Jenny and Tchaikovsky a hilarious patter song for singer Danny Kaye that mentioned the names of about fifty Russian composers\nIncluded in this list was Gershwin friend burning Duke whose real name was flat I'm married to Cal ski Gershwin and do work together five years earlier on the song I Can't get started [noise]\nThe one song that recruits throughout lady in the dark is my ship a song that's been performed by everyone from Rosemary Clooney two miles Davis here now is Johnny Hartman with Ira Gershwin incurred vials my ship on under\n\nMy food\nThat um [noise] do\nThe the ... [noise]\nAnd I'm ... I'm ...\nAnd I remember who\n\n\nMy ship with a million\nGrow the bill has been\nThe sun sets\nA ... ah\nWhen my ship um [noise] I ... ...\n...\nWell ... ...\nBut I'm not\n... the man [noise] it was just one\nOr not but overall\nFive degrees you know we can\nGet shipped by sea\n...\nMy ...\nShe was\n...\n\n", "year": "2018", "show_name": "Highway 61", "city": "Jackson", "day": "21"}