{"month": "11", "state": "MA", "station": "WNCK", "content": "Stay high fifty eight to sixty three how these guys are the risk of showers late Thursday night fifty to fifty five re we'll wind down to ... hours on friday lower sixties that's your island forecast this was meeting all distress tomorrow in eighty nine point five W. N. C. K. [noise]\n\nHow many little dirt leaders and princes layers are out in your neighborhood type or have they been overtaken by Kailua Iran's at this point my kid is out as Iron Man [noise]\nI'm sure my wife has been enlisted to manage quite a whole of candy in his goody bag at this\nI'm Steve seal I've got a wall to wall our of seems fit for fun whether you're handing out the fun science candies at home yourself or traveling door to door [noise]\nThis music of John Williams coming up lots of spooky favorites as well [noise]\nWith her you know the title you don't you'll enjoy the [noise]\nHeavy Halloween\nLive from NPR News in Washington I'm ... here in Pittsburgh today more funerals for the victims of Saturday's attack at the tree of life synagogue among them a memorial service for are being younger NPR Jon Stewart as more\nFamily and friends gathered at the ... temple to remember the sixty nine year old father and grandfather Josh Scott redken lifelong members of tree of life said younger was known for his sense of humor devotion to his family and commitment to his congregation\nFamous services on the high all it is or was every Saturday though it was really a true patriot really kinda represented but then I got really well just a nice guy this cat about family and community [noise]\nAh [noise] not an ounce of a hate in his body funerals\nContinue in the coming days for the eleven victims of the shooting John Stewart NPR News Pittsburgh\nPresident Donald Trump is going on the offensive after house Speaker Paul Ryan dismissed is called an automatic birthright citizenship for the children of non citizens born in the U.S\nTrump says Ryan should focus on holding the majority rather than giving his opinions Ryan said yesterday he does not think the president can limit birthright citizenship was addressed in a constitutional amendment by simply issuing an executive order\nBut speaking to reporters day ahead of another GOP campaign rally Trump disagree\nI Believe that you've got to have a simple though to Congress or even possible\nLegal scholars that you can do it to\nExecutive order now I'd rather do that for a minute while\nTrump continues to push the executive order idea he also says he expects lawmakers to work on closing immigration loopholes and securing our border General Motors announced today is offering buyouts to about Eighteen thousand white collar workers in North America as NPR's John Ydstie explains the automaker says the violence or an effort to cut costs\nGM announced the buyouts and the same day the company reported a better than expected to point five billion dollar profit for the third quarter in a statement GM said the buyouts are part of the company's effort to reduce cost while the economy remains strong\nGM and other us based car companies are adapting to higher costs for aluminum and steel inputs following tariffs imposed by the Trump Administration GM also faces slowing sales in the U.S and China\nThe buyouts are available to GM salaried workers with at least twelve years of service the automaker has about fifty thousand salaried employees in North America John Ydstie NPR News\nWashington the Federal Reserve says it's taking a look at its current requirements when it comes to bank holding requirements for financial institutions that are big but not necessarily mega banks rules were put in place in two thousand ten is part of the Dodd Frank legislation which was put in place after two thousand a financial crisis\nOn Wall street that that was up two hundred and forty one point this is NPR\nCanada's legal marijuana market has been off to a bit of a rough start with supply issues being one of the biggest problems\nBack was forced to close its government shops at the beginning of the week for three days because there was no pot to sell ontario's government is online store can't fillets orders and in British Columbia there still is just one legal retail outlet\nIn government says it's adding people more quickly process licenses for producers\nOne year after the me too movement took off a new NPR Ipsos poll shows the nation is deeply divided on the issue of sexual assault and harassment mostly along party lines is NPR's Tovia Smith reports more than forty percent build a movement it's gone too far\nAnd the ... of those surveyed say the movement has not shared in a new era of accountability which offenders will be held accountable and about a third seem to think the movement has not yet gone far enough saying they believe allegations of sexual harassment still get ignored\nBut a larger chunk forty three percent pay me to have gone too far including three quarters of Republicans versus one quarter of Democrats\nOr Republicans are also much more likely to say false accusations are common and that can can be more forgiving of political candidates have been accused of sexual misconduct but Democrats say that's a deal breaker most Republicans do not Kevin Smith NPR News\nNorth Carolina officials say they're starting to get a better handle on damages from Hurricane Florence and say there are substantial I submitted damages from the storm are now approaching Seventeen billion dollars that's a big increase over the\nPrevious estimates I'm jak sphere NPR News in Washington\nSupport for NPR comes from Fidel investments taking a personalized approach to helping clients grow preserve and managed their wealth learn more at ... dot com slash wealth finality brokered services Elsie and Americans for the arts and Americans for the arts dot org\nI'm Steve seal happy Halloween this hour I'm going wall to wall was\nMusic especially picked for your all Hallows activities\nWhatever you may be doing I've got some familiar favorites and pieces mixed into will bolster the mood as well and here's another favorite ... that is a boy this is just practically obligatory but he just you can't do without\nHeading off to the hall of the mountain king and here's Greek\n[noise]\n\n[noise]\n[noise] [noise]\n\nUh-huh\n[laughter] [noise]\nIn the hall of the mountain king from pure gets why and for Greek or classical music on this Halloween evening is supported by for sure creating modern photo decor and gifts by printing photos directly on glass\nFracture is image brain and balance it all in one hand made in a carbon neutral for factories are more fracture me dot com slash classical\n\n[noise] [laughter]\n[noise]\n\n\n[noise]\n\n\n[noise]\nThe the fleet around overture by your hunch Trump junior or as\nA as a young intern a once said you would say I'm a young classical music announcer didn't know too much about it at a small station I work at once you die fled your mouse or the philharmonic orchestra did there by William do\nYou want to stress juniors music W. N. C. K. Nantucket Mm\nMm\n\n\n\nNo targets NPR station eighty nine points by W. N. C. K.\nFor George ... feel Chadwick symphonic sketches this is the section here called ... goblet\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[laughter]\n[noise] [laughter] [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] The Apprentice at least saved last by the return of the boss who's fortunately not too late to set things straight yeah the search for his apprentice my power to do a lot of luck in the French national orchestra\nThis is eighty nine point five W. N. C. K. Nantucket\n[laughter]\n[laughter]\n[laughter]\n\n[laughter]\n[laughter] [laughter]\n\nHi this is email from Nikki Haley foundation for Nantucket inviting you to listen to eighty nine point five O W n C K ... NPR station WAMC Kate Nantucket source for NPR News this morning edition all things considered\nAnd then ... what a select means meeting log onto Nantucket NPR dot org for more information\nAnd tune into Nantucket NPR station eighty nine point five W. N. C. K.\nForty years ago in New villain appeared on the silver screen to enter the Canada the all time great villains subsequently all time greats rental costs too much [laughter] with these black helmet and black Cape and black motorcycle clothes and\nJames Earl Jones voice [noise]\n\n\n\n\n", "show_name": "Performance Today", "year": "2018", "city": "Nantucket", "day": "01"}