{"month": "10", "state": "FL", "station": "WBOB", "content": "'em me hang on long [noise]\nHey I'm six hundred WB you'll be Jacksonville one on one point one of them do you choose to six seater [noise]\nTalk [noise]\nBreaking news this hour from ... in\nWashington President Trump is passed sour responding to the news but deadly shooting until I was so the guardian Pittsburgh starting with praise for the quick ineffective response by police\nFrom making just a few minutes ago with reporters at joint base Andrews even as a ... to do the trickle in relation to the shooting president says the outcome of that\nEven as attacks continue to trickle in relation to the shooting\nPresident says the outcome of that synagogue would have been different with an armed guard saying quote they didn't have any protection the president tweeted earlier that it's a terrible thing what's going on with heat in our country here some of the facts that we know right now police reporting only than a suspect is in custody after the shooting it caused but they call multiple casualties\nAll Jews must die the shocking once he was reportedly shellings a burst into the building today in the tree of life synagogue mentioned Pittsburgh's a squirrel hill neighborhood a spokesman says please have no information this time because they're still trying to clear the building and make sure that there is no more of a threat\nInside the synagogue said to be located at the intersection of Wilkins and shady avenues a tree lined residential neighborhood of squirrels we'll just about ten minutes from downtown Pittsburgh and that is a Hubble Pittsburgh's a Jewish community again three police officers that have been among those wounded\nForced to take shelter behind their own vehicles as the shots rang up from inside the building's basement as they were arriving at the scene we're being told the shooting was time to coincide with a nine forty five pm local service at the building this is the largest Jewish community in the neighborhood and we're also told the Carnegie Mellon University in the general area has been shut down\nAs a precaution as well\nYou'll find more all these stories at town hall dot com\n\nField\nGoals the issues is to some of these matters a lot of the second one was this was\nRe enter all district judge in California stand in the ruling that even hunting children can be held more than ... I don't see how they can elect Congress together in\nTwo thousand election Dorothy\nLeaders whether you're listening to morning\nNinety five north on road construction has the right lane close approach them yawn Fran Fran Okay Mark my ... son because of that vehicle broken down just before the ... bridge\nPartly sunny breezy this afternoon Seventy four and a high tonight cleared down to fifty two sunshine tomorrow mid seventies right now Jacksonville has cloudy skies in sixty four a talk radio W. B. O. B.\nFollowing advertisement by tearing products these statements have not been evaluated by the at the age is not intended to diagnose trees to offer them any diseases below welcome once again to help line by purity products have your host mark Simone so\nGlad you could join us today it's a power pack program in fact our story originally Fifteen Years ago when the renowned TV show sixty minutes captivated\nAudiences around North America with a special segment of the French paradox\nYou remember the French paradox this is the counterintuitive concept that says red wine actually promotes our cardiovascular health and vitality scientists were intrigued well fast forward ten years Harvard researchers in Boston test over thirty thousand compounds searching for the one the best activates genes that control our weight\nOr energy healthy aging and even longevity\nThe holy grail of medical research and what did they find out of thirty thousand compounds tested the single best gene activated was spiritual yes ... the active ingredient found in\nThat's right red wine five years later ... is one of the hottest breakthroughs in the field of healthy aging\nNow our guest today says that's just half the story so here with the rest of the story Dr Alan ... let me introduce Robert Twenty years Dr president has been an institutional New York radio host in his own highly successful health radio show\nHe holds a PHD in clinical nutrition he's been a longtime products formula later and high level advisor for purity products that depressed mood welcome aboard\nMark always great speaking to you\nWell it's great to have you with us now let's touch and the reason we're it's also nominate those people out there who just to vaguely familiar with the story what exactly is was very ... and why is it all over the news today\nWell first of all it sure is all over the news especially the Health News\nYou know I read about twenty health journals a week and every one of them seems to have an article about resveratrol basically resveratrol is what we call a poly sci and all it's found in red wine it's found in purple grape juice it's found in berries it's even found and peanuts\nAnd the interesting thing about resveratrol is it's actually produced by plants\nBy plants themselves to protect themselves against any kind of injury any kind of infection and against any kind of radiation\nAnd the scientists really first became interested and resveratrol mark about Nineteen Ninety two when raspberries role was first isolated from red wine it was also found at that point in the skin of grapes as well\nAnd this is what got all those scientists interest in the early studies showed that resveratrol seemed to extend the life of fruit flies of worms that even some fish\nWell anything that extends the life of anything is going to pick the attention of scientists\nAbsolutely wow what by two thousand six\nItalian scientist discovered that resveratrol extend the life of certain fish by fifty six percent and it even increase their swimming ability well also in two thousand sex and here's what really got them interested a Harvard researcher David Sinclair\nReported that resveratrol counter acted the negative effect of a high fat diet and mice by thirty percent\nNow given that most Americans seemed to be on a high fat diet\nThis was pretty darn interesting well later research goes on to show that resveratrol had a very positive effect on a number of interesting things like blood sugar levels like normal cell growth and it even seem to protect the intestines and the colon definitely supported normal and some attic activity in the body it improved indoor and\nWas even a great study at the Institute of genetics and cell biology in France that showed that it dramatically improved enduring story aerobic activity and it even proved to support brain function great study from Weill Cornell Medical school in New York I was just reading\nAt an even neutralizes free radicals but the reason the bottom line reason mark that it's all over the news nowadays is research at Harvard\nThey found that caloric restriction eating less actually slows the pace of aging and extended the lifespan in laboratory animals by forty percent well whenever our health is threatened any proceed to health threat like not eating enough\nCaloric restriction your body feels threatened switches on what they called the longevity gene in your body it switches on sort of a protective mechanism that begins on a secular level metabolism changes\nYour ability to adapt and coke dramatically changes as a major positive influence on growth hormones and stress hormones there's actually an increase in repair all of this switched on by a family of genes we called sirtuin but here's the\nAccording to the work done by David Sinclair at Harvard notice it's important\nThe most potent activate or of the sirtuin genes in addition to caloric restriction is resveratrol and a great hope is that what's happening and all these animal studies all these amazing benefits with resveratrol will translate into people as well\nAnd this is why millions of people all over the world are now taking resveratrol pretty much every day\nWell this is amazing but let me just step back from\nAre now taking resveratrol pretty much every day\nWell this is amazing but let me just step back for a moment I Know you've been working with purity products for several years under co Q. formulas but now the teacher co enzyme Q. ten which is just as important as reservists role especially for your heart health and your says in some ways it's got even more evidence behind so let me ask you this who needs to ten and what exactly is good for\nWell first of all let's take a quick pick a what a co enzyme is\nA co enzyme has any substance in the body that speeds up the rate at which a chemical reaction takes place like a vitamin in many respects\nWell co Q. ten is the new trend that is responsible for the energy that's the key word the energy that supplies your brain your heart your liver your kidneys in fact we need co Q. ten to literally convert all the food we eat into energy wow that's amazing\nYeah well that's what it's all about not only that but it's a very powerful antibiotics and and I remember Marc let's go back to Nineteen sixty three that's awhile ago\nWhile I was teaching for the first time physiology and nutrition and I remember speaking about co Q. ten at that point and this is Nineteen sixty three\nAnd at that point it had only been discovered six years before Nineteen fifty seven at the University of Wisconsin where they were looking for what makes the heart beat they were literally looking at hearts and saying\nWhat is making this darn thing beat well they found out that was co Q. ten and that co enzyme Q. ten supplies that energy in fact by Nineteen Seventy eight a British biochemist named Peter Mitchell\nKnow there was a key molecule found in red wine which is studying at Harvard and I knew that it activates genes are those are just to to talk to us about all the excitement surrounding ... and why you specifically wanted him this formula while\nI tell you the researchers at Harvard under the leadership of Dr David Sinclair this is what they found\nCaloric restriction eating less slows the pace of aging\nThat's pretty darn impressive and what they found in the laboratory studies of animals is that an extended lifespan and it appeared that caloric restriction eating less food and you're eating right now by a certain percentage increases your longevity you'll live longer it increases the activity of what we call a longevity gene\nThey get switched on they help improve metabolism it increases your ability to cope your ability to adapt in fact this is Jean helps increased tissue repair and its switched on by a group of genes called sirtuin now they found two things at Harvard number one caloric restriction\nIncreases these longevity genes these are two inch\nWell so does resveratrol\nAt least in their animal studies and this is exactly ... been making all these worldwide headlines because if it works in humans as it does and these animals and I'm optimistic it will\nIt represents an entirely new approach to managing health and wellness where we potentially using their traditional compound like resin ... actively target the exact genes associated with these various areas of improvement that our health and our aging and our longevity\nWell now that the president you say that took you ten holds an elite status in the nutritional supplements industry because it's been so well documented and so well researched you call this evidence based nutrition maybe give us a brief overview of the research and explain why it took you ten research is so widely respected\nWell let's go back to Nineteen fifty seven University of Wisconsin the Nobel Prize for Peter Mitchell in Nineteen Seventy eight\nThe University of Texas Medical school Purdue University in Indiana Stockholm University in Sweden the great study recently at the University of and counting and Italy on mitochondrial energy and co Q. ten\nThe University of Grenada and Spain talking about co Q. ten being a powerful anti ... article published constantly throughout the world\nThe archives of biochemistry and bio synthesis the proceedings of the national Academy of sciences major studies major universities right here in the United states and abroad the bottom line and these studies\nEnergetic mitochondria without co Q. ten you don't have energy combine that with resveratrol I'm telling you pretty darn amazing\nNow that you present purity products occasionally does these free bottled give away with this one sounds really special wasted is so important\nWell I mean you really get an opportunity you get a chance to see for yourself what I'm Talking about I mean you can hear me speak about energy and physical performance and there's nothing quite like experiencing it for yourself\nI mean you hear me say some pretty amazing things\nThat you say well that's pretty interesting but until you know until you try this for yourself by taking too soft gels a day of his co Q. super boost formula you're not going to really appreciate what I'm Talking about and the best way to do that is to call the number you gave out get your free supplied try it for yourself and you'll see the difference\nMore with our guest Dr Allen precedent in the middle but right now purity products recognize leader in the field of evidence base nutritional solutions has an incredible free bottle offered today for the first thousand color so don't miss this chance to pick up the phone call now operators are standing by\nThe college free one eight hundred seven three six three three three\nOne eight hundred Seventy one\nSeven three six three three three one eight hundred seven three six three three three get to call it would be one of the first thousand people and get your free co Q. super boost formula\nNot available in stores only directly through purity products you just pay for the shipping limited one per household the toll free number again one eight hundred seven three six three three three\nOne eight hundred seven three six three three three once again we're talking with Dr Allen precedent now that the press and we talked about the co Q. ten we talked about there was very strong\nBut you've added vitamin D to this and I know there was a meeting with Dr canal from the vitamin D council and it's made me a believer but you added vitamin D and you've added vitamin B. twelve\nYeah now many people go through life not knowing that they've got to co Q. ten deficiency with vitamin D vitamin B. twelve those are also important to why did you had these factors\nWell right now I think at this point in time there's more research being done on vitamin D that pretty much any other vitamin or nutrient and the reason is listen to this one\nBillion people worldwide do not get enough of vitamin D and their diet according to the New England Journal of medicine while I mean that's a lot of people\nAnd we found out some pretty amazing things with all of this research now listen to this\nWhen most people think of vitamin date of bone on bone health you might think of sunlight as well or vitamin D also plays a very powerful role as a supporter of the immune system\nIt supports immune system health and immune system activity quite dramatically in fact it also helps support and brain function memory cognition it helps calcium build bone of course\nBut also it's very important for heart health for your blood pressure and the great new study out of Harvard Medical school and the University of Iowa talking about the importance of vitamin D and lung function it supports a healthy cold on top of all of that\nAnd a great new study out of the University of Hawaii talking about vitamin D and colon health I mean who thinks that those things right\nYeah that's amazing so I think it's a welcome addition to this amazing formula to co Q. super boosts formula in addition to that I said to channel look\nWe should put some B. twelve and here as well it's called ... and I say that because the twelve convert the carbohydrates and proteins and fat that you're eating convert them right into energy\nAnd this is all about energy and well being so when you're sitting down to eat your breakfast or your lunch or dinner if you don't have enough the twelve that great meal that you just said is not going to be converted into energy into your body\nNow and let's say until you try this unique combination of the one hundred milligrams of co Q. ten the advanced raspberry ... the way you find them in ... co Q. super boost formula that you won't know what you're missing but explain what you mean by that\nWell I Want you to experience it I mean I Know you've heard about how co Q. ten and resveratrol and B. twelve and vitamin D and by the way it has even some vitamin a and it's amazing formula how they all work together\nTo create what I call the environment of energy in your body not only physical energy mark but mental energy and ... stamina I mean I wouldn't I mean raise your hand if you don't want to energy and director of stamina\nEverybody wants it absolutely I mean come on and this is a great way to do that and I said ... you know let's held him about it and let's let them experience it for themselves\nWell absolutely fascinating but Dr presents for people who were tuning in late having a quick recap here what exactly is coke Cuba's very tall super formula who needs it and why is this in your opinion the next generation of co Q. supplementation and how does purity sleep bottle offer work\nWell look I think there's a distinct advantage to having energy endurance and stamina and if we were going to isolate the nutrients and create what we would call a daily essential and somebody gave me the assignment list the top five or six nutrients that we need to literally give us energy\nTo build endurance to bill stamina I went to lift the following nutrients\nCo Q. ten resveratrol the twelve and vitamin D day this is the advantage as we're speaking about at rather than going out and buying all four or five of these different nutrients you get them all in one with the cocaine daily super ... and the idea behind that says you take two a day you\nSee how it works for a month and you'll find that you're going to be on the phone calling to order more because you're going to have a lot more energy just make sure you're in that first thousand of the day today and get a free offer that we've been talking about after caller one thousand I understand the daily offer expires so don't miss out\nWell we'll give it a number of the moment Dr precedent is always a huge pleasure always interesting talking with you thanks so much for joining us today mark my pleasure\nWhy appreciated now one more time had a pencil and paper handy right this number down it's one eight hundred seven three six three three three\nOne eight hundred seven three six three three three that's the number I Want you to call its toll free operators are standing by purity products recognized leader in the field of evidence they nutritional solutions\nHas an incredible free bottle offered today on their revolutionary co Q. ten plus marital super formula now here's the deal be one of the first thousand callers today and purity is going to rush you out a free bottle of their co Q. super boost so you can see and you can experience the power of co Q. ten and was near a troll for yourself\nYou pay just for shipping only four Ninety five and the shipping is a hundred percent refundable by the way\nSo wherever you are whatever you're doing made sure you're one of the first thousand callers today and lock in this free bottle you'll see all the energizing power of purity co Q. super boost in every single cell in your body\nAnd you'll be glad you did this product to try to remember when you think of coke Cuba's ... the cardiovascular health the cognitive and brain performance and think energy and enduring\nCo Q. ten is the body's natural catalyst in the production of cellular energy\nAnd with residents troll you experienced the amazing benefits of the key red wine molecule which you've been seeing all over the news lately so don't miss this chance to pick up the phone and call now\nMake sure you're one of the first thousand callers today to qualify for the special radio offer\nWell if you eat a lot of green leafy vegetables for like a whole head of lettuce and that won't get to they're either and and nuts and whole grains but it's impossible to get there without a supplement 'cause you need this bulky magnesium and that you need a lot of it a lot more ended up that very rich diets had a lot of calcium and\nSo you need more magnesium more than you can get out of your diet which is why we're having our\nOur uh show today and of course you may think well I just go to the doctor he'll do a blood test and you know because there's very one percent of the magnesium is in your blood and you really need a special kind of magnesium it's a red blood cell tests\nIn order to see if you have enough magnesium so the best way to do is just take it and feel the difference because most of us\nAre magnesium deficient now this wonderful new mega vantage for purity products it's their flagship injury is there twenty fifth anniversary and they want every listener to get a free bottle and of course\nPurity products you kick in a little bit of shipping they send it to you for free you get to try it you tell them whether it's working for you but you can feel the difference once you get this magnesium and ... before\nWe have these ... leaders and we need to replace it back and I find it's best for me to take it in the morning that's when I really like it my brain needs it and it really gets me going and we need it for sale energy that cell energy little compartment in your cells\nCalled mitochondrial well as she waits guess what your mitochondria art as efficient you need to make eight dino try phosphate the energy molecule and I know a lot of folks take co enzyme Q. ten for this very purpose you need magnesium first right makes me easy him is needed\nTo make the cell energy you need the cell energy and so that's why we talk\nOver and over magnesium the crying need the bodies crying need I Love purity products what they're saying and the twenty first\nFifth anniversary bulletin it's our passion to get Mac vantage ... everybody listening Graham today I Love the word passion we need to have passion we need to say it's time for you to find out what your body how it would work right and how well it would work once you get enough magnesium\nAgreed news dirty punishes celebrating the twenty fifth anniversary with an amazing free bottle offered today on may bandage again mad vantage he's the big free surprised today and it's all about keeping it simply\nForget these four or five giant horse pills to get your magnesium just do simple tablets a day of mad deliberate powerful combination of world class magnesium plus vitamin D plus\nAnd this is going to promote your energy your heart your mood your brain your blood vessels even healthy sleep\nCool now operatives or see anybody's one eight hundred five five Seventy three Ninety four to get started that's one eight hundred five eight five Seventy three Ninety four again one eight hundred\nFive eighty five Seventy three Ninety four\nJust be one of the first thousand coolest the computer's gonna rush you want a free bottle of Meg vantage you simply pay four dollars and Ninety five cents for shipping and handling to put it to the test and it gets even better because if you call him right now is the free bonus gift\nPurity is going to include a second free bottle during ... beach world energy melts the ... the two bottles of freaks you got nothing to lose pick up the phone call now one eight hundred five eighty five Seventy three Ninety four that's one\nEight hundred and five eight five Seventy three Ninety four this is not available online or in stores only directly through purity products today\nDon't miss out simply covered the shipping and handling you turn to free bottles now here's the number again for your free modeled manage Chambliss plus your freebie twelve hundred emails call now one eight hundred five eight five\nSeventy three Ninety four again one eight hundred five five Seventy three Ninety four now bill I Love ... formula because I I Love middle things to do so much Jim magnesium taboos could be so big such a shortage he would not this may be image formulate simple plus\nYou would think in the ... D and even a little bit of ... can you explain to the rationale for not only including the three hundred and fifty milligrams of this high efficiency magnesium ... go I can eat bumper she laid for magnesium but also problem any with the other factors\nWell we certainly know without vitamin D you're not going to utilize the topic of magnesium so it's important to have the vitamin D to utilize the magnesium it's important that you get the normal lies are in there and that's for a little trace mineral that it really does help a little three milligrams\nYou can't get that out of the diet either and they do really help you maintain your magnesium levels\nAnd I'm just looking at all of them well studies here on my desk and as I look through them it gets just endless\nAll the consequences we pay for not getting enough magnesium and efficiency in our population particularly in our a process diets we have what they call high calorie malnutrition\nWe have a lot of calories but we don't have a lot of nutrients and the big one we're missing is magnesium and that's what our show it's about today and I don't care if from from the head to your toe\nFrom your muscles to your brain to your heart you need the magnesium and you need to give it more energy cell energy to important what what's working all day long your heart it needs magnesium I'm just reading here about mood and magnesium and how\nWell as we get a little bit older we lack in magnesium and so it's important that they are to trouble sleeping they did it double blind placebo control study they gave people about five hundred milligrams and magnesium they slept better and sleep quality improve they were more refreshed it said so\nIt it it doesn't matter what it is we need more magnesium so very important becomes aging pill of sorts\nAnd of course we know that it's a highly important you don't get enough\nAnd of course if you are on a dire ethics drink a lot of coffee soda pop you're going to make it worse so it's important that you get that magnesium back\nLet me get at Harvard so let me explain it to our listeners and Harvard study they followed nearly forty thousand men for twelve years and the most users finally modest positive relationship between magnesium and\nAnd for twelve years and he moved to users finally modest positive relationship between magnesium and hard don't fit in the region Saudi women aged forty somebody's going to be five\nHigher magnesium indeed was not only used to see what the healthy heart rate was ... she was blood sugar balance the cholesterol levels more you know your metabolism connect the dots your why use magnesium ...\nMagnesium is your heart's best friend magnesium is central to healthy heart rhythm remember magnesium helps muscles relax well calcium constrict magnesium helps your blood vessels relax it promotes healthy circulation\nHealthy blood pressure to the Harvard study track tens of thousands of men for it does in years and we saw magnesium levels were associated with many cardiovascular health benefits\nIt even helps with exercise performance here's this study right from the national library of medicine January two thousand fourteen magnesium it enhances exercise performance\nThe increasing glucose availability in the blood muscle and brain during exercise wow you don't forget this\nHealthy telomeres to make me is the um supplementation will lengthen your telomeres telomeres are those in caps\nOn your chromosomes that linked to longevity well as the telomeres are shrinking their link they they think that's a marker of aging and they find out if you supplement with magnesium the telomeres\nGet longer now I ... I don't know where this stops this magnesium story is a miracle in itself and it's simple you you've heard the word magnesium you know what it is the point is you're not getting enough\nThe answer is how do you get enough it's Meg vantage and you get to try it for free to dates purity products\nWe love talking about these things if you're just tuning in driving around listening to the radio I'm Bill thirty here with purity products\nAnd channel Evan the president of purity product once you all to know\nGet a bottle of Maggie vantage inside your home get rushed to you right away so you can try it and see the difference it will make\nYour living all you're doing what you you know you see the ... is like a G ... walking in\nThe manic reactions you don't want these reactions slowing down because ... and would you do you spend like Tina taxed on your health you should have to pay your fifty percent about ready to get you an adequate levels we got to be attuned to talk about that\nWell it says here this was Mildred ceiling many years ago of an expert in the ... that make me them and she pointed out if we're not getting six milligrams per kilogram of body weight ... kilograms to point two pounds so we're going to go about Seventy kilogram body is about a hundred and sixty pounds\nSo uh Seventy times sixteen she says\nWe need four hundred and twenty milligrams a day\nI'm telling you you're not getting even two hundred milligrams a day\nAnd you can't make up for it by me eating more green leafy vegetables you couldn't eat that much food so ... where in ... supplements and we're into which ones and unfortunately we've got magnesium oxide only four percent of it gets absorbed\nIf you're getting four cents a value on a dollar to is that\nYou don't want those T performs you want the forms that are highly available now we have something four times greater absorbed and vile available\nAnd that's the magnesium ... and purity products likes to wave the flag and took their horn about this wonderful new form that works for you and I know you may have some magnesium there you may have gone to the store", "show_name": "Purity Products", "year": "2018", "city": "Jacksonville", "day": "27"}