{"month": "10", "state": "GA", "station": "WUWG", "content": "So it's free but you need a reservation to get to go to G. P. B. dot forgive slash community if before twelve noon Andre Dawson is your point five GPA Atlanta and cheap evening news dot org remember to follow us on Facebook and Twitter a gp be news news from NPR's mixed but it's our number one of your rent now\nSupport for G. P. B. programs comes from our listeners and Georgia State university CPB Atlanta is license to Georgia State university the largest University in Georgia and one of the largest in the nation more information is available at G. S. U. dot edu\nAnd delta Atlanta symphony hall live welcoming iconic vocal group the tenor is to Atlanta on friday October twenty six for their fan favorites tour tickets are available now it ticket master dot com and the ... box office\nFrom the University of Georgia with his mind be point seven F. L. W. W. W. W. H. B. Gerald Ford of Georgia Public broadcasting radio network\n\nFunding for here and now comes from ... and simulate some wearing accelerating the pace of engineering and science and learn more and men were\nNot come from NPR on WB or Boston I'm Jeremy homes and my mom and\nYoung tearing down [noise]\nComing out the latest on the investigation into the disappearance of journalists Jamal to\nShowcase also astronaut may Janice and wants everyone to download an app today and look up at the sky for one day why don't we stop looking down\nBecause so many times when we walk around the world we're not looking out we're not connected we're looking down at our mobile devices were looking down at our faith\nAnd two time Oscar winning actress Sally Field standing new best selling memoir reveals that for years as a child she was sexually abused I learned in myself out of the\nAs I started my early career I was able to send out the pardon me that were overwhelmed coming out here and now they're just first [noise]\nLive from NPR News in Washington ... sang\nTreasury secretary Steve Mnuchin has the latest major figure to pull out of Saudi Arabia is upcoming future investment initiative summit as suspicion of foul play looms over the royal family\nFatty crown prince Mohammed bin Salman is widely suspected of ordering an attack of the Washington Post columnist Saudi dissident journalist Jamal ... his family and friends here he is dead the crown prince however denies\nAt least suspected of ordering an attack of the Washington Post columnist Saturday dissident journalist Jamal ... his family and friends here he is dead the crown prince however denies any involvement\nSomeone who shouldn't has announced via tweet that he will not attend the official line from Washington is that the administration still reserve judgment until all the facts are in just back from Saudi Arabia and turkey secretary of state Mike Pompeo was at the White House today telling President Trump\nThat the Saudis need more time to investigate ... just two parents we have the latest on this from NPR's Michel ... secretary Pompeo says he got assurances from the Saudi that they will be thorough in their investigation\nTitled frozen from wanting that we ought to give him a few more days\nHave to wait understanding of background which we can make decisions about how the United states should respond to\nSurrounding this debate\nOn bail isn't responding to news reports detailing how ... was tortured and killed at the Saudi consulate in Istanbul he says there are lots of stories about what happened but he's waiting for facts to unfold Michele ... NPR News Washington the Taliban are claiming they were behind a deadly attack in southern Afghanistan\nThat claimed the lives of three provincial officials including Kandahar as powerful police chief\nJeffrey glass report the Afghan guards carried out the attack\nConsumers equals respected and fears in Kandahar as police chief and the birthplace of the Taliban he was praised for bringing peace to the city but the Taliban tried to kill him dozens of times and really can self was controversial human rights watch called importer in chief for alleged illegal prisons and heavy handed tactics against those who\nOpposed him that Jennifer glass reporting powers returning to more communities in the Florida Panhandle devastated by hurricane Michael and ... among reports a few school districts are set to reopen for classes next week\nSchool districts are preparing for students to return early next weekend Holmes county in Franklin County which sits along Florida's northern coast classes are still cancelled in most parts of Florida's panhandle ravaged by hurricane Michael\nIt's not clear window schools will reopen for students some school buildings are sheltering hundreds of families across the region as a cleanup continues after the storm\nSeat officials are now sending up at Base Camp in Tallahassee to provide long term housing for the utility workers and first responders working around the panhandle were more than a week after the hurricane many do not have electricity or cell phone service and you along and Jared news Panama City\nThe death toll from hurricane Michael is at least twice\nWeek after the hurricane many do not have electricity or cell phone service and you along and Karen Hughes Panama City Florida the death toll from hurricane Michael is at least twenty nine from Florida to Virginia is down three hundred forty eight points this is NPR News\nLive from the GB newsroom good afternoon I'm Dawson just ahead on here now American intelligence agencies are now reporting\nNearly there's nearly certain ... was killed and that the Saudi Arabian crown prince was involved will get the latest but first and she'd be news some states cotton crop was devastated by hurricane Michael gp ... has\nMore and more than a million acres of caught and were planted this year before Michael hit\nWe had a great ... of cotton out there that was opened up and ready to be arrested and that's where the problem the wind came through ... ... ...\n... what the Georgia costs and commission he says the hurricane is one of the worst disasters that could happen to farmers\nThe ripples of the storm will continue to be felt in rural communities the door for years to\nStill says some farmers are just now getting assistance after Hurricane Irma hit last year and lost his top the hundred million dollars this year is damaged is expected so far exceed that ... the News I'm Ross corral in Atlanta\nNew reports the sellers are continuing to have a tough time and that led us housing market studies from the Atlanta realtors association and re max Georgia show that home sales are down ten to Fifteen Percent from this time last year\nAccording to the AJC experts say rising home prices and interest rates are discouraging many buyers especially those looking for modestly priced real estate\nPrices in Fulton into capitalism by about fourteen percent since last year but median pay grew in much slower rate Georgia News Go to GB news dot org and follow us on Facebook and on Twitter at gp be news\nSupport for NPR comes from NPR stations other contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more I'd go to meeting dot\nDuty point five TPP Atlanta weather forecast partly sunny today high near Seventy partly cloudy and it'd be upper forties overnight friday partly cloudy with a high and the upper sixty sixty seven right now we find cheap ... [noise]\nForties overnight friday partly cloudy with a higher the for sixty sixty seven right now it eighty five GPS lessons [noise]\n\nPut on NPR WVU are I'm Robyn Young I'm Jeremy ... it's here and now treasury secretary Steven Mnuchin said today that after meeting with President Trump and secretary of state Mike Pompeo he will not be participating in the Saturday investment conference next week in Riyadh\nHis announcement on Twitter comes after ... face pressure to withdraw from the event\nSeveral high profile business leaders have already canceled their plans to attend me Well Secretary Pompeo told reporters today that he has had vice president Trump\nTo wait a few more days to decide what to do about Saudi Arabia and a lot of the country to continue its investigation into what happened to journalists Jamal 'cause showed gee who disappeared from the consulate in Istanbul earlier this month\nThere are lots of stories out there about what has happened\nJust going to allow the process to before\nFacts to unfold many believe the facts have already unfolded and they don't look good for Saudi Arabia and its crown prince Mohammed bin Salman joining us now is Bernard Haykel professor of Near Eastern studies at Princeton University welcome back to your uh no\nThank you to be here German and you knew Jamal ... G A you've also met the crown prince of Saudi Arabia Mohammed bin sell them on uh what do you think happened\nHere I mean I I don't actually know what happened you know there are rumors flying around the Turks claimed that the Saudis killed him\nI'm chopped them up or the Saudis deny it I I I don't know I mean clearly something that happened to him it is possible that the Saudis were trying to uh abducted him than they have had a history of doing that with a people they considered to be dissidents and they definitely considered him out to be a dissidents\nOr you know it it may it may have been an abduction that went wrong or they may have actually wanted to kill him in and they're constantly which is a really bizarre thing and and stupid thing to do and criminal thing of course well what do you\nThink of the audio recordings that turkey has released a details of which claimed to give evidence that cut showed gee was killed was headed and killed in a very gruesome manner\n[noise] well I mean a couple of things first if the Turks\nTo give evidence that ... was killed was headed and killed in a very gruesome manner\n[noise] well I mean a couple of things first if the Turks have audio recordings then they probably had the consulate bugged which is problematic the second um\nYou know the Turks are not are geopolitical rivals with Saudi Arabia and they don't treat their journalists very well at all in fact there are thousands of them who are in prison\n\nSupport for CPB comes from you our listeners and room CBD in Rome international film festival returning November first through fourth last year's festival celebrated Burt Reynolds to record audience is this year's event\nFeatures screenings master classes and parties more at R. I. S. F. G. A. dot com TBB has been honored by the Georgia Associated Press media editor is winning the top award for radio the pacemaker award we were also honored for specialized reporting best anchor and best newscast ... stand with the facts\nThat Kavanaugh hearings and confirmation raised the question again how do we decide who to believe when a woman says she was sexually assaulted by someone she knows behind closed door\nAnd the man denies that\nThat's an issue universities have been dealing with on the next fresh air which happens to the next ... author of blurred lines sex power and consent on campus join us\nFor years this afternoon at three four five the previous laughter and GB news dot org\nFunding for here and now comes from the listeners of W. B. U. R. Boston and your NPR station and Geico offering motorcycle into RV insurance more information available on motorcycle and RV insurance at Geico dot com or one eight hundred nine four seven auto\nIt here and now please welcome Robin Young\n[noise]\nFilled out crowded releases we start off of foreign and loving it came to the\nOne person it gives me great pleasure to introduce to you Sally Field [noise]\n\nIs it came to the one person it gives me great pleasure to introduce to you Sally Field [noise]\n\nHe's tops the best service she barely cleared five feet and it almost Seventy two Seventy two so it's only slightly\nOlder I'm not kidding than the boy crazy surfer girl she played as a teen get ya\nOh you mean you can't go on\nA couple of years later there was the flying none have you ever had to fly down there before\nHow many of you fell in love with ... and the flying non because that could be us [noise] we knew before this book we knew how hard she was trying to make other people take her seriously and then we saw her do it in normal ray and all those other films how many watch\nThat [noise] yeah [noise] Sally Field\nPlayed Tom Hanks mother and Forrest Gump\nYou're gonna have to get out for you sail\nTo the bar a chocolate [noise]\nNever know you know and again\nJulia Roberts fears mom in Steel Magnolias\nMold on players getting you think\nShe was Burt Reynolds psychic and Smokey in the band and Hoover and in real life his deep love but in the book we learned he was controlling and disapproving\nMuch like the industry was she ... her way into Oscar winning rules the fears union activist and the ... the steadfast Depression era widow in places in the heart\nI let that happen I don't care what kills me I'm not going to get up\nOkay a moment on that Oscar winning role because a handful of people may only know Sally Field because of her you really liked me acceptance speech first that's not what she said and she says no which he was trying to say was that maybe with two Oscar she finally put the flying none and what she called her an orthodox career behind her\nAnd I want to do anything to have you respect it didn't feel it and I think you can be [laughter] [noise]\nNow after Robert Duvall handed her that officer and this is\nReally weird because he was then my sister's husband and we were there you are\nYes and you came up this day and you stepped into the elevator and we were the only ones in the elevator and use it\nWas then my sister's husband and we were there you are\nYes and you came off the stage and you stepped into the elevator and we were the only ones in the elevator and you said how did I Do\n[noise] and we said you were magnificent well there you go [laughter]\nBasically I was saying right now my work worked that was the first year they were doing the red light and it was washing my face so it was an eloquent but it was what I felt you know [laughter]\nWell um it's not even in this book because there's so much else it's a story of a childhood in California your mother of beautiful women um your dad came home from the war they divorced and enter\nSecond husband your stepfather a a charismatic force of nature stunt man who\nWent on to abuse you as a child and it's a stunning revelation why\nHow did you come to write about this [noise] well so\nMy ... my mother passed away on my sixty fifth birthday\nI thought I had done all the right things you know I had the conversations and we'd had moments together of feeling that every thing that might have been bad was gone\nBut when she was gone I felt so deeply disquiet it something growing on me like there was a ... of wounds festering and I didn't know where it was and I didn't know how to find it\nThen a friend asked Sallie issues going to attend a noted women's conference she was and she said well that's really good because I Want you to give the keynote address [noise]\nI said I Can't I Can't possibly do that I Can't I Can't give the keynote address I ... I ... I Can't I have nothing to say and she said yes\nYou do\nAnd I thought [noise]\nOh yes I Do\nAnd it took me seven years you take us into how this could happen\nYour stepfather was sexually abusing you and nobody knew and into what you describe as your dislocation sort of is you're separating yourself from that then there's of an odd dislocation for the rest of your life\nUm there's a saying that what's fired together is wired together so that when my stepfather came in and picked me up and held me and he was big and bold and loud and I was tired\nTogether so that when my stepfather came in and picked me up and held me and he was big and bold and loud and I was tiny\nAnd shy and frightened and and I wanted my mother to take me into her arms and put me safely on her hip but I could sense she wanted me to show that I was happy in his arms because she needed him to be pleased\nAnd and I was being seen I was being held and seemingly adored I this must be loves\nAnd yet I'm terrified so early on in my life for those two things got wider together love\nAnd terror understanding them mechanisms that I used to survive I'm and how they served me for so long in my early career they serve me but I had to leave them so that I could then\nTry at Seventy two to leave them behind ... you\nHad a boyfriend Steve who became the first husband who helps uh a dysfunctional family function you became pregnant ended up in Mexico and it sounded like I have and again that felt like a dislocation like this ... this isn't ... this can't be happening and six weeks later\nYou're ... I was in pieces when things would happen at seven and eight and nine and ten that were just too much for me to handle I learned to send myself out of the room that terror was not there and the sadness was not there\nThe rage was not there and the part of me that was the taskmaster could stay and do the tasks that were required and as I started my early career I was still able to send out the parts of me that were overwhelmed luckily [noise] when I was twelve years old\nI found a stage I went to a public school and the San Fernando valley and they had a theater arts department and I did my first scene when I was twelve years old and they have\nSomething cleared bell rang everything was quiet\nI could hear myself something that happens out when you're really in a craft\nAnd you're not in your body anymore so that wouldn't hand in hand with coming out of being in the kind of traumatic childhood place that I was in but it was the acting thing comes civil the TV show\nAnd being out of being in the kind of traumatic childhood place that I was in but it was acting thing comes civil\nThe TV show based on a true story of a young woman with multiple personalities\n\nCivil war you\nCan do anything I can do anything I wouldn't [laughter]\nCourse or sin nominally talented but of course you're going to be able to play that person because you've divided so much of yourself up\nI didn't ... I knew I knew her and I didn't connect with how deeply civil and I belong together and yet I knew so well how she glided from one character to the other but it took me till so recently to go\nOh oh\nOh I see you mean civil and I had very similar survival mechanisms that are doing that being in her shoes\nLocal authorities and you're listening to hearing them\nSupport for G. P. B. comes from our monthly sustain years if you're already a G. P. D. sustain or thank you you're reliable monthly donations provide a steady stream of support for the programs you enjoy an GDP not as a stain or yet\nDoes it GDP dot org and become one right now you're secure ongoing gas to five or ten dollars a month will feel great and it'll keep GBDs strong for you and your community that's G. P. B. dot org and thanks\nG. P. B. has reporters all around Georgia to bring you the latest updates on stories that that are to you for the News I'm Stephen Fowler an Atlanta ... and so the people and making on ... when I was like well\nParticularly the News I'm Cindy hill and savannah Andre Dawson in Augusta I ... to get your local news story and all things considered later today from four to seven here an idiot\nCindy hill in Savannah I'm Rudolph them in a God I'm Ricky ... to get your local news during all things considered later today from four to seven here an eighty eight point five TPP Atlanta [noise]\n\nFunding for here and now comes from the listeners have W. B. U. R. Boston and your NPR station from staples with printed marketing solutions for business including color copies and presentations booklets manuals signage and banners more at staples stores or staples dot com staples\nAnd sin gauge working to make higher education more affordable with us engage unlimited subscription students can access over twenty two thousand each textbooks online homework access codes and study God's sin gauge unlimited C. E. N. G. A. G. E. dot com\nIt's here and now in Nineteen Ninety to ... and went into orbit on the space shuttle endeavor and became the first African American woman to go into space\nNow twenty five years later ... has her eyes on the sky once again today she is launching a new initiative called look up for one day to day generous and wants people to upload photos of this guy and record their reactions to what they see they jealous and joins us now to talk about a welcome to hear now thank you\nSo you're asking people to download this app sky fee and upload photos tax videos audio recordings of themselves experiencing a the night sky what are you hoping that will do\nWhat we're asking them to share what happens when they look up at the sky daytime nighttime for twenty four hours around the globe\nYou know just the simple act of connecting through looking up going outside looking up will help us to understand maybe a little bit more about each other to fill just a tiny bit more connected around the planet\nSo you know some people will look up the sky and they will fill love they'll fill whole fails fill some people may feel afraid they may still wonder are expensive\nAnd how they express that is what we want to capture\nAnd we want to have a shared with people in real time so it's not just you're going to\nTake these photos and you've got to put them up but we're going to display them to the world in real time on a digital globe that people can spin and they can look at they can expand they can go to different folks around the world so I can no in\nHouston, Texas what someone is thinking in New Zealand [noise]\nThey could go to different folks around the world so I can do\nIn Houston, Texas what someone is thinking in New Zealand\nSo I I have to say I love looking up at the night sky and in fact in the last couple of Marjah sky periods yeah a nice guy in a nice guy well but but in the sky period and and in the last couple of months we've been able to see for planets uh every single night to Mars Saturn Jupiter and I'm Venus\nAnd I've I've taken great pride in telling people about that but the other feeling that I often have when I look up because I live in a city is disappointment that I can see more because of there's the light pollution\nI guess the thing is what do you see\nAnd and I and really it's the idea of for one day why don't we stop looking down\nBecause so many times when we walk around the world we're not looking out we're not connected we're looking down at our mobile devices were looking down at our feet\nLet's start looking up and be more expensive if we're in a city and we have light pollution at night we're still seeing something we're still seeing the buildings were say what people are we're even seeing our impact\nOn this planet and so we want to know what you what that makes you feel you know what we're trying to do and I know a because I'm an astronaut people said we're always talking about stars but it's really about our planet when I was up in space\nI saw the earth when it was day and I saw the earth when it was night and each time there's this then shimmering layer of light that ... is our atmosphere is this planet that warms us in cools us an envelop says with all we need\nWhat we have to do is recognize that our home is on this planet and that while we are connected to the greater universe which I very much felt I felt like I Belong to this universe I also belong to this planet\nAnd we have to figure out how to share it we have to figure out that we're earthlings\nWill so it sounds like the words you're not using here but you're implying is you want people to pay attention to climate change\n[noise] well I Want people to pay attention to climate change pollution but to war because here's the thing\nToday we had these incredible technologies to address so many problems we have so much knowledge that we don't use them\nAt least effectively because I don't think that we really see ourselves as connected that we really don't see that what I Do in my country in my backyard has any impact on this planet so yes\nCells is connected that we really don't see that what I Do\nIn my country in my backyard has any impact on this planet so yes climate change but also a huge amount of plastic right the size of the state of Texas in the Indian Ocean that fact that we have enough energy\nAnd we grow enough food to feed everyone on this planet yet we waste it and at the same time whenever there's a hurricane when there's a disaster we really care about each other but that carried only happens\nWhen we're come face to face that I can see someone simultaneously on the other side of the earth and so we want to do this in a fashion where people have an opportunity to look up to this guy something that's common to all of us look up and just say what do you feel when that happened\nI think a lot of a human about astronauts like you and think that you have a different view of space because you've been there but what I'm getting from you now as you also have a ... view of earth it's only a handful of people have [noise] I actually\nHave a view of earth that I think we all can have that view of earth is what happened when I was a little kid when I used to look up\nAnd and imagine that some child on the other side of the earth was looking at the same thing I was looking at and I wonder what this was like and so it felt really really comfortable it felt really good to me to know that we were connected that way\nWe were calling the ads that we had that is completely free we're calling it a sky feet at right at the sky selfie [laughter] and that sort of like our connection between the sky you know humanity and the universe all in one\nOkay well we have you and and again people can go to our website here no doubt Oregon learn more about what what you want them to do in terms of this app sky fee but I just want to ask you a couple of questions that we have you because you were in space you're the principle of the one hundred years starship project which seeks to enable interstellar human space flight by Twenty one twelve\nDo you think that we're going to need to leave the earth and the next hundred years\nSo let's I Want to hear your\nStarship is about making sure that capability for human interstellar flight exist within a hundred years and it's really about radical innovation pushing our knowledge pushing the uh the technologies and our capabilities in terms of energy in terms of uh\nAbout radical innovation pushing our knowledge pushing the uh the technologies and our capabilities in terms of energy in terms of of a governor is in terms of\nHuman biology and health and using something that's really difficult like interstellar flight to do it but here's the thing we will not if we don't figure out how to live on this planet\nWe can forget about anything and even if we're able to get five hundred people on Mars what five hundred people are we going to send right who gets to decide\nI Would rather us understand and make sure that we're keeping this planet welding counting on a plan B now what's fascinating and what's incredible about space exploration is it is really change fundamentally how we see ourselves we know so much more about our planet\nThrough being able to look back down at our planet from satellites we know more about the earth because we've been able to study Venus we've been able to study Mars and understand how planets form and what could happen to them at the same time the balance that we have\nIs taking that knowledge that we live on a planet we live on our own space ship\nAnd the only thing that's happening is we have to figure out as a crew how to live together that means that we do foul our planet through\nPollution but we only do that if I understand that what I Do changes what happened so that people that we understand that we have to live on this planet in our behavior makes a difference [noise]\nThird now are a number or a small number but a number of African American women who've gone into space\nBut you'll always be the first ... what does that mean to you [noise]\nSo it it was really interesting to me because not only was the first African American woman but I was the first woman of color in the entire world to go up into space and it's a little girl growing up on the Southside of Chicago there is no way that I Would have imagined than by the time I got old enough to go into space that I Would be the first anything\nArtist Richard Hans ... this afternoon it to ...\nAnd coming up on here and now in about ten minutes we took a closer look at the financial ties between the United states and Saudi Arabia as the Trump Administration considers it\nComing up on here and now in about ten minutes we took a closer look at the financial ties between the United states and Saudi Arabia as the Trump Administration considers its response to a possible murder of democracy ... was coming up in ten minutes here in our view point five gp be left to\nSupport for CPB comes from you our listeners and Georgia State university G. P. B. Atlanta is license to Georgia State university ranked among the top universities in the nation and commitment to undergraduate teaching more information is available at G. S. U. dot edu and Atlanta Airport district presenting the spin the district Union City grand\nFun do bike ride this Sunday cyclists can ride from ten to one hundred mile options and stay after for live music for more info visits spin the district dot com [noise]\nFrom the University of Georgia is Ninety seven F. L. W. W. W. W. H. G. Carroll of Georgia Public broadcasting radio network\n\nI'm from that weren't the creators of Matt lab and simulate software accelerating the pace of engineering and science you learn more and men were not come\nFrom NPR and W. B. U. R. Boston I'm young I'm near me here now [noise]\nComing up the economic ties between Saudi Arabia and the United states as the Trump Administration waste is options regarding the disappearance of democracy ... also hurricane Mike of impact and our inland from the coast towns that were destroyed places like Marianna\nDamages it it just all the scale is Dale almost every country has been affected shipped off halfway up people coming back so they don't and\nIs it the cabinet effect in Tennessee Senate race the Republican Marsha Blackburn increases her lead over Democrat feel better than these stories and [noise]\nCorrine in Egypt coming out here in\nHis first\nLive from NPR News in Washington I'm Lakshmi Singh secretary of state Mike Pompeo says the U.S will give us Saudi some time to explain what happened\nTo Washington Post columnist your mouth show Jay and bears Mara Liasson has this update ... met with the president at the White House and told her about his meetings with Turkish and Saudi officials\nPompeo said the U.S takes this very seriously and expects the Saudis investigation of themselves to be completed in quote a timely fashion but ... also stress\nSaid the U.S takes this very seriously and expects the Saudis investigation of themselves to be completed in quote a timely fashion but ... also stressed that Saudi Arabia was an important ally and suggested that there might be no consequences at all\nWe ought to give him a few more days\nTo wait understanding of ... which one we can make decisions about how the United states should respond\nTo show jeeze family is calling for an independent investigation and there's mounting evidence that the men involved in ... alleged murder and dismembered meant we're close to the Saudi crown prince Mara Liasson NPR News the White House and there's even\nA ... struggles to deal with a fall out of Saudi Arabia suspected rolling cause show Gees disappearance treasury secretary Steven Mnuchin is tweeting that he will skip the upcoming future investment initiative summit being held in Saudi Arabia [noise]\nThree Americans were wounded by an attack in Kandahar Afghanistan three top provincial officials were killed by their own guards\nThe Taliban claimed to be behind the attack and his spokesman tells the Associated Press us general Scott Miller commander of us and NATO troops in Afghanistan was the target however Miller says Afghan officials were the targets Miller was not injured\nDestructive flooding on the Texas law now and Colorado rivers has been making its way downstream for days flooding homes taking out a bridge on its way to Austin\nA member station ... reports authorities say they may need to open more floodgates than ever before at a damn above the city\nAnd the last week the reservoir above Austin has captured more floodwater than the city consumes in four years it's getting close to capacity and the group that manager that say they may need to release more water downstream in the coming days Phil Wilson is general manager of the lower Colorado River authority\nLiving large amounts of water to every precaution protects her safety\nWell authorities in Austin itself expect mostly flooding of streets in Parkland communities downstream could see more severe impacts Texas Governor Greg Abbott has already announced a disaster declaration for counties affected by the flooding for NPR News I'm mostly show in Austin\nOh major market indices Oregon down sharply one percent to one point six percent this is some industrial companies report disappointing third quarter profits that as down to eighty five one point one percent as some peas down one point one NASDAQ down one\nAnd this is an industrial companies report disappointing third quarter profits as down to eighty five one point one percent asked and pay down one point one now that gang one point\nSix [noise] this is NPR News\n[noise] live from the GPS newsroom good afternoon I'm drew Dawson just ahead on here and now talk to facilitate a smooth Brexit have faltered once again we'll take a look at where the u._k. and the ... you go from here\nBut first in GB news Georgia's ports saw double digit growth in September ... port handles twelve percent more container units that an August\nIn Brunswick report handled over thirty seven percent more cars trucks that heavy equipment the amount of cargo moved by rail lines was also up last month by thirty five percent [noise]\nKmart is closing its last to Georgia stores company is owned by Sears Holdings which filed for bankruptcy this week locations and peach tree and Covington are among the one hundred forty two K. Mart and Sears stores that will be shut down by the end of the year liquidation sales at both stores are expected to begin soon\nAnd savannah State University could soon layoff faculty members and employees savannah morning news reports the possible layoffs would help address falling revenue due to declines and enrollment officials declined to say when layoffs could start with departments they would affect or how much money might save\nThat it's the layoffs are being considered by the state leaders are also working with the state board of regents to form a committee that will make recommendations on how best to use the school's resources\nAnd sports the Atlanta Hawks last season opener to the New York Knicks by a school one twenty six to one of those seven Atlanta will travel to Memphis for friday night game against the grizzlies team makes its home debut at the newly renovated State Farm arena next Wednesday\nFor more Georgia news please go to Jean PBA news dot org and follow us on Facebook and on Twitter where at gp be news\n[noise]\nSupport for NPR comes from ... am committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day and nine hundred franchise locations Matt ... dot com slash NPR [noise]\nYou're eighty eight point five GPA Atlanta weather forecast partly sunny and in the upper sixties today partly cloudy tonight lows drop to the upper forties friday partly cloudy with a hide your Seventy sixty eight right now are they do point five ...\nYou're Seventy sixty eight right now they do point five ...\n...\nKhan NPR WB like I'm Out in young I'm Jeremy ... it's here and now secretary of state Mike Pompeo said this morning that he wants to give the Saudis more time to finish investigating the disappearance of Saudi journalist Jamal ... before the United states decides how to respond\nTo get support for us all to remember too that we have a long suicide teen thirty two ... along strategic relationship\nWith the kingdom of Saudi Arabia\nContinue to be important counterterrorism partner\nCustody of the two holy sites\nThere and important strategic\nAlliance of the United states that we need to be mindful of that as well\nThe United states also has important economic ties to Saudi Arabia and joining us to talk about that as far as that host of the podcast full disclosure harming let's start with oil how much oil does the U.S import from Saudi Arabia\nMarkets about Thirteen million dollars of imported Saudi oil and that's a film about four percent of the dollar amount consumed it's actually not that much when you consider all of the developments in the U.S shale patch this game has completely changed over ten years\nAnd what about us government bonds we've been hearing in recent days that the Saudis own a lot there one of the biggest foreign buyers of us treasuries\nYeah look it was last clocked at a hundred and sixty five billion dollars of US government debt this summer which sounds like a lot but then you look at the likes of China and Japan which have more than a trillion dollars each\nFees are the two biggest foreign holders of U.S government's securities they could if they wanted to kind of pulled us hostage on that but it cuts both ways the Saudis\nThey really can't do it a oil shipments our dollar denominated for the most part they need a stable dollar they are very threatened by too strong a dollar so it's a situation where you really have to put it in perspective\nAnother important part of the relationship that has come up is arms or the president of the United states has mentioned that the Saudis by billions of dollars of arms from the U.S he says a hundred and ten billion that number is disputed but then we heard this\nFrom a a fan of President Trump's evangelist Pat Robertson who spoke earlier this week on the seven hundred club\nAn arm or staying with everybody or pay so there's like one of the honor lining\nThe angel is Pat Robertson who spoke earlier this week on the seven hundred club\nWe have an arm of the everybody on a piece of this like one of the hunter lining their dollars is huge and they don't allow them jobs and I don't think a lot of money coming to our coffers and or something you don't want to blow up William LA\nYou're listening to run down [noise]\nSupport for G. P. B. comes from our monthly sustain or send eagle eye books located in Decatur an independent bookstore for readers of all ages featuring new and used titles and knowledgeable staff to guide any search online or in person more an eagle eye books dot com a great guy\nFor good books and Georgia southern with nationally credited academic programs to prepare diverse scholars for leadership in service\nStudents looking for graduate and doctoral degree programs can see for themselves at Georgia southern dot edu slash graduate\nAnd fresh air you'll hear from people who really make you think like astrophysicist Brian Greene explaining a scientific theory that our universe\nIs just one of many and the image that I like to have in mind is imagine that our universe is like one slice of bread and a much grander cosmic loaf with the other slices of bread being other universes\nSubject is too big for fresh air China Russia here's this afternoon at three four five genes which laughter and she'd be news dot org\n\nFunding for here and now comes from WVU are Boston and carbon night offering secure data protection solutions for growing businesses including automatic back up for servers and computers I availability and disaster recovery solutions and automated data migration learn more carbon I dot com\nHere and now a week after hurricane Michael hit parts of north Florida are still reeling as you note out now the death toll has been rising power could be out for weeks and we're learning how far inland the storm reached some of the Tadic\nRunny and Jason is emergency management director in Jackson County Florida he's in Mariana where there was three deaths and Rodney or you're an hour north inland\nAnd is emergency management director in Jackson County Florida he's in Mariana where there was three deaths and ... a year in our north inland from the Gulf Coast what happened where you are\nRight we took a direct hit the when it hit us it was ... had a cat threes low cat for which is somewhat unusual for inland hurricanes but this is becoming the norm\nHold a lot of places and people will realize that they stole it does affect people that deep inland and when you've got a storm of this magnitude in the movie as fast as it did it held together a lot better and that's why we got such an impact\nWell and the impact included you do I understand your home was hit\nYes it was it was a heavily damaged and pretty much it it is destroyed the the structure stood the house basically over pressurized and blue part on my roof off and we're hoping to get some some adjusted today\nYeah well I'm Sorry to hear about that but we know you're you're in good company they're just give us some nail of what Mariana looks and feels like\nIt does look like I have a I spent Twenty one years in the military and if it's the damage as it is just off the scales bad and buildings down almost every tree has been affected snapped off halfway up and it's a landscape I've never seen people coming back that used to live here and come back so they don't even recognize it down\nOne of the county appraiser Carlin he can't tell the Tampa Bay to be in that she guessing that Ninety percent Ninety percent of the homes and businesses in the whole county ... county where again and she's using tax rules an aerial pictures that you sent\nA sense that we ... we had a\nGo out and take a look and they gave us estimation that approximately five hundred and eighty two structures that they were able to look at or severely damaged four hundred plush are completely destroyed she looking at a thousand structures have been just damaged or destroyed\nOr with Gulf Power spokesperson said this isn't to restore that had to rebuild the entire electrical grid and we understand is a patchwork of city and a cooperative utilities\nAnd an actor big storms in two thousand five and six utilities were told to do more to be turning improve the power lines me you know maybe I'm put some of them underground to prepare for these storms do you think there was a failure to do that or do you think anything could has been done\nRight I can say personally and professionally that the power companies did everything they could do I can tell you\nAnything could has been done\nRight I can say personally and professionally that the power companies did everything they could do\nI can tell you own a critically they do an unbelievably awesome and difficult job and they have had very aggressive programs to bring back those trees to upgrade the grid\nAnd I see people putting power lines underground and yes that is is a good idea but it also causes his own unique issues when you do that but I Know the power companies have been I mean I can tell you have done it absolutely awesome job upgrading thing\nOh what are some of these is because I I think we heard in one report that the rising is out in one area but it's because they're underground cables were affected\nAnd this happened because people don't realize fiber does ruin the twin towers and our biggest problem with that was that the towers stood the cables stood it's just they were so much to breed though they could not get back to ensure the propane tanks refill for the generator so the generators stopped until they were not transmitting\nNot you've got the personal here but also the professional what do you think should happen a measure to improve communications among the utility companies and another to find a study on storm response failed in the state legislature twenty Seventeen\nDo you think the state needs to get back to you know some form of high level a emergency convening on what to do going forward\nOr looking at an infrastructure in this country that is fifty some of it's a hundred years old we need to take a very hard and fast look at all are critical infrastructure issue we've got to do to fix it\nLike asking Romney just briefly um does there have to be more of an acknowledgement that that something is happening because of climate change\n[noise] I don't know if it's so much climate change as it is is just a natural process that occurs over the years\nYou don't think this is I mean you're looking at an hour inland from the coast riot town wiped out and you know every scientist worth their mental thing that uh this is a direct result of warming waters\nAnd I'm sure there might be some issues with that but I'll be honest with me at my level is not a question of climate change is a question of changing the climate of people getting ready for these things and I can almost guarantee this will change the climate of my community and the attitude of those in this area\nWell around me and he's there in Jackson County in Mariana Florida we wish you the best\nCase thank you very much\nParts of the country are lucky enough to be in Paris\nWell parts of the country are lucky enough to be in Paris season so we want to take a closer look with here now residents chef ... who's in the studio Hi Hi Robyn you don't have to say I'm One of those people I Love pears I think they are an art form I have ... cookbooks pictures of pairs\nAll I Do use them and salads we blue cheese okay well your whole pair world this is about to get blown out of the car and say so I ... okay well the most common one that we see in\nGrocery stores is that on Jew or mans you um there is a red and you and then there's also a bright green one which is kind of an egg shape\nThey tend to be soft juicy they're great raw but they hold up the poaching and baking as well and you're going to find as I describe these that\nIt's incredibly versatile fruit most all of them can be cooked as well as eaten raw and they are so what if not completely interchangeable how dark brown ones that seem to have a tougher skinned\nOkay so that's called an Asian pair and I went up for you right there they are very crunchy very tart\nSweet also these are best eaten raw Timmy and Asian pair tastes like\nA pair and meeting with a water chestnut ... it's got that wonderful crunch and a little bit of juicing is and\nWonderful and salads wonderful graded also Bartlett another very common variety and very sweet red and green as well they are Chris ... they are wonderful texture for poaching what I Love about them is they retain their shape when you cook them\nThere's also boss pairs same deal very earthy flavor and ... parents have any long gated neck which is really fun because when you poach them it has this elegant long to talk about the poached because we have one of ... we did it so hard\nI'm really glad you said that because I\nAm going to absolutely show you how wrong you are okay All right here's what I did your reading I peeled the pair but I kept the stem on yeah okay I peeled it have you with me is Nick and Nick it and I took a couple of sugar ... and a couple of white wine and two cups of water and I boil them\nI could add a cinnamon stick I could add some fresh ginger to that\nI let it cook down that's called the simple syrup mhm\nThe water and I boil them I could add a cinnamon stick I could add some fresh ginger to that I let it cook down that's called the simple syrup mhm I place my naked as you call them pairs into the syrup\nAnd I let them cook for about twenty five to thirty minutes and what happens is the parent releases its juice into the syrup\nAnd the pair than cooks in this week delicious ginger syrup it can be made well ahead of time it keeps in syrup you can eat that for breakfast and you could eat that as part of a salad\nBut you certainly could serve that for dessert you don't need whipped cream it's healthy it's light and I think it's so refreshing\nRight now the other thing about Paris is that they swing both ways they're savory and they're also clearly sweet [laughter] so I made a savory salad that's a little bit different than a normal\nPear salad I took 'em in this case I Believe I use a Bartlett pair my peel did I put a tiny bit of olive oil salt and pepper on it and I roasted it in little wedges\nYou're listening to here and now [noise]\nSupport for ... comes from you our listeners and the Atlanta upper representing west side story Bernstein's classic Broadway musical of love trying to conquer differences November third six nine and eleven at the ... energy center tickets at Atlanta Opera dot O. R. G.\nAnd Atlanta Airport district presenting the spin the district Union City grand fondue bike ride this Sunday cyclists can ride from ten to one hundred mile options and stay after for live music for more in both as it's been the district dot com [noise]\nGeorgia has long been known for shipping and fishing ... testing ground for farming defining\nThe industry itself is quite small and it's why folks are so excited about a waste or farming agriculture coming because it will effectively double the amount of money they can make\nOyster when driving jargon only to industry an artist Richard times on second thought this afternoon at ... ...\nOyster when driving jargon only to industry an artist Richard Hi upon second time this afternoon it killed ... keep eating in\n\nFunding for here and now comes from the listeners of WB you are Boston and your NPR station from staples with printed marketing solutions for business including color copies and presentations booklets in manuals signage and banners more at staples stores or staples dot com staples\nAnd home advisor matching homeowners was home improvement professionals for a variety of home projects from minor repairs to major ... models homeowners can read reviews of local pros and book appointments online at home advisor dot com\nIt's if you're in now and some classical music fans have been marking be two hundred and Seventy fifth anniversary this year of the birth of the Italian cellist and composer Luigi ... maybe not a household name but some think it should be and that's where we turn for this week's DJ session a ba Corrine edition [noise]\n... is host of classic morning some W. I. L. L. in Urbana, Illinois Dick welcome back\nJeremy it's great to be back thank you and you wanted us to start with the menu at from the string quintet in eat major this is played by the Smithsonian Chamber Players\nVery familiar to notice was actually made famous by the Nineteen fifty five movie the lady killers about a group of fees that rent an apartment from a widow in London and they say they're a string quartet that just want to use the room to practice or this is a song that they play\nFees that rent an apartment from a widow in London and they say they're a string quartet that just want to use the room to practice or this is a song that they play I've heard this in a lot of movies sense that tell us about it [noise]\nIf anybody has ever said they haven't heard anything of Luigi ... because we have in the day for his peace and in our time it became famous in the Nineteen fifties in that film but I understand that in the late Nineteen century\nThey were arrangements that were made this piece went viral and it's time you could say there were range means for\nMandel listens for piano for saxophone for ... choir with Latin text added so this piece has been popular\nWill before Nineteen fifty five and a fun thing about the lady killers and to use in the film and this is a word that's written for a string quartet violins viola\nShallow was an additional cello and now there's a joke about the film it's either an error in the film or it's an additional joking that these crooks pose as a string quintet was an additional viola\nAnd not with a cello somebody should have been on to this young guys are walking around without a second child is\nYou know the other film that it's in one of my favorites is terrorists dealers day off this is what they play when they go into the fancy restaurant in Chicago and try to get in\nWhere they're not supposed to be but it's it's been in a lot or I Want to listen to actually to another version of the same piece this is the saint Paul chamber orchestra with Bobby McFerrin conducting an on vocals [noise]\n\nYou know when I said Bobby McFerrin on ... I was waiting to find out what that meant exactly but there you have it that he's not singing necessarily but he is a humming along to the to the to\nBobby McFerrin just being Bobby ... and I think it's a fascinating arrangements for our time if you like this piece you should know that Luigi ... wrote over a hundred\nI think it's a fascinating arrangement of the for our time if you like this piece you should know that Luigi ... wrote over a hundred stream quintet this is one simple minuet from one in ... so there's a lot more there to explore he was writing these for\nThe younger brother of the Spanish king\nDome release and a while he was doing it he was writing string quartets\nRoyalty and playing the additional cello himself so he was doing this so that he could play along with them and then he would also writes\nStream queen tests for depression king who was a cellist so he had a lot of opportunities to write to string queen tests and string quartets in addition to other cheaper music what\nDo we know about what influence ... who influenced him\nWhen he was a cellist early on he learned the cello he also learn singing his father was a double bass player he and his father were playing and orchestras and he realized that he couldn't\nMake a living just by being a cello virtuoso that you had to compose music so he began to compose music\nAnd he ends up getting very wealthy patrons who demand a certain kind of music and that seemed to influence his writing chamber music rather than say a president at the time\nWell let's get to another uh for ... and this is the cello concerto in gene major performed by the Canadian ... orchestra and honor bills ... on\nI was ... or something\nYou have to admire this it's it's a lot of playing\nI was ... or something\nYou have to monitor this it's it's a lot of playing and then they can sure does there's a lot of virtual caustic writing as well and I think those two things sort of defined bulk Corrine in many ways that he was a virtuoso and wrote parts for a short list in his country or does and he's also known for\nHaving the gifted in writing melodies kind of wonder if he if he would've ever written more than a couple of operas that he wrote late in his life whether he would have been going on for\nHere we get both sides of them in a in a cello concerto is\nOkay now to one of his company's this is the symphony number three in gene major played by the London Mozart players [noise]\n\nThat I hear they're it's a this was obviously recorded in a big hole which I Love that you can tell that by listening there but what do you hear that tells you something is a book or in a peace\nYou can hear again from melody and he's writing this instance heightened was writing symphony is at the time it's been suggested that book arena was sued detail oriented that maybe he didn't have\nAn ear for the architecture of a full ... funny it's funny there is a", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Carrollton", "day": "18"}