{"month": "10", "state": "NY", "station": "WAMC", "content": "Support comes from across the valley YMCA Catskill Mountains sucking retreat century unions that two locations named camp and east valley ranch a smaller private option outdoor activities lodging and meals\nFor us the valley dot org and found that the kids the public library district kicking off the and eat a big read this weekend with scholars Scott wound up Williams College\nAnd that the ... up Clark University P. O. K. L. I. B. data work\nThis is Northeast Public radio WAMC F. M. H. D. Ninety three Albany W. R. U. N. H. D. Ninety points reruns from Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. S. R. H. D. in any one point seven Middletown to UCLA HD Ninety One point nine Plattsburgh WC A. N. H. D. Ninety three point three ... three nine tie kind of robots\nW am cue HD won all five one great Barrington WWE ... point nine mount Kisco W ... any point one Stanford W and our eighty eight point five Brewster WAMC am fourteen hundred Albany\nWhen she's not busy filming her latest TV series Martha ... find that singling across Sydney harbor and their grandfathers wouldn't vote is one of her favorite things to do\nIt and I stick with the voice of listening and they all perhaps which I think is one of the beautiful buildings in the world [noise]\nAnd then he fell onto the hop a bridge and then you can go all the way back out to the head\n[noise] coming up the star of a place to call home tells us what she loves best about her home in Australia [noise]\nA jet pilot explains the strange feeling of play flag you might get when you land on another country\nOften you land and you walk out of a terminal and you're suddenly in this whole other world that was going on and wouldn't be going on if you haven't come there\nAnd friends from Germany explain their love of sausages ... sausage for breakfast for lunch or dinner\nAny time every time they all\nYou get an appetite for exploring the world in the hour ahead it's travel with Rick Steves [noise]\n\nHello this is channels kennel but the b._b._c. news Pope Francis house concerts sing to it on the ... Oscar Romero at a ceremony and the Vatican attended my tens of thousands of pilgrims [noise]\nThe settlement either all the roads built for staying with the ... when he was shot dead at the altar in Nineteen eighty and I'm going to speed on so his killers avoid justice\nStraightening support for WAMC comes from my dog harness dot com no joke no poll Doug hornets invented to make walks easier for both dogs and humans crafted in the ... thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog hornets dot com\nOr medal for decades gun down while giving mass the late ... bishop of San Salvador was an outspoken advocate for peace during the country's violence civil war\nDespised by some on the far right even to this day is a good reader in a Catholic he criticized by state forces on the left wing ... actions which affected the civilian population\nPope Francis has also canonized one of his predecessors bullets snakes who was appointed from Nineteen sixty three to Nineteen Seventy eight\nFrancis has praised him as a champion of social justice and the poor\nPolitics became the first globe trotting pope ... Catholics at a time when more liberal attitudes and youth coach and swept the west\nArchbishop Romero and a poll has been canonized alongside five other news sites [noise] Saudi Arabia stock market has fallen sharply image worries about the country's deteriorating relations with the international community you know the Arab affairs editor I'm an Johnston\nStole some the Saudi exchange tumbled in any trading losing four percent in the foot tower\nAnalysts say in that this fear that the two mile short gee if that will have economic consequences for the kingdom already some big names have pulled out of the major investment confident scheduled for later this month\nThe Saudis deny allegations that Mr I saw gee whiz method in that stumble country that President Trump said that if he was they'd be severe punishment but he doesn't say the whole thing Americans massive arms sales to the Saudis\nThe Russian opposition leader Alexei Navalny has been released after spending fifty days in jail for staging illegal protests as he left detention he said during his latest spelling prison he had seen evidence that as he put it the Russian regime was in decline ... nothing would still the opposition\nLet me make us if you just said he got very good decision for sure I think\nOver the fifty days of being in jail we have seen yet for evidence that this regime is incomplete decoration from failures in foreign intelligence to failures in space industry and if anyone thinks that's where the rest of which are unpleasant that can scare stuff or is that is clearly not the case\nWill news from the BBC officials in western Afghanistan say Seventeen members of the Afghan army have been killed by militants who attacked the base at least for soldiers were captured it's the latest in a series of attacks us Afghanistan from has the parliamentary elections next week\nThe largest of Germany's sixteen states area and he is holding a regional elections that could see the dominant Christian social union record its worst result for half a century\nThe ... Christian Democrats who do not compete individually at the national coalition pump the Social Democrats are also expected to fit badly smaller parties I'm likely to benefit\nPresident Hassan Rouhani has accused the United states so seeking regime change in Iran tensions of renewed between Washington and Tehran since President Trump withdrew from a multilateral deal to contain Iran's nuclear program Mr Bean honey was speaking on state television\nHave ... ... that go on to explain the final goal now they started with a psychological economic wars the medium term goal of ...\nStraightening support for WAMC comes from my dog hurt is dot com no joke no poll dog harness that did you make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog hornets dot com\n... through reducing legitimacy otherwise a regime change\nAn Australian family have used a ... to find unfair attack by kangaroo their home in the state of queens and\nThe answer to lift the sixty four year old woman was critical injuries wildlife care of so many years she and her husband had been feeding fishy kangaroo symbol at the age when one of the lunch males to first and her husband and then when the sun came to the rescue teaching them all soup deliver the head with a shovel\nThe woman said she loved animals but did not want the kangaroo to be hunted down and killed an isolationist BBC News [noise]\nThey've just wrapped up this year's October fest celebrations in Bavaria\nBut in Germany the love of a good sausage last all year [noise]\nI'm Rick ... coming up in the hour had friends from Berlin tell us white sausages might be on the menu anytime a day [noise] any time of year any place in Germany\nAnd we'll meet one of Australia's best loved actresses market death of DARPA it's also starting to win the hearts of the growing fan base in America is the lead character in an addictive drama series set in the post war years of Nineteen fifties Australia\nA place to call home depicts a time when people down under started to take a second look at themselves and what Australia was to become as a nation\nMartha shares with some of her favorite things about her home town of ... and I see get a ways she enjoys including places which still might look a lot like they did back in the Nineteen\nFifties that's in just a bit let's open today's travel with Rick Steves with a return visit from a pilot pilot who's written poetic leave about the ... of modern aviation mark than hunter's book is called sky faring and he joins us now for a view from the pilot's seat\nMark welcome back I'm happy to be here you have to be smart to fly seven forty seven\nWhen there's a pretty rigorous um [laughter] that's my process\nYou know it starts with a whole series of tests and of course we're we're tested on you know every six months for in a simulator this these amazing for motion simulators which are you know not much less expensive than an airplane in some cases and so there's definitely a a huge on training obviously there's qualifications which are required and\nAnd I don't think there are many professions that have that much a recurring ah examinations and training\nWhat's the most demanding thing for you intellectually about flying\nI was really amazed by this and called inertial navigation which is\nKind of what existed before GPS and in some ways it's cooler than ... cars GPS requires the ability to see you have a live fight to the satellites whereas inertial navigation just knows it doesn't need to look at anything that has these great term like transport rate and coaching and gravitational directors and earth frame and\nHarmonica expansions and it was pretty rigorous stuff but there's a certain poetry to those words of Allah and go out to be able to learn them\nOr their lounges where have you ever find yourself\nStraightening support for WAMC comes from my dog harness dot com I no joke no poll ... invented to make it easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to Todd walk your dog would love thousands of reviews at my dog harness dot com\nSupport comes from pioneer valley traveled Northampton, Massachusetts for over fifty years providing travel planning regardless of location for river and ocean cruises safari sent customized itineraries\nTo other righty of destination PVC pipe in I. N. C. dot com New York state AFL CIA oh with two and a half million members speaking with one voice\nHelping working families achieve a better life and my ass AFL CIO data work and from the nature conservancy Adirondack chapter working to preserve fresh water resources that flow from the Adirondacks to New York's urban centers nature dot org slash Adirondacks [noise]\n\n\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com onscreen\nShe also seems to be one of Australians busiest actors right now she's starting and three newly released TV drama series she plays the title role of high powered attorney and two seasons of Janet came and she has a leading role and the jak Irish detective shows\nBut starring in them have a drama series a place to call home is what's building her international following\nThe series is set in rural Australia in the volatile postwar Nineteen fifty episodes explore the Arabs evolving issues of national identity and prejudice [noise]\nMartin's character nurse Sarah Adams returns home to Australia from Europe after surviving the horrors of a Nazi prison camp [noise]\nWe caught up with Martin between filming Bates at the ABC Studios in Sydney to find out more about her role in my place to call home and also what she enjoys most about Australia today Martin welcome to travel with Rick Steves\nHi Rick thanks for having me\nWell congratulations on your success I understand a place to go home is a huge hit in Australia and now it's getting more and more of your time on public television in the United states\nTo lately it's got a huge fan base over in America has all sorts of\nFacebook pages and Twitter and ... and\nUm the fans have had a huge influence actually making the shy continue certainly in this country but I found out yesterday it sell it to a hundred and twenty countries around the world\nA place to call home and it it really gives us a look at the Nineteen fifties Australia you know we've in the United states were coming out for this a frenzy about Downton Abbey which takes us intimately into this fascinating world of English aristocracy a century ago\nYou're a series takes us to Australia and the and the age we think of as Eisenhower and leave it to beaver and that sort of a we have enough stole Jake simplistic look at the Nineteen fifties but sort of peeling back the layers to tell us about Australia in the Nineteen fifties\nWhether it was post war for us that's how we define it so there was a depression um people who are returning or not so that was a lot of loss a lot of shrapnel emotional shrapnel in people's psyche is\nA lot of them in a disappeared into the women had sort of taken on his ah found a better place for themselves in society and community in the workplace\nAnd it was a time of reconnecting to cultural identity I suppose there wasn't a lot of frivolous he and a celebration necessarily even though it\nWas a seeming success um because the last threat straddling suicide great\nSo the show starts with a woman returning from ... Adams having they no way from home for a long time and she had fought in the wall and they in a Holocaust survivor and that totally explained in the show as to how that could have possibly happen to her and she made that\nVery well to do family on the ship on the way back\nIn accidently fools madly in love with the um the son who\nWho of course it's not the right match and shouldn't half a day and so a war begins outside the war in the way in this family and this woman\nIt's really a look at where we'd Bain and how far we've come about what I Love about this show and back in late ... what he's done he's said as a melodrama anti talks about um the ... films so he's\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nDoes to the subjects that we haven't really explored on a straight in television necessarily before\nIt is interesting that we can look at these hard issues and we've got the same challenges in the United states and\nIt sort of disarmed us to go back to the fifties and and look at it and how how was dealt with in that time and then to sort of be haunted by the fact that we're still struggling with it today talk for a minute or two about the whole idea of the adjustment for a society where women all of a sudden are going to be more respected in and at the same time expect more\nIn the ... I had that sense when I saw you even when you were feeling from a Britain back to Australia after the war in the place to go home the sense was you were going to march right in there and this is a new age and women are going to be respected\nWell Australia had always been very family based women in the kitchen men out to work it really had been that way for a very very long time and as I say much demand left so the women had to fill those roles they were pushed out of the kitchen and into the workforce\nThe thing about Sarah she come we don't say Europe and surviving a robin's broke with where she was incarcerated for either three is she's in us by trade and had continued to ... to ban is in London\nAnd he's a woman who who really doesn't need to be the center of attention and yet her actions keep putting her in the spotlight because\nShe's selfless but she she marches for the greater good and so I really enjoyed playing that an ruffling all the fed is of course which are in the hats updates amazing costumes in the Nineteen fifties\nAnd there's a lot of fun to be had out of it too it sounds very depressing but actually there's a lot of joy in watching that happen as someone breaks down the wall so I just stay home rain\nAt a time when you can't pick up a ... or send a text you have to arrive and actually have a conversation which usually means a cup of tea and some and biscuits switch off one of our nation's greatest biscuits um\nMade from the dripping of them I send maple syrup back in the day so\nI mean certainly when I ...\nI can smell my grandmother and I can hear a voice and I can hear the radio and I remember that the left either of that time the kind of lost vestige of that\nAnd certainly it talked to a lot of it strengthens 'em and internationally as well it'd be like Downton Abbey because it is it's a full absorption in another place and it's like a different world\nUm it's like traveling when I travel to Japan and I go this is like being on another planet I Love it so much because it's so different and so completely off the and that's what they show really is\nAnd it's just beautifully written and delicious leaving domed and wonderful acting or do you think that a lot of us it's a hit in Australia in part because Australians are just ... about the fifties or does it a challenge them to see where they are today and and where they need to go\nI think by those things and I think actually what so unique about this show is that three generations sit down to watch it together and that old fashioned thing of sitting around the fire than sitting around the radio than sitting around the television\nHas been returned to families a lot of people talk about that how they all sit down together because everyone can watch it and everyone can relate to it there's there's three generations of\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nOr help them visualize this reality and it also artfully deals with a lot of the dark side of a sort of a sweeps superficial world that really need to be dealt with thoughtfully\nAbsolutely absolutely\nThis is travel with Rick Steves we're talking with mark to the full ... she's pretty sure Adam's in the place to go home begin in Australia and it's come to the United states on public television and you can watch screaming on corn media phone number is eight seven seven three three three seven four to five\nAnd ... calling from Atlanta in Georgia said thanks for your call thank you do you have a comment or a thought about them a place to go home or Australia in the fifties for murder\nFirst I Want to say how much my family is enjoying hurting you want a performance in a place to call home it it is one of our favorites and I'm as a southern uh American uh in in the southeastern part of of our country\nI Can't help but be struck by how beautiful the country is and how the the rolling hills or ... are are part of the landscape and and certainly part of the enjoyment one has seen these actors um\nI'm also just as a southerner interested in Martha's reaction to how an American traveler to Australia should engage in the aboriginal history which is so so much a foundation of the country\nDo it all you have to do is go to W. A. M. C. dot O. R. G. and put something anything in\nSupport comes from Williams College museum of art presenting case agent serene surreal is a re creation of stages Nineteen fifty an audio exhibition on view through January second to two thousand Nineteen wick much doubt Williams dot edu\nThey tend to annual Woodstock invitation ... showcase handmade acoustic guitars and string instruments concerts clinics and more October twenty six\nThrough the twenty eighth at the bears do theater and utopia sound stage Woodstock invitational dot com\nAnd from the center for natural wellness school of massage therapy now in rolling for spring two thousand Nineteen part time mourning and fulltime massage therapy programs C. N. W. S. M. T. dot com for information and events\nStarted to focus on the line with us from Sydney, Australia for a look at her favorite places for get away in her home country\nShe's just finishing up to filming the fourth season of the drama series a place to call home where she plays the lead role of Sarah Adams even though it was a top rated drama on Australia's seven network it was cancelled during its second season but fewer demand convinced Fox television to pick it up so the storyline continues in season\nThree and four now showing a lot of flak number of public TV stations here in the usa\nAll seasons of a place to go home plus marches other drama series are also available at acorn t._v. ... calling from beaver creek in Ohio Erica thanks for your call\nHigh rag thank you for taking my call high Marta I'm Hi Eric I\nWant to say air you're making reminisce about my trip from January anti thousands it will I came over for the New Year's eve fireworks estates or a glorious ... did\nNot want to come home and I did the French fries style\nTell us about this bridge and without being too obvious New Year's Eve in Sydney, Australia is the middle of the summer so it's nice and hot and everybody's out on the beach coming over the bridge what's it like Erica\nI'm less strenuous an eyelash fearing it takes rarely three and a half hours from start to finish extremely well organized\nOn how the group of more than fourteen and um they pick you up I think it's every half hour hour\nAnd he'll go along with a certain way to our guys stop you explain what you're looking at some advantage point give you some history of the city in the fridge it all on another little bit south again and they take your photo at various points and um\nAre you actually really are you roped up yes [laughter] so yeah so you're saying okay this is like a veal that ought to one of those uh cable ways where you've got the Caribbean or Z and you've got two of 'em and you go from linked to link is that right\nMhm and how\nCan you get to the past say we'll take your photo and then after the other side of the bridge and we'll come back down\nStreaming support for WAMC comes from my dog harness dot com I no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com cable right\nRight so you're just like a sack potatoes dangling from the cable and your guide within slide you to the end but [laughter]\nI actually because I asked them about their liability insurance and they said they didn't like it\nYeah because you got there that that if if you've got a guide to make sure you're harnesses on writing you you have to care of billionaires and it's a it's a metal cable so there's still probably ah one of the great thrilled so you could possibly have passed a tourist and that's a good thing to check out while you're in the\nThey also do a breath test just so you know [laughter] so\nYou know we're [laughter] well [laughter] I think for everyone else that'd be good but no it certainly they take a one on one's been drinking or feeling like they might\nYou know and you can't have anything in your pocket isn't that right Eric I just in case they fall off the bridge onto the traffic blow\nThat's correct there are only five I'd and if you can take I can only do it three of them are and like if you're an asthmatic like your guy will take your spray and their little fanny pack\nSo what's the name of the average again I've got a check this out more what is the bridge the Sydney how the bridge to Sydney harbor bridge haircut while you were there did you enjoy Australia Day we happen to be there for them you\nKnow and that was my question I had an opportunity to possibly go to a number and for the open and January and would be there over Australia that I don't want it now there's a traditionally to celebrate or you know\nThere's certainly is is always an indigenous ceremony which is called survival day and uh usually this great speeches wonderful traditional music food and celebration\nSo that's in any CGI and certainly in Melbourne that'll be happening probably said square it's cold which is very close to the astray and I've been steady and taking ...\nIs that on the same day every year yes it is the twenty six\nJanuary January twenty six Erika are you a fan of uh a place to go home it's been watching the series\nI got it's a stretch into acorn t._v. dress or I could watch that show\nAnd and what what do you like it out I mean it it it sounds like it's an addictive show or what do you enjoy about it\nI Love period pieces for as long enough and I said mentioned earlier just performances and they and they do have our topics that you wouldn't\nNecessarily think that would cover straight out for that so now that love triangle and just um the social mores at the time that you reflecting on how far we may or may not have confidence\nIn just great haircut thanks so much for your call\nI think you see in the ... because they're rushing yet [noise]\nThis is travel with Rick Steves who've been talking with mark the death of dark and she's the lead role to ... Sarah Adam in a place to call home and more to you know we're all thinking about Sidney Harris a but if you want to take a little break from Sydney or what's your favorite place to travel in Australia and why\nMy favorite places test mania um it's a tiny little island on the bottom of a strike\nDown the bottom of the right hand side and my husband's from this so I'm I've been going now with the ... the last thing is\nIt's still good old the old sandstone building from the compact days it's I'm not very far you can drive forty minutes to my tenure in the most incredible seaside town of seeking it and Franklin historically there incredible\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nThe food the the people that calmness um if you can imagine it calmer than it's rather already it's it has its own special piece and it's much cold down there so it's very ... very alive it has some of the most beautiful national pox I think in the world\nAnd you can walk them uh the cradle mountain walk and the ... you can do them via companies say stay and hot and the whole way which is pretty nice or you can free will get yourself um but they really out world\nHeritage walks and um it's just it's one of the most beautiful places I think I've ever thing ...\n... just and chanting\nNobody if I'm a big fan of uh an a soldier gold fashion liquid Australia from Nineteen fifties because I started getting into a place to go home and it inspires me to go to Australia and try to find a quiet Eddie from the past are there any places in Australia where you might feel like you're back in the Nineteen fifties\nMaybe in small towns along the way um but not really in the major cities on the rocks obviously in Sydney which is where the ... bridge is\nIs maintained and has historical walks way you can hear the history of each building and how it would build and again the sense giant and the convicts but for me what it straight he really has to offer is the nature\nAnd often they community that we've been talking about like for example there's a place called ... which is a Cape ... take on the west coast of Australia right up the top it's a\nAn indigenous run place that you can go and it has five star tents and then to stop hot so it fits everyone's brief\nAnd it takes a day to drive there or you can fly there on a small airplane and that really gives you an idea of the remoteness of Australia and how isolated in left alone it really is to the rest of the world\nAnd to me that the Eddie you're looking for when you come to this place you can say\nIt can be a place of complete solitude which when I go to America I Know they also have places like that\nBut I'm In Australia that they seem almost like you're the only person they're simulating Tasmania this place called wine glass by that you can walk into an arm and at the time me and my husband went in there was absolutely nobody that so we went skinny\nDipping water and I don't I didn't really these extraordinary and um and not far from\nA major hub where you can have a beautiful meal and some delicious line so um I think you're less searching for the Nineteen fifties and more things with that timeless place that I feel like you've got to try to offices", "show_name": "Travel With Rick Steves", "year": "2018", "city": "Albany", "day": "14"}