{"month": "10", "state": "MA", "station": "WNNZ", "content": "And to to link to take it to Hamilton from an E R you could win two great seat that the Boston opera house and dinner afterwards that eastern standard answer now in any P. R. dot net\nI'm Mary Louise Kelly we live in unsettling times and as we all try to make sense of forces shaping our world our country our towns\nMore than ever I feel our job at NPR is not telling you what to think it's not yelling we tried to be a force for facts a home for civil and respectful but fierce questions to the people we interview\nPolice show your support for this station become a sustaining member and thank you support\nWhat you value your that N. E. P. R. dot net\nMore from the BBC is just ahead\nThis is the any PR news network W. N. N. Z. A. M. six forty Westfield\nWINZ FM Ninety One Seventy Deerfield WFCR eighty five eighty three Amherst\nWN anew eighty nine five great Barrington W. N. N. I. Ninety eight nine Adams W. A. C. Ninety One nine Springfield in W. A. M. H. eighty nine three immersed in partnership with Amherst College and UMass Amherst streaming it N. E. P. R. dot net it's twelve o'clock\n\nIs four hours GMC they seized the newsroom from the BBC will service with Joe ... survivors of friday's earthquake and tsunami in Indonesia need help fast and that can hear the cries of low still trapped beneath the rubble\nWe're in a crisis we have nothing Raul basic needs food we desperately need them\nThe U.S and Canada or to pay to have reached a deal and then after that free trade agreement teen Macedonia the government has lost a referendum to change the country's name will explain what's at stake the arrival of sexism at the world famous ... well one of Donald Trump's closest advisers say she's a victim of sexual assault and\nIf you have a new clothes into prison\nThe desire to get out of it will diminish it'll grow and we will be the only person other belong to a scale\nEvoking the Cold War to describe Britain's exit from the e you leave some real it seems of oppression very unhappy they use the newsroom\n\nFrom Romeo Nunez with uh BBC News the United states and Canada have reached a last minute do you learn the north American free trade agreement or NAFTA to ensure it remains a try not to a packed with Mexico details from will grounds\nJust before midnight deadline but which time the Mexican government was due to present the details of this new bilateral trade deal with the United states to the Mexican Senate agreement was reached with Canada to on several rounds standing points\nIn effect that saved after its presence stages of trying that showed agreement between the countries of North America\nIn particular that Canadians relented on a deal to ... us dairy producers access to the domestic market one time they received protection from us from Paris\nConfirmation of a deal began to it than from governments who sings come over three nations with the NAFTA renegotiation set for the incoming Mexican administration has this yeah they want us to come from that deal on his Twitter account\nEmerging from a ... to Justin Trudeau told reporters it was a good day for Canada boats gave no details\nIndonesia has called for international help bugs would scramble to get food or even heavy equipment to central to the way we was devastating to the bar ... square ...\nNumerous agencies on standby to help so the Muslim bum is the chip on some of the children international in Indonesia\nThey already reports of children law on the street and looking for their kids and our immediate priority for that is also forced to make sure that their health and protection is faster and also to establish a family tracking system that we will just or their identity is possible\nAnd look for his or her family in the hills and shelters that the government has stood out\nMore than a hundred people are confirmed that Iran's revolutionary guard goals or does fall on several ballistic missiles into eastern Syria striking the ring leaders of the reason to militant attacks\nStreaming of New England public radio is funded by you at all energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nKilled or wounded in the east of the Euphrates River uranium state media showed pictures of at least three missiles being launched\nThe un special envoy for Yemen mountain Griffiths says cold for a giant international action to stop the world's worst humanitarian crisis deteriorating he said he was encouraged by the UN's warning over looming from him\nBut I think it was incredibly important for the UN to issue that warning in good time but it tells us something profoundly worrying about Yemen which is the\nSituation in which is already the worst humanitarian catastrophe in the world can only get worse for me as a mediator it means that I Need to get even quicker to get the puppies are on the table\nBBC News Macedonia is pro European ... of has vowed to press on with a parliamentary votes to change the country was named to North Macedonia even those Sunday's referendum fails to give him a clear mind\nGreece which has its own region of Macedonia objects do its northern neighbor using it said it remained committed to dropping its objections to you and major membership if the name change it goes ahead\nHundreds of thousands of independence supporters are expected to demonstrate to girls to Spanish region of Catalonia later on Monday the mock a year since the regional government do fine Madrid by holding an illegal independence referendum that resulted in heavy handed police action to stop the boat\nIn recent days Madrid has offered the constellations the chance of a referendum on greater autonomy though not self ...\nTroops from North and South Korea have gone to remove some of them more than a hundred thousand landmines thought to be buried on their heavily fortified border they're removing was one of a confidence building measures agreed to bother to Korea and leaders\nIn last last month in Pyongyang clearing the entire border is likely to take you as\nThe government of maggio Pradesh state in central India has announced plans for a cow ministry achievement is tissue rod sing John said it would allow increased funding for the protection of cows which many Hindus regard as sacred\nSundry this group to Mr ... hung belongs to the ruling B. J. P. which champions of vigorous film of Hindu nationalism\nAnd observers say he was just trying to reach out to his political base the head of the forthcoming state to send the elections\nIs it announced ... days off to the local head of the opposition Congress ... now ... is an ... village of his body one many Hindus consider the ... and ... strikes a chord with the volt is\nBBC World news\nHello and welcome to the news room on the BBC will service with Joe ... matter of time we go to Indian easy if a sweat relief efforts are being step built\nTo help the country in the wake of the devastating earthquake and tsunami which has so far killed more than eight hundred people president joke a widow has been seeing the damaged for himself ... that's one of the worst hit areas on the island of ...\nAnd ... international aid has been made and silent on Australia had both off that help and they can't come soon enough where the shortages of food water and medicines desperate residents have been run sucking shelter supplies\nIn through the [noise]\nWe had any other choices guessing [noise]\nWe're in a crisis we have nothing basic needs food we desperately need them\nAnd they're already pulls the people who are still trapped on the collapsed buildings that national search and rescue agency chief my right to say you said in some areas conditions were still safe so I think all\nHe would be dangerous if such teams going then because we're still having off the shelves I really hope the local government will be able to get us heavy machinery\nWith face that the number of dead could now rise considerably questions being asked as to why people would given warnings about me in the first places of Reuters reports that Kenya Priya ... explains\nAnd to to link to take it to Hamilton from and he'd be are you could win two great seats at the Boston opera house and dinner afterwards that eastern standard enter now in any P. R. dot net\nOn the morning and then lifted it within thirty four minutes and that was just around that Dr either just before just after the tsunami and it's actually I think that they only have that sense that they were getting\nWhat trauma center that was two hundred kilometers away from the city of hollow I only recorded a very small six sending away once that passed they lifted the warning they said\nThat was the best information that they had available and they made their decisions based on that the way that actually hit low and the surrounding areas or up to sixth graders\nSo they are chasing two thousand and four and\nThey put a lot of effort and money into installing to nominate warning centers around the country but a lot when when something like this happens a lot of them are found to not be functioning so there has been some oversight and anger toward certain days\nNow to Macedonia which is still cold Macedonia despite the efforts of the government to persuade voters to rename the country as in ... in a referendum which took place on Sunday the proposed name change was designed to ended decades old dispute with Greece\nAs to the view the men and women have identical brains was an ideology that was part of a political battle\n... said the presentation was highly offensive and the organizers went on a winner of the content when they invited professor stream you to speak\nIs coming up to ... see a reminder of on main headlines Indonesia has appealed for international help\nAs he responds to the devastating earthquake ... see the United states and Canada are reported to reach degree him some reforming the north American free trade agreement on the un envoy to eh Yemen has cogent international action\n\nNow let's return to auto story the relief effort is following the devastating earthquake and tsunami in Indonesia a correspondent ... is in ... and joins me on the line now Murray ... can you see where you are [noise]\nWell I'm currently and look I think\nOne\nCan imagine in the [noise] the last like [noise]\nStreaming of New England public radio is funded by you in all energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nWhich has managed to\nGet on the street trying to get all the fighting that\nFire [noise]\nMoody says a very distressing that from the sounds but just briefly all she'll to choose the foods of medicines really affecting you can see around you\nAnd I\n\nThink\nThe only way I think that [noise] they show it don't\nTake the\nMoney to always sign key ... license in the west than apologies for the call a sea of the line\nNow Yemen accounts how much more or less the message from the un special envoy to the will to country militant group is\nOn the special concern about food supplies with charities working in Yemen saying that more than five million children that are at risk of ... because of the ongoing civil war but Mr groceries told the BBC that still they she could be prevented peace talks could begin he spoke to achieve international correspondent least you said in New York well let's just hope\nWe don't get the because I think between now and the day when from in does the eruption them and there are things we can all do to stop that happening so I think it was incredibly important for the UN to issue that warning in good time but it tells us something profoundly worrying about Yemen which is that\nThe situation in which is already the worst humanitarian catastrophe in the world can only get worse for me as a mediator it means that I Need to get a even quicker to get the policies are on the table\nWith your mediator with the problem now because you try to hold talks in a in Geneva in September and who's he didn't show up\nNo they did it wasn't the week we had planned to be honest\nI'm I've been back to sign a sense until to the leadership leadership about what needs to be done to get them to talks next time to consultations which we hope to convene within weeks and I think we're working out the logistical issues that need to be resolved\nHas this morning about the prospect of famine concentrated minds in the capitals which count which include London Washington Paris Riyadh and tear on all of the outside players involved\nBut I think they care and that's how many you know uh well it's not enough or they all want this to happen for whatever reason I think the the essential reason is your income take much more of this war the threat the prospect that worry\nIs that it can get worse and that's the prospect which is almost unimaginable in Yemen\nBut if you will we heard from President Trump speaking in New York that actually the situation in Yemen is improving as he sought many saying that unless key players like the United states and Britain get behind this push really get behind his push for political solution to stop the war it's going to happen\nWhat will not be helpful is if the people of Yemen who are going to do the negotiations to stop it than the mothers to come together to discuss it\nMy focus is on the Yemeni negotiations of course it's essential that the members grow to counsel you mentioned to the uh to their responsibilities seriously and in my view they do\nA very active on this issue in terms of ah persuading the parties to focus on the negotiations I have no quarrel\nEnter you in two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard\nAnswer now in any P. R. dot net and provided with imagery sport not just by Ron ... report say by Lebanese he's but our fighters who come from Syria\nBy for those reports I have no reason to doubt or confirm them but it's not\nMy business in fact to do so my business is defined agreements which takes away from the need for such a assistance or so or if they're true there are alarming they may not be surprising but it's something we need to move away from\nThat was un envoy most in Griffith speaking to the baby sees laced dish that you know South Korea were to remove the hundreds of thousands of landmines buried in the demilitarized border between the two countries is one of the number of measures agreed upon when president moon and came gentleman mentioned ... last month\nOr so Seoul correspondent Laura ... reports\nIt thought mayor and eight hundred and sixty phasing landmines along the ... kilometer part at ten days and it will take months if not years and flack\nFor the next few weeks on the engineers starts in what is known as a joint security area we looked at the ... century based it killed ... eventually like both sides have more fairly\n... when we had rich for hundreds if they were just about killed and intense fighting the war it could be one to excavate the site and identified inane\nStocking gift where he'll soon after president named the tanks and a summit with Kim Jong un and killing young will build confidence between north and say if they try to be chased the tensions along the border\nNow Neal ... from ... desk\nTerms of thousands of supporters of Brazil's for a ride the presidential candidate John ... of march through the streets of cities across the country a week ahead of the election the biggest demonstration was in a pond where his support to show slogans against corruption and mainstream politicians\n... is leading most opinion polls were just on the thirty percent on Saturday women lead demonstrations against his candidacy\nTo people who have been killed and more than a hundred injured after a powerful typhoon struck Japan typhoon Treme made landfall in Sunday near the students are different soccer the storm caused widespread disruption with many flights and trains canceled nearly a million houses are without power\nAnd Iraqi ... two major political parties have been used the job of electoral fraud following Sundays parliamentary election merely hundred candidates for for a hundred and eleven seeds in the first parliamentary election in the semi autonomous region since during the teen voter turnout is reported to have been modest\nThanks email now some of the world's leading climate scientists amazing and South Korea this week to finalize a report on just how to keep global temperature from rising by multiple point five degrees Celsius ... century\nMembers of veins governmental panel on climate change are expected to will ... the world has already warned by around one decrease in the Eighteen fifty\nAnd it's so close to exceed will point five degrees by twenty faulty unless some kind of rapid action is taken many low lying countries in particular faith that into dissipate under the safe if not limit is passed\nOut and vitamin costs about ... has the details\nThis report just have to be the most critical and controversial study on climate change in recent years it's critical because PCC scientists say that without rapid cuts in C. O. two emissions and to switch to renewable energy the chances of keeping temperatures from rising more than one point five degrees will disappear\nThe study will be controversial because it also suggests the use of unproven technologies to remove carbon dioxide from the atmosphere these efforts will be worth it say researchers as it will save millions of people around the world from rising seas but first\nThe scientists have to convince representatives of most of the world's governments that the conclusions of sound\nThere are concerns that some of the major fossil fuel producing countries will do their best this week to water down the report's conclusions\nYou'd be listening to the news room on the BBC will service which Jo Mount a soul mate news\nStreaming of New England public radio is funded by you and de path university graduate schools an essay and creative non fiction writing enrolling now for August twenty seventh applications that they pass dot edu\nBut the system is not good for that the system is built for you costing the next and meters\nWhat you paid your meal but if you don't trust it next and meet as what happened to thank you blow away hungry even though you have the ability to pay for your meal\nAnd and meet us down the west to impose a way to food even though it has to be petted and was waiting to sell it to you\nSo willing buyers and sellers cannot pay and that is what happened because crush disappeared because the counter party with seemed to be too high everything stopped\nAnd then why did the suddenly happened why it didn't trust is a PIN concert Ponte was become too high\nBecause no one imagined that team and would fail\nAnd no one imagined that lead man will fail and if this all the way even failed early Monday morning I remember very clearly on Wednesday evening being still at the office calling home and saying please go pretty cash machine\nAnd pull out the maximum cash we can which was about five hundred dollars and I was asked why and I said they simply I don't know whether the banquet opens tomorrow\nThe global repercussions immediate ... senior un advise them\nIt took a very very short period of time for the a crisis to spread throughout the entire world economy\nAnd the image that most of the leaders had in mind was that we might be entering another Great Depression I think in a way they're panic was over ... actually because\nReacting to panic by more panic is not necessarily the right way to do would be Franklin Roosevelt had a different idea\nOn march fourth Nineteen thirty three when he said\nLet's\nSay\nThe fear was absolutely palpable and this was a crisis that started at the heart of world capitalism on Wall street itself\nSo that made it even more frightening because Wall Street who are not very frightened when terrible things happen to poor people but they're very frightened when bad things happen to rich people\nThe extraordinary thing about the financial crisis incident happened in finance is this is the most of the case of the global international system's central banks and for as a result of the elites\nStreaming of New England public radio is funded by you at all the energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nAnd go to the best candidate they have lots of data and the other most powerful positive government because they controlled bunch of some money at the heart is a seemingly very clear mission financial stability\nThe same is true of the global level with the international Monetary Fund the IMF is the most powerful most skilled and best paying of international institutions its mission to his financial stability so how did many thousands of experts getting so wrong and allow this to happen [noise]\nWhy didn't they see the flashing warning signs Alan Greenspan was chairman of the U.S central bank the Federal Reserve for ten years proceeding the crisis\nHe was a driving force from the deregulation of banks and from up to placing the ballooning derivatives trades and housing markets Syria's giving evidence the U.S Congress in October two thousand eight immediately after the crisis struck\nI made a mistake and presuming that the self interest of organizations specifically banks and others or such as if they were best capable of protecting their own shareholders and the equity and the firms I still do not fully understand why it happened\nThat all the central bankers in national and international institutions allowed this to happen and didn't see the crisis coming troubles me deeply mountain move is chief economics commentator at the Financial Times\nThere's no doubt a financial institutions and that regulates has made in retrospect enormous mistakes is obscene no doubt about it and I don't think any of them would seriously denied\nAs ... what they were doing was perfectly legal and so the regulations and laws as much as the people ought to blame\nI think there are two so some things that we have to think about\nI'm pretty sure that that must have been things going on here which was a fraudulent too close to it but the truth is and this is I think really frightening thing\nThat most of it was legal in a way what was frightening about it is that we could get into such a terrible mess\nWhen people were doing things that can be very risky\nBut taking risk is not illegal taking risk ... ... the financial institutions of that full so you could say and I think I Would say that the real problem was that what was passed the legal turned out to be spectacularly dangerous\nThe financial crisis was the first crisis to highlight the underlying weakness of globalization\nBill many benefits to increased integration and it has led to unprecedented development and progress in many areas however it also leads to new vulnerabilities and into dependency which is why more cooperation and agreed rules of the game on needed\nThe opposite was happening the regulators engaged in a race to the box him\nI saw it here in the United states where the banks will come to the U.S government and say if you do deregulate we will lose out to even K bangs or European banks Icelandic banks\nMy view is good\nOr if they want to go for a set up a gambling casino they wind to behave badly ... their problem but let's protect America let's protect Americans so I never bought this race to the bottom but a lot of policymakers dead\nAnd I think the magnitude of the lobbying five lobbyists paid by the banking industry for every member of Congress\nHundreds of millions of dollars in campaign contributions and lobbying the banks didn't know how to invest in ... and they knew how to invest will and political asset\nFor this the bankers were originally rewarded three weeks off they went bankrupt the c._e._o. of Lehman Brothers Richard food appeared in\nStreaming of New England public radio is funded by you at all the energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nAnd you've taken home more than four hundred and eighty million dollars my question to you is that fair for the CEO of a company that's now bankrupt have made that kinda money it's just unimaginable to so many people\nI Would say to the five hundred number is not accurate but I Believe my cash compensation ah we're supposed to sixty million and I believe the amount that I took out of the company over and above that was a little bit less than two hundred and fifty million still large number the\nRichard food have to clarify that he only three hundred and ten million dollars\nBut he didn't respond to the question I'm fan is\nIn good times bankers were paid exorbitant bonuses\nIn bad times government bailed out the banks using taxpayers' money and the bank is still receive big bonuses well board and re people lost their jobs and suffered enormous pain no one to the public was getting angry here's ... again\nI made a call at one point to Larry Summers who was a senior advisor of Obama and says Larry you got to stop these bonuses to these banks that you're bailing out and he said oh I Can't do that these are contracts Jeff where the rule of law\nI said are you kidding you're bailing them out how can you not impose limits on the bonuses well they didn't it it was outrageous and the public sense that it was outrageous and no one went to jail\nNo one went to jail but more than that I counted as the CEOs of the wall street institutions went to the steak dinners of Mr Obama went to meet with the president is the hallowed leaders of the U.S economy [noise]\nMm\nThe cozy relationship between most recently the White House was not diminished by the crisis if anything under President Obama and now President Trump and it's become even more conflicted Wall Street spent two billion dollars a loving and campaign contributions in the run up to the two thousand sixteen American election\nDespite the promise to drain the swamp President Trump is continued to recruit from Wall street and particularly Goldman Sachs but the problem was not simply capture\nEven when governments wanting to do the right thing civil servants and ministers simply did not understand the technological innovations a loud bang cars to run rings around them\nThis and the race to the bathroom to reduce the restrictions that banks face helps to explain deregulation in the u._k. and across Europe ... is professor of public policy at the University of Cambridge in England\nJoined me in golden for the second episodes of off the crushed next week on the b._b._c. World Service [noise]\nEverybody's got resolved the host of marketplace you know a lot has happened in this past year and if it's taught us anything it's told us that we have a real need and a desire for thorough and factual reporting that's what we do here at marketplace and that's what's being done at local public radio stations across this country\nSo thank you for listening and donating to public radio programming we could not do the work we do every day without your support\nSupport New England public radio now at N. E. P. R. dot net thanks\nStay with us for news throughout the night from the b._b._c. World Service this has to be any PR news network WINZ am six forty Westfield WINZ FM Ninety One Seventy airfield\nWFCR eighty eight five H. T. three Amherst W. N. N. you eighty nine five great Barrington W. N. N. I. Ninety eight nine ... Adams WAMC Ninety One nine Springfield and W. A. M. H. eighty nine three Amherst in partnership with Amherst College and UMass Amherst it's one o'clock\n\nSix o'clock here in London hello and welcome to news day on the b._b._c. was punished shop the giants [noise]\nGood morning author of young kids can with the big business story yet the United states and Canada have finally reached a last minute deal to revamp the trade agreement there was about to collapse will tell you why it matters\nPoodles that got allied to envision easier when was that eight hundred people have died in the ... and the death toll is expected to\nRise ... says he won't enjoy the FBI investigation into the Supreme Court nominee will get to the use of Paul ... S C I now I\nHave will hear about the west bank village where these radio authorities have handed out notices of imminent demolition plan\nTo get advice ... DNA come from outer space that sounds to me just well\n\nRomeo new nose with a BBC News\nThe United states and Canada have reached a last minute do lawn revising the north American free trade agreement to ensure it remains a try not to a packed with Mexico\nUnder the new U.S Mexico Canada agreement has agreed to give us dairy producers access to its domestic markets in return for protection from us a call to ribs\nAfter more than a year of renegotiation the deal came just before midnight us imposed deadline will grow in terms of the details\nConfirmation of that deal began to appear from governments who says come over three nations with enough to renegotiate except for the incoming Mexican administration has who see how they want us there used to come from that deal on his Twitter account the timing was key with Mexico keen for an agreement before the change of power\nAnd the Trump Administration who said wanting to reach a deal but for the crucial midterm elections in November not less Canada not wanting to remain outside of free trade deal with them for a trillion dollars in regional new trade\nIndonesia has called for him to national health because it scrambles to good food or you didn't heavy equipment to central to the wings which was devastated by friday's earthquake and tsunami more than a hundred people are confirmed a book that figure is expected derives Rebecca ... sent this report\nVibe it fishing villages were and now pile of rubble ... smashed together with ties into the rolling around in the states have\nSaid that he actually being out in ten in the ... of their homes and say they have said no age and I'm running out of clean water ... and ...\nAt the local health panic of ... ... ...\nAnd to to win two tickets to Hamilton from an e PR you could win two great seat that the Boston opera house and dinner afterwards that eastern standard answer now in any P. R. dot net\nSay hey we'll have to bury their bodies in mass graves today to stop the spread of diseases\nOf the United nations special envoy for Yemen mountain Griffiths says called urgent international action to solve the world's worst humanitarian crisis from deteriorating for the chief international correspondent leads to set spoke to Mr Griffiths in New York after he had met most of the major players in Yemen's Wal\nMart in Griffin said he was encouraged by their response to the UN's clarion call to avert a looming salmon but he cautioned you but only become clear in the next week or so whether enough financial aid and food would be provided to prevent even greater suffering\nBut you also believe this crisis has focused minds in the urgent need for peace talks last month who the rebels failed to show up for discussions in Geneva\nMr Griffin says he's now hold full he can convene another meeting within reach young and he warned can't take much more of this war\nWorld news from the BBC\nIran's revolutionary Guard Corps as it does fall on several ballistic missiles into eastern Syria striking the ring leaders of the reason militant deterrent given the Iranian so ... it's a large number of terrorists had been killed or wounded\nIslamic state group and an ethnic Arab separatist group both said they cover adults are going to talk on the walls which killed twenty five Iranians\nTroops from North and South Korea have they gone to remove some of them old an eight hundred thousand landmines though to be buried 'em they're heavily fortified border they're removing was one of a number of confidence building measures agreed with the two Korean leader Kim Jong known than president moon Julian\nMet last month and join young Laura bigger isn't so\nFor the next few weeks on the engineers starts in what is known as a joint security area where most of the guard posts ... based it's helped ... eventually like both sides need more freely\n... when it had rich for hundreds of soldiers were killed and intense fighting the war\nThat you can be as one to excavate the site and identified the remains stocking this way so soon after president named the tanks on his summit with Kim Jong un in Pyongyang will build confidence between north and say if they try to reduce military tensions along the border\nTens of thousands of supporters of Brazil's foreign aid to presidential candidate John ... who have march through the streets of cities across the country a week ahead of the election was ... ... is leading those opinion polls with just under thirty percent\nHundreds of thousands of independence supporters are expected to demonstrate to cruise the Spanish region of Catalonia later on Monday bill mark exactly a year since the regional government defined Madrid by holding on illegal independence referendum that resulted in heavy handed police action to stop\nThe vote that's the latest the b._b._c. world news [noise]\nThank you very much today for that and they all had everybody will continue to stay with tiny shop I may\nHave something to the next few minutes we'll get the latest from Indonesia island devastated by ... and then they can keep up with the program by falling BBC while status and Facebook and Twitter and you can text and you hear the number they puff full full seven seven eight six twenty five [noise]\nWe started with that story NAFTA the north American free trade agreement initially between the United states Canada or Mexico at one point it looked like Mexico in the U.S might go I don't know but now the U.S and Canada\nHave reached a last minute deal to revise NAFTA President Trump Trump campaigned on a promise to revamp the Dale ... center real young is head of what what exactly is happening\nWith American free trade agreements has been around for the past quarter century but Donald Trump or when he was campaigning the president said it was to blame for that 'cause it is all manufacturing jobs out to the United states and he promised to renegotiate it now\nStreaming of New England public radio was founded by un the western mass coaching alliance offering personal and professional gross through its member coaches coaches profiles available at western mass coaches dot com\nYeah about Canada was holding out and it led to these\nThree comes we deal would collapse in ... the U.S and Mexico would remain in a revamped version but a last minute deal has been dumped\nA between Washington and ultimately in addition to a name change or the big sticking point has been able to ... to do with the dairy industry Canada was concerned about allowing us dairy farm is access to that\nMarket but they just moved and allowed us some access and that means that a deal has now been done a big change from Canada who go Paris cone I used to be enough the lawyer he's now the Centre of international dumping into the basin and moved to new in Canada\nWe have to see the details and we have to see what type of uh of access how much or cannot ... has allowed but I don't think\nUh I mean it is a large volume which I don't think it will be\nCanada certainly had to give a greater access\nTo the U.S to it very actually three products hit dairy poultry and egg those harder the products covered by it supply management scheme and the reason is a you know Canada has been granting access to other countries that are more recent negotiations\nWith the European Union granted a leaky you a larger access to its market so it was clear\nThat it had to move with it and it's going to go see Asian or what the us if\nYou took the deal the rule is when the United states Donald Trump and any would be done on the basis of the narrative incidental presumably marriage was the biggest winner\nThey want to provide a balance look at the allegations and there are skilled at getting people to confide in them where they might not complied with the press the media or or part of the politicians so the the hope is that they will ah open up to the FBI and perhaps\nTheir memory will be a\nWill be stimulated by the uh the occasion they'll provide additional information that may lead other other places\nAnd is it your under an understanding that the FBI would that have the authorization to do those subsequent interviews for quiet\nWell that's a that's a question of kind of up in the air the president seemed to indicate that they could follow the lead to where they wanted to go but there may be some conflict with the office of legal counsel which works for the president this is all going to depend on what the director ... director Christopher Wray tells his agents that you want them to do\nI truly believe that there'll be able to follow a logical leads what the president will probably not allow them to do is to go out into other allegations that are not related to the one made it made by a doctor for or any of the other people that are uh\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit from an ... with a farm standard for sixteen Bayh road open six days a week through Thanksgiving small ones farm dot com\nWill have to see how it plays out in the next other news\nOnce they do complete that investigations within the scope of whatever is allowed to them within the scope of the time will happen next to do they give a recommendation do they say yes this person is state for example to be a judge on on the Supreme Court\nNo and background radiation the FBI never provides a recommendations or conclusions the agents in the field who are conducting these interviews and rule will not actually\nHave any input into summaries that are provided to the White House in the report and then the investigation they will simply complete their their interviews\nSend them electronically to FBI Headquarters where they will be ... and placed into a report and then there will be an executive summary of the confidence of the\nInterviews at the beginning and that will be provided to the White House\nHas said the government is a retired FBI special agents talking about the FBI investigation into the allegations against Brett Kavanaugh who's though Trump's nominee for Supreme Court judge\nTo the west bank now and the fate of a place called ... which must have a strong came to be the most well known Betty Lyn vintage on the planet\nAs we've told you the full on Tuesday be Israeli authorities have authorized the destruction of the vintage people encounter ... have been told by the Israeli government that they have until midnight tonight Monday to move\nTheir own homes otherwise the state will send in bulldozers by Michael ... is the editor in chief of the left wing Israeli magazine plus nine seven to welcome to the program my co what is the residents refused to go what will happen will they go ahead and bulldoze their spinach\nThey'll both those the village and forcibly displaced a presumably the the residents to a different location ... I'm\nJust remind us said why does the government wanted to demolish it\nThere's a few levels you have to understand here the the reasoning that the government is giving is that it's a simple planning issue which you know sounds innocent enough but there's two other issues that place here and one is that we're talking about occupied territory\nAnd according to human rights groups of the Palestinian authority is and uh most world leaders forcibly displaced saying that protected population and occupied territory is anything from a war crime to grave for each of international law and on the geopolitical level it the location of the village is very very important\nUm it's it's in a place of the west bank where is\nThe Palestinian population is removed and Israeli settlements coming to replace them where there's already settlements their\nExisting there are many people say that it would it would cut the west bank into two different pieces I'm making a contiguous territory impossible should we ever see some sort of peace deal mhm and they would also cut off East Jerusalem which many people are\nBy the Palestinians and much of the world believe to be a will be the capital of the of a Palestinian state middle cut it off from the rest of the west bank\nOkay so if people have been living here since the Nineteen fifties not Israeli government said the structures we built on state owned land without comments from the Israeli military which undid the Nineteen Ninety three ... a call it's has extensive control over construction in sixty percent of the west bank known as Area C suggests this fall within ...\nIt does the residents claim that it's actually privately on land owned by a a nearby Palestinian town uh but the other thing you have to understand about Area C and and the Israeli control there is that the Israeli military which is responsible for approving\nA building permits and in that area that you mentioned denies\nWell over Ninety percent of Palestinian requests for building permits and the residents of one of the smart one of their their last ditch attempts to stave off this this demolition was to submit a their own planning\nAnd their own master plan for for normalizing the [noise]\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit from Amherst with a farm standard for sixteen Bayh road open six days a week through Thanksgiving small ones farm dot com\nThere's Jewish Israeli settlers to do when when they're caught building a what the Israeli government that describes says go ahead\nMichael surely the Israeli government then has offered them an alternative place to go to despite a international objection to this has day being an alternative pace in where would that be than\nThere is it's a location not too far away um\nIt's also very close to a trash dumped um which is you can imagine it's not as not ideal for this for this residents and the other the other problem they have with it is that it's it would presumably stop them from\nA continuing their uh their lifestyle which involves are hurting and another agrarian aspects\nOkay and it has become an international issue we said there's been a no international objection to this including the un advancing against it that Israel has not and nascent has gone to had to dance and what's likely to happen if this should go ahead\nYou know the Israeli government has been trying to to sort of take over this area and remove the Palestinian population for a few decades now and up until the Trump Administration the Americans and the rest of the world have essentially told the Israeli government do not do this\nAnd now there's just very little resistance and the European Parliament orange that it would be a grave ... screech of international law uh last year that\nMany European countries warned Israel that there would be a reaction that this happened but it doesn't seem that there's any any real threat\nOkay Michael I'm the editor in chief of connecting is raining ... plus nine seven two\nScientists was discovered that a key processing the cradle of life may have taken place in outer space relatives among us fosters compounds or a vice so adamant and the creation of DNA but they may have made that journey here from into Stella dust clouds presser Ross ... has been leading there was such he spoke to ... states pool Hawkins\nFor for ... like ... or face Kennedy phones in intercepted by ... by ... smoke temperature ... scene was a time wise oxidation and then drove them I also know that the ... in in just set out clause\nOnto ... river and the building blocks or the building like the road for court systems like asteroids and comets\nAnd we all have a ... back in ancient times comets and asteroids kind of impact on us so these are all the scientific facts but we can say that phosphate and die for say in fact you can be made in deep space and they couldn't be delivered to us\nI'm going to be honest I myself I'm a very simple form of life so I'm just trying to break this down into language that I can understand and these phosphates arrived on us and viable potentially asteroids\nBy made to arise or by comets\nRight okay and then they arrive on us and then they form to conduct pools of chemicals that that we think theoretically formed the building blocks of DNA which is well roommate from\nLet's opposed to the U. S. correct I'll just got to the chase boys this important and I\nWe wanted to know how would live developed and how life or or reject riots and each one of the key elements for life is full of costs and we always the ones we know you've got a good possibility that these proteins can happen on other planets outside our sort of system\n... says hey you guys ... so they basically increases the probability of possibility that life does exist in other parts of the ...\nDefinitely show it to the molecular precautions to life can be easily phones all over in the universe where these conditions like low temperatures ISIS radiation and the correspondent kept microbes exist\nYeah so that's exciting and does it say main that fold the eighth phosphates these compounds deeds thoughts out there in the universe and then arrive on us and they were essential for creating life that in fact we're all alien in some full\nI don't want to go\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnswer now in any P. R. dot net\nKevin ... on a alien origin I mean you know from the time so I mean I wouldn't put it all sensation that they\nAre but this is the media you talking to the media kept them provide them with the federal\nThey say there's one in a choke hold so far um except for one quick check on you their goals Rachel to solve the thoughts of it there\nI'm there and we'll know none of them have been there yet there's talk around ... percent of all the lights big leave it but it's related to see how the school and the dog was so much to do that\nRandy jokes are giving us the latest from Cameroon and the aftermath of the UN's imaging telling the BBC's ... into independent investigation needs to be carried out into alleged atrocities in ... come\nTo South Africa next and stunning headline hit men and polish South Africa's leaders are killing one another\nThat article appeared in the New York times on Sunday investigating how about Ninety politicians have been killed in South Africa since the style of twenty sixteen many of those killed had one thing in common they were members of the African National Congress who has who had spoken out against corruption in the policy now we're joined by many to Hamas who's an expert\nOn political violence and he's based in ... in debt and specific he won't come to the program Mary I was in South Africa recently and we had\nI had people talking about this but it's taken an international newspaper to come out and expose it what's coming on\nGood morning everybody well what's going on it's been going on for a few yes I think many since I'm a the fall of ... the election of a gang whom is a presidents\nWe've had um I'm not an increase that grows tremendous increasing corruption in government at all levels and it's only ... who's got to make sure I I Know who government level\nAnd that's where most of these killings and taking pay ... for um municipal officials who have tried to expose corruption\nThe and the ... and and the reveals made me made you talking about local ... lives and and even they have ... and and lots of politicians are carrying guns themselves let's look at the latest kidding of Mr Murdoch ... he's a ...\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard\nEnter now in any P. R. dot net\nAnd to local politics and he's home town and is included in clubs in and tell him why tell get someone like him\nHe he I'm not I'm not\nGross corrupt the grossly corrupt deal I'm millions we embark foot the renovation of an\nHistoric cool and they were juice that says the ... gone into the pockets so companies to whomever regular tend to have been awarded that's the favorite way of doing it uh you you give it tend to to you wonder if your political friends or a relative\nAnd a lot of the money is often back into your own pocket you get kickbacks for it and\nAh had some documentation about that he was pursuing that I've met threes and he was shocked to hear that was to other people who survive yes he's five for a while but he died under the scariest in some senses\nAnd people feel that he may have even be poisoned deadline which was offering\nAnd the other thing is like we know political ... you know in terms of political assassinations is not new to South Africa because during the apartheid regime you saw that they will ... violence between political policies itself but this is different the allegation in the article he has that and see officials like killing each other\nYeah they had organized something hit men um to do it and that's a problem you see a lot of these politicians\nAlso have interest in safe from here to come to the sex\nIndustry up the taxi industry the ... the industry has long been dubbed ... virus searches as a as a mafia\nUm they're they're the people who Syria Iran for black people who don't have the until sport and the leading a leading tech CEO project in this province is related to this excess relation\nOf former president Zuma and he also most of the ... the the the text you see the chick ... close to a loss as politicians\nBetween the taxi guys on this the tech industry is known for employing hit men and those men may excess body goes I mean the buddy gossiping is turkey over the talk of the guns the bodyguards and and I should say first is Cindy ... and there's\nAlso the article goes on to say that this is a sort of run the pulse of the current president is struggling to unite his ... and he's administrator and has even resisted official demands to provide police protection for to ANC whistle blows in the case surrounding the stomach was mad\nAbout putting some anti corruption officials but very briefly have there been any convictions just very briefly if you could\nUm no they haven't seen any ... conviction submitted since two thousand and sixteen and I do want to say that the lives of ... the two anti corruption clauses in grave danger\nAnd is absolutely no explanation about why when they stuck to the next ...\nTo ... who's been such in corruption for years living knocked to the animal this no reason given\nFor them who are fighting corruption not to get a not to get protection and that's something the recommendation even if the public protectors who's who's who's a recommendation has the leak the lord\nAnd my feeling is that\nIt's the enemies he's made with in the party\nWhich are pushing a which are blocking attempts to protect them and that's really serious and I think we want the rest of the world to know the danger under which these men are living\nWe'd be we picking up on this story married because it's New York times headline it's significant story indeed but I've just been looking through Twitter I've looked at seven no too which is an independent radio station I looked at\nI Witness news has any and they're not talking about it is it how is it has become a talking point since the article has come out in the New York times extraordinarily\nI haven't heard any feedback yet for medical media they usually get don't make like ... ...\nStreaming of New England public radio was on wor other western ... offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot com\nNotes those very wishy washy report Institute is who are in the pros and it's just a commission that was established by the premier that didn't tell us anything we didn't know already in effect I think if he says you ... what Washington office was used to\nSay that at the moment it there's nothing\nTo see no feedback loop college about ... will be okay maybe to house expect on political violence based in Devon ... thank you very much for joining us\nNow does go to the United states with on documented migrant children will be moved to attempt in the desert in Texas they're given this a warning open moved nights and when they arrive housed intense in rows bumped\nHis new school and they have followed us support them I had in the cat homes from which they'd be moved ... times has been researching the story and described to come to new stays on an ...\nIt's on the sort of bleak Sandy patch of desert and when you when you see it from overhead you just see rows and rows of massive tents\nAnd the United states government has sent Thirteen hundred kids they're so far and\nThat number's expected to continue going up because we were dealing with a bottleneck right now where unaccompanied minors continue to come into the country but they're not being released as quickly as they used to be and so as a result or just far over capacity in the shelters that that typically hold those children and that's why the government is turning to the tent city in Texas\nIn terms of\n[laughter] so it's comfortable from what I'm told but spare the children's sleep in bunk beds are usually twenty kids in each ten in bunk beds and they're separated by gender they have a health clinic on site there ... or surf three warm meals a day\nBut you know at the end of the day they're soft sided what what are called soft sided structures are essentially large tents and so the prospect of living there for months on end for a young kid is pretty for boating and that's why I think this story has drawn so much attention\nTo both the both of them to do a couple of us would be a near the reason why the government is doing\nThe best way to understand it as it is you know\nMigration flows into the United states they fluctuate constantly\nBut in the last several years they've more or less stayed at the same level known massive changed since President Trump came into office but what's different is that in the past\nUnaccompanied minors were matched with sponsors that's usually family members or friends who've come forward\nOnce they come to the United states and agreed to sponsor them and take them and take them home but the Trump Administration has changed you know both policies and rhetoric in a way that it really intimidated people out of coming forward to sponsor kids because they are afraid themselves of getting caught up\nIn the Trump administration's immigration enforcement agenda because the vast majority of of adults who sponsor these kids and take them in our undocumented immigrants\nMostly been hearing stories about how the children to be moved as being away from the middle of the night than drinking or buses was duck the motives ...\nThe idea behind waking up in the middle of the night and giving them a whole lot of notices that the government doesn't want them to try to escape doesn't want to give them enough time to try to come up with an escape plan you know figures that they are going to be a little more intimidated are scared to try to run away if they're traveling in the middle of the night versus during the daylight hours\n\nHey thanks for listening this is David Draine and thanks to your support so are you are you are in a member okay don't panic we can fix this here's how\nBecome a New England public radio sustain or quickly and easily on line at NPR dot net when you sign up to give ten twenty or thirty dollars a month right now you will be a reliable part of this new station that you rely on sex for going to any P. R. dot net\nStay with us for news throughout the night from the b._b._c. World Service this was the any PR news network WINZ am six forty Westfield WINZ FM Ninety One Seventy airfield\nWFCR eighty eight five HD three Amherst W. N. N. you eighty nine five great Barrington W. N. N. I. Ninety eight nine Adams WAMC Ninety One nine Springfield and W. A. M. H. eighty nine three\nImmersed in partnership with Amherst College and UMass Amherst it's two o'clock\nComing up on the outside with me Nikki baby global pop icon Janet Jackson only music videos making a comeback of just shrinking production budgets\nWe all watched it and watch that that that you get smaller and smaller and you used to them being million a million ... million now back up again I'm saying it's nice because it if he can make them into many films\nAnd TV shake created Jonathan Ames he's book you would never really hear it became the excellent walk in the next hour tells us about the release of his novel the extra non skateboard as Nina ... some of the documentary that rain skate kitchen\nAnd Hollywood style Glenn place addresses the need for twenty century fatal attraction\nIt would be wonderful to tell the exact story from her point of view because there's so much about her that wasn't clear you know it was left to people's imagination\nOld fashioned musician Michael ... he's the ... coming up on the ... Salah\nAround noon is where the b._b._c. news the United states and Canada have reached a last minute do revising the north American free trade agreement to enjoy it remains a ... with Mexico\nA joint statement said the new agreement with the U.S Mexico Canada agreement would result in free markets wherever trade and robust economic growth will ground reports\nOff the mood than a year of owned Jewish renegotiation the final tax to the new NAFTA deal came at the eleventh hour in effect that saved after ants President's Day to the tri ... agreement between the countries in North America\nIn particular the Canadians relented aren't deal to permit us dairy producers access to the domestic market while in return they received protection from us to build\nThe timing was carried with Mexico keen for an agreement before the change of power and the Trump Administration who said wanting to reach a deal but for the crucial midterm elections in November that left Canada not wanting to remain outside of free trade deal ... trillion dollars in regional new trained\nIn Asia has called for international help as it scrambles the good food or doing heavy equipment to central sooner wins which was devastated by friday's a square you're going to nominate more than a hundred people are confirmed dead Rebecca ... sent this report\nOne vibrant fishing villages were and now piles of ...\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit farm in Amherst with a farm standard for sixteen bay road open six days a week through Thanksgiving small ones farm dot com\nAnd then not have a way to find that he actually being out in ten and it ruins of their homes and say they have said no aid and running out of clean water act and say\nIran's revolutionary Guard Corps says it has followed several ballistic missiles into eastern Syria striking the ring leaders of the reason to militant attack in the Ukrainian city of ... Martin patients as in Beirut\nThe rain and military claimed the missile strikes for targeting the ringleaders of last month's attack\nIs that many of them were killed of windy in these strikes the b._b._c. cannot independently verify these claims Iranian TV suggested the missiles struck close to the town of ... in eastern Syria where Islamist extremists are known to all parades\nAnd they ... to Iran claim that added upset protests carried out that attack in the military parade but\nThey ... state could also claimed it was behind the salt\nThe United nations special envoy for Yemen mountain Griffiths says school to a gym to international action to stop the world's worst humanitarian crisis from deteriorating for the he was speaking to BBC in New York after meeting most of the major players in Yemen's will world news from the BBC\nMacedonia is pro European prime ministers or run so Europe has vowed to press on with a parliamentary vote to change the country was named to North Macedonia even those Sunday's referendum on that issue fails to give him a clear mandate\nGreece which has its own region of Macedonia mend objects to its northern neighbor using it\nSaid had remained commitments to dropping its objection to you and me to membership if the name change goes ahead\n\nHundreds of thousands of independence supporters are expected to demonstrate the girls the Spanish region of Catalonia later on Monday we'll mark exactly a year since the regional government be fired Madrid by holding an illegal independence referendum that resulted in heavy handed police action to stop the vote\nTroops from North and South Korea have gone to remove some of them old an eight hundred thousand landmines thought to be buried under heavily fortified border that removal was one of a number of confidence building measures agreed between the two Korean leaders Laura bigger isn't so much\nFor the next few weeks on the engineers starts in what is known as a joint security area where most of the ... century based help their sweat real eventually like both sides have more freely\nMinds will also be ... when we had rich for hundreds of soldiers were killed and intense fighting the war\nIt could be as one to excavate the site and identified the remains stocking this way so soon after president named the tanks and they summit with Kim Jong un and killing young will build confidence between north and face if they try to be chief now like the tensions along the border\nJudges at the international court of justice are due to rule later today on a hundred and Seventy years at the territorial dispute between Bolivia and Chile\nLandlocked relive your hopes the decision will force Chile to enter negotiations over transferring land along chilies northern coastline BBC News\n[noise] hello this is the talent that baby ... baby hey with sixty minutes said the best player blocks in culture conversation from across the b._b._c. coming up on the show an amendment to label pop icon Janet Jackson on making music videos like they used tape\nBut you're saying is that like ... and many K tells us he hopes being openly gay and his music will help other people Hollywood style blend sized tells us well she thinks about remaking the classic film she's talented fatal attraction but this time from the demonized other woman's perspective\nIt would be wonderful to tell the exact story from her point of view because there's so much about her that wasn't clear and it was left to people's imagination\nStreaming up New England public radio responded raw you around small ones from certified naturally grown ... with a farm standard for sixteen bay road open six days a week through Thanksgiving small ones farm dot com\nMichael ... he's hatred of pop music\nJoining me to discuss the oil that until about dad liked his projects my two guests in the studio all American author and TV created Jonathan Ames and British ... home flat yes um it\nWell let me ask you both stumped thing before we have from Janet Jackson Algerian musician\nRashid ... died last month I loved his cover of the Roman\n[noise]\n[laughter] [noise]\nYeah well for various companies old remakes don't live up to the original and we've been asking you on Facebook for your favorite ... said let me ask my GED I guess to yes do you have a favorite kind of the ...\nYeah I Do um I loved Django Bates um fashion or New York New York um yeah it's pretty it's very wild yeah it is a great cup a lot of people will be seeking out and I got you\nI Love a journey treasures rendition of the song hurt which I think it was originally ... rose more I think we're moments of self pity and we're ... made in my life the song because we do talk to voters and pour dirt\nWhat does that tell us about you join the names I wanted to [laughter] more and environment at least she's well some of you being saying on Facebook silly among the auto from Nigeria says cat is with the motel Georgian kubbeh usage says hello from Kampala Uganda says coffee in Brazil by ...\nAnd David ... New Zealand says old alone to watch how Jimi Hendrix\nSo I wanted if he might indulge us on the BBC will save us now by reading something from the extra money and I'll let you choose what you'll reaching and you could set out for us\nYes uh Lewis ours was young so lives with us centric older gentleman a very tiny dirty apartment based on my own experience at one time in the early nineties or New York city\nAnd so Lewis says just prepared some food is in the kitchen Henry's and his little room which is right next to the kitchen and so I guess I'll just jump in ... uh Lewis has just made a plate of spaghetti and then he says\nOh no there's a cockroach on my food\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard\nAnswer now in any P. R. dot net\nYou forgot the first rule of survival in this apartment said Henry without sympathy never leave food out you didn't teach me that rule I said you should have learned it before coming here don't enlisted in the military if you're not prepared to fight\nI threw the passed away and the cockroach since I'm unable to kill anything directly even cock roaches with which our apartment was infested though no one had ever been so brave estimate my food\nAfter dumping the pasta I bought some more water and started all over\nHenry From his coach told me to wash my dish an added that I should always washing my dishes before eating he explained to me teaching me some survival rules after all that are cockroaches we're walking all over our plates while we slept leaving behind an invisible trail of germs\nSo we were to wash our dishes before eating as well as after\nHe came into the kitchen and rent to play to demonstrate this special to step\nMethods first hot water to get rid of the cockroach germ she said than cold to get rid of the lead from the hot otherwise you died in New York has led into top water that you might not have learned in New Jersey\nHenry looked at me intently to make sure that I understood the lesson and then said ... for cockroach cold for less hot for cockroach code for led by God it I said well don't catch on to quickly that's the problem with staff once they know what to do they leave\nIt was a backhanded compliment but it made me feel good he didn't want me to leave [noise]\nOh I Love that thank you so much I Know that you have a boxing named hiring one because you have actually boxed into battle yeah why did you do that\nI got into the ring because I had a romantic notion of fighting you know lifting up those ropes and getting in there it was almost like when I was a child I used to\nWrap towels around my neck and pretend it was a Cape and I was a superhero show boxing was a chance in real life to play hero to and then I got in the ring and I discovered\nSo we'll one it's terrible to be hit and I don't know your I've learned a lot of a brain injury since they're not very good to be pounded in the head\nAnd then it was terrible to hit other people I I Would hit someone and I'd see their face grim is and I would say oh I'm Sorry in my trainer the course of don't apologize [laughter] not at that point of it or I should say I was called the herring wonder\nBecause at the time and I still do I ate a lot of herring\nAnd I followed it you know it's a it's a fish low on the food chain so doesn't have a lot of mercury has a lot of oils and it's good for the brain especially if you're getting hit so that blows out of the brain killed some brains out\nBut the oils from the herring build them back up so you sort of maintain an equilibrium and Disney sting well yes that was my other thinking was to have herring breath and\nTo further repel my opponent so I Would come into the ring with a jar of herring in my hands you know like a fight with spinach and then my fans in the audience were waving silver herrings\nBut then you say this is another thing I could be really good to have an ... or some way of like putting off your pain that you make some very strange noise here that goes back to your fourth grade school days ... 'cause he wound up and a little town called the Harry eight times\nYes it will in the fourth grade I was with a bunch of friends and I think you would appreciate this as a musician so we would make these sounds without it became a very loud sound called the Harry call and I'll do one\nYeah yeah and then his wife and his wife\nAnd the Mike and for the people out in the world a step away from your radios perhaps the moment but here's a here's a hairy call\nI'm going to describe ... standing almost like a Shakespearean ... oh somebody's got to really chaplain Nathan yes yes\nYes as a musician he was ... teaches tennis yeah ten out of ten [laughter] I've never had a sound\nStreaming of New England public radio is funded by you and the western mass coaching alliance offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot com\nWhich can press as his Jonathan's you inevitably to here say published by one and you'll staying with us for more than ... more music conversation now on the talent and sing at any case he's debut album language was released this month but\nYou may well no and and he came back to his writing in production on tracks like please\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nI'm trying to\nLearn about the long run you over or blind or\nBrother or\nLittle ...\nJones beach in right you don't know what I mean these are a loss in many cases never forget you know the ... and then of course a bloody by grace storms the featuring him an e K\nHuge track so\nThe guy who was involved in writing owner those films is not just to Russia and the produce about an artist in his arm rice called him in each case he is six foot five of its just flamboyant gracious talent but he's now releasing these on an album language and he's\nWith us ... billion streams the songs have done it their streams you'll\nCreativity you artistry as creative ... dreams\nWhich is where do you call this amazing what music in there I Know right but what about also something wider about you as a person and you as a ... but also a\nGay man how has that influence people to get in contact with you and share their experiences how do you think that has to change people's perceptions\nOur fingers just our dams seeing someone like themselves or at least figuring out things like they are I think is very helpful\nBut I think it was something that I I wanted to explore this time around because I was very aware as I was making the album and as I was struck and stuff out for this record that I just didn't I didn't we see someone that I can relate to\nThat will tell me that being black and gray is okay the bidding streams next to one message from someone who sees what you're doing and day message and they said thank you very much for this album thank you so much because it's helped me come up to my friend's thanks so much because it's helped me calling from my parents and I want to be a bad I mean because I see being the best year\nThat adds purpose to my career\nI felt it was it was fascinating watching the video for Tom ... and it struck me how little I see a representation of two men looking at each\nOther in that way about how much they love all the passions that they have for each other here are a kind of rare it\nIs still to stay on the so that's weird and twenty I think\nThe truth is I think that the cool thing about the video for me because I Love that they are still going back to ease the my favorite video I've ever done a intrigues me to spark conversation and I'm to open up people's minds to war I see is no more I'm Out in the ... immigrants game\nAnd then he came and he did a strict back life to foment cities try color from the new album language in this day said let's have a little bit of him in action\nStreaming of New England public radio is funded by you at all energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nGuy yes do you feel a responsibility to reveal your past life\nTo me I use my music to the selection I mix heritage and then me and my Jenny along that path and discovering hey lie and\nSay in the second ... much more of that you know music and indeed hair and that's that I Jonathan May feeling oneself and wanting to ... do you think it's a duty\nWell I don't know if it if it's a duty\nYou know not every writer has to be autobiographical or draw upon themselves but if you can write something to make other human beings feel less alone during their time on the planet like he's doing with his music than maybe there's a young people out there that can accept themselves\nAnd your music now and right now we're actually killing the tracking inhale oh\nOh\n[noise]\nYou have a cold days and performed with I mean amazing bouncing off the radio at least scratch Perry changing his police women to immediate\nQuestions that yes one once he's the flu one okay so the flu Vermont is just like the Trump pet um however it's got ... so it's got more of a mellow suffer the sound and didn't you develop who to tighten ...\nYes that's right um one day I mean I wanted to try and play the or the cool to tens in Arabic music so to me that like the the Billy's nights you know I mean ... is that the emotional titans we feel\nUm as humans and I'm the only way I could get these notes was to have this instrument created to me\nAnd want is Arabic jazz how would you sum it up it using\nOur big scales Arabic rhythms I'm I'm mixing those with elements of jazz jazz harmony and in ...\nWe had a little bit of a ... cold inhale just as we started speaking and it is from your twenty Seventeen album lot set to\nUh we'll talk about why you've cool the album that in mind that the I just wondered whether the space between the fish and the moon is a good example of some Arabic jobs how would you sum up this track I Wonder if the two main\nTitle is quite from every me poem so I'm really me was\nStreaming of New England public radio was supposed to bother you at all the energy solar helping homes businesses or the farms are in western New England save buddy it'd be a ... was solar power all energy solar dog call\nThem I find him very inspiring this try for me is the\nMost jobs and the U.S on the album but they're still element of um Arabic scales I'm an improvised nation and there's a mystery to it as well\n\n[noise]\n\n\n[noise]\n\n\n[noise]\nWe just go to ... and Jonah sending me ... me off the wall\nI I was wondering if you scored for folks because you mentioned that your food with Rubio had been drawn agreement orders Ruben become such a big composer for oil and but it was something that you've considered pills to\nIt definitely appeals to me because I Do like to associate images with sound so yeah\nThe album is called ... which means walk these the the person sabotaging he's a female ...\nYeah exactly so um it's dedicated I'm a citizen scientists while\nI'm buying my innocence epitaph semi and to me the thing is I I mean ... creative people and I suppose everyone read ... has this and ... you know the the voice that tells you a new good and so this this kind of this thing can be you know if a destructive\nAnd send me it has affected me a lot in my development as a musician\nAnd thought I found a way to sort of combat these feeling so I've given ha\nAnd name she's a ... to now and you know when she pops up in my mind I just say oh that's ... she's trying to destroy man's I just ... and it's just a really good way of some sort of ... yeah\nSo you you were born in the u._k. you grew up until about the age of nine in ... ... once in a musical influence who do you think that gave you well if there was music all around\nI mean ... there was the music and the same on the streets you know um there's a big tradition of ...\nAnd um when the ... go out to um Fisher pals they have some say what songs to encourage each child that\nShe you know to go through the sort of long John nice of you know hoping to discuss up piles and that kind of crap tend to me without me sort of realizing it until I'm I reached my twenties\nBut um my mom was a ballet Don ... and so she would play 'em ... to me um I remember her favorite um album was the right to spring\nPlus Devinsky and so it's quite a\nUm an abstract mild peace to play two young children but I loved it and my grandfather was a ... and a record producer as well so I read brown yeah and so I was introduced to jazz at a young age and yeah the musical and at the house so\nYeah now I really love the sound of your new protect ... next to me and I'm totally him near sweet am I pronouncing that correctly ... ... ... yeah I'm not named multiple ...\nYeah it some names off to I'm a greet me I Can't remember which\nIn your mind [laughter] how about that so it's a sweet\nStreaming of New England public radio is for the bar you wind up university graduate schools ... data storage rowing for October ... applications at ... dot edu\nSo there is one maybe when I'm inspired by the suffragette movement\nAnd um I take one of the anthems and rearrange it and sort of a a mangled it and and make it into my own my own style\nAnd that's one dedicated to um a lot of you to say anti un speech um when she was sixteen array of metal works with the little girl he was shot through the head but generally long yeah\nAnd it's very emotional speech I recommend yeah anyone to to watch it um it will make you cry definitely um so I've taken parts of a speech and I'm created music ... to have a voice is very um arithmetic and um\nAnd what about Saudi Arabia's only female director I saw a month to\nYeah um she's a real inspiration is a film watched a which is ... and a girl\nHe wants to bicycle I mean that journalists are always beautiful\nYeah yeah it's very touching and um so I wanted to write something I'm reflecting the S. and M. O. C. using ... skills um and I used one I'm for this one called the head just scale which I think is originally from Saudi Arabia above the a talk show\nAnd Rosa Parks and really bridges we can't wait for that to happen in the meantime if people are in London you are the ... sell them\nAt the south bank ... on the first of all tell you about bumped less ... is out now and the ... remakes is also out now um and you're staying with us like you say much yes\nOr no sister program the cultural front line this week as nations from around the will meet for the United Nations General assembly they had from a whole host of international artists including rural G are all out [laughter] be a female international secret great\nYou are listening to the ... that with ... BBC World service with me Nikki baby the wonderful Algerians bowling musician rush Pizza Hut died on the twelfth of September he was known so mixing ... brand of rhyme music in western rock and I love his ... of the ... the ...\nWe've been asking you on the BBC will step is page put your favorite cup of actions and here's what you've been saying pull ... says Annie Lennox no more I Love these Kevin pickle\nFrom ... Tennessee says down the ... blue ... of Nineteen fifty two Vincent ... lightning\nAnd thunder Haynes says I Love ... version of the house of the rising sun such a great voice and very rousing thank you all for being in touch\nYou\nMay named Michael ... one of the world's best selling bound to some like\n\n[noise] he's\nAlso accused of helping building up the connection of tens of thousands of negative yes people remember ... physical film anyway some as they say have been group together in his new book the one that adds to the the next big threat to food banks ham\n\nOne thing we know about people who listen to NPR is they're more likely to do things like voter called the representative I'm David Folkenflik being informed is essential to our democracy to support the news that keeps you in the know\nIt's time to join your fellow New England public radio listeners and paying for what you want on the radio sign up to give ten twenty or thirty\nDollars a month right now at N. E. P. R. dot net thank you\nStay with us for news throughout the night from the b._b._c. World Service this was the any PR news network WINZ am six forty Westfield WINZ FM Ninety One seven Deerfield\nWFCR eighty eight five H. D. three Amherst WN you eighty nine five great Barrington WN in Ninety eight nine ... Adams WAMC Ninety One nine Springfield and W. A. M. H. eighty nine three Amherst in partnership with Amherst College and UMass Amherst it's three o'clock [noise]\n[noise]\n[noise] is going to carry London hello and welcome to news day on the baby she was seven Tonys shop I\nHad a stake Canada the United states and Mexico have reached a deal to reform the north American free trade agreement hours before a deadline set by President Trump from Rob young for my business desk because they can't how significant this movie and\nPush I said I'm old an eight hundred people report to to have died of an earthquake and tsunami struck the Indonesian island of pseudo ... was already it's fair to pick up the could reach several thousand people have of agriculture\nAt the epicenter of this is Austin scientists have discovered that a peace process and the creation of life may have taken place in outer space time is it true that Britain is the loneliness and capital of Europe cities will\nTry and find out why that is\nMuch more coming up things for Newsday [noise]\nHello this is David Austin which the b._b._c. news the United states and Canada have reached a last minute deal on revising the north American free trade agreement to ensure that remains to try that troop packed with Mexico\nA joint statement said the new arrangement would result in free markets ferret trade and robust economic growth will grow triple\nOften more than a year on Jewish renegotiation the final text to her new NAFTA deal came at the eleventh hour in effect that have NAFTA ranch president's state to the tri ... agreement between the countries of North America\nIn particular the Canadians relented on a deal to permit us dairy producers access to the domestic market while they return they received protection from us from everybody all\nThe timing was Katie with Mexico keen for an agreement before the change of power and the Trump Administration who said wanting to reach a deal before the crucial midterm elections in November not less Canada not wanting to remain outside of free trade deal worth ... trillion dollars in return or a new trend\nAnd two ... two tickets to Hamilton from an E R you could win two great seat that the Boston opera house and dinner afterwards that eastern standard enter now in any P. R. dot net\nAnd bills to get food aid and heavy equipment to central sue the way see which was devastated by friday's earthquake and tsunami Thailand Australia or among countries to offer assistance\nRescue is a continuing to dig people trapped in wrecked buildings in the city of ... of an eight hundred people are confirmed dead mass graves of being dug\nIt wrongs revolution regard cool says it's fired several ballistic missiles into eastern Syria striking the ring leaders of the recent militant attack in the Iranian city of applause mountain patients reports from Beirut\nThe rain and military claimed the missile strikes for targeting the ringleaders of last month's attack and says many of them were killed or wounded in the strikes the b._b._c. cannot independently verify these claims\nIranian TV suggested the missiles struck close to the town of ... in eastern Syria where Islamist extremists are known to all parades\nInitially to Iran claimed the Arab sad princess carries out that attack in the military parades but there's ... steak group\nAlso claimed it was behind the salt\nThe un special envoy for Yemen mountain Griffith has called for urgent international action to the world's worst humanitarian crisis leads to ... to ... with us in New York\nMartin Griffin said Yemen was facing an unimaginable prospect that the desperate humanitarian crisis there could get much worse he said he was encouraged by their response to the UN's clarion call to avert a looming fan in\nMichigan it's also believed this crisis has focused minds of the urgent need for peace talks ... news from the BBC\nHundreds of thousands of independence supporters are expected to demonstrate across the Spanish region of Catalonia later on Monday a mock exactly a year since the regional government defied Madrid by holding an illegal independence referendum that resulted in heavy handed police action to stump for those\nTroops from North and South Korea have become to remove some of them old an eight hundred thousand land mines thought to be buried of on the heavily fortified border every move was one of a number of confidence building measures agreed between the two Korean leaders Laura ... is in so\nFor the next few weeks army engineers starts in what is known as the joint security area we looked at the guard posts in shape based it helped ... will eventually like both sides can have more freely\nMinds will also be ... when it had rich for hundreds of soldiers were killed and intense fighting the war\nIt can be as one to excavate the site and identified the remains stocking gift where so soon after president named the tanks on his summit with Kim Jong un and killing young will build confidence between north and say if they try to reach eighth now that you can change along the border\nJudges that the international court of justice due to room later today on about a hundred and thirty a territorial dispute between Bolivia and Chitty landlocked Bolivia hopes the decision will force tribute to enter the negotiations over transferring landed on ... [noise]\nTo see a season of Nobel Prize announcements gets underway in Sweden today with the disclosure of the winner of the award in physiology or medicine\nFor the first time in nearly Seventy years that wouldn't be a literature prize this follows the scandal surrounding rape charge against a Frenchman regime unquote I'll know who's had close ties with the Swedish Academy which awards the prize in literature and he's due to appear in a store code code at about the time of today's\nMets and the announcement not selections to BBC News [noise]\nEverybody was him to Newsday would county sheriff\nAnd James ... had him and the next few minutes we'll hear from Indonesia helps the devastating to nominate a sit down and that and that's why young people in Britain are the most likely in us to be ... [noise]\nStreaming of New England public radio is funded by you and small ones from a certified naturally grown fruit farm in Amherst offering Barry ... author farms down small ones farm dot com\nOr having a free trade deal that covers North America President Trump campaigned on a promise to revamp the existing do send you to lead to job losses business present rope young is here are so what's new in this\nOver the past quarter century trade between the U.S Canada and Mexico has been governed by NAFTA the north American free trade agreement Donald Trump I hate to use describes as the worst deal in us history saying it led to manufacturing jobs leaving America to us and Mexico agreed and ... Canada was playing a tougher games\nBut minutes before us imposed deadline on Sunday night Baltimore and Washington reached an agreement both sides say the new United States Mexico Canada agreement\nWill result in free markets ferret trade and robust economic growth in the region but Canada has had to give in to some American demand dumped him and he joins of trade experts adults would university\nTold me that Canada has negotiated hold on prevented us from getting everything that it wanted\nAnd Canadian team has done very well and it's like I get it pretty hard\nUm has read correctly the constraint on Donald Trump that actually pose by his own Congress and the U.S fitness I'm threat was that it kind of candidate wasn't going to play pool he would go ahead with the bilateral agreement with just the United states and Mexico\nBut the reality once he would have struggled to get three that the U.S Congress and they would've been a huge amount of pressure on him again such a bilateral deal that that's kind of outcome from his own business people that we could have not really a credible threat and the Canadians understood that\nCanada though has had to allow us farmers more access to a dairy market and this was a big sticking point ... wouldn't do this to this potential dried out I'm into this deal for Canada\nIt's very early hours were really very we haven't seen the details of the pack my understanding is that what they were the Canadians have agreed it's only a tiny bit more than they already agreed back in the days of the Trans Pacific partnership agreement\nI'm so back then they promised and the benefit of the TPP which included the United states of course access to that very market by opening up a little bit over three percent of the dairy market\nAnd my understanding is I hadn't seen the text yet but my understanding is that they're going to a tiny bit more than that but it didn't it didn't know when they're they're radical overhaul and opening up of the Canadian dairy sector that the u._s. which was aiming for the star the talks\nPoint is that is because older people are more resilient to worries about loneliness\nI think that's a really good point I think one of the things is that we know that when you're very young it is a time when people feel emotions very intensely and also this may be the first time that you felt this this painful feeling of loneliness\nStreaming of New England public radio was funded by you and valleys solar a local governance drawing roof ground amounts and do all access trackers helping households with carbon free and the four one free valley solar dot solar\nNest is temporary and that usually people get out of it\nAnd of course if you're younger you haven't had the chance to know that and when we all the people who are older to look back and we all them when they were the ... they said it was also when they were young adults so I don't think something about more life I think this may ways of being the case it was just never measured before may be used as a time when you feel more lonely and that's\nInteresting but it is going to ask about social media but you said older people have felt lonely and when they were younger but Britain is the lonely loneliness capital of your why is that what does it tell us about the culture here because I'll tell you what what what would it locks in in in London and the surrounding areas and he'll be make eye contact and that in itself can be quite lonely right\nYeah so we did all these people will if it was about their neighborhoods and and whether they would talk to people and it was interesting looking because we have people from all over the well take pause\nAnd in in nine countries in particular we were able to do more detailed comparisons and that we found that um the the UK and then and I'm from in the U.S has kind of comparable levels of letting us and India there was a bit lower in New Zealand which was interesting\nAnd we also looked in in terms of bigger regions we looked at a which countries\nAre places where people really value that independence and northern Europe has a place that would very much be the case and they have high levels of lending us in the countries where people were very independent than in the places where people tend to depend on each other more and be happy just depend on each other\nSo be independent it's not necessarily a good thing now the prime minister any this yeah told you set out tons to levy aid loneliness and social isolation with a warning that millions of people were suffering from a lack of regular contact with us which is what you were pointing to in being independent how'd you sold this though what's the strategy\nWhere we off people ... solutions they found it was for them and the closer to something as big as this to find out what is actually what for people for people they know that it is amazing\nUm number one was finding distracting activities or oh dedicating all the time to work or study all hope is next for joining a social club that also came a list of most um helpful suggestions that people make so it's not for everybody\nI'm changing your thinking to make it more positive to to look at them on the bright side of things of obviously sometimes are easier said than done\nAnd I I thought was interesting that you're starting a conversation with anyone because it hasn't got to be deep meaningful long conversations that people have that can alleviate loneliness chanting somebody when you buy your paper in the shuffle or your milk ... or whatever those little things remind us we connect to everybody else in the real human and we were in the same well\nAnd you can listen to the full results of that survey on loneliness on the health check program BBC will say this this Wednesday at twenty sassy GMT\nNow a referendum in Macedonia on changing the country's name denotes Macedonia has failed to pass the turnout threshold because it was necessary because Greece lays claim to that name I said earlier for historical reasons\nHowever they fell short of the fifty percent ... campaign to boycott the polls that any results suggest that more than Ninety percent of those who did vote supported the change it means is likely to be much a political maneuvering a head out Balkans correspondent died alone even in Macedonia capital ...\nThe result is a significant blurred for prime minister ... he'd made the main changes top priority since taking office last year\nBut a nationalist campaign to boycott the polls role of of um but no it was being devastatingly successful for low turnout which means the referendum isn't falling during the ... the boycott wouldn't derail the deal with Greece\nLeaving and started building always voted coats for the opposition I expect this huge majority of the citizens who voted have chosen the European car for mustard into [noise]\nSupporters of the boy talk comparing held a policy in front of the national assembly they said they stood up for Macedonia is right to self determination\nI Want to keep the same name for the same country wherever I go I Will be Macedonian origin\nInterviewing two tickets to Hamilton from an ... P. R. you could win two great seats at the Boston opera house and dinner afterwards that eastern standard\nAnswer now in any P. R. dot net\nI think the north would have been to the decades old disputes with the country's name with neighboring Greece which has its own region cold Macedonia Athens has agreed to drop its objections to Macedonia joining NATO and the European Union as long as it ratified the name change\nThat now looks and extremely complicated challenge but so many ... European Policy Institute says the some piece from the opposition policy luminal may yet support the name change it should not be impossible [noise]\nBe\nObjective is to drop as much as possible those confrontational amendments\nIn consultation with the opening scene will do to\nIncrease [noise] long term reports for this agreement or with the police\n... percent of those who did vote agreed with the name change NATO secretary general Jens Stoltenberg said he welcomes the yes vote on the un law shipments commissioner you'll have a song called the outcome very significant despite the boycott the agreement with Greece is still alive\nThat's needed he's gone to Loni\nNow scientists have discovered that a key processing the creation of life mate has taken place in outer space rather than us for ... compounds are vital element in the creation of DNA that they may make that journey here from ... to ...\nStuffed cloud and that raises the possibility that it's not ... yeah and they could be an eye out and protest set Ralph ... from the University of Hawaii has been meeting with fat she still ... states pulled hooking\nCompounds like full faith and die for face Kennedy phones in ... by ... temperature ... was a time wise oxidation and drawing a month or so now that the ... in in just said about clouds\nOnto ... river and the building blocks or the building with the road for a quarter systems like asteroids and comets\nAnd we also have a ... back in ancient times comets and asteroids can impact on us sort this out all the scientific facts about the parents say that phosphate and die for space in fact you can be made in deep space and they couldn't be delivered to us\nI'm going to be honest I myself I'm a very simple form of life so I'm just trying to break this down into language that I can understand and these folks fights arrived on us and viable potentially asteroids\nMade to arise comets\nRight okay and then they arrive on us and then they form the conduct pools of chemicals that we think theoretically formed the building blocks of DNA which is what roommate from\nA book is the correct\nI'll just cut to the chase boys this important and I\nWe wanted to know how would live developed and how life or or reject rights and it's you know there are a key elements for life is full of course we also want to know if the possibility that these protesters can also happen on other planets outside our solar system\n... says hey you guys I say this basically increases that the probability of possibility that life does exist in other parts of the it\nDefinitely shows that are the molecular pre ... can be easily formed all over in the universe where these conditions like low temperatures ISIS radiation and the correspondent kept microbes exist\nThat set us exciting and does it say may that fold the eighth phosphates these compounds deeds thoughts out there in the universe and then arrive on us and they were essential for creating life that in effect we're\nAll a million in some full I don't want\nTo go back to try I mean everything is alien even not even an hour or like Kevin ... on earth are alien origin I mean the house from the time so I mean I wouldn't put both sensation of on a very\nUh but this is the media you talking to the media kept them provide a psychiatrist with the\nAgency or I use that we all get lost because you're finding your I'm off [laughter]\n\nStreaming of New England public radio was funded by you and all the energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com or\nNot the professor was no danger on from there to protect us and and you saw that picture he says I might be a little bit Adam and survive that say is I think there isn't it yeah I did and you know way you come from already so complicated is like an extra\nExtraterrestrial oh am I mentioned way to start mention a let's say um let me give you just a reminder of our main stories are on the b._b._c. World Service right now ah Canada the United states and Mexico have reached a deal to reform the north American free trade agreement agreement NAFTA hours before a deadline set by President Trump\nIndonesia's appeals international help it responds to the devastating earthquake and tsunami on pseudo se and Iran says that it's his fault ballistic missiles into eastern Syria targeting those behind the ... minutes attacked when he runs the of\nFuss and the most important headlined James went definitely know a half alien all pocket and ship it adds up to this is a nice day with James ... thank you very much media companies stay with the BBC well seven [noise]\nWhat was that long so ugly in July and that led to very long can you all very will summer winter\nBut it was so widespread as well\nIt was a stationary eliminate all Nolan Europe at the same way\nI think it's also interesting or surprising that we're at the same time he weighed ... pounds and all and had a chair that we're all the way from Japan and I hate way in North America has a long tail ordinary\nUnless there was no way way and of course in the heat wave me but I think the biggest difference between for example the heat wave in Nineteen Seventy six that were big heat wave aware\nThat we're no heat wave that we're at now in Europe and now we ... we had any way to get in a law now than Europe including but not that we're also heat waves shorter one at different times over the summer and the rest of the northern hemisphere and I think that well that's kind of what we as\nWell maybe but I haven't\nThe hottest year on record is twenty sixteen an El Nino year when the conditions in the Pacific ocean put a huge amounts of extra heat into the atmosphere there was all kinds of remarkable weather event this year started out with a ... La Nina setting and I didn't mention that twenty eight team was going to be comma\nEvery year has some extremes the world is a big place after all but so many my impressions being that this is remarkable\nThat impression is absolutely correct and that's what made some are twenty eight teams so unique and so impressive\nAnd to to link to take it to Hamilton from and we are you could win two great seat that the Boston opera house and dinner afterwards that eastern standard answer now in any PR dot [noise]\nPenn State university\nIt wasn't just that there were these regional extremes in heat waves floods\nWildfires droughts um it was sort of the large scale\nCoherence to these events where they were breaking out around the entire northern hemisphere and there are some interesting connections there that may hint at certain aspects of climate change and how climate changes impacting extreme weather events that aren't actually will captured in the climate models yet\nMichael Mann is well known as the author of the original hockey sticks shocks occur off putting global average temperatures over the centuries and revealing the dramatic increases in recent decades the first version was released Twenty years ago in Nineteen Ninety eight you sign up by another dramatic El Nino event\nBut which now ranks at least nine among annual average is a food ... degree behind twenty sixteen\nBut Michael Mann admits that these global averages Ernie parts of the climate story and know the ... that matters to us\nToo often we take a narrow view and I say we\nSort of climate scientists and in our efforts to communicate to science to the public into policymakers too often we take this narrow view that climate is about averages and yes we expect average temperatures on earth to continue to increase in\nThat has huge ramifications for global sea level rise from melting ice sheets et cetera but climate\nMore generally refers to the statistics of the weather and those statistics can be the averages because averages are statistics but it can also be the extremes and so it is relevant from the standpoint of climate to talk about how many are logical extremes\nAre changing and indeed as you allude to that's where the rubber hits the road um when it comes to\nYou know people becoming aware and concerned about the impact of climate change uh there's no greater way to connect the dots than to help them understand that these extreme events that are impacting us now it isn't just about polar bears up in the Arctic it's about\nUnprecedented heat and floods and drought and wildfires that are impacting us that are unfolding in real time on our television screens in our newspaper headlines\nThat is the face of climate change this is the face of climate change\nNevertheless I thought it was to be cautious weather of some kind of group does happen every year\nYou know write that one I think what is not necessarily what we can do anything why won't do any of them are\nAnd I think this summer right this is something different something that can be quite rare and it's now Iran I think they call it and then\nNot just the fact that there were heat waves and droughts and floods and wildfires we expect those to become more frequent around the world as the world warms up a world warms up well of course you're going to get more intense and long lived here of heat heat waves\nThe atmosphere gets warmer can hold more moisture so when it does rain you get more of it at once you get bigger floods at the same time those warmer temperatures cause more evaporation from soils you get worse droughts you'd take\nExtreme drought you combine it with extreme heat you're going to get wildfires so the science there is pretty basic as I said before it isn't rocket science or as we say here in the states but what is interesting is that there may be something more than just those factors those factors we understand they're fairly well captured in the models\nWhat isn't well captured in the models is the fact that climate change may be impacting the behavior of the northern hemisphere jet stream in a way that actually causes these weather systems to become larger in apple attitude and to get stuck in place\nIn the high struck the jet stream wins one reason the Europe stood baking for so many weeks they also put another high over Siberia with high heat that an over North America where the most dramatic effects were extensive wildfires in British Columbia Canada\nStreaming of New England public radio was funded by you and bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu says Michael Mann\nCalifornia it's getting warmer and warmer it's warmest summers have been the last few years um it's getting a drier and drier in part because those weather systems are getting pushed to the north denying it the winter precipitation that would help suppress\nUm the summer droughts uh so you know you've got a drying conditions you got warmer conditions and all of that uh feeds into the potential for worst wildfires in what we saw happen for I Would say the first time\nWas the disappearance of the notion of a fire season used to be that summers fire season to California Winter isn't now California appears to have a perpetual fire season because the worst wildfire it ever had seen as of last winter was\nThe Thomas wildfire last winter in Southern California only\nThis summer did we see an even worse wildfire in in the Mendocino Complex fire in northern California and some of the other wildfires that broke out so California now has in essence a perpetual fire season and that is an indication of the the profound challenged the climate changes already\nPosing to us from our historic emergency largest fire California now bigger\nPiece of\nConditions lived inexperienced find many acquaintances Davidson a fire experts at the University of California\nCompounded the tree stressing effects of long term Trump was enough rain in northern California last winter to stimulate a surge of bras gross to add an abundance of drawing on the gross which fueled far storms\nAnd some parts of California we had a hundred and eighty percent of normal for graft production so I think a lot of fire people were thinking\nYou know that's just isn't looking good and all it's going to take is an ignition on the right day with the right whether to cause a real problem and so when the Carr Fire started I was over here I live on the coast and suffered from some of the hot weather and things like that but\nPretty immediately that fire was raising hairs and my husband actually went over and worked on that fire and um I I think we we're all feeling tension that we're not used to feeling around fire in California and we've had it you know the last\nTen years we've had unprecedented fires almost every every year every other year but the Carr Fire felt different\nBecause ... affecting a major residential turned walls in itself trying to find but the big one was the fine in the Mendocino hills actually a pair of funds started on July the twenty seventh and ... only finally confirmed extinguished last week\nThere was the ranch fire and the river fire and those were burning nearer to each other on the north and west sides of clear lake which is one of the largest lakes in California\nIt was during the height of the summer so the hottest days over a hundred degrees solid winds blowing to those areas it was just all the right conditions for fat tire spread and extreme fire behavior and so the fires grew so quickly\nThey were sometimes burning twenty thousand acres in a twenty four hour period or or more maybe\nThe the rate of growth made it very difficult for cruised to to get a handle on it and they ended up burning four hundred and ten thousand acres and I we all have heard that that's the biggest fire in California history I think that\nThe next biggest was last year in Southern California at two hundred and eighty thousand acres so a very large area\nOf course is not just being heat waves and fires while California bunt in Canada south India they have the worst monsoon fighting in a hundred years\nMiles safety officer she'll say otherwise ... century [noise]\nAnd you're doing two tickets to Hamilton from an e PR you could win two great seat that the Boston opera house and dinner afterwards that eastern standard enter now in any P. R. dot net\nAll those the marketplace New England public radio is the network that brings you marketplace every evening and right now they're asking for your financial support your ten or Fifteen dollars a month may seem small\nBut it makes a big difference your sustaining gift combined with those of your fellow standards all add up to a big impact over time and that impact turns into stories and programs on New England public radio so please help doing on public radio thrive to deal with your ongoing monthly gift\nSustain the future of excellent radio\nStay with us for news throughout the night from the b._b._c. World Service this has to be any PR news network WINZ am six forty Westfield WINZ FM Ninety One seven Deerfield\nWFCR eighty eight five H. T. three Amherst W. N. N. you eighty nine five great Barrington WN nine Ninety eight nine ... Adams WAMC Ninety One nine Springfield and W. A. M. H. eighty nine three immersed in partnership with Amherst College and UMass Amherst\nIt's four o'clock [noise]\nComing up off to the news on the b._b._c. World Service it's hard to talk with me is the ... the old ... inches in European politics are crumbling votes has seen fed up with the long established supremacy of the policies of senator right and center left\nThe politics of identity in rural and motion and fueled populist insurgencies from Italy to Sweden to Eastern Europe mostly it is the ... the last in the Senate and\nWell my ... Greece's radical leftists finance minister at the height of the economic crisis and an advocate of a new global progressive politics civilization is in the streets\nWere experiencing a new book more than ... Ninety instead of this moment\nThe liberal establishment has made the ... that's ... ... talk after the news\n\nHello this is David Austin with the b._b._c. news the United states and Canada reached a last minute deal on revising the north American free trade agreement to ensure the remains of tries actual packed with Mexico\nA joint statement said the new arrangement could resulted in free markets Sarah trade and robust economic growth will grown reports\nThe timing was key with Mexico keen for an agreement before the change of power\nAnd the Trump Administration who said wanting to reach a deal but for the crucial midterm elections in November\nNot less Canada not wanting to remain outside of free trade deal with over ... million donors in regional new trade the Canadians relented on a deal commits us dairy producers access to the domestic market won in return they received protection from us from everybody else Perry\nEngine easier has called for international help because it's scrambles to get food aid and heavy equipment to send troops in the way see which was devastated by friday's earthquake and tsunami rescue is a continuing to dig could people trapped in wrecked buildings in the city of ... who\nWill than a hundred people are confirmed dead but that ... is expected to rise from pannu Rebecca Hinch\nFading says hey Sal hills voted off everything satellite camping out fast Heinz\nFace face to face a knee pain horse hats pain than a decade maintains a apps and many of them made it kind of shocked because of\nPeople say wait a minute if it does have for us\nAs painful as living shop for\nIran's revolutionary Guard Corps says it's fired several ballistic missiles into eastern Syria striking the ring leaders of the recent minutes into attacking the Iranian city of clubs motion patients reports from Beirut Iranian TV suggested the\nMissiles struck close to the town of ...\nIn eastern Syria where Islamist extreme ...\nStreaming of New England public radio is funded by you at all the energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nSad princess carried out that track in the military parades but\n... state group also claimed it was behind the salt\nThe un special envoy the Yemen mountain Griffin has cooled for agenda international action to stop the world's worst humanitarian crisis from deteriorating says that\nHe was speaking to the BBC in New York ... to me the most of the major players in Yemen's will ... said he was encouraged by the response to the UN's warning the looming famine and set it focused minds on the urgent need for peace talks last month the rebels who the fighting the Saudi backed government failed to attempt discussions\nIn Geneva will news from the BBC\nSo says truths from the north and South Korea started to remove some of them old an eight hundred thousand land mines along the heavily fortified border on the south Korean sites that began in the portion of the border where most guard posts and troops are based\nOn mine removal is a key confidence building measure agree when the two Korean leader Kim Jong un and president Moon Jae in Met's last month in Pyongyang\nSeparatists in Spanish region of Catalonia have been blocking a number of road and rail links to mark the anniversary of last year's ... referendum on independence\nDay to hundreds of thousands of pro independence supporters are expected to hold rallies across the region Spain's central government has offered to catch it on the chance of a referendum on greater autonomy but not on independence ... separatist government has rejected the proposal\nScientists from the inside governmental punted panel on climate change is starting a week long meeting in South Korea to finalize a report on how to prevent global temperature from rising by one point five degrees this century the details from ... McGraw\nThis report just have to be the most critical and controversial study on climate change in recent years it's critical because PCC scientists say that without rapid cuts in C. O. two emissions and to switch to renewable energy the chances of keeping temperatures from rising more than one point five degrees will disappear\nThe study will be controversial because it also suggests the use of unproven technologies to remove carbon dioxide from the atmosphere these efforts will be worth it say researchers as it will save millions of people around the world from rising seas\nThe international court of justice is due to ... today I'm Alone running territorial dispute between Bolivia and Chitty Saddam dropped ... hopes the decision will force Chitty to enter negotiations of transferring landed on\nChilies northern coastline BBC News\nWelcome to hog talk on the b._b._c. World Service with me even second my guest today is an academic who got sucked in the front line politics and emerged with a host of scars to show for it\nYeah and that's Varoufakis was in the column is known for his radical critique of the global capitalist system\nWhen he was appointed finance minister of Greece in early twenties Fifteen it was a time of extraordinary economic crisis in his home country Greece was saddled with virus that's an economy in the recession and international creditors in no mood to cut the Athens government any more slack\nVaroufakis adult today defiant radical responds which infuriated in Germany and the EU institutions and when the final showdown came Varoufakis was forced out the Syrian Government in Athens bound to you and I am air pressure\nAnd Greece avoided bankruptcy and and ignore him and he has exit from the euro\nThree is on Varoufakis is still trying to persuade Greeks and the wider world\nThat the EU and the global capitalist system need radical progressive reform\nBut right now it's the populist right rather than the radical left that seems to be harnessing popular anger and threatening the status quo so it's the left losing the argument well yeah and as far as ... joins me now\nStreaming of New England public radio is funded by you and the western mass coaching alliance offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot com\nPolicy which you are determined to make a false in Greece and in Europe but would you accept that as a radical leftists they tied in Europe the tied to popular opinion is running against you\nAbsolutely civilization is in the street where experiencing a new post more than ... Nineteen thirties moment\nThe liberal establishment has made the missiles that they have been insisting on policies that are failing left right and center and they are crumbling the Weimar Republic thankfully not with me but I'm sure it's on the states yet\nBut we have the national news can you'll fascist international let these rising across Europe look at this heavy phenomenon intervene someone we're losing the battle and this is why this is the time today group\nAcross a broad alliance of progressive Democrats sleep ... left wing goes the ... the hearts\nBefore we drill down into the detail about analysis I Do want to ask you whether you think it is justifiable to\nAs so many progressive left us to use this trove about Europe today looking a little like Europe in the Nineteen thirties the historian\nNeal focusing addressed that very reason he said this absolute known since it's so lazy because if one just takes one example lettuce you've just mentioned Mr solving a utopia throughout New York fascism the truth is that since ... came to power and I spoke to him the other day on all talk he actually\nThat the people in Europe who appear to connect with so many of the vote is you're right\nThey said why we want you to the left addressing the issue of\nReason why some of us great the democracy movement which seeks to be a movement bringing together not just the left but also lead but I was even progressive conservatives those of us who are eager\nTo agree on that leave a booth credible progressive agenda here this is why we created damn twenty five because we do not believe that the left has what'd you say could I I just described but let's say you're buying program is very good point you made the point that these important the combined two things and motion Russian and\nAnd this is what we tried to do what we say to the people who are new to buy the nationalist not able to secure borders of the on the my good and not the one sure why don't you say to them well what we say till they were genuinely cannot see emotional level headed that means we need to take our country is back\nWhen he gets out pounds back but to get our towns in our country is back we have to get out of here of back because\nProblems with private um mortgages with a public way lower levels of investment in good quality jobs and ... of labor markets and they can not be sorted out that the level of Italy or the lay of level\nStraining of New England public radio is funded by you and they passed university graduate schools asset applied data science at rolling for October twenty second applications at bay paths dot edu together and have a program\nSo then I'm Sorry that that level of actually ... is really important so you are a multilateral it's been for all of your critique of the e you when you were finance minister you seem to be saying we still need sort of multilateral even global is solutions and I come back to all of this stuff about\nGlobal greed investment programs global\nFair trade deals global minimum living wages impose\nLeaving you talking to somebody who bought ate it up and down this country before the gym to hasn't and sixteen I defend them and I complained feverishly against ... favorite already may even though no one can accused me of being a lap dog in Brussels\nBut my point is why you're saying that ... of June ... with the spirit of the times people are thinking very much it seems in terms of nationalism in terms of their borders their security and Hillary proposing all of these new multilateral extremely\nAmbitious who\nShould accept the ... that would work\nIn confessed and directs the positions of the kind of this ... they would work well on debate let's have a debate about what is on the table by the way I Am a click I borrow from the best\nYou mentioned the ... the national guard and so that's my idea this was John Maynard Keynes in the bedroom lose confidence not for the phone was motivated\nBy more directly but that's what we must do similarly if I waste\nIs we we must do we've just as much as they tend to be the problems facing the European Union because frankly have a democratic deficit west so they don't recognize legitimacy I mean you institution but hey you let me I'm Out we being some sort of a global institution that somebody's own currency who who uses we\nLet let me ask the question in ... in our movement is going to stand to the European Parliament elections into again to stand in Greece what kinds of stand with our friends and colleagues in that in the middle of the time that they thought they were going to stand in Poland with a feminist to lead to\nPolitical progressive particles that are some we're going to Iran in elections in it again for the evening that's who we are and our challenge is how to create and not at the end of inclusiveness I knew that this completely human they stick on the nationalist and ended\nUp not targets and you just laid out that you're going to fight in elections on as let's face it you said you're a Democrat you're going to pull\nThe wool supposed to talk and I respect that but if if one looks at current polling\nAnd you say well when you you'll why the movement has been around for a couple of years but you on you so the fact you'll\nScoring virtually zero in the polls will let that pass and they're owned by the way and get a ... will let you know listen bankrupt lead for one thing that I Want to get to is this the only country in Europe right now where\nThe laugh in its more radical form is actually doing well or at least gaining traction with a significant part of the population is in the United kingdom this so wanting me can you know the u._k. very well one in your view makes Jeremy ... labor party different\nFrom so many of the other\nLeft movements in Europe and across the world today\nWhat but it has had to do with it because ... has been a slap in the face of progressive ths independently of what their view about bricks that is what I mean I was gonna say labor policy view and breakfast is extraordinarily confused so I I well you sound fusing issue if you're not confused when you're facing a confusing issue you're fanatical but\nGiven the Kobus position on bricks that remains even off the Labour Party conference unclear I Can't see how bricks it can be the driver of the momentum undoubtedly you\nSaid it was it create the ... and in this country\nThat British democracy and they throw in the world and not be taken for granted it means to vent it let's look at look at the the bright side this gives the people who have written and unfortunately they do what do you consider their best\nStreaming of New England public radio is funded by you at all the energy solar helping homes businesses at firms in western New England save money and the environment with solar power all energy solar dot com\nOr a recognizing that the last fifty years of privatization of moving towards a business model that effectively tied to the economy's growth onto bubbles on the housing bubble and on the city of London and he's causing any assessment of they\nEven within it already is interesting and so you would say because you talked about last a generation of politicians in the u._k. who in your view played that sort of neo liberal economic ... you would say that Tony Blair was in no way of left of center politician would you\nWhat this with me on the one hand he was because he gave a lot of money but the actual health service money that they thought they said stop the national health service off but at the very same time he did it by aligning himself fully with the city of London turning a blind eye\nTo the private money ... thing of the private banks and creating the circumstances that lead to because I was in an eight and to the collapse into thousand inmate\nSo we bought I'm getting too is that the John Macdonald ... the the current shadow chancellor of the exchange or here in the case has made a big speech where he's painted a picture of a radical economic program including just one example\nThe man the tree imposition on business in the u._k. of a need to have ten percent of ... given to the workers in the company the dividends would then go to those workers and\nThat would be a cap on the amount of David and to be received by each work on the access beyond that would go to the government so it would actually be a huge new corporate tax it would fundamentally change the relationship between the state and the corporate sector in the u._k. in a very sort of left of center way\nDo you really believe the British people are going to vote\nFor that I think so and I'm very glad to have hut or John Macdonald put forward there have been proposing to McDonald about the program we eras things you've been saying society proposing precisely that\nWith one difference I've been proposing the creation of a social fund where that ten percent of the shadows after every ideal or capitalizing by corporations go into the public will fund and then the dividends had distributed to the former universal basic dividend\nWhereas the ... the A's leaving them up amongst the workers with any of those corporations but what I think is very important to remember this is not even need the money factor yet this is part of the Labour Party conference in may go into the manufacturers hope it does it is a very interesting discussions though that we must have even thought this must have\nAbout the divisions between competent labor but it differently saving once upon a time when and that sort of both the machine that machine belong to the doctor list and then the doctor who claimed the profits of the machine produced for the company\nBut these days of Google and Facebook\nWhen every time you such and your Google Search engine for something you providing capital to Google and no one is getting a defense for that except for Google we have to concede that property rights over that intensive capital and live that everybody is the only party in the world that he's doing these okay\nSo for you definitely UK labor party represents a beacon of hope but throughout this interview you've been saying we must do this we must do that and I've been pointing out that actually in the real world and the world of politics and opinion polls your ideas are not gaining very much traction if we leave side of the United kingdom so I disagree with you is\nIs there any way I look at some point say to yourself you know what democratic politics doesn't what we're going to find new ways one labor MP ... say she said recently there's no such that we need to topple the government and we can't do it at the ballot box\nWe will do it with a general strike by working with the trade unions is that you kind of full of the ... the last time I checked illegal immigrants hunting is right now that your view on when you kind of politics needs to go\nWhat freshly let's be clear to because these are dangerous times with their eyes off by extremists around the world and we have to be very clear in our language and the and the way that we support democracy so to answer that I Am going to quote from which some church for\nThe Democratic process is a pretty awful it's pretty nasty but it's the best of all of a sudden there's and we have to be prepared to defend it\nStreaming of New England public radio was funded by you and all the energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nWe're gonna come back to all of that in just a moment George stay with us or\nChina has general worries of course one of them is this debt problem and it's often brought about which seems to have been the result of massive infrastructure projects that have been going on all over the country this time last year I visited one of them showing and it's a massive new\nCity that's being built to provide most space for overcrowded and polluted to Beijing the government wants to build a ... an enormous new economic zone just south of the city\nA new clean and green second capital\n[noise] show again a millennial plan of national significance as trying to enter a new era showing showing the attention of the world [noise]\nWhile I was a promotional video that was created last year to promote the show and project that was supposed to take place\nThis new city was supposed to grow it but just five years a few months after that to the video was released I went to see this by myself my report for business day began with a ... from young ... to us banks professor of Chinese city and regional planning\nTo begin with talking about one hundred square kilometer but then they are talking about in the next twenty or even longer term to salvage square kilometer so that's really huge in terms of a geographic website it's bigger than the existing Beijing and what's going to be in it\nAnd talking about lots of functions to be be centralized from Beijing for example made okay to universities as state owned businesses some of the government to sectors and all the public service [noise]\nBack in shown in itself I stepped into the offices of one of the many local consultancy he's aiming to cash in [noise] a couple of green tea show way told me about a consultancy that have set up to attract businesses and cause is planned\n... more than one state owned enterprises with around here and countless private companies here\nIn five months you've had more than a hundred new companies it sounds extraordinary what is the ... when will this city bill\n... to ... to finish the construction in five years and then of course on track or be as large as one hundred square kilometer top or you're going to get rich as a result of this\nOne way to [noise] yes I Know\n[noise] he's saying that with a twinkle in his eye [noise]\nStreaming of New England public radio was funded by us all energy solar helping homes businesses and the firms in western New England save money and the environment with solar power all energy solar dot com\nOn hand where exactly easy [noise]\nWhile we just um [noise] because [noise]\nWe we can talk\nAnd I'm looking out across\nGigantic brown seal\nBullet land up close to me has been shown up it's been\nMentioned it to stop the dust from blowing up in our faces [noise]\nIt's clearly the start of some kind of construction but\nBecause up so it would be nothing here [noise]\nBy that what's your name your with the UAW a private construction here in this area\nWhat are we looking at here what is going to become a what'd you\nSay to the construction area a temporary official I'll say it\nBut when we are going to be able to get ... nobody knows because we're waiting for the instruction from the garden [noise]\nSo this has just been flattened this area but right now nobody knows\nWhat exactly is going to have [noise]\nBut you think it'll happen some and some ... I Believe\nAnd mind our party made decision\nThings will happen whose land was this before\nDoes have a better place was used to be really just\nWhat happened to the villages\nWas last year I Will you go we\nWith that he wrote an nervously hopped into a car unfinished talk of full three locations around life in this area villages evicted from their homes phones with little or no compensation perhaps the real question\nIs what ... is full will China actually deliver on the dream of shown and the new green city professor ... again from the University of North Carolina\nThis is a really top down planning project in that practically the has high profile\nYou have studied over the last two or three decades all of the range of these infrastructure project caliphate yeah and there's another one isn't it a port in northern China championed by Hu Jintao is a former prime yet but it's come to nothing I mean there have been white elephants was well a success stories in China\nYeah Charles they didn't want to become an ecological zero there's sort of emission poster child but it didn't really succeed are there are many reasons behind it\nBut a shoreline this case just keep in mind that we didn't the next couple of years I think the government definitely has the capacity to relocate many of the state owned business is\nTo this new area so it's a little bit different from the other big new projects in China this one is really to be top down\nPrevent the young film and that report came out a year ago nobody seemed to be happening just then since those days they government has issued more plans for the development prove that does seem to remains slow the\n... city planner for ... and you district uh he he ... he's the city planning gee he said that they will range of environmental problems in the area including a high flooding risk and poor access to transportation this is what he said in the speech\nIf these two problems and not to be solved it would be like building a ... tip what meet the ... the government brought up for this new town\nWell Gabriel will ... is the Shanghai bureau chief for the Financial Times he went to the site recently this is what he so\nDefinitely still early days for this mega project I visited when we're just completing the centerpiece of the first day the film on public service Centre and that kind of many virginity include\nElectric cars charging stations and sensors are based on that recognition twenty thousand sensors around the city is a future hotel that would include human being free checking\nStraining of New England public radio is funded by you land a western mass coaching alliance offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot com\nGerman answer and where are you still feel to lead an elementary surrounding yeah Dan Charles Center\nWell George magnet is still with us to discuss if indeed the wider infrastructure plans of the Chinese government\nI'm Joe ... thanks again this is the point is that China has this record has done for twenty thirty forty years it's been just spend its way through rocky times it will spend money on the big planning projects and it's gained a large dividend out of doing that\nIt has a historically um something changed in a two thousand eight actually as the financial crisis in the west started to send ripples through China um\nAnd uh it was actually a time when the Chinese economy itself was actually going through a little bit of its own kind of tipping point\nSo really what's happening in the last ten years in particular I Would say about the the Chinese government has actually relied on infrastructure for two reasons one to offset downturns in the economy so every time the economy looks like it's looking a little bit worldly\nI'm you get ... to build more infrastructure and to make more money to infrastructure projects in provinces and local governments\nAre on the other is because they they really believe this um the rhetoric about a ... and leads to you know better growth edging huge contentious issue because some of us believe actually the sequencing works the other way round that actually you get better urbanized ... from having good growth model\nCars actually if it was a simple then everyone needs for groceries just build ...\nPlus of course is the last ... a declining yields from building more things you can't go on building things forever and it wasn't always give you the same time that it did it the ...\nYes indeed I think again you know like so many things in China to everything is so new on so if you look at China's a residential buildings and its infrastructure head of population of course it's still some way behind Japan\nA soul in in Asia or you know American cities in European cities but um you know as little kinds that kind of famous British economist wants that in the long run we're all dead\nAnd what we have to be concerned about really is about them is allocation of capital in the short time which actually can lead to you know empty apartment blocks ... and I'm actually quite a lot of problem\nAnd it can also leader goals to huge amounts of public debt where how biggies Chinese public debt well\nA ... it is about ... at the end of two thousand and Seventeen was around three hundred and Seventy percent of its national income which is just over three times as big as it was ten years ago\nI thought it was like a very big number it is a big number I mean we don't really know to be fat whether that there is any magical number at which point you know a crisis infuse but certainly the the miss allocation of resources\nI bought mine moving around\n\nTerry Gross the host of fresh air\nWhen you get to an A. P. R. here supporting trustworthy journalism and supporting substantial gauging and we view in conversation on\nThis independent media outlet is only possible because can eat ... our listeners choose to become members\nSaid thanks for giving to New England public radio and NPR dot\nWe'll have more news from the b._b._c. World Service coming up followed by MORNING EDITION at six\nThis is the NPR News network WINZ am six forty Westfield WINZ FM Ninety One seven Deerfield WFCR eighty eight five HD three Amherst WN you eighty nine five great Barrington W. N. N. I. Ninety eight nine atoms\nW. A. C. Ninety One nine Springfield and W. A. M. H. eighty nine three Amherst in partnership with Amherst College and UMass Amherst it's five o'clock\n[noise] [noise]\n[noise] and I am in London five AM in Washington midday in Nairobi this has been Damon at the BBC [noise]\nIntimate just disaster agency calls for international help to search for survivors on the island of sort of way they live from one of the country's official\nCondition as to what I think the president declared that open for foreign hates us from other countries over the state of the ... to help\nCanada and the U.S region new trade deals to replace not ...\nI'm from Canada and I can tell you that she is in milk products are very expensive there was no need for them to be as expensive as they were you come to Europe and you realize there's all these amazing dairy products that Arctic expensive\nIran launches missiles into eastern Syria in retaliation for a terrorist attack in the military parade last month and Macedonia is referendum fails to endorse countries new name those stories off to the news [noise]\n\nHello this is David ... with the b._b._c. news\nIndian easy as disaster agency has appealed for more heavy lifting equipment and trained to rescue workers\nTo help in the search for survivors on the island of pseudo way see a powerful earthquake and tsunami destroyed large parts of the items coastline on friday and many areas outside the main city of ... have yet to receive any help\nWe own a local hotel in Palo told local media the screening could still be hug from beneath a rebel but maybe quick meant was available to dig deep Rebecca Hinch ... sent us this report\nOne vibe it fishing villages were and now piles of rubble April ... smashed together with ties in boats thrown around in a way\nTo find that he sleeping out in ten in the ruins of their homes and said they had received no age and I'm running out of clean water ... and ...\nThe United states and Canada have reached last minute deals on revising the north American free trade agreement to ensure that remains to try not to a packed with Mexico a joint statement to the new arrangement would result in free markets ferret trade and robust economic growth will grow reports\nThe timing was crazy with Mexico teen for an agreement before the change of power and the Trump Administration and wanting to reach a deal but for the crucial midterm elections in November\nNot left Canada not wanting to remain outside of free trade deal with a trillion dollars in return Iran you're trained the Canadians relented on a deal to ... us dairy producers access to the domestic market while in return they received protection from us from everybody else Paris\nIran's revolutionary Guard Corps says it's fired several but as to\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit farm in Amherst offering berries pairs implies that their farms down small ones farm dot com\nUkrainian city of applause Martin patience reports from Beirut Iranian TV suggested the\nMissiles struck close to the town of ... in\nEastern Syria where Islamist extremists are known to all parades and issue late to Iran claim that Arab sad princess carried out that tact in the military parades but these ... state group\nAlso claimed it was behind the salt\nThe un special envoy for Yemen mountain Griffith has cool Trojan to international action to stop the world's worst humanitarian crisis from deteriorating for the\nHe was speaking to the BBC of to me the most of the major players in Yemen's will Mr Griffin said he was encouraged by the response to the UN's warning of a looming feminine and said it had focused minds on the urgent need peace talks\nOf bumps and who the rebels who are fighting the Saudi backed government failed to attend discussions in Geneva but Mr Griffin said he was hopeful he couldn't convene another meeting within weeks\nWe're news from the BBC\nOfficial Indian government figures show that's been a sharp increase in the number of pedestrians killed in traffic accidents as he's fifty six pedestrians were killed every day in ... Seventeen and increase of sixty six percent in four years\nIndia's road to solve the most dangerous in the world with an accident taking place every four minutes\nTroops from North and South Korea have begun to remove some of them old an eight hundred thousand land mines so to be buried 'em they're heavily fortified border they remove who was one of a number of confidence building measures agreed between the two Korean leaders there were ... isn't so\nFor the next eight weeks on the engineers starts in what they've known as a joint security area we looked at the ... hit based it killed ... will eventually like both sides have more freely\n... when it had rich for hunger just so just about killed and intense fighting the war\nThat they can be as one to excavate the site and identify that inane stocking gift wet so soon after president named the tanks on a summit with Kim Jong un and killing young will build confidence between often say if they try to be chief now that you can change along the border\nSeparatists in Spanish region of Catalonia have been blocking a number of road and rail links to mark the anniversary of lost his disputed referendum on independence ... illegal by the Spanish courts those disrupted in to the high speed rail service into drone and several central streets in Barcelona\nThis season of Nobel Prize announcements gets underway in Sweden today with the disclosure the winner of the award in physiology or medicine\nAnd for the first time in nearly Seventy years they wouldn't be a literature prize this follows the scandal surrounding a rape charge against a Frenchman who had close ties with the Swedish Academy which awards the\nPrize in literature the physics prize photos on Tuesday that's that I just BBC News [noise] [noise]\nHello you're listening to well update from the BBC this is Dan Damon Iran is fired rockets into Syria or the group it accuses of attacking a military parade last month blames Arab states including Saudi Arabia for backing separatist rebels\nWould explain that in a few minutes time or we begin with the aftermath of friday's earthquake and tsunami which at the end of the ways to an end to the rescue efforts continue in the worst possible conditions [noise]\nRescue teams have been working ... to find survivors\nDenise in President joke Dodos admitted there are many places where the evacuation couldn't be done because of the absence of heavy equipment current at the death toll is it over eight hundred that's expected to rise [noise]\nHere's a man speaking to us about the lack of any official warning from bill forward to that an earthquake was going to take place so\nI must say that God gave the there was no warning\nStreaming of New England public radio is funded by you advocate that university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nI stayed here to save a child that was alone and pray to God I was strong enough to save him it was the second wave and destroyed everything I was thrown around in the waves and clung to mango tree\nWe haven't received any eight here there was nothing from the local central government absolutely nothing no one has helped us and we really need fresh water food and clothes that's what we need because he lost everything\nIn the town of ... survivors are sleeping intense summits the ruins of the communities they're running out of clean water and food that too and does this dumped explains the policies of the people killed by the tsunami needs to be dealt with as well that is that there would\nBe wanting to wait to see family arrived to bury them but now I think we'll have to bury them in mass graves it's very hard on as a medical worker I'm used to things like this but this situation is extreme we really limited in what we can do here we're running out of the basic math and\nWell let's make now to Jerome Robbins who's from the BBC's Indonesian service the situation continues to be dreadful are there are places which still cannot be reached\nYes very true in fact a free of the region sees a dingo lights than from\n... from Palo and also ... also in in the eastern part of follow the communication is still collapsing and uh we can reach a to that area but some\nOf the um\n\nComing up on our program Canada the U.S and Mexico reached a new deal to replace NAFTA who's gaining from that was pick apart the new agreement\nThere's no need for that dairy sector to have been protected in Canada for as long as it was and I think that's an actual achievement on under the new agreement you can describe it as a win for the U.S is but I think in the long term it will be waiting for Canadians as well\nMore on that coming soon and uh headlines now the Indonesian authorities are scrambling to get more aid and rescue equipment\nInto the ... the way say following the devastating earthquake and tsunami many bridges and roads are down making it harder to reach the affected areas Iran says it's fine ballistic missiles into eastern Syria will have more on that and just a moment and so says soldiers from North and South Korea have gotten clearing land\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and\nDinner afterwards that eastern standard\n... any PR dot net\n[noise]\nThis was done diamond in London Iran's revolutionary guards and others this morning but they've hit back against the ringleaders of the reasons Mitt listening to talk on the radio Institute of across\nRussia\nLimits are a little girl I live on the radio TV the writing on them is all done with America done with Israeli gone with the royal family in Saudi Arabia and there was a map showing the August ... come out of Syria [noise]\n\nWe're trying to push a military parade off it was one of the deadliest in Iran decade [laughter] I've been speaking of all these other issues among residents voted with the Americans start to become so she edits his flows pulled Iran ...\nThis morning the Islamic Revolutionary Guard Corps launched about six I'm short range ballistic missiles into Syria they claim that this is in retaliation of dialogue terrorist attack that killed about twenty five people and um [noise] um the province of Kurdistan\nAnd typically are the laws parade was actually part of a bigger prayed throughout the country that mark the anniversary of the Iran Iraq War so it was the Rania\nIranian celebrated it as a Memorial Day essentially so the attack was I'm a big deal in Iran it was a second terrorist attack Iran has seen in the past two years so it was interesting was saying that they were actually launching missiles and retaliation\nWhat's worth mentioning is that last year when there was terror attacks and tear on twin terror attacks a week later the IRGC also launch missiles into Syria and that also happened a week after so this is actually the second time we've seen Iran launch missiles in retaliation for terror attacks\nOn who is the target to the very thing they are targeting in response for about ... [noise] um\nI I think it's also worth mentioning is that initially the blame was put on ... separatists groups\nAnd one group did specifically come out and say that they were responsible for it not done themselves who are based in Denmark but their group inside um Iran and Iraq was responsible and that they had not given the okay so that's very interesting to know but at the same time the Iranian government has been putting\nThe blame on the U.S Saudi Arabia Israel and the United Arab Emirates and they've been saying that they've been back in the separatist groups\nAnd that they've been backing ISIS is so what this attack supposedly according to what we've been reading on state media is that they were attacking text fury terrorists which is essentially another word for ISIS\nAnd it seems that these were I'm focusing on ISIS strongholds in Syria and this is exactly what happened in June two thousand and Seventeen when they did a similar launch in Syria\n[noise] totally submitted above the ... national resistance ... wrote that one as you say to split Iran all the I think for most people this will be a new name\n[noise] it's a new name for a lot of us as well focusing on Iran or a lot of these separatist groups don't do not have much back backing from the Iranian people\nAnd there are at least half a dozen of them that exists now um there was even as it is an initial conclusion about which I thought the group it was and so um I think that by throwing their accusations that way and also finding that one group had said that they're responsible the Iranian government is able to actually\nCrackdown on more of the activists inside of Iran the act Arab activists um [noise]\nThe sudden the activists in Iran and I think another thing that's worth mentioning is when you think of as far as people tend to think that it's a Sunni majority promise when it's not there actually Shia so for them to\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit farm in Amherst offering berries pairs and cause other farms down small ones farm dot com\nAccurate it would mean that they're backing these shapes um groups within Iran which would be very interesting angle to take on although historically they have had some instances like in Yemen during the Nineteen seventies when they heard these are backed by Saudi Arabia so we didn't exactly be unprecedented\n[noise] and that's the way things are too how diverse who's from the Atlantic council you know this new world updates from the BBC\nThe first lady of the United states millennial Trump's traveling to Africa on a diplomatic and humanitarian visits a first time\nAnd that kind of mission of the main focuses on the wellbeing of children or be best initiative and her first stop is a car in Guyana then she'll go on to Malawi Kenya and Egypt joining us from Accra is Elizabeth art form a gun I on the minister of state thanks for being with us on boiled updates [noise]\nWhat do you hope Milan here can bring\n\nBring I'm not sure I'm just hoping that um she would see that China and Africa in light of that she doesn't know and that would be able to talk about it tested in a positive manner [noise]\nWhat are the kinds of things you would want to see to demonstrate a positive message well\nPeople had a\nDynamic and wanting to improve upland apology or the lights all the time and that people here that young people in particular are\nAnxious to be accepted than to do things that will make them competitive in the rest of the world is so that they can\nBe ... regarded as a normal part of the world and people are not looking to\nThe rest of the world to feed them or to look after them but simple it to be able to treat to be able to improve I put in our political life that's the kind of thing that we would really\nBe I'd if she would see as hint that life is you see that ... is that really would be good\nBecause that's the question isn't it hot will she be received we know that President Trump her husband said things about um I'm not going to ... the whole thing but you know as the mold countries\nAre earns a gives an indication that the people from Africa or not welcome\nIn the United states the same time she's the acting as she says to support children but children from Mexico and other places have not been treated well in the United states will ... come up to think\nI I don't think it should be offset putting anybody hair all in other parts of the confidence\nThat Tim has been did that not it's not seen in a very positive light here but that's why it's a good idea for him to come and see and maybe maybe go back and tell him that you know these places that not all of them\nWhat they were you think they are so obviously you know for example it should be a world of difference from say two thousand nine when they're apple and and that Michelle Obama came to guy now and the first trip to Africa when everybody was\nYou know falling over themselves to because simply that that they had agreed they had chosen not to come\nI Do think you if you go out to the streets right now you see that kind of enthusiasm indeed asked a few people\nAnd not many people knew the name of the fascinating that got the name of the car and says lady of America never mind that even that she was coming so we don't have the same kind of enthusiasm but\nShe's coming and then also having said all that that might at that you do that America First lady normally doesn't travel empty handed so who knows she might ah [noise] ah refurbish\nStreaming of New England public radio is funded by you and all the energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nOh hey thank you for joining us somewhat update from a gun a minister of state we'll see how that trip goes there will be of course a lot of\nVery cynical headlines surrounding him along the of Trump's visit to Africa but we'll try and reported fairly as we can hear on the BBC Web sites [noise]\nAgainst the agreement of exactly what what is it that makes this such a a nationalist issue and it I mean I'm exhausted the great ... [noise]\nYes indeed well it was um\nIt has been a very painful issue that has been ongoing for twenty seven years and they have been different proposals on the table but we've never had the situation we're actually both sides could say we could we could live with this and this could be a decent solution what my students have insisted for\nIn all these years of negotiations under un auspices was that the identity is not to be and not to be part of the deal in the sense that the students have to be ... and the language cannot be change than it does much opinion\nA regardless of how the name is called\nA and now adding that I'm adding north or to Mr ... was seen and was estimated to be a good solution a painful one again because it requires constitutional changes and\nUh and it is a very emotional issues because nationalist have been have been a building the agenda on that for for many many years\nUh but this goes to show on one hand that\nThe boycott campaign was a successful as much as the government campaign had failed to convince people that this is a good solution that being said six hundred thousand\nThat I'm voted for which the government is now saying that is enough to give it legitimacy because if the census was Matt which was nine hundred thousand ... that the number of votes that should be in favor\nWould have been for a hundred and fifty thousand and now they're saying that a vote with six hundred thousand votes for and very few are very few against gives them the legitimacy to press on with the agreement\nAbout that and I have to get it through the parliament which might not be so easy we'll see how that turns out on a thank you Annette Patricia from the Balkan investigative reporting network in Macedonia this is the b._b._c. [noise]\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit farm in Amherst with a farm standard for sixteen bay road open six days a week through Thanksgiving small ones farm dot com\nGoals is the big subject also prime minister Theresa May's leadership which comes into question really in all\nOf the corners duck and otherwise of\nThe conference center in coming up at the moment the Brexit secretary dominant Rob is speaking let's hear a little bit of what he's saying\n[noise]\nThe cozy up to Holocaust denies them terrorists a casual equation of Jews with the Israeli government the vicious if they have their own gym champagne one great mainstream party should steep so that is a stain on [noise]\nReferring\nThere are costs to the opposition Labour Party which has had some trouble trying to do with the definition of a Holocaust denial and anti\nSemitism during the summer they held their conference just a few days ago robots and was there and now he's in ... well a criticizing the labor party of course is exactly what the conservatives are bound to do but really watch the discussion in the car doors were up\n... I should maybe just quickly sent that into context I mean basically what he was saying and he's a very much a pro Brexit air him so dominant Rob was that look if you were to deny if you have another referendum in this country about ... that would be to sort of deny the will of the people and that could lead to populism and he was saying if you um\nYou know if you didn't think you could have populism in this country look at what had happened to the opposition Labour Party going from being a ... policy on the germ on the Tony Blair to what we have today and that's why you joined us anyway I guess if I was to sum it up a phone was to sum it up then I Would say that the ... century the conservative ... exaggeration\nIs at war over breakfast I mean there's just no two ways about that you feel that at every meeting that you go to one sort of wing of the conservative policy ... regards breaks it\nHas something which will have a terrible consequences economically and handled badly could keep the apology ounce of power for a generation where you got another branch of the ... by infuse yesterday about ... like Mr Robin you think that's a the prime minister herself is just not grabbing it with enough enthusiasm\n[noise] tell us about bars jumps in because all the headlines in certainly the conservative supporting newspapers seem to be about him how much of a president's history well he's not there yet to see but the talk of him\nHe's a presence in the sense that he's a a rallying point for all of those who think that to threes in many regards breakfast is basically just the the making the best of a ... job\nIs he a serious politician as he has serious rival to absolutely because many grassroots conservative ... activists like him very much\nDoes that mean that he's going to have a ton her as a result of this uh this conference I somehow doubt that because of an awful lot of conservatives that I like three's amazed that they don't think that she's the greatest leader the policy has had they didn't think that she's handling breaks it very well a tool\nBut actually if you dig down into the into the polling data suggests that they they don't think that replacing it with Boris Johnson at this time with it being so close to Britain leaving the European Union would be a ... a wise idea\nRope thank you rub Watson in Birmingham let's go to Capitol looney I there are expected to be demonstrations mocking again since that independence referendum on official ending with police violence Gavin Lee was our reports are then Hillary reports today\n[noise] illegal referendum on the police was caught on camera treated the same thing in that have\n[noise]\nReally pushing punching and kicking up just to move them away from polling stations on notice things in the face of this young and old step that ground\nMany people that vote for a whole\nStreaming of New England public radio is funded by you and the western mass coaching alliance offering personal and professional gross through which member coaches coaches profiles available at western mass coaches\nDot com you wrong\nReally far a venture out here\nMusician an independence activists rotate Espanol was in the crowd outside the ball sort of in a polling station that day in the same spot a year old and he shows me mobile footage of him\nAs he's seen pushing a policeman of the offices seized ... books\nThe rubber bullets and also he's the one on [noise]\nWhen I was shocked I wasn't scared not angry but yet not makes all the things makes it a shot a making ... tell me about the ... yeah it's been like for you flat here it's a loss for me\nI mean right now I'm starting to restart my life when I leave it on me\nLooking back on the last year\nAnd it was a great ... so do you think Spain achieved\nThe first step Waterford and\nI'm sure we're going to make it even if we don't have the ability to go forward you know a\nJust a few blocks away from Jay how did that sort of a protest outside that I should\nGet the real hundreds of people I hear I hear all of a run to celebrate say they support police trying don't vote for that day [noise]\n[noise] [noise]\nDefinitely which do you feel that [noise]\n[noise] [noise] [noise] what\nDo you think what the significance of the referendum looking at life now am\n[noise] it sounds like a loss\nChanged here in twelve months after the referendum with Ninety percent of those who just choosing to set price the capital and government declared independence Madrid step to dissolve parliament set diminished as\nThe former president cost pushed him on foot to Belgium he used to but in ... wanted him to face rebellion allegations of the foreign ministers are in custody that when you elect ... and now a new set British Government and the new Spanish socialist government\nAnd in the last few days Madrid his foot to catch a lens a chance for a future referendum not for independence but so grateful to him and he\nJoined Maria ... gave a spokesman for the castle and government tells me there is no\nWe may well be a really do I like the the video but we don't see any of his findings government is not prepared to give us a solution for the ... that's ... to a building where I referred to know and we will work\nTo implement one as possible I kept telling me about\nWill do it [noise]\nMORNING EDITION and any PR is funded by you and WFCR partners\nAmherst half your Mount Holyoke and Smith colleges and the University of Massachusetts Amherst and by sky mountain realty variety professional real estate services to home buyers and sellers in ... after ... since Nineteen eighty nine more sky buyouts and real T. dot com\nThis was eighty five WFCR in Amherst WN in the six forty AM Westfield W energy FM Ninety One seven Deerfield WFCR eighty five each T. three Amherst WN you eighty nine five great Barrington\nW. N. N. I. Ninety eight nine Adams W. A. I. C. Ninety One nine Springfield than W. A. M. H. eighty nine three Amherst and partnership with Amherst College and UMass Amherst and that any PR dot net it's nine o'clock [noise]\n\nWhat companies are for the BBC will serve it otherwise James Menendez coming up the BBC's la none of Indonesia nominee to the boys are functioning at the time of friday's devastating earthquake of pseudo wasting or reporters in one of the areas worst affected\nPeople say they only had him wanting to that point on friday to higher ground when they saw huge waves coming in\nToday NAFTA to your point zero how much is new about the U.S Canada Mexico trade agreement and who benefits for fear of the counselor and has been for independence from Spain has to be a protest movement being snuff out\nThe food that was the I'm sure we're\nGoing to make it even if we're going to have the money to go lower you know a\nVery tribute to the great thing a show of ... died in Ninety four and a whole lot after the news\nThis is the b._b._c. news hello I'm Jonathan ...\nEngine easiest disaster response agency has confirmed to the BBC that none of the country as an army to take the boys was working defaulting on into sort of way she was struck by an earthquake and tsunami on friday with an eight hundred people are concerned that but that figure is expected to rise or Asia Pacific editor senior hadn't has more details\nAfter in Geneva was struck by a devastating ... thousand for this sophisticated detection boys were donated by Germany the United states in Malaysia\nAnd then in twenty sixteen another earthquake reveals that the system wasn't working the government promised to repair overplay set\nBut following friday six meters tsunami waves a disaster agency spokesperson told the BBC's Indonesian service that is an enemy detection boys were no longer in operation adding to systems Twenty one floating detection units had been damaged by vandals or had been stolen\nEngine easiest disaster agency has appealed for more heavy lifting equipment and trained rescuers cars to help and the search for survivors on the way I see many parts of the coastline of been destroyed and the number of areas outside the main city upon who have yet to receive any help a hotel in er in ... said screaming could still be hug from beneath the rubble Rebecca ... is that\nRather travel family they called fame landslide in jail without the at the airport remain close track\nThey found some says now unless noticed ... which is also making rescue asset\nDifficulty community members have said that they ... among the rabble people who still may thing and you can now they can probably the forties\nAnd they don't have anything to do anything about had\nNegotiators from the United states and Canada have contests\nStreaming of New England public radio is funded by you at all the energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nIt's the outcome of negotiations initiated by President Trump who considered the original arrangement unfair to the U.S Andrew Walker reports\nThe U.S into Mexico have already agreed and you trade deal now Canada has to there are several changes that President Trump wanted it will be more difficult for carmakers to use components in materials from outside the area from China for example if such a transport vehicles tardy free into the U.S\nFarmers in the U.S will have better access to candidates highly regulated dairy market\nFor its part Canada has assurances that it will be protected if the U.S imposes new tariffs on car imports the agreement will have to be approved by the U.S Congress before it comes into full ...\nDoes he is Nobel Prize for medicine has been awarded joined the to James Allison from the United states and ... from Japan but that research on how to fight cancer using the bought his immune system the Nobel academy and sweet and said immune checkpoints therapy at revolutionized cancer treatment\nBBC News\nPalestinians and the west bank Gaza and East Jerusalem holding a general strike in support of Arab Israelis protesting against the controversial nation state law that Israel recently introduced\nPalestinian businesses government offices schools and universities to because throughout the day the new law declared that only Jews have the right to self determination in Israel\nPolice in Germany have arrested six men suspected of involvement in violent farm Wright's group the men are believed to have counted out in the attack on foreigners in the eastern city of candidates last month prosecutors believe it was in preparation for a larger scale attack this week\nJapan's largest warship the kind of like a helicopter carrier assailed into Sri Lanka Colombo ... on a goodwill visit Akaka is escorted by destroying the deployment is seen as took his response to the growing Chinese influence in the Indian Ocean region\nAnd one of France's most popular thing as Charles ... has died he was Ninety four as the ball was born in Paris to Armenian immigrants and was acting at the age of eleven but in Nineteen forty one he teamed up with an attractive to write songs\nThroughout his career which spanned over Seventy has as a novel recorded more than twelve hundred songs in ... languages he won a ... award for acting but his trademark when his bittersweet balance now joined Kobe looks back at an unlikely heartthrob\nHe needed my mom\nShallow ... may have reclaimed his shortcomings included his voice his ... his lack of trust and honesty about his five feet three inches tall performer was once voted buying online readers of time magazine that's being because an Elvis\n... encouraged him to perform he says some he often tried to retire but she's fans wouldn't let him punish them keep them singing until he for [noise]\nBBC News\nEllen welcome to ... from the b._b._c. World Service where you live from London I'm James Menendez minimum and we'll hear from a team in ... in Indonesia where an earthquake and the subsequent tsunami killed hundreds of people in there is now a real problem getting supplies an aide in\nWho are in the program the United nations special envoy to Yemen on whether this long running conflict can be brought to an end and we'll remember singing legend\nShe read my blog\n\nFriend's singer and songwriter shower allows ... has died at the age of Ninety four will be taking a look back at his remarkable career [noise]\nTop story today is the devastation left behind by the earthquake and tsunami that struck the Indonesian island to sue the way she last week at least eight hundred and forty four people are known to died but many still missing trapped under the wreckage of collapse\nDreaming of New England public radio was funded by us valley solar a local photovoltaic designed to the installation company serving people and one of the loop carbon free and the four one three valleys solar dog solar\nReach tall are the main city in the region was hit by the quake on this you know me supplies are supposed to be running extremely low that the BBC's Rebecca hunch guarantee managed to get a caller and she's been describing the scene\nThey says what remains of this fish community was tightly packed houses and shops all\nNow reduced to rubble people here say they only had a few minutes warning after that strong quake on friday to flee to higher ground when they saw huge waves coming in\nSo that could survive did so by clinging on to trees and fielding now\nFamily camping out in the open like this family over here it's collected\nWhat they can and surviving off the food they have\nNo power here and very little fresh food fresh water to people saying that they desperately need to get aid in this man has been telling me that have held steady get money situation the the five by an added on to or not so good at all\nRelief that\nIf you don't get it soon what will happen I don't\nThe whole hour session\nAsh and paypal have written on a sign behind me saying pray\nThe PR news network is funded by us celebrate Holyoke a local music festival in downtown Holyoke featuring music food out are open to all this Friday through Sunday celebrate Holyoke mass dot com\nAnd by the Hartford symphony orchestra celebrating at Seventy fifth season opener with pictures at an exhibition with Carolyn ... conducting October of theft through seventh Hartford something they taught or work\nThis is Terry Gross the host of fresh air you know all NPR member stations pay a fee to broadcast NPR programs so that your pledge and E. P. R. couldn't afford to bring you MORNING EDITION all things considered and of course my favorite fresh air\nSo please contribute now at N. E. P. R. dot or call eight hundred sixty nine eight eight five female thank you\n\nStreaming of New England public radio was funded by us all energy solar helping homes businesses and firms in western New England save money and the environment with solar power all energy solar dot com\n[noise] you're listening to music from the b._b._c. world ... both turn to Capitol learned you know the north eastern region of Spain that tried a year ago today to break away from the rest of the country by holding a referendum on independence\nMovement two million people to pump the vast majority searching in favor of splits in a way but it wasn't illegal poet ended in violence and much of the compliment leadership\nEnded up either in jail or next so it would affect things events on both sides of the political argument the BBC's your reporting ... who was there in twenty Seventeen\nHas been back to find out\n[noise] the illegal Kathleen referendum on the police was caught on camera triggered the biggest political Spain has seen in decades\n[noise]\nAt least seen pushing punching and kicking go just to move them away from polling stations on notice things about his time in the face of books as young and old stuff that ground [noise]\nToo many people that voted for the whole country anymore stayed away from using putting all these illegal ... random\nIt really far I've been shot here\nMusician an independence activists real Jay Espanol was in the crowd outside of both sort of an opponent station that day in the same spot a year old and he shows me mobile footage of him\nAs he seen pushing a policeman after all these books and\nThe rubber bullets and last saw him on on [noise]\nLooking back on the last year\nAnd it was a great ... so called you what do you think's going achieved\nThe first step was the first ... and\nI'm sure we're going to make it even if we're going to have the ability to go forward you know uh\nI don't just a few blocks away from the ah [noise] approach to protest outside the real the hundreds of people\nHere a year old I have to say they support police trying stole the vote that day [noise]\n[noise]\nDo you think what the significance of the referendum looking at life now am\n[noise] [noise] [noise] a lot's\nChanged here in twelve months after the referendum with Ninety percent of voters vote just choosing to separate the capital and government declared independence Madrid step to dissolve parliament set the ministers\nThe former president called us pushed him on foot to Belgium he's too but in cells like so wanted him to face rebellion allegations of the foreign ministers are in custody that when you were like ... and now a new set British Government and the new ... new socialist government\nAnd in the last few days Madrid has all the catch all ends a chance for future referendum not for independence but so great for autonomy\nJoined Maria ... the spokesman for the castle and government tells me there and so you know\nWe may well be a really do I like the the um did you mean by the way I Know the idea is if the Spanish government is not prepared to give us a ... that's ... to ... I mean they are for the new and we will work\nTo implement ... I got along republic\nReports from ... the BBC's Gavin [noise]\nOn the campaign trail Donald Trump famously describe messed up the north American free trade agreement of Nineteen Ninety two is the worst trade deal ever signed by the U.S and I'm fifty threatened to pull out to the agreement saying it was one\nStreaming of New England public radio is funded by you and they passed university graduate schools MS and applied data science at rolling for October twenty second applications at bay paths dot edu\nAs from Canada and the U.S reached an agreement told the new deal together with Mexico safeguarding the one trillion dollars worth of trade fell under NAFTA the U.S Mexico Canada agreements as it's known\nWill not have to be ratified by each country or crystal funding is being a female trade advisor to the Canadian government for many years now but I still the little from cruelly how they'll pay you would consider this a good deal from\nEarly reports it sounds like it I think in the first place it's a very good thing for Canada and the United states and Mexico to have this deal settled there's been considerable uncertainty over the last couple of years with President Trump saying it was going to tear up NAFTA\nAnd then in the second place speaking from a Canadian perspective I knew that Canada was being pushed on a number of things and it appears that those points have come out in Canada saver for example\nThe United states wanted to get rid of binding international resolution of anti dumping a countervailing duty measures that remains in the agreement the U.S wanted to get rid of binding state to state dispute settlement\nWith us explain there's a little bit why with a swimming pool to them\nThe anti dumping and cats are bailing duty provisions of the NAFTA ensure that the U.S couldn't unilaterally impose these kinds of anti dumping additional duties on imports and Canada\nAlleging that they were being dumped into the U.S market without that measure being reviewed through a binational panel and so these mechanisms are meant to ensure that the rules of trade are enforced in an objective and impartial way as opposed to in a nationalistic way which is very important when you're dealing with a much larger partner\nThe other things that the deal provided from a Canadian point of view we have a cultural exceptions so that cultural exception remains in the deal\nAnd mobile them and told them that entails that cultural industries are not going to be open to the same level of competition as they would normally the U.S tends to view culture as entertainment as a product\nAnd Kennedy views culture as part of its national identity the deal also maintains the same or indeed higher levels of access in automotive trade which is fundamental\nWhat about battery that's been concerned that the U.S is going to have caught a significant amount of access to the Canadian dairy market and they're worried about the Canadian very industry is not ...\nActually the level of access that the U.S did attain in Canada did give something on dairy was somewhat more ... three\nPoint five percent which doesn't sound very much as a sort of think about\nIt but it's close to what was agreed and the TPP contacts the Trans Pacific partnership so in effect candidate heard already offered to the U.S this level of access in the Trans Pacific partnership negotiations are close to it\nYou have to give any more much more grounded alone\nYeah and the U.S walked away from the TPP and all of a sudden I mean don't forget part of this is um it's often re branding and re packaging look this new administration has done this\nAnd you know I think one can assume that anything that isn't that agreement the Trump Administration will declare victory what is important from the prospective partners to that agreement is the substance is something that we can live up to and I think that\nMinister freelance and Steve ... who is kind of does lead to go see her to be congratulated for sticking to their guns the analysis remains to be done because the Texas has only been released than it's hundreds and hundreds of pages\nI think one of the points that will be interesting to see to what extent does it differ from the TPP which was itself a kind of update of the NAFTA\nThe Trans Pacific partnership had been negotiated over many years so will be interesting to see if NAFTA to point zero is simply a re version reworked version of the Trans Pacific partnership which ironically the U.S administration that just rejected\nAre joined by the comments from the government so it's been pretty pleased with this or is it like to be ratified by hiring bikes are the three countries\nWill it does need congressional approval and the U.S and there could be a different Congress after the midterms\nI think the fact that it's at the cry lateral agreement rather than the proposed bilateral which the U.S was suggesting would put forward is already a step in the right direction towards ratification because Congress had said it would not approve any deal that didn't include\nStreaming of New England public radio is funded by you and small ones farm certified naturally grown fruit farm in ... with a farm standard for sixteen Bayh road open six days a week through Thanksgiving small ones farm dot com\nAnd it will come through in the meanwhile NAFTA one point zero remains in place [noise]\n... a lawyer and a former senior trade advisor to the Canadian government still listening to these aren't from the b._b._c. world so stay with us we're a little more to come in the next half hour of the programs I go way [noise]\nBut you have the classic dilemma everyone talks about a political solution and wanting it but everyone is fighting and that includes the Saudi led coalition which is using the arms and sophisticated weaponry provided to arms sales in Britain the United states in France\nYes that's what we're trying to stop and that's what ... er about\nHas this warning about the prospect of famine concentrated minds in the capitals which count which include London Washington Paris Riyadh and tear on all of the outside players involved\nBut I think they will care and that's not really enough ah well it snows enough or they all want this to happen for whatever reason I think the centuries and is your income take much more of this war the threat the prospect the worry\nIs that it can get ... and that's the prospect which is almost unimaginable in Yemen\nMany are looking for that defining moment a few months ago there was that horrific bus bombing more than forty children killed on a day out and people thought well that concentrate minds on each end these airstrikes by\nThe Saudi led coalition but it hasn't happened people continue to die\nYes indeed a ... there was anything good to be said about a war\nNothing happened after that that young lead to a greater sense we've got to do something\nI think the behind the scenes that attack and the subsequent decision by the coalition to the second investigation recompense that has had an impact every awful act has its impact on public opinion and political opinion\nBudget you refer to the possibility of feminine that also is a huge for cars for all of us if it really would come to him and\nIt would be like nothing we've seen and that is a prospect which was not any bad for Yemen with is bad for the region and it's bad for Europe and ultimately it becomes a better breeding ground for terrorism\nThe clock is ticking and you and your family is is is ...\nThat's what we've been warned feminine is a particular phenomena and it's just more hunger it's ... it's different it's viral I'm In a war situation it can be extraordinarily diverging in terms of human life\nStreaming of New England public radio is funded by you in the western mass coaching alliance offering personal and professional growth through its member coaches coaches profiles available at western mass coaches dot com still protesting\nUn special envoy to Yemen molten Griffiths leaves I just wonder whether those warnings about feminists focusing diplomatic mine's\nI'm told by a senior un aid officials that there is a sense of panic\nAmong some of the key players in this war including Saudi Arabia the United Arab Emirates the key Arab nations some in the coalition as well as the United states\nThey don't want to be blamed for causing a a time and they're already blame day in day out for causing such as high number of civilian casualties with the with the bombing which they say they take care to prevent civilian casualties but keep hitting\nCivilians but it's one thing to say it and that's what Martin group at the same thing to say it it's another thing to provide the money they need hundreds of millions of dollars\nTo be to be funneled into Yemen to provide jobs for him and he's so they had purchasing power\nThey also need to get make sure that the attacks on the red sea port don't stop the aid shipments because the price of food if it keeps rising more people will have to turn to the UN\nJust to survive and the un arm tools you they're providing food aid now for more than eight million people that's all they have this ... another million people could be facing starvation and that's what the maximum the United nations has the capacity to feed and don't forget\nThis country runs all the infrastructure including the health system has virtually collapsed\nDoes anyone have any idea water water a resolution to the company might look like\nIt has to start with Yemeni sitting around the table Martin group has tried that in September out and who didn't show up now of course of who these are being blamed\nFor a ... months and months of preparation by Mr Griffin his team who's been shopping between capitals\nBut the Quds he's at the eleventh hour pushing new conditions about what kind of aircraft they would fly to Geneva and whether they're injured could also come out other people who also had to come out they've done that in previous rounds of talks and got those conditions met and this time\nThe ... they were refused and so they didn't come\nBut I was told by Mr Griffin set the extraordinary thing is because of this new risk of famine people have again focus their minds on starting peace talks to the ... the um the ministry of faith for foreign affairs stuck our gosh\n... and he was very critical do these are not showing up said let's get going again we're fully backing a political solution but in order for there to be a political solution all foreign forces have to leave\nAnd there's no sign of that now and of course Iran is providing military support for the who the so both sides\nAre getting a ministry of support and both sides particularly the Saudi led coalition still believes it has to press permitted tree advantage in order to get a better position at the bargaining table\nMove money thanks chief international customer leads to something that joining us from New York\nThere was a strange that despite being landlocked Bolivia maintains a navy and practices to patrol the country's rivers and its section of like ... splits with\nPeru but it's all sort of statement of intent Bolivia wants to recover a section of specific coastline\nSo that loss to truly more than a hundred and ... years ago today the international court of justice is due to rule on the dispute Lawrence Blair is a journalist and author of a hundred and fifty years of solitude Bolivia's dreams of the sea and joins me now from the time of ... in\nBolivia good to have you with us on the program tell us a little about the little of the history of this land is this was coastline lost in a whole\nYeah that's right you know maybe we should go slowly\nStreaming of New England public radio is funded by you and small ones farm certify naturally ruined route farm in Amherst offering berries bears and why is that their farms and small ones farm dot com\nRight hung up on this issue you know the country still has a very large navy or that they see every march twenty bad ... schoolchildren Smith teaches parade through the streets are calling for a chance to the ocean so it's a very emotional for a\nLong standing grievance which is why I Believe you brought this case ... five years ago\nAnd how likely to win this case I mean my understanding this is really just about to getting too early to restart negotiations\nFast right that the icy Jay and state that I Know no event would actually ... to ah to Libya or maybe the rules for big eight by ten to ... to ... um so I think it if it's in it's even on like the the Libya will win\nConcessions and the courts so I think that will be disappointment today in Bolivia especially given the president that but more I listen to Libya has been promising for many months now that it will soon returns for the seat that said it's possible that maybe it might try and\nBring some uh some sense of victory out of the cultural thing if it mentions will recommend recommend that even in even in an informal way that the two countries keep talking\nAbout more than ... to be made in the palm so drawn ... have Bolivia's neighbors all put anything in the way of concession some access to the Pacific\nYes I mean like ... which for the the the war in Nineteen seventies all on the same side is asking if you had actually given a chunk of tree on on the coast to Libya or an area called Bolivian however I take pride in\nPort territory and it's quite a out of the way in terms of Libya's export needs\nMentioning any of that idea has had stuff in stops all over the over the decades salary as presidents of time and gone and talked about it and that's really ... years will happen today the speech I Will say what the results of the folks I don't think they should\nContinue talking as being grateful for that movie and he got that far nothing ... ups who was the fact\nThat some of the city and found like a really hot and not just send the voting to recent polls are opposed to any conception of territory so fast I think is that they get something to progress\nAnd just pretty intrigued by the time you build your dreams of the city has the list shaped the Libyan national audience too\nI think it has you know in many ways the story of history in the\nLast century in an office in looking for in different outlets [noise] see ... through ... through a lesser rivers going through Brazil we ... down the ... the Atlantic various ... six foot with its neighbors and was it the way of\nTrying to break house if Islam low states I think it explains a lot about the Libya mentality\nI think the ... I Would say is I think on both sides of the border and by governments just that you know that can be a way forward snake shapes and find a peaceful solution but I think it will be some some years even decades to come\nTo ... to learn you very much in do learn from a hundred and fifty uses some villages dreams talking to us from ... and you're listening to the BBC", "show_name": "BBC World Service", "year": "2018", "city": "Westfield", "day": "01"}