{"month": "10", "state": "NY", "station": "WRUR", "content": "Run\n\nAnd then\n\nNa na\n\nYou're listening to W. are different radio\n[noise]\nSo I wrote a new word I was young\nWaited so long\nThere are certain ...\nSo on the line with us\nCodes on the camera\n\nYou're listening to W. R. U. R. S. and Rochester a broadcast partnership at the University of Rochester and W. ... public broadcasting to learn more about the Susan B. Anthony said you're for women's leadership log on to Rochester dot edu\n... in the boom\nJulie notion\n[noise]\nAround\n\nSubject you can\n\nMy day\nReally\n\nI\nBelieve that the\n\nStorm we knew each\nWith ... and ...\nAnd you know\nYeah there\n\nKnow that\nOf\n... ...\n...\nDo\nYou see that is wrong\nAlone ... you would ... the ... or ...\nOr in a row\n\n\nGood ... ... right out of the river to na\n\nNa\nNa na\nNa na\nNa na na na na na\nNa na\n\n... everybody our no doubt about that area we don't we don't know what so what area\nAre you know they know that they want to know people get rash but what are you know the middle of the tobacco batteries included in those strings attached to a whole lot\nTo talk a little bit just to get the walk you're bringing home the point they take the prop get most of what we've been able to be about the but what what what do you go up your beep through well here's the real world but and then\nYou have to tell you where I talk to me how bad it okay and what they do go over like you've been there yeah we're going to go get a taco on the record bummed but don't reach three bumps again don't sit back relax and I just don't do what what church that act like you know judge\nJoel Joel got Bob the builder and how do I do not go around\n\nMay stay home and he totally word is the bird and it'll be but Bob Marley think back to the paperback book they suggest Josh I get I get the real threat what they'll do about ... ... ... ... you know\nBeing a trip to a brand new York no object I like I talked in particular ticket to get out more about the health and flour\nTo the bill gets filed bull ... book both to go with the story through your radio too often they don't tell me you know what the narrow\nWill be do what we do yoga but your book report will pull down and talk with them both in my state still book but you take the place they like all the way she hopes up an opposite\nWe took the lead up like when we see you later laid off when you play the alligator clips and played a big deal but what do they call for me to get too cold for being with but I'll Fight fight fight lab jumped on that now\nWhat did you know we got the tear up a whole lot my mobility a\nDamn about ... pounds the way the criminal my young they just they just pick up a lot but I didn't believe they just built up a job that you don't want a little bit above the bomb the love what I heard you want to rush and\nThat they do they do have this back to the rebels due out this way or the liberal go what did it why are they or they didn't buy or they get shot down a deal and the data up all the time or they played out he don't\nPlease let alone with the New York see a\nDoctor by over ... from the minute he ended up we'll bring you back on the wire on top of that McGahn\nIs just by just about the people to do just that there'll be directed it still bother me by my job I Do want to do all of the national border patrol\nDuring the day off your all the trouble to go do that then\nYou're done little to get rid of it just doesn't do that just below the most ... don't go for the kids just\nReal big will just do do do do do do do do do do do the job but they\nTalk about the stereo yo yo yo\nYo yo yo yo yo though are the ones that are real there we go we go there we go you don't want to turn out real\n[noise]\n[noise]\n[noise]\nAnd\nBurns bad bad and\nThing that ball\nBearing the\nDa da da da da da da\nDa di da de da de\n... mom um that\nThe\nBe key in like ...\nWill be a\nAnd then why not\nOh a ... teenager brain\nWon the war\nIn the\nThe\n[noise] man\n... ... ... ...\n... ... ... a\n... says you're kidding me ... ... you will do well ... ... or most of the two the father and you know as a ...\nReward\nWell no no the truth\nGo up there on your dream lose the\nMaybe just one person but then you shouldn't\nOne is going to die\nReach your mom and you just get many\nDuring you know\nThere there was a ... law one\nThen we're not we're not and [noise]\nTrain them long been hanging in the new\n\nTo John John\nNot a\nGain and no\nMe made by\n...\n[noise]\n[noise]\n\nAnd they should uh to me and\nGoes dreaming may get a a student\nMine that are still being ...\n[noise]\nBank cash was you know\nA in a\nHistory well\nI Love that they're learning the day to day and\nGoing to treat the least you\nKnow no one has a business\nReal man when I'm going to do\n[noise] [noise]\n\n[noise]\n\n[noise] [noise] ...\nA year\n[noise] [noise] [noise] [noise] [noise]\nShe just you know he's busy do you think\nThat's\nThe thing is you know\nDuring the the big\nBut it's so\n\nTo speak what would you\nAre rich sheer do or do they think oh", "show_name": "Sonic Highways", "year": "2018", "city": "Rochester", "day": "17"}