{"month": "10", "state": "AZ", "station": "KOFA", "content": "Who is broadcasting from the campus of Arizona western college does its border radio Thirteen twenty am kale at the human and border radio easy dot org\nWe also broadcast in Arizona community radio network at eighty nine point five FM kj C H ... Williams Ninety One FM cage ACP prince get Ninety point seven F. M. K. Jaycee shaking men in Ninety One point three at them like staff\nMostly clearing human tonight a low around sixty seven and some south south west winds about ten to Fifteen miles per hour\nTomorrow punished guys but behind your eighty three breezy day was gets his highest twenty miles per hour in part or tonight a fifty percent chance of showers mainly after eleven PM when gets up to twenty five miles per hour tomorrow mostly sunny hind you're eighty two\nMm\n[noise]\n\n\nHello everybody and welcome to the\nMusic our musical journey around the globe I'm relatively Howard today with the upbeat dance civil rhythm of Scott\nScott originated in Jamaica in the Nineteen fifty it's Ruth fly in the clips of music are printed out\nAnd get into a Jamaican form is called a\nSky was a precursor to reggae and many than the food both in their repertoire [noise]\n\nHello everybody and welcome to the\nMusical journey around the globe I'm relatively our today would be upbeat dancer bill rhythm of God\nGod originated in Jamaica in the Nineteen fifties it's Ruth lie in that clip the music of Trinidad\nAnd men to Jamaican born this\nGuy was a precursor to reggae and mini van through food both in their repertoire\nGone really caught on in the u._k. during the new wave here this late Nineteen Seventy and today in his fans around\nThe world\nThis scandal I start the live shows just instrumental freedoms sounds so we'll get our show really with it too [noise]\nDa\nDa\nDa da da da da da da da da da da da\nDa da da da da da da da da da da dum\nLa ... do you know no one will be going on\nLittle while millions of naming going up on the ball gets bad and\nMen the men\nBan man [noise]\nWhen did you move the needle on the moon do one thing and then they go on and on the ... when the unity that a little young lady you know when they end up being the gold on on the main bone\nCan ban on gay man on mad\nMen the men\nMan\nMen the men\nMay be\n\nMe from Mexico body on during the bounty be to keep me now or what sorrow\nThe sound of Scott is characterized by the accent on the upbeat like reggae and bluegrass rather than on the down beaten rock and blue\nYou could hear both guy and reggae underneath the harmonies of waltz ball down\nI had\nI\nAbout ... I may be\nA\n\nAre too\nYoung or\nThough or no gun do them Bob what what I did not do better among debacle\n\nThis guy beat in Italy with Roy patchy an Irish to Sherry Sherry's on the ... mile world party collection\nWill start the next set with bands from Argentina who embrace this guy be to get their audience is up and on their feet you can look up the songs on the today show and stream other shows and our world music theory online at ... dot com that the U. P. U. N. A. Y. O. dot com\nThe modern world music our is supported by ... magazine Easter wisdom for mind body\nWorld party collection\nWill start the next set with bands from Argentina who embrace this guy be to get their audience is up and on their feet you can look up the songs on the today show and stream other shows and our world music theory online at ... dot com that the U. T. U. N. A. Y. O. dot com\nThe wider world music our is supported by ... short beard magazine Easter wisdom for mind body and soul\nMore information is available dot coms to Maggie dot com da da da de ... is a reasonable hundred six seven to seven nine one\n\nIt's the bounty sounds of gum music today on the ... world music hours man\nAnd tore off and take the lead in music more so than is higher or keyboard so we're hearing a lot of upbeat brass today\nBut look bingo they've gone without any ... because they play mostly acoustic guitar here's their song my love\nThen you know the blue and gold glove during\nThe Manhattan da da da da\nDa da da da da da\nDa da da da da\nDi ...\nIt be and don't need to be at the\nMoon I thought it would be good but it was a\nReal good there's been a\nLittle better one to be a\nI Would oh da da da da da\nDa da da da\nDa da da\nAhead please do out there\nRight now I'm\nTrying\nTo do that\nNo no no\nI can get some ... or ... the guy that was about whether from whatever money they have been a guy that guy that\nGuns they should not be bad men than you know done today was the guy a duck throwing them out of their daughters and put it that way or the other\nThat I talk to Michael\nDouglas to my\nNot know\nBut I'm Glad I'm not on the up around the world that the the dirty done them and to get across to clean up it held one way or the best\nWay to go down there we go into a movie that made no I don't know\nBut I don't know what I'm going\nBy little runny nose run around the world loves me as a dirty bomb them and we'll ... we'll look at how one way and then\nWe'll get a new movie I'm older than me and I don't know\nOr woman in the mail they don't know what I'm going to know my mom\n\nIt should start to mop up the end up with that and\nSo on and so I\nBad thing do you\nTo ban from Argentina that had been raised this got beat the go them system with the four goats and before them look being was a young trio based in Los Angeles\nDisco music scene tends to be somewhat male dominated but here's the singer named Jackie who was born in Uganda and moved to Sweden where her music really caught on this song called net he dread demonstrate the boy and the the um\n[noise]\nDa and permission is available a hundred and six seven to seven nine one one\nSecond to the ... world music hours and world God\nBorn in Jamaica and John music spread to the u._k.\nAnd the seventies and became all the rage on the punk rock a new wave\nThat's like the flash and the specials\nSpread his popularity to the U.S\nIn Australia the cat empire is an Australian band who use the Scottie to get their audience is bouncing up and down\nThis song in my pocket has a more subtle next to read them [noise]\nLong journey na\nNa na\nDevelop\nTree why\nDa da\nDa da da da da da da\nDa da da\n\nDa na na\nAre bound by Atlanta blah\nBlah blah blah and I do love a\nBook by my then and the\nNa na na na na na na na na\nNa na na na na na na na na\nA shade tree when\nThey\nMe\nNa na na na na na na na na\nNa na na na\nNa na na na na na na na na na\n\n\nNa na na na na na na na\nNa na na na na na na\nNa na na na na na na na na na na na\nNa na na na na na\nAn instrumental were the big band sounds set to its got beat that with when not to go by the international a Belgian group\nAnd the next ban has got in their name they're called ... know Django is named for one of the or we should we think of the religion Santeria you'll find that and put in my collection called the Caribbean\nAnd all that\nMaybe more you know I\nThe name\nMatter is they don't have you ever been\nMay be down down down down down\n\nDown down\n\n\nThanks for listening to kill us human and searching twenty am AM radio ... daughter or your service a bar owner western college\nWe also broadcast on the Arizona community radio network at eighty nine forty five ... than Jay Jay Z they drink Williams Ninety One one that same Jay Jay Z Prescott Ninety points ... J. J. D. J. do men and Ninety One point three ... ...\nYou're probably hearing saying on a regular basis to border radio listener supported so to those you contribute to border radio thank you for making everything you hear on this station possible especially the student interest\nWe also broadcast on the Arizona community radio network at eighty nine forty five ... than Jay Jay Z they drink Williams Ninety One one that same Jay Jay Z peep Prescott Ninety point seven there than Jay Jay Z taking men in Ninety One point three FM blacks\nYou probably hear a thing on a regular basis to border radio listener supported so too do you contribute to border radio thank you for making everything you hear I'm just stinks impossible especially the student internship program thanks very support Mm\n\n[noise] [noise]\nHello it's very nice to be back come your whole surge Joe mill machine could we have an accent show I had to the extent that sets featuring some special recordings and songs from our guides lead on we have a special Sattouf compositions by the great legendary composer single musician would evoke I Need [noise]\nFelt let's go to our first set of music with mark ... see the ... group ... then we go on to hold back the rules and believe me you should buy them bottled joined by the new ... black nice outside in the wall there one day later [noise]\n\n\nAre even though\n... me from\nWhen we asked him or her\nMind their state but he's the street from\nLast year or so that now but it's\n... by saying but he said\nWhat was your blue in the mail that\nSaid what are the\nGame I was you know\n\nThe channel\n[noise] they\nThe Tonight Show\nVinci\nThe last ... I think mine\n... you know these though they got a new book\nThe\n\n\n\nI just love the playing of Walter Mondale lay on the Hammond beat three there's nobody like Walter when they're like such a groove nobody's played some but like you used to do on the ... three\nWe heard that wealth or will delay with a negative seizing go this is from the album ultra lounge logging my Chuck Chuck yeah more on Capitol Records\n... rules and before that while too great\nBy them ... on guitar and didn't says you know what I Want vocals they wrote to gather this wonderful to called beating wild ... saying well do I mean but it's amazing you know music is the mother of the the ... to ... to ... what a family\nUh I'll bet the rules and blitz resented the banquet he does so from his album that he is but I Do need us about was him with a great musician composer ranging from real vision needle the sun but their dog ...\nBefore that while two greats by them ... on guitar and Venus as you more as on vocals they wrote to gather this wonderful to called beating bow me it was just saying go Gwen do I'll end but it's amazing you know music is the mother of the ... to ... to ... what a family\nOr about the rules and blitz resented the banquet either from his album that he lives but as he made us about was him with a great musician composer ranging from real vision need all the ... band or got sweating\nAnd they presented on the ... the wonderful band from Rio as well we open the SAT with an instrumental these markers violin and cello point six got the title track from their album by ... percent of our [noise]\nDo I listening to the British he got an hour I'm Sergio ... like to invite you to visit our brand new science to love it go to president in our door and we have lots of music videos\nYou can join as there are on Facebook send us an email would love to know all of you and to get your email visit receive them our dot org [noise]\nLet's go now to our next set of music and very special one featuring music all the ... when you wrote I Am a great compose a legendary composer from Salvador by you\nWho moved to ... in the thirties and became a superstar in has influenced inspired many musicians and composers on Brazil\nThat starts a sat with ... himself\nWith his two bought up by now we go to ... billion a musician singer who lives on the east coast of United States and she has an album devoted to compositions ... got to listen to Kenya with you'll know thing you want to do more than ...\nThen we go to ... and then you look I mean\nThe door and the two sons are ...\nWith ... software by this comes from a beautiful album called ...\nThen we go to the news to mantle piece\nA co positions by a me with ... one of the best bands or Brazil it's a big band and we listen to them with somebody like me up there and so by the by year we closed that sat with ... back to the zoo sinking cell dodge by\n... music right here on the Brazilian our [noise]\n\nMinute\nSomething about the senior\n\nYou know you can do\nTo [noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise] Mm\nYou still do that by in\nDecided to our money up so much in your body but she done by just to mention about bad\nIs it still does show those rules are a lot do they mean by that sometimes they don't believe\nThat they have been demanding it is with ... ... ... ... ... a\nBoy does go a little bit during the day we used to be in the desert pursuit was visible too caught\nUp in that region gay I Do not guarded but as soon as the ... and ...\nAnd\n[noise] [noise] Mm\nMm Mm\nBad thing or not by the uh\nDo is we don't you remember in ... in a\nBand aid from about this shot up some money up to the doctor was injured by going out to do much to do but there is a bad news or\n... you know a a ... a\nLot during the ... the lie to the ... they may suggest they do they don't get that part of me right\nDo you have to build a guy who was able to be above the proper\nDeserve to be able to think that there is a is there to watch so then you visible bogged down over educating the Latino da da da da da na\nNa na na na na\n\n[noise]\n\nDo you think about the ... visit to wants to be visible to blow up but he brought up with a degree I Do not by\n... [noise]\n\n\n\n\n\n\nMm\nWonderful sat with compositions by the legendary ... as long as you're bathrooms you alive recording a in a failed coup stick self Dodgers that by email this from his album bummed that boys we also heard ... from Sao paolo Brazil\nWith some of them yet they're insulted by the by yeah\nWhen the when the gate at one of the big bands of Brazil we also heard nothing to do the and then you look I ended the\nDaughter in sounds off don't evoke I mean we will see is a four year by year Kenya a singer from Brazil who lives on the east coast of the United states son illness thing which is more this comes from Kenya has album gain that celebrates buddy foul ... [noise]\nBuddy Guy Amy himself open to set up by and it will come on I can guide and\nYou're listening to the president in our I'm Sergio ...\nOnce again I Would like to invite you to visit our brand new sites with lots of music videos and you can also listen to the president an hour twenty four seven\nAnd to join us on Facebook visiting but as he got an hour's dot O. R. G. [noise]\nThat is president in our dark [noise]\nHere comes I sat with great singers\nThat I'm going to open there's one with the immediate sense Yahoo who sings the M M would add that in the law ... with book ... right here on the president an hour\nYou know the the new ...\nNew ... Naomi Israel staple in game ... it'd be ...\nIn ... in\nMe more than I\nDo uh [noise]\nWhat\nDo you mean\nBy being in\nA bad\nI Do need to\nGo up there on\nThe news and the dummy me\nThat that may be out by me\nAnd my goal in about ... a", "year": "2018", "show_name": "Retro Cocktail Hour", "city": "Yuma", "day": "07"}