{"month": "10", "state": "ID", "station": "KRFA", "content": "The programs you enjoy in northwest public broadcasting every possible with support from the Washington Idaho symphony bringing romantic favorites from felt risky of course the ... and ... to the stage Saturday October twenty if the public high school the twenty first at ... high school to get information at W. H. dash id symphony dot org\nNorthwest public broadcasting carry the Ninety One point seven Moscow pony hey W the Ninety five Clark St Louis did and can W O nine point one cotton wood ... NPR into classical music\nCommunity service of the Edward R Meryl ... communication at Washington state university Mm\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise] Mm [noise]\n\nA lovely song without words to get our one o'clock hour started here on northwest public broadcasting it say Venetian ... song by Felix Mendelssohn\nUkrainian born ... to do that at least ... planes here be fixed of Mendelssohn book one of us on without word hello good afternoon I'm ... pleasure as always to join you for weekday afternoon classical music on listener supported and W. P. B.\nNow he's a stark of all things considered at four\nSo beautiful autumn day here in the northwest and we have some supply and the music to share its moments and the hours ahead\nFor violence and not a one is coming your way this hour as well as a spooky ghost story of a bond to get us in the Halloween spirit\nFirst though we speak he's sweet on seventeenth Eighteenth century melodies incorporating the bird calls as well this is the Academy of St Martin in the fields with ... the bird\n\n\n[noise]\n\nNo no no no\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\nMm\n[noise] [noise] Mm Mm\n\n\n\nTo\n\n\n[noise]\n\n[noise]\n\nIf you're well versed on your bird call you might have recognized a few in this week including the cook who call which ran saturated biggies plead called the Byrd never mariners Academy of St Martin in the fields performing here on northwest public broadcasting and W. P. B. dot org\nActually don't yet have you voted for your favorite great American read novel yet you can still cast your vote for America's Best loved book at N. W. P. B. dot org and yet you can vote at many times as he pleads\nIf you're still undecided on your favorite book classical music on N. W. P. B. might provide some inspiration as voting closes tomorrow night within beginning at nine AM for music inspired by some of those titles on the great American read\nIt's right here on N. double UP beat NPR in classical music service and don't forget to cast your vote at N. W. P. B. dot org\nWell since we have the calendar out we might note that Halloween it just two weeks away and here now is in appropriately spooky work Schubert found the Earl King spoke to set the scene a little bit here you'll hear\nFor it and then the reassuring father asking his son what happened so scared the son replies that'd be Earl King is near perhaps trying to steal his cool\nThe father again reassure it it's just a mess but then the voice of the real king chimes then beckoning to the child to his site\nYou'll hear all four voices San today by Dietrich Fischer ... scout and Gerald more imitate the counting of the horses in this desperate right this is ... ... are OK and W. P. B.\nS. [noise] Mm [noise]\nMm [noise] Mm Mm Mm Mm [noise] [noise]\n\n[noise]\n\nIt was and\nTo\nMe mostly on the line and ...\n\nAnd then\n\n...\n...\n\n\n... ...\n...\n...\n...\nThat\nWas going on in the ... the spider monkey mind to be on TV too\nMuch\nLike the one\n\n\n\nThing is this your story ...\n\n[noise]\n\n\nLove\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\nMm [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\nAnd the and\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n", "show_name": "PRI's The World", "year": "2018", "city": "Moscow", "day": "17"}