{"month": "10", "state": "ID", "station": "KRFA", "content": "Northwest public broadcasting we seize program support from listeners like you and the Kennedy performing arts center in downtown Moscow presenting national theatre live in Halloween rebroadcast of Frankenstein\nTold eleven London production starring Benedict Cumberbatch and Johnny Lee Miller Sunday October twenty eight that six thirty details at ... dot org\nNorthwest public broadcasting care if a Ninety One point seven Moscow pony ... Ninety point five quarks didn't lose ten and can W O Ninety point one cotton wood Grange Fell NPR in classical music\nCommunity service of the Edward R Meryl ... communication at Washington state university [noise]\n[noise]\n\nA song for the night watch musicians that kept watching the city gates played at banquets in dances and invited the during the ... the city this night watch written by a composer musician of the English Renaissance ... Philadelphia brass performing here on N. W. P. B.\nI'm actually ... hello and thank you for choosing listener supported northwest public broadcasting for your daily classical music\nWhich are now to a bohemian composer poop that did a three year mission to help American composers find their own nationalistic found\nHis experiences in the U.S his discovery of African Native American ... and his own home to take that color the symphony which has become a concert hall favorite so here now it's and mean divorce shocks ninth symphony he called from the new world\nMm\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\nJacques written with African American and Native American malaise that fresh on his mind from a three year stay in America in the Eighteen nineties\nAnd Julie Jody I hear and while the album and likely or play list at N. W. P. B. dot org indicate this performance flipped by so harmonious ... with Henry Adolf conducting both names are actually seeing them more likely to perform in ... by a pick up group\nMade the musicians of the Austrian radio or to try\nNevertheless an excellent performance of some glorious music here on northwest public broadcasting again that's divorced shocks new world than eat\nNorthwest public broadcasting is a channel for ideas and stories that expand your horizons every day\nIf you're a member thank you for your support listeners like you and businesses such as book people have Moscow and Hodgkin's drug and hobby also support the resource of lifelong learning learn more at N. W. P. B. dot org\nContinue insurance who ran through the afternoon today is ... ... with wins to twenty five miles per hour pulling sixty sixty four degrees and Louis to rain luckily overnight lows loaded mid forties on the bright side you're ...\n... to ...\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\nMm\n\n\n\n\n\n\n\n\n\n[noise]\n\nMm\n\n[noise]\n[noise] Mm\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n", "show_name": "PRI's The World", "year": "2018", "city": "Moscow", "day": "26"}