{"month": "10", "state": "ID", "station": "KRFA", "content": "The programs you enjoy in northwest public broadcasting I made possible with financial support from book people of Moscow located on main street\nAn independent bookstore offering new in classic titles in addition to a selection of cookbooks local publications gifts and more open daily with announcements at book people of Moscow dot com\nNorthwest public broadcasting care if a Ninety One point seven Moscow plumbing can WB Ninety point five quarks in Lewiston and can W O Ninety point one cotton wood cringe fell NPR in classical music\nCommunity service of the Edward R Merrill College of communication that Washington state university\n\n\n\n\n\n\n\n\n\nBoy case that that day you know what I Love it it's an are you done by young ... crash in ... parts per the marriage of feet got adopted by eat felonies teen hurt here that's our one o'clock hour opener northwest public broadcasting\nYou can find today's music playlist that N. W. P. B. dot org hello good afternoon I'm ... and hope you're having a crate tape so far thanks for spending it with classical music on and W. P. B.\nI'm looking forward to sharing in the afternoon music with you now the the start of all things considered ad for including a groundbreaking symphony infused with Chad and blue\nIn the meantime now we turn to your ... one of the pillars of early Eighteen century German music a contemporary of stock in ten and I in fact all three applied for the same job that eventually went to Bach who was by the way the forest a choice\nBut to one of ... charity performed by the Philadelphia Orchestra called ...\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\nEmily and the guy was filing it and ... there with the Philadelphia broke orchestra\nA concerto by Johan free drinks flash at the northwest public broadcasting and W. P. B. dot org they close the chance to get in touch with your inner child come next with little character pieces by BJ called children's games\nNow most public radio stations have fun to drive to raise money for programs and music that enrich your life and most patients then from five to as many as Fifteen days asking listeners for donations but you won't find that here northwest public broadcasting has a tradition of one day ... drive\nThat's only been possible because listeners have responded with their financial contributions\nSo if you would like to keep on Dr short on N. W. P. B. become a member with your donation on super Thursday October eleventh\nIf you've never made a pledge your first time gift is more important than ever before remember to super Thursday fun to drive is October eleventh mark your calendar enjoying it and thank you for your generate support a bouncing ball\nWe're here by his during you know you know this seems to be said she'll be like a big party\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [laughter] [noise]\n[noise] [laughter]\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n[laughter]\n\n\n[noise] [laughter]\n\n[noise]\n\n\nFrom the composer who gave up one of the most popular opera in the world for Carmen\nOutlet for fleet of character pieces called children gain if one today by the French piano playing history ... and ... and that back at northwest public broadcasting with today's music playlist at ... dot org\nAnd free listening and for your general support us music on the station and in your community I'm ... and it's one forty facts\n\nNorthwest public broadcasting bases program support from discovered Dayton, Washington inviting the public debate in the end you will tour of historic architecture Saturday October six days celebrating yesteryear with\nScattered rain showers and got the wind is African Union tonight that's up to forty miles per hour decreasing after midnight with overnight when I was in the mid thirties to lower forty tomorrow will be funny my career in cooler\nHigh in the upper ... to mid sixties plenty of Moscow fifty seven sixty four in ... valley\n[noise]\n[noise]\n\n[noise]\nOoh [noise]\n\n[noise]", "show_name": "PRI's The World", "year": "2018", "city": "Moscow", "day": "02"}