{"month": "10", "state": "ID", "station": "KRFA", "content": "Northwest public broadcasting has the mission of enriching the community to produce which engage in late ... entertain it's possible thanks to the financial support for ... like you and local businesses and organizations like within hospital\nIf you to want to support the public station visit N. W. P. B. dot org for more information\nNorthwest public broadcasting care if a Ninety One point seven Moscow Khomeini can WB Ninety point five quarks didn't Lewiston and canned W O Ninety point one cotton wood ... NPR in classical music community service of the Edward R Merrill College of communication that Washington state university\n[noise]\n\n\nPeople are music being made twenty century Mack the nights are originally from Kurt ... three penny opera house in Nineteen twenty eight Andre custom on its lead to New York fill in this recording the original orchestrated by Kurt file\nUp here in northwest public broadcasting part of your Monday afternoon classical music [noise]\nHello I'm ... good to be with you this afternoon here classical music on ... continued now see the start of all things considered at four but the point at seven and more classics with GT yelling tonight at eight\nO share in some Gershwin later this hour his first work for the concert stage but first Bryan his bold and passionate ... not a Jew featuring challenged Andreas Diaz and can is Samuel standard\n\n\n\n\n\nMm [noise] Mm ... [noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\nNa\nMm\nMhm\nThen\nIn ... I'm In an online\n\n[noise]\n[noise]\n\n\n\n\n\nWhen you look\nNa\n\n[noise]\n\n\n\nNa na\n[noise]\n\n\nAnd\n\n\n\n\nThem to\n[laughter] they're going to be in the debates because if you're not\n\nKnow\nProfessor at age ... known as the ... the day like a a member of the\nDuring the\nTo be\nVery\nMoving\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]", "year": "2018", "show_name": "PRI's The World", "city": "Moscow", "day": "08"}