{"month": "10", "state": "ID", "station": "KRFA", "content": "If you're promoting an arts event let our website help you at N. W. P. B. dot org click on events and right there on our community counterfeiter you can some of the details about your concert or exhibit which will be seen by anyone looking for things to do in the community\nAgain that's an W. P. B. dot org under events\nNorthwest public broadcasting care if a Ninety One point seven Moscow Pullman can WB Ninety point five quarks didn't Lewiston and can W O Ninety point one cotton wood range fell NPR and classical music\nA community service of Edward ... communication at Washington state university ...\nMm\n[noise]\nMm Mm\nMm\n[noise]\n\n... ... ... ...\n[noise] [noise]\n[noise] [noise]\n\n\n\n[laughter]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\nMm\n\n\n\n\n\n\n\n\n\n\n\nMm\nMm\n... Mm\nA lovely melody bringing up a little piece to a Monday afternoon it lead the grim a dream of love and the third and is that by today's birthday composer France lead was born on this day in Eighteen eleven\nThat leave us dry mid number three being one of ... most popular work a performance today by cloudy up about\nA very good afternoon you happy Monday I'm ... more music of list still to come this afternoon continuing the observance of his birthday with a ... do well Andy Hungarian Rhapsody you might recognize from Saturday morning cartoons\nFirst though hide in the so called the father of the company and the unique finale of this work has earned the nickname farewell it's heightens forty fifth performed today by Christopher Hogwarts Academy of ... music\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\nLeast ... start to your week high temperatures this afternoon in the upper sixties clerks to sixty eight sixty nine in Moscow with mostly clear skies overnight loose in the mid thirties to low forties\nYou Tuesday and Wednesday also looked to be mostly sunny slight chance of a shower tomorrow afternoon around Lewiston high is in the mid sixties to low seventies\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise] Mm [noise]\nMm [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nMm [noise] [noise]\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\nMm\n\n[noise]\n[noise]\n[noise]\n[noise]\n... [noise] [noise]\nMm [noise]\n\nOne of the twentieth century great guitarist performing their Christopher ...\nThe Arab ... pi Francisco tata got himself and his guitars of Spain he wrote this could preach oh in Eighteen eighty eight very good afternoon you hope you're Monday has been a good one so far I\nMean I'm ... glad to be with you this afternoon classical music now up to four o'clock in the start of all things considered\nOther national attention on Washington's fifth congressional district where Democrat Lisa Brown recently raised more money than seven term incumbent Cathy McMorris Rodgers\nThe candidates will meet in debate Wednesday evening in Walla Walla and you can watch or your life on northwest Public Broadcasting's radio and TV station\nThat Wednesday from six to seven on northwest public broadcasting\nMusic of handle now his concerto growth number five\n", "year": "2018", "show_name": "PRI's The World", "city": "Moscow", "day": "22"}