{"month": "10", "state": "CA", "station": "KOGO", "content": "So they continue to ignore members of their own party with these allegations they know what I'd like to know do I want to know which senators spent Seventeen million dollars in tax payer money to cover up there on sexual indiscretions\nThere on sexual harassment and assault against their staff or what if somebody sitting on the Judiciary Committee\nKept a secret in the U.S Senate and the Congress all the private settlement Seventeen million dollars never got out did it\n[noise] no I Do here we have people lecturing another example Kamala Harris she's talking about integrity and she's like shrinks Brett Kavanaugh at that hearing Kamala Harris got her start on a\nBrown capital couch she with having a public affair with a married man when she was assistant da and San Francisco and Willie Brown with the mayor of San Francisco so I don't need a feminist like Kamala Harris\nDining out I should live my life or how they're short lived their life and she has never had to explain those types of actions rather than me to say about a woman having an affair with a married man what about Mary mountain the whites\nDon't know how about Cory Booker sexually molesting a Fifteen year old girl\nUS Senator from New Jersey no big deal right\nRight I think Neal\nOh we got her on American Bar you're the best so we'll see what happens in a few days but dye pray to God Brett Kavanaugh is confirmed and all of his crops thrown out only be the\nDemocrats though we beat this that's kind of politics the personal instructional character assassination at all we need to make sure that we show up and numbers that they can't handle and we make sure that we keep the house and keep the Senate and even grow the house\nMegan bar if you're a great American thanks for coming on the bill Cunningham show thank you very much thanks so much about violence continuous more Kamala Harris cutter jobs on the casting couch Amir Willie Brown who was married to continue with more built counting him live with you every Sunday night\nRadio six on [noise]\n[noise]\nAre you considering safe to secure your valuables or firearms let's face it seeps are not very attractive they usually end up getting stuck in the garage or in a closet\nWouldn't it be great if there was a seats that had the look of a beautiful empty so you could display it in your living space as an ... while also having easy access to it while there is check out the rhino iron works safe at rhino safe dot com\nAmerican Made an antique styled our Shapes Our part art part furniture and all security\nAnd if you liked the classic look of our rhino iron works apes we also feature beautiful matching tool chess and furniture with hundreds of thousands of satisfied customers we've built our reputation on having the best bill to best looking and most convenient safe with great service in warranty\nGet on line financing and free curbside delivery so go what's the best\nAnd gets style convenience security and true peace of mind ... dot com today that's rhino save dot com rhino safe dot com\nMessaging ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree to further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree in his little lists sixteen months one hundred percent on line\nTo find out more text market to seven nine six four or five\n... N. A. R. K. E. T. to seven nine six four or five\nStar cheer on line NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online text market to seven nine six four or five\n... N. A. R. K. E. T. to seven nine six four or five\nRight futures begin with Matt ... this fall give your child a fresh start with improved math skills that help him said and reach their academic goals all year long\nOur expert instructors teach each child individually using customized learning ... build confidence developed critical thinking and boost raisins scores\nNewseum has the authority and math education with over nine hundred learning centers worldwide we're changing lived through math\nSchedule your freezes it today and one of our seventeenth San Diego area centers find yours at ... dot\nCom find out what your whole was really worth than today's market talked or expert Chris Keller it ask all of their homes or dot com that ask how old are the home ... dot com did your homes sold with Chris Heller gulp eight hundred eight hundred twenty nine Seventy eight eight hundred eight hundred and twenty nine Seventy eight\nHey John are being done Greitens receipts or discovered a fantastic way to relieve old ice cranky muscle aches enjoyed planes that really slow me down\nNew ... pain relief great writing ... really crank contains no one but two active paint forty ingredients that would fight to give me lasting relief ... we're on the plus ... based of nature really good stuff and the land down ...\n... ... ... and has a place in ...\nWhen I put it on a field ... ... it'll would for you to if it didn't do the job with a back with a one hundred percent money back guarantee come on\n... pain relief cream today and do it on to rebel and the pope and Joe ... funny night serious pain relief\nAvailable HEB Amazon and raging ... dot com raging K. A. K. A. P. O. dot com\nYou own a appreciated investment real estate are you tired your property management and penetrated issues are you concerned about potential rent controls and other government interference coming to the San Diego real estate market place would you like to learn the strategy for your property [noise]\nWhat is your best move today will you can find the answer to be easy and many other questions from a panel of trusted advisors will discuss exit strategies and how to self image seller's market in the capital gains tax potentially increasing income in lowering income taxes\nRemoving exit strategies for appreciated real estate or upcoming free educational complimentary one shot Wednesday Seventy seven thirty AM band Saturday after ... am in university town center reservations corner which shop dot com like human ... dot com\nRecall six one nine for a three ten thirty one that's six one nine forty three thirty one don't miss these workshops on Wednesday October Seventeen Saturday October twenty again visit\nPhoto shop dot com news radio\nFiber optics move crazy amounts of data and even crazier speeds and ... and is be one hundred percent fiber optic network with ... connection you'll get the fastest Internet available download speeds up to nine hundred and forty makes TV phone at a two year price guarantee\nOver Seventy nine Ninety nine per month on line with a two year agreement plus get two hundred dollar shorter range of Google in that smart um devices and a one hundred dollar bills are\nBelow six hundred coca cocoa dot com\n[noise] and [noise] the only\nKind of got the great American ... thank you for listening to specially with when our route and\nMrs ... who's the wife the widow of a shot down dead New York city\nPolice officer ... see what happens later this week I'll tell you by next Sunday we are going to know if we have troops justice in the American way or not I stand for square with Brett Kavanaugh I pray to God you do to continue with more see you next Sunday night bill counting undergrad American live with you every Sunday [noise]\n\n\nFixing the rules for alerts and offers to be automatic text message Mr dean originally applied\nHello America this is Martha Stewart now you can cook great tasting dinners at home\nAnd it's easy to forget about frozen foods and take out and said during me for great home cooked food introducing Martha him early spoon Neal kittens repression fresh ingredients with my wonderful easy to follow recipes delivered break your door\nAnd right now you can try three for free for a very limited time on offering three free Martha and more at least for meals to everyone\nAnywhere imagine cooking butter based at stake ... pork tenderloin key stuffed chicken and more with new recipes every week Mars and mercury spoon helps you put a delicious dinner on your table and around thirty minutes\nFor three free meals and free shipping text yum to two four six eight ten just text the word yum to two four six eight ten for details hurry three free won't last long taxed yum to two four six eight ten\nFirefighter ... firm firehouse subs introducing the new firehouse pub stakes a savory steak crispy fried onions in origin Belgian beers cheese sauce on top court limited time more to yours firehouse subs dot com remember a portion of every ... helps provide lifesaving equipment first response\nSubs enjoy more subs save more lives somebody's I'm only\nGoing to present I witnessed interviews with inanimate objects\nThis is willing to call and live on the the never return lightening storm here to describe the advanced TB tray\nI was watching football and holding a plate of meat loaf went up bam a bolt of lightning slams into the apartment blowing out the TV and surround sound anything you could have done to help ma'am I'm a full table not an electrician your TV tree can help you in a lightning\nStory from a world renowned university if you answered yes to any of these questions Arizona State university is the perfect school for you\nArizona State university offers over a hundred and fifty highly ranked degree programs a hundred percent on line to learn the same degree as he went on campus from wherever you are on your schedule plus ask you one line except most transfer credits\nFor information school two three five five one seven learned for yourself by the wall Street Journal ranks asked you stay in the nation for producing the best qualified graduates and white eating\n... truth to boycott cold brew teenagers can communicate in your late ...\nThat Philip brought his little brother on our mission into orbit\nKnow I Can't believe how easy it wants to save hundreds of dollars on my car insurance would die co\nMuch down now that's starting now\nSeven percent of ask you grab recruited within Ninety Days of graduation learn to grow learn to succeed and learned at the right at Arizona State university to learn more about ASU online degrees tax school two three five five line seven to C H O L L two three five five one seven\n[noise] use peyote geo ham why I have to go live\nThey might be in business Fox's chat per gram California passes a law for net neutrality and the Justice Department filed suit the new law aimed at preventing Internet service providers from blocking our throttle in traffic or offering paid fast lanes known as paid ...\nThe Trump Administration wants to deregulate broadband Internet service companies freeing them from utility style rules which could temper innovation supporters of net neutrality insist the rules are necessary to protect equal access to content on the\nInternet Fox News fair and balanced [noise]\nWell 'cause the now get evening stopping traffic on the one sixty three Norris between Clinton street in university avenue\nOr works down in university city eight oh five north from the ... the teams in the early boulevard the right lane is are closed until fine am slow drive a national city on the far east between five and national city boulevard\nAnd I thought from Geico motorcycle\nHe took Fifteen minutes to purchase the gas station ... [noise]\nEat the gas station ... and regret the gas station ... as you presented numbers to the board\nAn emotional rollercoaster I think we are so many people here\nAre webmaster Greg bishop and I have pulled together our usual assortment of items and oddities called from various media sources around the world we call it naps news and you can find it on the coast to coast am website\nOr two of the stories selected for tonight relate to missing people one is a story about notable missing person cases throughout history cases that remain unsolved in which received a lot of attention when they happen\nAnd there was a second story sent to me by one of our listeners about a very specific missing persons case involving an airship of the crew banished\nAlso tonight five ways that space travel can drive you insane that's for any of you planning to join the astronaut corps maybe up on what have you on mosques missions to the moon and a story that I like reading it's a study to find out if most people care more about dogs that they do about other people\nI think we can guess the answer to that one\nThose stories and more intimate snap news while you're there check out out of become a coast insider it costs about Fifteen cents a day if you use it subscribe for a year gives you access to a vast archive of programs I think about a thousand of them you can listen anytime you want as often as you want plus there are other benefits for members\nAnd you can also see how to subscribe to George ... TV program beyond belief\nIt often looks into the same kind of mysteries and unusual phenomenon we explore here on the radio\nThat let's assume that position bringing the dog and cat fight a good spot near use that they can listen to to tonight's program as well put on a pot of Joe slip into those ... maybe the flannel ones it's getting cooler out their\nPlop down in the ... the spot turn down the lights and turn up the radio because we're about ready to rumble in a moment David polite is missing for one one land air water is the latest research I'm George nap in this coast to coast am [noise]\n[noise] this is Richard Haass throw owner for carnival or a research international\nWe're announcing the study on cat that was recently performed by carnival or research international this civil blind studies in the international general of applied research of medicine and titled the effects of the administration of carnival on clinical signs in cats\nPeak challenged with feline herpes virus won the vets are heading this study we're laying a contrarian Stevie em\nAnd Michael lap and TV M. P. H. D. taken away George\nThank you rich we have indisputable through for the power of carnivores for nature [noise]\nThis double blind study is being peer reviewed in an international journals and there was also the study Seventy five percent of the cats no longer showed any signs of their immune condition [noise]\nThis is big news folks the forthcoming study will include cats and dogs to governments shortly we'd like to think that the Michael lap and ... him for his amazing assistance in putting this altogether [noise]\nWe are also looking forward to this study with people in the United states [noise]\nNow that's carnivores ... dot com C. A. R. N. I. V. O. R. A. carnivores dot com carnivores dot com or call one eight\nSix six eight three six eight seven three five that's one eight six six eight three six eight seven three five\nCalls today carnivore carnivores dot com\nI just said he's nice looking again count as happy as can\nClaim a go cannot guarantee you will be close to the other plans on hold\nFor like a legal team can accurately verify clams even experience the complex human emotional state known as happiness as an important modest living have somewhere on the ocean floor with no arms legs a wireless access what's there to be happy about uh climbs all like oh I'm so happy I didn't get turned into New England clam chowder today pronounced originally I was taught all called off so fun to say what were we talking about a young\nGuy co Fifteen minutes could save you Fifteen Percent or more news radio sound Britain go go [noise]\n\n\n\n\nWelcome back you know I don't think a day goes by went up I don't get at least one or more messages from coast listeners asking me witness that missing for one one guy coming back Wednesday ... going to be back on the air\nAnd I always tell them not soon enough we get more requests for Dave than any other guest that I've experienced since I've been with the program for ten years and that's a that's because he always brings the goods I Am jazz that he always allows me to get the first interview when he unveils a new book and like the other books this new one does not disappoint\nA Davis you probably know spent Twenty years in law enforcement then worked in the tech industry for a bit but found as true calling as an investigator of unusual disappearances and his work in that area has become a phenomenon known all over the world multiple books a documentary film\nAnd maybe some other surprises become Dave great have you back\n[noise] George I'm always humbled that anyone even want to listen to me though or appreciate the invite\nOne to say you know I noticed something as I was reading the new book today that you make some personal observations that I have not uh I haven't seen it you go this far in the other books are insights\nInto your own emotional reactions to some of these cases and it seems clear like the subject really gets to you and you've got I think eleven hundred and thirty five cases that you profiled over the years thousands more they'd be looked into\nSome of them really seemed to get into your head though I I think in part because of similarities or some of the missing to your own life right\nYou know I think that's true um I've been very fortunate to me family of people who have been lost\nAnd when you meet these people it really brings brings home the emotion and there's a lot of parallels to my life with a lot of these families and I've written about people that remind me of myself a lot of times and uh\nI've put that in the book just recently ... probably because it's it's more of an evolution of my writing and\nHopefully people see that you know have these people are really really good people these are the drags the society these are the upper echelon and it it's a conundrum to me why I don't find people that are down and out in life that are disappearing but it's it seems to me that it's always the\nHigh rollers the people that are high performers that are disappearing\nYou know one place in the new book you mentioned how as a rule you did not reach out to the families of the missing now sometimes you meet him ... due to various circumstances but in general you don't call somebody up out of the blue and say hey can I talk to you about your dad loved one are you missing loved one because it seems like an invisible line that you don't want to cross over but I Wonder\nHas the success of your book help in the sense that these families now reach out to you that they're unsatisfied say within the search jeopardy or something and they're they're turning to you for some help her answers\nIt has happened and uh I don't want to inject myself into a search or into the turmoil that evolving with somebody disappearing now somebody reaches out want some help absolutely I'm going to be there I'll do everything I can\nAnd there's been cases just recently where that's happened and I've been ground to help and ah\nI've kinda guided them and it it seems that a lot of these families and covered the same sort of issues time and time again and it's frustrating as heck to sit back and hear the frustration and their voice a lot in common one is is it seems as though when jurisdictions\nStop searching they get to a point seven to ten days and they say hey there's nothing else we can do there's no place else to search\nA we're running out of resources we've got to stop well many times families and friends rally at that point and they get a group together and they keep searching for what I tell these people is you've got to get a copy of those reports that the jurisdiction wrote the search and rescue reports\nLaw enforcement reports see who they interviewed who they talked to were they searched the effectiveness of the search or the areas that they completely eliminated in the in the areas that they thought that they still should search more because without that you're really searching blind\nAnd there's been instances just lately where people have said no they said they won't give us anything\nI I find that baffling well\nI mean that's how they treated you I was going to ask you the same question about different agencies I Know how the national Park Service feels about you and that they are we should anybody who has not heard your earlier interviews or is not familiar with the books you might be listening tonight\nI'm maybe we start there where you can explain the history of your interaction with the national Park Service the forest service\nGovernment entities in general because they've shut you out I mean I guess I I'm interested to learn that they're doing the same thing to the families of the missing but it's really kind of clear over the big picture that they don't want to help solve these mysteries\nYou know it it's a sad note on humanity if that's the case but there is a lot of obstruction so when I started out I was told by a couple of Park Service rangers that they had found\nThis appearances in their parks where they had worked that bothered them didn't make sense when they tried to find information that couldn't and they thought somebody with an investigative background on to be looking into it\nAnd that's sort of how it all started and I filed a series of freedom of Information Act requests against the national Park Service they have the largest contingent of federal the train police officers and the national park police\nNews radio ... Stevens camera and the U.S reaching a deal Sunday night for candidates to stain of free trade agreement with us and Mexico the new deal replacing the twenty four year old north American free trade agreement the FBI spending the next few days interviewing those making allegations against Supreme Court nominee judge Brett Kavanaugh including Deborah Ramirez\nActually agents who do background checks or talk to the people ... their board named the committee did they will tell the ... the committee a and a better obeyed it it'd be done in a few days I trust the FBI\nSouth Carolina GOP Senator Lindsey Graham on Fox News Sunday mornings futures in Las Vegas on Sunday\nOr your clergy members holding a visual honoring fifty eight people killed and hundreds others heard\nAt the root Ninety One harvest music festival one year ago Fox News we're bored you decide\n... by ... making their way through normal heights north ... boulevard wrecked up against the right shoulder wall cj ... and the scene was suspected or delays is we need to ... stones or up if they hadn't university city north don't need to find the twenty fifty students a rental valley robes\nToo rightly sick in a way that's going to wrap up some time before five AM Ninety four ... five crash it begins to send a divider walks look you lose their Fifteen or connect to the west on fifty two solar cars spin out of the ... transition road I'm wrong and dug in with a look at your scene Diego traffic\nAnd the judges and I'm here to tell you about I think it up a new initiative to activate student power teacher\nLed learning Roger students and teachers can use for rate learning experiences in your classroom today joined us in ... new\nZealand appreciated in real estate or you target property management and soon and finicky shoes controls to join a team of experts in the coming three educational worship October seven seas in October twenty you\nCan easy to gauge finds you can't make deals you won't believe\nYou love you saw change reminding me ... ... even the idea\nHe never going to let you only watch any\nHuman UPCs reserve and only ... six one nine regions of the one\nEight Sean Hannity here have you found that once you've paid all your bills every month is like ...\nWhether it's our hearts lungs or other organs were diagnosis tends to make us uneasy at Kaiser Permanente our specialists care for you and found you working together and creating a treatment plan specific to your diagnosis in total health\nFrom primary to specialty can't find reinsurance and a great team of health care professionals committed tea or healthy recovery didn't keep eat out or\nThe love for you well would you like to lower your monthly payments and free up some extra cash well your property is probably worth more today than it has been in the last few years so guess what you can put that money to work for you and you need to call my mortgage guy in San Diego Kevin lions he's the president of anchor funding Kevin how are you\nSo non great we just help some list is with the cash shot refinance on their home forty eight thousand five hundred dollars in cash back and they lowered the mortgage payment bought hundred and sixty dollars a month\nRight that's amazing things Kevin now think about what you could do with all that extra money all takes five minutes on the phone with Kevin and see how he can help save you money they'll call Kevin lines a one eight hundred three three three fifty one fifty seven their online at anchor funding dot net that's anchor funding dot net\nEqual housing ... between the reason we went to Seventy six who writes in an animal is there were two or three six one nine not Olympic gold might lose made or arranged pursuing a primitive because like I live in New England is long Pelham our solar a local name you can trust seven six zero five zero four zero three eight eight\nTo leave she lives lane Theresa\nHey all for Health News you want to know\nThem cats cats unions even let them get they were all able great highlights great rains claims\nThey\nGet a to point to eight percent a PR auto loan the California coast credit union was no payments for Ninety Days off\nFrom yelling new you need to know\nWhat the boys\nAre you a gang rape tests no\nYour radio is easy to use ads for music and re\nDownload the free I hard radio ... today\n[noise] [noise] to\nSee\n\nMe\nAnd\nAnd\nYou are listening to coast to coast am with George\nThough the ah they say this imitation is decent serious form of flattery um it can go too far though of the success of David ... missing for one one books has inspired other people to sort of\nBorrow his template and to create their own uh I'll put that deals with the same subject which I guess we all need more information on it but some of gone too far there are people pretending to be him\nAnd in a moment I'm going to ask Dave about that and then we're going to jump into some current cases new disappearances that or maybe you can shed some light on out there in coast to coast land we'll be right back\n[noise]\nTake one atom of nitrogen and bonded with one atom of oxygen boom you just created nitric oxide\nA miracle molecule your own body makes such as your cardiovascular health keeping you vibrant but as we all age our bodies need help generating more natural nitric oxide super beach by human has harness the power of nutrient enrich beach\nAnd created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body\nOne teaspoon of super beach daily supports your cardiovascular health and blood pressure levels we're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty day supply of super beach and free shipping with your first purchase\nField a one plus one equals boomer effective superb each call one eight hundred and five one five zero zero five three or go to ... beach dot com today\nWarning if you're buried in debt you can't afford to not let the credit card companies make you think that you have to pay it all back because you don't what the credit card companies don't want you to know is that there's actually a way to get debt free without paying off your entire debt\nOr going bankrupt if you have five thousand dollars or more in credit card debt you know have the right to let us settled that debt for a fraction of what you will for free information called debt free dot com now at one eight hundred four hundred seven one four or five\nWill leave and show you how much money you could save if you are struggling to pay off your debt do not let the credit card companies make you think that you have to call debt free dot com now for free information on how to get out of debt faster than you ever thought possible without bankruptcy\nWe offer a guarantee with no upfront fees so there's no risk for the free information you need a call now one eight hundred four hundred seven one four or five\nThat's one eight hundred four hundred seven one four or five\nOne eight hundred four hundred\nSeven one four or five\nNews radio six hundred\nGo go [noise]\n\n\n[noise]\nDavid blight as I mentioned uh during the break there that uh you've got some imitators out there are people who have written books similar to yours as well as people who've gone further than that pretending to be you can you address that for a moment before we jump into the cases\n[noise] for one of the most frustrating parts of you know in the public spotlight I go to conferences all the time people come up to me and they say so you said this how did you come up with that and I'm thinking I never said that and there's the serious a YouTube sites\nThat have the named David ... is missing for one one missing and national parks are all frauds they're not me there are people that are viewed my name to get innocent and listeners to get on and every time you click through they get paid by their Google out\nThe only site that has me is a kennel missing project YouTube site all the rest are not me in fact about eighty percent of them when you click in and you listen if you don't know if somebody else talking about some other topic and it's not even me at all so\nI tried to tell the people don't trust you to really don't even listen to him a month I cannot missing project site that's the only real fight that they're going to get honest information from\nAll right um talk for a moment about search and rescue\nParameters because that that information becomes key to you picking the cases that use euro in on I mean there are metrics there are there's data um for search and rescue um how how they proceed and and I are huge database I Would think that gives clues about which cases stand out as being unusual\n[noise] so that the data that you're trying to get to is really in the reports that they generate\nAnd the national Park Service one won't volunteer up any of these reports that name as the date and a specific time and that person has been rural to be a missing and presumed to see\nAnd are found impossible distances away sometimes they're alive amazingly enough but I'm often found impossible distances away and there is no way no way they could walk there on their own or talk about that but I'm gonna\n[noise] so there's a couple of sites that talk about my work and talk about these cases and a couple of people have chimed in and said well you know Dave talks about people in this books that have been found and there's no mystery there they obviously haven't read the books and they don't understand the rationale behind why these stories are important [noise]\nSave you got a two year old child that's in the middle of the wilderness with their friends or their family and they disappear and that child found say three thousand feet higher in elevation and six miles away in a day and a half\nA well I don't know many parents think that there are two year old could make that track [noise]\nBut that's not it I mean when I started to accumulate the data on it in off the grid the book before this one I had a list that accumulated\nThat probably there's fifty a cases in their starts off with the case let's say a four year old missing in Australia found five days later forty five miles away across the desert\nOr four years old I'm there's other cases where two year old in Florida found twenty miles away through the swamps ah another two year old in Australia from Fifteen miles away in three days two years old\nA three year old found Fifteen miles away twenty four hours not possible in my book\nBut I mean there's a long long list of these and why did I start to accumulate that data because in search and rescue manuals that says that a two year old should be found Ninety five percent of the time in a radius of two miles or less from the point laughing at these numbers absolutely blown to smithereens\nIt's something search and rescue people don't want to talk about don't want to address that want to even think about\nAnd I can understand why because there's no way you could plan a search\nThirty miles away for a two year old it just you don't have enough people to do it and you have to work for that Ninety five percent tile but the problem is in all these books they don't talk about the other five percent anywhere I'm probably the first person that's ever talked about it\nBut as you state how are these kids making this extraordinary distance\nAnd extraordinary heights\nWhen I go to a conference I always ask people how many people in the room or parents you know Ninety percent of people raised their hands and I said if I said okay you're you're just going to set your child down in the dirt on a trail\nWalk away or watch the child with the child's gonna do for the next hour\nThey said well maybe it'll crawl under Bush and go to sleep maybe the plan that dirt for a while maybe they'll run down the trail for a little bit get upset cry and then go to sleep\nAnd I said how many how many parents and your think your kid would run up hill nobody raises their hand I mean it does happen but it's pretty rare but I have all these examples where these heights have been achieved by these little camp\nWhere they crossed a couple of mountain ranges or you know an incredibly difficult terrain sometimes without any shoes on a you know he's going to move\nMe and we talked about a two year old boy that they just she traveled nine to twelve miles in nine hours over two mountain ranges\nAnd he was found face down in snow the next morning unbelievably alive and we found that guy years later and interviewed him and he has no recollection of what happened in his his mom said we couldn't believe we found them and we couldn't believe he was alive\nYou have a case in the new book ah in Southern California the Lucerne valley below Hanks this was from back in Nineteen fifty six is the child is five years old at the age of disappearance\nAnd you do the math on the bill I guess if he had walked nonstop for twenty four hours you have to go point six miles per hour\nBut a kid's not going to walk for twenty four hours with no food or water\nUm it it seems just impossible\nUnless somebody pick them up for some some thing or someone picked him up and slapped him their\n... and and the reason these cases have significant is that let's say you report on a child who's the duck today downtown Vegas\nAnd they're found in West Los Vegas three hours later six miles away you know it sure is probable somebody put 'em in the car and drove from there but when you're talking in the middle of the world and if that's not happening and\nWhen you talk about this happening when the people in the party didn't see anybody never talk to anybody and when they check the trail walks and nobody else was there nobody else saw anything nobody saw any cars\nNobody else was there so how did that child make that distance in that time doesn't make sense\nOr in the new book or it's law L. A. W. land air and water and a land cases you've talked about before but you've got some new ones including one that happened in the organ pipe cactus national monument Arizona\nReady to take a break now when we come back this one has really creepy and even some of the investigators who are working the case admitted it was really creepy and will tell you why in just a moment talking to David ... is going to take a break the ... Parsons project break down into the break [noise]\nThe ... is great news if you're a ... for simply want to enjoy our website on your boom visit ... dot com on your iPhone or Android roses [noise]\n[noise]\n\n[noise]\nWhat's going on I was just lugging in and checking on our account and I thought we were going to do better this year I Know I've been trying to watch what I spent no more stoppage your coffee for me I don't think\nClasses a what a great [noise]\nBut then the next\nThing you why I've got Clinton is when you use your capital one venture to book and pay for a room on hotels dot com slash\nOh thank you well have you on the phone did you know that with the capital one ... unlimited gamble miles on every purchase you\nThink about unlimited double miles and everything you by not just in purchasing cell I guess we should call this your wake up call from capital one\nLegendary may apply when did it become OK for men to be lazier softer fatter we need to bring them into this country back to greatness and it's easier than ever ageless male Macs a patent pending formula with an agreement that helps boost your total testosterone\nPromoting greater increases a muscle size and twice the reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide\nMessages that are having the rules were returning to listen to Nick and Vicki story about the quiet ...\nVery loud and Hans and very draining to be next to somebody who you're trying to sleep and we've got that Loughner reverberations\nYou're always hoping she gets a sleep before I come up because I started getting the point where I was concerned who I knew she wasn't going to get much rest if I came to the same time you know she's been so used to me ... all the\nPresent we should be doing stuff\nOut of your budget Boston\nWill tell us when you want to pay for insurance and I hope you find out you know you're going to get you pumped down down down down down and I hear your budget\nOh wait given up copies gonna do it we need more income for our day to day not to mention sending it said something for the kids' college in our retirement man I Wish there was an answer\nFor most of us no one ever taught us how to invest yet it's a skill that we all need if you're looking to generate extra income\nOnline training academy leader and financial education can help uh ten one of online training academy free introductory classes and they'll show you how to create monthly weekly or even daily income using that pattern to supply demand strategy plus this month\nI Know it's been rough going ever since people found out about your archipelago ... Matt harmony but you will bounce back I mean you're the guy always helping people find coverage options with an enterprise tool it should be you giving me the pep talk now get out there that high note and take mad harmony\nToo much they're going to get things just right by progressive name your price to tell us what you want to pay and we'll do find coverage options for like\nThey'll send you home with their free investor kit loaded with guys are smarter investing in lessons from the pros just for attending\nRegister now by calling eight seven seven three nine nine trade eight seven seven three nine eighty seven twenty three OJ class dot com eight seven seven three nine nine trade for OJ class\nThis month or two factors and night vision headline because of the ten dollars off with ball comes longer nights and\nVisibility luckily our head lamps up superior elimination which helped reduce the chance of an accident [noise] see better Dr Saper with up to ten dollars off to pack up all night vision wealthy parts ... people snapping dot\nCom [noise] All right we've got a brand new waves\nOf your one grain one ... one green bread All right what about do grain bread let me get an egg overdue rain what about you image onto the permit jak no from Jimmy Johnson three three grains I've read read up on for ordering who wouldn't want or range Jon Delano let's do five five six seven eight one of my brain a range of John Still and oh All right what about nine ...\nWe'll take your that's your job new nine green we the only one going by so dry our new nine green we do me Jon we were getting\nMessages that are reflecting the rules are returning to listen to Nick and Vicki story about the quiet ...\nVery loud and stand very draining to be next to somebody who you're trying to sleep and we've got that lounge reverberations\nYou're always hoping she gets a sleep before I come up because I started getting the point where I was concerned she wasn't going to do much rest if I came to the same time you know she's been so used to me ... all of\nThem are you putting your retirement savings and a four one K. IRA or investment accounts been I have one word of\nAdvice stop experts warn of a stock market crash any day now and you could lose ... percent or more of your harder and saving again\nBut you don't have to lose a penny there's a better safer way to save for retirement and you can learn about it in a free report this method continues to grow your money even when the market troubles to get this free reports go to a bank on yourself dot com that\nBank on yourself dot com bank on yourself dot com\nIf you're considering going back to school I guess the following question do you need the flexibility to take classes on your schedule he college credits unique transferred to earn a quality degree from a world renowned university if you answered yes to any of these questions Arizona State university is the perfect school for you\nArizona State university ... over a hundred and fifty highly ranked great programs a hundred percent on line to learn the same degree and see what I had that from wherever you are on your schedule plus ask you one line except most transfer credits\nFor information tax now his three five five lines haven't learned for yourself by the wall Street Journal ranks asked you stay in the nation producing the best qualified graduates and white eighty seven percent of ask you grab recruited within Ninety Days at graduation learn to grow\nAnd they're just exceed and learned yet the ride at Arizona State university to learn more about you online degree now he's resigned sidling setting out ... he's three blend in news we\nDo go\n\n\n\n... let's jump into the case of Carol Turner this was pretty creepy when did you learn\nSo for people who don't know national monuments are part of the national Park Service that's their property and they patrol it in their national park police are there\nWell there's a location called Oregon or Ga an organ pipe cactus national monument\nAnd it's an Arizona far southern part of the state right near the border with Mexico law in February third Nineteen Seventy one a woman thirty two years old named Carol Turner who was a student at the University of New Mexico\nDrove there and was going to take a few days vacation and break from school and kind of walk around and she was inquisitive smart athletic brilliant some people called er\nWell I stumbled onto this case and saw it and some archive somewhere and I immediately wrote to the Pima County sheriff yeah some pretty documents on that case\nI got the documents in my hand then I called the national Park Service at organ pipe and asked them for their reports and they stay on it or we don't have any I said have you heard of that case no well this person's still missing\nSo she was a thirty two year old graduate student she had been a PE teacher with a master's degree in physical education decided she wanted to go back and get to more masters degrees\nAnd she ... she was just really admired by all of the faculty that she worked around and and studied under and all the articles in all the report said that they stay that she was really smart\nWell she was about to graduate with a degree in sociology and biology and she was working in a ... a university lab tech to earn some extra money [noise] she loves the outdoors type regularly\nOn January thirty first Seventy one she left her residence in southeast Albuquerque she was driving her white sixty eight Plymouth station wagon and she went about an eight hour drive to the monument and she slept in her car that first night\nFebruary first it was established that she attended an evening ranger presentation at the end of that presentation she went up to the ranger engage them in conversation he remembered it and said hey she asked really good questions was smart\nFebruary second she went to the park visitors center spoke to a ranger they're stating she had just returned from a hike to bowl pasture and asked about a guy the trip to a place called dripping springs\nSubsequent investigation found she spoke to a ... a ranger and individually Larry Henderson you said he ... he remembers or ask good questions was interested in the environment wander nowhere to go to see more things\nWhile in February third she moved to your car out of the campground nobody knew exactly why and on February forth at nine Fifteen and I am a ranger was patrolling and found carols car parked in s this Kenyan picnic site\nWith a note taped inside the windshield\nAnd it said if I'm not backed by four thirty pm on February through these contact the ranger\nSmart smart thing to do\nExactly you know I Wish everybody would do that\nBut then as I went through this I started to think she was going to a place and she was heading to a place that she went to earlier and I always wondered in the back of my mind did something happened that first trip and she was going back to the second time and just in case she was leaving the snow I wasn't sure\nSo he purchased patrol vehicle and he had the two miles up from bull pasture he saw nothing and decided to check the trail register and it was signed by Carol the first day she went on February second notify park headquarters advise them that he has a missing hiker and this starts the search process\nFebruary fourth and fifth national park service that you sent in to Forman teams up that trail the search whether it was described and reports as cold and blustery they determined care was last seen eating an orange on the trail and they did find some spare orange\nPeel scattered around\nThe Pima County sheriff was asked to join the search when the national Park Service started to get low on resources they also called in the border patrol and the tribal police US Customs month an air force base they brought in civilian helicopters was massive the search for three hundred ground searchers were on at any one time\nThe park superintendent a guy named Matt Ryan contacted turtles parents in North Carolina\nThe parents that at the care would never ever go off trail she was an outlet outstanding athletic condition and she was supposed to be back in Albuquerque on February fifth\nFebruary twenty second Matt Ryan told the Associated Press it's almost becoming a search for the answer to a mystery march seven one last push to locate curl rangers claim to\nSmell an odor of the human decaying flesh up the trail\nMarch thirteenth national park service for the team into the area of the odor and found nothing\nAnd\nAgain they have no documentation on the incident anywhere now I did get this NPs report that was in the Pima County documents and it was written by the chief ranger Roswell boils\nAnd it was three type written pages that outlines of search for Carole\nAnd Ninety percent of it real boring real mundane for a review of what it says one additional clue was turned up on Monday February fifteenth too limited locations about four hundred yards the park on the south west facing of the host AJ or less\nA very strong in distinct human odor was found but he knew what their locations\nSupervising ranger how cross of swore all\nThrough our national monument and one other searchers who was recently involved in the recovery of a body had very strong and positive feelings on the date than vacation at the ... the\nFollowing day ranger cos after flying the area and a border patrol plane letting eat man search party back over this area again you order was observed at the same location but only occasionally and not as distinct\nOther members of the team described it as a very weird and scary\nAll efforts were negative and search activities have been reduced intermittent patrols at this time I have never and thousands of reports seen anything described in our national park service report of very weird and scary\nFlight guys that yeah it's really strange just a feeling they had or the fact that they're smelling what they think is decaying human flesh but there is no source or the older\n\nWell here's what's as other members of the team described it as a very weird and scary\nSo I'm sure all of us who spent time in the outdoors have spent have smelled the odor of dead flash decaying some time animals die smell it I don't know if that could be weird and scary\n[noise] but uh\nWas her second hike into that area was she nervous about making the trip is that why she left a note or where she just smart about it they never found her there was never any subsequent follow ups after that first sixty days search both of her parents are deceased she didn't have any brothers or sisters\nThere's no there's nothing left of her family anymore\nYou have another a case in in the book about a land disappearance that involves a really smart person somebody who's editor for what looks like great things his name is Steven read and his disappearance was in Nineteen Ninety nine in Oregon told me about that one\nSo this is the one time out of the thousands of times where I read this case and I said you know I'm going to go against my own protocol I'm going to call the parents\nAnd I'm Glad I did\nBut Steven read missing June twenty third Nineteen Ninety nine salmon Butte trail head outside of Sandy, Oregon about seven miles southwest of Mount Hood and for people who don't know a lot of disappearances amount ... around Mount Hood that I've written about before he was twenty four years old\nStates Mexico Canada agreement us MCA replaces the Nineteen Ninety four NAFTA packed under the new agreement exemptions on terrorists on two point six million cars and did Gary agreement the same as the Trans Pacific partnership trade agreement rejected by President Trump boxes\nAnd carrots White House insisting that it is staying out of the week long FBI probe of sexual misconduct allegations against Supreme Court nominee judge Brett Kavanaugh White House\nPress secretary Sarah Sanders on Fox News Sunday said the president only allowing a week for the FBI investigation into the allegations against judge Kavanaugh is not micromanage meant\nShe says the president is familiar with the judges background but we'll wait any new details from an investigation boxers grown all Scott Fox news we reward you decide [noise]\nMy name is Angela California credit union and I worked on something I've been a matter of fact Twenty one year early\nThis report is brought you buy a ... pound dot org ... towards the lemon gross stretch Massachusetts avenue to Lehman grove avenue it's the two less planes that are shut down through far too there and then a regimen you ski do set up another work selling\n... I've got great\nWhen you use your capital one ... until ... dot com slash adventure you in ten miles for every dollar gift bumped up thousands of hotel different sounds and eating it does just like the smooth jazz in this hotel out how captain not being ... by ... tulips in my life this deal damage as two or\nThree is working on a mission valley north down one sixty three from Washington street up to the heat is to ... or ... year could be easily it's five AM's\n... on the south side of the Fifteen from just pass auto part way to just for ... mountain road it's the two left wing sort of closed I'm Ryan ... and that's your San Diego traffic\nRight now there are young people across the world facing a tough choice continue their dream of education or dropped out to help their family put food on the table you can help change the future in a single moment to see how far your support can go at ... dot org\nHey John are being done great receipts or discovered a fantastic way to relieve old ice cranky muscle aches and joined planes that really slow me down new raging ... pain relief quite ... contains no one but\nShe's burger and price brush cocktails and pitchers of beer or just five dollars each is good\nHim to paint forty ingredients that would spot to give me lasting relief ... we're ... plus raging kick it back and change the based ... really good stuff to ...\n... ... ... and has a place in ... when I put it on a field boss penetrating ... ... it'll would for you to if it didn't do the job would they back with a one hundred percent money back guarantee come on\nJuly ... pain relief cream today and do it all I Do rebel and the pope and Joe ... Sunday night serious pain relief\nAvailable HEB Amazon and region ... dot com raging K. A. K. A. P. O. dot com\nFind out what your home is really worth in today's market talked or expert Chris Keller it asking the wholesaler dot com that ask how old are the wholesaler dot com get your homes sold with Chris Heller adult eight hundred eight hundred twenty nine Seventy eight eight hundred eight hundred twenty nine Seventy eight\nIncome tax claiming money talk radio dot com [noise]\nKnock them were named droppers with names like be stopping by ... morning shed anyone not named\n... how are you I'm fine how are you guys us surgeon general vice admiral out of the morning here\nHas a huge hit keyboard to see for joining us here good morning look on uh how are you the flood\nOf Harvey and Garcia morning's fine tonight ... San Diego's biggest name in the news radio stations Briscoe go [noise]\n\n[noise]\n\n\n\n\n[noise]\n\nFrom coast to coast worldwide on the Internet is this just coast to coast am with George nap now here's George bullet\nThe blue sky you to bring us back into the program or conversation with David White is about his latest book missing for one more\nLand air water the era era cases are something different no departure for Dave and and they were featured in this book these he focuses on aerial triangles that seemed to coincide with the clusters on the ground\nOr people literally vanish into thin air and we're going to get to some of those in just a bedroom coast to coast am [noise]\nTake one atom of nitrogen and bonded with one atom of oxygen boom you just created nitric oxide\nA miracle molecule your own body makes such fuels your cardiovascular health keeping you vibrant but as we all age our bodies need help generating more natural nitric oxide super beach by human has harness the power of nutrient enrich beads and created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body\nOne teaspoon of super beads daily supports your cardiovascular health and blood pressure levels we're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty days supply super beads and free shipping with your first purchase\nField though one plus one equals boom affect the superb each call one eight hundred five one five zero zero five three or go to ... beach dot com today\nAre you considering a safe or gun safe to secure your valuables and firearms if so before you spend any money on any typical running all male safe ... amazing handcrafted\nRhino iron works shapes had rhino safe dotcom see for yourself why rhino safe customers are so passionate about their antique industrial style safes and if you own a gun owner you'll love the convenience of the swing outgoing rack and rhino save dot com you'll get free ... delivery a great warranty service so go to\nRhino safe dot com today that's rhino save dot com\nI just ate hundreds of dollars by switching to Cal I've never seen more lives\nDisclaimer go cannot guarantee you will feel more a lawyer you wind up with us from respiratory and circulatory system pull you belong where you are on the if you aren't due to bring soldiers on me and you would like to save money on car insurance looked like a legal team up all your excellent life choices even though ... we strongly encourage you to go dot com or download the go ahead\nPlease stay a minimum of five hundred feet away from our lord and presumably delicious delicious brain\nGeico Fifteen minutes could save you Fifteen Percent or more\nNews radio six hundred go go [noise]\n\n\n[noise]\n[noise]\nSo Dave I Want to jump around a little bit to make sure we save some time to talk about the air cases so I Want to jump into one of the most baffling cases involving water it's a guy named Henry McCain and this is really pretty creepy\nThat is a creepy case and ah [noise] the new Brighton Minnesota the community just north of Minneapolis not very far with the suburb September seven two thousand Fifteen to twenty eight am it happened [noise] McCabe was thirty two years old\nSo uh he was an immigrant from Liberia married to a woman named cream their two kids lived in a city called Mountain View again just north of Minneapolis north side this is a cost her area of missing people that I've written about in the past\n[noise] he had a great job he was an auditor for the state of Minnesota for the department of revenue [noise]\nOn September sixty thousand Fifteen his wife with kids or went to California and it was a planned vacation well on that Sunday night Henry went out with a long time friend who was a very diligent guy always on time very respectable\nAnd he and his friend went to the early they laugh early on that Monday morning and ... states that he dropped him off at a location in critically\nAt the super gas station at a Seventy third avenue\nA series of triangles around the world and\nIn the book I talk about the Alaska triangle Bermuda Triangle Great Lakes in Michigan in Nevada and the way I got onto this was there's some people out there in the world that are much smarter than me that I've read these books and put together some very interesting factual side note\nAnd a guy from uh Finland did some amazing work sent me this booklet of things that he\nDid and in there he said Dave did you know that there's six major disappearances in Bermuda Triangle that matched dates of disappearances and your books [laughter] I never even knew that\nAnd then went back through it and he was right and that got me to start paying attention to these triangles\nNow in the Nevada try and go down there by you know it goes from Reno Las Vegas to Fresno that's the triangle and when I first got on to that I thought you know this seems kinda hocus pocus I don't know if I should pay attention but then I put it on a map I said holy crap\nYou know what's in the middle that triangle\n... national park yes\nI go that's quite a coincidence [noise] so you're Seventy kings canyon and sequoia national parks are there and I've got tons of disappearances and king canyon and sequoia as well [noise]\nAnd when I watched a documentary about the Nevada try and go there's several thousand planes that have crashed and disappeared in\nThis year is in that area and a lot of it can be explained by various meteorologist as strange air currents things which seems reasonable\nBut when you bring into account that there is also many many people that have disappeared in that area under unexplained circumstances seems kind of a strange coincidence\nWell let's get into some uh do you have any specifics from the ... were you when you get into or should we just go you jump into the cases of air disappearances in general\nAnd it was just go to air disappearances\nYou have a case in the books from among the field Sunnyvale, California from Nineteen forty two what's the deal on that one\nSo that's a I grew up not far from Moffett Field in Sunnyvale I grew up Cupertino and I had planes flying into Moffett Field going right over my house every day of the week and it had notoriety in the early forties for being a place where all the blimps\nThat patrolled the coast of California that's where they were stationed in there and Treasure Island in the middle of the day\nWell in August sixteenth Nineteen forty two a blimp was getting are sent out a treasure island where they held the world's fair there was a man by the tenant ... Cody twenty seven years old and Ensign Charles McAdams thirty eight years old [noise]\nAnd uh they've left Treasure Island\nNo big deal general patrol all the details on this came from the navy file under a freedom of Information Act I filed ... report on this\nWell as they depart they start to head out over the Golden Gate and they start to go out over the Pacific towards the fur on islands [noise] and uh Cody with control of an L. E. airship and this was originally taken by our military [noise]\nAnd it was owned by grid here and they took because there was a a needed for patrol\n[noise] what both men lived near Moffett Field in Mountain View but they drove up to Treasure Island for the day to leave on their ship [noise]\nUh that night water vapor was in the air and it made the ship too heavy to carry a normal for person that would be in the bucket they only left with to\nFirst hundred and ten minutes to the flight was normal fact there was no communication and then at seven fifty am the crew radio that they were investigating a suspicious oil slick and there were five miles to the fair on islands\nAt eight oh five numerous attempts by radio to reach the crew but there was no luck\nAnd the navy scrambled to ... to you kingfisher aircraft out of Alameda naval air station to go track down the blimp [noise]\nWell the planes encountered cloudy weather with a feeling of five hundred feet they decided it was too dangerous to fly below the crowd so they flew above them\nAt ten forty five AM Moffett Field received a call from Fort fund the near the Golden Gate stating that they are to LA ship with two pilots and all we're fine\nWell the navy made a huge sigh of relief and they felt that all was okay now this was a really really weird call but it was in a file and they couldn't explain why it was there [noise]\nMinute eleven Fifteen for fun and calls Moffett Field against they didn't get that in LA had crashed in the hills of Daly city Daly city is just south of San Francisco on the coast\nOr the navy response to Daly city and they find their airship on the ground with one bomb missing the gone to was in near perfect condition both motors on the ship or off even though one trial was half open and the other was all the way open\nAnd the crew which was required were white preserves over the water bowl of the life preserver that they were supposed to be wearing were gone there was a confidential maybe briefcase and each\nA airship and that was still intact the cabin door was open plenty of fuel within the tanks the radio with in perfect condition no distress call for fun and called back and say they they made a serious mistake know LA was present at the Fort they couldn't explain why they made that original call [noise]\nCentral coast of California had a major search started almost immediately the navy found to fishing boats and navy boat in a postcard ship that saw the blimp dip and drop wears on the oil slick\nThe point then gained altitude and disappeared into the crowd is it all pure fairly normal but it did go into the crowd and disappeared\nThe crash happened at four thirty to build you stream Daly city three miles east of the Pacific ocean\nThe crews did not use parachutes and shoots that we're in a craft were still there [noise]\nThere was a couple of theories that I'm Sorry to interrupt you there was a couple of theories that developed a ended the theories are just about as weird as the disappearances or we're going to go to a break and when we come back we're in the jump into\nThe other details about this case and then I get your take on what might have happened to these two missing crew people into the break with the journey wheel in the sky\nTo find them more of us and I just logged on to go to ... am done\nMessage and I think that will return messages listening to Nick and Vicki story about sea quiet [noise]\n... and ... carrying draining to be next to somebody who you're trying to sleep and we've got that Loughner reverberations\nYou know is hoping she gets a sleep before I come up because I started getting the point where I was concerned 'cause I knew she wasn't going to get much rest if I came to the same time you know she's been so used to me ... all the other\nNight said here you already know that ... is the only real estate team might higher today I'd like you to meet with one of the members of the team let's find out what Billy loves working with Chris Heller\nSeattle life particularly in real estate was feast or famine with Chris sings just really have taken a very consistent approach I spoke to Chris and a few times\nAnd he took a lot of time out to mentor me and putting together a a real real estate systems\nCreating a real client experienced and so through Christmas mentor shifts real estate has really taken off for me\nI mean before Hillary team there was a lot more ... works for real estate kind of wondering how are things going to happen in through Christmas mentor ships it's much more clear picture now personally my income is even grown quite a bit so not only am I having more time with my family but we're having better time\nQuality time as well sky's the limit everything is really taken off very excited to\nBe a part of the success find out if your future lies with hello the wholesaler go to join hello the home seller dot com\nSean Hannity here and I've discovered a gym right here in San Diego\nAre real rooting in solar now to the veteran own family operated business with over three decades of service they offer such high customer service there so competent in their product that deposits are never even ask for you simply pay when the job is done and the installation is complete\nAnd to your satisfaction financing is available look I was once a rule for myself and my younger years so I Know what I'm Talking about subcontractors never fully state and city license and they offer honesty and integrity and they have for thirty two years so how about this they've been recognized by Angie's lists super service award multiple times\nAnd they were rated a plus with the San Diego better Business Bureau\nI never I'm afraid to speak my mind which is why I Would only hire RL roofing in solar take it from me Sean Hannity trust R. L. roofing and solar to install your new rules to solar energy system just go to a bar el roofing dot com city license for nine zero three nine for\nThe ... and ham why ... San Diego live\n\nFour hundred seven one four or five\nNews Raphael son go go [noise]\n\n\n\nBefore the break we are talking about this US Navy blimp it's patrolling off the coast to California and uh the blimp comes back crashes on land the crew is gone they pick up the story from there\n[noise] so the navy did their investigation and they said that uh there was no fire on board\nWhen it hit the beach originally when it hit land it dropped one of its bombs accidentally that made the blimp wider was able to take off again and crashing that Daly city neighborhood\nThere was massive search off the coast that went on for days and they never found anything they reviewed radio bog there was no call for help\nThey could never explained why the blimp went straight up into the crowds after dropping the players and they thought that it would have stayed lower to watch the ... that they were watching on the water there were lots of water craft in that area\nThey never found the crew or the emergency survival equipment that they were wearing\nAnd this area outside the Golden Gate that I've written about many times before because just north of San Francisco [noise] yup point raised national park which has had several strange disappearances I've documented and just south\nOf the Golden Gate to a location called half moon bay in that area of the coast I've written about other disappearances that are very very strange no other part of the northern California coast north of that coin raise area [noise] and nothing immediately south half moon bay\nSo it's this one area that have the strangeness attached to it and like you said they they came up with some explanation for to me that were laughable\n\nWell like ah maybe they got into an argument and uh and both fell off or maybe one of them accidentally fell over and the other guy tried to save him and was pulled into the water or\nI mean could that could does not have happened [noise] what do you think George [laughter]\nWell I'm just asking you did to respond to those stories that doesn't seem like a there was any kind of a disturbance sign of disturbance in the in what was left or the craft or a and if they were wearing their life jackets you'd think that they would still be had been floating around out there when the when the search was underway\nOr even if they come out of their life jackets they would have recovered the jak\nRight because the the area of the water that was searched out there with search so thoroughly and eventually those jackets are gonna wash up the shore and they would have recovered them on the beach so oh these explanations absolutely made no sense at all\nYou have another case from Scotland a that was held Nineteen Seventy five\nBefore I get into that if I Want to address something that you said just after the break and that was an explanation that fits the facts and I immediately thought of skin Walker ranch you know\nGive is going to bring this up at some point um you know as I read this book today um I notice that you you've ventured a little bit farther than you have in previous works or in the land in the air disappearances there's the Fred let Frederick ... case which is a famous UFO case\nThere's also a reference to a needs a National Institute for discovery science which was the organization that was studying skin Walker ranch in and several of the cattle ... that had happened in the winter basin\nAnd the circumstances were it looked like these cows had been dropped from the sky some of them disappeared altogether but some of them or their their legs were broken as if they'd been dropped from the sky several of your cases I thought the same thing in multiple missing poor woman bucks it looks like people are snatched down to the off the ground\nAnd then some of them are dropped back into these are odd locations a little kids that are suddenly miles and miles away\nI it it seems like I Know you don't want to commit to\nAny particular explanation because you don't have enough evidence to a to point to one in particular but some of this stuff\nCertainly ventures into the area of the paranormal and um I wanted to share this with the audience that I don't know David how how closely you follow the UFO a topic I Know you sometimes you get into those subjects but\nIt's been an amazing nine or ten months a where all these documents are coming out about government studies of UFOs the Pentagon's ongoing interest and one of the stories that I was able to break earlier this year was about skin Walker ranch that uh a program that have been created by\nPentagon or to look at UFOs also went much further that it it studied what we would call paranormal events unexplained mysteries at places like skin Walker ranch in elsewhere\nAnd I'm at Jeremy core bell is made a film about it and I included in that film and is a reference to our book which had been read in Washington it turns out an earlier this year I was invited to go back by Senator Harry Reid to meet with some people whose names I cannot um cannot make public\nBut they are they gave me sort of a download on the UFO mystery and what some of the research had uncovered and um and ... as well as additional information and some of that has been made public but the one of these guys pulled me aside\nHe had a at an ongoing interest in getting Walker ranch and other mysteries related to it and he asked a asked me some questions about the ranch and then he said\nYou know we think that that guy de ... that um that his mystery with these missing people might be related to the phenomena at the ranch\nAnd I asked a couple of questions that didn't seem to have a real solid answer or not one that they would share with me\nBut the idea that the phenomenon that's been seen there which is sometimes playful and sometimes dangerous might be related to yours startled me and I don't know how you react to that but maybe it makes you uncomfortable or being associated with anything as weird as that but you're stuff's pretty weird too\n\nSo how would you rank this person's credibility and integrity on a topic like this\nUm I'd say this person that I'm Talking about knows more about it than anyone and I don't mean just in the military I mean anyone uh he's this person has seen a lot of stuff that the the public has never seen so\nYou know he he he has a very broad spectrum and a very broad knowledge base about what we would call paranormal including UFOs and alleged abductions and things of that sort so I don't know exactly how your a phenomena fit in with the larger picture\nThe idea that somebody has been looking at it is a I think that's pretty interesting\n[noise] well that's a wake up call [noise] I think so um [noise]\nSo you know way back when we first started to talk about the ranch I really put an emphasis on that area\nTo see if there was anything related to a disappearance I could take my teeth into that could relate it to the activity there\nAnd you know there's really nothing around that ranch that I could say just related to missing people that I study but ethics stated before sometimes I think\nI related to law enforcement and if\nI have a say a series of bank robberies\nThe bank robbers are ever going to do a bank robbery in their neighborhood because they don't want to draw attention to it\nAnd I've always stated that I think that this is related to the profile points I I gave you one of those is water and when you look at Mississippi and Louisiana say it's just filled with water I have no cases from there\nIt's bizarre\nAnd isn't George isn't there a lake fairly near that ranch\nYeah it's ... it's a reservoir it's called bottle hollow\nUm it's manmade lake but the ones right in the middle of the ... reservation in the ... ah control that property and they allow camping and fishing and swimming and things of that sort but at that lake is a a\n... has a long history of really weird stuff creatures have been seen there and the objects coming in and out of the water and there but a lot of drowning said that they the ... tribe believes that uh there's something in the water that pulls you down a lot of people have drowned there and uh\nSo ... you're right I get asked all the time if there's anybody in the vicinity the ranch you meet your criteria who's banished like that and I have to say no other than animals livestock things and that sort but no people have a banished then I Know of\nCourse we haven't really dug into the historical archives or to the extent that you have but I think that some of that work is being done right now\nAnyway it's uh it it was a it struck me as a significant that the person who told me that in D.C had brought up\nYour books and and your subject matter I Want to try to get one more of these air disappearances in before the bottom of the break because I I think I'm going to open up the phone lines you know people are gonna want to talk to you a little bit the Scotland cases guide Norman Peter Gibbs can you summarize that one\n\n[noise] it's Monday October first what's new today on the free our radio as my\nShow sorry you're weak with all the oil and gas stations in one place rocked up every player on the radio original vision my only fear in\n\nWalks news radio I'm all Stevens the U.S Canada and Mexico meeting a midnight Sunday deadline reaching a trade deal replacing but I Do not even for North American free trade agreement the new package featuring exemptions\nOn terrorists on two point six million cars and the dairy agreement does seem as the Trans Pacific partnership trade agreement rejected by President Trump steel and aluminum tariffs are not part of this agreement\nBoxes and carried some Democrats complaining that the White House's micromanaging one week investigation into sexual assault allegations against a Supreme Court nominee Brett Kavanaugh as\nLong as it is conducted in a professional matter and we give the FBI and the ability to do their jobs instead of having a micro managed by the White House we can at least get to the bottom of the evidence\nMinnesota senator ... which are Sunday on CBS whose face the nation Fox News we were bored you decide\nWho they're in the car there at the office working around the house Americans refused to sit still so how do you connect with all those moving targets easy with radio radio reaches Ninety three percent of Americans every week or the Google Facebook even TV but hey\nWho has time to sit and watch TV right so when you want to connect with all those constantly moving adults\nTeams of millennials gets I hurt media dot com and put am FM radio to work for your company again that by heart media dot com\nMessage into your ... your considering going back to school I guess the following question do you need the flexibility to take classes on your schedule you have college credits unique transferred do you want to earn a quality degree from a world renowned university if you answered yes to any of these questions Arizona State university is the perfect school for you\nArizona State university for over a hundred and fifty highly ranked degree programs a hundred percent on line you learn the same degree and see what I'm ... from wherever you are on your schedule plus ask you one line except most transfer credits\nFor information school two three five five lines hadn't learned for yourself by the wall Street Journal ranks and he'll stay in the nation from producing the best qualified graduates and white eighty seven percent of ask you grab recruited within Ninety Days are graduation learn to grow and learn to succeed and learned at the right at Arizona State university\nTo learn more about his you online degrees ... school his three five five when sat and\nTalked to the H O L L ... three by five one set in\nMay it's Ted Garcia for a little boy hair MD dot com there's probably one thing that we and I'm Talking about guys who especially agree on we hate losing our hair happened to me starting in my late twenties I noticed more and more of my hair in the shower drain and\nThat is not a good feeling well then I learned about ... dot com and doctors chef ruined his amazing team I had what's called the Neal grab procedure\nUnlike the old days of hair restoration there are no scalpel no scars many people can even go back to work the next day these are permanent results no more baseball caps for me I can go into any situation looking and feeling confident\nCall now Sheldon Ted from Togo sent you and get one thousand dollars off the consultation is free\nEight five eight seven seven one nine six six one eight five eight seven seven one nine six six one again eight five eight seven seven one nine six six one or go to their website ... hair MD dot com Pelham\nOur solar a local name you can trust seven six zero five zero four zero three eight eight [noise] listen to cocoa wall to wall\nWhy from ... [noise]\nYou you\n\n\nTo talk to George ... one ...\nThe first time caller line is the one eighty five zero one for civil to one to talk to read from east of the Rockies receipts ... vines zero three three from west of the Rockies to breathe cold feet hundred six one agency to buy bonds\nThese these ... with George\n... singers back into the program we're talking with David flight\nIs about missing for one one land air water his latest book we've got 'em for another twenty five minutes and we'll get to as many of your calls as we can right after this [noise]\nTake one atom of nitrogen and bonded with one animal boxes June boom you just created nitric oxide\nA miracle molecule your own body makes such as your cardiovascular health keeping you vibrant but as we all age our bodies need help generating more natural nitric oxide super beach by human has harness the power of nutrient enrich beach and created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body\nOne teaspoon of super beach daily supports your cardiovascular health and blood pressure levels we're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty days supply of super beats in free shipping with your first purchase\nField though one plus one equals boom affect the superb each call one eight hundred and five one five zero zero five three or go to ... beach dot com today\nMessage indeed ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career in case you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree in his little sixteen months one hundred percent on line to find out more\nChecks path to seven nine six four or five that's P. A. T. H. two seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the w._b. carry business graduate programs on line\nText path to seven nine six four or five that's P H A T H to seven nine six four or five\nWhen they\nGo go [noise]\n\n[noise]\n[noise]\nWe're talking with David ... let's go right to the phones west of the Rockies Gina Marie in Washington state you got to a specific case in mind you know welcome\nYes Hi God Bless everyone and everything everywhere especially to Samantha than family and friends um I'm calling about her and when I heard they look on tonight I\nWas calling to talk about her and that was the first case he talked about um I went up to the mountains in granite falls\n'em up your mind trail that we have that for ...\nUm for a week and a half weeks ago\nGo unofficially search and them with a friend of mine and ah she fits all the criteria she had you know ... um that she had a medical condition anything extra hiker\nIs granted it's in granite falls the granite and boulders creek forever if you have to cross through the creek is that\nUm he how when we went um Mm came back out of the mountain and um we met up with a couple of other researchers and I'm One and only had found some of us have hand the\nUm and they tried calling the nine one one non emergency number and they tell their to ask you and they never called back\nUm and then the other lady um they were and that generally now became flash it certainly point I'm ... and they they tracked it on their own they could give it and\nUm you know I I don't know I have a three page on my cell phone and excuse me one of them didn't make any sense was way off to the left or the or where you park your car not even way the trail is um\nStill talk about it and try the family but they never have found is that in Nineteen forty seven so that was that she might be interested in that\nAnd it was a real weird story but ... it was it was treated and I believe that and\nThat's a heck of a story John appreciate you sharing that with us I'm not sure it Vince exactly with David ... is a specific criteria but a a David you want to comment on that deal free\nWhat state was that slide you Virginia right\nVirginia and place called ... ... ... outside of the porch with Virginia but interesting like I said I was Nineteen forty seven\nJohn appreciate the call that's a great story try to get one more call in at least four day we're going to ask wall in Santa Barbara California the wild card lines a ball that morning I've\nBeen called called about five times since they've been on and I finally got\nThrough your you go I'm going\nGoing to tell you a story of an actual experience\nBut first I wanted to say I think that there's that the higher echelons are working with the parks that won't give you information they don't want you to know and my second point before I tell you my experiences I'm encouraging you to read about\nThe the Buddhist or teaching about these different types of creatures that live in proximity different dimensions but they can interact even ... years ago they talked about abductions but the ... to\nTalk about what they look like what the Romans were like what they did anyway so I just encourage you to do that but here's the story this is true\nIt it was before nine gene Ninety six I used to live in Rochester\nBut I was living in California I drove across the country many times I went to visit some friends in Rochester ah I'll Try and find out the exact date but right now I Can't I'm going to send you an email by the way I'll say I spoke to you\nOn the Appalachian Trail from Rochester to Philadelphia you there's ways to drive in many places in the Appalachian Trail you can pull off the road and just walk and taken\nBy just walk on the trail and one time I did that in the afternoon and there was a a man a woman and a boy and a couple of other people walking one direction and we started talking and walking within five minutes another family came from around ... similar to me out of nowhere\nThere were picnic tables right near there and one woman who I was very suspicious of that just appeared\nSaid Hi to the other one and she had a girl and the shuttle can our kids play and the the the the people that I had been walking with the mother said yeah and we shut down at a picnic table and the strange woman said to the other lady that I had to walk with what's your name [noise]\nThey they tell their name and the woman says that's our name true\nAnd then about three minutes later the lady looks into boys gone and she starts calling them and I got up and I walk around and swear to God I Am not making this up\nThere was a close creature over the boy the boy had passed out or I don't know if the creature bump them but this or that part I Want you know it had kinda futuristic very tight fitting clothes it jumped this creature looks humanoid\nBut not totally human it jumped at least twenty feet from the ground without running jumped up to the the middle of a tree where the you know the branches start coming out\nAnd then I just turned around and I went back I didn't say a word I was scared I thought that that creature and those people that are pure were part of the same\nGroup I thought they were military people and this creature was\nA genetic hybrid says what I Believe [noise]\nWell that's quite a story a Dave any reaction to that\nKnow interesting\nYou know you do have some a task well thank you for calling with that and the the other folks who are on the phone hang on because then the next hour or I'm going to be here I'm interacting with our our listeners and um and so folks have you have your own stories and\nTheories than call in and we'll we'll have plenty of time to chat in the next hour in some of your books David and I'm not sure if I don't remember an example here you you referenced that about an earlier book in his new book um about the boulders\nAnd I I was always wondering well heck there's boulders all over the place how can that relate to the missing persons a mystery\nYou have a couple of cases were witnesses tell you why it it relates that these things sort of come alive um or they move right\n[noise] well yeah I wrote a story in my last book one right before the ... about a story a Spanish priest in Texas that was running from Native American thing came up on this giant piece of pink granite in Texas it's a state park [noise]\nAnd he said that as he ran up to the top of the granted it opened up and swallow with him and he said that he was inside the Boulder gift and made it for three days\nAnd then he said at the end of the third day it's that amount and that is the only story I've got like that and uh people probably don't know this but there are stories of Iceland\nThat they will move road when they're building it before they will blow up a piece of granite or big Boulder because they have a bully in their society that things are living inside of those Boulder\nDave are polite is a missing for one one land air water is the latest book it says rebutting as your earlier work and I want to thank you for coming back\nFor a million George\nA will be in touch soon I Want to talk to you about that in about a triangle a little bit more maybe we can do something together for television anyway it's great to have you here and a lot of\nFolks stick around the next hour we're just going to be taking calls from you maybe you'd like to comment about the about ... work or maybe you have some theories to explain some of these cases maybe you've had your own experiences are stories those of you who are on the line hang on and we'll get to your calls in just a bad here are the four tops take us into the break [noise]\nNothing day raped me apply when did it become OK for men to be lazier so Oscar fatter we need to bring them into this country back to greatness and its\nMessage and I think that will return text messages listening to Nick and Vicki story about sea quiet\n... and I can carry draining can be next to somebody who you're trying to sleep and he found reverberations\nYou know is hoping she gets a sleep before I come\nTo you know that Arizona State University He made already know that a few is a world class university that offers more than one hundred and fifty degree programs one hundred percent on line\nThat here's what you learn when you start with assay one line you'll learn to us access to an entire team of academic ... pay your work hand easier\nThan ever with age loose male Macs a patent pending formula was in agreement that helps boost your total testosterone promoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric\nOxide in hand the professors who will inspire you to go there and that you'll be able to achieve your dreams and your schedule from anywhere life takes he'll find out more about earning a degree on line with ... kept school ... by the end if your attorney you'll find that your degree\nBecause I started getting the point where I was concerned because I knew she wasn't going to get much rest if I came to the same time you know she's been so used to me ... all the\nKids helping doors to new opportunities but then he can open doors to some countries Boston players discover what do you can unlock quit the degree to ask you on line ... school kids six six by nine ... ... S C H O o out to six six by nine sat in may it's\nTed Garcia for ... dot com there's probably one thing that we and I'm Talking about guys especially agree on we hate losing our hair happened to me starting in my late twenties I noticed more and more of my hair in the shower drain and\nThat is not a good feeling well did I learned about ... ... dot com and Dr ... and his amazing team I had what's called the Neal grab procedure\nUnlike the old days of hair restoration there are no scalpel no scars many people can even go back to work the next day these are permanent results no more baseball caps for me I can go into any situation looking and feeling confident\nCall now Sheldon Ted from cocoa sent you and get one thousand dollars off the consultation is free\nEight five eight seven seven one\nNine six six one eight five eight seven seven one nine six six one again eight five eight seven seven one nine six six one or go to their website ... hair MD dot com\n[noise] he's ... ham why I live\nSomething the U.S wanted removed the agreement exempt terrorists on two point six million cars and include the dairy deal essentially the same as one rejected by President Trump\nSteel and aluminum terrorists are not part of the agreement the U.S and Canada under pressure to reach a deal by the midnight Sunday deadline\nIt's been one years since the deadly shooting in Las Vegas fifty eight people were killed more than eight hundred injured Natalie grime it was shot in the jaw and continues to recover she tells Fox many survivors steal the responsibility to tell their stories\nDavid your guy that has overcome a severe issue\nA light the light bulb went on and I started to research on the same reasons why I was going to capsules they couldn't get enough\nIt made me feel so much better I can only tell you one thing the product war\nAnd not only works in one way it works in a whole bunch of different ways because it gives me energy it gives me ... ... in my house just have a better way to earn a voyage build everything back into my body taken a while but you know on his back there and I ... I Can't say enough\nThis is Richard Haass throw owner for carnival or research international call one eight six six eight three six eight seven three five that's one eight six six eight seven six eight seven three five or visit carnival rent dot com C. A. R. N. I. V. O. R. A. dot com call now\nYou'll unwritten go go go go dot com [noise]\n\n\n\nAll right it's got a couple of folks who have been holding on the phones for a while now we'll get to those calls are right now Nancy in Victoria, Texas on the wild card line finance eat what's on your mind\nUm I was actually one of the ... to ... about her and I think we have\nAbout each of ... right now why don't you tell us about it\nGive me a fucking nothing I can say well we have a missing persons case and the Joe ... for for like about twenty five minutes away from where I live ah her name is Cindy ... there'll be though\nOh she's twenty five years old and she's been missing for two months wow\nAre there any circumstances that they make you think it's one of a similar to one of David's cases\nApart yeah me home oh we've had so many long for no state show ... even ... search for hockey team here and try to find any ... any\nAny of them what they can find even search dogs\nAnd their high then like know finding when they have found some room and you know\nHow I live like that or even at ... at home they're scared to do anything for ...\nWell that sounds interesting I'll tell you what I Will make a note and send out on the David and see if he has any information on it he he has a pretty good network at a send him current cases so chances are he knows something about it but I'm Sorry I don't Nancy thank you for the call going to bury in South Carolina hey Barry how you doing\nHello there your nap I Hope you're doing well buddy I got a real good story to tell you about the national Park Service uh and it goes right along with what they were you were talking about\nAnd um I don't know how familiar you are with the east coast or but on the Appalachian Trail war for oil hundred mile range north Georgia and\nA loose headway Maine and there have been a lot of gifts of parents are hikers it runs right along the the the ... of the Appalachian Mountains\nAnd dog ... either way me and my wife ... love Ashville North Carolina about a year ago and we pulled into this rest stop area in your shop stuff in the park ranger there\nAnd I got to talking to shoot the ball and ... you know or what didn't pay much attention as some people gathered around asking about the different birds in the area and uh you know so ... and\nAll of a son and her hope no exactly why it your what I said well tell me how much you know about all the people that there's a fear here on this Appalachian Trail\nAnd George ... is the main or change a habit antagonistic towards ... and we all just kind of drifted away and went inside the gift shop\nYard act we and my wife and I came out about thirty minutes later\nAnd he was ... about thirty feet from the hat and McKay jak contact with him and he's come in and he nodded his head\nAnd I did you know and he said ... said don't ever mention anything about ... ... around a crowd of people\nI said oh for him because it happens all the time that I've said apart right here with us at ... the ... they found him in a national park or why they see it\nAnd there was never any investigation about what do you think about that your\nWell you know it goes along with the kind of experiences that ... has had dealing with national park service folks uh the\nHigher ups at least don't want this to be discussed maybe they don't want to scare people out of not attending a are going to national parks or maybe they know something more about it there are a lot of great people to work for the national Park Service U.S Forest service\nBureau of reclamation bureau of land management things like that but\nAh they don't always call the shots I'm not surprised Barry appreciate you sharing that story with us when you go to the first time caller line Karen in California I Karen welcome to the program\nAnd can kill like I like it can they tell you David at ... and they stay inside and living and working and you can many valley several years ago\nAnd we live in Manhattan so many like she has to try and [noise] and she had gone out on a date and take they can they can I can and she went she never look at that no one shot and leave [laughter]\nAnd they look for half a ... a week [noise]\nAnd it can be involved and have found that ... [noise]\nDo they found heaven weeks later at the base a class where she had fallen and yet she had just died so they couldn't really explain how it happened that chicken gone\nWestern Canada reaching a deal late Sunday night for Canada disdain or free trade agreement with the U.S and Mexico prime minister Justin Trudeau saying quote it's a good day for Canada as he left his office\nDemocrats backing a week long pause and judge Brett Kavanaugh Supreme Court nomination fight due to allegations of sexual assault Judiciary Committee member Mazie Hirono of Hawaii you\nThey're not focusing on the credibility that they they kind of all reports and it's all about why did somebody wait so long and all that the crux of the matter is that these are serious allegations and we have been calling for an FBI investigation for what seems like Montana\nHer own peering Sunday on ABC's This week program judge Kavanaugh still denying those allegations Fox News we reward you decide [noise]\nThe following question do you need the flexibility to take classes and your schedule you have college credit to transfer do you want to earn a quality degree from a world renowned university if you answered yes to any of these questions Arizona State university is the perfect school for you\nArizona State university offers over one hundred and fifty I remain degree programs one hundred percent on line\nYou learn the same degree as he went on campus from wherever you are on your scheduled class and the one line accepts most transfer credit for information tax off you get three five five one seven learned for yourself flight ... seat was ranked number one for innovation by US News and World Report\nAnd learn to thrive with Arizona State university for more information about ASU on line ... off the\nFiber optics move crazy amounts of data and even crazier speed and ... is the one hundred percent fiber optic network\nWith ... connection you'll get the fastest Internet available download speeds up to nine hundred forty ... TV phone added to your price guarantee over Seventy nine Ninety nine per month on line with a two year agreement plus get two hundred dollars shorter range of Google and that's smart home devices and a one hundred dollar bills or\n[noise] whether it's our hearts lungs or other organs were diagnosis tends to make us uneasy at Kaiser Permanente our specialists care for you and about you working together and creating a treatment plant specific to your diagnosis and total health\nDifferent primary to specialty care find reassurance in a great team of health care professionals committed to your healthy recovery visit KP dot org ...\nThree five five one sat and that's only ... three five five one seven\nAmericans are always on the move there or the car there at the office working around the house Americans refused to sit still so how do you connect with all those moving targets easy with radio radio reaches Ninety three percent of Americans every week or the Google Facebook even TV but hey\nWas time to sit and watch TV right so when you want to connect with all those constantly moving adults teens and ... get the I hurt media dot com and put am FM radio to work for your company again that I heard media dot com\nAttention future cannabis entrepreneur it's are you interested in making some extra cash in the booming medical marijuana business than listen to this\nChristopher right hosted the hip radio cannabis chalk one oh one is holding\nFree training classes in San Diego over the last few years prison is dedicated team had been making money you know medical marijuana business and now they are looking to help others do the same if you have\nThe desire cruises ready to teach you is proven formula for starting in running a successful medical marijuana business that will allow you to tap into today's modern day green rush so if you're interested in becoming a cannabis entrepreneur call one eight hundred for twenty zero zero five million now\nTo get your free cannabis business starter kits and free tickets to criticize cannabis network training class call a number four twenty zero zero five dying now seeding is very limited colleague Hubbard for twenty zero zero five nine that's eight hundred for twenty zero zero five\nMinute get your free starter ... today this is an educational class only brought you buy cannabis dark\nGet expert help with retirement planning\nFire right with Epstein in white eight by eight five six four eighty thirty six [noise]\nUm\n\nUm\nOh\nOh\nOh\nLong as you get so much\n\nTo talk to George nap go all the wild card minded eight one eight five zero one for one zero in on\nThe first time caller line is the one eight by zero one for seven to one to talk to free from east of the Rockies\nGold eight hundred eight to five vines zero three three from west of the Rockies toll free calls eight hundred six one eight eight to ... this is coast to coast am with Georgia now\nThe traveling will berries ended the line breaks off we're talking about missing people disappearances the strange criteria as outlined by Dave ... is missing for one one book series\nAnd I'm hoping that some of you have your own experiences or a you know somebody else a case that's from your area or maybe you've seen something we're out in the wilderness out in the woods that you want to share with the coast audience will go to the phone lines in just a moment and get to as many of your calls as we can [noise]\nTake one atom of nitrogen and bonded with one atom of oxygen boom you just created nitric oxide a miracle molecule your own body makes that fuel is your cardiovascular health keeping you vibrant\nBut as we all age our bodies need help generating more natural nitric oxide super beach by human has harness the power of nutrient enrich beach\nAnd created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body\nOne teaspoon of super beach daily supports your cardiovascular health and blood pressure levels we're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty day supply of super beach and free shipping with your first purchase\nField though one plus one equals boom effect of superb each call one eight hundred five one five zero zero five three or go to ... beach dot com today\n... ... if you're considering going back to school after the following question do you need the flexibility to take classes and you are scheduled you have college credits to transfer\nDo you want to earn a quality degree from a world renowned university if you answered yes to any of these questions Arizona State university is the perfect school for ...\nArizona State university offers over one hundred and fifty highly ranked degree programs one hundred percent on line\nYou learn the same degree as he went on campus from wherever you are on your scheduled press agency one line except not transfer credits for information types lived three five sidelined sapping\nLearned for yourself ... here was ranked number one for innovation by US News and World Report on there just drive with Arizona State university for more information about on the one line talks lived ... sat and talked to a V E two three five five ... sat in\nThe news radio six hundred\nGo go [noise]\n\n\n\n[noise]\nHer final segment tonight on coast to coast let's go to the phones first time caller Glenn in ... Washington Glen welcome to the program a lot of weird stuff happened up in that area\nHave you ever heard of a red rock lake area George\nI have not but uh please tell me about it what what is your experience been\nBack in a way I rent it went camping hair and a half ... very ah my friend's wife was very often to the bushes my friends that have like red high looking at him\nAnd he had a whole is white back for like the wrong way\nRaptor and there was like ... feature of like a greyhound\nA hey just walking on my part later on a couple of weeks later or being dragged out of their company and it ever was ever I think it was every ... every kid you know anything about that or\nI don't know anything about that specific a creature or creature report but I Do know that uh the ... of area has been a hotbed for really weird stuff for a very long time or the guys who investigated the skin Walker phenomena Utah\nThis day the one thing I Wish I had done is make note of the make and model of the ATV and asked them\nHow did you get past the road block how did you get that ATV back onto this road the two girls there's no way they could have lifted any weight and even to adult men that looked like lumberjacks again they look just like the people in the Bronx and paper towels would have had a hard time\nPicking up a like a four hundred pound HEB and somehow getting it over this huge trench in mound of dirt\nThey looked at me odd they said they were up there scouting areas to hunt the two twin girls in the backseat\nLooked like they were in their Sunday Best church clothes I Can't remember this was a long time ago I Can't remember specifically if they were wearing dresses but I Swear to goodness it looked like they just came out of church they might have been in dress is not what you would expect for going out scouting hunting\nAreas in the rain forest in the woods [noise] um\nThey were like blonde hair blue eyes again just like of aliens came down here\nSo how do we blend in and looked like humans it was like they were too perfect\nNot a flaw on not expected dirt know dirt on their face their hair was perfectly comb their clothes I didn't even she uh uh uh single wrinkle the cloud shirts were tucked into their waistline not seem like you would expect out in the woods in the middle of nowhere\nSo they just comment you were looking for a place to go hunting as they're driving by or did they stopped to chat\nThey kind of stopped and chatted they\nThey see me they see me coming down the road and so they hold often they kind of parked a little bit and I I stopped tonight I chatted with them probably\nProbably two minutes probably two or three minutes of course I was on my way down to the lake\nAnd like I said I've got this logical brain that seems to just kind of regional way anything and all these weird events that I've had in my life sometimes don't sink in until after the fact and you know I started thinking about it well wait a minute how did they even get that HEB onto the road show alone\nHow weird their appearance was I mean I was struck by how hard it was at the time but um\nYou know I just kind of reason to the way that well there are people but I tell you up in those woods there'd been some strange strange event so I called in a while back I talk to you when you talk to the big foot researcher that their records their their sounds it was\nIn those shin woods where I heard this ah ungodly showdown that couldn't be any other animal and\nI don't think the best opera singer ... she could have imitated this shutdown and I'd encourage you to find out what coast to coast ... with the audio tape they used to play a visceral legit big foot recording\nTen or more years ago George ... used to play it I think art bell used to play it hasn't been played for years but I heard that up in the shame woods it's a unique recording never heard of it before\nI'm starting to buying more and more to the fact that these big put my feet dimensional might have a a extraterrestrial connection ... that I saw in the woods but more I think about it there's\nI'm Ninety nine point nine percent sure those were not humans and hindsight I'm just glad they didn't take me whatever they were doing up in that area\nAnd well we're glad to cause a ... you wouldn't have been able to call in presumably thank you Jason for sharing that story that's a that's a pretty strange you need to start carrying some recording equipment with you wherever you go thanks very much try to get one more caller in close to home here Brian in Las Vegas hey Brian what's on your mind\nOn a couple of comments\nOn the on the Michigan for one one one on the previous caller was ill and over quickly maybe to get this story in real quick\nUm I had kind of a big push to experience and it wasn't until he played this year sounds like coast to coast they realize that that's what I heard I was up um the Willamette to for national forest or love ill between a non bachelor and a three sisters in Oregon\nAnd um it was up there a late night watching the stars and hanging out and then they'll\nLikely music stuff sometimes I just kind of hang out more which were quiet and there's nobody around her hours up there and we went down to look at the stars through binoculars and I heard that same sound that he's talking about as\nBest as I Know what he's talking about [noise] um and it had a weird psychic effect I don't know anybody else has had this experience but um it was kinda like hey what are you doing up here and I\nKind of second guessing but oil and really far away and the you know maybe I'm just imagining that and\nSo I kept hanging out and look at the stars in about ten minutes past and they closed it oh I'd say at least three to five miles in maybe ten minutes and it did the same sound again only the the impression or psyche can personally at all it was like hey I'm coming at you\nAnd me I jumped in my car so bad and got out of there\nAnd I never really piece it together went was you know um my girlfriend and I will do a lot of reading wasn't a lot of close coast too and when they're serious down it was like oh my God that is what it is it has a you know I'm a musician so I listen to overtones and frequency and stuff a lot\nBut I and I'm I'm Sorry to cut you off but we're at the end of the program I thank you for sharing that story with this though and I'm Glad you got the call in and I hope you'll call back and and share stories with us thanks to all of our other\nCallers as well and to my earlier guest they polite his new book is called missing for one one land air water and we'll have date back real soon to talk about something else so thanks to my colleagues there at coast to coast Nathan's Dayton and Donald Walker\nBreak bishop our Web master and Lex alone could also helps us out ... always a\nA contributes to the program and of course a producer Chris borrows George ... is back tomorrow night I'll be back in a couple of weeks goodnight every one [noise]\n[noise]\nMessage into your ...\nConsidering going back to school I mean questions do you need to take classes on your schedule you have college credits unique transferred to earn a quality degree from the world renowned university if you answered yes to any of these questions Arizona State university is the perfect school for you\nArizona State university I think over a hundred and fifty highly ranked ... a hundred percent on line to learn to some degree and he went on top of that from wherever you are on your schedule play ... transfer credits\nFor information school two three five five lines hadn't learned here sounds like the wall Street Journal thanks you fit in the nation are producing that best qualified graduates ... eighty seven percent of ask you grab recruited within Ninety Days are graduation learn to grow to succeed and learn to arrive at Arizona State university\nTo learn more about the one nine degrees ... school two three five ...\nThat's the old El Al is three by five points out and\nNot to mention San Diego area how would you like to change turn cash every month inconsistent mailbox money well listen to this actor dean Cain noon is Superman on ABC's hit TV show Lewis and Clark and now we stayed invested with the national ... networks are giving away their riches in real estate gets were free to anyone who calls now\nThe only show you their formula for swimming houses in your spare time for potential profits he's you're interested in embarking on a new adventure impossibly changing your life then you need to call white now call one eight hundred to two five four zero zero seven now to get your free riches in real estate get\nCalled lead hundreds to do science for zero zero seven now change will also get free tickets to a life threatening events plus national networks give back\nWhich includes a free smart watched the networks guide to investing plus a special bonus their brand new tax lean investing in free just for attending called eight hundred to two five four zero zero summit that's eight hundred to two five four zero zero seven for your free riches in real estate kid to do\nHey [noise] use peyote geo am why I live\n[noise]\nDown to the wire on a new trade deal I'm an Carrick Fox News the United states Mexico Canada agreement us MCA replaces the Nineteen Ninety four NAFTA packed\nThe U.S and Canada confirming late Sunday in agreement was reached the agreement of them terrorists on two point six million cars also included a dairy deal once rejected by President Trump the agreement reportedly preserved a NAFTA dispute resolution process something the U.S wanted removed\nWith the announcement friday of the FBI's week long investigation of sex assault allegations against Supreme Court nominee Brett Kavanaugh a delay in the Senate confirmation vote judge Kavanaugh's confirmation suddenly thrown into doubt\nAre webmaster Greg bishop and I have pulled together our usual assortment of items and oddities called from various media sources around the world we call it naps news and you can find it on the coast to coast am website\nUp to the story selected for tonight relate to missing people one is a story about notable missing person cases throughout history cases that remain unsolved in which received a lot of attention when they happen and there was a second story sent to me by one of our listeners about a very specific missing persons case\nInvolving an airship of the crew banished\nAlso tonight five ways that space travel can drive you insane that's for any of you planning to join the astronaut corps maybe hop on what if he Lon mosques missions to the moon and a story that I like reading it's a study to find out if most people care more about dogs that they do about other people\nI think we can guess the answer to that one\nThose stories and more intimate snap news while you're there check out out of become a coast insider costs about Fifteen cents a day if you use it subscribe for a year gives you access to a vast archive of programs I think about a thousand of them you can listen anytime you want as often as you want plus there are other benefits for members\nAnd you can also see how to subscribe to George ... TV program beyond belief it often looks into the same kind of mysteries and unusual phenomenon we explore here on the radio\nWith that let's assume that position bringing the dog and cat find a good spot near used so they can listen to to tonight's program as well put on a pot of Joe slip into those ... maybe the flannel ones it's getting cooler out their\nPlop down in the company's spot turn down the lights and turn up the radio because we're about ready to rumble in a moment David polite is missing for one one land air water is the latest research I'm George nap and this coast to coast am [noise]\nCyber criminals can attack your laptop tablet or smartphone without warning or they can steal your identity and you may not realize it until it's too late lifelike identity theft protection now includes the power of northern security\nTo help protect your identity and devices lifelong accuses proprietary technology to help detect the range of threats to your identity like your personal info for sale and the dark Web\nAnd north in security protects against online threats that if there's a problem\nLocked with Norton agents will work to fix it\nNo one can prevent all identity theft or cyber crime or monitor transactions that all businesses but new life lock the door and security provides more detection and more protection against cyber threats go to life locked dot com recall one eight hundred life locking use promote Georgetown for an additional ten percent off your first year\nPlus a twenty five dollar Amazon gift card with the annual enrollment that's life lock dot com promote Georgetown for ten percent off and a twenty five dollar Amazon gift card term supply\nMessaging data ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and gave you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree in his little less sixteen months one hundred percent on line to find out more\nChecks path to seven nine six four or five that's P. A. T. H. two seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line\nText path to seven nine six four or five that's P. A. T. H. two seven nine six four or five\n\n\n\n\n\nWelcome back you know I don't think a day goes by when I don't get at least one or more messages from coast listeners asking me witness that missing for one one guy coming back Wednesday ... going to be back on the air\nAnd I always tell them not soon enough we get more requests for Dave than any other guest that I've experienced is I've been with the program for ten years and that's a that's because he always brings the goods I Am jazz that he always allows me to get the first interview winning unveils a new book and like the other books this new one does not disappoint\nA Davis you probably know spent Twenty years in law enforcement then worked in the tech industry for a bit but found as true calling as an investigator of unusual disappearances and his work in that area has become a phenomenon known all over the world multiple books a documentary film\nAnd maybe some other surprises become Dave great to have you back\n[noise] George I'm always humbled that anyone even want to listen to me though I appreciate the invite\nI wanted to say you know I noticed something as I was reading the new book today\nThat you make some personal observations that I have not uh I haven't seen it you go this far in the other books insights\nInto your own emotional reactions to some of these cases and it seems clear like the subject really gets to yeah you've got I think eleven hundred and thirty five cases that you profiled over the years thousands more they'd be looked into\nSome of them really seemed to get into your head though I I think in part because of similarities or some of the missing to your own life right\n[noise] you know I think that's true um I've been very fortunate to me family are people who have been lost\nAnd when you meet these people it really brings brings home the emotion and [noise] there's a lot of parallels to my life with a lot of these families and I've written about people that remind me of myself a lot of time and uh [noise]\nI've put the in the book just recently probably because it's [noise] it's more of an evolution in my writing and hopefully people say that you know hey\nA really really good people these are the drags society these are\nThe upper echelon and it's a conundrum to me why I don't find people that are down and out in life that are disappearing but it's it seems to me that it's always the high rollers the people that are high performers that are disappearing\nYou know one place in the new book you mentioned how as a rule you did not reach out to the families of the missing now sometimes you meet him ... due to various circumstances but in general you know call somebody up out of the blue and say hey can I talk to you about your dad loved one are you missing loved one because it seems like an invisible line that you don't want to cross over but I Wonder\nHas the success of your book help in the sense that these families now reach out to you that they're unsatisfied say within the search effort or something and they're they're turning to you for some help her answers\nIt has happened and uh\nI don't want to inject myself into a search or into the turmoil that's evolving with somebody disappearing now somebody reaches out want some help absolutely I'm going to be there I'll do everything I can and there's been cases just recently where that's happened and I'd be glad to help and ah\nI've kinda guided them and it it seems that a lot of these families income are the same sort of issues time and time again and it's frustrating as heck to sit back and hear the frustration and their voice a\nLot in common one is is it seems as though when jurisdictions stops searching they get to a point seven to ten days and they say hey there's nothing else we can do there's no place else to search\nA we're running out of resources we've got to stop well many times families and friends rally at that point and they get a group together and they keep searching for what I tell these people is you've got to get a copy of those reports that the jurisdiction wrote the search and rescue reports\nLaw enforcement reports see who they interviewed who they talked to were they searched the effectiveness of the search or the areas that they completely eliminated in the in the areas that they thought that they still should search more because without that you really searching blind\nAnd there's been instances just lately where people have said no they said they won't give us anything\nI I find that baffling\nWell I mean that's how they treated you I was going to ask you the same question about different agencies I Know how the national Park Service feels about you and that they are we should anybody who has not heard your earlier interviews or is not familiar with the books you might be listening tonight\nI'm maybe we start there where you can explain the history of your interaction with the national Park Service the forest service\nGovernment entities in general because they've shut you out I mean I guess I I'm interested to learn that they're doing the same thing to the families of the missing but it's really kind of clear over the big picture that they don't want to help solve these mysteries\nYou know it it's a sad note on humanity if that's the case but there is a lot of obstruction so when I started out I was told by a couple of Park Service rangers that they had found\nDisappearances in their parks where they had worked that bothered them didn't make sense when they tried to find information they couldn't\nAnd they thought somebody with an investigative background ought to be looking into it [noise]\nAnd that's sort of how it all started and I filed a series of freedom of Information Act requests against the national Park Service they have the largest contingent of federal we train police officers and the national park police\nAnd they're trained at the federal law enforcement training center they get outstanding training they're smart people they understand what should be done\nUnited States Mexico Canada agreement us MCA replaces the Nineteen Ninety four NAFTA packed under the new agreement exemptions on terrorists on two point six million cars and did Gary agreement the same as the Trans Pacific partnership trade agreement rejected by president\nTrump boxers and carriage South Carolina Senator Lindsey Graham defending Supreme Court nominee judge Brett Kavanaugh's temperaments\nTemperament Nassau was a man who was who was rightly offended by being destroyed for political purposes so I can assure you that I Do not share center ... view of judge a cabin ALS temperament\nGraham on ABC's This week reacting to Democrats who criticized Kavanaugh's disposition and showing a lack of judgment Fox News we report you decide\nMessage indeed ... if you're considering going back to school after Sosa following questions do you need the flexibility to take classes in your schedule you have college credits to transfer\nDo you want to earn a quality degree from a world renowned university if you answered yes to any of these questions Arizona State university is\nYour friends can only do so much of a breaking point when a print takes over and they're not just afraid to fly home schemes diminishing what books do you do the limits of fear\nComes like nights through October twenty eight ... ... bridges and you've never felt before the\nPerfect school for you Arizona State university offers over one hundred and fifty highly rain degree programs one hundred percent on line\nYou learn the same degree as he went on campus from wherever you are on your schedule clash and see one line accepts most transfer credits for information ... three five five one shot and learned for yourself ... ... s U is ranked number one for innovation by US News and World Report\nAnd they're just drive with Arizona State\nUsed savings I knew and previously ... furnishings writes huge savings and course manager plans and are choosing my ... and new and previously means manager Andy whoever you're home run off you'll find so from one Ninety nine Ninety nine and everything in our nine thousand square foot she'll run by guaranteed inside many large companies\nThat are ... furniture and your university\nFor more information about ASU on line ... sideline sat in fact after you had three five five Lynch sat in as a murder\nYou want to reach everyone adult themes millennials but it's not like these groups all hang out in the same place right actually wrong they're All right here listening to radio commercials just like this one radio ads connect with Ninety three percent of Americans every week that is more the Google more than Facebook more than ... in fact\nRio reaches twenty percent more millennials men TV want more of the people you want to talk to all in one place well you want to get to my heart media dot com and get a um\nSome working for you play your perfect\nAround a golf rounded drinks and around and watch ice cold martinis juicy whenever you love to do you'll find\n... see how much you can save called me at eight hundred three three three\n... no not ... [noise]\nFive one five seven this is Kevin lions at nc offending dot net\nEqual housing lenders between numbers of er once you sort of sickly rights when an enlisted between three six ... not Olympic Games will fight Louis made or range pursuant to win a prominent business leaders ...\nHi I'm George Chamberlain and tell them our health is all about passion for high quality care and putting people in patients first\nHow so well as a first and only member of the prestigious Mayo Clinic care network in San Diego ... Lamar how doctors can collaborate with male clinic specialists on hard to solve medical problems working together to find the best treatment plan for you\nThis is one really terrific column our benefit that you need to know more about so visit alum our house dot O. R. G. slash Mayo our calls for for two to eight one three to nine oh\n\n\nWe\n\n\n\nSee\n\n\n\nYou are listening to coast to coast am George you\nKnow the uh they say this imitation is these in serious form of flattery um it can go too far though of the success of David ... missing for one one books has inspired other people to sort of borrow\nHis template and a breed their own uh I'll put that deals with the same subject\nWhich I guess we all need more information on it but some of gone too far there are people pretending to be him and in a moment I'm going to ask Dave about that and then we're going to jump into some current cases new disappearances that maybe you can shed some light on out there in coast to coast land we'll be right back\n[noise]\nTake one atom of nitrogen and bonded with one Adam of oxygen boom you just created nitric oxide\nA miracle molecule your own body makes such as your cardiovascular health keeping you vibrant but as we all age our bodies need help generating more natural nitric oxide super beach by human has harness the power nutrient enrich beach and\nCreated a super food that helps your body make more nitric oxide on its own the core philosophy of human is to develop heart healthy products for your body\nOne teaspoon of super beach daily supports your cardiovascular health and blood pressure levels we're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty day supply of super beach and free shipping with your first purchase\nField though one plus one equals boom effect of superb each call one eight hundred and five one five zero zero five three or go to ... beach dot com today\nWarning if you were buried in debt you can't afford to not let the credit card companies make you think that you have to pay it all back because you don't what the credit card companies don't want you to know is that there's actually a way to get debt free without paying off your entire debt\nOr going bankrupt if you have five thousand dollars or more and credit card debt you know have the right to let us settled that debt for a fraction of what you will for free information called debt free dot com now at one eight hundred four hundred seven one four or five\nWill even show you how much money you could save if you are struggling to pay off your debt do not let the credit card companies make you think that you have to call debt free dot com now for free information on how to get out of debt faster than you ever\nThought possible without bankruptcy we offer a guarantee with no upfront fees so there's no risk for the free information you need a call now one eight hundred four hundred seven one four or five\nThat's one eight hundred four hundred seven one four or five one eight hundred four hundred seven one four or five\nNews radio six hundred go go go go dot com [noise]\n\n\n\nDavid blight as I mentioned uh during the break there that uh you've got some imitators out there are people who have written books similar to yours as well as people who've gone further than that pretending to be you can you address that for a moment before we jump into the cases\n[noise] this is one of the most frustrating parts of the you know in the public spotlight I go to conferences all the time people come up to me and they say so you said this uh how did you come up with that I'm thinking I never said that and there's a series of YouTube sites\nThat have the named David ... is missing for one one missing a national parks there all frauds they're not me there are people that are viewed my name to get innocent and listeners to get on and every time you click through they get paid by their Google Ads\nThe only site that has me is a kennel missing project YouTube site all the rest are not me in fact about eighty percent of them when you click in and you listen if you don't know it's somebody else talking about some other topic and it's not even me at all so\nI tried to tell the people don't trust you to really don't even listen to them a much effect cannot missing project site that's the only real fight that they're going to get honest information from\nAll right um talk for a moment about search and rescue\nParameters because that that information becomes key to you picking the cases that use euro went on I mean there are metrics there are there's data\nUm for search and rescue um how how they proceed and and uh a huge database I Would think that gives clues about which cases stand out as being unusual\n[noise] so that the data that you're trying to get to is really in the reports that they generate\nAnd the national Park Service for one won't volunteer up any of these reports that name of the date and a specific time and that person has been rural to be a missing and presumed deceased\nOff and are found impossible distances away sometimes they're alive amazingly enough but I'm often found impossible distances away and there is no way no way they could walk there on their own or talk about that phenomenon\n[noise] so there's a couple of sites that talk about my work and talk about these cases and a couple of people have chimed in and said well you know Dave talks about people in this books that have been found and there's no mystery there they obviously haven't read the books and they don't understand the rationale behind why these stories are important [noise]\nSave you got a two year old child that's in the middle of the wilderness with their friends or their family and they disappear and that child found say three thousand feet higher in elevation and six miles away in a day and a half\nA well I don't know many parents think that there are two year old could make that track\nBut that's not it I mean when I started to accumulate the data on it in off the grid the book before this one I had a list that accumulated\nThat probably there's fifty a cases in their starts off with a case let's say a four year old missing in Australia found five days later forty five miles away across the desert\nOr four years old I'm there's other cases where two year old in Florida found twenty miles away through the swamps a another two year old in Australia from Fifteen miles away in three days two years old\nA three year old found Fifteen miles away twenty four hours not possible in my book but I mean there's a long long list of these and why did I start to accumulate that data\nBecause in search and rescue manuals that says that a two year old should be found Ninety five percent of the time in a radius of two miles or less from the point laughing at these numbers absolutely blown to smithereens\nIt's something search and rescue people don't want to talk about don't want to address that want to even think about and\nI can understand why because there's no way you could plan a search\nThirty miles away for a two year old just you don't have enough people to do it and you have to work for that Ninety five percent tile but the problem is and all these books they don't talk about the other five percent anywhere I'm probably the first person that ever talked about it\nBut as you state how are these kids making this extraordinary distance and extraordinary heights\nWhen I go to a conference I always ask people how many people in the room or parents you know Ninety percent of people raised their hands and I said if I said okay you're you're just going to set your child down in the dirt on a trail walk away we'll watch the child with a child going to do for the next hour\nThey said well maybe it'll crawl under Bush and go to sleep maybe the plan that dirt for a while maybe they'll run down the trail for a little bit get upset cry and then go to sleep\nAnd I said how many how many parents and your think your kid would run up hill nobody raises their hand I mean it does happen but it's pretty rare but I have all these examples where these heights have been achieved by these little camp\nWhere they crossed a couple of mountain ranges or you know it's incredibly difficult terrain sometimes without any shoes on a yeah it's going to\nMove we talked about a two year old boy that they guest she traveled nine to twelve miles in nine hours over two mountain ranges\nAnd he was found face down in snow the next morning unbelievably a wife and we found that guy years later and interviewed him and he has no recollection of what happened in his his mom said we couldn't believe we found them and we couldn't believe he was alive you\nHave a case in the new book ah in Southern California the Lucerne valley bill Hanks this was from back in Nineteen fifty six is the child is five years old at the age of disappearance\nAnd you do the math on the bill I guess if he had walked nonstop for twenty four hours he didn't have to go point six miles per hour\nA bunch of kids are going to walk for twenty four hours with no food or water\nUm it it seems just impossible\nUnless somebody picked him up for some some thing or someone picked him up and slapped him there [noise] [noise] well\nAnd and the reason these cases have significant is that let's say you report on a child who's abducted in downtown Vegas\nAnd they're found in West Los Vegas three hours later six miles away you know it sure is probable somebody put them in the car and drove down there but when you're talking in the middle of the wilderness that's not happening and\nWhen you talk about this happening when the people in the party didn't see anybody never talk to anybody and when they check the trail walks nobody else was there nobody else saw anything nobody saw any cars\nNobody else was there so how did that child make that distance in that time doesn't make sense\nOr in the new book uh it's law L. A. W. land air and water and a land cases you've talked about before but you've got some new ones including one that happened in organ pipe cactus national monument Arizona\nReady to take a break now when we come back this one has really creepy and even some of the investigators who are working the case admitted it was really creepy and will tell you why in just a moment talking to David ... is going to take a break the Ellen Parsons project break down into the break [noise]\n[noise] the ... places great news if you're a ... for simply want to enjoy our website on your boom visit ... dot com on your iPhone or Android roses [noise]\n[noise]\n\n[noise]\n\n\nMessage into your ... your considering going back to school I guess those are selling questions you need to flexibility to take classes on your schedule\nThis audio is for your review for ... Internet posting or distribution others he's a ... and the equality regional and his property and I aren't media Washington you are scheduled\nPlus ask you one line except most transfer credits\nFor information school she was three science timeline sat and learns ear sounds like the wall Street Journal makes an seals in the nation from producing the best qualified graduates and like eighty seven percent of ask you grab recruited within Ninety Days are graduation learn to grow and aren't you succeed and learned at the right at Arizona State university\nTo learn more about the one nine degrees ... school which is three science ...\nThat's the H O L algae is three by sidelined sat in\nA change in San Diego area how would you like to change their insurance should be months inconsistent mailbox money will listen to this actor dean chain newness\nSuperman on ABC's hit TV show Lewis and Clark and now we must have invested with the national realistic network or giving away the riches in real estate get for free to anyone who calls now bill show you their formula for flipping houses in your spare time for potential profit if you're interested in embarking on a new adventure impossibly changing the\nOptimal health introducing new Medicaid claims in Virginia and helping you get the most from your Medicaid benefits were more likely to go family care dot com that's bill family care dot com will call a three three four six seven eight to five night for Medicaid plans from up to my health\nYour life then you need to call right now call one eight hundred to two five four zero zero seven now to get your free riches in real estate kit\nColleague hundred to two five four zero zero seven now angel also get free tickets to a light training of in plus national real estate networks give parents\nWhich includes a free smart watched the networks guide to investing plus a special bonus their brand new tax lean investing kid free just for a gender thing called eight hundred to two five four zero zero seven that's eight hundred to two five four zero zero seven for your free riches in real estate kid to Jay\nHe's ... and ham why I have to go live\n[noise]\nThe FBI has talked to Brett Kavanaugh's second accuser I'm Dave Anthony Fox News they've interviewed Deborah Ramirez who claims the Supreme Court nominee exposed some self to hurt a party at Yale decades ago Republican\nSenator Jeff flake out the ball rolling on the weeklong FBI investigation and told CBS is sixty minutes\nThat I couldn't move forward without hitting the pause button [noise] um because what\nI was saying experiencing elevator and watching it in committee and just thinking this disrupting our country apart Fox is Doug ... will\nThe one week investigation into the allegations against cap and I'll be enough for Democrats and the Senate Senator Dianne Feinstein is asking the White House to explain what the FBI has been told about the investigation in terms of the scope and so forth and already some are complaining about that one week pun line that was part of the deal\nMessage indeed ... considering going back to school I guess those are selling questions do you need to flexibility to take classes on your schedule he must college credit unique transferred do you want to earn a quality degree in a world renowned university if you answered yes do any of these questions Arizona State university is the perfect school for you\nArizona State university I think over a hundred and fifty highly ranked degree programs a hundred percent on line he learned the same degree and see what I had asked from wherever you are on your schedule plus ask you one line except most transfer credits\nFor information text now kids three five five lines hadn't learned here sounds like the wall Street Journal ranks asked you stay in the nation producing the best qualified graduates and white eighty seven percent of ask you grab recruited within Ninety Days at graduation\nLearn to grow marriages exceed and learned at the right at Arizona State university to learn more about ASU online degree ... now two three five sidelined sat in\nEl ... kids three by five points at and\nNewsweek written go go [noise]\n\n\n\n[noise]\n... let's jumped into the case of Carol Turner this is pretty creepy what did you learn\n[noise] for people who don't know national monuments are part of the national Park Service with their property and they patrol it and their national park police are there\nWell there's an art location called Oregon or Ga an organ pipe cactus national monument and it's an Arizona far southern part of the state right near the border with Mexico on February third Nineteen Seventy one\nA woman thirty two years old named Carol Turner who was a student at the University of New Mexico [noise]\nDrove there and was going to take a few days vacation and break from school and kind of walk round she was inquisitive smart athletic brilliant some people called her [noise]\nWell I stumbled on to this case and sought some archive somewhere and I immediately wrote to the Pima County sheriff yeah some pretty documents on that case\nI got the documents in my hand that I called the national Park Service at organ pipe and ask them for their reports and they said oh we don't have any have you heard of the case no well the person still missing [noise]\nSo she was a thirty two year old graduate student she had been a PE teacher with a master's degree in physical education decided she wanted to go back and get to more masters degrees\nAnd she ... she was just really admired by all of the faculty that she worked around and and studied under and all the articles and all the reports said that they stay that she was really smart [noise]\nWell she was about to graduate with a degree in theology and biology and she was working in a ... a university lab tech to earn some extra money [noise] she loves the outdoors hike regularly\nOn January thirty first Seventy one she left her residence in southeast Albuquerque [noise] she was driving her white sixty eight point a station wagon and she went about an eight hour drive to the monument and she wept in her car that first night\nFebruary first it was a ... that she attended an evening ranger presentation at the end of that presentation she went up to the ranger engage them in conversation he remembered it and said hey she asked really good questions was smart\nFebruary second she went to the park visitors center spoke to a ranger they're stating she had just returned from a hike to bowl pasture and after about a guy the trip to a place called dripping springs\nSubsequent investigation found she spoke to a ... a ranger an individual named Larry Henderson city shoot he remembers or ask good questions was interested in the environment wander nowhere to go to see more things\nOr February third she moved her car out of the campground nobody knew exactly why and on February for it nine Fifteen and I am a ranger was patrolling and found carols car park in F. this Kenyan picnic site\nWith a note taped inside the windshield\nThat said if I'm not backed by four thirty pm on February ... please contact the ranger\nSmart smart thing to do\nExactly no I Wish everybody would do that but then as I went through this I started to think she was going to a place and she was heading to a place that she went to earlier and I always wondered in the back of my mind that something happened at first\nTrip and she was going back to the second time and just in case she was leaving this no I wasn't sure\nSo he purchased patrol vehicle and he had the two miles up from bull pasture he saw nothing and decided to check the trail register and it was signed by Carol the first day she went on February second\nHe notified park headquarters advise them that he has a missing hiker and this starts the search process\nFebruary fourth and fifth national park service that you sent in to Forman teams up that trail the search\nWhether it was described in reports is cold and blustery they determined care was last seen eating an orange on the trail and they did find some spare orange peel scattered around\nThe Pima County sheriff was asked to join the search when the national Park Service started to get low on resources they also called in the border patrol and the tribal police US Customs month an air force base\nThey brought in civilian helicopters was massive the search for three hundred ground searchers were on at any one time\nThe park superintendent a guy named Matt Ryan contacted turtles parents in North Carolina\nThe parents they did the care would never ever go off trail she was an outlet outstanding athletic condition and she was supposed to be back in Albuquerque on February fifth\nFebruary twenty second Matt Ryan told the Associated Press it's almost becoming a search for the answer to a mystery march seventh one last push to locate curl rangers claimed to\nSmell an odor of human decaying flesh up the trail\nMarch thirteenth national park service put team into the area of the odor and found nothing\nAnd\nAgain they have no documentation on the incident anywhere now I did get this NPs report that was in the Pima County documents and it was written by the chief ranger Roswell boils\nAnd it was three type written pages that outlines a search for Carole\nAnd Ninety percent of it real boring real mundane a review of what it says one additional point was turned up on Monday February fifteenth too limited locations about four hundred yards the park on the south west facing the host AJ or less\nA very strong in distinct human odor was found but he knew what their locations\nSupervising ranger how cross of swore oh that's where our national monument and one other searchers who was recently involved in the recovery of the body had very strong and positive feelings on the day than a vacation at the ... the\nFollowing day ranger cos after flying the area and a border patrol plane letting eat man search party back over this area again the odor was observed at the same location but only occasionally and not as distinct\nOther members of the team described it as a very weird and scary\nAll efforts were negative and search activities have been reduced to intermittent patrols at this time\nI have never and thousands of reports\nSeen anything described in our national park service report of very weird and scary\nFlight guys that yeah that's really strange is just dealing day had or the fact that they're smelling what they think is decaying human flesh but there is no source or the older\n\nWell here's what's as other members of the team described it as a very weird and scary\nSo I'm sure all of us who spent time in the outdoors have spent have smelled the odor of dead flash decaying some time animals die smell it I don't know if that could be weird and scary\nBut ah again\nThis was her second hike into that area which she nervous about making the trip is that why she left a note or where she just smart about it they never found her there was never any subsequent follow ups after that first sixty days search both of her parents are deceased she didn't have any brothers or sisters there's no\nThere's nothing left of her family anymore\nYou have another a case in in the book about a land disappearance that involves a really smart person somebody who's the editor for what looks like great things his name is Steven read and his disappearance was in Nineteen Ninety nine in Oregon told me about that one\nSo this is the one time out of the thousands of times where I read this case and I said you know I'm going to go against my own protocol I'm going to call the parents\nAnd I'm Glad I did\nBut Steven read missing June twenty third Nineteen Ninety nine salmon Butte trail head outside of Sandy, Oregon about seven miles southwest of Mount Hood and for people who don't know a lot of disappearances amount ... around Mount Hood that I've written about before he was twenty four years old\nI listen to 'em and I said okay I'll I'll give you a case and during that week that I didn't talk to them I contacted this victims wife I said hey that this person to help you in finding your husband\nShe goes he didn't do anything he never found him he never gave me any valuable information my husband was found on other means by other searchers doing other things blah blah blah on and on\nGeorge I'm a guy that has really open mind and I will use anybody when somebody lies to me I won't use them ever again and that person blatantly lied to me\nAnd in other remote viewing cases there was one guy did a conference with ... a couple of years ago really nice guy\nAnd the information he gave me wasn't even coast in the realm of possible\nNow there's another guy who's a remote viewer that I'm trying to work with right now hopefully he's better but as far as psychics I did a conference in LA about two years ago and there were seven or eight psychics own this row at a this outside area at the conference and\nTowards the end I walked down this row introduced myself to every one of these psychic said what I did what I could use their services for\nEach one of them said yeah yeah yeah we want to help want help for sure yeah we could do this I email each one of them the next week when I got back and I never got a response from one of\nWere talking about ... about his newest book missing for one more land air or water Mardi Palan\nA pioneer of the San Francisco rock scene died at the age of Seventy six this past week here's a one of his best\nGo to our el roofing dot com it's Monday October first what's new today on the FBI agents have spoken to a woman who claims to be in Court nominee Brett Kavanaugh exposed himself to her at a party in college the bureau's looking into that accusation and the high school sexual assault cleaned by Christine Blasey Ford boxes Chad program at the Capitol reports\nWaiting for the FBI to produce this report we don't know how long it's going to take now the agreement is seven days but at the FBI comes to the Senate and says it's going to take a little longer or we're gonna have to do more thorough job here you can't imagine that the Democrats and Republicans would be happy\nAbout that but they say All right let's take the time the Democrats might be very happy about that frankly because you know the longer they can drag this out the worse it probably is for Brett Kavanaugh and\nHe denied the accusations there's new trade deal agreed to by the United states Mexico and Canada it's called the United states Mexico Canada agreement replaces NAFTA the north American free trade agreement in effect since Nineteen Ninety four Fox News\n[laughter] Oh thank you very happy when did you know that with the capital's ... I'm ... I'm limited gamble miles an easy thing you by not\nIf you love football yelling at\nTelevision screens with friends and we're including with someone else's name on his seat waiting for you ... buffalo wild wings where you can enjoy football food and football beverages on our new five dollar game day menu cheeseburger fries rocks cocktails and pictures of beer or just five dollars each it's\nEight ... pm hour he's finding your hands the word ... news radio six hundred\nGo that extra help with retirement planning retire right with Epstein in white eight by eight five six four eighty thirty six [noise]\n\n\n\n[noise]\n\n\n\n\nFrom coast to coast and worldwide on the Internet just goes to goes to ... am with George nap now here's George bullet\nThe blue sky you to bring us back into the program or conversation with David White is about his latest book missing for one one land air water the era era cases are something different no departure for Dave and and they were featured in this book\nHe focuses on aerial try ankles that seemed to coincide with the clusters on the ground\nUp people literally vanished into thin air we're going to get to some of those in just a bedroom coast to coast am [noise]\n\nTake one atom of nitrogen and bonded with one atom of oxygen boom you just created nitric oxide\nA miracle molecule your own body makes such as your cardiovascular health keeping you vibrant but as we all age our bodies need help generating more natural nitric oxide super beach by human has harness the power of nutrient enrich beach and created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body\nOne teaspoon of super beach daily supports your cardiovascular health and blood pressure levels\nWe're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beach dot com and find out how you can get a free thirty day supply of super beach and free shipping with your first purchase field though one plus one equals boom affect the superb each call one eight hundred\nFive one five zero zero five\nThree or go to ... beach dot com today\nAre you considering ... or gun safe to secure your valuables and firearms if so before you spend\nAny money on any typical running all male safe ... amazing handcrafted rhino iron works shapes and rhino safe dotcom see for yourself why rhino saved customers are so passionate about their antique industrial style shapes and if you're a gun owner you'll love the convenience of those swing outgoing wreck\nI'd rhino safe dot com you get free curbside delivery a great warranty service so don't you know safe dot com today that's rhino safe dot com\nI just didn't hundreds of dollars by switching to Cal I've never done more lives\nDisclaimer cycle cannot guarantee you will feel more a lawyer you want to possess functioning respiratory and circulatory system you belong or you are or something if you are indeed a brainstorming on you would like to save money on car insurance looked like a legal team up all your excellent life choices even though ... we strongly encourage you to a guy go dot com or download the go ahead\nPlease stay a minimum of five hundred feet away from our lord and presumably delicious delicious brains\nGeico Fifteen minutes could save you Fifteen Percent or more\nNews radio six hundred go go [noise]\n\n[noise]\n[noise]\nSo Dave I Want to jump around a little bit to make sure we save some time to talk about the air cases so I Want to jump into one of the most baffling cases involving water it's a guy named Henry McKay but this is really pretty creepy\n[noise] that is a creepy case and ah [noise] it's a new Brighton Minnesota the community just north of Minneapolis not very far with the suburb September seven two thousand Fifteen to twenty eight am it happened [noise] McCabe was thirty two years old [noise]\nSo uh he was an immigrant from Liberia married to a woman named cream their two kids lived in a city called Mountain View again just north of Minneapolis roadside Koester area of missing people that I've written about in the past\n[noise] he had a great job using auditor for the state of Minnesota for the department of revenue [noise]\nOn September sixty thousand Fifteen his wife with kids uh went to California and it was a planned vacation well on that Sunday night Henry went out with a long time friend who's a very diligent guy always on time very respectable\nAnd he and his friend went to the early early on that Monday morning and ... states that have dropped him off at a location in critically at the super gas station at a Seventy third avenue\nAt two twenty three am Henry phone appears corrupt pocket dial this wife while she was asleep in California and walk to link the voicemail strange found screaming paintings growls et cetera", "show_name": "Coast to Coast AM with George Noory", "year": "2018", "city": "San Diego", "day": "01"}