{"month": "10", "state": "WI", "station": "WHA", "content": "You're listening to the ideas network of Wisconsin Public radio join the conversation by emailing ideas at W. P. R. dot org and like us on Facebook at the ideas network\n\nThis week says you take a look back over the years [noise] [noise] [noise] [noise] all\nMake Justin I'd like that I think that they'd call on this on the original sin tax\nAssemble the original panel to revisit our very first episode pilots spelled P. I. L. M. T.\nSorry I Can't give you points for that but\nWe've discovered that in twenty plus years some things haven't changed at all\nIt's a retrospective says you coming right up\nFive from NPR News in Washington a joyous night or after weeks of division Brett Kavanaugh has been sworn in as the newest Supreme Court justice cabinet took his oath in a private ceremony shortly after the Senate narrowly voted to confirm him\nPresident Trump calls Kavanaugh's confirmation a tremendous victory he spoke to a packed arena in Topeka, Kansas last night as a ... of member station ... reports\nThe president praised the recent appointment of Brett Kavanaugh to the Supreme Court Trump criticized the Democrats and their supporters for trying to delay the process\nRight away and thrown aside every notion of fairness and justice of decency and of due process nobody seen anything like it\nEarlier in the day people waiting in line outside the rally cheered at Kavanaugh's confirmation a few dozen protested the news and a designated area away from them\nI'm no mean ... in Topeka\nIn Washington DC the Senate vote for Kavanaugh's confirmation drew large crowds of protesters to the steps the U.S Capitol end the Supreme Court NPR Shannon ban Sam was there\nAnd I keep I thought they knew that happen I wouldn't be confirmed that went to the protesters had that I spoke with\nWas that demonstration west part of a much larger movement which they have okay I'm going to turn elections in November and I and really part of the larger long term is ...\nI that is both political but also social and cultural trends as demanding as quality and respect they they have for went in and for for lots of groups of people\nIn the international police agency Interpol is urging China to divulge the whereabouts of its president who's gone missing on a visit to his home country NPR's Rob Schmitz reports\nInterpol president Malone way is the first Chinese national to head the police agency he also serves as China's vice minister of public security that's why his disappearance as surprised international observers the south China Morning post has reported the sixty four year old Communist Party official is under investigation in China inciting anonymous sources\nPolice in France have launched their own investigation amongst disappearance after being contacted by his wife and Leone where the ... and we're in trouble as its headquarters\nMom was last seen in France on September twelfth night before he left for a trip to his own country he was appointed head of Interpol in twenty sixteen is expected to serve until twenty twenty Rob Schmitz NPR News Shanghai\nA prominent Saudi Arabian journalist John Malkovich hoagie is also missing and there are fears he has been killed reports out of turkey so he was killed inside the Saudi consulate in Istanbul Turkish officials have told the Washington Post that investigators believe ... was killed in a pre planned murders Saudi Arabia ... however\nSay the allegation is baseless and from Washington this is NPR News\nResilience are going to the polls today to choose a new president NPR's Philip Reeves reports a new poll shows a late surge for the far right candidate\nShy both NATO a veteran congressman is the pay up front runner up a few years ago he was a minor figure notorious for offensive remarks about gender and race now he could be about to leave Latin America's largest nation shop to the right\nTo when he needs more than fifty percent of the vote otherwise there'll be a runoff probably between him and his chief rival from the left is ... body\nPolls showed balls to NATO support rising steadily during the campaign most of what she spent in hospital left to being stopped at a rally it's supposed to say he's a champion of family values and upload his hard line stance on crime and corruption\nBut not as an Mara Brazil's pass miniature dictatorship which is why his opponents say he threatens democracy itself Ray's NPR News Rio de Janeiro of\nPeople in Bosnia Herzegovina also voting today they are casting ballots in a general election that includes the country's three person collective presidency established after the Nineteen Ninety five peace deal\nToday's presidential election in the Central African nation of ... ruined has been marred by violence official say at least two armed separatists were killed by security forces in the northwestern town of ... and in Romania voters are wrapping up a two day referendum on a constitutional amendment\nThat would make it harder to legalize same sex marriage spoke requires\nA thirty percent turnout to be valid on trial Snyder NPR News from Washington\nFor NPR comes from capital one committed to reimagining banking offering savings and checking accounts that can be opened from anywhere capital one what's in your wallet cap\nAndy and Catherine T MacArthur Foundation and Mac found dot org\nWelcome to send you a game of bluff and bluster words and when they do\nNow join our panelists can your host this week Dave do\nUm Martha's Vineyard Hebrew center in vineyard haven Massachusetts Welcome just says you a simple game with words played by two teams the first of which sits stereo left\nThe first thing you ever heard her say on says you in season one episode one round one was a myth Carolyn Faye Fox [laughter]\nIn season one episode one round one he can be heard saying first of all your questions wrong\nAnd you know losing one episode one round one she can't be heard saying anything because her husband keeps interrupting her [noise]\nCouldn't today by how 'bout Arnie yeah Mitch or ... ... why why do you want to know\nTo the right team to in season one episode one round one he can be heard and using but there's an enormous number of calls in here Mr Tony car on\nSeason one episode one round one is the first time we ever hear her say no more sports questions misprint enact bar and in season one episode one round one he's heard making the on refusal offer Francine I took the last one I think this is yours Mr ... [noise]\nWe had stayed in character I must say that he's going to need our team\nBarry will be the captain and all of that really is true guys are game is played in five rounds correct answers are worth ten points or any ... in their own deemed appropriate we always advise new listeners to grab a pen and paper that we've always done it\nBefore we begin it's worth noting as soon as you landmark today this is the first time in over four years that all six of our original panelists have sat together it's nice to have you back in ... I Hope [noise]\nNow made 'cause he gesture and I'd like that I think they could call this some original sin tax [laughter]\nSame line up we had all the way back in season one episode one the very first episode of says you ever was taped almost twenty two years ago at the Charles hotel in Cambridge, Massachusetts and six brave panelists five classic rounds\nSo let's begin today just as we began back then with a round of common threads and for his assistance our thanks to W. R. V. O. listener and prolific contributor Dan ... of mentally is New York ...\nWhat is it a common thread connecting to more or less just also known as east Timor ovaries Egypt team or east for Montenegro\nI'm Janette Serbia Serbia\nPen for you [laughter] know sandwich hands tomato sandwich with a score thirty to twenty nine or needs team just\nBarely in the lead we go on to round to the contribution of WC a listener in foster of ... Massachusetts it's the first of the says you bluffing rounds played with the little musical help from our friends Zoe in John Zemin\nArnie each person on your team will receive a card\nOne of those cards gives the actual definition of a real but unfamiliar word the poor souls who received the other two cards will have but a few seconds to make up a definition on the spot good enough to fool berries team\nTen points are up for grabs to bury if he can spot the truth teller or do you Arnie if he kept a few moments musical enhanced to come up with a definition for the word to\nMosques bunker M. O. S. S. B. U. N. K. E. R. mosques bunker so we in John [noise]\nNew season begins for all of us here at says you and this November as the ... center migrating and the bears are hibernating saddle up for Bozeman in billings yes to live shows tickets for Montana\nWill be released this week you get yours before the snow begins to fall check online for tickets an old the grisly details as always had says you dot net that's essay while yes Y. O. U. dot net [noise]\nSays you pause for a few interests digital announcements\nI'm Christopher nibble for milk street radio this week I chat with legendary restaurant\nMeals the order restaurant reviews whether there is such a thing as authentic food [noise] also in this week's show we discuss the demise of Tex Mex squeezing wine expert Steven use proposes a better way to think about preparing food and wine coming up this week a mystery radio from here at ten on the ideas that won\nSupport for Wisconsin Public radio was provided by the Lee Esther news fellowship providing early career journalists the opportunity to learn hands on reporting editing and broadcasting in a professional setting as part of the WPRI news department\nSupport also comes from sass dedicated to providing innovative software and solutions to government agencies and all fifty states more information is at S. A. S. dot com slash go sass the power to know\nYou're listening to the ideas network of Wisconsin Public radio join the conversation by emailing ideas at W. P. R. dot org and like us on Facebook at the ideas network\nDo you blame it on base Jiang Zemin on guitar Samara Oregon keyboards and rubbing salt on percussion and drums thank you so much guys for giving us a few moments with the word must bunker MOSSAD B. U. N. K. E. R. let's go first to Carolyn most bunker\nIt is a maintenance man slang\nFor a stalled elevator filled with cubicle workers end an awkward\nSilence [laughter]\nArches brother got to go fix some spunk or it gets pretty right than their [noise]\nAll right it's a stalled elevator or Arnie\nIt's like if you're given lemons make lemonade it's it's a it's a\nA fish in North America that I really couldn't sell because it really stinks to high heaven so it's been used for many years to make fertilizer\nAnd sometimes more oil's\nWhat oil's affect you had more oil oil you know make a boy when I was [laughter]\nThink the fish I sticky fish\nOr ... well that's where it left over from the early days of ... you know cave exploration meaning a shoe caked with algae from exploring in the dark and damp Mm algae cake\n[laughter]\nWell there you have a very it's either a shoe caked with algae a stinky fish or a stalled elevator which one is it they all smell to me [noise] a friend saying\nYou've been often the installed elevators do you have any idea\nHow Tony and I are inclined to this stinking fish we are indeed\nYou're inclined to think that a mosque bunker is a fish that smells and could be used for fertilizer\nIt's it's also more that\nKind of relationship to the real world if you know what I mean it's all the others are shaped so specifically attuned to a problem that I don't think\nYou'd find them in the dictionary I mean imagine one going along let's back the yelling that when we're not by the end the algae coverage you can't I just think certain certain objects\nNever get words because they're just not as significant enough you know they don't get to make it as a book just about big book she didn't have\nEnough alright yeah\nWe will go with armies definition that mosque bunker is a fish that smells bad but makes good fertilizer\nArnie ... they think that most bunkers a stinky fish would have thought that I'd just reporting what does your guard say\nIt says a North American fish [laughter] not very tasty kind of shed like mostly use for oil and fertilize\nThere's an interesting footnote on my\nIt says his origin is Dutch most likely this was the fish the Native Americans taught the pilgrims to plant with their crops not too far from here\nThat are score now is thirty nine to thirty with berries team surging into the lead and please help me thank our hardworking scorekeeper today that's Terry's oh bell William [noise]\nLet's continue our around by round reconstruction of the very first episode of says you with a reprise of its third round which was a round up says who are ten points\nSimply named the author of each of the following lesser known lines and you're not you should be able to work out the authorship from the style and substance\nCarolyn who wrote this your wig fits very well the ... looking at her with an expression of admiration it's the shape of your head as does it\nWell well right that sounds a British shape of your head as does its assets the ... yes is this Alice in wonderland who wrote it as the question Lewis Carroll Carol [noise]\nWell that is from through the looking glass and actually it's from a chapter was deleted nobody wanted to read about a wasp in a way to get it [laughter]\nTony who said this your vote your ... vote your ignorant vote your wasted vote put\nIn an administration in Washington DC that has seen fit to pass every kind of legislation imaginable saving you until last then filibustering on top of that\nCould be Sinclair Lewis [noise] uh no it's not Sinclair Lewis' could guess is is is it from Mr Smith goes to Washington no is this a novel it's not a novel it's a speech oh\nIt was set in Nineteen\nSixty fourth ... your oh well then it would be a ... a Goldwater\nPerhaps would you like a hint\nOf yes in that same speech\nHe also said we want freedom now but we're not going to get it saying we shall overcome we've got to fight over ...\nWas it was it a LBJ no it was LBJ I think it was more the target of this but I'll give you another one 'cause I hadn't really enjoying reading this speech now can he said\nDon't usually deal with those big words because I don't usually deal with big people I deal with small people I find you can get\nAll out of a whole lot of big people\nYes what's his name who got shot yes oh oh yeah especially George the governor George Wallace Wallace George wells\nAnybody on the other side [laughter]\nWho would like to what the hell out of big people in Nineteen sixty four it was a speech called the ballot or the bullet\nI Know it can get your\nMarriage to a lion and they'll am sort of Becker a lion\n[laughter]\nSo I agree with you I I really think all of us are likely to be huh let's go\nAnimal of mixed heritage\nEjection we're going to go back ... runner\nTony they say that worry so is the offspring of a male and female alpaca shortly they jest\n[laughter] what's your card say it says the offspring\nAre male or female out\nIs that Tony is that in fact ... where it is a catch ... and it's the only catch her word I can claim to know how\nEach week our listeners write in hoping to hear nearly last but not gotten rounds from our earlier shows\nComedy with a spotlight brown\nAnd for us the chance to spend a little time\nFind the following theatrical idioms an additional three points if by some miracle you can divine the derivation Carolyn ... at ... and ... he\nAsked a stripper yes well it comes from us I think it's the Greek for the shedding of skin by a snake well ten ... [noise]\nA for an additional point you know who came up with it do I know you run a she was the instigator but who actually coined the word ...\nThat's exactly right and the show making\nGyros Tony break a leg they wish a that is bestowed upon every person before performance meaning hope you have a great show it's exactly hum break a leg\nI think comes from a performance of mud bath\nEvery weird thing in the theater seems to come from some bad performance of Macbeth for things went wrong including whistling not whistling before performance and uh I think uh probably um it was a way of certainly away warding off a danger by you know\nNo that's the superstition ... Blake have anything to do with the curtains no originally\nThought to have come from the concept of being so successful that one would come out for a curtain call and take such a low bending bow that the leg would literally break Ernie that's our any locally\nOkay she was a sharp shooter and the Buffalo Bills ... and the\nDoesn't need to hit you target hit your mark yeah\nNo that's not it anyhow ... well\nIt's a free ticket and uh resembling a ... which is punched resembling that the\nResembling any oak leaf marksman ship trick of throwing a card in the air and having a ... call shot through it let our\nRichard top banana well the top banana is\nThe star of the show is it not\nUse the head of the second and he was laughing at it was the the funniest ... the main line comedian\nYesterday in a vaudeville that seven points and how we get and the derivation ah this is in dispute so you'll get points for almost any [laughter]\nWho is in in ... yeah well\nScholars a dollars in this very right studies this route scholars uh\nThe vaudeville players bananas because they were inexpensive backstage and the guy that was the funniest was able to take the first one a ... point\nFor that show us I I have never heard that but that's worth a look for that he was doled out the highest price that's another\nPoint for that 'cause that may represent corporate funding [noise]\nAny other guests ah before I had great appeal\nThe full ten points yes\nIt's origin is disputed but some sources say comes from the old slip on the banana peel routine which always got the biggest laughs Paula Markey\nMarkey is is the uh is delighted to sign outside of the terrorists and that that that is in late in the players and then\nTen more germs [laughter]\nI said the marquee refers to the to the starring cats or the new kids on the block Markey mark [laughter]\nWell there's going to be some points in the Marquis I married a woman now you're on the right time\nIt was considered noble to have your name in life\nGives them not yet there tends to insist they must yes actually it's a large tent or canopy in front of a theater\nWith advertising lights indoor building but it was originally a large field ten used by an officer of high rank or noble stature such as any more questions and finally burying deus ex mocking\nGod from a machine\nAs the desert back now that means a sort of unexpected and somewhat mechanical resolution to the problems facing the characters in the play\nAnd it comes from at the ancient Greek practice up sometimes what they would do is they would actually lower ed God like figures from a crane like device on to the state that's exactly right\nNow back to the game at hand let's close our celebration of the says you origin story by revisiting the same game that close to our very first episode what's the difference\nContributions come from John sorrow of Seattle and hall of famer build Spencer of copies ville Maryland Carolyn what's the difference between unexplainable an inexplicable\nAn unexplainable means that there is no explanation for it\nInexplicable\nMeans gosh that's amazing\nAnd complicated and complicated you are split company exactly backwards backward the other way around I don't know [laughter]\nWe're not right [laughter] they both implied difficult to explain but unexplainable implies that the difficulty lies in the explaining not necessarily in the understanding inexplicable implies not likely ever to admit of any explanation\nFor example the thought processes of politicians are generally unexplainable those of the voters in ... Tony yes what's the difference between rules and regulations\nRules are the basics you could call it back\nBone uh the structure of an organization regulations are the individual a specific um strictures on some specific kind of activity\nThat is what I thought as well and it turns out to have nothing whatsoever to do with getting rules are can be stated just general or regulations require numbers [laughter]\nLike Roberts rules of orders and versus regulations about how you have to uh put in a\nFire extinguisher stuff okay I'll think about it very long way there so I think I'll do a a rule\nCan be a an agreement about how something will\nProceed or how as something will be like the rules of the game like the rules of baseball robbers rules of order something that this is what we all play by a regulation is a set of requirements to impose on people that are doing some activity\nOr for instance in ... installing sprinklers to suppress fires\nYou have to you have to obey these regulations and meet\nThese standards ... measurements maybe regulation\nOne of those measurements one is an agreement the other is an imposition by the government thank [noise]\nAre sets of instructions but only\nSupport for WPRI comes from Nordic a consulting firm dedicated to helping health care organizations drive the best performance from their people and technology more information and career opportunities are at Nordic W. I. dot com\nDrill the second was said by a lawyer [noise]\nDefinitely getting points for that [laughter]\n\nWhat ever um\nWhatever merely don't care about the outcome here but what so ever is um it's if it's got like a finality to it at ... this this has nothing to do that whatsoever it's it's really hard to it's an absolute and fat and it it's not yeah\nYou're using them in ways that are leading towards the answer it's really a grammatical difference oh well we're talking about ...", "year": "2018", "show_name": "Says You", "city": "Madison", "day": "07"}