{"month": "10", "state": "FL", "station": "WJCT", "content": "You\nLog in all those men\nDay [noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\nFully a weekly presents the best object readers bowl this year every boat is an intriguing to our sweepstakes they're over five hundred categories starting September nineteenth continuing dropped over twelve voting is open for a local celebrities attractions and merchants more fully a weekly dot com\nOne voter in a poor Kentucky County that she is doing well under President Trump did you get those still in poverty should work their way\nOut there's some people that are just have a life did it kills me just because I Do work for everything I have\nHer vote in November could help determine control of the health of view of the midterm from three quarters of the Kentucky district that's on the next MORNING EDITION tomorrow morning starting at five on eighty nine nine W. J. C. to your community your world\n\nDid she's eighty nine nine W. J. C. D. Jacksonville your community your world looked like clear overnight a low of sixty seven or friday sunny a high near eighty five for a weekend sunshine I seen the mid eighties\nYou're listening to a bond radio I W Jake\nAnd\n\n\n\n[laughter]\n\n\n\n\n\nYou're listening to about radio in W. J. C. P. eighty nine nine FM I mean I was ... marks this is of on radio tonight theme is from Spain to a rape yeah\nLooking at the intersection between Spanish in Arabic music or play listen more information chicken sat on the Web on curious dot org state curious\n\n... ... ... ...\n...\nKnow no ...\n...\n...\n\n... ... ...\n... ... ...\n... boom\n...\nNo no no\nNo no no no no\nNo\n... ...\n\nNo\n\n\n...\n...\n\nThey have big brains they talk and they've been up to space and back I'm Ira Flatow on science friday primatologist I Need a stone because the chatter of our tree dwelling cousins the squirrel monkey\nAnd yes she is fluent in squirrel monkey it's all on science friday from WNYC studio friday\nAt three on eighty nine nine W. J. C. T. your community your work\nThis is Ira Glass or the smack my end up coming to Jacksonville even talk that costs seven things I've learned is basically just an excuse to tell about your stories like videos talk about how we make a radio show I talked about stuff we have not been on the air and never will put in the air\nJust play stuff that seems like it will be fun to play for a crowd Saturday November temp at Florida Theater budget by community first credit union\nTickets at Florida Theater dot com", "show_name": "Avant Radio", "year": "2018", "city": "Jacksonville", "day": "12"}