{"month": "10", "state": "AZ", "station": "KJZK", "content": "\n\n\n\nYou're listening to the parents are in that community radio network kj nicely I drink Katie ... Ninety point when you have to be mainly family came\nOver here this Saturday at eight PM whatever you do do not listen to this program [noise]\nOut of ten listeners me they're not very bright Saturday they\nListen and do not visit them at radio and Cindy zone dot com\nWe weren't you support for the Arizona humidity radio network is provided by cable lawn providing TV every wire get more out of your cable TV experience with TV Everywhere standard\nCable customers have access to fifty plus cable networks that you can enjoy watching from your computer or your tablet or smartphone to learn more go online to cable one dot net that's cable one in ... county\nFind useful information all the public radio programs you enjoy that inform entertain educate ended a license lush all linked to our live live stream at kj Z. A. dot O. R. G.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee our children are stealing more with the ... years and then we can\nFrance I mean ... to\nAnd we just make it easier future as far as how they behave relatives are bad for you to ask yourself is how would you for your\nThe just fly\nThese are real definitely learned more about the communist revolution check us out\nThe time this revolution [noise]\nSupport for the Arizona community radio network is provided by Grand Canyon near farms eight miles east of William's on the interstate forty slot commanding deer seen him right out of your hand it to the animals that ...\n... buffalo or else camels co watching Monday kangaroo law makes it rained here in more the Grand Canyon near farm near Williams\nSupport for the Arizona community radio network is provided by\nArizona the drive through wildlife adventure park in Williams, Arizona view by mountain goats and sheep and black man from the safety uncovered over your private vehicle or travel coach watch playful Barrett cubs up close at the end up you were to Arizona like forty get highway sixty four in Williams, Arizona dot com\nI this is Dave matter your health for radio unlike joined me as a while for you to feel the same thing every week we bought our house in the ground searching casting music makes sense from on your cell phone and play you some of the radio on\nSaturday right here I'm hungry and you're not twenty five FM kj ... valley Ninety point you want to ask Jacey ask\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "show_name": "Classic Jazz with Bryan Houston", "year": "2018", "city": "Kingman", "day": "10"}