{"month": "10", "state": "NY", "station": "WAMC", "content": "Koble skill Albany offices neutral funds IRA rollovers in small business retirement\nPlans spend more asset dot com [noise]\nThanks to my ball when our engineer [noise]\nWas it was Phil or producer and to you for listening I'm David ... of the roundtable is next it is nine o'clock\nThis is Northeast Public radio WAMC F. M. H. D. Ninety three Albany W. R. U. N. H. D. Ninety points reruns in Utica W. M. K. HD Ninety point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown UCLA each dean any one point nine Plattsburgh WC A. N. H. D. Ninety three point three ... three nine tie kind of robots\nW am cue HD won all five one great Barrington W. W. E. S. H. D. eighty nine mount Kisco WINZ H dean any point one Stanford W and our eighty eight point by Brewster WAMC am fourteen hundred Albany\n... ... ... ... ... ... ... [noise]\nSense of October good morning and welcome to the roundtable I'm ready graph for Joe Donahue stand up comic Wanda Sykes is bringing her new torture you pack in Kingston this month\nSo to speak with Joe Donahue Allen shark taco beyond the congressional corner with congressman Sean Patrick Maloney the national tour of Anastasia is uh proctors this week we'll speak with actor ... Kogan about her work in the musical than darn rabbit will tell us about how a mysterious\nEuropean showman saved thousands of American Babies\nAnd Linda ... Klein will share her first hand account of the devastating effects of evangelical Christianity is purely culture [noise]\nIt's all coming up on the roundtable the first half of the show is the roundtable tunnel and with us today Terry Gibson Jim Smith job and they are now in shark talk all the head on an action packed Wednesday edition of the roundtable it begins afternoon [noise]\nHello I'm ... with the baby singing the oath origin in China have legalized the use of re education camps in western region of ... young saying they want to transform people who've been influenced by religious extremism that's been growing concern about the disappearance of we get most games in ... John\nUn human rights committee recently had that China could have locked up a million people his age ... Michael ... style\nThat cold vocational training camps which makes it sound like people that are going to get woodworking skills or something like that but there's also a components in them about re education is quite clearly about that it's about transforming religious extremists thinking the way people act\nCorrecting behavior change in a psychology so this is really the first time because up until now the Chinese authorities of that nature day being doing something in change and but not getting as real details ... she said this time we've had real details about what's going on that\nChina has begun to why to campaign against Islamic practices across\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nMood new regulations old to make it clear that most women up on from wearing veils\nTigers media have shown video images that they say may shed light on what happened to the missing Saudi general it's Jamal ... G O D Arabia denies that he was mad\nThey took a job she hasn't been seen since the end of the Saudi ... more than a week ago in the footage Fifteen Saudi officials are the number arriving McLaughlin reports\nCc TV shows their arrival in Istanbul by private jets hours before Mr ... g's disappearance the scene checking into two hotels made us Saudi consulates that booking was for several days but they left early\nBlack down vehicles are shown around the country let's move into the consul general's residence around Ninety minutes off to them is the ... vanished did they contain his body\nThe two planes flew back to Riyadh that night one vi do by the author vi Kyrah\nA quote in Britain has identified the high spending why for the jailed international banker it's the talk to the new anti corruption law ... whose husband was convicted of defaulting millions from either by John ... bank spend more than twenty million dollars at Harvard's over a decade donate ... has more detail\nUnder the terms of the u._k. book ever unexplained both older ... now it's held a national crime agency how she and her jailed husband became so rich they both deny wrongdoing\nBut if they fail to give a clear account the agency will apply to seize that property this is a test case with investigators planning to seek ... or just in the months to come\nIn a statement ms ... lawyer that she intended to fully engage with the judicial process and that had been no funding by colds that she had acted criminally well news from the BBC\nPolice raided several of Belgium top football club as part of the major investigation into alleged fraud and money laundering link to play I trends that local news reports say a prominent agent has been arrested in connection with the ... of a right to own guns apprentices across the country by more than two hundred police officers\nFlash floods on the Spanish on individual can have left it needs nine people dead six others are still unaccounted for soldiers with sniffing dogs are looking for survivors and ... go ahead ... report\nThe town of ... the kind of outside on the east to the only ... ball the brunt of the flooding which will cause wash down streets ... hundreds of people stranded in their homes\nDozens of others were evacuated and tennis star ... has offered his nearby sports academy as a shelter for those whose properties of being damage\nA British couple who had been traveling in a taxi is among those reports are dead\nWe'll go to the old ... confirmed as the rain has eased off from a yoga today will other parts of Spain such as Molly go around high alert\nBut he's in Kenya say to teach and have been killed by suspected isn't as medicines in Ventura County\nAn explosive device was thrown into the teacher's house setting you don't find it but those non Muslim corresponded say it's possible this was the reason they were targeted as the militant group al Shabaab has singled out Christians during previous attacks in Kenya\n[noise] the authorities and the Democratic Republic of Congo have introduced new measures to ensure that people comply with ethics to contain the deadly Ebola virus health workers in the city of Benny will now have police escorts when taking bodies for burial the company's health ministry oath as health professional\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nTown to immediately rift that oil suspected Ebola cases to the official treatment Santa BBC well said it's me\nSupport for WAMC come some Albany distilling bar and bottled shop Seventy five Livingston avenue featuring an array of locally produced beverages announcing barrel aging class one on one October twenty seventh sales at Albany distilling dot com for information\nOur lady of Lawrence highschool academics character college prep on an Eighteen ... acre campus in the town of the kids see open house Sunday October fourteenth one to four O. L. L. C. H. S. dot org\nOdyssey bookshop south Hadley Jennifer Baker Alexander chi and Eli Rosario present everyday people and then the allergy of short stories illustrating the dynamics of character and culture October sixteenth at seven PM Mount Holyoke odyssey B. K. A. S. dot com\nStat rose helping people with disabilities achieve their dreams offices in Amherst Greenfield that Springfield step rose dot org for more information\nAnd Lakeview orchard and farms in Ninety four old treasure road lanes Perot Massachusetts peaches plums apples pumpkins apple cider homemade donuts pies pastries ... Lakeview orchard dot com\nGood morning ... this is WAMC regional news on David goes you know in the headlines a state transportation officials as the owner of the limousine that crash and kill twenty people in upstate New York was warned not to operate a vehicle after it failed and inspection WAMC easy and pick us reports\nDepartment of transportation spokesman Joseph Morrisey says the two thousand one Ford Excursion that crashed Saturday was placed out of service after uh September inspection and what subject to additional inspections\nWe can limit attorney for prestigious limousine says code violations sided in September fourth inspection had been corrected and limousine cleared for service more she says that's categorically false\nLimo random stop sign and crashed on a rural road twenty five miles west of Albany on Saturday killing the driver all Seventeen passengers and to put ... state police and the national Transportation Safety board are investigating what caused the crash you'd pick us WAMC news\nMeanwhile there is a vigil for this could hurry crash victims tonight at six thirty PM in the gymnasium at ... high school we tend to governor Kathy ... is expected to deliver remarks at the vigil [noise]\nIn other news a former Democratic party chairman from upstate New York has admitted arranging for a Canadian citizen to make it illegal twenty five thousand dollar donation to a New York officials reelection campaign WAMC is Elizabeth hill reports\nGee Steven pigeon of buffalo pleaded guilty to a federal conspiracy charge on Tuesday it was the second guilty plea in two weeks from the former Erie Canal party chairman he pleaded guilty and county court September twenty eighth to bragging a judge in Tuesday's case prosecutors say pigeon admits that while working as a political consultant\nHe solicited the donation from a Canadian Business executive\nKnowing that foreign donations to state campaigns are legal\nOkay one eight hundred three two three nine to six to\nOne eight hundred three two three nine to six to or you can go to W. A. M. C. dot org and when you talk to the wonderful operator if there are any out there yesterday there were so many calls it they were back it up yeah because you know this is not a regular fund drive so we don't have sixteen volunteers or Nineteen volunteers sitting out there\nUh everybody has to just sort of\nGet getting doing if I I was wondering whether re could start answering phones right from where you are right here now ... could go wrong hello yeah ... okay so um so again one eight hundred three two three nine to six to\n... will get two thousand dollars one eight hundred three ... three nine to six to end or\nAnd or and or an ad and WBAI WAMC dot O. R. G. right now some people will do the other thing they inverted the stuff you a something see\nOkay oh that's good oh you're bourbon sir you get past the bourbon I'll join in places like is there much of it and uh okay you're looking so distraught you lose your looking like a Andre cussing and when he was in a bad mood\nOr you know presumably you would do this so uh he had well I'm old enough to know yeah and he looked like you go you looked like him are used to stand up there with all those other Russians remember jokes and\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nYou looked just like them to disqualify as the panel one eight hundred and eighty nine six two small right in Russia [laughter] so I'm not I'm rushing to but I Do not [laughter] uh well before\nWe get into politics and such today uh\nThey're they're battling down the hatches in Florida Michael's world on to the Florida Panhandle as a still growing category for this morning that's unbelievable ... or ... or neutered and a huge wins expected that could be the worst hurricane the rest of the BBC says hurricane in recorded history for this stretch of the Florida coast\nA National Weather service says going back to eat to actual actually national\nHurricane Center says going back to Eighteen fifty one there have been no category for hurricanes ever hitting the Florida Panhandle this is a biggie three hundred and Seventy five thousand people up and down the Gulf Coast have been ordered or urged to get out and I guess landfall sometime around\nNoon today you know I was thinking about the last ... the name of that one that just went by fill in the ... that's the only forget 'em they kept saying it was looking like a five uh five than it was a four three two and then it was a one and not quite a one when I went in there so this is an absolute\nFor its huge\nWelcome to especially on the the Gulf side of and then you think about it in the last year and then as we are getting these hundred years storms happening every year or you look at last year with Maria and Harvey and now this year with Michael\nOr the political impact there is a political went back to the store because you have the mayor of Tallahassee tell houses right there on the panhandle like Andrew Gillum is running for governor\nAnd you know you've seen that sort of response so you always see in these situations storm politics come into play especially being so close to the general election uh but certainly for the panhandle Pensacola you have Tallahassee but even in Georgia in South Carolina that impact as well correct in ... in fact just this morning and saying hey\nGeorgians wake up right and it's coming for you as a matter of fact the track of this storm basically goes up the panhandle and through a Alabama Georgia the Carolinas into Virginia before and heads out\nTo say okay now if you look at Florida right you see that spoke that comes out into the ocean and that's not the panhandle right that's just something else like Miami isn't released a painting painting and it was on the upper than\nUp north up Alabama way losing idea out that way Georgia at that way yeah okay so we got 'em up no [laughter]\nNo I Know what it is and this is going to be terrifying we all have friends there um and you know it's always this question as to whether or not you know you can get out or whether you should get out of the painting and if we all know that that's for me every once in a while I've been thinking about going down there and relocating to Florida\nA but I'm I'm not doing it any more\nMy uh my father actually real good looking relocated to Tampa Bay yeah is actually up here in New York this week say delayed all flights out of um you know J. O. already and yet we're not going anywhere there's ... ... a lot\nHappening in terms of that preparation both in and around for that and even places in in Georgia and Alabama there already closing schools um and you know higher it was interesting prior to the Nikki Haley announcement yesterday President Trump said you know don't worry basically seen has got it under control um\nAnd I you know that I think gives people a false sense of confidence John Vietnam\nThat it that you know this is a system that's highly under\nPressure it's only it's still early you know October and it it's still we're still in time hurricanes\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAs for what Florence costs the Carolinas um that's in the billion dollar range in terms of how it affects productivity how it affects the environment\nUm this part of Florida and if you look at the geography I'm really dense with trees and there's a lot of potential for a lot of tree damage\nAnd and flooding um it's also interesting of of who actually lives there year round um and there's a lot of of fisheries and in in areas that they're going to be\nA affected and these are people if you look at the local paper is a local radio station so local TV stations it's a lot of people saying they're staying um so what does this mean for the ...\nAnd I've always wondered a about the the the the mindset of those who say I'm going to ignore the evacuation order and stay ... always wondered how that works at all so I Wonder how you want to force it if there was a mandatory evacuation through the police go door to door and find out how do you do\nI think I think they do do that as much as they possibly can but they're always comes a point where they begin to say that emergency workers were no longer be able to access these areas and so you will be on your own if you don't get out by the state but I also think that this hurricane along with all the other extreme weather we're having\nJust underlines the urgency of the report that the UN just put out about climate change about how not only are we not prepared here on a you know the the Florida coast in the Georgia coast Alabama coast but we're not really prepared across the country across the world for the extreme weather that we are now under going in our certain to continue to undergo and\nAll governments especially the United states really do need to step up and take the lead and making a proper investments in infrastructure and planning to deal with this in ways that just aren't happening and we don't see it happening with the Trump Administration we don't see it happening with FEMA\nAnd I think um to just point to say that famous prepared and has it's under control really um [noise] it does a disservice to the American\nPublic is not a team of climatologists they're not experts on the ecosystem and I think one of the things that's really evident chair my uncle is a fisherman so I learned a lot about the tides\nAnd the ties are are literally changing on the currents that the temperatures of the water or changing so you have a very evident um\nRed algae bloom which is something we've been hearing about here in New York state and then added luxurious in the pictures from the ... um I think it was the I think in New York state where we are now there is like sixty one bodies of water that were affected with\nThe toxic red algae bloom um when you have stormed situations obviously the tides get disrupted things move\n'em that that results and fish killed in results in more pollution um and that again sex industry and your age your ability for your economy to recover in a timely fashion I'm the last year we had Harvey that affected\nThings like oil refineries and oil and gas availability I'm already you're seeing a larger demand for for fuel right now I'm prices went up last year of about fifty cents a gallon\nOf what will be effected um this area now uh especially because it's not just isolated in one area but it's it's it's going along so\nWe would love to hear from you the email address here is panel at WAMC dot ORG panel at WAMC ... low number again for the\nPhone number and thank you for reminding me we have a challenge on the table two thousand dollar challenge I don't want to lose it either to hit the four hundred and fifty thousand dollar market in the lock box by ten thirty this morning we started the show nudity Thirteen thousand seven hundred Ninety six dollars and as soon as amber\nComes in and she'll be doing it at once every two minutes now\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nDo that but you can make your pledge by calling eight hundred three two three nine to six to eight hundred three to three to six to or you can go to our website WAMC dot org and make your blood there\nAnd I got a call ... a ... ... email overnight saying you know I'm an old fashioned person every once in a while you could say 'cause I only send things in the mail yeah could you could you could you give the address its\nWAMC three eight genes central avenue no one to two oh six Albany New York all the Hutu Wilson overreacting central avenue\nAlbany New York one to two also I guess we could probably do something for as well if we're going to go old school where I think it's a good idea ... can you send money through some of wars\nOf why not okay let's take money any way we can get this is the roundtable panel and we have a former New York state senator under current Sunni new false communications professor Terry Gibson here we have our shark talked judge Smith job and you are you a panel at WAMC dot ORG how are we doing so far\nDidn't know a ton about foreign policy in relations\nAnd cross channels it appeared that she was respected um and in a while like does a a un diplomat who who made\nSome progress but um you know we we hear the name Dina Powell being thrown around I think that's on the top five list and who knows\nWhat we do we have some mail or do you want the most up to you know ... you know you're the\nBoss of this program that's fine uh let's just reestablish the fund drive very quickly like a short break and then we'll get to the male okay the off you\nAre and the and the the ... the um fun drive means that we needed fourteen thousand dollars when you slightly less than that now it begins to pick up it gets faster and faster and faster um and uh we need it and we needed by ten thirty so that we could have reached the\nFour hundred and fifty thousand dollar market in the lock\nBox which would put us in a position to do\nWhat we need to do folks I Know you're there and I know you're part of this and I know how important\nDecision we get a two thousand dollar challenge ... you know we hit that four hundred and fifty thousand dollar mark so your money or that you would pledge now will actually uh go a little further the ... the phone number is eight hundred three two three nine to six to\nOr you can go to WAMC dot ORG and make your pledge right now you have their stuff to give away you can find out about that on line or ask your operator\nThere's any way right let's take a quick break this is the roundtable NWF ...\nSupport for WAMC comes from the Albany whiskey right festival Sunday October twenty eight at the Desmond in Albany featuring over Ninety whiskey types available for sampling ticket information at whiskey riot festival dot com\nHudson beach glass a gallery for contemporary functional and sculptural glass an artist and jewelry plus by appointment opportunities for hands on the glass blowing experiences Hudson beach glass dot com for details\nAbdullah an independent retirement community Albany New York offering one and two bedroom residences a maintenance free lifestyle and more in a private and secure kept the setting Abdullah retirement community dot com\nAre age ... forty two main street chat um New York a full service jeweler providing jewelry and watch repair rip represent a family heirlooms and appraisals by appointment van ... jewelry five one eight three nine two seven seven one eight\nAnd the Cary Institute for global good meetings and retreats surrounded by nature overnight combinations of gourmet dining and brewery in historic wrestler ville forty minutes from Albany meetings dot Cary Institute dot org [noise]\nBack to the roundtable an WAMC nine forty two It's Wednesday morning re graphene for Joe Donahue Terry Gibson on the panel today Joe ... a ... Smith and WAMC zone Allen shark talk you of course you can join the conversation with a brief\nEmail grief you know some people like the you know and and I complain somebody said yesterday this really got me this one got me this was ... but no one oh one I'm pleased don't read my or any of my things my missiles was way long unless you eat the whole thing\nHey hey don't send you know because we reserve the right we reserve the right if it's too long to just take the first couple of sentences\nDid you see the email we got yesterday\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWould moment later and said oh please be careful I dropped the F bomb in the first one [laughter] bedroom Allen regular first one I've done getting the second one doesn't really help so proofreading avoid the F bomb if you can uh the email address is panel WAMC dot ORG\nRight it's to re or Tim rights are below the panel I like the early ... same Florida famously banned the phrase climate change in state communication as much as North Carolina refused to adjust to flood back\nIn time for politicians to realize the climate change crisis won't go away if they simply um stick their head in the sand and that's Tim from Don Riggs Tim you make a great point\nBut of course wouldn't would are two different words\nI I've been thinking a lot about this you know and that this term climate change I think a deserves some us to revisit it because I'm worried that it's starting to become sort of a euphemism for\nThings that we should just be more blunt about we we ought to start talking about more than we're living in a world where we're running out of drink water running out of form of lamb or running out of ... breathe the air and when we use the word climate change more and more I think it's losing its punch which was doing its impact\nI think we need to find another way to talk I it's it's definitely a much more muted term than global warming you know well\nI mean the fact is that it's politics doesn't suit this particular precedent um and he will do anything or do you deal with his base a and you know today what was it today that he did was awful I'm over ... ethanol ethanol\nHe decided we don't do ethanol I think in ... in in in the in the summer because it adds to global warming so we went down to his rally where they're raising corn that becomes\nEthanol Cornel or whatever it becomes an at all and and and they said and they said and he said\nWe're going to do it twelve months a year so once again he says I don't give a damn about what the consequences of this are in the short term more important to get me elected in twenty twenty and to get a Republican Congress elected than to do what's right\nAnd that's the one reason that all of a bummer you you do you did what was right\nOkay so that was Tempe er and and then there comes a\nBob who writes almost every day uh I've never understood why there is no penalties for not following evacuation orders I think that if I die of activities would charge for their rescues and criminally charge of the rescuers were injured a lot more people will obey these orders from Bob\nAnd Julie says interesting to see ... that's congresswoman dividing up in the north country there are speak about how Congress needs to get involved in limo legislation because two of her constituents died\nCuomo ordered flags at half staff because of the ... the crash all well and good when was the phonics speak out on the cause economic and human of\nHurricane Florence and Michael we'll Cuomo or climate deniers Trump ordered flags down and have staff of the victims of climate change and the result of ignoring greenhouse gases and eat dispersion into the oceans when Willie Tate climate denial and silence seriously and that's a theme that we're hearing in our letters today\nAnd we got a lot of letters yesterday during your vox pop Oh yes I'm was on climate change and ah I Know it's a such a ... a ton of committed environmentalist writing in really something okay and Robert says hello panel of you were wondering about the mindset of people who refuse to leave an order\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nConsidering is it in some of these people do not have a vehicle or way to move back and wait and do not have that's absolutely true the funds to evacuate or do not have a place to evacuate too or just can't afford to abandon where they live because the only thing they have and that's from Robert that's right\nI agree I think we're talking about over the brakes little bit about especially ... and older have population or poor population um exactly a problem and it's something that needs to be discussed on the ground in terms of\nHow do we make these plans when we know we're going to be affected the way how we make sure that the ... the equitable\nWell that's the thing that especially in parenting I Know where it is a more working class the poor part of Florida unlike South Florida are you know even the Tampa Bay and that's certainly the problem is that they don't have the luxury afraid in saying that way and here's a letter from the department\nOf putting words in our mouths um it's from John who says ah think there is no climate change so you think that that's the thing and it says nothing I'm reading the exact way it's pronounced ... is written so you think there's nothing such thing as climate change\nPardon me if somebody say something and\nI'm a human maybe he's I'm making it look can we go on and see what he says I mean maybe make actually said oh\nTell that to the plants and insects that are all moving north uh\nSo I don't think he was indicting you specifically I think that was a generic to oil people yet is okay ray thanks very helping out with that we would offend or [noise]\nUm and sad and Sarah no that Sarah who brought us to letters says okay so Roger a oh\nA ... no no no no\nNo no no no no no less you want to read that because I really understand everyone says oh um\n[noise] ... [noise]\nI ...\nI have no idea but Rogers a faithful listener of this program\nAnd we don't quite understand what we would like to uh recognizes pledge\nIn the lock box the smart way would you know Roger a mix of beautiful a tube amplifiers down at war with New York Roger re Roger that and the fun drive by the way while we have a second the around maybe this is a good segue into reminding people okay we're doing this morning in the lock box or right now\nAre amber who has done such good job here it's a fun ride director has just bring up the latest in that uh we're up to four thirty seven to two two so uh is is so what does that\nAnd shed man backyard sheds and because he does deliver throughout the WAMC listening area in Brunswick and the new new Lebanon location inventory online at ... dot com\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W are you an HD Ninety points ... W am cage the nine point nine Kingston W. O. R. H. D. Ninety One seven Middletown double UCLA HD Ninety One nine Plattsburgh WC a an HD Ninety three three candidates Harry W. A. N. C. H. D. one oh three nine tie kind of rogue WAMC wage do you want o five\nOne great Barrington W W E S H da da na ... kids go W. A. N. D. H. D. Ninety point one Stanford W a and R eighty five Bruce during WAMC am fourteen hundred Albany\nSupport for WAMC come some dumb Stewart a pre K. through twelve independent school working to encourage critical thinking teachers students collaboration and views of the world from multiple perspectives for over a century don't Stewart dot org\n... foundation gr hunks of New York honoring founder Jim Cusick continuing has worked for over four decades and for generations helping the chemical dependent and their families battle addiction deliver a toss dot org\nAnd Saratoga hospital an affiliate of Albany mid Saratoga hospital with more than twenty locations across the greater Saratoga region people you trust care you deserve Saratoga hospital dot or\nIs WAMC news I mean I guess in the headlines the wife of a limousine driver involved in the New York state crash that killed twenty people\nSays her late husband how to express concerns about the company's vehicles Kim what's a Nikki told CBS in an interview broadcast today there were several times she hurt her husband say I'm not going to drive this like this you need to get me another car but then he trusted in what the limo said that the cars were All right\nLet's uh Nicky I was driving a limo that ran through a stop sign Saturday at the bottom of the intersection on a rural road and school Harry killing two pedestrians in all Eighteen people in the limo\nDriver was among the dead his name is Scott listened Nikki a state police and the national Transportation Safety board are investigating a vigil and set for tonight at six thirty in school Harry\nFEMA director Brock Long says his agency has nearly three thousand people in the field ready to it\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nRescue missions in Florida or elsewhere and staging areas with commodities needed doctors storms have been set up in Atlanta and in Alabama\nHe also said the federal emergency management agency is working hand in hand with Florida governor Rick Scott as for the many people who had ... orders to evacuate mom said people who stick around inexperienced storm surge unfortunately don't usually live to tell about it\nSome Newberg New York residents called for officials to adjust how the city has run it through the city council meeting in valley correspondent had grocery port city manager Michael care of you know approach to property tax increase and using a portion of the fund balance in his twenty Nineteen budget plan\nOr a veto told the city council he sees three options to the financial\nDilemma the first is that we can draw upon all the fun balance not have to raise taxes certainly not have to have a discussion about exceeding the tax cuts and we get older breath ... twenty Nineteen\nThat without a unfairly birds and a mayor Harvey yourself and your team or going into the coming fiscal year as well as beyond\nOr the other thing we can do is just propose a most exorbitant of taxes\nAnd not touched one balance it all\nKind of you know it was proposing a combination raising taxes a lesser amount and using a portion of the reserve fund for WAMC and the Hudson Valley I'm Hank grows\nMassachusetts Republican governor Charlie Baker and his Democratic challenger Jay Gonzales smart on everything from public transportation in taxes to abortion rights and criminal justice during their first debate on Tuesday Gonzales faulted Baker for not being ambitious enough when it comes to upgrading the Massachusetts Bay transportation authority\nBaker says his administration has done the nuts and bolts work needed to support the transit system\nMeantime Vermont Republican governor Phil Scott and his Democratic opponent Christine ... are set to debate tonight\nOn Wall street the Dow is down two hundred and sixteen points twenty six thousand one Ninety the NASDAQ off one thirty four seven thousand six oh for ... five hundred down thirty one points two thousand eight forty nine\nA partly sunny warm and humid day today with ties in the upper seventies to lower eighties tonight cloudy with a chance of showers but was in the mid to upper sixties and looking ahead to Thursday cloudy with rain possibly heavy and the chance of more thunderstorms with high in the lower seventies\nRight now cloudy sixty nine at rutland Vermont cloudy Seventy one ... cloudy Seventy two degrees in New Hartford New York which guild Connecticut cloudy and Seventy and there is more WAMC news at eleven do sex\nSupport for WAMC come some tear up in restaurants serving lunch and dinner seven days a week and a historic renovated church building in the heart of right back village ... restaurant dot com\nAshville stone Chagrin Falls Massachusetts corridors and fabric caters used for and during the landscapes and interiors including counter tops and for taking rare and wonderful they just don't know if the Berkshires Ashville stone ...\nHigh lawn farm a Jersey cows heard from the Berkshires providing milk cream\nIce cream butter and eggnog in Massachusetts New York Connecticut and New Hampshire since Nineteen twenty three I live on farms dot com\nThe spot five one eight oh weekly arts entertainment and cultural publication for the capital region available online induced ends and Venus the spot five ... dot com\nAnd Albany Mariette wolf wrote Albany New York newly renovated hotel with flexible meeting space and features such as ... entertainment system but we'll check in a bar Albany Mariette dot com\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nI'll go back to the roundtable on WAMC ten o five on Wednesday morning Greg Graffin for Joe Donahue the roundtable tunnel in full session now with Terry Gibson\nA job and their agenda Smith WAMC is Alan shark talked we only have about twenty five minutes left in our challenge here we'll get an extra two thousand dollars if we get the four hundred and fifty thousand dollar mark a in a lock box by ten thirty\nAnd you know it drives me crazy but we always do better in that last half an hour yeah is it now remember folks were all in it together we have we have two thousand dollars we will get in a challenge for one person in Troy\nUm now I just got handed the latest result we're down from fourteen thousand which we started needing to ten thousand eight hundred dollars\nSo that means if a hundred eight people now go or is that right a hundred and eight people go and put some money in in the box an average of a hundred dollars any part of it any multiple love it it'll be great now and\nI'm really getting to be an chewing on my finger nails are right now because this is incredibly important if we can make the five hundred thousand dollars a by Monday morning this is right now this moment\nIs the universal joined is the vortex is the uh the moment when we really have to do it so if you if you really are at WAMC and if you\nValue what we all do here together and if you value the humor of of rain or the\nSuitcases civic Joe and of the incredible panel that we and not not that you're stupid you're not you know whatever we can go on with your ... okay so so I I just want to make it clear\nThat um that um we are we're counting on you because of asking you to do it please one eight hundred three two three nine to six to we only have a few minutes to do this about twenty three minutes twenty three minutes to do it and we can we've done it before we've made ten thousand dollars and twenty three minutes but it means\nThat everybody has to say OK there five hundred thousand people who are listening I'll lead the way I Will be one of those people who put something in as an example for everybody else\nAnd once again the website is WAMC dot or gee if you want to make your pledged now and the stuff we have to give away if you uh [noise]\nWant to check that out as well but that's not the point of WAMC dot ORG is the website or our email address on this program and this is the roundtable panel and its panel at WAMC dot ORG if you want to share your thoughts and a panel at WAMC dot ORG we have a few thoughts to share okay\nHere we go a red says I'm a global warming is this is dismissed by doubters saying it's great for winter to be a bit warmer in the summer we have air conditioning climate disruption as a more accurate term that may receive the attention this\nIssue deserve um does anybody think that if we change it from you know climate change to climate disruption um that Donald Trump or smack himself on the side of the head and say oh good now be responsible I doubt it\nHe'll he'll figure a way to get a cough the term\nUh and ... and Stephen says or the term climate change given to us by the GOP operative Frank Luntz as it sounds less scary than a global warming a lunch also coined the term\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOr we've heard from Sharon who says good morning panel where's the effort to make the election day a federal holiday and how can we make voting requirement is anyone working on his issues are ... getting people to vote won't be suck up so much of our time and energy every election cycle\nDonald because the truth is what are you always makes up in his own mind for his own benefit eighty five one eight hundred three two three nights and I don't think\nYou have to be smart to get elected president I think George W. Bush proved that twice so I guess ah I have a hard time sort of buying into the smart as a argument\nOr okay and a and a friend from K. road says good morning panel can anybody explained to me the difference between President Clinton meeting on the runway\nWas Madeline albright it wasn't a metal and over I was a it\nWas a um who is the second who is the attorney general of the time [noise] ah\n... ... ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nLoretta Lynch and Rob Rosenstein riding on air force one with President Trump obviously Rosenstein is the head of the investigation on Trump what an outcry when Clinton did it why not now friend from green council is a big\nDifference in one is an employee or a lot of the other Bill Clinton was not an employer of Loretta Lynch in other words Rod Rosenstein theoretically could talk to President Trump about any number of things at any time of the day or not\nI seem to be late so so what you're saying is um that in either case it was an inappropriate or because\nI didn't say was wasn't inappropriate and well what ... well and do you think it's not it will very inappropriate in that case and what about this case you think for one on our days are both working for the government yes but one is under investigation it'd be relevant in that Rod Rosenstein would not tell him about the investigation one ... one is under investigation\nOkay one eight hundred three two three thrown out even matters hey look we're really making progress Seventy seven people to go now Seventy seven people to go one eight hundred three two three nine to ... let me sum it up right you're wrong one eight hundred [laughter] to say\nOkay the hammer falls yeah yeah it's all yours baby you got nine minutes go ahead daddy o\nAll I'm saying is you get to ... thousand dollars we need Seventy seven people and I need you to be one of them wherever you are dropping wondering if that's showing a baby one eight hundred three calls no but I Would caution or or cost about yet yet one eight hundred three two three nine to six do I need you to call your mother or your brother\nLook there's two thousand dollars which we really need we really here's the problem if we don't make twenty five thousand dollars a day between now and a Monday morning we're done dead cow poop finished puente the finale\nAnd the honor Dr starts Monday at six AM so it does you know what was that did you say that what it means they lose the grand was because of a nice little low brow that's worth a fundraising us off it's a I I Love listening to really a\nLot of people love it yeah I Know it's True Blood related a lot of people if you will love it love it and the people who don't they can put into the lock box now but don't be calling me up later and I said are you OK you had an opportunity to put it into a lot but you did you do it\n... I'm a I'm a you know that kind of thing ah okay\nWell then don't talk WWE there'll be calling me up and some people will write in and we haven't seen too many in the last couple of days we'll say you know what I live for the panel I live for the discussions stop interrupting it with the fundraising right when I got to tell you that people have short memories fund drives not too long ago\nSeven eight ten days now who two and a half three days or one or one some ... sometimes it's been one the point is if this pains you to hear us raising money now live with the pain the fund drive will be brief and we'll be back to regular\nProgramming embrace the pain race the pain and brings\nYour well a little bit lighter ... embraced the painting and breeze Seventy seven people it seems so simple I Need you to I Need you to get there because if we don't make this today we're in trouble I mean we're really in trouble we need to get to that a five hundred thousand dollar mark\nYou know when I think about the ... the way in which we're doing it now it's people really loved the lock box idea because we can talk about hurricanes climate change do all that\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot EDU\nIn now now there's some people who say no now one of the things I'm worried about really worried about is I I'm Talking to a lot of people\nWho are so disgusted with what happened in the Kavanaugh hearings and others that they won't turn the TV and they won't turn the radio on this I don't want to hear it I Want to avoid the news is all bad um and when\nThat happens [noise] yesterday we had a brilliant Palestine who said the name of the game in elections is to get to people on on the part Trump not to vote\n'em and if people aren't turning the television on and they're not listening to this goes to place WAMC\nThen it may well be that in this one drug we're going to have some real trouble but on the other hand so far so far we've been doing okay\nWe've been carried by all the wonderful people who want to\nI Need Seventy seven people now who will say in the next six minutes and we can handle anything you can Florida's either WAMC dot org or going or or dialing one eight hundred three two three Ninety six do and will make it but only with you and then we'll get two thousand dollars extra which is great\nSomebody in Troy actually puts two thousand dollars said if you can do this I Want to help I Want to add that incentive and so that's what it is okay five minutes ago yep\nEight hundred three two three nine to six to ... what's happening at the books are read all\nOf us as well we're getting ready for the elections so we've got a lot of popular a heated a ballot questions and a lot with to do with nurse staffing levels from one yet\nRobert ... I'll tell you right now I've written my column on it for this weekend\nUm and prop one what is what it does is as we the government will mandate and tell you how many nurses should be on duty at every moment now I'm all for nurses believing that sits on this program a thousand million times\nAnd I have said you know look every time it's the nurses versus a hospital system I'm always for pain the nurses more and what they deserve because anybody's ever been in a hospital knows how important that is\nWhat what is the government were to say to me Allen I'm you know let's\nLet's decide that in order for you to have a proper workforce at WAMC you have to have this many people on duty at any time\nNow or you know I have a feeling 'cause I've been in favor of you a couple of times in great banking and I got to tell you I got really well taken care of 'em and so I I'm I'm I'm a little concerned about this problem and where it's going\nTo go to ... eagle that come over there that we can read Alan's calling\nYou could you could you could do that\nOr you could go to a million other places [laughter] okay [laughter]\nWe only have ... we have two and a half minutes ... oh you were a challenge to lock box challenge us morning I'm not sure exactly where we are closing in on it you have pledged WN fewer like do you have it right in front of well I haven't seen the new number oh you see on the computer yeah yeah I mean what happened to you you should read oh here comes comes ...\n... okay that we are okay that's great\nAnd average said okay we're down to the five thousand five thousand six hundred and fifty three dollars to go we have four minutes to do it and we can do I am told by our producer now that if we get close we can take it to ten thirty four if we have to but then we have to be done\nAt ten thirty four yup okay so that would give us a seven minutes now okay a producer said so she said so well and she's the producer she's the one in Charlotte ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nTo be able to allocate\n[laughter] now I can stop yes she\nGets to allocate now we do know that politics has the authoritative allocation of scarce resources we know that and here she is\nAllocating to strengthen your and give you an extra four minutes because she likes um well I don't know about the like but but you did give me the format yes [laughter] on wrecked certainly no one eight hundred three two three nine to six to this is terrific come on folks let's get it done we need fifty sixty five thousand six hundred fifty\nThree dollars let me ask you a question give us a thousand dollars why what you're asking me to give a thousand dollars you know what that is folks for this radio station at three bucks a day\nThat's three bucks a day you could do it on time so much down so much we you know you could do it that way um we have a name for that what do you collect just standing member of sustaining number\nOne eight hundred three two three nine to six to but I Need you know hey this is Alan I'm ancient history you say I'll be there when you need me\nYou do I know it one eight hundred three ... three nine to six do you like this program is this program important do you do you find yourself tuning in almost every day now don't do it while you're driving pull over yeah one eight hundred three two three nine to six to\nI mean all my friends at the ... I Know that they're going to be right up there are doing their thing a red but at this moment\nOr read up to the highest office one eight hundred three two three nine to sixty ... Rehman\nWere WAMC dot org and by the way there were two thirds of three quarters gone now but there is a roundtable had eleven that was one of every seven more\nAround different title on Wednesday November seventh of one hundred dollar ticket there'll be discussing the mid term elections which of the day before ... thanks very Roger or Sarah Rogers and John Smith David stores will all be there and you can find out about that when you make your point\nYou know right really all you have to do all you have to do is just like ... somebody we that's it so it so it it's hard to go you know for what what's the spin on it what what's the Joe I'm\n... what people want to people want to laugh they they need to talk about it they need to to\nHave someone\nA coach fine for them like hey we're not the only crazy one right I mean so people want to say they want that laugh um I mean it's good for me because my own as they know what they're going to get when they come see me right but\nBut it's the ... the problem is is like when you're when you're doing shows\nAnd it's just a bunch of comics you don't know what the audience you know who who who who are they there for you know so you have to kind of like I was most show is you've got to figure it out like figure out okay this is what are they going to find funny what what did they want to talk about um\nBut yeah like me but but right now honestly I Would rather have a boring for as a dead\n[laughter] oh yeah [laughter] I agree yeah I agree now or I saw\nYour she'll probably two years ago I was traveling in Atlanta and I saw you there and uh\nAnd you were mostly talking this is the baggage free elections and you were mostly talking about your family and and I so fry would would that be if it without all the drums up that would you like to focus on is what's going on with your family\nI'm not necessarily what I like to focus on it like ... where where do I spend most of my time what what's the what what is it that I I you know that I I Know what's what's my world right now\nAnd the the kids you know my wife they take up a large amount of my time\nSo not talking about them to me it's it's like I Would have to go out of my way to do that you know it it would feel like I said you know I Need to write some jokes about you know I don't know baseball it would be\nIt would feel like that instead of going let me just talk about what\nTaken up most of my you know my life um so yeah so my family they are they are they part of it\nNow in writing and it's also an interesting now describe it a little bit about the your family make up your in your in interracial marriage you have how many children\n... we have twins boy and a girl when a girl and I ... and we're also international 'cause [laughter] my wife this friend [noise] yeah [noise] yeah and uh\nGo ahead and then when it just seems that never fails to be fun right [laughter]\nThere's a lot there\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nIt's just that the accent it's hilarious today I mean the the things that my wife will say you know I got the other day\nHe asked me if if uh to see if we get back to stop it at the TV it to the bank\nAnd I'm like I'm sure that's not what the name of the bank is at this [laughter] [laughter] and I have\nTo spell it SEAL Team they say oh gee thanks okay\nAll right I just asked me to stop at the TV [laughter]\nSo you know you you are the west or while you're working on this show that the the west um big project I guess was ruined them for you when working on that you know it's been some months now since a bad brouhaha how\nHow do you look back on it now of of what happened\nThere you were writing for the show you were one of the one of the writers and ... and\n... would how do you look back on it\nUh it was I was unfortunate will happen you know but I'm I'm so happy that they found a way to bring the show that and\nYou know they kept the castle yet except for land but because everyone was ready to get back to work you know um\nThat that day it happened that was the first day or for the writer art and and actually I was merely um Bruce ... the show runner\nTo let them know that I was I was it wasn't going to make it the first uh\nThe first week that was the last show for Comedy Central and uh\nAnd then when I saw you know what what happened was you know we're out there have like oh well I guess I'm not going to be making\nIt at all um so you know [laughter] that had that conversation with them and all and uh you know it it it was the way I mean it ... it was old there was no other choice you know um\nWe don't like to have a friend or somebody that you like somebody who shares your profession and you you know how they are to work with and then you see that and you say All right well what happened there\nBut I Know I Know what what happens um\nBut like I said there's there's no you can't walk that back right now and I and you can't go hey you know better than not really like that or you just can't justify it back to you know what I say that I've had enough of this this is ...\n... does it make you are aware real hyper aware even maybe of of what you write on Twitter of what you say I mean not that you're ever going to say anything like that but but but how about how people take it\nOh yeah absolutely absolutely um like I I I'll always tease it with my wife I'm like no I'm just you know two points away from all the and I\nMean [laughter]\nYou soon that in some boy does all governments that will do sort of the performers mentality anyway right at any time they are going to come in his hand all the way\nThat show you that door any minute\n[laughter] what are you proud of that you're doing now and in the sense of who is you're you're working with comedians origin we women comedians uh you're you're obviously you're you're bringing in large\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThat there has to be great satisfaction and what you're accomplishing as well\nOh it's so cool to be able to bring in you know talent and especially um\nPeople that you know that that they they are looking for\nYou know like we are in it and like I said it is on a merit based these the people who are really funny but they just in or low so\nUm it's great to have a company and a copy that you know we have a solid reputation and it's and it's rolling I'm you know that we're putting out at work so\nI I work with younger people and it's an older too I Love just given that much\nAnd when you're doing those projects I mean all of that is fun but ... is I've heard it described by other comedians but when you're out on the stage and it's just you and you're performing for an audience that you can be that\nOh you can't ... I mean\nThat feeling of this here and people laugh and laugh because it's something that you ... I mean how powerful but it doesn't make you feel good because you're like you know maybe they had a a crappy or\nAbout or maybe there are you making them feel good even if it's for our given [noise] and uh and I love doing that makes me feel good Wanda\nSykes will be the oldster performing arts center in Kingston on friday the twenty sixth of October at seven thirty PM\nAnd you can find out more by going to you pack dot org you pack dot O. R. G. Wanda Sykes a pleasure to speak with you thank you very much and have a great time and getting them\nThank you so much happening\nAgain Wanda Sykes is comedy tour isn't titled oh well would you bring to the poster performing arts center in Kingston friday October twenty six and seven thirty ... dot org for more information you're listening to the roundtable on WAMC\nSupport for WAMC some some California Closets roots evidently some working with local business to custom design and build offices workspaces storage cabinets employee lounge is more California Closets dot com\nCapital district renal physicians seeing patients for kidney care throughout the capital district offering seamless pd seat the Reno dot com for information\nNew York pain management offering pain management for chronic pain and spine care in a private office setting with doctors Charles Gordon and Clinton fun be set free and why pain free dot com\nAnd Albany cardio thrashing surgeons welcoming Dr ... Polanski providing patient centered heart surgery for over forty years in the capital region practicing cardiac surgery at St Peter's hospital a C. T. S. U. R. G. dot com [noise]\n\n... ... ... ...\nMm ma ...\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany W. R. U. N. H. D. Ninety point three runs in Utica WAMC cage the Ninety point nine Kingston W O s storage de Ninety One point seven Middletown WC EL HD Ninety One point nine Plattsburgh WC a any the Ninety three point three Kennedy Harry WAMC HD when a three\nPoint nine to ... WAMC ... five\nPoint one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC HD Ninety point when Stanford W ANR eighty eight point by Brewster and WAMC am fourteen hundred Albany\n[noise]\nTo our three of the day's edition of the roundtable I'm regret for the national tour of Anastasia is that ... this week we'll speak with actor ... about her work in the musical then dawn ... will tell us how a mysterious European film and save thousands of American Babies\nWhen Kate Klein will share her first hand account of the devastating effect ... Christianity purity culture has had on a generation of young women\nAre new book or a combination of journalism cultural commentary a memoir\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThree after world news from the BBC at WAMC originally [noise]\nHello I'm ... with the b._b._c. news\nThe authorities in China have legalized the use of re education camps in the western region if she's young saying they want to transform people who've been influenced by religious extremism that's been growing concern about the disappearance of weak and most ... inch in Jiang Michael Brits so reports\nAre you in human rights committee recently heard that China could have looked up a million people in ... perhaps more\nOf the time the Chinese spokeswoman says the allegations when the crew\nWill do officials it'd be more nuanced and making the authorities were tackling extremism and change and now when you log introduced by the regional government that makes you play the local authorities have the right to establish re education camps\nThe legislation says the aim is to provide vocational training but also to correct behavior and to carry out ideological transformation\nChina has launched a wider campaign against Islamic practice it across in John it wants to stop the use of hello products that are not food when newspapers at the use of the time how to describe items such as toothpaste led the line between religious and secular life\nTurkish media have shown video images that they say may shed light on what happened to the ... Saudi general it's Jamal ... G Saudi Arabia denies admit to catch oh gee whiz mud you haven't been seen since the end of the Saudi confidence in Istanbul more than a week ago\nThe footage shows were said to be a Fifteen minute team of Saudi officials McLaughlin is in Istanbul\nCc TV shows their arrival in Istanbul by private jets hours before Mr ... disappearance the scene checking into two hotels maybe the Saudi comes to allege that booking was several days but they left early\nBlacked out vehicles are shown around the ... moving to the consul general's residence around Ninety minutes off to Mr ... vanished did they contain his body the two planes flew back to Riyadh that night one by ... by the author vi Cairo\nA coach in Britain has identified height spending why for the jailed international bank ...\nAs the first time I get to the new anti corruption law to give a hoot husband was convicted of defaulting millions from Azerbaijan largest bank is being told to explain the sorts of how well she denied any wrongdoing don't many Shawnee is following the story\nI think everybody's Jules metaphor to drop in costs when ... became clear I mean ... it's about four thousand pounds with day over ten years spent inherits\n... both her own gulfstream jets for forty two million dollars when stunts you have to private car parking base within the Howard\nCarl Caulk as well but the national crime agencies were ... in terms of the bigger picture because it was very much a test case around the law about what's a cost troops to talk to a person they can talk it not just ... minutes there's now become clear but also the family's all officials in both in states ends prices\nWell news from the BBC\nAnd Egyptian ministry coordinate sentence for medicine to death in connection with the killing of twenty police officers the court headed the accused with members of a branch of the Islamic state group involved in a series of attacks last year hundreds of Egyptian policemen soldiers and civilians being killed in jihadi attacks\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nBull cabs as part of the major investigation into alleged fraud and money laundering and into plants that possible match fixing the rage across Belgium added takes all the European countries he's an ex con steak\nStatements from the federal prosecutors said the arrest follow an investigation which began late last year into suspicious financial operations within Belgian football in addition it said there was evidence match fixing my should have taken place affecting games last season\nKnown names were given but local media have reported it involves some of the country's best known clubs including and elect bruise on stand in the age [noise]\nLeading sports agents club officials and referees are among those who've been picked up for questioning the arrest come three months after a huge successful World Cup the Belgium who makes the semi finals in Russia\nFrom states has compared abortion to hiring a hit man speaking in the Vatican he said it was done to solve the problem\nYou then on the the audience if it was right to hire a hit man to solve a problem when they responded no he said that expanding an innocent human being from the ... at the same reason was also I'm John\nIndian Bob Wei several fast food chains including ... down an economic crisis deep and because of lack of foreign currency\nSeems twenty sixteen Zimbabwe his youth bones nights which is supposed to be pegged to the U. S. donor that supplies it'd be insisting on being paid in foreign currency prices have risen added central groceries and ... have been running out\nBBC well sent its knees\nSupport for WAMC come some sunflower natural foods market Woodstock and right back with false self and family care supplements and immune support remedies for seasonal allergies replenishing moisturizers for fall skin care sunflower natural dot com\nTroy waterfront farmers' market outdoor market every Saturday nine AM to two pm on river street over eighty local farms and food vendors weekly Troy market dot org for information\nClarkson University capital region campus union graduate college is now Clarkson University offering graduate programs in business healthcare management data analytics engineering education bio ethics defy convention Clarkson dot edu slash graduate\nThe Darrow School working to inspire college bound students and helping them realize their potential through collaboration and innovation if Darrow where music Darrow would be jazz dare to Darrow School dot org\nAnd called the attorney service document filing documents and information retrieval and other services including legal publishing and corporate record searches Colby surface dot com\nThis is WAMC News I'm Jim ...\nThe wife of a limousine driver involved in this go Harry New York crash that killed twenty people says her late husband had previously expressed concerns about the company's vehicles Kimball is Nikki told CBS that her husband Scott\nHad stated several times that he needed a different vehicle but then trusted the company's assurances that its cars were All right\nMeanwhile a state transportation officials says the owner of the limousine was warned not to operate the vehicle\nAfter it failed and inspection the attorney for proceeds limousine says the safety violations cited September fourth had been corrected and the vehicle cleared for service department of transportation spokesman Joseph Morrisey says that's categorically falls\nNew York state police and the national Transportation Safety board are investigating Saturdays crash a building\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWas debated at a public hearing Tuesday in Kingston New York Hudson Valley correspondent hey gross reports\nPropose local laws seeks to impose a twelve year term limit on the office of county executive in county controller the law also reduces the germs from four to three years\nOnce regained against the idea was league of women voters local and state board member dared Thompson\nLee position on term limits to send a very very long held one and we're against them and for the reasons that the last speaker said at the very end that we have our own set of getting rid of people and we go out and vote them out\nOthers to a game at the financial connection between the term limited movement and reclaim New York a lobbying group connected with the wealthy conservative leaning Mercer family\nJane Schoenberg anew balls Democrat said no self respecting Democrats should align him or herself with any reclaim issue for WAMC and the Hudson Valley I'm Hank grows\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise] um\nSo I Would say that there's a dream come true for me but also cited super familiar with that movie but I wasn't familiar with them\nThe Nineteen fifties I think it's fifty six films and then when I came along before I wasn't familiar with that one and I knew about Romanoff history but I wasn't like super well informed so when we when I got the job and when we started rehearsals we really dug into the actual\nFacts of the matter and like the the real history of it\nWas very different from them and it it's so different from the animated film in our show has a lot of the history in it so it's kind of amazing because I feel like the show grow up with me I went like you know there are these like cookie characters in the movie\nAnd there's this fantastical element to it that it's still there but\nIn a more rooted in real way and yet they literally feels like the show transition for me as a child into an adult\n[noise] so what was it like for you liking the movie so much and the characters so much to learn there would be as an actor to learn at some point in the last few years that there would be a stage show and the did you specifically pursued trying to play on your own Anastasia yet so\nFinding out that there was a stage show was super exciting for me just because I was like oh my God I Can't wait to see that and I love that show and I actually have known the am composer and ... says for a very very long time so for me it looks like it's just exciting to see it all come to life and I always knew at some point it was going to happen um\nBut then I never like pursued it I I truthfully never thought that this would happen to me if I'm being completely honest I always like I Would love to do it but it's not it's never gonna happen to me you know what I mean so so it was a surprise and\nI pinch myself every day I Can't believe it\nThe director is Tony Award winner dark ... told me about working with him\nHe's a dream come true to work with you couldn't ask for a more encouraging loving supportive director he's just the best he really is and I'm blessed to be in his company everyday Anya\nIn Anastasia quickly build a relationship\nWith Dmitri ... [laughter] they she doesn't it's not like they're lifelong friends they meet at the start of the action of the show and then they you know have this huge adventure together which is kind of what you're doing with your cats maids meeting at the beginning of her ... and going on that's wild ride what it is up and like tell me about working with your gastric asked me and my God it's\nI keep saying this but like I have never gel so well with a group of people in my life\nI feel like we just all immediately were like on board their loved one another and it's it's helped through and\nI'm just so blessed and honored to be with them every night I'm you know Steven an ad are Dimitri and I've lied it is so funny how similar like we all they all meet in the beginning of the show and build this click bond and\nI feel like the same that's happened for us partially probably because the characters are written so well that it's easy to fall into those relationships\nBut they're my rocks and without them I Would be so lost so I the whole company it's just it's it's amazing how well we all clicked and love each other\nThe show is a huge hit on Broadway of course it's been running for a few a couple of years and ah and I showed up and go out on the road if if people don't haven't responded to it what do you think it is about the musical that audiences enjoy\nI think what's great about this musical is that there\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nYou relate to Demitri flawed glad the Dow is you're there's someone for everyone and that is so special that's not always the case and I love that you know no matter who you are like you can be a ten year old girl who loves princesses or you can be\nA fifty year old man who sees himself in la I'd like that that's that's wonderful to me\nUm and also just the set the costumes the music the dancing it's all or just to look at your not your eyes are not going to be born in the show [laughter]\nSo um yeah there's it's just everything came together so beautifully and I think that's\nThat's what makes it work\nDo you have and I know you've only had the one previous so far but do you have a favorite scene or moment to perform [noise]\nMy favorite and song and the show is in a crowd of thousands I Love getting to play with other people I Love when I get to ... and that's ... Stevens do at and\nNot only is it a question sign to sing and he is so spectacular to act with but it's a ... probably one of the big it's turning points of the show and she has two very strong very different realizations [noise]\nUm and every night it just feels it feels right to do it every night so\nThe the big song the iconic song from the show is journey to the past popularized by the ... in the film um are you a loan on stage when you think that's all I Am what is that it's\nSurreal and I mean obviously because I loved the movie I've I've always loved that song and I've always been singing it like as a from a kid on word and\nEvery night that I Do it I kinda just fall into it and it never feel like I'm forcing anything or that I Am trying to make choices that I've made before it just feels like this is what's happening and\nIt just feels exciting and good bumpy and everything that it should feel like in a it's a special song and it's a national moment for me in the show\nAnd it's Asia is playing uh proctors in Schenectady New York through Sunday to learn more visit ... dot org that link will be posted along with his interview at WAMC dot org slash roundtable ... plays on yeah thank you very much for being here break like have a great tour thank you for having me you're listening to the roundtable on WAMC\nSupport for WAMC some some first like providing high speed data Internet called location and voice services to businesses over its own fiber optic network and supported by locally base personnel first lady thought that\nThey have track fall foliage trips aboard anthrax empire service New York city through the Hudson Valley opening it points west to Syracuse buffalo and I were falls if truck dot com\nAnd Mother Earth Strauss serving lots of valley with a variety of seasonal items and organic and natural foods bakery cafe using natural ingredients without additives mothers store house dot com\nAnd\nYou're listening to one of the most famous and best selling march of all time [noise]\nYou're almost sounds [noise] when British Army band master each an F G ... station for George in Scotland the GOP's do a fair amount of adult [noise] story goes that it came across a certain nicknamed colonel who rather than deal\nFor two and others have as we were shocked with with a descending minors\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nLobbed too soft green and the colonel bogey march was born with that whistle [noise] serving as the opening line to the melody the march would be published in Nineteen fourteen and had already ... million by the time it was the same as we included in bridge on the river Kwai in Nineteen fifty seven\nWhich didn't hurt sales won best [noise]\n\nListen to more episodes right now at ... dot org [noise]\nSound is produced at the bell for audio archive Syracuse University library Bradbury\n\nSupport for WAMC come some time by a mess which to warm and homes and businesses throughout the northeast today's itself stoking automated would he would boilers dot com\nThe spot five one eight a weekly arts entertainment and cultural publication for the capital region available online and new stands and Venus the spot five ... dot com\nAnd Saratoga bridges presenting the Eighteenth and you look great pumpkin challenge five K. ten K. and kids fun run\nT shirts food raffles had more October Thirteen and the ... state park Saratoga bridges dot org this whole school Pittsfield, Massachusetts a boarding school offering girls in grades that through twelve the real world experiences of its horizons internship and service learning program missiles dot org capital car share\nA car sharing network offering a fleet of eco friendly vehicles for neighborhood transportation\nTwenty four hour reservations available online capital car share dot org for donations and information\nThe healing meals one Thirteen every road colony chef designed and freshly prepared healthy meals announcing new storefront with grab and go meals soups and deserts the healing meals dot com\nAnd the all on a partnership presenting great matters connecting dementia and Alzheimer's too old Lana in collaboration with Albany medical center more information at ... dot org ...\nThis morning we hear the extraordinary tale of how a mysterious immigrant Dr became the revolutionary innovator of saving premature babies by placing them ... world's fair aside shows and on Coney Island and Atlantic City\nWhen you think about the um when you think about that\nFrom interest me some of these days are alive and well what do they think of of the story when you put it into a context\nYou know they have absolutely no ambiguity at all about eight or ... about it\nUh as far as they're concerned he saved their lives so if they were in a sideshow most I think that's kinda cool [laughter] [noise] um you know at the time some of the parents were embarrassed and I mean if you can imagine that\nTerror and the um Greece these parents must have felt giving birth to a two pound baby back then when it was just nothing a and having a doctor say your only chance to take your baby to Coney Island and aside show where people will pay admission to look\nUm that was a harrowing decision to have to make and some of them didn't one woman told me that she and her brother were born premature twins in a hospital her mother's roommate had premature twins that Dr came in and said\nYou want these babies to live you have to go to Coney Island the other woman said my babies are not going to a side show and they died and you know this woman parents said do anything you can\nWrite the book the story of course is amazing and I'm curious as to\nHow did he how did you think I mean you you you talk about the showman aspect\nTo the [noise] what did you think of his own press what do you think of his of his own abilities and about himself all of what he was able to do out sofa where was he do very\nWell he created his own press he created his biography with his stellar credentials and I think he was there he was brilliant\nFluent in many languages even knew how to work the press and he was always whining and dining doctors he really wanted to convince them to do this\nAnd ultimately he\nUltimately he did the sad part of this story for him is that he died broke and he was practically forgotten at the time that he died so I'd like to make people know who he was\nWell it's a fascinating story the streams case of Dr Cooney how a mysterious European showman\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nRoute but you you say on the book between Eighteen Ninety eight and Nineteen forty three he saved some seven thousand American Babies in the ... yeah that's correct I mean that's an amazing number\nYes and if you think about how many children those babies hat and light forward to their grandchildren and a lot of people walking around\nCertain way of again the name of the book the strange case of Dr Cooney the book is published by blue writer presto unraveled thank you very much for being with us very pleasure to have you on the program\nThank you thank you very much again that's strange case of Dr Cooney by dawn raffle focused published by blue rider pressure listening to the roundtable on WAMC\nHigh everybody this is Alan charge talk yeah I got to tell you my heart is in your hands because up until now you've always always always been there and I know you will again in the end\nWe're a community and it's a community radio station unlike anything than anybody else\nKnows about people coming here and they turn on the radio and they're hooked and they say to me I never heard public radio like this before that because you're in it and to be in it we need help now we need to make it work and that's the lock box that magic box that gets us over to the top\nDo it all you have to do is good at WAMC dot ORG and put something anything in [noise]\nUm\n[noise]\nIn the Nineteen nineties a purity industry emerged out of the white evangelical Christian and culture purity rings purity pledges and purity balls came with a dangerous message girls are potential sexual stumbling blocks for boys and men and any expression of a girl sexuality could reflect the corruption of her character\nThis message traumatized many girls resulting in exile to fear and experiences that mimic the symptoms of PBS the\nTrap them in a cycle of shame\nThis is the sex education that when decay Klein grew up with she writes about it in her new book pure inside the evangelical movement the dream to generation of young women and now I broke free it as an account of the problematic effects evangelical Christian churches purity culture\nHas had on young women and it is a pleasure to welcome\nOne decay climb to the roundtable this morning thank you very much for being with us thank you for having me at what point did you decide that you wanted to write the story to to tell your story and what happened to you\nKnow\nIn my early twenties for a long time I felt like there was something really wrong with me because I had left even chocolate them and I had rejected the sexual shame that I had been raised with\nIn my religious community and thought that I Would be free at that point from shame you know I had stepped away from the community that was shaming me um I had wrestled with it I was in a better place I sure\nUh but then I started to realize how deep the shame live inside of me I no longer needed external ... I was more than capable ashamed myself now and\nYou know I still incredibly alone I felt broken I felt fearful that I Would never be healthy and never have a healthy relationship and it wasn't until I started to call up the grill friends that I haven't raised with an identical Christian Church and telling them what I was experiencing that I\nYou know started to realize I wasn't alone because my job just dropped as I sat and listen to them share stories\nDreaming support for WAMC come from Albany mid now will in the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nFear and shame and anxiety that were sometimes manifesting in ways that were physical that we're a really mimicking the symptoms of classic pie TST\nAnd that realization that I wasn't alone was so important that it kicked off a twelve year journey which I've been interviewing people around the country and not really as the inspiration for the book so that other people know that they aren't alone without necessarily having to go on a twelve year journey to get their\nGrowing up in America ... Christian Church so so what about the upbringing in the church and how old were you when it started when you started to get these these particular to dreams when you're talking about I'm\nSure you know there was so much that I loved about growing up in the church to be completely honest with you this wasn't the only message that I received there but this is certainly one of the messages that I received this this teaching that there were two types of girls and women those who are pure and those who were in pure\nAnd girls could be considered in pure based on their own sexual thoughts and feelings and behaviors but also based on sexual thoughts and feelings and behaviors of men in the community toward them which girls and women are said to have inspired because of how they dress or how they walk or how they talk\nAnd it just creates a tremendous amount of anxiety you know I experienced you know a constant state of fear because you never were quite sure what it was you were going to do that was going to be considered you know wrong enough that someone would pull you aside and accused you of being in pure which is no small thing in that community\nSo when it comes to the actual ... and especially when it comes to sexual ethics Bush ingrained in Utah very young\nYes exactly um I actually joined evangelical church and I was Thirteen so I joined at the age when people were ah were\nReally getting the heaviest ... however this is something that you know as part of the culture and a and that I think is a message that people get from the very earliest ages but you really start to see the work of the purity movement and that the purity industry or as people enter junior high so when I came into the church at the age of Thirteen with the\nAbsolute fervor of a convert you know somebody who was just\nCompletely sold out for Jesus if you will of that to use terminology from the culture you know this was this was a this was a big part of the messaging that I received\nHow did you see and then how do you see now as an industry\nSo in the early Nineteen nineties that's when you really started to see the rise of the industry so that's when we started to see a lot of purity rings and purity pledges and purity bottles and purity curricula purity videos and perhaps you know most notably purity themed Bible\nSo imagine you have a Bible and you know sixty pages of it is not typical material that's completely dedicated to the importance of your remaining quote sexually pure a you know with advice like avoid the horizontal that's about a sixth of your Bible\nSo it's very difficult as you can imagine to grow up in that culture and not think that your sexuality and your salvation are inextricably all\nOver you and ... so in many ways are you writing the due to pregnancy tests even though you would not have books\n[noise] yeah it's such a perfect illustration of the amount of anxiety that I was experiencing um you know I I wasn't having sex but I was being sexual and you know I had been trained\nDreamy support for WAMC come from Albany mode now will in the ... and we children's emergency center a police for ill and injured children more information at AMC dot edu\nThat you know women who are sexual outside of marriage are going to have horrible things happen to them and I sort of waited in this anticipation of the sky you know falling and the way in which seem most likely that the sky might fall or or at least most horrible that the sky might fall", "show_name": "The Roundtable", "year": "2018", "city": "Albany", "day": "10"}