{"month": "10", "state": "NY", "station": "WAMC", "content": "\nAnd me trombone [noise]\nMay I said the ... [noise]\n\n[noise]\n\n\n\n[noise]\nWe were told me\nIt was the bulls rock sitting right beside him\n\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany double your UNH the Ninety point three ramps and Utica WAMC ... point nine Kingston W O a storage de Ninety One seven Middletown WGLA Judy Ninety One nine Plattsburgh WC again HG Ninety three three ... W. A. N. C. H. D. one of those ... WAMC wage the one of\nThe five one grade Barrington WWE S. H. D. eighty eight nine mount Kisco W. A. N. D. H. D. one Stanford W a an art idiot by\nBrewster WAMC um fourteen hundred Albany [noise]\nFinancial fallout today after the disappearance and possible murder of a Saudi journalist who was last seen at the consulate in Turkey\nMarketplace morning report is supported by for X. dot com committed to empowering and helping traders sees opportunities and currency markets since Nineteen Ninety nine for X. dot com it's your World Trade it for X trading involves significant risks Los\n... progressive insurance protecting commercial vehicles and offering specialized coverage is designed to protect your business more progressive commercial dot com\nI'm David Brancaccio in New York yesterday the key index on the Saudis stock market fell as much as seven percent to ... talk of economic sanctions if the journalists disappearance in Turkey is shown to be a political murder ordered by Saudi officials\nToday however stocks in Riyadh or up to point to present some of that may be comments by President Trump on CBS sixty minutes last night in which he talked of punishing Saudi Arabia but also emphasized Saudi denials and said stopping arms sales would hurt the U.S my marketplace colleague the BBC's ... is in London\nHi David so stock market but also we should keep an eye on oil prices because of this controversy\nAbsolutely remember that the kingdom is the world's largest oil exporter and they've already talked about if there were any sort of sanctions or any sort of a punishment for Saudi Arabia that they ...\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nIt came from the general manager of the official Saudi news channel Al Arabiya and in it he says that we are just looking at all kinds of measures that would put pressure on the U.S if the U.S was to think about sanctions these could include an oil production cut and that could drive prices up from\nAround eighty dollars a barrel to more than four hundred dollars a barrel now there's no indication that any of this is going to happen but you can imagine that kind of talk is giving the market jitters and it's worrying a lot of people about you know where this might go if it becomes more of a confrontation\nRight and that four hundred dollars a barrel is the in the editorial it's not necessarily what independent analysts are talking about\n[noise] yeah that's right but it points to the kind of rhetoric that Saudi Arabia is already and playing saying look you know first of all we had nothing to do with this but equally if you target us we have the clout to target you\nRemember though that Saudi Arabia messing with its own oil production is also a bit of an uncle the kingdom does rely a huge amount\nOn that oil wealth it's trying to also attract foreign money to diversify its economy so it also has a lot to lose both by cutting production and by upsetting\nA lot of international investor too it's been trying to lure in the last few months as part of it's a new reformed more open economy\nThe BBC's ... also my marketplace colleague she's in London thank you so much thank you\nOil in New York is up three quarters of represent stocks as a futures are down to five to ... percent London is flat Russell covering the bankruptcy filing for Sears which happens morning is also Kmart\nIs reorganization a deal was reached to keep some stores perhaps five hundred of them open for now some suppliers to seniors may not keep the merchandise flowing Sears has Seventy thousand employees\n... ... a\nMarketplace morning report is supported by you pass more than two thousand organizations use robotic process automation from you I'm a path to deploy software robots us has dedicated to making work inspiring by freeing workers from tedious and repetitive task more U.S half dot com slash marketplace\nAnti western hotels and resorts dedicated to empowering your wellbeing well on the road with signature wellness programs designed to help you stay in control while traveling west and Must Rise to learn more western dot com\n... online test prep for the ACC SAT G. R. E. N. G. mat that's designed to improve scores students can get video lessons\nPracticed questions and experts support online at ... dot com\nNow to us real estate not looking great which is an economic indicator in itself marketplaces senior economics contributor Chris Farrell is here the morning to you good morning David what do we learn about the state of the economy when we see these housing numbers turn a little bit south\nLet me just give you a couple of quick readings you know the Case Shiller index is is the main home price index has followed by Wall Street home prices are rising less than expected number existing home sales that's declined\nThe exchange traded fund the trucks home building industry it's down by almost twenty two percent this year so it's not that surprising that the mortgage finance giant Freddie Mac they came out and they predicted that home sales are going to decline\nWe are on track to make power plant carbon reduction similar to the Obama plan proving to America that you can fight climate change and grow the economy at the same time that [noise] excuse me New York state and ate at a state or New York state and in other states\nSo now today you can help reduce the cap even further and support WAMC at the same time I help WAMC and his partner the editor on that council to purchase thousands of these allowances and take them off the market\nSo how this works is that the R. G. G. I. which is green regional greenhouse gas initiative\nThe nation's first government run carbon reduction program for power plants it requires power plants from Maine to Maryland to buy one carbon certificate for every ton of carbon that they admit they set a cap on the region's annual emissions by limiting the number of allowances that it sells each yours are today you can help reduce that cat\nHow do you do that well you donate a hundred dollars to WAMC and the ... uh Enron council or to your friends are ... and the folks that are on the council retire the allowance in your name permanently retiring\nOne ton of carbon a\nIs allowed to be admitted to the way this works is instead of the big bad polluters being able to put the stuff into the air it will instead go into your name and you're not going to pollute\nSo that means that it will not go in the air and will stay out of the air thereby saving a ton of carbon from going out now that's just what you can do now we have twenty excuse me we have two hundred of these\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for long term success with we've ... in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nYou know um do something now um you can uh with the certificate you get a certificate that says I've saved you know I've saved a ton of carbon from going out into the air and you can put that in a you\nCan show that on social media you can personalize as you can I've seen them in homes people frame them they put them over their desks at work or they let everybody know what's going on and give 'em as gifts to give them as as a holiday gifts as a birthday presents um maybe a lovely favor for your next\nElection night party [noise]\nEither way uh you will be showing that uh ... hopefully we'll be showing Washington at the end and the rest of the country the climate change is real and it requires real solutions and this was just one of those solutions so\nA one hundred dollar pledged WAMC the outer on that council a gives a um a a carbon certificate which\nPrevents one ton of smokestack carbon pollution from going into the air\nOne eight hundred three two three nine to six to ... pledge make your donation\nAnd support WAMC and help save the environment or of course in they pledge on line at WAMC dot org or one hundred dollar donation permanently retires one R. G. G. I. carbon allowance preventing one ton of smoke stack carbon pollution from entering our environment that are not comfortable retire the allowance and your name they send you a certificate\nAnd you've helped the planet and your radio station all in one guy\nOne eight hundred three do three nine to six to one eight hundred three do three WAMC one eight hundred three ... three nine to six two so this is something that you can do now\nRight now we have one phone ring now if we're going to do this and we um between now and and ten thirty are going to give away all\nTwo hundred certificates and we need a barrage of people to uh to call and to reduce carbon now when we have done this in the past them yes we have done it in the past week has been we always sold out you know pressure by the way [laughter] but we have always sold out now what is important\nTo note is that uh because uh there are um a limited number of these uh people sometimes one two or three or five or seven or nine or ten for various members of their family we had a a just an example we recently just as someone who said\nA grandmother who had four grandchildren and she got one for each of her grandchildren will there's four certificates and we only have two hundred so we're gonna keep an eye on 'em but um and you can hear the ah the the the phone's ringing so this is something you want to get in on\nNow what a lovely lovely thing to turn around and say here's what I did today I got up I was a I was depressed they was bereft I saw what was going on in the world I continue to see what's going on in the world\nI helped my public radio station however and then I also retired a ton of carbon from going into their\nUm big belching smoke stack ugly gross disgusting carbon going in there and instead of going into the air from the big bad looters\nWe are taking it and allowing our air to be that much cleaner one eight hundred three two three Ninety six you to think of a collectively ladies and gentleman for so for you doing your part with one phone call and one certificate collectively as a group together if we do this\nThat means we will have retired two hundred tons of carbon from\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for a long term success with we've ... to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nThere's a lot of there's a lot to this and if people want more information that can certainly call their volunteers and and and we can try to find an answer to him a for them but I I Will tell you that what happens is these things go up for auction so you were you worried I couldn't be able to go to an auction because you have we have to buy a large bulk\nThan them the money required to buy the amount the auction off its corporation money not household money\nCorrect so we wouldn't be able to do that but the ... council can go in with with their house and wait and then and they can do it as a group and uh then they make those because bill to us so that's how this this work\nIs one of one of the first partnership like us have ever done I mean the longest running\nOne day it is and uh you know I remember when we when we started it we thought well you know we won't have to\nWrite you know the temporary ... will take care of itself but but now\nBut now you know just think of this ladies and gentlemen a year ago a year ago I used to read this whole thing that the Enron prepared for us about how this plan was going to work over the years now it's still going to work that way here but it was going to work that way everywhere and now I Know\nAnd I don't know if you know that but um air doesn't just stay above the earth day\nYeah in the world right and it's not just write the\nAir you breathe the water and the and goes to other people as well water that I breeze no but\nOne eight hundred three to ... so let's just move yes one eight hundred three two three nine to six to one eight hundred three two three WAMC one eight hundred three two three nine to six to one eight hundred three two three W. A. M. C. so\nIt is an amazing thing that we've got going here but we need to get it going we need you to uh to make sure that the carbon certificates that are available to us go away that then you take them and that we collectively at the end of our time together and and hopefully\nThe next uh sixty four minutes um but if we need more time will take it right is that we retire two hundred tons of carbon and oh by the way we'll we'll make some money for the radio station as well which isn't a bad deal one eight hundred and three two three nine to six to one eight hundred three ... three WAMC the\nOne eight hundred three two three nine to six to one eight hundred three two three W. A. embassy\nOr on line at WAMC dot O. R. G. and I haven't checked if these are in the drop down menu but if they aren't or if you don't find them they're\nPut a type in your comments coverage ticket writer and I come through and we will get you one ... one ... one eight hundred three two three Ninety six to WAMC dot ORG we've a room full of volunteers I take your calls\nSusan and Lauren and Dave and pat and Kathleen and Elizabeth and ... and Diane and Maggie and John shown Susan brain Kenny ... and ... are all here taking your calls ready to hear from you they're doing their part for the station we hope to hear from you as soon as one eight hundred three two three nine to fix to or online\nAt WAMC dot ORG\nThe president of the United states last night said I'm not denying climate change but it could very well go back\nYou know we're talking about over dot dot dot millions of years I don't know whether going back means it's going to go back over a million years or that we're in the position we're in over a million years whatever the case is we're kind of screwed\nAlso I mean so this is someone I Know makes that argument that not that it will go back\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've ... to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nMarket increased since since the industrial revolution it's just a ... interview to ... I don't I blink at this person wildly unusually exit the building and wanting to get into this topic of conversation will write\nOne of the things that I I was a last week I was in Ireland and I was in Belfast and we went to the Titanic museum\nAnd it was a beautiful museum and I loved it [noise] the one thing they'd never talked about and the Titanic museum was was one of the key factors and that which was um that the un I don't know if you notice [noise] um I Do um the boat hit a nice\n... now I didn't know that you're going to be like more about I don't mention icebergs\nAnd the museum and I thought it would be a perfect example to to tell kids that they're used to be\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks her health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nOr power plants get their hands on them when the Adirondack council buys and keeps the carbon allowances it permanently prevent those allowances from being used to create pollution\nYour one hundred dollar donation to WAMC permanently retires one er GI carbon allowing RG GI standing for re regional greenhouse gas initiative regional greenhouse gas and I had a high letter thank you\nThey tell you the allowing are all ... Jones will send you a certificate containing the serial number of the carbon allowing that you retired with your donation someone who called or pledged on line and then they called someone who called a few minutes ago that they feel helpless thank you for giving them something that they can do I think that we can likely all relate to that\nYou just said for instance watching sixty minutes what can I Do and then we are lucky to get to come work here and in part information and partner with great organizations that are on that council and tried to help provide opportunities to do something and not saving everything is doing something\nA George Carlin used to have a line or that that I loved was the leftovers make you feel good twice\nOr they make you feel good initially when you put the food in the refrigerator and you say I'm saving food and then three months later when it has hair growing out of it and you throw it away you say I'm saving my life [laughter]\nI feel that way a little bit about this where we we're ah the carbon certificates make you feel good twice you make of it when you make your donation you say I'm saving carbon\nAnd then when you look back and think of what we've done as a group oh we have I've done my part to save two hundred tons of carbon from going into the air\nUm so I think if you think of it that way um it'll it'll be good one eight hundred three ... three nine to sixty we had really good momentum we've got to keep up that momentum we uh I think the only about Seventy five of these laugh so we're\nUh we're doing well but we need to keep going one eight hundred three two three nine to six to one eight hundred three two three W. A. M. C.\nOf east Chatham New York helping out with the carbon certificates thanks to Susan and posting kill caffeine in South Hampton and she thinks her son Marshall\nI think\nThis is anonymous no is not an option it says when whenever I'm a Jew thing to do an autumn of Albany Albany out with a garbage or does it gets anonymous of a shadow of New York doing the same uh Andrew good side of rhyme back New York and\nUm again if you have a name that you want to put on the News I'm Andrew did so you can do that as well\nSusan in Westfield Barbara in Albany loves the station listen to all the time Doris in Charles in Woodstock a and a middle road WAMC gets me going for the day a Jeff Elgin and Karen Elgin in Greenwich New York keep on keep an eye on it as a possible the raw\nRebroadcast living on earth at a time when more people would hear it a thanks to anonymous of Scarsdale helping with this a greenhouse gas initiative carbon certificate reduction program [noise]\nWords throwing a amber in Palmer, Massachusetts as an educator this is my number one source for news for the world anonymous in Queens very Gerald in Maryland in West Cornwall, Connecticut we're doing our part by the way let me just say about doing your part\nIf you can't afford a hundred dollars that's fine whatever you can do at this point that you helped in this uh in this\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks her health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nTwo that are on the council and we'll say um they give us two hundred certificates a certificate school way you make you make twenty thousand dollars but if on top of that all people give Seventy five dollars and forty dollars and thirty dollars and we had a well during that time we were talking about this in support of what we were doing in our mission\nWe made thirty five thousand dollars well that's great that that's all the better for us when we're doing this in the future and working with other partners\nBut ... but more importantly it's just you showing that you care about the radio station what we're doing and um and the the activity of which we're taking part which helps us\nIn the future when for example if we do something and nobody calls will then we're probably not going to do it again\nBut if if you if there's something that you can sure well we know a hundred dollars a lot of money and if you can't afford a hundred dollars we get that right but if you can do ten thirty or fifty well that's great and that goes to support our efforts just as much so please do not feel\nUm you know we have our eyes and the price sometimes 'cause we want to get the tickets out the door and that's the things that were counting but whatever you can do is important and needed absolutely one eight hundred three two three nine to six to just don't\nHave a membership leveled at WAMC or fully ... would you just blanket member supporter at any any donation out whatever you can afford whatever it's good for you people have vastly desperate\nFinancial situation and we understand and acknowledge that and appreciate anything you can do if you can do anything and give us and we just want you to be happy [noise]\nJoseph and Patricia Clinton corners New York uh checking in anonymous uh does your bill carbon she doesn't get police can you please read the name of the U.S where they have the name and they want and will do that a thank you for that to a James a million New York agreed to help the radio station and the climate\nRobin Pearson of Coventry, Connecticut it's getting quiet in here one eight hundred three two three nine to six to he said that when I was like a\nA Judy of pure a Bush in New York helping out with a carbon certificates\nI'm Maureen Cunningham and Tom Miller thank you they say and we thank them when the graph of del mar this is just a something little we can do\nA helping with the carbon certificates and a Suzanne\n... of ... Massachusetts helping out with this as well one eight hundred three two three nine to six two so understand ladies and gentleman that we have\nA we have this really cool thing where we have two hundred certificates available um and we uh we we've given a majority of them away\nBut we have some left we want to make sure that we get you in on this uh this is a great way for us to um well quite frankly make a lot of money in an hour but also\nSave a carbon from going into the air to hundreds of tons of it to be exact two hundred tons\nOne eight hundred three two three nine to six to one eight hundred three two three WAMC one eight hundred three two three nine to six to one eight hundred three two three W. A. M. C. um\nI I just want to I just want to again say that the uh just a reminder so just September we're now in in October so just last month the president announced that it would replace the Obama administration's clean Power Plan with Trump so called affordable clean energy rule\nNow the Obama plan would have required as significant thirty two percent cut in carbon thirty two percent cut in carbon dioxide from power plants nationwide\nAnd she's a on leisure and that'll be great that'll be great\nA Kenny in east do does Massachusetts Barbara in Pittsfield miserable in Troy thank you all for that uh Susan from New Hartford, Connecticut keep doing it the great job that you're doing this is where my daughter Lisa in Pittsfield ... gene in Albany\nOne eight hundred three ... three nine to six to\nFor the roundtable panel we are nearly sold out there's thirty seats left okay for the carbon certificates in sixty also not that many\nHere's a way to here's a way to sell the last thirty it includes breakfast [laughter]\nNo and you you will treat you laugh but we did one a while ago and we didn't offer breakfast and we thought we were going to have a mob scene on our hands before people should all be held\nLike radio mob right like stern looks right very disapproving had\nLike they were going to hit you with her ... their hemp tote bag or whatever it was but but anyway uh so we're we're going we're we have the breakfast\nOr three jobs during that\nTime well just because we were really been like a quick turnaround no we're going to exactly why which is sort of a boring answer but we were doing a book signing with another man and we needed to space that's right um we had all the books set up where the breakfast would be yeah hum and that was why we did it so I'm a while we didn't do it but anyway\nUh there was a reason that we didn't have coffee and a little trees but one eight hundred three three and I say\nSomething I'm related to the environment of course I Do love in after the regional news and the eleven o'clock during the roundtable we air a module predicts I trusted O'Neill called earth life\nAnd the voice of earth lives as Randy Simon and Randy Simon\nTheir Randy how long have you been here in just a few minutes oh good [laughter]\nAnd uh he does a a great job hum do\nHave any bad stories about ... no no such thing exists right oh yeah I Know it seems like a just nobody has any bad stories about their producers\nKnow although I don't I don't know if you're a student comes only forty hours in any he comes in but he does it at night when we're all gone yeah here's another title and see\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks her health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nInterns I'm a high school in journalism and then he worked here in silver hair so that's great one eight hundred three hundred three eight or nine to somewhere else or or early ... or something\nBut those things are being here Randy thank you ran one eight hundred three two three thank you for giving us an extra two minutes ago I guess in the studio one two three nine calling me at all I Know but it it does feel like that sometimes you want to know no oh wait we ... we do have a couple of runs the grammar and like I should I say that Mm\nEasily three times a month\nThat might be being generous to myself I run to the green room from the newsroom and I say Hi I should've come for youth center please let me quickly\nWe're on the air in a moment you want to and I do read\nNine or two six to one eight hundred three do three WAMC or do we have a rough counting how many\nWe have left and I asked us only because I'm going to run out but I'm the one eight hundred three two three nine to six to one eight hundred three two three W\nAbout sixty left okay one eight hundred three two three nine to six to one eight hundred three two three WAMC so don't stop calling because we're still they're still carbon in the air that we don't want more carbon going into one eight hundred three do three nine to six to\nGoing to read these while you're getting ready or do I am ready to go ahead and uh but well we have some business to do is we are under writers and read the legal ID so this was going to take a few moments so please\nPlease please keep calling we desperately want to get rid of all of the certificates and make sure that collectively we have a shaved at two hundred\nTons of carbon from going into the air\nOne eight hundred three two three nine to six to\nOne eight hundred three two three nine to sixty or WAMC data orgy and this\nIs a partnership that we have with the Adirondack council the great John ... and we need you to help us out on this every fall and should be ringing right now one eight hundred three two three nine to six to\nOne eight hundred three two three W AMC\nSo those calls in online pledges produce a great deal of our\nOperating budget but we also have wonderful underwriters that support us throughout the year and a work and I think some of them now including Amherst copy and design works offering printing and copying signed making and designed services firm booklets the stationary and labels lawn signs of downtown Amherst, Massachusetts Amherst copy dot com\nLaurie illness soccer called little banker village green realty Woodstock specializing in the greater Woodstock Socrates and don't rich area markets and serving both buyers and sellers of homes and land land eight four or five nine zero one takes one to nine\nCalled them and Hartman architect serving clients throughout New York sorry new throughout New England and New York with architecture design for resilience enter a new ability designed for the next hundred years see an age architects dot com Hurley bill Arts Center bringing independent and documentary films dance and yoga classes workshops live music theater programs for adults and children and more\nTo the solvent county Catskills Harleysville Arts Center dot org\nNew York's date AFL CIO with two and a half million members speaking with one voice helping working families achieve a better life and Y. S. A. F. L. C. I. O. dot O. R. G.\nAnd Paul Smith's college the College of the Adirondack where a fourteen thousand acre lakeside wilderness at the campus offering a hands on approach to career oriented education Paul Smith dot edu mere moments [noise]\nFrom my parents' old house also known\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks her health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nTo tell them auto dot com and figure it out of the Massachusetts a family owned wind Baron fierce retailer offering organically farmed wines from around the world wine tasting Saturday afternoons spirit how dot com\nOne eight hundred three do three nine to six to one eight hundred three two three W. A. M. C. one eight hundred three two three nine to six to ... talk ladies and gentlemen [noise]\nOur grand champion thank you very much a amazing work\nAnd uh oh so you know I like having this in front of me um so yeah so we started at five hundred and forty two thousand this morning and they made sixty thousand dollars a this morning sixty thousand six hundred and Fifteen dollars\nBut I mean we had a lock box goal to reached to make it halfway and that to our total before the funds that started in that happened Thursday Friday morning or third right and so over the weekend people kept showing up that's nice\nForty two thousand dollars almost forty thousand dollars this really great um one eight hundred three eight to nine to six to and and we only have like one challenge and they're so that's the only real money on people you know what an hundred three two three nine to ...\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for long term success with we've ... to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nOne eight hundred three two three nine to sixty we want you need you we love you all of that stuff one eight hundred three two three nine to six to\nAll right uh we are we have certificates we need your help one eight hundred three two three nine to six two things to marry a Ginsburg to New York um\n[noise] okay I think I've read all I can read on the uh Joan David scent of a highway in New York uh helping\nOut the Adirondack council Betty Lou math as of late some New York\nA lot of the roundtable gives me hope of gallons point of view indeed Kathy of South Hampton in Massachusetts Elizabeth north north in Connecticut I appreciate all of WAMC is programming and make this donation in memory of my mother who was also a devoted listener thank you very much for that and\nMike in a net of ... skill thank you Eric and Jessica of highland in honor of our dear friend Peter Lichtenstein who passed away last night and love the Adirondack some kayaking and the around the park I thank you so much for that and I'm Sorry for your loss\nAnonymous of Williamstown I'm Glad you're there keep it going we're trying a Janice of Bethel New York a and a neighbor of Warwick in New York or to him a\nNote or Tim Saratoga Springs if Eleanor joke and say my field double the pledge damn it okay so are there any guidance\nSo I'm going to say Tim\n... and you can give your\nHand it says I I go oh\nI don't know I don't know All right so my my best guess is Tim likeable and if you'd like to double your pledge and I've said it even partially correctly great and if not I certainly understand\nUh just no you can't give or take back when you already get okay not threatened no end in ... I'm I'm just thinking that I just such a bad job maybe he would be willing to or wanting to but anyway a Georgian Jane ... thank you for your generosity Ronald Reagan Chloe of Johnstown New York just in Boston the lake Nancy in Amsterdam\nOr Deborah Armstrong of Clifton Park and love and appreciate the roundtable a Patricia powers of Hudson the carbon certificates make an absolute difference in our ... in our fight against climate change or it's orange origin sharing Connecticut ... Salem New York\nWho gets in beacon New York Pauline in water believe New York Kathleen in South park right in New York pledging and memory of my parents and getting a carbon certificate we thank you very much\nOne eight hundred three two three nine to six to one eight hundred three ... three WAMC\nWe think it's ... below zero why do we think of ... um and I said when I say we think that would write whatever I grabbed taxes me a one eight hundred throwing a nine to two yeah I'll turn that off I'm\nYou know I take it I I turn it off during the week if I remember and then but then when I go home I leave it off and then I see all these ... you know and then you turn it back on and you forget that you know I had her three two or three nine to sixty one eight hundred three two three W. A. M. C.\nOne eight hundred three two three nine to six to okay\nEight hundred three two three nine to sixty or online at WAMC dot org we heard from Kathleen about Trump or New York who says\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks her health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nCarbon credits Tibet Woodstock New York or Tibet aid on to the gate and honor of its ... who is that it's all to take care of our beautiful planet thanks to Bob from Pittsfield, Massachusetts we heard from\nBarbara from guilder land pledging in honor of my her grandson Emily from Greenfield center pledged on line as did she live from Massachusetts\nWe also heard from Irene of Warwick New York from Susan Phillips and Greg Barker of cherry Tony ... owner of the brave furry of Dr Ford and the health of the planet thank you thank you also have Marlboro Marlboro New York keep up the good work with a roundtable my husband I listen to it each day\nWe heard from Maureen in Lucas of run back to New York and Richard from queens brand new York at the carbon reduction program in honor of her grandchildren Hannah and Aaron things to Jonathan Livingston men or New York and Larry and Lisa from Troy New York we also heard from\nAnd John and Wendell, Massachusetts donating for all of their grandchildren Elizabeth from soccer is New York pledged as it does in from became the\nAndrea from Beckett who the vote vote vote and Jason from del mar which is coming online at WAMC dot org Eric from Cooperstown loved the stations that keep doing great work Gregory from should spray pledged as racial from Cornwall Florence from Palatine bridge Thomas from ... and Jason from run back\nWe heard from ... Massachusetts from guy goes from New York who's a fan\nCynthia and James for its ... Lake Placid said we enjoy all of it thank you so much\nWe heard from anonymous and soccer is near because if they couldn't make it without you I feel that WAMC as my same connection to the conscious world it would be a great loss I Would be at a great loss without this radio station we're from anonymous without sadly Massachusetts from Laurie of coal picking who loves it all anonymous from New York New York pledged adds an anonymous from Belgium Massachusetts\nAnd that and John from Newberg New York\nAnd Catherine from Albany New York both pledged on line at WAMC dot org ads did John Jeff from old shot of New York Devon check from ... New York and Jonathan and Susan from rex for New York\nWe read from Nancy in Schenectady living on earth should be more time time to love earth wise and it's led to the lock box\nWe heard from all has to pay attention so no no no no no just because specifically um thank you to Brazil a Hardman ... find planes in the yard Oh hi who say thank you to the whole W and we love you for all that you've done for so many years her voice matters more now than ever well in\nMy God they do everything for the community and there are such wonderful partners and we love them to death and they're great thank you very much\nThings to Donald Israel Israel New York and you'll end up from Albany New York we also heard from Paul and cut ya of Greenville New York and from anonymous brittle Connecticut to keep up the good work loves music collection at night\nJanet from ... New York likes everything WAMC is doing grateful that back and listen to the station we heard from Russell of that bird New York Patricia Pittsfield math I became a standing member last year you really should promote how easy and painless membership is\nPatricia we're trying\nTo do three nights to sixty that you make a good point of I Will talk about that in a moment and thanks to Jennifer from run back New York\nWe also heard from anonymous who tried to put it on line for some reason couldn't get a credit card right so calling ... okay so I didn't need to read that but I did and it's all fun and thinking we heard from ... while the of new ... New York who says less carbon is good for health and we heard from Christine of trying New York for the earth and for my grandchildren\nOkay two quick things I did you do this is the one we read it yes we did okay we read\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for long term success with we've ... in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nYou got that one right and then we we also want to think a marine Cunningham called and um it's uh we we gave me the wrong name is marine Cunningham and Paul Miller and uh the Cunningham family helping with the carbon sort of because we want to thank them as well\nUh we're forty tickets left a forty certificates left one eight hundred three ... three nine to six to okay so\nUm we have to we have to work on those under three two three nine to six so can we find forty people who want to save the planet who ... who wanna who feel bereft who feel disconnected who feel like they are and uh they they are\nAre um adrift and not able to do anything and or or questioning what they can do to this dire situation of our planet last night the president of the United states on sixty minutes with the um\nWith Leslie stall who who I Believe I think did a great job last night but anyway I'm Donald Trump has accused climate change scientists of having a political agendas he cast doubt on whether humans were responsible for the earth rising temperatures\nLet Mr Trump also said he no longer believe climate change was a hoax the comments made during an interview with CBS the sixty minutes came less than a week after climate scientists issued a final\nCall off final call to halt\nRising temperatures the world's leading scientists agree that climate change is human induced last week's report by the Intergovernmental Panel on climate change the leading international body evaluating climate change warned that the world was heading towards a temperature rise of three centimeters\nOne of the great and I always forget it but you have one of the great responses to people when you say or how are you and you say you reply well enough\nYou see something about what do I say you say something about you personally and then go oh yeah\nYeah personally I'm personally fine and then usually globally or internationally I it's like a hand motion and if\nNot and not not a specific in motion a more like a ... fine and global concern that's right\nWe are globally concerns citizens or we need about twenty or Fifteen I guess Fifteen\nGlobally concerned citizens who want to save the environment and keep a ton of carbon from going into the air and say well enough before a certain election I Know I Know a one eight hundred three two three nine six to one eight hundred three two three WAMC one eight hundred three two or three WAMC I'm telling you I'm\nI'm I I was I was talking about being ... I was ... I Know it's ... I I Know it's a sweater and I know there's a lot of hate and whatever and I know there's a lot of heat you know everywhere but\nUm I was really shocked by reading the comments are because I just wanted the unfettered feed coming in right just seeing is why I get out of your ...\nAnd but but I but I just saw it just put in Leslie solves name and that was my that was my thing because I Want to people just to see what how they were responding to her interview and it was just it was unbelievable because\nThere there would be one person saying that unless we saw sitting in the park and then there would be thirty people who say I'm just calling are horrible names and and the trees you know she's this all fake news and and how dare she asking for clarification and\nI respect him and and not you know and and I and I'm I'm like why are we how are we on the same planet I I don't I don't understand\nA and a and and then I think well what is my role in that of of not being not seeing that ... I don't know I I just I came out of that just really depressed the whole thing was\nVery depressing um and then I watched a really good football game or what [laughter]\nIt was a they were had at halftime yup and then they fell behind and then they came back and it was great and it was it was a good gag orders I think that'd be a a sixty minutes to play\nOne eight hundred three two or three times before um I don't care about sports [laughter]\nBut I don't I I have I have a full ride back not no no you did it but it is but I but I don't think there's I mean I ... I don't mean I don't come from\nA like a place of rage about it or like just yeah just like I get it like a lot of people don't care about musical theater I Do a lot so like you get it like that's a thing that people like write a lot ... obviously it's on constantly it's industry to teach\n'em why did I start complaining oh so that's been my husband is a pattern and I learned last year that Tom Brady is a very good quarterback\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks her health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for three four nine nine six six zero zero\nFor like no he's he's really good\nAnd I was like I don't care\nBut it's like oh no okay so he's a Christian China with football okay God but he has problematic sometimes right well\nThere's I mean he's he's forty one forty years old I mean you know so he's he's he's he's the best probably the best I mean this was arguable but it'd be ... let's say like\nHe's one of the best quarterbacks ever to play the game yeah I mean that that is undisputed or if he's the best quarterback to ever play the game you could I mean there are people who make that argument hum and a Michael Jordan situation right so it's just there's nobody you know and right now nobody better I mean is absolute\n... perhaps when he was telling the comparison in public radio so the comparison in public radio I don't think there is\nRight [laughter]\nBut my but the point being that uh and and here I think is the true point that if um if the there were to be an enemy or to a football was an NBC and if a Fox had like\nUm oh a\nLike a live hello Dolly I Would be torn I\nDon't know I Know I Know we can hang up like we can talk about the only thing that I felt like so silly to just like she'd be like I don't really care about\nThat I don't like you'd have to know something about it but I don't have to have and it's like it's nearly care and then like last year I was like who is not just like popularity and not just on track to\nKnow is really good at what you can throw this thing like with accuracy and got it okay yeah okay yeah I still don't\nCare but I land occasionally read it is is accused of cheating wanted hunter new during the feeding one for the wrong people to reduce [laughter] that to\nA Anna ... helping us out of the programs on the station and we love you Margaret holiday of connected in New York Thank you and every morning and appreciate everything that you do\nAnonymous of a very Beach Florida a and sending the council certificate to President Trump Charlie isn't again Mike in well it says in Hillsdale and they are helping us out any amount of German town bath and surgical springs with like two of the carbon initiative against 'em for two babies do any day\nNow wow wow you and who you are having we're having twins and you are calling us wow oh\nTwo I've heard not um as a hub in New York Thank you very much Glenn Schenectady Daniel a blessed Stockbridge\nAnonymous blooming where the certificate as for my mother Sicilia who is a grateful contributor to the station she would've turned Ninety years old on October tenth thank you to everyone at WAMC for all you do for our earth let us\nEach continue taking personal responsibility and a thank you and it's a lovely thing to do for a your mom's\nAnonymous of mechanic bill loves the mosques and is being very generous when it comes to the carbon certificates ah Ellen Moyer Montgomery, Massachusetts thank you so much for bringing us Tanglewood concerts in the Boston symphony orchestra concerts Joanna Joanna\nGarrison says uh\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks her health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nChildren and Barbara maybe they have to on the way any day now and Barbara daily of I'm In New York who loves the round table and helping with the ... council carbon certificates we have how many are in your hair is that is how many do we have left count 'em up and told me an exact number if you don't eleven we have a Web\nCertificates left one eight hundred three two three nine to six do we have nine certificates was\nNine certificates left one eight hundred three two three nine to six to one eight hundred three two three nine to six to one eight hundred three two three W. A. M. C.\nSo if you want in on this now's the time uh this is to help save the planet one eight hundred three two three nine to six to one eight hundred and three do three WAMC\nOne eight hundred three ... three nine to six to uh we have seven laugh now only seven left one eight hundred and three two three nine to six to the ... the council carbon certificate um that's what we've got one eight hundred three two three nine to six to\nOne eight hundred three two three nine to six to err on line at WAMC dot org\nThanks to Laurie opposing killed New York dedicating his pledge to the children we're from Jenny law and now in love Julia falls village Connecticut and from east than of middle grows in New York Thank you to anonymous from Saratoga Springs and Joe from Clifton Park\nBecause I just got back to work after volunteering at WAMC all morning I've been listening to long enough\nAs I recite the legal for memory just about every hour on the hour show that is hilarious because I Can't do it for memory I can I can start to or if I go into like a few said I can get halfway there but I Do not have it down so\nI'm envious of that memory thank you for volunteering for pledging to bill of Albany New York Thanks to Matthew Pittsfield by golly of Warwick and Jean of lay some thank you to anonymous from Waterford New York thank you to Jeffrey of when my New York\nSays Allen Joe and the gang thank you for all you do well thank you very much WAMC dot ORG one eight hundred three two three nine to six to thanks to marry and Fran from Albany New York and to and from ... New York\nThanks to Laura from both and like me are calling from Albany New York and Kathleen from Albany New York who depend on having said that depend on W. daily and I'm so happy to the fourth station we have a new member a farmer from Fairfield New York\nFormer he enjoys volleyball on soccer Under Armour or Thirty years old but now\nYou think you to get you bring from Milford, Pennsylvania always listen to the roundtable Donald and credit from Denver at New York and Diane from New York pledged on line as did current affirm or Cory now from Cooperstown nearby station ever and\nBlaming those folks places we only have five of good\nCommon Noel from London to New York always support the great work of WAMC and we always thank you Tom and Noel things too and uh that's on anonymous thinks the Burgess of worked in Vermont things to Betty and Jeffrey Becker mountain math and Scott from Woodstock Russell from who's the tonic and fall from Hudson\nSix to one eight hundred three two three WAMC one eight hundred three ... three Ninety six to its\nThe roundtable panel Wednesday November seventh and eighth Fifteen am uh that's when the doors will open we will have a mingle session\nFrom eight Fifteen to nine o'clock you get to meet the panel is you get to talk to each other and get to have some breakfast you get to you know whatever um it it would be considered the cocktail hour except there is no cocktails now right um well maybe in the green room\nA and then uh we not drink in a day just like this once\nAgain it'll depend on the results uh and then we'll and then we'll go on and will be on from nine eleven and a and then you hang out a little after and we hang\nOut and we talked to people and we have a great time and if people like to take pictures of people want to talk to us we're there we love doing that I'm In a very generous and I I have to tell you that this happened the last time we did this I was shocked 'cause I just figure that we have people who are doing this and they just keep coming back again and again and our last time we did this I said how many people\nAs there is a third of their first time here and I and I think like Seventy percent of the group were were first timers would ever men to invent and they're coming from all over the place I mean people were were there was one person who who took a plane I Believe to get here\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for long term success with we've ... to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nThat um but they were they came up and uh it's great so we we love having you we love having this was a big celebration of WAMC or the subjects will be the mid term elections and we'll have a lot to talk about we have the local races we have the national races we have the state races\nSo there is a lot to talk about and we'll be doing this and a\nLook it's a really good time where we all get together and get to be a friends and um and and show our WAMC\nNo fear it there you go one eight hundred three two three nine to six to one eight hundred three two three nine to six to but we only have twenty five of these you know go to a one eight hundred three\nTwo three nine to sixty one eight hundred three three W. [laughter] see one eight hundred three do three nine to [laughter]\nJust let them photo Bob uh what\nAre the three ... three nine she was six two so everybody should\nBe in all of them like my puppet when I [laughter]\nWhen it under three do three nine to sixty we only have twenty five of these uh we've got to go one it under three two three nine to six to or we want you to have them we want you to go a can be with us now from Mike Spain Judith thanks Aaron Rodgers and Jim Smith\nDavid sores eight Fifteen am and we'll start the show at nine ... eleven\nAnd you get to be with us live at the window it is a wonderful time I I Would be lying to you I'm I I Will tell you that I when we originally started doing these I thought to myself I Hope this doesn't catch on because I don't know if I Want to keep doing those\nAnd now I Love doing it has so much fun to do the ... if if I had my\nWhy do you\nRemember why you [noise]\nWeren't sure you want it to keep doing it will only because I was worried that nobody would show up okay and and then people showed up that was nice and you know that from Allen right our ... support and the money to show like the first one or two we didn't have as many people as we are as we do know\nA show now a weird way after the election\nRight people became much more interested and uh and want to come in and be with each other and talk about these things\nSo I I find that good um I also ah when there are young people in the crowd and there are students in the crowd which there have been for many of these events I Love it I could talk to those kids 'til the end of time that is great\nAlso our panelists are kick ass one eight hundred three two three nine to six two and a and it is not that they always\nWeren't but but they're just so great and I haven't more of them yeah them and and I do think that was always worried\nAbout is how do you get to a you know ... ... people with a strong opinion how do you get to everybody and it works out great everybody's very uh they read body language they come in and they say what they have to say they have very spirited conversation the audience gets to talk\nAnd and what sort of figured it out now so it doesn't make me nervous anymore but I I Love it it has so much fun and I think in the audience loves it and we'll have a great time so please join us a one eight hundred three two three nine to six to one eight hundred three two three WAMC\nNeed to thank some underwriters and read the ... and then we will talk about that's more\nOne eight hundred three two three nine to six to or online at WAMC dot org we also um do you want to point out that it is it's a hundred dollars pledged per ticket to come to the roundtable pain alive to anything\nStreaming support for WAMC comes from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nFinal weeks of keepers of the flame Paris why if an Rockwell through October twenty eighth Roswell studio interests cafe open an R. N. dot org miss whole school Pittsfield, Massachusetts the ... school offering girls and grade nine through twelve the real world experiences of its horizons internship and service learning program at ... dot org tear up in a restaurant [noise]\nServing lunch and dinner seven days a week and historic renovated church building and the heart of around ... Turpin restaurant dot com I haven't been there a long time to go back and the Green Zone bookstore only under the independent booksellers serving the local and college community book signing for close personal servant screen toads bookstore dot com\nWhite hundred three two three nine two sticks to show we are done with that through new All right\nOne eight hundred three two three nine to six to one hundred and three do three WAMC to what can we just got our screen back there actually real quick\nThank you very much a one eight hundred three two three nine to six to\nI don't sit down before the panel is sit down and talk\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nFulltime you're also not um you don't have to stay on seated in the audience fill time if you get hungry or want more coffee while they're on the air you just can quietly get up and do that or use the restroom whatever you need it's not it's not too straight out we'll have you know as you know for listening you if you're listening to me now you probably listen to us often um\nWe take a few little news break so there's time to get up and stretch to you're not just you're not you don't have to stay seated for to fall out of eight hundred but you may if that if you prefer\nEight hundred three two three nine to ... to her online at WAMC dot org it's a one hundred dollars per ticket parking it's free and a lot surrounding Linda during the event or yes so there is also there is parking one eight hundred three two three nine to think there'll be make Spain is the associate editor of the time you associate editor of the times union\nKnock them down to the best selling author and MSNBC commentator to to think a formal former regional EPA\nMinutes later there are others in Albany law school professor of law and director of the immigration law clinic Gen ... is a reporter and David sores Albany county district attorney they're all going to be there along with Joe Donahue and of\nCourse Allen shark talk who\nWho came up with the panel that was his idea\nAnd it is quite popular knew what was\nBelieving brilliance one eight hundred three ... three nine to six to\nOne eight hundred three two three WAMC we need to do than ours to make her goal to get to the three thousand dollar challenge and to get the fifty thousand dollar a point that we will have made this morning um and uh so that is a lovely or we're going to have some other events we're going to talk about and just a minute and in our last forty minutes try to um\nGoose this thing a little bit one eight hundred three two three nine to six to one eight hundred three do three WAMC but we need everybody on the phone and you've been doing amazing\nWork uh Alan and re had a great morning this morning a certain I about a great morning this morning we're uh we had a great a obviously a wonderful locked box and uh so all told our we're we're\nZooming in on six hundred and fifty thousand dollars in the entire fund drive so five left on the ah on the Capitol Steps we have uh about Fifteen left on the um on the roundtable panel and we're going to talk about some other stuff those tickets are still available but I just want to throw some other things at you in a way of\nDesperately trying to get two thousand dollars um one in three three nine to six to um we have five fears of tickets to see David Crosby at a at the palace theatre\nOn Saturday December first an ape yeah amazing the David Crosby heard of them be amazing to time rock and Roll Hall of famer and co founder of the birds\nAnd Crosby stills and Nash David Crosby of sending out onto her this fall he is joined by the White House band a journey down a new for ways to read that brings his music to\nWife with new spirits and it's really a great we every performance\nSorry to interrupt we have three tickets left to the Capitol Steps\nOkay three to ... and a and about Fifteen love for the WAMC panel we have five for David Crosby one eight hundred three ... three nine to six to one eight hundred three two three WAMC and we have a two thousand dollars that we need to raise and the next thirty seven minutes\nThe roundtable panel is on November seven in the morning [noise] capital steps is on November\nNight in the evening David Crosby is on December first in the evening\nA yes or Wednesday friday and Saturday the roundtable panel is that the Linda yes the Capitol Steps are at the egg yup David Crosby that's about right\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nNow we're talking about these three one eight hundred and three two three nine to six to one eight hundred three two three WAMC one eight hundred three ... three nine to six to [noise] I just want to um [noise] again warn you that um\nWhen these tickets are gone they're gone so are we only have three ... for capital stuff we only have Nineteen left for the town [noise] um so if if you want to use them when they're sold out they're sold out one eight hundred three ... three nine to six to ... and there's nothing any of us can\nDo about it but we've we've made her money we were there\nOne eight hundred three two three nine to succeed but if you want in that's all you know so you know that's how you doing one eight hundred three two or three nine to six to one eight hundred three two three WAMC\nFor David Crosby at five pairs or five take\nA look at it divided hairs for a hundred dollar pledged you get a pair of tickets for on the panel is one hundred for one ticket and to the capital that's correct\nOne eight hundred three two three nine to six to one eight hundred three two three WAMC\nOne eight hundred three two three nine to sixty thanks to Amy in Charles in del mar and Joseph in guilder when and when I was ...\nAnd the child an accurate in New York in ... New York we heard from Bob ensue from a plot and from Florence ... falls New York who listens\nEveryday drop page\nThank you too and I'm going to be screened Bush New York and Diana Jeffrey ... banks in Massachusetts he pledged online at WAMC dot ORG\nWe heard from Megan Jim Cash and about the New York state the only station on the radio that's true but your perception is valued anyway they condemn you very much and thank you also to pumpkin Stevens Albany New York\nOne eight hundred three two three nine to six to one eight hundred three two three WAMC you know when you think about brand loyalty sometimes with your personal shop and they give you a rental car um I go in and I change all the presents and they're all to WAMC I don't know why do that but I feel like I'm doing my little\nRebellion I don't know the little resistance right there on a one eight hundred three ... three not usually they're just on weird others for because of the the car usually as like Kansas plates on it so they're not even like it's being used to but I feel better about it one eight hundred three two three nine to six two\nThings to a Roger Gordon of late some New York he is a conservative but he enjoys the station because presents both points of view will thank you very much\nAnd we appreciate that get left the capital that one alone at the Capitol Steps or who wants to go by themself one eight hundred three matter you know you'll be will do walk alone he'll be with all your WAMC\nFriends and family one eight hundred three do three nine to six to one eight hundred three do three WAMC this is like when you have the kids are off in class and then there's the one kid oh\nPartner [laughter] there you know a partner with it\nA one eight hundred three do three nine to sixty one eight hundred three two three WAMC\nOkay so we have a\nWe have David Crosby a on December first an evening with David Crosby David Crosby for goodness sakes at the palace in Albany New York who by the way has been very nice to us every every time we ask every time I ask a ... few I've done a few he's a lovely man he's really he's very very he he will tell you whatever you want\nTo say he's he's ... he's an interview sounds kind but he's also can't it very\nOpen talks about I mean he makes like he does not try to go to the fact of life has not been screwed up in certain aspects\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nWhat I'm self deprecating and and I just he's he's been very very nice to us and and giving these tickets to us all ugly as well so we we thank you very much into step up presents they're always good to us and um we're just a thrill one eight hundred three ... three nine to six to one eight hundred three two three\nWAMC a teddy don't write um yes\nAnd uh had changed uh no I don't think so and but we always thank them and and a great uh do a great job and when we think that very much for ah for doing and for bringing such great music to the region to time rock and Roll Hall of famers who we have we have ... cigarettes for that yeah one one isn't enough\nWanted under three two three nine to six to one eight hundred three ... three WAMC\nWe have the roundtable paddle live a and\nI'm going to go away from it yup go ahead a and I'm going to think some people don't want to remind you what your ah what we have here um we have for parents who tickets left for a David Crosby at the palace on December first\nWhat a great time to go to a job ... oh I think I can say this I'm going to say anonymous because I don't know um and then also Jenny a wrestler who enjoys the station and listen to all the time thank you very much for that uh so what we're talking about we ultimately have three things that we're trying to get the uh the last remnants of tickets away we have one\nTicket ... for capital steps at a at the egg here you go actually um one we have one ticket left for the Capitol Steps of the egg we have a Nineteen tickets left to go to the uh the panel live at the roundtable panel mid term election edition\nOn Wednesday numbers November seventh shows from nine to eleven we'll open the doors shortly after eight and a you have time to have breakfast in a meet and greet and talk to all of us and then we'll do a show and that'll be the day after the midterm elections which are very important and we need to keep our eyes on that prize\nAnd also we have the evening with David Crosby which is on December first at eight PM and step up its resenting that at the palace theatre and we have for parents with tickets left before that we have two pairs of tickets for that have been a one eight hundred three two three nine to six to\nAnd we need four hundred and Seventy one dollars to make our goal one eight hundred three two three nine to six to\nOne eight hundred three two three nine to six to one eight hundred of them I'm pro seltzer one eight hundred three two three nine to six to one eight hundred and three to three to nine\nChildren my fully resume over here [laughter]\nWell they do there's three no deal travel mug swooning sick take wanting to indeed indeed All right\nAh one eight under three two three nine to six to one eight hundred three two three WAMC one eight hundred three do three nine to six to All right so\nUm we would love to ah we'd love to get to the uh uh uh I Would love to get to um you know can we make two thousand dollars a let's say twenty five hundred dollars and the next\nAnd the next twenty minutes one eight hundred three two three nine to six to one of ...\nYou wanna try for more than five okay one hundred three two three nine to sixty one eight hundred three to say I am and say I'm\nA so I'm going to keep track of this hum and\nOr I can\nOne eight hundred three two three nine to sixty one eight hundred three two three WAMC\nThinking is Sheryl from Saratoga Springs New York Janine from Rensselaer in New York and Pamela from New York New York one eight hundred three two three nine to six who are online at WAMC that are largely there are a number of volunteers answering the phone right now we would like to hear some more ... than here please\nThank you to Claire Malone of del mar New York\nTo Dianne curls Holyoke, Massachusetts two cents for the planet and for good reporting things to Robert an angel is wrong and then the New Yorker to keep up the good work of everything that you do\nWe're from anonymous of ... New York I like everything\nAnd from anonymous of rent there in New York second donation today thank you for everything you do a WAMC well thank you and Cincinnati miss I Will say enjoy Democrats they\nCause nobody will now in case you about this as a gift for somebody they don't know because you weren't on it couldn't no\nI think in my mind thank you to muzzle or my platform mhm our cameras thank you to a Robertson of Jacksonville, Vermont voyage to November and thank you how to run back in the markets as I'd like to get one of the carbon restaurants it because it's\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero in\nNew York we all heard from anonymous of New York near for round table in New York just like to listen to keep informed one\nEight hundred three two three nine to sixty one eight hundred three ... three WAMC okay so we want to five thousand dollars we have thirty five hundred dollars to go and that is for the next Eighteen minutes an Eighteen minutes we're going to go over the sprint we're just trying to do this\nOr we may never go we've done so far we have one pair of tickets to Anna left we have a Eighteen tickets left to the roundtable panel when they're gone they're gone so that you never never to be seen again one eight hundred three ... three nine to six to one eight hundred three two three WAMC\nThe roundtable live panel is on Wednesday the seventh of November beginning an eight am a Fifteen am will result in yours him the show us from nine to eleven and we'll be talking about the mid term elections exclusively that will be the subject of the day\nA thirty five people at a hundred dollars each way up Seventeen minutes to do it in one eight hundred three two three nine to six to wear on a tour and face but if we want to get you back to regular programming and don't we want to get back to regular programming ladies and gentlemen we have to keep it up\nAnd you've been wonderful and you've been great and we want to keep going one eight hundred three two three nine to six juice or whatever you can do let's do one eight hundred and three ... three nine to six to\nOne eight hundred three two three nine to six to thirty five people at a hundred dollars each and we only have one person to people three people on a cell phone out of the twenty some that we have in this room only twenty\nAre only three on the phone with everybody needs to be on a phone if worry I have a chance of doing this one eight hundred three two three nine to six to\nThank you to take the million that's currently Americans to keep up the good work one\nEight hundred three ... three nine to six to one eight hundred three two three W. A. M. C. thirty four people now thirty four people and we've got it uh and we have one pair of 'em one pair of tickets for an left at the a Shakespearean\nCompanies here of Packer play house there right in Lenox and it and about the life of and Richard the governor of the state of Texas\nA democratic governor in the state of Texas thinking about that one a male democratic governor\nOf female democratic governor a one eight hundred three two three nine to six to Jane Atkinson starring on the show of course we know ...\nFrom a wonderful roles in a while we should mention house of cards we should mention let them secretary we should mention twenty four she was also in\nOne eight hundred three two three nine to six to one eight hundred three two or three\nWAMC her in a while and I'm\nExcited to she was also in spirit on Broadway with a with a ... and I'm Rupert\nEver ever my best friend's wedding that's rough\nOne eight hundred three two three nine to six to one eight hundred three do three WAMC it is a uh it's wonderful\nShe also sir I first first time I saw on Broadway was with um on on them and in our town ... okay I didn't want some talking about but we don't want to uh one of the ... production is available to scream I don't know where\nAll my mom and I want to go see that it was a great great great great production I'm Jane Curtain was in the show\nBecause Paul Newman or stage manager\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks or health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery\nFor one three for nine nine six six zero zero for three to three nine to six to [noise] uh so um\nWe are we're done with it and\nAnd uh so I'm going to give us or other choice here of uh which of these ... or one eight hundred three ... three nine to six to one of hundreds reduce redouble your hands\nYou know it's funny because I go to the ... yeah OK okay\nOne eight hundred three two three nine to six to one eight hundred and sixty three WAMC no we only have a pair of these so um and you can tell us about it is a pair of tickets to post modern jukebox\nFriday November second so that's coming up front in November second estimate hey we integrate very to Massachusetts or their back post one or two bucks back in black and white what is it\nGot Bradley's post modern jukebox is an excellent like swing band that does re ark is rated soul swing ragtime et cetera version of hops on it so like true pop songs like Britney Spears or and I think from the nineties and too early to thousands\nMore modern stuff too that I was also like they'll depends on roses but they they ... orchestrate them entirely and then these than task musician than vocalists\nPerform them um there's sometimes tap dancer there's a guy who tourism and sometimes to his name is Tim and he's a tambourine guy and he comes out which is just like insane amount of enthusiasm and dances wildly\nAll around and playing the tambourine anybody I hate that no [laughter]\nI Love it I Know I should have just said like oh no\nOh no no I Love it it's got brothers one hundred bucks is a very very good time and they're just like really really young enthusiastic an outstanding lead talented people playing music on stage it's I'm fantastic it's very very very fun and you will\nIt's fun to listen to the recording they have CDs out they are good the live show is is one of those groups that were the live show it's like the jumps up\nLike dance party yeah that's great it's really really fun where the ... box fried in November second it it eight o'clock my hey we are performing and sent me a performing arts center\nAnd Gregory him as the Monday a first um have you done for more information but uh you can get a pair of tickets if you if you were going to get them you can get them here will get a degree for tickets and you can help your public radio stations\nI saw them at the trade savings make musical and didn't know that much about them when I went and we talk about it all the time and they've been to the region a bunch and I haven't seen them again but that's not me I don't know what I'm doing failing myself as a concert and\nWhen I'm On the air right we had no one eight hundred three to six to tell you we need twenty three twenty three hundred dollars right\nNow and we only have a we only have eleven minutes interview for a second to do this and one eight hundred three two three nine to six to one eight hundred three two three W. M.\nC. videos on YouTube that capture it a bit if you just put in post modern juice box and watch a bit of something and you'll see like All right yeah Sarah wasn't lying is pretty good at this\nOne eight hundred three two three nine to six you want to read you a three WAMC oh one eight hundred three two three nine to six to mail if the house when we go one eight hundred three to three I Do sort of not really a one eight hundred three two three nine to six to one eight hundred three two three WAMC\nA okay who do we think\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks her health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nAnd Michael is here in New York and to anonymous Worthington, Massachusetts all those pledges coming in on line at WAMC dot ORG one thousand nine hundred and sixty dollars is what we need and we all have had a very", "year": "2018", "show_name": "The Roundtable", "city": "Albany", "day": "15"}