{"month": "10", "state": "NY", "station": "WAMC", "content": "Thanks or engineer Mike bought into our producer Elizabeth\nI'm David boosting the roundtable is next to have a great weekend and if you have a moment put something in the lock\nBox at WAMC dot org we might not even have to ... that way on Monday nine o'clock [noise]\nThis is Northeast Public radio WAMC FM\nHD Ninety point three Albany do what you are you an HD Ninety point three runs in Utica W am cage de Ninety point nine kicked in W. O. S. R. H. D. Ninety One point seven Middletown W. E. E. L. HD Ninety One point nine Plattsburgh WC HD Ninety three point three Kennedy Harry WAMC age do you want a three point nine to ... WAMC\nWhich do you want a five point one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC HD Ninety point when Stanford W ANR eighty eight point by Brewster\nAnd WAMC am fourteen hundred Albany\n... ... ... ... ... ... ... [noise]\nGood morning it's friday the twelve October welcome to the roundtable injured on the on the first half of our show will start off with open discussion of issues in the news and beyond it is around tables out on joining us for the discussion now in charge talk\nDavid soars and drew the second half of our program or in about the Broadway premier of the lifespan of a back\nStarring ... kind of valley Terry Jones and around\nThe world from your production is directed vaguely Silverman she'll traveled are certainly do with Iran plus Alan we'll be back in the congressional corner in our living o'clock hour we will present part four of the six part series that were airing over the next several Fridays before the midterms democracy ... from truth politics and our\nRoundtable begins after the news [noise]\nThis is the b._b._c. news hello I'm Jonathan I thought ... because of told the BBC that they show the Saudi journalist Jamal ... has been murdered and the intelligence service has what they called documentary evidence of this that sounded denied any involvement McLaughlin reports\nOutsource close to the Turkish investigation into Jim ... disappearance techies official line remains that the Saudi journalist is missing but an anchor knows for sure that he was killed\nTurkish intelligence the added had documented evidence of the matter which backs up American reports that turkey has got an audio and video of Mr ... interrogation torture and killing\nEven so turkey has accepted a joint Saudi ... investigation into the case welcoming Saudi officials yeah that's an attempt by ... to tread carefully and its relationship with Riyadh while tightening the screws on the Saudis would the leak of incriminating evidence\nThe U.S treasury secretary says he plans to take part in Saudi investment conference and we are next month's despite the disappearance of Mr Trump day but Steven ... added that the decision might be revised if more information came out his Sebastian Ayesha as Turkish allegations of the states have gymnasts\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nFigure crown prince Mohammed bin Salman is being busted the future investment initiative was to be in another set piece for the crown prince to welcome global business and political leaders that is now in question\nThat potential paints of the ... gift that looks like it will go far deeper than any of the controversial even impetuous mood taken by the crown prince so far the war in Yemen the detention of hundreds of the Saudi elite did not food to recap ration of international political and business ties with the Saudis that this might\nThat is a problem that will be preoccupied with Saudi royal family\nPope Francis has accepted the resignation of an American archbishop who has been accused of mishandling allegations of sexual abuse by Roman Catholic clergy Martin Bashir reports\nCalled no Donald ... resignation stems directly from a grand jury report in Pennsylvania published in August which alleged ... more than three hundred priests in six dioceses had abused around a thousand children [noise]\nCalled in the world who had been the bishop of Pittsburgh was accused of not dealing adequately with allegations within his ... during the Nineteen eighties and nineties though he was not accused of a cover up\nThe pope's letter accepting the resignation said that while the called little could justify his actions\nHe has no ability had let him not to defend himself\nUs so far it has a twelve people now known to have been killed by American Michael one of the strongest storms in the country's history five died in the state of Virginia well seven had already been killed in Florida Georgia and North Carolina that storm toy entire neighborhoods apart leaving thousands of people homeless that is the world news from the BBC\nCourt witnesses in Turkey are reported to withdraw that early a testament as against an American posture accused of supporting terrorism the retractions came at the resumed trial of Andrew Brunson who's spent two years in detention charged with having links to people and crowd regards as terrorist\nHe denies the allegations which could kind of a sudden the five year prison sentence\nThe case has damaged us Turkish relations\nPresident Putin's spokesman said Russia will protect the interests of Russian Orthodox Christians around with Ukraine steps to make the church that independence of months ago\nHe said if there were illegal actions in Ukraine Russia would respond but exclusively by political and diplomatic means on Thursday the acute medical patron saint of Constantinople reaffirmed the decision to allow Ukraine stretched to split from the Moscow by truck I ate\nSomething Russia fiercely oppose is\nIn the Democratic Republic of Congo officials say about the people are missing fed killed and a gold mine after collapse like things that go rescue workers have been sent to help the miners who were cut off about a hundred meters underground near the eastern town of ... ISI Louis ...\nCivil society watching in the mining industry and you see the end it proven that South TV have announced that strategy to mind is had died in a landslide that local authorities are saying they get really two hundred rescue watches and that they're hearing signs of life\nSounds from deep below the ground\nRescue acid started several days off in mind that felt trapped\nOxygen is reportedly available and they've inside didn't shoot down to pitch can given liquid full did Trump to mind is just to live on\nThe world bank has launched a new fund intended to help vulnerable countries cope with natural disasters and crises linked to climate change the one hundred and fifty million dollar global risk financing facility has been set up with money from Germany and Britain that I'm\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n... news support for WAMC comes from a Chico two thousand presenting glimmer glass some days November eight through twelve in Cooperstown curated slate of thirty one films filmmakers talks parties are and hikes more at the glass films dot org\nCary Institute of ecosystem studies milk Newark hosting scientists Jeremy Jackson of Scripps Institution of oceanography discussing his new book brick point reckoning with America's environmental crises October twenty six that seven P. M. C. A. R. Y. Institute dot org\nThe blue marble a world of gifts on north pleasant street in Amherst endorse marketplace at Northampton offering a hand selected collection of jewelry scarves pottery ... art and gifts the blue marble ...\nWestern New England university Springfield, Massachusetts now accepting applications for its master of fine arts and creative writing winter residency information at W. N. E. dot edu slash MSA\nAnd New York oncology hematology offering clinical trials for various stages of breast cancer New York oncology hematology dot com\nIs WAMC News I'm Rae graph a judge has ruled against this missing child sex abuse charges filed against the former a youth camp counselor in upstate New York\nPost are glands falls reports the judge's ruling Thursday means the trial for fifty one year old ... will take place in December or early January soldiers accused of sexually abusing nine boys a branch late camp and Brent lake between two thousand Fifteen on two thousand Eighteen and he has pleaded not guilty\nFive doctor is a pharmacist on three medical assistance of New York I've been charged with illegally prescribing millions of ... bills WAMC Elizabeth ... reports\nThat doctors worked out of offices in Manhattan queens Staten Island and west Chester county indictments unsealed in federal court Thursday say the doctors collected millions of dollars while prescribing ... pills to patients that had no legitimate medical need for that drop\nOff in the patients were drug addicts at the Staten Island doctor's office if Carl Anderson federal prosecutors say crowds of noisy people stood in line at all hours of the night\nSeeking prescriptions for access code on pills sometimes the neighbors had to call the police authorities say several of his patients including two of his employees died of overdoses information on ... lawyer wasn't immediately available\nFor WAMC News I'm Elizabeth him\nThe highest court in Massachusetts has ordered the dismissals of thousands more drug cases because of evidence tampering and a former state lab in Amherst WAMC St Paul's cathedral reports\nThat Supreme judicial court dismissed every methamphetamine related conviction from nine years that former chemist Sonia for rock worked at the lab as well as all cases involving drugs tested by anyone at the lab between two thousand nine to the day for rock was arrested in two thousand Thirteen she pleaded guilty to stealing drug evidence to feed her own habit\nNorthwestern district attorney Dave sell them into the remedy ordered by the court is severe but warranted we're going to move on\nAnd um\nSo we want to get there by the end of our program which is a [noise]\nWill be done at ten thirty so we're going to talk about what's going on in the news but we're also going to try to raise twelve thousand six hundred and eight dollars wow twelve thousand six hundred and eight\nDollars should be doable should be if everybody decides okay with this close let me put a little bit in and get us over the top\nSo I'm whatever you can do to help I mean I'm thinking about appeals that you can make that people could you say okay if you're going and give us a hundred dollars and a fundraiser because you love to fund rather than a lot of people do not give us fifty now fifty like fifty down\nI just need to say that I'm I'm under tremendous pressure right now it's like when my wife and I are going out to dinner and she there's something on the line you know we're meeting a new couple and she's in as in the car don't say anything stupid\nAnd met a lot yeah so now it's like now I'm Everytime I'm thinking of whatever words coming out of my mouth I'm thinking is stupid so with this pressure of raising the money I'm sitting here like a I don't know what to say\nI don't know a couple of things about what'd you just said which I think it was far more revealing than you'd\nProbably want to share our number\nNumber one we saw when I meet your wife [laughter] wonderful lovely greater that we need to do but uh but but no I don't think there's that you don't have to worry about that we're just going to go to just say it was on you\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nSay that no I Know but but again here here let's go back to an earlier reference to just compared to con you you're\nGoing to be oh you're I'm good I'm I'm a I'm going to swell\nHow how anyone who was appalled by Tanya a in the White House yesterday should call and I don't know I ... I don't like\nThat argument okay why I'm not I'm I don't mean your argument I Would say that now I'm not talking I mean the argument about there's people saying about uh the the hypocrisy\nOf a president or bottled putting his feet up on the desk and and a disgrace in the oval office and so forth and and\nOkay and and and but this guy comes in and he he says all kinds of bad words and stuff well All right you're telling me those words never been set in that office before come our life right our early I mean go toward the three words Lyndon Baines Johnson I mean come on\nA so I don't know it seems like we have other things to worry about\nThat look here's the problem with a tiny bit that I mean every star has a right to speak out and if the president wants to help them in the White House fine but the timing could not have been worse I mean there's a big part of this country that is still reeling from hurricane might call\n'em the president's comments on the Washington Post journalists to sadly apparently has been murdered and murdered by the Saudi Government I mean there's ... there's a lot of Syria staff\nGoing on in the country and to see that spectacle and the White House type it in so that he understands\nAre accurate in other words he always knows about this diversion stuff and he knows the Taylor Swift just came out and that the registration numbers have gone through the roof since Taylor Swift ahead her if is any and decided that it was worth under these circumstances doing what she had never done before which is to\nTo basically come out and say that this is so important so then I suspect it's all what you said and everything else it all comes together and he is of course ...\nMentioned you're sitting in Florida and you just last year how yes of course well\nUh we're going to begin with that story I just want to ah quickly remind you we have a thousand dollars on the table we need to make it twelve thousand four hundred and fifty dollars in the next hour and seven minutes uh this is to get us to our goal\nFor the walk box and then we can take a breath although you know stuff that puppy over the weekend\nAnd uh and will be ready to go on Monday morning and what is it what does it tell them to work for one eight hundred three two three nine to six to let me check I have a tattooed on the inside of my or\nOne eight hundred three two three night not so because I'll forget so I can show their pay is right yeah I\nJust say well we're always we're always criticized for but who are you get a phone number and halfway through the phone number you trail off you go and do something else\nOne eight hundred three two three nine to six to one eight hundred three two three W. A. M. C. 'cause I had to pull up my sleeves to see the rest and I also would like to add that Joe is not going to be stuffing any puppies\n[laughter] you can sit sat Libyan out to be a good thing and but if you're an animal\nThat has a call ... ... on the other hand Roy Rogers\nDid stuff trigger does you know that oh yeah yeah that's right road ... leader and he had them stuff ... taxidermy a dying art\nOne in three two three ... New York city six to one eight hundred three two three WAMC texted\nTheir tax oh there was a third yeah\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWe yeah this is kind of a moment right next to where the money you can call in or the terrible jokes can one eight hundred and three ... three Ninety two WAMC to orgy WAMC dot org ... have you on tickets to the Capitol Steps or we have we have\nA hand forty a left or we also um two of the of our panelists are sitting right here both a Judas and David are going to be part of our opposed midterm election or we're going to be discussing the [noise]\nThe results of the midterm elections um will we be wearing red or black\nWe don't know [laughter] we don't know do we will we have been up the entire night well we will yes we are in we'll see what happens it's going to be awake or party right off the rails appropriate suspense\nSo we uh we have over here right Joe the night before so you can only imagine what we're going to be like the next day you will be will be in good shape although I always like that 'cause I get to watch uh it's one of the few times I get to see how many chicken wings [laughter]\nBecause I Know I Know yeah and that's one\nEight hundred three two three nine to six to one eight hundred three do three W. A. M. C. one eight hundred three two three nine to six to WAMC that orange juice\nSpeaking of the day after election panel into Linda today is her last day for people in New York to riches status right so if you haven't registered of course New York doesn't make it easy there's no online registration but you can print out your your voter registration form\nMail it in today as long as it's post Marc counting the votes doses as you got to bring it to the post office or go right to the board of elections and then also says he got college kids you know or or also if you're going to be a way\nOn election day you've got a request your absentee ballot or you know and so because that's a two step process and when did\nThey need to absentee ballots you need to get them by a certain time and then you have to return them\nBut yeah you have to fill out an application to get it approved that gets mailed in and then they mail you a ballot and then it has to be risk posts marked by election day to specially parents with kids in college who are planning to vote in the mid term but don't\nRemember they may need an absentee ballot today took a day to focus on it and run it and then if you are not registered at all if got registered today in New York\nI don't want to get it wrong but it seems to me I can go to the great Barrington town hall and just stand there and get a absentee ballot if you're a registered voter you can do that in ... Massachusetts yeah which is\nMaybe different well in New York surgeon you can I think physically go to the county board of elections fill out the application I get by on and get your ballot anyway but you've got to physically go there yeah no I think the same thing I'm as\nWell um whatever it takes a go and figure it out of your it out and and if you're if you're not registered also if you have any questions I'm meaning\nI haven't voted in twelve years or haven't voted in sixteen years or I think um I think I Am a registered but I don't know that I'm registered sure today's the day to figure that right and to make a very simple phone call right that will help you\nKnow they're very helpful at the county board of elections so not your town hall in New York but the county board of elections ...\nUh and I know you're right I ... I had a recent I say reasons for about a year and a half ago but I called up and I left a message and they go back to me and like half hour and said here\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThree nine to six to to help us support WAMC for our October two thousand Eighteen fund drive it officially begins at six am on Monday morning\nAlan and re will take over the airwaves and we will start a great track forward but what ever we make now is less than we have to make them the other side we set a goal or five hundred thousand dollars to be in the lock box by the time we started to drive in right now we are twelve thousand thirty dollars away from that coal\nWhich is not good I'll tell you right now because we have only an hour to make this and\nI think I I think we're going to do it and I and I just have seen you feel and sex so hopeless and upset and I'm you know I think we're going to do it\nI get well that's very nice nice of you David but you know\nYou don't look at the opposite of well we only have about a minute but look at the optimism that that uh that I'm totally making trouble now look at the optimism that you'd have had that Susan Collins which is the right thing [laughter]\nI think of anything but that I'm\nAll right so you make a point a we're uh we're nine\nThousand uh nine thousand and I heard and\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n... three do three WAMC Allen go to the letters and then we'll go to topics to Judith\nThis is a letter to Judith from Susan how can we started campaign for individual families across the nation to quote adopt the water bill for a family in Flint to end this criminal and cruel practice of turning off water in a home\n[noise] yeah that's a brilliant idea I don't know if it's if it's going on now but um [noise] there are a lot of groups in Flint community groups working on this and we can look into it also just the mayor's office in Flint\nIs Sam is on the matter that yeah yeah mayor Weaver and she has a point at some of the public health experts um [noise] um we've got a long way to go in Flint I liked the idea lot think his isn't and Tim says on\nClimate change the loving panel always starts with the loving pal thinks that that's the way to get your rent let her read\nIn the ... already I've yeah me and below that I'm waiting for the slap upside the head but go ahead as mine was about variants as Michael\nIs about to slam into Florida Trump mocked the latest IPC Ninety report an added nation Intergovernmental Panel on climate change and co ain't coherently as being of a fabulous\nOr in the wake of the devastation he responded by having kind of in the oval office showing the same lack of empathy for tragedy as he did winning her paper towels at the people of Puerto Rico I Am bone weary of this uncaring entitled man best Tim\nI'm voting in honor of Judas and are valued narrative on the climate crisis that's very nice\nUh okay and ... that is nice and Ernie climate change crisis into opportunity right\nWe have really two very brilliant people I mean I Know that I'm a wise guy but we have two very brilliant people in this room right now in addition to Joe and that is\n[laughter] and that is I ... and that is of\nCourse a brilliant district attorney and a brilliant person on a climate and we are so fortunate to have both of you in this with us\nBut you know let me just expand on it for a second if you're going to give money or for it to this radio station I mean just think of what the pedal that David given up um I mean I mean if you if you were working this time what would you get like thirty forty bucks so much or would they be [laughter]\nIf you're not you're not getting a lawyer money you're getting the you're going to be a money\nDunkin' Donuts a cup of coffee [laughter] on the phone call with them on chicken right on and and your ...\nAnd ... you worked for the federal government for the state government for and and then non profits for how many years so you know seven minimum wage and you're and you're here and you're doing this and and we just uh neither one of you or you know we are doing it out of the love of and the importance of it and we thank\n... and so people should know that and support that yes you especially now in these times when you have the news cycle shifting from second to secular means you started off to a conversation with ... with a very important point\nWe have tragedy occurring right now as a result of Mother Nature in the state of Florida are state of Florida part of the United states we have crisis in Michigan or where there's families like human beings Americans turning on their water faucet and being poisoned right\nAnd and this is on the heels of people in Puerto Rico who still haven't they they have not um\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu part of the United states\nAnd David if I can interrupt for one second and I want to add to your list we have a farm bill which can't pass because some people an okay the Republicans don't want 'em the kids to be able to have a free lunch or to have um ... what do you call that snap 'em a privilege um\nSo okay you don't want to punish the parents it's terrible thing and it shouldn't be done but\nBut the kids I mean what kind of the blue many can you be\nIn there and and there's about twenty other issues they they showed a a photo of the other day a video of of um of a\nTwo and a half year old you know in a courtroom in the United states of America\nAre undergoing a an immigration proceeding\nThe United states of America and and my point to all of this has to say that while you tune in uh on your television and you're being bounce from store to store\nAnd people like Kanye West is high jacking you know the entire ... uh news media for a day it's WAMC that keeps the focus on these important issues and these are the issues that matter ... cognac does not matter\nBut but water crisis you know ... a natural disasters matter and you and you folks I'm so appreciative WAMC because you folks keep people focused on the issue\nYeah well I I I Want to thank you for that because I certainly love hearing you say that uh but I also want to say that you know we we have how much to go\nA nine thousand one hundred and Seventy two dollars\nSo any I knew when people get into a phone right now and and and saying Okay David you make a good point Judith makes a good point we have these two brilliant people who are sitting with us on a on a panel today\nAnd we are very lucky to have them and it shows what our values are so come on everybody let's just do this and let's get it done I'm scared we we we have\nWe need to get this done a good morning panel says Keith I avoided all of the ... coverage yesterday was meaningless and is a shiny object to distress is the public\nAnd there are still children separated by their parents by this administration that's in capital letters it's a crime against humanity and so they roll out ... to distract us now they're building a ten thousand person camp in the ... desert to has these children and\nAnd the funding and the funding for for those facilities is coming out of a FEMA budget right and and right now we need more money in ... I mean first of all we're dealing with the current crisis right now\nAnd we haven't even looked back at it attacks us to see whether or not we are fully recovered from the Houston\nI'm the damage that was done to Houston I'm fine and in North Carolina so if you're taking money away from the very pot right that is that is a required to help people get back on their feet\n... what's going to happen when the next film a natural disaster visits upon us which you know it's going to be there\nSo I wanted to ask you something David uh with uh even though we're in the middle of this ah when your expertise here today\nWe are hearing now is that Mahler this really scares the hell out of me that Mueller has agreed to let the president answer or the president's lawyers we should better better say answer in writing rather than being interviewed\nA on all of this what do you think that portends well if that's true it is because um\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nFirst of all if you're Bob Mueller and you're you're doing the kind of investigation that has been consistent with\nBob mother you have figured everything out you're never going to talk to a suspect unless you know everything about the subject matter that you're going to be asking\nThat suspect um those questions on so if he's going to be allowing or the president to respond in writing it to me it signaled it signals the fact that he's got everything he needs and now he just needs to hear from the president before he finally\nEither authors report or begins a indicting more peace\nSo from the half empty guy I raised the issue of the other day Rosenstein went into the White House and talk to the president went out to president puts his arm around them and says he's my man he can stay\nAnd at that moment I got really scared because I worry what Rosenstein had assured the president of that would allow him\nTo um to do that and to say Rosenstein could stay\nI don't know what he told them Muller I don't know what he told them about what was what what what would happen with him I don't know if this was the subject of okay we've gotten this it can be in writing as opposed to being on on the hook I'm I'm really concerned about what that put tended\nI think you have to sit on the other side of the chessboard with that one and say okay well what a ... Rosenstein went into that office and said you know\nA ... I think your and I think your problem or a we have investigation we're focusing in on what what do you think that would happen she would be fired and they would begin the dismantling of the mother operation\nAnd so to me ... playing it like he did he played it consistently with what a professional\nMember of law enforcement will do you go in understanding what all of the possible outcomes could be and you play it in a way that enables people to continue to work and that's what they're doing and it'll sound good on the wire is wearing [laughter]\nAnd they also he the also you know from that conversation ... ... you don't know what little bits of evidence he too was able to gather from that from that interaction\nTo take what I think the key to this hum as we want to make sure that you have any well right but it lasts today's the last day regardless and if you have any questions contact your county board of elections and that's a New York and in another important\nPoint is college students can vote in the community where they go to school oh yeah and that was a great thing judge Neil my current he ran for Congress they wouldn't let the kids vote he lost he becomes a federal judge he says kids are allowed to vote\nThat's where you live when you go to college in fact you live in your college community if you go to SUNY Albany if you go to the College of saint rose got off and he taught school you can register and Albany county Allen if\nYour if your story there is correct and there should that history should be repeated we should all be afraid given the red wave and the judiciary current\nOh yeah it was All right uh we're going to take a break we have about a well we have exactly one half hour or two ... worth four thousand nine hundred and sixty dollars worth out oh yeah oh my God I'm\nForty three sixty a month and hard publications re re graph do you think will make it\nNo no he doesn't uh are you worried are you worried art or ... yeah All right uh we have a thousand dollars on the table where we need to make four thousand three hundred and sixty eight dollars Allen charge out due to the bank and David stores in the house\nWe welcome your phone calls you know what we can do this by the time we get back from news of everybody just show great grass that's how that's just show I'm sure that's right one eight hundred very do three nine six two ah so what we'll do it by the time right comes back right make it along these guys that will be evaluated address\nSupport for WAMC comes from agricultural stewardship association helping people consider farmland in the upper Hudson Valley we can serve good farmland for good forever AG stewardship dot org\nFirst feel and propane providing automatic delivery equipment rental and surface calls from Dutchess County to lake George our family has your family covered first fuel and propane dot com\nAnd mess match for over sixteen years a locally owned dating and matchmaking service connecting singles through private matchmaking in western Massachusetts and beyond mass match dot com\nIs Northeast Public radio WAMC if that makes the Ninety point three Albany W\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWell that's our age the Ninety One seven Middletown double UCLA HD Ninety One Ninety ... Ninety three three ... W. A. N. C. H. T. one at three\nNine taekwondo rogue WAMC wage do you want to five one great Barrington W W E S H da da na na na Kisco W. A. N. D. H. D. Ninety point one Stanford W a and R eight eight five Brewster and WAMC am fourteen hundred Albany\nSupport for WAMC comes from the Albany whiskey riot festival Sunday October twenty eight at the Desmond in Albany featuring over Ninety whiskey types available for sampling ticket information at whiskey riot festival dot com\nClear yoga right back working to help develop strength stamina flexibility and peace of mind to the practice of a young guy yoga classes for all abilities seven days a week clear you'll go right back dot com\nAnd fed him or art museum on the lake in Cooperstown presenting tons of school and the garden of Eden sixteen original early works featuring ... masterpiece expulsion from the garden of Eden fend them are are dot org\nIt's WAMC news I regret Virginia authorities are providing more details about the death of a fire fighter who was responding to a crash north of Richmond\nAs tropical storm Michael last the state the Hanover county fire department says lieutenant Brad Clark died at the scene when a tractor trailer struck his fire engine while he responded to a to vehicle crash during the storm Thursday night\nTo others on Clark's team were seriously injured as well as the truck driver\nPope Francis has accepted the resignation of Washington cardinal Donald Wuerl after he became an tangled into major sexual abuse and cover ups scandals I've lost the support of many and his flock\nBut in a letter released by worlds office Francis asked his longtime ally to stay on temporarily had suggested world had unfairly become a scapegoat having made some quote mistakes in handling sexual abuse cases but not having covered them up\nToday is the last day to register to vote in New York for the November election as Governor Cuomo was warning about voting registration scam report it into upstate counties WAMC Elizabeth ... reports\nThe Democrats office says residents in among and Ben county had received calls and text messages from someone offering to register down over the phone if they provide personal information that cause come from a number in the success that an area code\nNew York does not allow voter registration by phone and officials say anyone receiving similar cause should report them immediately Cuomo urged New Yorkers interested in registering to vote to use the state's registration website WWW dot elections that and why that does\nFor WAMC News I'm Elizabeth hill\nFive doctors a pharmacist on three medical assistance in New York I've been charged with illegally prescribing millions of oxygen coat on pills\nThe doctor has worked out of offices in Manhattan queens Staten Island on Westchester County indictments unsealed in federal court Thursday say the doctors collected millions of dollars while prescribing actually coat on bills do patients that had no legitimate medical need for the drug\nOften the patients were drug addicts\nA third Massachusetts state police trooper has pleaded guilty to getting paid for overtime shift seeded either not work or complete federal prosecutors say forty five year old Gary Herman of Chester pleaded guilty Thursday to embezzlement from an agency receiving federal funds\nUnder a plea deal Herman faces six to twelve months in prison at sentencing on January seventeenth\nProsecutors say he earned nearly two hundred twenty eight thousand dollars in two thousand sixteen including more than sixty three thousand dollars in overtime pay about twelve thousand of that was fraudulent plea obtained on Wall street to you\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nForty five thousand for fourteen NASDAQ up one sixty two seven thousand four Ninety One\nWe should see a mixed up saw an ad clouds today it will be breezy cooler hide around sixty late this morning but the temperatures will drop this afternoon mostly cloudy a chance of showers overnight in the forties cloudy rain early tomorrow bend mostly cloudy high all the and the lower fifty at last report mostly cloudy fifty six in Worcester mass\nCloudy and fifty three in Burlington, Vermont partly cloudy fifty four and middle ground York cloudy skies fifty five degrees in Albany one WAMC music Noone would Brian ... day magazine\nSupport for WAMC comes from the hearing meals one Thirteen ever wrote colony chef designed and freshly prepared healthy meals and Hudson new storefront with grab and go meals suits and deserts the healing meals dot com\nStories nursery for a whole New York featuring a variety of moms Trump's entries for for planting and bolts for spring open Monday through Saturday eight to five and Sundays nine to for a gardeners destination stories nursery dot com\nInteractive media consulting a team of online market strategist providing websites branding and digital marketing to the capital region and beyond since Nineteen Ninety six I media consulted dot com\nAlbany probably ... percent ... Bach bliss featuring acronym baroque string ensemble and the boy course stirs up the cathedral of all saints October twenty first at Troy sitting back musical Albany ... dot org\nAnd least elects passage scenic highway supporting the north country underground railroad historical associations mini bus tour on October twenty at at the north star underground railroad museum passage port dot org I Love New York [noise]\n\n\n\nOh Mississippi he they're gonna be blamed Melinda tonight WAMC performing arts video the window dot O. R. G. good morning welcome back to the roundtable Ellen chart talked Judah bank and David Sowers while you were away a we while you were listening to the news with Greg Graffin we were sitting in here bemoaning the state of our world\nAnd you know like normal and uh we have a we need twenty five hundred dollars over twenty five hundred hours we have twenty minutes to do it in ... and oh boy and we have\nWhat we have a thousand dollars a challenge for a thousand dollars now\nMy heart no we don't want anything to happen to your heart well why not just what we need you we we need your\nYour the thing you would they be your [laughter] also use like Syria without the meltdown\nLike they should be a ... it's like a a wish without ... which\nShow that took a tour Mary [laughter] wired environmental man who is there a few Stevie like official that toxic chemicals that [laughter] oh what are we going to say\nOr what but you know it's like you know the dark tower like our towers are great beacon\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThat's all that's on right so Alan for how many years forty how many years I don't know I got\nYou know if if you don't care about the the morality of it you know than three thousand lives lost in Puerto Rico I'm focused on the economic impact I mean you look at the Florida Panhandle some of those communities are completely wiped out they're not going to ... for years so\nI think the insurance industry could speak out more forcefully they need to get in the game in Congress and in state legislatures but they are so many are saying the right now\nYou know I'm not a big fan of the insurance who is and I have to say I watch the ads in the middle of the night when I get up to come to W. um and they always have somebody standing in front of the statue of liberty\nThat's my favorite yeah when the when the when the husband and wife she forgiveness [laughter] yeah if they understand forget it as ...\nOr ... or what your um we will not penalize you for you\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOkay so so I'm not a big fan of the insurance industry and one of the things it seems to me ... and you can comment on is is do they have to sell you flood insurance for example\nNow they don't have to when there's a real risk the insurance industry as we know what it's going to collapse because of the impacts of climate change and then you've got the whole flood insurance issue they don't have to sell\nAnd if they do it in the sense that really really expensive and then you have the federal government paying to rebuild on barrier islands for instance that are repeatedly wiped out Adler storm I was raised in the St Louis Sharon the insurance industry has a real important role to play here\nRelated to climate change is a dramatic increase in the use of um gas and oil and the protection of plastics there um that's where the petrochemical industry is shifting and I just want to quickly mention\nLeaving my water bottle fit no water bottle which she says she's looking at me me on\nDavid come this Thursday to Bennington College I Will be giving a lecture on we're turning our um our oceans into landfills and the growing problem\nOf plastic police what do you mean an earnings are we are turning over towards turning our oceans ... into landfills because of all the plastic pollution and there is an enormous climate change implication because of the massive amount of today ... gas used to produce\nPlastic packaging so that's a Bennington College this Thursday night at seven o'clock free and open to the public at the center for the advancement of public action Joe thanks for having my\nBennington colleague a college colleagues on suits and ... there were no Brian I kept the end where I'm really pleased to be able to talk about the lectures seriously horrific\nAnd through work and they're doing and that that is is driven in there but obviously I'm is important no matter where you're from [noise]\nWe uh we just have a few moments and we're going to go to some letters but we need you so uh last call for the lock box please please please please please one eight hundred three two three nine to six to WAMC dot O. R. G. WAMC dot or\nIf you know Joe I was thinking about something else I'm\nAs you know the Turks ex um it took a shows people were saying that this guy had been cussing you had been killed in the yard and murdered in the place and first was they were pretty short happen there now they say they have actual audio tapes of this rumor going down\nSo one has to assume right that they've always bugs [laughter] every embassy as\nThe bugs that ... and anti right from the beginning of ... ... there's the the embassy in a in a Russia that the United states said paid a tremendous amount of running to turn to build and I'm ... three quarters of the way through the project they found bugging devices in the cement literally\nWithin ... before it was one of them do that a member of the ... but remember this is a high profile journalist with the Washington Post to mostly lived in Virginia and the Saudi Government felt that they they could do this and and get away with\nThat now Bolton says he was just on CNN saying if I read it right um you know we didn't we don't know yet is yeah you know and I know about this you know and\nBut if I met him possible I find that impossible and I also find a dangerous the boat and would take such an aggressive position going out and saying that he was told when ... when this administration has been undermining their own\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOrganization Gleick it I mean it's just a matter of time okay so we heard from Eileen said hello panel recently visited my son who moved to Denver, Colorado there I learned that people vote by mail\nI had no idea apparently they're twenty states nationwide who have the system what do you think we don't all vote the way New York eradicate the need for traveling a polling place taking time from work or other obligations make music festival for every one someone told me there's digital voting in Estonia Estonia\nHow and why do you think that the U.S is still behind in this regard well you're young you know why are there is also eligible to vote and there's also interest in making the election day a national holiday or\nWhat a terrible idea that is imagine yeah patriot paint that was ... and by the way John you know because there's always somebody who thinks okay we have half a minute I don't I haven't been OK voting says John Democrats in New York with the voting will not make a difference remember that if Mueller's fired\nA prosecuting attorney Trump will depend on a new democratic New York attorney general George I edit after she checks in with the governor who is our sponsor\nAll right we are at a time ladies and gentlemen my thanks to all of you are the great news is that we made it\nA happy I Know it's still I still look alike worried but I ... I ... I had the singing but but I ... a ... okay but I Will say and lift on the banjo\nIn ten seconds I Will say that that means or in the entire WAMC fund drive we have four thousand nine hundred and sixty six or Ninety six thousand six hundred and Seventy eight bottles of beer on the wall that's right ah we'll see you Monday morning he went after this\n[noise]\n... the and smart because if you're gonna freak out about them at least freak out about the right thing\nFrom American public media this is marketplace sack demystify the digital economy em Ali would [noise]\nMarketplace supported by Amazon Web services over a million customers use ... to functionality and experience to dream big unveiled fast\n[noise] learn more at age ... dot com and my carpet night offering data protection solutions for businesses including automatic back up for servers and point protection higher veil ability and disaster recovery and data migration learn more in common I dot com [noise]\nIn just the last week Facebook and Google\nBoth announced a new smart speakers with video screens and Amazon as heck bent on putting elected in everything now on the one hand people seem to want these do heck he's research firm can Alice says global smart speaker sales grew one hundred and eighty seven percent in the second quarter of this year\nOn the other hand and always on always connected listening devices home with a video screen or camera I've really freaks some people out\nSo let's dig into this and quality assurance that segment where we take a deeper look at a big tech story ... in the hosted the pod cast daily tech news show he said before you decide whether to worry about smart speakers you should know what you're worried about\nKind of the new the CIA is listening into my telephone I mean we all had Mike's in our house with telephones a long time ago and there were misperceptions about what could actually be done or even if it could be done how often it was done\nUh it's pretty well audited that these things are only listening for the wake word and not sending things to the cloud I think there's a lot of worry about the wrong things would be smart speakers you should be aware of what it is collecting\nBut on the other hand I don't think that you need\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd the conversation is fundamentally about this trust thing and it's hard to say yes they're gathering data about you and you don't need to worry about it\nI think it's all about knowing what they're collecting and knowing what they're using it for I think that's where the truck got lost his people didn't realize it was being collected and what it was being used for people voluntarily let Nielsen collected information about them all the time because they go in with eyes wide open I'm going to get this benefit in exchange for giving them\nThat knowledge and I think that's the situation you need to adjust yourself to his what benefit am I getting by doing this I'm able to turn the lights off in my house with the speaking of a word is that okay in exchange for Amazon going oh this person as smart light for the next time I go to Amazon dot com I'm going to show them some suggestions for that\nKind of product we're kind of like guinea pigs I think at this point for all the technology that's being thrown at us and part of the reason people feel skeptical that this is new in its were the first generation I think you could argue that really are having to wrestle with these questions about privacy can we even really understand the longer term consequences of the decisions were making today\nNo I I think that's a good point is that nobody knows these companies don't know what the consequences of their collection are uh I think in large part they are doing it out of a profit motivation or it's not necessarily for your good but I don't think they have an evil intent or either\nIt's been a moral intent for a large part and I don't know that they knew what the consequences were and a lot of this backlash is a surprise to them or because they drank their own Kool Aid and thought yes but you're getting this great free service that we're providing why would you be upset with the little data collection\nThey um brought the project to Daniel and it's been exciting to continue to to work on that original vision and to then shape and mold that as you do and all new place to the three extraordinary performance as part of it\nAs we're speaking you are in previews one of the audience response been and how much is the show Jill changing\nWhat we're putting in a couple of new lines today we have some we have a kind of a new technical element that is being adjusted today [noise] I like to use my time in my personal during previews very rigorously um we really take the information we're getting from the audience um about\nBoth what's funny what's working what's not working I think it's really important as the director to use these previews to take an honest and rigorous look at what the material is and continue to to work on it and the great thing about\nThese reactors is that they are um so game for changes we throw at them and I'm using to explore it's been a very exciting process of making the play and they love\nBeing in rehearsal [laughter] so it's been a it's been it's been really exciting to work on\nWhat feedback you get from the audience in previous\nOh I mean\nIt's been thrilling I mean it's been really thrilling I think people find it incredibly funny I'm very very entertaining and hopefully quite moving at the end and and thought provoking I think it it has the structure of the play is\nI'm successful in the both the set up and the pay off of the three characters and because the the plays a polemic it's an argument about this subject which is how do you tell this story the vast\nAnd really we just circle that question over and over again the question gets deeper and more complicated and more confusing and more hilarious as we take the subject more and more and more seriously and and so it's a it's quite a\nThrilling ride 'em ultimately and I think people are surprised about where it goes and how deep that goes\nThe play is running on Broadway in Studio fifty four through January Thirteen that's strictly limited engagement de do like having an end of the run or does that make a difference to you as you prepare\nOh that's such an interesting question you know for director basically our job is over opening night you kind of work yourself out of a job [laughter] in a way you go from being at the beginning of a process the person who knows the most information\nYou know uh how the design is going to look and function you know where you want the\nPerformances to go you want you know where you want the script to go you know what changes you want to implement you have all that information and you're headed by the time you get to opening you're kind of know the least I don't know what's happening backstage I'm not sure how things how the magic is happening every night\nUm the the performances are they know more about their characters and how they work and how they function on a day to day basis than I Do and so I feel uh probably something like parenting which is that you feel quite happy and relieved that the show is out in the world and also\nI'm a little a little sad that you're no longer required um\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot EDU\nIn terms of an end date I think it just um it it feels like a this it makes this really feel like a a happening because there's a very limited amount of time to see these three people do this incredible thing every night and\nUm I I think an end date only makes that ah that much more important that people not the law\nYou mentioned working yourself out of a job and I know that you are deeply involved in this right now do you know what is next\nYes I Am doing a play at the public theater called wild goose dreams which is a co production with the look quite a play house with the play I did last year in ...\nAnd we start previews in New York that the public theater at the end of October I Believe um Halloween is actually our first preview and that'll run through mid December at the public theater I jumped right into 'em right into the next\nWhen you directed something a little boy and then it it comes to New York or when you direct something more generally one place and then it goes away for a little while and then comes back somewhere else how do you work on it how do you ... how to reopen the book when you begin mounting it again\nOh I feel so grateful for opportunities to do shows the second time I'm always when you're working in theater it's like you're groping around in the dark trying to find the best way to tell a story that most of the actual go away the most surprising way the most engrossing way\nUm and and so it takes it takes a long time particularly a new place where you don't know what the and target is\nAnd I frequently feel like it's like archery at night in the dorm with no lights my shift like sort of like you're shooting hoping for our target\nAnd when you're lucky enough to get even close to that and have the opportunity to do the show a second time and you know where you're headed you're able to make a whole different set of choices and I think\nIf you feel nimble and often adventurous enough you can really really look at the whole process and in this case um of wild goose dreams the we have a a almost entirely different\nUm design team nine out of the ten actors are different with a it's a really grand new production in a in a brand new look at a piece that I've been\nIn development on for many years and have 'em so I feel very close to it and at the same time it feels brand new which I I I like that feeling very much which is that I Know where we're headed and simultaneously I'm Still and full of questions\nAbout how to get that you just mentioned the design team do you as a director have an input with whoever is producing whatever show you're directing on the design team do you get to pick who your work with on that element of the peace\nYes the design team is entirely on my decision there certainly I collaborate with theaters and producers about people that they like and I'm interested in\nUm I'm very proud of the fact that in life span of a fact we have the first all female design team on Broadway that's actually never happened before are set designer lighting designer costume designer projection designer they're all sound designer they're all female\nWhich I I couldn't believe it when I found out that we were the person I felt like in twenty Eighteen that had to have happened before but but\nWell I'm very proud of that I actually picked them because I was excited to nine meld with them on this play not because I thought it was going to be historic\nSo that is really something that I'm very proud of and excited about and yes you know that the designers that I take frequently I'm looking for like with actors I'm looking for people who have the right chemistry together\nWho style on a static feels right for the play\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nPartners they are the people that I actually bring to the plate you before you get involved how we're going to tell the story what it's going to look like and feel like sound like\nAll of those decisions get made before we even get into the room with the actress so might designers are are deep collaborators and um and I've\nHad that great of working with um some some incredible designer so that actually truly changed in shape the way that that shows that I've tried to get done\nThe lifespan of a fact is currently in preview that studio fifty four on Broadway starring Daniel Ratcliffe Jerry Jones and Bobby kinda valley it opens on October Eighteenth and it's directed by our guest Lisa Silverman links to more information are posted along with this interview at WAMC dot org slash roundtable\nSupport for WAMC ... Paul Smith's college the College of the ... where a fourteen thousand acres big site wilderness is the campus offering a hands on approach to career oriented education Paul Smith dot edu\nNon cake Stockbridge mess with the ... Republican trail a pumpkin blazed walk through the gardens featuring woodland creatures along the way Fridays and Saturdays through October thirteenth\nThey'll they Ga land conservancy Bolton landing New York celebrating Thirty years of protecting the land that protects the lake offering more than thirty five miles of trails for hiking burning and outdoor exploration el G. L. C. dot org\nAnd Warwick valley farmers market the twenty fifth season of bringing fresh from the farm food ready for the table weekly new foods from artist and vendors on Sundays nine AM to two PM ... valley farmers market dot org\n[noise]\n\nYou're listening to Johann Sebastian Bach first published a piece and you're on the sound [noise]\n\nThis version of Archie the number one in B flat major was recorded by Walter nice looking in Nineteen fifty it's perhaps ironic that box compositions are celebrated worldwide in his entire life and never street more than two hundred miles from his birthplace of ISIS died Germany [noise]\nBut his influence has been felt all over the globe and through every generation sense Bach translates literally as broke as Beethoven put his name should not be broken by the ocean\nJohann Sebastian there than\nWant to hear some more classical themed episodes go to sound beat dot org and type logical in search borrow\nThis is Northeast Public radio WAMC FM HD Ninety play three Albany\nW are you in ... three rooms in Utica W. A. M. K. E. H. D. nine point nine Kingston W. O. R. H. D. Ninety One seven Middletown WC el ... Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry W. N. C. H. D. one oh three point nine ... W ... five one great Benton\nW. W. E. S. H. D. eighty eight point nine mount Kisco W. A. N. D. H. D. Ninety point one Stanford W a an eighty eight points by Brewster and WAMC am fourteen hundred Albany [noise]\nFrom truth politics in power I come and I had to talk for just with the democracy town [noise]\nConsented to govern how voting rights expanded from white male landowners that techniques to depressed and manipulate the electric Carolyn Emery university\nClosing voting home in minority neighborhoods shortening early voting hours reducing early voting site purging voter rolls eliminating people who have registered to vote but haven't made it on the rolls yet\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nDark money how the infusion of unlimited anonymous funding corrosive democracy and if I just stopped the democracy right after\n\nThis is the b._b._c. news hello I'm Jonathan eyes out and American evangelical pasta has been freed by coat in Turkey despite being convicted on terrorism charges Andrew Brunson was sentenced to three of them one month in prison but we'll be freed as he's already spent two years in custody pending a behind it has more details\nThe release of Andrew Brunson removes the key obstacle to repairing relations between these two NATO allies he'd been accused of links to groups turkey sees as terrorist\nMr Brunson denied the charges President Trump and made the release of evangelical pasta a master of national pride\nIt sets up a clash with Turkey's nationalist presidents ratchet type Edwin but turkey ended up them all bruised economically Mr Edwin has always for trained the independence of Turkey's judiciary whether influenced by external factors are notes today's verdict is undoubtedly politically expedient\nTook his soldiers have told the BBC that show all the Saudi journalist amongst the show has been murdered and that their intelligence service has what they called documentary evidence of this without is denied any involvement might slow and is in Istanbul\nOutsource close to the Turkish investigation into Jamal casualties disappearance techies official line remains that the Saudi journalist is missing by the anchor knows for sure that he was killed\nTurkish intelligence the added had documented evidence of the matter which backs up American reports that turkey has gathered audio and video of Mr ... interrogation torture and killing\nEven so turkey has accepted a joint Saudi package investigation into the case welcoming Saudi officials yeah that's an attempt by Ankara to tread carefully and its relationship with Riyadh well tightening the screws on the Saudis would the leak of incriminating evidence\nThe U.S treasury secretary says he plans to take Boston a Saudi investment conference despite the disappearance of this to construct gee but Steve mission added that the decision might be river revised if more information came out the disappearance of the Saudi journalist has led to a number of news organizations such as CNN Financial Times to withdraw from the conference\nPope Francis has accepted the resignation of American archbishop who's been accused of mishandling allegations of sexual abuse by Roman Catholic country however and it is a fast correspondent Martin Bashir reports\nCardinal Donald wills resignation stems directly from a grand jury report in Pennsylvania published in August which alleged ... more than three hundred priests in six dioceses had abused around a thousand children\nCalled in the world who had been the bishop of Pittsburgh was accused of not dealing adequately with allegations within his ... during the Nineteen eighties and nineties though he was known to accused of a cover up\nThe pope's letter accepting the resignation said that while the called ... could justify his actions\nHe has no ability had led him not to defend himself\nThis is the world news from the BBC\nThe Malaysian prime minister says he believes some people within his own government sabotaging effort to arrest the fugitive businessmen Joe low multi Mohammed told local reporter that he believes in his leg was in hiding but somebody had been informing him of the Malaysian authorities efforts to find him\nHe cited one incident in which he said lazy unofficial had gone to Hong Kong to arrest or low but he managed to invade them\nThe businessman has wanted in connection with billions missing from\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nPeople that are known to have been killed by American Michael one of the strongest storms in the country's history five died in Virginia well seven had already been killed in Florida Georgia and North Carolina\nThat storm toy entire neighborhoods apart leaving thousands of people homeless and the houses flattened the head of the federal emergency management agency Brock Long said all I Do is we're focused on trying to bring affected communities back to normal\nCategory for storms spring or the worst type of devastation that you've seen we've seen the worst of the storm surge machine worst of the ways and not only that but it move inland and it caused a lot of flash flooding problems loss of life all the way through Virginia\nIt takes time to put these things back together and help you know community strive for a new normal though we're doing everything that we possibly can to move as quickly as we can see\nThe world bank has launched a new fund intended to help vulnerable countries to cope with natural disaster them crises linked to climate change the one hundred and fifty million dollar global risk financing facility has been set up with money from Germany and Britain that banks has its aim is to provide quick and reliable funding\nThe nuts administrators says he's confident ashamed to admission by a Soyuz rocket to the international space station will go ahead and December as planned Jim frightened Stein was speaking in Moscow a day off to the flight to the Russian and an American to the eye SS was dramatically aborted just minutes off to lift off\nHe said yesterday Spanish or the importance of having more than one way of getting humans into space BBC News\nThis is the democracy test Trump truth politics and power I'm Neal Conan\nAnd I'm headed Cox Richardson election to the central mechanism of democracy in theory it works because the people decide on candidates ballot issues and so on his elections that give governments their mandate and their legitimacy\nBut there is an important distinction here the way it actually works out it's not the people who decide its voters\nAnd those can be two very different groups\nAt the establishment of the republic voters included only white male landowners obviously the right to vote the franchise has expanded considerably over the years but the history of American politics is a story of this in franchise meant as well systematic and deliberate exclusions that continue to the present day\nCarolyn Anderson is a professor of African American studies at Emory University her books include white rage and most recently one person no vote how voter suppression is destroying our democracy\nShe joined us from a conference room there at Emory welcome to the democracy test Carol\nI thank you so much for having me have to look at history in a minute but you described for women I remember the whole problem of making sure that you're official name match the name under which you voted in of course the only women whose name is tend to change when they're adults I always thought that was fascinating example\nWas just like being down at the um Georgia version of the bureau of motor vehicles\nAnd watching women come in with all of these documents only to be turned away because of the documents aren't lining up with who they say they are and what makes this so infuriating is that all of this mess about voter id is predicated on a lie the lie of voter fraud\nThe lie of massive rampant voter fraud and that lie has consistently\nTargeted at the city saying that in the cities we have people who are impersonating other people and voting multiple times they're voting from using vacant lots and addresses their you know coming under dead people's names and voting\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nTo sound like the truth and that's where we are right now so predicated on the lie of voter fraud than we're able to create this almost like rockstar fire that democracy is in peril in only these mechanisms will save democracy but those mechanisms like voter id in fact\nDamage destroy the voting rights of American citizens\nWe said earlier that at the beginning of the republic voting rights are only extended to white real landowners and you know we like to think that there's a story of a steadily expanding franchise is that right\nNot quite [laughter] um [laughter] you you know history is about changing continuity and going back and having to redo it all over again so we get this movement um an\nIs difficult in Indiana\nAnd one of their voter id law suits a woman came forward who talked about how many time she had\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAppropriate number or types of identification to be able to get the driver's license so that she could vote\nAnd you know that's a really important distinction between the idea that women are going to be radicals and therefore shouldn't have a vote versus the idea that women are going to vote like their husbands and therefore should have the vote\nAnd it's interesting to me that the suffrage movement in the early twentieth century women were very careful to dressed in white and to push their babies in their suffrage parades and to talk about how they were good American citizens and they were supporting their husbands and that's the era in which they get the vote and in fact women\nDo tend to vote like their husbands until the gender gap begins in Nineteen eighty that's when we get the beginning of the gender gap\nAnd it's growing ever since until it it's now at the largest it's ever been in American history which is I think one of the reasons that people are don't quite know what to do with the dates politics because women are not behaving the way they have in the past and no one quite knows what's going to happen\nWith that you mean this women behaving badly thing\nWhere women there are certainly thing yes [laughter] right you know that this kind of\nThing going you know what we should get equal pay for equal work what we should have control of our bodies\nUm we\nShould have the kinds of protections that when our our rights and our bodies are violated that the system works as well for us as it does for those\nWho are doing the violating equality before the law [laughter] oh my gosh\n[laughter] and and and you and we're absolutely seeing that right now frankly\nI'm with this Kavanaugh debacle you've talked about a lot of different things that go into voter suppression what worries you the most what's the most important it\nAll ties together I think the one that I find the most pernicious because it's the most hidden is gerrymandering um earlier you had talked about the redrawing of these districts and of course the redrawing of the districts is constitutionally mandated\nAnd it's supposed to be done by a legislative body after the the census to take into account the population shifts and so that we get the kinds of a portion meant\nFor the number of representatives that each state should have in the U.S Congress except the way that it's been done and I mean we started out I mean Patrick Henry gerrymandered to try to to keep James Madison out of the U.S Congress and so\nWe've got a long nap me history of of gerrymandering but what has happened since then after the twenty ten election it took on a kind of\n... it's it's like on anabolic steroids or something I'll talk about Wisconsin and because it's representative of what's going on around this nation in Wisconsin after the twenty ten election a handful of Republicans\nSequestered themselves away in a hotel\nAnd using powerful computer driven mapping software I'm began to redraw the districts the congressional and the legislative districts\nThey had two goals one was to eliminate as much as possible the number of competitive districts\nSo they were packed as many Republicans as possible into one district in as many Democrats as possible into another yes to do that in a way\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nBut also what happens with non competitive districts are people feel like the game as rigged it doesn't matter if I'd vote or not vote because they're going to win anyway and so people stay home they're demoralized\nThat's what not competitive districts do they drive I'm a depression and voter turnout\nThe second goal for the Republicans want to say that regardless of how many votes they received\nThey would always get the majority of seats in the state legislature\nNow I Know that that sounds backwards for the way that a democracy works regardless of how many votes we will always get the majority the maps that they drew they were powerful maps\nTo the point where no Democrats were allowed in the process at all\nAnd the Republicans who weren't in that room we're only allowed to see their district but they had to find a nondisclosure agreement in order to see that district in the twenty twelve election using these newly drawn maps Democrats received fifty two percent of the vote\nAnd gained thirty nine percent\nOf the seats in the state legislature\nAnd to be fair or Republicans would argue that Democrats did pretty much the same thing in a state like Maryland it's just the Republicans control more states than Democrats due to the point\nWhere I think looking to the twenty Eighteen mid term elections projections are that if Democrats hope to win control of the house of representatives or they have to win something like fifty six fifty seven percent of the vote\nExactly that kind of imbalance does violence to the constitutional concept of one person one vote\nAnd where it also does violence is that because of the ways these districts have been drawn like in Pennsylvania where Republicans receive forty nine percent of the vote but Seventy two percent\nOf the congressional seats is that it has put somewhere between sixteen to twenty six additional GOP seats in Congress\nAnd it's created these kind of rotten boroughs where politicians are able to choose their electorate instead of the electorate choosing them and so they are immune in some ways from the will of the voters\nAnd you talked about dispiriting voters who don't bother to turn out these various things if you go to register to vote and time and time again you turned away 'cause you don't have the right documentation and all these different mechanisms they act to corrode democracy to destroy people's faith in what's going\nExactly I'll take Ohio for instance um in early voting was put in place to try to expand access to the voter booth\nBecause having elections on a Tuesday in November that's generally a work day for a lot of folks and so being able to to get to vote and then get to work when you've got to punch the clock is very difficult\nSo early voting provides access to people particularly working class people\nTo be able to fully participate in American democracy what Ohio did on the surface it looks equitable Ohio said we will have one early voting site for each county wow each county gets one except\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAccounting loose right Cuyahoga River in Cleveland guy or the county exactly a has one point two five million people that's a big county\nWhat happens then is that you have a line for hours long lines in these big county's like Franklin County with Columbia Columbus and Hamilton County um with Cincinnati\nAnd people are able to just fly through in these smaller counties what they did in North Carolina for instance in Mecklenburg county where Charlotte is\nAnd Charlotte has about seven hundred and fifty thousand people and Fifteen Percent of the states ... black population lives there\nThey reduce the number of early polling sites from twenty two to four twenty two [laughter] so before and the Republicans say they sent out a little note congratulating themselves because by strangling\nEarly voting sites this way there were like wow in the twenties sixteen or election in early voting there were like\nAfrican American early voter turnout is down by eight point five percent yes\nI mean how do you congratulate yourself for denying American citizens the right to vote\nCarolyn Anderson thank you very much thank you Neal thank you so much\nCarl Anderson of Emory University her new book is one person no vote out voter suppression is destroying our democracy\nYou can find out more about this program at our website That's the truth politics and power dot org the Web site include all of the programs in our archive including previous episodes of the democracy test that's truth politics and power dot org coming up next money and politics\nFilmmaker Kimberley Reid on dark\nI'm you know and I'm Heather Cox Richardson it's\nWAMC some some Fulton County tours of the southern Adirondacks park forty four legs forty four choices fall events include the annual glove his bill fall fest October thirteenth calendar at forty four legs dot com [noise]\nCommissioner of political practice [laughter] since after ... years and years uh actually pieced together the story\nThat went to trial six years after the election cycle that was in question which was in two thousand and ten\nAnd representative wick was found to have violated campaign finance law and it's all thanks to\nJust this accidental disclosure of these documents and you see how these groups are operating all the time in ways that are clearly illegal and violate all the all the principles of how these so called social welfare groups are supposed to be operating\nWhat citizens need to do is to its really questioned what those motivations are if you need to remain anonymous I think we all need to ask why it is that you need to to clerk who you are and when you're trying to influence policy and get certain people elected office\nHardwick is eventually convicted and find I think it was sixty eight thousand dollars he did not lose his seat as a result of the conviction but lost in the Republican primary would have been the repercussions of what's changed since no\nOne big thing that happened in Montana which I think is a kind of a shining example for the rest of the U.S is that campaign disclosure laws were passed and there was a bill in two thousand and Fifteen and what's called the DISCLOSE Act\nAnd uh that basically specified all sorts of different ways in which the source of funding needs to be disclosed\nThat dark money loophole isn't completely closed because that is something that needs to happen at the federal level but one thing that states can do is to emphasize how much disclose it needs to happen in a way of who who are the funders behind these groups\nUm there's a lot of ways that states can mandate that all of this information is put on line very quickly so that voters can know whether it's money is coming from before the elections happened\nWhen one of the things that I think it's really important to know when you're talking about this and about the dark money coming into Montana and elsewhere\nIt's that it's targets are not simply Democrats as targets are Democrats and Republicans anybody who seems to be considered too moderate and not really with the movement conservative agenda you want to talk a little bit more about that\nYeah you know the basic architect\nStreaming support for WAMC comes from Albany med now will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nDiscussion about money and going into this campaign are into that campaign\nBut then I could talk to the attorney general in Montana who is you know bringing up this very important historical case\nWhere I could talk to people like Republican candidate for office John Ward who we discussed earlier who was blindsided by a group called you know mothers against child predators who was comparing him to John Wayne Casey\nAnd last but certainly not least is a journalist named John F F Adams\nWho was a reporter on the ground that was following all of these issues of money in politics and\nInitially in our film it's kind of the lens through which we see this whole discussion play out\nBut when he actually gets laid off and faces a lot of the challenges\nThat the rest of the newspaper industry is going through John really becomes emblematic of not only how important it is to have great investigative reporters following these issues of money in politics but he also becomes emblematic of\nYeah what's going on with with the press in general and the newspaper industry in the financial challenges that newspapers are going through across the country today\nAnd um how important it is to\nTo follow the money how much you really need to have investigative reporters who were on the case who are who are ah hunting down these stories\nSpeaking to follow the money you're you even argue with the film that campaign finance was at the heart of the greatest political drama of our of I bought my lifetime anyway you'd be younger than me and that's what I did\nYeah that's right the former FCC chairman and rattle a tells the story about you know even the most people\nRemember Watergate as a probably probably through the lens of all the President's Men are for good reason\nBut why don't they really started and ended as a campaign finance scandal it started with your suitcases full of cash on the floor of the oval office or that we're there to pay off the people who broke into the Watergate hotel\nAnd the whole mechanism that they had to buy these people off\nWas hiding money a that was coming from political contributions so it really was a dark money scandal\nAnd the whole campaign finance system that we're dealing with today\nReally came about because it was such public outcry against that sort of corruption\nBut once again we're talking about ways to hide money in political campaigns and if folks are looking for for hope these days and times that um I think there's a lot of people on all sides at the ... really frustrated with ... with our political system and how polarized things are\nThere was a lot of reform that came about in the wake of Watergate and um if if you're looking for help I think it's it's not unreasonable to see ourselves in the same situation and\nAnd be preparing ourselves for another wave of reform in the wake of the corruption that we're hearing about today\nThanks very much thank you so much for having me Kimberly reads film is called dark money\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu", "year": "2018", "show_name": "The Roundtable", "city": "Albany", "day": "12"}