{"month": "10", "state": "FL", "station": "WDBO", "content": "When selecting apps that are right for your business my Rick recommends focusing on solutions that can deliver on two things automation and communication\nThinking that you have to let you put it in the industry have passed on auto pilot especially those that are more complex they automatic payroll to make sure that you have to pay for your employees and then the other thing to think about is the business that you're using and every single day so it's important to find ones that are designed to really well so that it's a great experience and enjoyable nothing that you find frustrating\nFor more information visit square dot com or search per square payroll on line or in the app stores\nBeauty knew all in one hair color kids make it easy to come in your hair at home [noise]\nEverything you need to live for the ... results [noise]\nLoved by professional open to everyone Sally beauty [noise]\nHi it's Jamie progressive employee of the month to month in a row\nHi Jamie fit me Jamy I just had a new idea for our song what the name your price tool so when it's like tell us what you want to pay ... trombone goes why you say will be fine garbage option to pick your budget then we just all these fingers NASA will choir goes statement coming ... famous coming at\nYou know maybe anyway so you practice tonight I got new lyrics or the\nProgress of casual the insurance company in affiliates pricing coverage match limited by state law\nAnd he's all yours\nThank you for five years or helping make jokes Kelly the winner of the two thousand eighty Marconi radio worn for large market personality of the year\nBut\nWeddings you know a five minute thirty six point five to give you\nThis messages for all of his sitting in the passenger seat and apologies if it gets a little uncomfortable but how does it feel to be at the mercy of someone who thinks a random taxed more important than your life someone who takes their eyes off the road was speeding along and a three time hunk of steel Frankie right\nWell why not just asked them to stop or better yet volunteer to text for them it might be a little awkward but believe me you know laugh\nLearn more stop tax stop rex dot org ... by the ad council and the national Highway Traffic Safety Administration\n[noise] this is six point five ... [noise] sounds great\nFor Eighteen years old is for\nMany of either I Know there's a lot of meteor nine of you this is your first one I can promise you were to maximize my wife say\nDanger white right there and if you didn't have you watched this weekend the U.S see was\nIt was a massive night right here is their golden boy Conor McGregor back after two years of not being in the ring Conor McGregor in the ring against a it could be ...\nWill do that wouldn't even close it wasn't\nOne round I think with them but the other three rounds including the round he tapped out on it wasn't even close and you could see it look like that you know Connor was he was done and dusted and I said there's gonna be fight inside the ring it outside the ring the minute the fight\nWas over three jumped out of the ring and attack part of Connors\nCrew\nSome of these people rented and punch Connor three were arrested out of the three that were arrested none of them will be sitting inside of court because like you just want to press charges it was an ugly lead up into this fight and a lot of it had to do with the fact that Connor said a lot of horrible things about\nGrieving his his family his religion his country and of course you had the whole incident where he threw the or the ... into the it was it was it was ridiculous and a lotta people thought you know what this is payback for a lot of this\nI Know I'm just in how people can talk about I jump on the cage you know one of all he could write about my religion you talk about my country you talk about my father he come to broken and he broke boss you almost have a couple of people wonder about these\nNew well here's one thing I think for for when you look at this for a can be ... and a lot of these guys that\nCongress has shown he is he's absolutely a showman\nAnd he sells fights there's a reason that people are getting the money they get to fight Conor McGregor and he only now that the opportunity to take big fight you didn't want to do anything else\nIt's not worth it for him to get out of bed and this whole thing turned out to be a massive ... now fans weren't hurt these were you up see people on UFC people and it it it definitely got ugly they don't like each other he is a he Connor trash talk but Connor cells and that's the point\nHe sells\nBut for some of these guys this is in many ways kind of like a religion this is the life for them the fighting the martial arts all of these kinds of things for Conor it was a way out and he's now made lots of money and he's a showman any sells tickets\nNot people I think it's media media did with changing my my niece is respect sport you know these ... these are so like I told the guys I Want to change this game I don't want to people talking about like apartments multi father like\nLike religion you you cannot talk about religion you can also ... ...\nYou cannot talk about this stuff and you know this is for me is very important\nAnd that's what it was it was very very important for for ... and and for Conor McGregor it was a fight it was an opportunity fight somebody he I I said I didn't think he had a chance and he didn't he looked a\nA he looks like a little ring rusty and been fighting for two years and when he did fight it was ... it was may whether it was boxing but something totally different\nAnd it was it was ugly and they're trying to get this in the Olympics are trying to do a lot of things with this it wasn't a great night\nBut it was an amazing night and this was awful it was horrible but\nBehind the scenes like this is amazing people to be talking about the somebody giving we're talking this on the water cooler people and you're talking about this on line it was a huge nights for that but I also think that sometimes some of these people take this thing in a in a serious way where I think Conor is playing a game and does he go too far yeah and did this guy wanted to prove a point absolutely\nBut did it so did it bring in\nButts and put them in the crowd biggest crowd ever AT T mobile for a U.S the fighter was over Twenty one thousand paid or something like that massive numbers done a box office they're gonna make huge money out of this so in the end\nIt worked like it or not I don't think these guys like each other much I'm just saying I think that there there's the selling the ticket side that people forget three two three five three twenty four twenty three ... Benson show was your Twitter I don't want to sell you anything were to give you something a free membership for a year to a Mac\nForty percent off movie tickets forty percent off Disneyland Disney World SeaWorld legal and Six Flags just name a few restaurant retail hotel traveled the scouts\nPlenty album and oh by the way they're going to go out there to advocate a year and a half or great things like common sense immigration reform Medicare reform things of that nature what are you waiting for not costing you anything they don't even want your credit card all you have to do is be over fifty that's it over fifty boom you're in\nWhat do you have to do go to a Mac dot US sports last shed that's a Mac A. M. A. C. dot U. S. forward slash Chad or coal eight eight eight three five five sixteen sixty eight that's eight eight eight three five by sixteen sixty eight it's a one year free membership\nIt's on me a Mac dot US sports last checked at you had been to show is your Twitter\nC. J. D. P. E. N. S. oh and you can tweet at me love hear from you check out all the stuff we've got going on in the old social media world there's plenty of it\n... and show DV we're starting to wrap things up we're doing a lot here we want you to be a part of we'd love hearing from you don't be shy so free to text us whatever you want three two three five three twenty four twenty three and she had been some shows your Twitter is ... ...\n[noise] ... yeah [noise]\nNews maybe six point five ... family\nAll [noise] did you just look down at your phone [noise] you did it again then you know you find down the road and it's three ton hunk of steel\nAnd attack takes your eyes off the road for an average of five seconds at fifty five miles per hour that's long enough to travel the length of a football field and caused some serious damage\nTurnoff trust me whatever it is you'll live\nLearn more it stopped ... dot org ... by the ad council and the national Highway Traffic Safety Administration [noise]\nDownload the news maybe six point five ... attempt\nTo hurricane guys get the latest updates trucks doors are here to tip the more they connect the whole hurricane season maybe six point five will end up with her for severe weather news six point by\n... [noise]\nThis is news Ninety six point by your baby oh we'll turn first for breaking news\n\nFrom ABC News\nFirst responders stories in the wake of the deadliest transportation accident in the U.S in almost ten years twenty people were killed and Saturdays limousine crash in school Harry in New York Aaron by water as a captain in the central bridge fire department among the first one was seen\nBy guys jumped off the truck they grabbed the jaws I fired the jaws of they went down there within two minutes said that Carl were pulling bodies out\nOvernight isn't going to happen overnight it's just not it but this has really showing the tribalism we have in this country and we're very divided and we've been that way for a while but the division has got nasty\nBecause we no longer see each other as as as people\nWe see each other as the enemy we don't want to see each other it's somebody's got to different I idea we see each other as my ideas right your idea is evil and your evil and that is not a good way to go about things it is it is very interesting to see the way this entire thing is going to play itself out as we move forward but I understand why people were pissed\nI absolutely do and the Republicans I understand why there's some gloating going on\nBecause you want and part of winning is being able to write the future that's part of winning that is absolutely part of winning and that's what's taking place here you on\nYou got people to come out and vote you put yourself in a position and I heard a lot of people over the weekend we need to get rid of a like you know we need to get rid of this when you get rid of that it's like this is what happens stop trying to change the rules\nStop trying to change the rules you lost ... ... ... ... more than the anger I was sick and tired of the whining I get a lot of you that I talked to over that we can even some people out there who can't stand cabinet can't stand Trump felt the same way people I talked to over the weekend is this this this feeling of whining is just like\nStop get over it forward is taking a step forward but a Collins who gave an impassioned and I thought a very well thought out speech over a friday\nShe is facing the brunt of a lot of this and and I tell you what she came out and she defended over the weekend on just is the union and several other was she defended what she did and talked about everything from you know Ford's testimony\nI don't think she was coming forward with a political motive although I Do not think that she was treated well\nBy those who hope brain ...\nWhich is something we need to look at how did all this stuff get out but you know she wants to get reentered reiterated\nI don't think it was him\nI Do not believe that Brett Kavanaugh was terrorists ally [noise] so I Do believe that she was the south and I don't know why home and I'm not certain went\nSo this whole thing though you know she used her\nOpponent that she's gonna be taking on\nMade out like advantage over the weekend they the the money that flowed in and she remembers she's not up to the U.S when the money that flowed in was massive the the kind of money you know and that Susan Rice talks about stuff like who could take her on all of these things it is it is\nShe put herself in the firing line but as I was explaining somebody over the weekend she lives in deciding vote she wasn't right Joe Manchin a jumped they had wiggle room there if she decided to vote\nNo it's still wouldn't have mattered because in the end\nPens what broke the Thai\nBut she did what she thought she should do she talked about a thing called due process and that's as I talked to people over the weekend and a lot of women say you know I got a ton of of text messages and and stuff over the weekend for people who are saying\nWell women are now second class citizens and all of these things and I sat there and I just went wow it and not even close you know four hundred and twenty five four hundred and twenty five high profile men\nIn the last year since the whole Harvey Weinstein me too movement happened\nHave been taken down and or some some are currently sitting in jail rightly so are facing a criminal charges other ones have paid out huge money and we'll probably never work ever again and they've been taken down and that's just the people that are high profile and some of them wrongly so\nRight\nFrom Garrison Keillor to to to Al Franken and to some of these other where you're just like that's a stretch so don't\nSay that that that this hasn't had some effect\nThat has been positive for the side of the person who is the centrally the aggrieved party 'cause that's a bunch of\nCrap it's absolutely a bunch of crap one hundred and ten percent\nBut the thought process that you are now some sort of ... this is the women are never going to be taken seriously again because this guy got on the Supreme Court you're you're insane\nYou're absolutely insane\n\nOne hundred and ten percent it is it I just sat back and I'm like wow really people think that people actually think that\nWe're all well\nI think more so than ever before sexual assault victims particularly women\nRight not kids or or or or or young boys particularly women or beliefs and now there's a movement afoot where if you got to believe the woman because politically it it's the best thing for you regardless if there's facts and even if there are stuff that comes out of the things that comes out evidence\nThat comes out that that says that that none of this stuff happens that you throw that away right even if they can't prove it doesn't matter so don't tell me\nAnd I said it on friday and I'll say it again I also think it's a generational thing I think there are women that are in their late thirties\nAnd above who look at this and what they want is they want recognition that men were awful horrible through the fifties and sixties and seventies and eighties and nineties and they used their power you know and two the two thousands and and and were awful\nAnd they want recognition for that and and and for the things that they went through and I think there's a younger generation that looks at this is this is another bullets in my ...\nThis is another thing to weaponize\nFor micro aggressions to sexism racism phobias all of those things this is another bullet because they're not going through the same thing like my mom is is is in her sixties she's worked with extraction industry she she was Fifteen Years old\nThinking about that right\nThrough ... through the sixties seventies eighties nineties but I Know the guy she works with their family friends because she's been at the same place since she was in tenth grade ... piece of the company\nAnd\nYou don't think the women nowadays have it better yes and they're always looking out for what did you say how did you look at me what did you do how did and and it's not just at a younger generation across the board is looking for you to somehow slip up they're following you around\nSo I think this whole thing with me too movement is a is it is two pronged I think you have an older generation wants to knowledge of how bad men have been in the past\nAnd the the the the the power\nStructure and the struggle that has gone on there and not just when it comes due to sexual advances unwanted sexual advantage and things like that but just across the board and having to really fight to break through the ceiling and a younger generation where things have been set up for for girls more so than than young boys and men\nAnd I think it's going to ... and they're looking at it as much as a weapon eyes of something that they're able to to take out there and use as they know their bullets in their politically correct on three two three five three twenty four twenty three actually I've been to chose your Twitter you can tweet at us love hearing from you a lot of stuff do they get there we're going to talk about Christopher Columbus\nIs he a hero the monster it is Christopher Columbus day I joke around a cult guilty white people day 'cause everybody's running away from indigenous people day but as we all know that you know as you go back in time and you look how do we get here who do who came here\nWhere people are already here where they are they walk from somewhere there's always these debates but it's really what it is is we hate Christopher Columbus because of\n\nThree two three five three twenty four twenty three ... and show is your Twitter separate critter so you've got a job here you are you sitting around it's Monday morning I got to find some people to work here\nBreed do this to go to different tutor dot com slash Benson and B. E. N. S. oh this is what they're gonna do you're going to go there you go to sign up for free today it's on me you can post your job afraid to go to go to hundreds of Web bleeding job boards but this is what super critter\nReally\nDistance themselves from all those other yeah who's out there but zip recruiter does is they go out there and they started inviting\nPeople who match your job description up their resumes and the ... and the experience to have with your job they showed invite him hey over here check this out check this out\nSo that they start applying and then what they do they use their matching technologies they started going through all of those resumes and all those people and they find the best of those highlight them in fact within twenty four hours eighty percent of people post job as a recruiter did a quality candidate site through the within the first day that's amazing\nSo that's why they're the highest ratings site in a marriage that in America what are you waiting for\nWhat are you ... nothing there you go I told you can place your job for free today this is what you do you go to zip recruiter dot com slash Benson\nZip recruiter dot com slash B. E. N. S. O. N. post your job for free today this time tomorrow you could have somebody\nComing on and for the interview that's going to help you grow your company and you're going to give them an opportunity of a lifetime ... dot com slash Benson be NSO and zip recruiter the smartest way to hire ... shows your Twitter C. H. A. D. P. E. N. S. O. in such and such a [noise]\nThree three more to governor Rick Scott has issued a state of emergency and thirty five four counties around the panhandle hurricane my voice is set to hit the area later this week\nMore information on firearms orange safety presidency PC the business in bronze you by the national crime prevention Kelso bureau of justice is served\nAs news Ninety six point ... happy and the the L Orlando turns first for breaking news\nFeel under threat from hurricane Michael let me be clear\nHurricane Michael is a monster storm and the forecast it's getting more dangerous\nFlorida governor Rick Scott Michael blowing it Ninety miles an hour as a category one hurricane would could be category free a major storm by Wednesday's landfall although the governor says other threats will come first\nKansas are protesters there will also be a significant threat of tornadoes\nThat today's are typically not always but typically on the east side of the of the hurricane state\nOffices to be closed on Tuesday and the thirty five counties under states of emergency over one thousand people turned out in Amsterdam New York for a vigil for the twenty people killed in Saturday's limousine crashing nearby Scott higher in New York\nPresident Trump declared a reprieve for deputy attorney general Rod Rosenstein saying he has no plans to fire Rosenstein who's future has been the source of intense speculation for two weeks Richard cancer ABC News\nSally did he knew all in one hair color can make it easy telling your hair and home [noise]\nEverything in his column for the ...\nLed by professional open to everyone Sally beauty [noise]\n... lounge presents for\nI says oh what a great [noise]\nBut then the lights for this next one\nToo much but there there's got to get things just write like progressive name your price to tell us what you want to pay and we hope you find coverage options are budget and wait for like our back on it and\nDrink and you know it's completely dark because of the insurance company in price and cabbage match limited by state law\nFear dot com for more information Ross do you visit mount Dora in Lake County real Florida\nBy almost killed her you know ... where are the owners of your love of family the rainy season and if you have water damage ... specializes in one or two at least restoration calling one eight eight eight T. E. N. E. R. that's one of the any any are\nYou know high school here no hot water leaky pipes slow during septic in Greenville problems I've been taking care of central Florida forming for over Thirty years for guaranteed on time plumbing called Benjamin Franklin plumbing for zero seven nine zero five zero zero one for\nAre you interested in becoming your own boss and start flipping houses right now and the Orlando area if so here's an amazing opportunity for you\nMake bertucci's founder of the envy real estate academy created a very\nSimple system that allowed him to flip over eight hundred properties and become a multi millionaire now Nick would like to share his step by step system would you call one eight hundred four to six Eighteen twenty two right now\nAnd Nick will send you a free copy of his new hidden treasures and wholesaling properties kit so if you are ready to start flipping houses or even\nFascinated about learning how to find properties that could produce rental money called eight hundred four to six Eighteen twenty two now to get your free wholesaling kids today don't let this opportunity pass you by called eight hundred four to six Eighteen twenty two now and Nick will also give you for free tickets to a training workshops which includes a free meal a free\nSmart watch and ... new book seven\nFigure decisions all these gifts are free just for attending called eight hundred four to six Eighteen twenty two that's eight hundred four to six Eighteen twenty two to get your free wholesale get a call now\nHey it's Tom Terry this is where Orlando turns first for breaking news weather and traffic news Ninety six five W de Mayo\nWhat do you buy tough retired auto service I'll be watching the radar this evening for isolated brief passing showers overnight\nEven through tomorrow morning drive is cruel to their mid seventies tomorrow back to Haiti nine degrees a fifty percent chance of brief passing showers been gusty winds Wednesday and Thursday also look gusty with a high chance of passing showers from general matter when the news I mean we're all just George Weinberg or [noise]\nSecurity triple team traffic to find the turnpike shut down overnight construction that South bound lanes closed from orange blossom trail to green white and you'll find alec pay a trail shut down in both directions also due to construction that I for rolling blockade along I for they'll find that east bound between orange blossom trail and think wrote four hour wait\nCrippled team traffic average lowest news Ninety six point five W\n... page Joe Kelly from Orlando was morning news we get to the news and information every\nMorning as your hobby into the car forget nine o'clock Brian kilometers actually talking to the newsmakers and that's what's so great Joe that's what I have a chance and I'd only tell you what I think's going on but you can tell me what do you think's going on from your perspective I feel like we have a\nDialogue so Bryant's he'll be two weekdays I told you my news to point five families the Rio\nMostly a system that has developed in the Gulf of Mexico could not be a category ... storm there isn't any reason not to be prepared to keep your family say\nWill provide a safe every fifty they connect you overcame\nLead and doing for severe weather was Ninety six forty five\n... maybe you know that she had been showing new Ninety six point five double the TV [noise]\nIndependent\nIn thought sense punk rock in life\nAnd shell\nHe has the investigating the country's deadliest transportation accident in nearly a decade Eighteen\nPeople inside a limo killed when officials said barrel through an intersection in upstate New York plowing into a crowded restaurant parking lot slamming into an empty SUV striking a killing two bystanders the foreign landing in a wooded area in total twenty people died\nAbsolutely insane twenty people died in this limbo if this was a shooting\nAnd there was an hour Fifteen it would be nonstop but politically there's nothing here\nRight there's like there's no story you can't spin it it's just a tragedy so you've got to step back and go oh well this is just awful here's my question\n\nIs why we have seatbelts for these things or buses\nRight I mean that's I Know it sounds like oh that that'd be uncomfortable and the whole thing getting limos somebody else's driving to your partying and having fun I get that\nBut if I'm driving a car or people in the back and not have seatbelts All right\nI mean it is weird like we'll let you party in the back of a limits to all of these we let you have a bar in the back of the limo ... we'll let you have a bar in the back of your car\nEven if you're not drink we don't let you have a bar we don't let you\nI'm I'm curious about this and I think that they're going to look at this and it it's a horrible thing twenty people are dead twenty people think about that\nBarbara Douglas tells ABC News her forties it's Amy Abigail Mary and Allen St were among the passengers riding in a two thousand one stretch Ford Excursion when it crashed\nOne of the sisters Amy had just gotten married earlier this summer to her husband axle femur their uncle said they're the ones who rented limo to keep the group said\nThat not work and now there's somebody coming out about the the limo company and this is really interesting and an FBI informant\nCheck this out ... Hussein used to be an FBI informant who testified in to terrorism cases including one involving an alleged plot to blow up a synagogue in the Bronx\nHe became an informant in two thousand two after he was caught helping immigrants cheat on driver's test while he worked at the New York State Department of motor vehicles the state is now trying to shut down for Steve limo until the investigation into the deadly crash in skull Harry is complete\nYeah so that's that so there is another twist when he met Trump gets blamed for this the FBI's involved but if I mean if you think the more I thought about this because I Do have a lot this weekend and I mean it's you're driving and you think about something like this the device twenty people lost their lives where's the story and it\nWas breaking news for thirty seconds but as Dr Kevin on all this other stuff because there wasn't a gun involved\nThere wasn't any there's nothing there that that news can get out and spend that that particular big\nEstablishment news can make the the the Republicans look bad so the question was\nWhy don't seatbelts why we have certain things because I looked at the limo and it was beat the hell up but I also thought to myself what else happened I mean why why don't we have those same thing with buses right same thing with\nWith with you know a lot of these these things that you'd you'd transport people and why don't you have these things I mean you should have these things\nWell it's not fun than men I get that because people party and having fun I get that\nYou can't do that in the back of my car let's just say for the sake of argument I have a top right or something like that you can't drink in the back of my car partying it up and not wear a seatbelt if I got pulled over ... that's some serious issues\nBut they kind of overlooked is that kind of weird little world of if I think it's a fair question and when you have twenty people die like\nThat as an Eighteen him in a limo and do outside of this I think it's a very serious question three two three five three twenty four twenty three ... meant that shows your Twitter you can tweet at us today is coal lumber stay\nMe than for couple was found dead in the parent murder suicide after officials city wellness check when the woman did not show up for work [noise] why\nWhy you see a football have cracked the top Senate da pie and coaches polls following each Eighteenth street when Florida Miami and us joined a night in the top twenty five\nGosh and he's all your\nThank you point five WTO's for helping make Jill Kelley the winner of the two thousand Eighteen Marconi radio award for large market personality of the year\nGrammy but for me\nWeddings you know a five minute maybe six point five to ...\nDo we go Jones and this is let's be fair [noise]\nHave you ever asked a child with their favorite part of a school day is chances are they replied recess there's nothing wrong\nWith that either in fact there's a lot of learning and growing that takes place on the playground\nThe games and other things going on there and not only fun they build confidence help children become comfortable with taking risks articles in the New York times Washington Post it revealed that risk taking on the playground is very important to child development\nUnfortunately they also revealed the children have lost some of the best opportunities for covering their fears because things like monkey bars and toss lies are vanishing from playgrounds why because courts have allowed so many lawsuits over common injuries schools believe it's better to just remove things and many of us grew up with\nLet's be fair many experts now believe what do they say for playgrounds can actually ... development and leave children with things that are worse than a broken bone it's time to fix this problem in demand better from the\nCourt's they'll create the situation in the first place\nIt was at our website at Center for American TV dot org\nOr you fifth year older okay well I'm not going to ask you to raise your hand so don't worry\nBut I Do want to ask you have you sign up for a Mac yet if your answer is no why it's a free membership for one year you don't even have to give them credit card information\nAnd just for signing up here some of the stuff you're gonna recede just some forty percent off movie tickets access the supplemental dental plans up the sixty percent off forty percent off theme parks like the world ... Disneyland and more discounts for hotel bookings at rental cars do that's\nRight you're going to see all those discounts and more\nJust for signing up for a free one year membership the only requirement is you got to be over fifty\n... ... us forward slash chat sign up for free no credit card no tricks no cost nothing sign up for a free one year membership a Mac dot us forward slash ... eight eighty three five five sixteen sixty eight eight eight eight three five five sixty sixty eight or online at a Mac ... us forward slash chat\nMe my last year of power and wealth management the reason I really really like to sit down with individuals as everybody situation is different you have to find a way to\nNavigate through all the information and then coming up with that list of what you need will applies to use very very specifically take a moment to sit down and look at what you're doing and let's make sure that your plan is right for you\nCheck out guarding your nest egg with Mike Lester Saturday afternoon one or Sunday afternoon wanting Iran used only six five security security member spinner SAP see\nAnd that's why it's so important to hire someone\nThat has those skills by the way unless you're in Missouri or Illinois I'm not licensed in your state but that's OK\nAre attorneys in your state or contact Cordell in Cordell to schedule it a point where it was one of our firms Orlando area attorney so partner men can count on online at Cornell Cornell dot com Mets Cordell Cordell dot com office in sand Blake\nCordell in Cordell Orlando, Florida at least a card is Florida resident partner announcers are not licensed attorney ...\nNow that the laws and Florida have changed receiving treatment for chronic pain has become much more restrictive now takes certification\nAnd only a few areas of medicine to legally prescribe pain medications for longer than seven days this is Dr David Klein of stages of watching Medical Institute type and qualified to prescribe these medications for over Thirty years and we're here to help you get the continued treatment you require we accept Medicare and many commercial insurance plans call us at\nFour O. seven six seven three three three seven for more information\nDan owed an unbelievable amount of money to the IRS\nI got behind in my taxes it's a horrible feeling he was in denial and when I get those letters from iris you want to act like they didn't exist\nFinally didn't turn to up to them a tax relief the leading tax resolution from a plus raided by the better Business Bureau they've resolved over a half billion dollars for their clients\nOptimize got me a settlement with iris these people are really people friendly it was every bit of a new lease on life for me the fast action and the great results may Dan's head spin I felt like I was going to drink but it's real and\nI are paperwork to prove they got the job done and life is good for ... you can trust to call optimal no for a free consultation if you're worried about what's gonna happen with the IRS stop worrying make the call now\nCall eight hundred three o five eighty Ninety six eight hundred three o five eighty Ninety six eight hundred three o five eighty Ninety six\nAfter tax relief\nTestimonial from an actual class restrictions apply for complete details about them a tax relief dot com\n[noise] this is six point five ... [noise]\nExchange batten down the hatches [noise]\nOn\n\n[laughter]\nOh so that was an arch auction and Banksy the elusive a artist sold at painting for about or or or some sort of artwork for one point four million dollars and then it sells distracted and now they're saying it's worse more\nIt's very interesting the way it did the minute it was it was done so like hey somebody wanted all of a sudden it was in this like this this uh a frame and then the artwork started to come down and he got shredded\nAnd it's very interesting he is if you don't know who he is he's an anonymous English bay street artist\nHis paintings are worth millions upon millions of dollars he's a political activist Aziz vandals some people say he's a film director he's just he's an interesting character and this is just this whole thing was was was a tripper and now people say oh my God it's ruined but now wait hold on a second\nNow it's worth more arts that trip\nIdiots art is a weird weird thing and what we pay for art and and certain things in this country and around the world is is crazy I was watching something last night where a guy had a uh in his closet he had this this this like a blanket\nAnd he saw something on one of these shows it's like I think I got one of those those blankets Navajos blanket\nAnd he sold for one point five million dollars and ...\nBecause of the way they made it how hard it was it in modern technology we did what did they got stuff and and created some of the colors and stuff and what people will pay for stuff\nBut they looked at that is this is the artwork to belong to the world bank these like I'm an artist this is my whacking his check some of this stuff out I may I ... everything I'm doing is a message\nAnd it's expensive message to three two three five three twenty four twenty three at you had been to Joe was your Twitter question today is about\nYou know I look at somebody like a Christopher Columbus and the anger that this this woke generation\nFeels towards Christopher Columbus never understanding the things that they went through because we want to look at it at our modern world\nAs this he should have been just like us he should've been inclusive and understand stuff and that's not the way it was but ... it's the question is he a monster or see just a bit of a hero bit of a monster thirty four percent say it's a bit of both the ... percent monster fifty five percent sea hero for his day\nAnd if you go back and you look so many people of that era\nAnd that day globally\nWe're probably monsters are probably all of them compared to who we are today right and and\n... it's crazy it really is because we're changing the goalpost and rewriting history because we feel politically correct thing to do and I think it's wrong three two three five three twenty four twenty two at you had mentioned show is your Twitter you're useless fact of the day one of my favorite games ... was actually created anonymously by couple\nWere from Canada\nThey called it the game because they played it with their friends on their yachts interesting indeed have a great rest of your Monday and I hope you survive another day of having a night jak\n[noise] ... yeah [noise]\nNews twenty four hour news weather and traffic news maybe six point five\nSend a Cox media group station\nAnd Joe Kelly host of Orlando's morning every morning and it was Ninety six twenty five ... teams do to bring you news weather\nDown the day's story and have Washington Washington Jamie free day plus Tom Perry an ad Torrance will have your weather and traffic every six minutes breaking news weather and traffic every morning starting at five with Orlando's only all news morning show only a news Ninety six twenty five ...\nThere's nothing just for all of these getting in the passenger seat and apologies if it gets a little uncomfortable but how does it feel to be at the mercy of someone who thinks a random taxed more important than your life someone who takes their eyes off the road was speeding along in a three time hunk of steel cranky right\nWell why not just ask them to stop or better yet ... text for them it might be a little awkward but believe me you know laugh\nYou made a decision that that is more violent than was [noise]\nThis country we have them presents in the ... and ... as a matter there and the way that I ... ... was\nThat question and the more likely than not\nThan Brent Kavanaugh salted critical for and there was no corroborating evidence that he gets some age of ... percent desert for bed when the president has lied under oath\nThat they had no memory is happening in that gap there for a best friend\nExactly that's the point mhm\nIt's not that you don't have sympathy for Dr Ford you do write either lay out the story and you're like oh that's awful you may even think this doesn't seem right there are a lot of things that don't match their parts of this story that get changed well if you look at the\nTimeline of everything and the first time but she told anybody about those who was the mid eighties when it was the late eighties when it was the early eighties and after consulting with democratic lawyers in rounds Nineteen eighty two\nYes so I mean yeah it's a ... so I Know that right now to take from the left is if you have that belief than your rape apologist but it's just you're following the truth and the facts as we know them\nThat's basing everything off a motion instead of reason yeah\nAnd so and then they just don't do that no they don't Dana Bash came back in that interview saying well for people who weren't victimized ... or ... they might not remember it talking about her friend wheeling Kaiser while it was an unremarkable event right because if there were five or six people\nWho were at this party and they weren't traumatized and maybe they just wouldn't remember it okay All right I\nReally don't think that is possible when I'm ... Ford testify then she ran down the stairs in the door [noise] Shirley her best friend was there would have followed her and the answer was Ronald nobody from Ford were to say\nI'm the one gave you a ride home or I was the other person in the party\nYou know how we all sort of play this game too yeah what we're trying to be as respectful as possible to Dr Ford if you wanted to get brutal with how this story has changed\nJust the lack of evidence you could yes we can do it very easily trying to play nice as much as possible mhm okay the story in so many ways or as we know we're not holed up in court\nLet alone even here and so what's the message than from the left even if it was suppressed memory and there's no other ... operation if a woman says is true you have to believer right period the end\nThat's one of the reasons why this Julie sweating ... character wound up hurting them so badly because that whole just believed the women don't play when you have somebody whose credibility is basically zero\nWith Julie sweat neck oh yeah so it's kinda hard to say you need to believe everybody here everybody yes if somebody wants to come out the allegation I think we should absolutely hear what they have to say but part of that also involves when when what they had to say doesn't make any sense you should be able to say it doesn't make any sense\nYou know what else doesn't help because what's that the second allegation the old wagging episode of\nThe great wagging of Nineteen whatever Nineteen eighty whatever yes yeah\nThere's a room full of people and this guy is wagging it around and somebody said nope no recollection of that\nCan nobody remembers it apparently even though somebody according to\nThat story somebody yell ran out and said Brett Kavanaugh just did this yes but nobody can remember it\nBecame but why do you know why there's nothing\nNo are you kidding me listen they but I Know in college you're at some wild get together yeah a lot of people were that's one of those things where if you get together with buddies after a few years\nHey remember that title BJ got her out why I get I don't remember that it\nGives you know how that story goes can you believe that guy's a federal judge now that's exactly people would know that and people would be coming out but Cheney Wagner holy smokes I'm I'm Glad that Susan Collins and others are just kind of got their stuff together and wound up doing the right thing here\nMhm not letting the left to bully them into this 'cause I mean they have the ... the left has been doctoring these people oh yeah\nThey've been going after they've been threatening these people ah what's his name Cory Gardner\nJust shared some horrible horrific threats that were sent days family it's crazy man\nA including somebody sent a video of the heading to his wife\nAnd these people out for quote justice a kindness we need to love each other or did you also hear what the left was saying all weekend about Susan Collins but you just did it because the boys told her to seriously man\nFeminists are you kidding me they're calling her a fake feminist there ... minutes all sorts of different words because they didn't like her decision which is shameful because I thought I thought we were supposed to you know support a woman's right to choose\nAs she chose and she chose something that they didn't want to know that it's not what that means it's very interesting though for a group of people who called the right sexist and homophobic all the time they got right what have you been doing for the last three weeks\nThey've been calling out white women they've been going out Susan Collins saying that she only made a decision because the boys made her do it and they've also been making nonstop gay jokes about Lindsey Graham what you know how it works with the women's march\nUm and the feminist attitude okay ...\nWomen are not strong unless there on our side mhm if they're conservative at all or if they're pro life are there are only doing that because\nOf the white male patriarchy right it's just freaking insane man\nSaying it is not there have been it was a weekend filled with terrible scorching hot takes yeah and including a we'll have to get to this a little bit later Mazie Hirono among all talking about no corroboration you know Brett Kavanaugh had no ... that he's innocent which is why how this works\nBut and if you could make any argument you would say well there are two other people that were supposed to be at the party that says I have no recollection of it including again Dr forge friend up already we also got to get to a\nPresident saying Susan Collins was the star and man what may lay in the U. S. C. [noise] and there was a shadow given Brett Kavanaugh there will get through it all coming up on them are very good show [noise]\nThree three breaking my ... killing time 'cause I heard that and may become a category three later this week\nMore dangerous governor Rick Scott state of emergency for thirty five Florida counties around the panhandle\nPresident Donald Trump and now he doesn't have any plans to buy a deputy attorney general Rod Rosenstein\nIn Kabul was killed in an apparent murder suicide ... labor costs to complete a well that means jak [noise]\nAnything ...\nListen to a new study six point five W ... wherever you go\nMy car when I'm On the go and the main\nAn hour at home on my Amazon Echo\nNews Ninety six point five ... Ninety six twenty five ...\nMeet Mike Lester of talent wealth management the reason I really really like to sit down with individuals as everybody situation is different you have to find a way to\nNavigate through all the information and then coming up with that list or what you need will applies to very very specific like take a moment to sit down and look at what you're doing and let's make sure that your plan is right for you\nCheck out guarding your nest egg with my quest you're Saturday afternoon a new one or Sunday afternoon Wanda Huron used any six five security and security member spinner SAP\nDid he knew all in one hair color kiss me he was telling your hair and home\nEverything in his column for the ...\nLed by professionals open to everyone Sally beauty [noise]\nProgression present yet we should help you do insurance stuff\nOut your budget Boston\nTo tell us when you want to pay for insurance hope you find out something that you're going to get you bumped down down down down dying I hear your budget oh wait that's just those kids laughing at me\nDown and of course the casualty insurance company and prices over time as I said law\nYou happening rapidly including technology that can improve that bald spot or your rapidly receding airline Dr bathrooms team at ... dot com operas all the latest technology under one roof\nDid you just look down on your phone [noise] and he did it again then you know you're flying down the road in three ton hunk of steel\nAnd attacks take your eyes off the road for an average of five seconds at fifty five miles per hour that's not enough to travel the length of a football field and caused some serious damage\nTurn it off trust me whatever\nIt is you'll live\nLearn more and stop tax dump rex dot org ... by the ad council in the national Highway Traffic Safety Administration\nIs news magazine point five heavier baby on land what turns burst for breaking news twenty four hours a day\nMaking day they lured his panhandle hurricane Michael currently a category one storm blowing it Ninety miles an hour but it's going to get worse could blow up into a major category three store and hurricane\nMichael will rapidly intensified in the Gulf of Mexico should make landfall somewhere near Panama City beach on Wednesday now it looks like Wednesday afternoon but again ... you'll start to see impacts on this still I'm well before that probably early Wednesday morning then all the way through Wednesday night\nABC News meteorologist ginger Xi's states of emergency in effect in thirty five Florida counties state opposite in those counties to be closed on Tuesday\nIn Amsterdam New York roughly one thousand people turned on Monday Night for a vigil for the twenty people killed in Saturday's limousine crashed the worst transportation accident in the U.S and almost a decade newly ...\nBorn in Supreme Court justice Brett Kavanaugh will be on the bench Tuesday to here is first arguments on the high court justices schedule will take up cases related to the arm career criminal act Richard chance to ABC News\nPlayer he very magic mechanic here ... professional service centers just like magic mechanics there's thousands of ac they'll go service centers nationwide best parts of the service period to year twenty four thousand miles nationwide warranty on automotive repairs\nFundraising email service Centre simply go the AC they'll build dot com click on parts of service and find a shop near you remember if you're far\nAC they'll probably makes it out of the magic mechanical radio\nShow hello central Florida Tim had Iraqi evacuate window and door where we're proud to earn the trust of central Florida homeowners we have taken additional steps to maintain that trust by becoming a certified residential contractor and that means we have passed the highest\nLevel of accreditation and the state of Florida we are also very proud of our eight plus better Business Bureau raining\nThese achievements are your assurance that accurate window indoor is still improving even after more than thirty great here and there why over forty percent of our customers are WDC radio listeners just like do you\nLet us or in your trust today call us an accurate window and door for zero seven six seven three one one five nine that's four zero seven six seven three one one five nine\nAnd online and accurate window and door dot com that's accurate window and door dot com and join me on the Florida homes and gardens show every Saturday morning at Penn right here on news Ninety six five WD be a\nVery natural mechanic here foreigners that magic mechanic or first come first served you can also drop your vehicle offer repairs or service anytime you want or scheduling appointments weight on breaks the lions tires to enough dams services and much more the transportation while we had her medical don't forget to reserve and eight Ninety nine a day and shop for a real\nUs a call at ... seven six to nine to six six one for for ... says that magic mechanic dot com mentioned mechanics celebrating Thirty years in central Florida\nHello this is Joe Cornell Cornell Cornell here a few quick divorce tips we provide our clients sometimes email us the best way to communicate with your wife during their divorce it's efficient it creates a record and in hordes ugly scenes on the other hand because you're on the record your comments must be tactful unreasonable assume your e mails we'll be exhibits at trial\nRemember your goal throughout the process is projecting damage of common sense in good faith\nThe judge should understand that your wife is the source of this needless litigation\nYou're the good guy the voice of reason a related point be cooperative where you can show flexibility regarding non essential issues judges noticed this besides save your attorney fees for what's important by the way unless you're in Missouri or Illinois I'm not licensed in your state but that's OK are attorneys in your state or\nContact Cordell in Cordell to schedule it a point where it was one of our firms Orlando area attorneys on line at Cordell Cordell dot com Cordell in Cordell Orlando, Florida at least a carcass Florida resident partner announcers are not licensed attorney ...\nTime Clark Howard the guy helping you keep more of the money you make and this is where our land though turns first for breaking news weather and traffic is Ninety six five WTO\nWhat to buy toughie retired auto service\nEarly Tuesday Morning at mid seventies it'll be breezy will have a few isolated passing showers people drive to work then through the day you arrange chance fifty percent scattered brief showers and occasional downpour as well watching for isolated lightning temperatures that eighty nine\nAnd we'll have high range chances in gutsy conditions on Wednesday and Thursday as well from channel minded witness news I mean Iran will just toward Walden burger\nSecurity triple ... got rolling blockades along high for east bound from orange blossom trail I stink rough for a way to find the turnpike shut down for roadwork southbound between orange blossom trailing greenway and we've got to pay a trail shut down in both directions due to construction at I for\nTriple team traffic I'm Richard Lewis news Ninety six point five W db oh no the marquee in Beckham show I knew was Ninety six point five double the DVD or [noise]\nNear the marching band camp Joe\nI'm remarkably that they can't [noise] well a lot of conservatives that have been a little squishy on Lindsey Graham\nWho I Am all of a sudden like legit where's this land to bend my whole life\nThat's what I Want to know right now because man he was not taking any of it with the Kavanaugh stuff\nNo man it was very passionate speech he delivered\nYou know like ten days ago when the hearings going on and he didn't take his foot off the gas\nNo and I think you can give him a lot of credit for getting a cabin or cross the finish line 'cause he riled up a lot of conservatives I never I never thought I'd see the day where Lindsey Graham was the guy who kind of United all the factions of the right but it happened\nIt it's crazy things that you could never have predicted three years ago yeah so he was on Fox News Sunday talking to the anger duckling Chris Wallace ... my\n... my uh dad\nHe was asked about you know why he's happy now that he got his boy cross the finish line guy\nI'm happy because the airport day nearly eight and railroad man I've known for Twenty years there's never been banned from a ... ... Roy Moore failed I'm happy that does who tried to destroy is lives too short\nI'm Glad those who've tried to overturn the rule of law and replace it with law rule last I've never been were just in my life ... per soda Myron Kagan I Would never done this to end this character that's nations\nIs warning power too much to the extent that I came to the age of this good man and helped defeat this debacle I'm happy that the Clinton\nWell alright there's I'm happy as a clam when the Graham oh she said he's done with Chris Wallace yeah so he's not going to get the regular CNN follow up which would be are you saying that you don't believe Dr Ford right of course\nIs that they do because then you have Chris Wallace and my my my my for your bank but Democrats will continue because of the Democrats already talked about they're going to try to impeach judge Kavanaugh down yes they're campaigning on that idea I have heard that already\nEarly November at that makes sense I Hope everybody running for the house in these purple districts\nWill and will be asked a question do support in Beijing judge Kavanaugh based on five allegations that none of which could they cooperated the warning outcome so badly that she would basically turned the low upside down a all I can say is that this is going to the streets at the ballot box\nUm I'm gonna I'm never campaign against the ...\nThat's about to change going to go throughout this country and let people in days that\nYou know purple states are red states where Trump won you know what I saw no but I think about this process\nHoly smokes world we live in where there's Republicans saying Lindsey come to my state helped me out I Know that that isn't the same way in the ... the gloves are off now I'm throwing rocks I'm ready I'm tired of them have because you people are pissed me off\nSounds like you're still making fun of Lindsey it's always been a loving tribute to Lindsey Graham okay always so it's almost like a band you're not mocking another band no no no no no it's like a loving tribute yes but tongue in cheek like when you make fun of axle rose every now and again we're there yeah\nYou're not used to love God you're still around with guns and roses but when you have to band\nYou're just you're just like to make fun of them just a little bit but somebody making fun at sexual tribute [laughter]\nOkay what other vocalist cannot bring out at any time [noise]\nBut lead these ready to go on on the campaign trail and go against these Democrats\nAre you man when you I Do wonder how this is going to shape up in November because I thought last week you know if if uh if Brett Kavanaugh if the confirmation had failed I think that would have been rocket fuel for Republicans Republican voters would have got out I Wonder if you can sustain\nThe energy that we've seen come out for Republicans in the last three weeks I Wonder if you can sustain that for another four weeks", "year": "2018", "show_name": "The Buck Sexton Show", "city": "Orlando", "day": "09"}