{"month": "10", "state": "FL", "station": "WDBO", "content": "That there is that possibility there is the book by the way he's amazing and Brian is a great dude and again you don't have to love everything a lot of these leaders did we look back with all these retro rages\nNowadays but it was the time and it was the era that the likes of Andrew Jackson lived in and uh I think it says a lot of who we are and the more that we try to wife that out I think the worse it is for our country it's ... [noise]\nThree to rabies is giving the U.S government a million dollars a week while the media some Republican senators are calling for tough action on them they sent the money arrived Tuesday and was given to honor a pledge made in August to help stabilize Syria\nFirst person being charged in the search for who is leading in the federal government and U.S Treasury employees accused of leaking secret reports about this just financial transactions tour reporter\nWhy it would be back the Orlando Magic kicking off their season at home with a window for the Miami Heat one oh four to one on one\nWould you get when you combined the winter because they can Marconi radio more large market based movie or the winner of the confederacy can Marconi radio ward for large market personality of\nYour favorite radio station news Ninety six point five WD the thank\nYou for drugs to make a move to a point by and kill kill you or talk radio station and personality for\nOn this episode of the world's shortest UConn by casting\nLike I say it's inside accounts what's inside my new KFC ten ... ten basic chicken too large mashed potatoes and bore biscuit for Nineteen Ninety nine\nRun or twenty dollars that's\nWhat really matters in a pretty incredible what chicken can teach you about life in any way they rarely participating in front of their\nStaff sergeant Ryan ... of the one hundred twenty third airborne brigade thinks about what it means to receive the medal of honor\nI'm the one that got the recognition because I received the award but like I Know that if this is in mind I just was trying to fall everybody else around me you know all these guys that incredible things the only reason I'm here in the only reason I have a wife the only reason I have kids because those guys gave everything they had to\nBe American veterans center protect the legacy an honors the sacrifice of American veteran here more Mike as something that [noise]\nAre you fifth year older okay well I'm not going to ask you to raise your hand so don't worry but I Do want to ask you have you sign up for a Mac yet if your answer is no\nWhy it's a free membership for one year you don't even have to give them credit card information\nAnd just for signing up here's some of the stuff you're going to recede just some forty percent off movie tickets access the supplemental dental plans up the sixty percent off forty percent off theme parks like SeaWorld leg lamp Disneyland more discounts for hotel bookings at rental cars do that's\nRight you're going to see all those discounts and more just for signing up for free one year membership\nThe only requirement is you got to be over fifty ... ... us forward slash chat sign up for free no credit card no tricks no cost nothing sign up for a free one year membership a Mac dot us forward slash ... eight eight eight\nThree five five sixty sixty eight eight eight eight three five five sixty sixty eight or online at a Mac dot us forward slash jak Larry Larry Magid mechanic here\nUsed savings on new and previously furnishing writes huge saving I court furniture plants and our two semi wide variety of new and previously in these furniture and acorn for your home run off and you'll find so friend from one Ninety nine Ninety nine animal and\nEverything in our nine thousand square foot shell run its course certify guaranteed and in fact many very hard to take on today that are handling course furniture than center at one three nine for sixth fleet taxing memorial highway or go online at ... dot com mentioned radio twenty and get twenty percent off\nOf your local daily Steve Daly femur of central Florida has been cleaning piling ground wood floors Ron Paul's three air ducts and purpose for over thirty five years\nIs the rainy season and if you have water damage the receiver specializes in water damage respiration college one\nHave have have passed T. E. M. E. R. one eight eight have T. E. N. E. R. online Stanley's femur dot com\nMetro PCS is now metro buy T Mobile\nNow you get new plans with unlimited high speed data all month long\nOn the the mobile network check out the new metro by the mobile today and discovered the smarter way to get unlimited metro buy T Mobile\nDuring adjusting the fraction of customers even greater than thirty bucks for a month later this reduce the image of customers may noticed review speeds versus on the mobile customers video streams forty coverage out of there are some areas the store for details in terms of conditions\nFrom Fox and friends in the morning and the Fox news channel which you may not know is on the radio show right here I really respect diversity is diversity of viewpoints your viewpoints and political position even when we disagree and sometimes we do so I Want to hear from your land don't each and every day in the brain kill me Joe weekday nights 'til noon\nA news Ninety six point by WTO\nIf you own a gun you have a full time responsibility\nWhen you weren't using as well be sure can't do it into the hands of curious children\nOr anyone else might misuse or\nMore information on firearms storage safety presidency PC the business in brought you by the national crime prevention council ...\nThis is six point five maybe be a [noise]\nSounds great and\nHey those cookies taste funny\nTwo weeks ago I was just about to go into my the period class\nEnvironmental science and I'm a girl who's also in the class stopped me and asked me if I wanted a cookie and I knew her so you know I figured it the cookie why not and I took a bite of it\nAnd she told me there is a special ingredient in the cookie I was kind of worried I thought that she had the drug trade or something so I asked her if you just wait for the or something and she said no\nFirst of all just stop it right there so I stopped me right there first of all a weed cookie would have just been better\nThough after if you did this week for the or something and she said no she said it was her grandma's ashes are and then she kind of laughs and I was literally I was kind of horrified\nYeah that's what a chicken I say ... chat your horrible sexist racist pick a lady a young woman she put\nGrandpa has ... in the ... so there there's grandpa he said that like hey is a great idea 'cause I've probably seen a movie where this has happened and everybody laughed no it's gross it's disgusting it's vile why would you do that you wanted to do that knock yourself out\nLike I got a problem with that that's that's what you think you want to do not get stuff out but that's disgusting can I just say that say\nYou know it's not disgusting sleeping my pillow was amazing when I go to sleep at night my head it's my pillow I'm Out like a light I feel amazing I'm refreshed I'm energetic and guess what guys helps with your heart helps\nWith your weight helps with your blood pressure why is that because the more\nYou sleep better you feel the more fresh you are the more your body can recharge the better feels you're not putting on weight because you're not searching for energy and food yeah you see what I'm going with this study after study showed this my pillow can help with that small change goes a long way here's what they're doing for you right now for a hundred percent wishy washy ones rival made in the usa ten year warranty\nBoom buy one get one free buy one get one free called eight hundred Ninety three forty nine Seventy five could have my fellow dot com\nWhen you do use ... she called eight hundred Ninety three forty nine Seventy five or my fellow dot com code Benson you're going to get one for free buy one get one free my pillow dot com code Benson and she had been some shows your Twitter C. J. D. P. E. N. S. O. in ...\n[noise]\n\n\n... show [noise]\nNews twenty four hour news weather intrepid maybe six point five\nSend a Cox media group station\nIs news Ninety six point five ... ... and it turns first for breaking news\n\nWould you get when you combined the winter because hey Kmart calling radio ward large market stationary year the winner of that comes out they can Marconi radio award for large market personality of\nYour favorite radio station news maybe six point five Wu ... thank\nYou for trusting and making new Ninety six point five angel Kelly talk radio station and\nFrom ABC News\nBless them three weeks till mid term elections there's new information about meddling Twitter released data on more than ten million tweets by foreign operator dating back to twenty sixteen disinformation researcher ... says Russian and Iranian operators are mostly to blame they were\nYou don't know what to do because you want to embrace some of the stuff he's done but you don't want to embrace everything and you walk a fine line and you at ... at this point we're not quite sure exactly what to do when he came out yesterday and said hey look if the Republicans lose it's not it's not on me\nAnd it's the way she's right that at all over the last several months is what have you guys do you did this sweeping tax reform and you've done some other stuff but the stuff that you promised the repeal of price of Obamacare getting some immigration reform that was actually real done a lot of these things you've failed that so why should people give you another chance\nWhy should they but one of the big things that I think they need to actually tackle is the debt\nNobody wants to talk about it it's not sexy nobody wants nobody wants to talk about the debt it's massive it's huge it's really it's spending is what they need to tackle that's the biggest thing it's not revenue\nRight it's the receipts the receipts we have basically the revenue we have is we're writing checks that our ass really can't cash\nRevenues are up this year believe it or not we cut taxes at the beginning of the year and we have higher revenue this year why do we have higher revenues because we have faster economic growth higher wages more taxes are coming into the government knew we had four point two percent growth in this last quarter back higher economic growth brings in more of it\nYeah it does you know I mean ... insane\n\nNobody really wants to tax or attack those things right nobody does\nBecause you're talking about stuff as it grows and grows and grows and people look at it that's a touchy feely world just touched family I don't want to talk about that because I Want to get rid of Social Security and I'm like get rid of Medicare I'm gonna get married care I don't want to get rid of\nThese things because if I Do um to be in trouble for it if I take these things on these quote unquote as some people call them entitlements oh now Social Security you pay into that but I'm forty seven I'm under no illusion that I'm going to see any of that stuff\nBut I never worried about the giant huge growth of this crushing us than I Am whether or not I'll see Social Security at this moment in time\nTo ask you about the national debt Twenty one trillion dollars of deficits seven hundred and Seventy nine billion dollars summer and I think that could reach a trillion two thousand uh Nineteen months going on with that\nWas very disturbing images of the three ... programs that are river Balter Medicare Social security and Medicare [laughter] Seventy percent of what was your father about thirty percent of over so\nYeah that's that's big so what do we do right what do we do will first and foremost we have to do something that no part of government ever wants to do which is cat\nOr having a cabinet meeting a little while and we're going to ask every secretary to cut five percent for the next year\nCut five percent cut five percent\nWhy is it that we continue to grow at the rate that were grown we continue to everybody\nThat this was the thing we talk about the waste of money in government you have to spend your money to keep your money there's no\nWant or need to save any money you want to grow your area\nRight like if you're in a private business and you go out today and you talk to your boss they're going to give you hey you know this is what we want you to grow your area\n\nWhat you to grow all of these things and we want you to grow and grow and grow and with that you're going to get a bonus right but you got to go out and work for heart\n\nWearing in government it's like oh we got to spend everything we have\nBecause we got to tell everything the area's growing we've got to ... and the only way we can do as a spending all of our money and then going back and say we don't have any we don't have any money we need more money because I don't want to cut you know I'd rather see them do say I want you guys to go and figure out how you got five or ten percent\nAnd if you come in under budget\n\nWill give you guys bonuses real bonuses\n\nI'm okay with that I'd rather spend some to make some if you will meaning you know what everybody we're cutting across the top ten percent okay so maybe that saves us money cuts into ... but that sounds great but let's incentivize them if that's what we have to do\nAnd saying you know we're cutting to present let's just say you got a hundred million dollars for your little area over here which is nothing that you drop in the bucket\nAnd last year you spend a hundred and twenty million because you felt you had to do otherwise you were gonna get any of it and it was about keeping your budget and growing and growing your area and he said look can you do the same for a hundred million or less let's just say for the sake of argument do the same or a better job\nAt Ninety five million we could split it up amongst everybody else keeping it down there do something to incentivize them Trump wants to cut I like it that's a very very\nImportant request that and making everybody sitting around this table to Memphis amounts of money\nTo something that we can do and I I Believe we can actually do [noise] easily\nYeah I think we could actually do it and this right here they should make all the people on the left feel good you won't get credit for saying something like this and we'll see if they follow through on it\nYou take a look at the money was spent on these windmills or the killing all the birds and lots of other problems and destroying values and I'm okay with it I don't like giving subsidies to that so\nYeah I like the subsidies it with Chad but windows are bad we found out last week from Harvard they're horrible gotta get rid of them there were their carbon footprints bigger I don't want to subsidize anybody and I don't want to give money to anything tax\nCuts I mean we considered talking about that all day long but we got to figure out a way to cut this thing and as we become more modern why is it the more more technologically driven we get the worse it gets for us we can make cuts across the board we can streamline things we should be able to\nWe're not we're not\nIn the deficit grows and you can cut cut cut\nOr you can continue to spend spend spend but eventually\nThat ... going to break and we're going to sink three two three five three twenty four twenty three actually had been to choose your Twitter tweet at us love hearing from it you know a\nLot of stuff kids Canada a water they done a all for sure today was the day or we're going to talk about that also a website I become obsessed with I ... it is\nYou're going to become obsessed with I must tell you about it it is sad it is interesting and it makes you want to actually try it once just to see how it goes\nOh where do you hear this thinking of Web sites and what you go to bomb fell dot com\nYesterday amateur posted video up I was dressed to the nines yesterday at a meeting bomb fell dressed me fellas let me tell you some thousands upon thousands of guys are understanding you gotta look good right you wanna feel good and you also don't want to go anywhere we live in a world now where we like stuff to come to us that's where bomb fell comes in they're going to dress you to the nines as we would say\nAnd they're going to do with the best brands in the world you're not going to have to go anywhere first things first when you go to bomb fell dot com right you're going to get a dedicated personal style is a guy named Michael know about him we chat back and forth\nHe picks out this stuff since he think he might like these are the hip and cool things this is going to make you look good he sends it to me my size fits perfect feels amazing when you put on clothes\nThat are really\nCould close not cheap but you surprised at how good it fits like wait a minute yeah oh it's incredible\nAnd you'll look credible you feel good that's where it comes and so what they do is they ship you out stuff you've tried on which keep you pay for their free return shipping if you buy things multiple items you get a twenty percent off when you buy multiple items so thousands of guys like myself and now you are going to find this out it's the best way to shop it's the only way to shop\nGo to bomb fell today bomb fell dot com slash Benson twenty five bucks off your first purchase B. O. M. B. S. E. L. L. dot com slash Benson twenty five dollars off your first purchase bomb fell dot com slash Benson at you had been some shows your Twitter C. J. D. B. E. N. S. O. N. C. I betcha [noise]\nThree you're giving the U.S government a hundred million dollars a week while the media Republican senators are calling for tougher ... nations\nThe money arrived Tuesday and was given to honor of floods made in August to help stabilize Syria first versus being charged with a search for who is leaking and the federal government the U.S treasury employees accused of leaking super reports of the financial transactions for\nYMCAs back the Orlando Magic kicking off their season at home with a went over the Miami Heat one oh four to one\nI weigh your physical health sleep is involved in healing in repairing of your heart and blood vessels ongoing slipped efficiency is linked to an increased risk of heart disease kidney disease high blood pressure diabetes and stroke\nThat's according to the national heart lung and blood Institute's when I found my pillow and started staying asleep longer and sleeping more deeply I vowed I Will never use another pillow\nThe difference is real and you need to experience it for yourself I was skeptical but I'm a loyal customer now and that's why I have this great offer for my listeners backed by popular demand the my pillow buy one get one free offers here\nCall a hundred nine four four forty nine Seventy five or go to my pillow dot com used ... Benson to get to my pillows for the price of one get a better night's rest with the world's most comfortable pillow that's my pillow dot com promo code Benson\nIf they don't do something to stop migrants from trying to reach the U.S\nBut a North American nation Mexico's taking action more than two thousand on during migrants traveling through Guatemala resuming their journey toward the U.S a day after President Trump warned Central American governments they risk losing aid if they don't do something to stop them Mexican officials saying anyone who winters Mexico without proper visas\nFaces detention and deportation ABC's took seabirds in\nIn custody in Tennessee awaiting extradition to Texas former USA Gymnastics president Steve Penny\nPenny facing evidence tampering charges related to the sex assault investigation of now in prison gymnastics Dr Larry Nassar the Trump Administration has again decided not to brand China a currency manipulator\nBut the U.S is targeting China and five other nations including Germany and Japan for special monitoring for what the administration says are practices that are worth something the U.S trade deficit Richard Gere to ABC News looking to donate the\nMeat Mike Lester of talent wealth management the reason I really really like to sit down with individuals as everybody situation is different you have to find a way to\nNavigate through all the information and then coming up with that list of what you need will applies to very very specifically take a moment to sit down and look at what you're doing and let's make sure that your plan is right for you\nCheck out guarding your nest egg with my quest you're Saturday afternoon a new one or Sunday afternoon one Huron used only six five security security member spinner essay PC\nFlorida's chief elections officer in Florida you have three ways to exercise your right to vote voting by mail early voting or voting at the polls on election day makes sure your voices heard get ready get set boat\nVisit your vote Florida dot com for more information\nThis message is sponsored by the Florida department of state the Florida association of broadcasters and this radio station is it\nA huge savings I knew and previously furnishings writes huge saving court furniture plants and aren't just from a wide variety of new and previously in these furniture and acorn for your home run off you'll find so friends from one Ninety nine Ninety nine and more\nEverything in our nine thousand square foot she'll run its course started by guaranteed and in fact many for delivery or to take 'em to visit our handling course furniture than center at one three nine for sixth fleet taxing memorial highway or go online at ... dot com mentioned radio twenty and get twenty percent off\nThere's a reason we invented things like same day delivery in TV and Jay in the same jar we love convenience which is what makes a Kaiser Permanente so special we offer health care coverage together rather than having your doctor over here and your insurer there we provide quality health care in coverage under one roof and\nBring you up for other important tasks like making a quick sandwich Kaiser Permanente together we thrive taping dot org slash integrated customers and hope when I mean when it did you go particularly when it when he starts to be brought them into the ...\nWith the IRS back taxes and filed returns I'm attorney Justin clerk call me right now for a free consultation at three two one two weeks two one zero five five or does it you have power dot com to learn more Justin clerk by your side officers ...\n... do Bre or Washington watchdog and this is where Orlando turns versus for breaking news weather and traffic news Ninety six five ... [noise]\nWhat you buy tough retired auto service early Thursday morning Seventy three degrees were back in Ninety Thursday Afternoon also a thirty percent chance for scattered passing re mainly afternoon and evening friday arrangements up a little bit more to forty percent with a hive eighty six from gentlemen as news and meteorologist George walls and burger\nSex security triple team traffic\nBroken that truck on a high forehead and he found ... boulevard gotta left lane blocked the find overnight construction shutting down the ... you'll find east bound lanes closed in between greenway dean road and we've got the turnpike shut down for construction heading south bend in between the ...\nAll the way down to greenway crippled team traffic on average lowest\nNews Ninety six point five W TBO\nGet where you're going faster traffic alert\nWe give you traffic every segment of\n\nThree times a day when you need a little plastic every six minutes in the morning in Ninety six times ... out this messages for all of these sitting in the passenger seat and apologies if it gets a little uncomfortable but how does\nIt feel to be at the mercy of someone who thinks a random text and more important than your life someone who takes their eyes off the road was speeding along in a three time hunk of steel Frankie right well why not just ask them to stop or better yet the Olympia to text for them it might be a little awkward but believe me you'll laugh\nLearn more it stopped tax stopped rex dot org ... by the ad council and the national Highway Traffic Safety Administration\nNow that she had been showing new Ninety six point five ... ... [noise]\n\nIndependent inside and punk rock in life\nAnd show\nIt sure seems inclined to believe those denials\nAs he told the Associated Press here we go again you know you're guilty until proven innocent I don't like that and then he actually went on to compare the situation\nWith the Saudis and the accusations against his Supreme Court pick Brett Kavanaugh saying quote we just went through that with justice Kevin ... and he was innocent all the way as far as I Am concerned the president it seems very much inclined to believe the Saudi denials in this case\nSo I don't know what happened\nWhat we do know is the Saudis the huge part in this but let's just break this thing down so you've got a guy here\nA democracy over who is a writer for the Washington Post he was educated or at least his college education was here in America I think with the Indiana State he's got three kids that are\nUh American born and raised here so he's the guy that as influential almost two million Twitter followers really influential wanders in going to get some paperwork for his wedding he's in Turkey goes into the Saudi Arabian conflict never returns you know gets chopped up and put an acid\nOr whatever well not quite sure exactly how everything went down but we do know there there are certain things that we do know\nHow high did it go some of the close\nPeople around the prince the guy that's running everything in Saudi Arabia of the royal family\nThe security detail\nSome of those guys are there why did they kill them all of those things that people are going to try to find out but then you start to say okay well Trump needs to walk away we need to step away from this we need to get away from this it's not as cut and dry as people think because we're just like your bad person we want no part of this you would think oh it's that easy\nBut it's a difficult thing it's kinda like get a divorce right you got\nKids that you've got all kinds of stuff and it's just not walking away you you got stuff financially everything's intertwined and it's tough to do something like we're just going to turn around and walk away\nThe actual relationship between us companies\nVoices of things we work together\nReduce the risk to the United states of America the\nAnd that's a big part of it so it's not just Iran and the footprint that they're trying to grow their as they continue to sponsor terror it's cutting off their money it's doing a lot of different things and and and trying to you know stop their\nInfluence in that area of the world but there's a financial side\nThey invest into a lot of our companies they're wanting to become a leader in the world of investment they're trying to get away from fossil fuels that want to be a leader in clean out there trying to do certain things that would modernize them\nUh and and it it's not as easy as that but the big thing for us is we look at Iran and we say\nWe want no part of what they're offering the world we're not talking with uranium people were talking about the leaders over there who are of the state sponsors of terrorists who do push things out who do want to spread their hate everywhere who who are doing awful things and the fact that they're\nStarting to you know hopefully they can spread out is the way they are looking at it and all of a sudden we're like look as Saudi Arabia can't stand them either to mortal enemies and you got Israeli can't stand them so what we need to do was hopefully align ourselves in a way that can slow them down obviously with ... with Israel that's not a big deal but Saudi Arabia\nIs this weird relationship that nine eleven and all this stuff it's not as ... ... people make it out to be that Trump did you say\nBecause\nIf we step away here and we don't have a backup plan\nWhat is the backup plan is that Egypt is Jordan is it a few other nations that maybe we can help out with as far as arming and helping them in ways financially that will reduce the chance of us having to get involved later on down the road\nIf they did do something crazy\nThat's a possibility that is a possibility I don't know but it's not as simple as people want to make it out to be\nHeld her desk was from what I don't think we'd all of the un Saul you right but that doesn't mean\nThat ... may have to just cut them off like a dentist office like some of my colleagues for Assad who that was\nYeah it is unrealistic and you're getting a lot of people out there so we need to get away from that this is awful this awful we need to get away from him I get it trust us I mean I I Want to reduce our footprint and a lot of places and I ... and and there's things that I Would love to see us do but globally it's just not something we can do anymore\n\nAnd it's not as simple and trucks going to have to make a decision now he can make a decision that the Congress can say we're doing our own thing this is but you know you had Senator Graham and a few others out there that just want us to say it's enough is enough because there are people who who feel like with Graham is angry and upset like you watch yesterday about this he\nThe last few years they've been riots over the alleged victimization of young black men by police the fact is that most of the young guys who've had these fatal encounters were victims long before\nThey victimize or however was not the criminal justice system is is this your email your Jackson president stands staying true to America's national destiny consider these statistics fatherless homes produce sixty three percent of use suicide Seventy one percent of high school dropouts and Seventy five percent of all adolescent drug treatment patients in fact\nYoung men from Providence has are twenty times more likely to end up in prison and who grow up with a dad Seventy two percent of black children are born out of wedlock before any confrontation with a police officer most of these young men are victims on their fathers abandon and sometimes not knowing who their fathers are\nIf we want to keep black men out of prison where you must be thinking about ways to rebuild the black family and restoring men to the important role of fatherhood\nYou liked shipping money do you like knowing someone has your back as you're getting older and starting to be faced with the reality of Medicare and the future of Social Security my partners at the association immature American citizens otherwise known as a Mac are focused on protecting the interest of it sure Americans meaning anyone over fifty I'm partnering with a Mac\nBecause they offer an alternative perspective on how to solve problems like Social Security or foreign protecting our borders with commonsense immigration laws and fixing Medicare but a Mac is way more than a political advocacy organization they're member benefits include travel discounts roadside assistance discount retailing restaurant just kept in so much more a Mac is offering my listeners a free membership go to a Mac\nDot us forward slash check receive your first year free that's am a she taught us forward slash chat do costs no tricks know credit card require go to a Mac ... us forward slash jak recall eight eight eight three five five sixteen sixty eight that's eight eighty three five five sixteen sixty eight or online at a map that us forward slash chat ready\nAnnual ... outdoor craft\nSeventy percent off that rain\nCourt furniture than than camping Seventy percent off new retail prices and she was from a wide variety of previously in these furniture and acorn for your home or on a cell phone from one Ninety nine Ninety nine bedrooms that's from\nThree Ninety nine Ninety nine dining from two Ninety nine Ninety nine and more all items are hard to find guaranteed and inside favor delivery or to take home today make the smart choice and visit one of five locations in the ... Oregon line at Portland's furniture dot com mentioned radio twenty and get twenty percent off\nPutting rapidly including technologies that can improve that bald spot or your rapidly receding airline doctor by some team at ... dot com offers all the latest technology under one roof\nArtist robotics deal graft and smart graft and I know because they help me and my receding airline and I couldn't be happier\nThe wife likes it too and now Orlando hair M. D. dot com has non surgical stem cell hair restoration the most advanced hair restoration process available using the power of your stem cells to stimulate hair growth yeah\nTechnology baby called doctor by some team now at eight five five two three four hair eight five five two three four hair\nMost procedures are done in a day with very little downtime now Dr bastions team have stem cell hair restoration the most advanced the procedure anywhere and don't forget the consultation is free call you five five two three four hair Orlando hair MD dot com\n[noise] did you just look down at your phone [noise]\nHe did it again then you know you're flying down the road and the three ton hunk of steel\nAnd attacked takes your eyes off the road for an average of five seconds at fifty five miles per hour that's long enough to travel the length of a football field and caused some serious damage\nTurnoff trust me\nIt is you'll is\nLearn more stop tax dumped rex dot org ... by the ad council and the national Highway Traffic Safety Administration\nReady and Brian kill me you know me from Fox and friends in the morning and the Fox news channel which you may not know is on the radio show right here I really respect your diversity is thought diversity and viewpoints your viewpoints and political positions even when we disagree and sometimes we do so I Want to hear from you Orlando each and every day in the brain kill me Joe\nThe night 'til noon news Ninety six point five WTO [noise] this is six point five ...\nThree three three five three eighty four to three three three five three ha ha I Want to say like might as well\nAs all\nOf legal age can purchase as an says ask candidates from authorized retailers making also grow their own candidates plans at home in some jurisdictions all\nFirst year in Canada is going on we today super legal there and that's what's going on in ... ... I'm I'm sort of Canada is\nJohn\nVery legal so why you can even grow some uh I eat it's weird you know the rules are weird and I feel like everybody thinks\nThey look overhaul and then they see Holland and they're like oh wow that's a good ... you know\n'cause you can smoke weed over there in Amsterdam and things of that nature it's\nAll legal kind because you can't transport it so you can sell it smoking some of the shops but you can't transport it so getting it to there is the legal\nWhat'd you say fill it was it in in DC you can't buy it so somebody will buy stock for a hundred bucks and they get a bag of wheat that's exactly what they do\nYeah see it's if there's all these ... and it's so doing this right I mean it doesn't work probation and this kind of did it stop people drinking out you know\nStrict prohibition does not work under the previous approach them it's easier for a teenager to gain access to a joint then a bottle of beer well as we said criminals reefs huge profit\nAnd it's ridiculous and I think we need to do it and and I ... more than just states I mean let's just get the thing we classified let's legalize it and I know there's a lot of stuff out there were you know big business jet big business get big business involved that's what it has to be done because what is it right now Starbucks is looking at the Coca Cola\nIs is is now on board and I hear oh because here this but among many radio stations out there\nA high times is now up for investment so you can invest in God's\nThings like that and people are looking at how can I get involved in this it's it's it's it's it's kind of the wild west and you should look into getting involved in it but as far as just being adults can we just stop pretending\nJust for a second again I don't smoke I smoked weed I don't eat any edibles on any stuff and I don't care if anybody else does if you're an adult and ... there's nothing wrong with it there isn't\nAnd this whole thought process of this weird nanny state is if we can't ask God he drives me crazy you know\nCalifornia and Washington state in Colorado and everybody kind of\n... ... it's just completely stupid it really is three two three five three twenty four twenty three ... and shows your Twitter\nBritish rap and he said hassle he thought a hassle offers on there is not on their cameo dot com you guys did you go check it out you're gonna get lost in it it is the website itself is like a Gulf on me for the listeners who will send you a private message a personalized message of how close you are with your husband loves you eat is hilarious\nAnd you like you said George the guy and I would think Shatner the perfect thing for him it's great check it out here's your useless fact of the day kids does anybody filled you know Robert Zimmerman is\nA yeah yeah ... ... what's his other name [noise]\nProfiling there you go to Bob Dylan\nSo that when somebody says ah\nYou could throw this out to you Robert feminism and yeah and the like and then you don't feel like Bob Dylan\nLittle useless information going to be stuck in your brain of one of the rest of your ... [noise]\n\n\n... [noise]\n[noise] maybe six point five will be a be with him or led by new sound windows loosened\nUp comedian and Joe Kelly host overland those morning news every morning six twenty five ... teams do to bring you\nKnew weather and traffic will bring\nDown the day's Hi Dorie and have Washington watched on Jamie to present day last Tom Perry an ad Torrance will have your weather and traffic every six minutes breaking news weather and traffic every morning starting at five with Orlando's\nOnly all news morning show only on news Ninety six twenty five ...\nIf you own a gun you have a full time responsibility\nWhen you weren't using it to be sure kept him into the hands of curious children\nOr anyone else might miss you\nFor more information on firearms orange safety presidency PC though was missing broad national crime prevention council ... [noise]\nThis is news maybe six point by having the the [noise]\nFrom ABC News\nPresident Trump has worn Central American nations they risk\nLosing USA Today don't do something to stop migrants were trying to reach the U.S with a North American mission Mexico's taking action\nMore than two thousand on during migrants traveling through Guatemala resuming their journey toward the U.S a day after President Trump warned Central American governments they risk losing aid if they don't do something to stop them Mexican officials saying anyone who ... Mexico without proper visas faces detention and deportation ABC's choked secrets in\nAnd the media is also saying Trump got a personal interest here right now that I talked about all the time they're you know you don't but they don't get into the complexity\nOf Saudi Arabia being an ally also leading the charge there against Iran ...\nAnd the terrorists yeah it's it's very convoluted I don't think anyone's been saying that the Saudis have always been great plus standing [laughter] you know but this is a bit much I mean you gotta wait for the facts right right so that being said here's what Trump had to say\nIt depends on whether or not taking the crown prince flew about it in my opinion\nThe number one what happens whether or not they knew about it\nIf they knew about it that will be bad\nIf they didn't know about it things bad things can happen\n[noise] bad things can happen a buddy of saying also we can't just having knee jerk reaction to the situation\nFor the Saudi Arabia is a partner at they're our allies against\nIran and against the whistles and against what they're doing trying to take over the middle east\nBy the way since here last exceeding heading down the tubes if you look at what's going on\nNow with all of that being said you can't do\nWhat we've been reading about we're going to learn a lot about it\n[noise] course analysis from CNN Trump digs immoral hole in the U.S foreign policy this is really no different than than the nine eleven bill that we talked about\nFor two years ago where president is saying hey I I'm kinda the chief negotiator here I Can't come out swinging against Saudi Arabia right now because we need them but this is also why you have a co equal branch of government the Congress that can level some sort of punishment against Saudi Arabia if they see fit\nWhen they get the facts of the rest of the right or a yeah I mean this is how the game is played at the end of the day we're all sitting here going yeah they probably did this ... but you still have to wait for it [noise] meanwhile there's the other controversy\nGoing on or space yes yes of course Trump called the the the porn star Stormy Daniels for space yesterday on Twitter has been a lot of reaction to that he was talking to the Associated Press a he was asked about calling Stormy Daniels horse face\nHe said and there is no audio to this is just all just tried to do my best Trump impression\nYou know what you can take it any way you want [noise]\nDid you see the letter she put out a letter I had nothing to do with her so she can lie and she can do whatever she wants to do to get hired this phony lawyer\nYou take a look at this guy a stone cold loser take a look at his past they say anything about me I'm just saying I speak for myself you take a look and make your own determination\n... [laughter]\nBoy oh boy oh boy that would people are really doing the dance around the whole horse racing to did you hear all Lindsey Graham I did as a matter\nOf history [noise] elevate him does anything good for the country\nThat's what I was trying to say yesterday or will people hear it you have a different reaction right like you like last night I'm seeing different ... what's going on I missed part of the news what was going on today\nYou to give them that little\nTidbit of news yeah he referred to Stormy Daniels his horse race of all my gosh and there's some you know ... and going on at the same time yeah he didn't need to do that [laughter]\nWell of course he didn't need to do that or did you see what she did and she fired back gum vaccine called them tiny game on tiny yeah I\nNotice in the airway oh in the today show coverage of this they highlighted a couple of parts of this response from Stormy Daniels they left out the game on tiny because apparently horse faces a war on women I it is is game on tiny a war on men\nI've ever seen not I'm not saying that but he didn't see it covered in some places\nAre into you know I Know\nYou've reassured before they have great hands I Know why don't we don't have to go through the whole thing and I promise you we don't [laughter] course or ... people are always talking about and make millions talking about a billion dollars\nMan almost it's a it's a lot of money that's out there right now and you can't wait if you don't play Jamie\n... I I Know that you can certainly lose money when you buy tickets do and they don't win which is highly likely right go ahead be dumb I don't care\nNo I Can't wait I'm going to be glued to local news tonight or to see you know all the lines 'cause that's one of the standard things have any local TV get broadcast you have to go out to a corner store and you have to interview people about what they're going to do with all the money\nYes so the next drawing is held on friday worth about eight hundred and sixty eight million dollars the second largest payout watery history a and the cash option oil at a measly half half a billion about more than Ninety four million dollars [noise]\nSo yeah I mean I I look forward to that there is only one I think actually local TV news should have stopped a few years ago when there was one TV station and I can't remember where it was or the interview to do it at a corner store and they asked him what are you gonna spend the money on if you win and he responded something to be effective hookers and blow\nAnd that's like All right packet in that's the best actuality you will ever get\nWell one of these stories figure out a way to blow it he already the already did\nHe's like I'm just being up front about it I'm going to spend it on on on drugs and women\nYeah terrible human being good luck awesome uh by the way real quick from your home state of Texas yeah did you hear this Texas teams can't graduate until they watch a video about police\nIdle about white cat actually interact with the with an officer\nYes how to properly with officers during traffic stops I like it you do that's a life skill\nLike doing what you're told by a cop day we call that a life skill that's not just listening now kids in Texas don't understand that\nWhole thing is that you know you're you're supposed to be able to just yell and scream and called Cox names and all that stuff and and just not have any consequences about it\nSo it's not taught in the school is not taught my parents you have to see the video before you graduate rats where we're at I Want to see this video by the way cars I bet it's awesome [laughter]\nWhen he says give your license and registration\n[laughter] you get your driver's license and your registration and you hand them to the officer you know without pulling a gun or going to have like happy go lucky music the star of it is Donny the driver was doing and do what Donny driver does while okay other stuff to get to Roseanne\nResponding to the open up to ... how did it do ratings wise last night we will get to that\nAnd we've got some Wal Mart's assume what does that mean it's all coming up this is largely invade game show [noise]\nPeriod just learning apartment house has confirmed type thing of ... has found traces of red tide impress our county samples are taken from ... beach in the Atlantic satellite beach and cocoa the\nPresident Donald Trump said the U.S has requested turkey to turn over any recording it back but I didn't get the parents have fatty journalist ... champion that Saturday leaders denials and in the U.S not know the facts before taking action\nFormer USA Gymnastics president Steve Penny was arrested Wednesday after taxes grand jury indicted hand alleging he tampering with evidence and the sexual assault investigation of ... Dr Larry Nassar\nAnd ask for breaking news for severe weather and of course we all need a nap for traffic crowd wants three separate out the news and you point five ... mount feature liable for breaking news severe weather and traffic anyone simplify\nYour news and download her updates of new news Ninety six point five WD DOS and wonder where your vegetables come from\nOne of the reason we invented things like same day delivery and TV and Jay in the same jar we love convenient and which is what makes a Kaiser Permanente so special we offer health care coverage together rather than having your doctor over here and your insurer there we provide quality housing here in coverage under one roof\nBring you up for other important tasks like making a click sandwich Kaiser Permanente together we try Katie dot org slash integrated customers and hopefully the meal that you could predict when when it when he's ... and we'd like to\nHear warnings that magic mechanic or first come first served you can also drop your vehicle offer repairs or service anytime you want or scheduling appointments weight on breaks alliance tires to enough dams services and much more they transportation while we have here man don't forget to reserve and eight Ninety nine a day and shove re read all\nOf us a call at ... seven six to nine to six six one for every estimate visit magic mechanic dot com mentioned mechanics celebrating\nThirty years in central Florida is it ever has or\nMetro PCS is now metro buy T Mobile\nNow you get new plans with unlimited high speed data all month long haul and the the mobile network check out the new metro by the mobile today and discovered the smarter way to get unlimited\nDuring congestion the fraction of customers even greater than thirty bucks per month cleanup just reduce the image of customers may notice review speeds versus on the mobile customers video streams of forty percent of able in some areas the store for details in terms of conditions\nHand a bunch of a chance which was posing as members of the of the ... writes will the far right are you how to ... that were posing as supporters of Donald Trump\nThe Washington Post just published a new Columbine dissidents soda journalist ... ... the posters would receive the columns showed is assistant the day after he disappeared in the column show he warns of governments in the middle east have been given free rein to continue silencing the media\nThe Senate Commerce Committee asking auto makers here in Hyundai to testify next month about fire risking their vehicles the center for auto safety once nearly three million ... recalled owners have complained they can catch fire without being involved in accidents Richard ...\nABC News\nRid of the reason we invented things like same day delivery and PBS Jay in the same jar we love convenience which is what makes Kaiser Permanente so special we offer health care and coverage together rather than having your doctor over here and your insurer there we provide quality health care in coverage under one roof and\nBring you up for other important task like making a sandwich Kaiser Permanente together we try Katie dot org slash integrated customers and hope when the when the ... budget\nRapidly including technology that can improve that bald spot or your rapidly receding airline Dr Bassem ... dot com operas all the latest technology under one roof\nArtist robotics the graft and smart graft and I know because they help me and my receding airline and I couldn't be happier\nThe wife likes it too and now Orlando hair MD dot com has non surgical stem cell hair restoration the most advanced hair restoration process available using the power of your stem cells to stimulate hair growth yeah\nTechnology baby called Dr bathrooms team now at eight five five two three four hair eight five five two three four hair\nMost procedures are done in a day with very little downtime now Dr bass in team have stem cell hair restoration of the most advanced procedure anywhere and don't forget the consultation is free call you five five two three four hair Orlando hair MD dot com maintenance on your new car\nMetro PCS is now metro buy T Mobile\nNow you get new plans with unlimited high speed data all month long all under the mobile network check out the new metro by the mobile today and discovered the smarter way to get unlimited metro buy T Mobile\nDuring congestion fraction of customers even greater than thirty bucks for a month later this reduce the metro customers may noticed review speeds versus on the mobile customers video streams forty coverage out of some areas the store for details in terms and conditions\nFat or Leno dot com on medicine anymore and I cannot wait a minute my parents and my doctor reduce the amount of time and I'm taking\nWith are cutting edge that burning technology you can lose thirty to forty pounds faster and easier than ever before that one just forty days would burn fat or Leno dot com oh no it ain't five five eighty nine eight for for six and remember\n... years have Sean Hannity and you are listening to news Ninety six five W ... Orlando tyrants were breaking news weather in traffic twenty four hours a day [noise]\nTo buy to retire in auto survey early Thursday morning\nSeventy three degrees were back then Ninety Thursday Afternoon also a thirty percent chance for scattered passing rain mainly afternoon and evening friday range heads up a little bit more to forty percent with a hive eighty six from China landed when this news and meteorologist George Walden burger\nSecurity triple team traffic on\nWe're on the turnpike get dumped on leans shut down from orange blossom trail the green white and you got to find a four hour wait shut down as well overnight construction eastbound as lanes close prompt greenway to dean wrote an would get construction on the beach line east and west bound in between get port drive and constantly that Dr\nTripled team traffic I'm Richard Lewis news Ninety six point five W ... [noise]\nWhen you're on your way to work and you've got to get there on time we will be there for you I'm Jill Kelley host Orlando's morning news Jackie and head or on the ground and air or just in our helicopters flying high over Orlando to give you troubled teen traffic every six minutes in the morning this is where our land\nThose her first for traffic alert all the time ... you know the bad news basic point by a couple of the TV\n\n\nMain game show much jamming Julia\n\nHanging out at the uh Ecuadorian embassy in the u._k. guy and he's been\nGiven to do it now by Ecuador to earn back his Internet privileges they are basically treating them like a child at this point because we've heard reports but he doesn't like to have\nBeen released guy we all know joining us arms right mhm apparently doesn't like the baby smells really bad ... still into him no\nShe didn't know that people do but yet she still got to love your maybe only cleans up when she comes around what else does he have the shower\nFor that that's a good point but they cut off the Internet and you got to clean up your room before we give me your Internet privileges back\n... hour he's that funky yes Ecuador has allegedly ordered him to steer clear of contentious political issues as well while laying down some other house rules that are ordering him to clean up the bathroom and look after his cat\n[laughter] if you want to err on a ... he's got massive brio and then you got like cat litter and then he's not clean it up\nGive that to smells together that's got to be awful [laughter] by the way I like the way you just split by and they're telling them not to mention anything controversial that that dude told that's all he does I mean that's right so are you to do that what's ...\nHey give us a little bit lower profile please while you're hiding out here in our building\nAnd take half you know just keep up with your cat bait and clean the bathroom this dude is basically a millennial isn't living with his parents\nOh my gosh you're the millennial I Know I I mean I I have a harsh judgment for the millennials who just don't do anything and whether their parents' house I know a couple of them not most of the people I Know who are my age or do that and all of a sudden our producer ... who is also a millennial I saw him like duck is head like I couldn't see us reaction as he mad\nYou didn't agree I have no idea so join us sons do does sound like am I wrong about that sounds like the stereotype of the millennial who stays at home mom and dad's house a little bit but then he's over there like I mean\nGive me my Internet except that's actually kind of a slam yeah to some of the millennials I Know 'cause they have right now\nBut he's been living there in the u._k. since twenty twelve after seeking asylum there but this was a nine page memo saying that Assad is prohibited from interfering the internal affairs of other states or from activities that could prejudice Ecuador is good relations with other states then it says that his cat could be confiscated\nIf he doesn't take care of the thing\nThat they also tell us sons to keep his bathroom clean and or and the diplomatic mission would not pay for his food or laundry or other costs starting on December first twenty Eighteen ... they are laying down the law giving him an ultimatum and it does sound like the stereotypical millennial\nWe got our other money on the show ... ... am I wrong\nI I don't like that you're saying those things as a millennial I I agree with Jamie that I'm ashamed that that's how they perceive us but I get right I guess you're not wrong [laughter]\nYou down as they are just let you guys have your coping little meeting here I Want to be in denial I Want to pretend it's not true\nAlthough I guess out of the three of us You're the one who really moved back in with mom and pops right Jamie when I was Nineteen yeah mhm and you were living the good life rent free and all that it was incredible and you lay down the law with your parents are like I'm going to smoke\nWell and I was going to have my girlfriend over\nI I didn't say I didn't lay down the law I just said listen I smoked out okay I can do it in the house like you\nOr I can go out and the cold it's up to you yeah I have a girlfriend um I'd like you know some privacy it's much better than being in a car called\nYeah but if if and my my siblings freaked out over that yes why did you bring this up I'm just that well well you're talking about Julie and I was home\nYeah and I did I think my kids wouldn't never that never went to work with me I'm just throwing that out there I think of Ecuador really loves Julian Assange you got to kick him out you got to let go find his own way to president if he if they came out but I honestly man if you got to let them spread his wings now it's time for ... to get out there\nThat maybe you can get a you know I don't know a part time job and pay less ... you know yeah yeah yeah monitors feet will give him some seed money will start 'em off with a nice old Honda Civic or something and an\nEither way just just so you know I was back out of the house at age twenty [laughter] All right [laughter]\nI was just I was just kind of pointing out that you might actually be the most millennial person on the show and you're not a millennial\nWere mom and dad helping cover the bills when you were out at twenty though hanging out stuff no uh-huh no even when I was going to school at uh work at ...", "year": "2018", "show_name": "The Buck Sexton Show", "city": "Orlando", "day": "18"}