{"month": "10", "state": "FL", "station": "WDBO", "content": "Thank you it's great to talk to you\nThank you that you had been to Joe is your Twitter C. J. D. P. E. N. as though and this has always been my solution when it comes to something like this [noise] give them a new ways give them a fund where the money goes\nIn X amount of dollars and they invest it and then they are able to get some of that money out later on down the road whatever\nThat is a spread out so somewhat as easily as possible understand and maybe one or two kids get a little some extra everybody looked\nThen ... year old understand to the best player in the world is the best player in your position is I mean we understand that right you you know that's just for just a meritocracy we see this year the best person out there you give us the best chance to when you're the one who should get paid the most we understand that elbow always understood that sports I think all kids do and you need to cut them some slack\nWhen it comes to well not say it's not fair it's crap but I think a new disease and investments I think it'd be very interesting do something like that three two three five three twenty four twenty three at you had mentioned shows your twitters ... [noise]\nThree three President Trump is set to visit Orlando on Monday to attend and speak at the international association of chiefs of police of hosting convention center but it will be closed off from the public\nIn Orlando mother is back in jail nearly a month after she was arrested in her two year old son's death butter attorneys won't say what\nTwenty people are dead after a limousine crash in upstate New York\nDaniel Vargas has any six point five to ...\nWhen storms approach the clock is ticking you know it rains almost every day this time of the air but when there's a chance for severe storms damaging when hail extreme lightning and flooding we'll have you read it when it starts raining Orlando starts with it and turn your words were severe\nWeather and news ... de Vito\nFreedom doesn't start in the White House it stuck in your house here's Ellen ...\nA woman in Austin, Texas tripped\nOver a toddler running inside a furniture store and she broke her ankle she's still the store owners claiming it created an unsafe environment for their customers a jury agreed with her ruled against the store and awarded the woman eighty thousand dollars in damages everyone\nWatching the case was shocked by the outcome the kind of the toddler was her own son Jerry should have looked through the lens\nOf liberty and recognize that the story was not at fault she was\nAmerica was founded on this simple principle that ordinary people can govern themselves but that requires personal responsibility accidents\nHappen but instead of blaming others in filing lawsuits to just watch where we're going and more importantly put a stop to these friends are less less students from our check out our podcast that land of liberty dot org\nYou liked shipping money do you like knowing someone has your back as you're getting older and starting to be faced with the reality of Medicare and the future of Social Security my partners at the association of mature American citizens otherwise known as a Mac are focused on protecting the interest of mature American meaning anyone over fifty I partnering with a Mac\nBecause they offer an alternative perspective on how to solve problems like Social Security or foreign protecting our borders with common sense immigration laws and fixing Medicare\nBut a Mac is way more than a political advocacy organization they're member benefits include travel discounts roadside assistance discount retailing restaurant discounts and so much more a Mac is offering my listeners a free membership go to a Mac dot us forward slash jak receive your first year free that's\nAm a she taught us forward slash jet fuel costs no tricks know credit card require good a Mac got us forward slash jak are called eight eight eight three five five sixteen sixty eight eight eight eight three five five sixteen sixty eight or online at ... us forward slash chat\nDid he knew all in one hair color kiss and make it easy to killing your hair and home\nEverything you need to tell if he was the the ...\nNot by professional open to everyone Sally beauty\nProgressive present wish to help you do you ensure stuff\nAbout your budget Boston\nTo do what you want to pay for insurance and help you out there that you're going to get you down down down down down and I hear your budget oh wait that's just those kids laughing at me\nDown because of all the interest of myself as I say the law\nFor Ninety ... more than one hundred eighty four to harness we'll be on to play along with my music theory Martin says the arts activities and I talked to the local market in the morning\nLorna distribution for more information things in the autumn aren't that double ...\nFollowing message is sponsored by the Florida department of business and professional regulation Florida association of broadcasters on this radio station\nHurricanes can cause severe damage to your home or property so if you need doormen parents make sure you use only\nFlorida license contractors remember to check their references to get everything in writing and don't pay up front to verify your contractors are license to contact the Florida department of business and professional regulation on line at much lower to license dot com that's\nMy floor to license dot com\nYou know the thing about ... fans is these guys are real sense freaks they install upwards of one hundred and fifty cents per week at ... that is roughly the distance\nTo San Francisco they truly are the best go on line right now to a um Joe fence dot com that am Joe fans dot com and schedule your complimentary consultation today let them see family protect your family\nListen to burn fat Orlando dot com is Saturday at seven AM and six PM and again this Sunday from by seven pm to learn how you could lose up to thirty to forty pounds naturally with absolutely no drugs or shot and remember ...\nDo you have problems with the IRS back taxes and filed returns I'm attorney Justin Clark call me right now for a free consultation at three two one two weeks two one zero five five or visit you have power dot com to learn more Justin clerk by your side officers may\n[noise] this is six point five maybe ... this is it about right or wrong right\nI'm excited for the weekend jak going to go see a couple of movies because the venom and small foot bends interesting if you don't know would venom is a\nTom Hardy is in it and it looks just ... it's interesting in how people are looking at this movie\nIn the way that they're looking at it because\nIt ... ... he's a reporter he's looking at on something somebody's telling him about a story that he goes and checks on that his girlfriend happens worked for the company who for all intents and purposes is a guy that's similar to eat on mosque\nAnd he has like these sit by and then ... like other like these things they said about some way in the sky kind of thing is it working on some kind of like a\nFacebook meets you know ... kind of you know billionaire eccentric young guy who's trying to build a better person or better creature or combined the world of humanity and this and ah it invades old Tom ... a hearty body [noise]\n\n[laughter]\n\n[noise]\n\nBut they're trying to make it look like it's a it's you know it's it's the technology world versus the humanity world looks very interesting I actually I meant to judge or Twitter see a JD B. E. N. S. O. N. A. max amazing job or fifty what are you doing it's free to join they're going to advocate on your behalf on so many things are an incredible organization\nThat not only gives you the benefits of being there for you and the way that you look at things politically but also\nYes benefits oh so many benefits joins for free today for himself movie tickets Disneyworld Disneyland it's so much more a Mac dot US sports last chat\nA Mac dot us forward slash chat no credit card required no tricks just go there to check it out a Mac got us sports last year I Am a C. dot U. S. forward slash chat free one year membership for you at you had mentioned shows your Twitter C. J. D. P. E. N. S. so and it's the jets and shoo\n[noise]\n\n\n... [noise]\nOther lenders twenty four hour news weather intrepid maybe six point five\nLoosen but Cox media group station\nThis messages for all of his sitting in the passenger seat and apologies if it gets a little uncomfortable but how does it feel to be at the mercy of someone who thinks a random text and more important than your life someone who takes their eyes off the road was speeding along and a three time hunk of steel breaking right\nWell why not just to ask them to stop or better yet volunteer to text for them it might be a little awkward but believe me you know laugh\nLearn more it stopped ... dot org ... by the ad council in the national Highway Traffic Safety Administration\nShow Kelly from Orlando was morning news we get to the news and information every\nMorning as you hop into the car but then it nine o'clock Brian kill me does actually talking to the newsmakers and that's what's so great Joe that's what I have a chance to not only do you what I think's going on but you can tell me what you think's going on from your perspective I feel like we have a dialogue\nBrian filming weekdays I told you a new study to point five shoveling the video\nAssault and what has happened but for a lot it was for some it was patriarchy for some it was white men but for a good majority of people eat is about one thing and that his choice\nIt is about choice and Susan Collins addressed that\nI asked shutting cabinet whether the passage of time is relative to following president\nHe said just say should have become part of our legal framework but the passage of time and that honoring president in his tension to maintaining public confidence\nAnd that was about roe v Wade she was talking about\n\nI'm not saying that there are going to be states the challenge this because I I absolutely do believe that uh but as far as going way federally spores nationwide there there there being no no that's not going to happen\nBut what she did do was something very interesting she started out by attacking if you will the outside influences\nThat are coming to D.C to put pressure\nOn all of these people changing ... essentially coming in there and charging hard and trying to change your mind based on bullying and she she did not like that at all she did not like that at all and she let it be known\nAbout that and to to me I found that to be very refreshing and she also worried and she wanted the people out there who were were were out there protesting to understand something that we live in a country\nWhere we have due process where we have innocent until proven guilty and she's worried about the way that this mob mentality acted\nFinal nano legal print fall a bad deal threat\nThe presumption of innocence and and fair that\nKilled there on my thinking and I cannot abandon them\nIn fact I Would go as far to think that the way that this thing went down\nPolitically\nThe way that the pressure and this thing got out there and and a lot of this play a lot into what\nShe did\nIt really really did I think her her looking at this thinking we can't have this kind of stuff we can't have this this this this right here and it was right before it started they were in the chamber screaming screaming vote no vote no vote no afterwards\nBut they do\nBy the way I don't know if you guys have seen the picture\nProduce wrath of the uh try to find of Lindsey Graham\nWith the protesters screaming behind it was like so smart [laughter] it is just like oh\nOh good Chad Chad you shouldn't be this is just as wrong no this is politics politics was ugly and I'm going to tell you guys this right now I don't know if either side acquitted themselves very where all the entire thing it was an ugly situation that continued to get ugly\nAnd continued ... this was not something like one of those things like ah\nThis is not my best moment this is one of those things where this was not\nA great moment it wasn't it was not a great moment at all for either side and it was\nTo me I I'm just not I'm not happy about the way a lot of this stuff is went down and she she talked about Dr Ford and she said what a lot of us have said people I Know that are are are if you were dead red hardcore conservatives said you know I think ... I just don't think it it was the lady that\nThat was him that that that he did this and it\nReally got ugly and the fact is they talked a lot about this today the ... the the mob rule how this is happening\nOr what is what what is this about how much of this is about\nHim or is it there was this movement is all of these things and it was it was it was very it's been very on display the last couple of days and at times I ... I talked to several people and I'm sure somebody you guys have out there too\nI'm all for protesting I got no problem with it but sometimes I think you get to the point where you go over a line of of hysteria\n... that you allow yourself to be pushed over where you start to lose\nA lot of people out there that were like you know I I'm fine with the protesting but I'm starting to feel like this is this this you've lost a plot here\nWhat less when groups and their democratic allies are done the judge Kavanaugh\nIs nothing short\nOf monstrous\nGrassley there and and I think at times it has been ugly and it has been wrong and it was and I think what happened to\nBoise Ford has been ridiculous I think this entire situation and how it got out in the whole thing that's happened here it's it's ugly and this is not one of those things we look back and go there there was a proud moment for us it's not\nIt just makes the Clarence Thomas hearings looked like nothing\nAnd this is this is an\nUgly ugly ugly situation and ah I I look at this and think man [noise]\nWe we we we have a lot of ah of humans do and we better start figuring out how we're going to do this remember our founding fathers worried about what they weren't worried about foreign adversaries coming and attacking us and tearing us apart and were\nThey were worried about us destroying ourselves from within not that I think we're there yet but I Do believe we're on a path that's not good for us\n\nAnd we need to start figure out how we find some common ground and start coming together and discussing stuff in a mature manner that really a lot of these conversations deserve but we don't give it any more because [noise] we allow this mob mentality and the screaming and shouting to Mm and and name calling\nA rather than facts and it's it's this it and we're losing the passion\nFight too I think a lot of people their passion and they allow their passion to go from passion to hysteria and that doesn't help either three two three five three twenty four twenty three at you had mentioned shows your Twitter you tweet out a lot of stuff still get to talk of the bottom to mark Henrik\n... dot com going to talk about the economy where the economy's going how the economy is moving it and are we going to see a nice 'cause the the numbers are out today\nTrump you may hate him but to people on the Supreme Court tilting the court one direction on top of that\nThree point seven when it comes to unemployment we've seen this since the Beatles were together just the Rolling Stones and Keith Richards was still owe it yeah that's right she's still here but I'm just saying it's been a while and it's been a minute and that's\nThat's that's incredible three two three five three twenty four twenty three and she had been some shows your Twitter hey\nYou out there yeah talking to you so you got a job right you this job you've got you you're trying to figure it all out the economy's good you're fighting for good employees and the more I talked to people in the more I hear them say that the toughest thing to do right now in gross\nIsn't finding customers is finding employees will go zip recruiter dot com slash Benson I'm going to tell you why you'd be able to post your job for free but so you go there and you post your job because of a hundred the Web bleeding job sites from there\nThey go out and fish for the best candidates meaning they're looking for people out there that are qualified for the job that you have those keywords are matching everything up there and invite them to apply for your job then they're going to scan the ones that new\nAnd they're going to point out and highlight the best of the best of the best and then it's up to you in fact eighty percent of people who posted ... recruiter did a quality candidate through the site within the first day highest rated hiring site in America zipper greater boom what do you think of those apples post your job for free\nFor free think about you posted a my money you can be interviewing hiring people that's amazing ... dot com slash Benson zip recruiter dot com slash B. E. N. S. O. in zip recruiter dot com slash Benson zipper critter\nThe smartest way to hire at you had mentioned shows your Twitter C. J. D. P. E. N. S. O. and such as messenger [noise]\nThree three tropical storm Michael is expected to bring heavy rain as it moves in the Gulf of Mexico and it's projected to become a hurricane leave this week pirate current risk is now in effect from Tuesday evening\nGovernor Rick Scott has declared a state of emergency for twenty six counties in the panhandle area in preparation for any impact from the storm\nStorm surge and rain falls up to five inches is expected to hit the Tampa area as well\nDaniel Vargas says on his point five ...\nA system that has developed in\n\nAmerican history books are being rewritten right at the very moment to add the name Brett Kavanaugh to the company one hundred Thirteen justice of the United States Supreme court Monday morning make sure you click on the news Ninety six point five ... button on your dashboard and you will hear American history unfold\nRight in front of your ears on our land those morning news with Jill Kelley a news Ninety six point five WTO\nAre you fifth year older okay well I'm not going to ask you to raise your hand so don't worry but I Do want to ask you have you sign up for a Mac yet if your answer is no\nWhy it's a free membership for one year you don't even have to give them credit card information\nAnd take your eyes off the road for an average of five seconds at fifty five miles per hour that's long enough to travel the length of a football field and cause some serious damage\nTurnoff trust me whatever\nIt is you'll live learn more stop tax stop rex dot org ... by the ad council in the national Highway Traffic Safety Administration [noise]\nThis is news maybe six point ... how do you do the window\nFlorida governor Rick Scott ordering states\nOf emergency bra twenty six counties in Florida is currently tropical storm Michael CERN southwest of Cuba headed for landfall on Florida's panhandle this storm will be life threatening and extremely dangerous\nMichael expected to intensify into a possibly category to hurricane by the time and make landfall in the panhandle you cannot hide from storm surge so get prepared and get out it's an evacuation has ordered\nThe manager of a storm or a ... a store or a limo crash killed twenty people says the intersection of school here in New York there's long been dangerous all Eighteen people in the limo into pedestrians were killed when the limo missed a stop sign and plowed into ... and a parked car\nSecretary of state Mike Pompeo is gone to China after his fourth visit to North Korea um pail says he and dictator Kim Jong Eun made significant progress toward a denuclearization deal ... more results after an edge on schedule second summit between Kim and President Trump Richard can sue ABC News\nMeet my cholesterol how in wealth management the reason I really really like to sit down with individuals as everybody situation is different you have to find a way to\nNavigate through all the information and then coming up with that list of what you need will applies to use very very specifically take a moment to sit down and look at what you're doing and let's make sure that your plan is right for you\nCheck out guarding your nest egg with Mike Lester Saturday afternoon new one or Sunday afternoon one here on news Ninety six five security and security member spinner SAP\nFinally did he knew all in one hair color your hair and home\nEverything for the rules and you know\nNone of my professional open to everyone Sally beauty [noise]\nPresent we should be doing stuff\nOut you're not going to Boston\nTo what you want to pay for sure you got to get me to get you down down down down down here oh wait that's just that was kid's laughing at me\nDown because of the casualties dress company and prices limited by state law\nTime Clark Howard the guy helping you keep more of the money you make and this is where our land though turns first for breaking news weather and traffic lose Ninety six I W de Vito\nWatching by toughie tiring auto service\nMonday morning Seventy three degrees heading back to work with scattered rain in the forecast rain chance and ... percent and brief passing showers will be possible both morning and afternoon when a hive eighty nine in the rain chance of just going up your chance for heavy rainy increases Tuesday Wednesday and Thursday from channel nine when this news media relatives were more than burger\nI think here any trouble ... going to find the turnpike shut down overnight construction hasn't close South Bend from orange blossom trail to ... and we've got high for close as well construction has a shutdown westbound from colonial Dr ...\nReport and we find construction on the beach line let me twenty four hour drive constantly thrive in both directions finished road work on the far away he found that I poor\nCrippled team traffic I'm Richard Lewis news Ninety six point five ... hurricane\nThe Internet for the only source of information was\nNinety six point five ... don't wait for another hurricane to be on your doorstep naked battery powered radio part of your hurricanes or by ... and ... said at the news maybe six point five ... rely on\nDuring and after a hurricane now that she had pets in show on new Ninety six point five maybe [noise]\n\nHanging in time and punk rock in life\nAnd ... out\nIs happening out there in the world with Kavanaugh\nYou still have to go to work on Monday regardless of what happens this weekend and the good news is\nYou're heading back to work on Monday and an economy that seems to be still somewhat white hot joining us now from ... dot com is more cameras into September numbers and you look at say the you know where it wasn't just Nineteen sixty nine in the last time we were here market this kind of level this is insane right\nThe Beatles were together when we saw that last and so yeah it's quite remarkable the unemployment rate down to three point seven percent now some point people are pointing out which is not\nA a philosophical a plane but rather a factual one out there that was the time of the Vietnam War and a lot of prime working age males were not in the workforce then so that probably is a different picture but nevertheless so the stats are the stats and so yeah it's worth celebrating the job market remains this robust at this point\nWhich is which is crazy so let's talk about the jobs are now you know\nSo we're what three point seven percent and I always look at this like what's the ... what do you think the real job numbers are because you know when they say they're at five I usually say they're probably it's more like seven or eight percent because we have that wacky thing where if you're not looking for a job and you're no longer getting unemployment you don't count what do you think the real numbers are\nWell real is you know various from different people's point of view I mean they're all real and the sense that they have definitions on the definitions apply to you know metrics\nOr are there is another number of the ... the Labor Department captures which basically takes him to affect some of that what you're referring to and and that number actually rose a bit here to seven and a half percent but\nWherever those numbers are and we know there are a lot of people who have given up looking for work and there are people who basically don't qualify for either because of their\nHealth situation or some of that is opioid addiction but also the fact that they've been out of the labor force for a long time and their skills aren't as relevant as they used to be\nWe still have to measure the other part too and and ah you know I'm the first one to say well you know there's probably other people raising their hands too but you know I grew up in the mid west [noise]\nAnd uh the town where I hail from in Kansas has the highest unemployment rate in the state and the highest rate of opioid mortality my mom and dad a war from West Virginia we know what the story is there and my wife is from upstate New York Niagara Falls New York which looks like\nYou know a bomb in it so there are plenty areas the country that are are not faring well but still a there are ... are there other areas like where I sit here in the middle of Washington DC and other large cities across the country particularly those on either coast that are doing\nRemarkably well so all these things fit together but they aren't elegantly fitting together that's for sure\nTalking to mark ... dot com let's look at these numbers uh who did well and a ... and where do you see these job numbers heading as we head into the fourth quarter and spending and all of this stuff because\nThere's going to be vitally important as as we had there because a lot of people look at this fourth quarter as maybe the most important because we have Christmas shopping and spending\nWell we think well in the year at a on a high note to the extent that are now it looks like growth for all twenty Eighteen will be three percent and that's breaking up above the long term trend which has been more along the lines at one point eight too so uh that's one thing though whether we can get past twenty twenty uh when the benefit to the tax cut\nBasically go away and still have a higher growth rate that is something will only know them but in terms of ending the year I think there's every reason to believe that we're gonna continue on this same fashion uh the job market continues to add about two hundred thousand jobs a month we only need to add one hundred thousand\nTo absorb the growth in\nPopulation and so every time we get essentially twice that we are continuing to winnow away at the remaining so called slack in the workforce so\nI think there's every reason to be optimistic about basically those short end an intermediate terms\nA ... so I look at this and and I look at all of this across the board and I say to myself this looks this looks good this looks strong and then we get to the political side of things that I Want you to listen to to what Don Lemon said the other night\nTeam from to tread very carefully here because when it comes to the economy Trump got a lot of health inherited a growing economy a growing economy inherited it from its predecessor jobs are being\nDavid at roughly the same the average rate as under President Obama wages are growing at about the same rate they did under President Obama\nThe left is never going to get Trump credit and when I was listening to this the first thing that came to my mind is Michael Jordan had other coaches before Phil Jackson as did Kobe and Shaq but they never want any championships till he showed up\nA Trump you know the left is never going to give them credit but the reality is is you know when is it going to be is economy uh\nAnd and it has he help the economy because I think he absolutely has to help the economy not only from a point of how I think he's taken some of the shackles off and let it grow but I've also thing he's helped the economy on the confidence level which rarely gets talked about\nThey're planning tomorrow today with time learning how to best advice was he was sort of ... corporation registered investment advisor on line to financial dot com\nSally did he knew all in one hair color kiss and make it easy to kill your hair at home [noise]\nEverything you need your color for the ...\nLeft by professional open to everyone Sally beauty [noise]\nHi Jamie progressed as employee of the month two months in a row\nHi Jamie hit me ... me I just had a new idea for our song what the name your prices will so when it's like tell us what you want to pay ... trombone goes why you say well be fined garbage option to pick your budget then we just all these fingers now well acquired goes see becoming famous coming out\nYou know maybe anyway so your practice tonight I knew there\nWas a casualty insurance company and affiliates Bryson coverage match limited by state law\nNineteen Seventy five I have an important message you need to hear homes built before Nineteen Seventy five were built with cast our pipes that are currently right beneath your feet many homeowners aren't aware and your pipes maybe decaying completely out of sight\nThis ticking time bomb can lead to a devastating water damage to your home\nFrom is currently representing thousands of Florida homeowners to make their insurance companies pay to replace and repair their pipes our lawyers\nHave successfully won money for ... to ... their homes for your time to file a claim maybe limit [noise]\nIf you're home was built before Nineteen Seventy five visit pipe lawsuit dot com or call us now at eight hundred eight eight eight one two three four to find out of your home is affected visit our website at pipe lawsuit dot com or call us now at\nEight hundred eight eight eight one two three four more gonna Morgan offices Orlando\n[noise] this is maybe six point five ... [noise]\nSounds great area than\nFor high school cheerleaders to bring back to the football team during homecoming we recently some trees at Hartford high school had a little something extra in them\nPrinciple months from now they were giving him took some balls impossible oh brownies or may have been what he's with marijuana oil [laughter] by the way he sounds like\nHe's stone all principals ... new stuff all their lives\nSo here's the thing is a cheerleader brings this stuff in and it's very interesting how they found this out and listen to this app that they have out there a which in some ways I think that's a pretty good at but otherwise I think well wait a minute here\nMichael prince with the Harvard police department says the high school got a tip through the okay to stay app which allows people to pass along information anonymously alleging a Seventeen year old cheerleader brought pot brownies at school some for football players they say the leftovers we're used to sway bow hunting queen\nThe school's ... ... who is things that go let's go to the river surges\nSo she brings all these things to give it to the football players like not [noise] and then from there she's like oh my God I'd sell one of the other hand counting clan add up or maggots weighed a brownie chat [laughter] that is so raw egg\nDidn't involves going to be in hot water hunting drunk is one thing but officials saying ...\nDrug free zone could mean felony charges for those involved now after that student was considered the main suspect print tells us that she and her mother are both out of state right now with what they're calling a family emergency but he's hoping that he'll be able to sit down and interview them if they return I next week\n[noise] yeah I I look\nStupid things as we know kids do dumb things right kids do stupid things I don't know if we need to throw the book out or could it be a family of course it could be she can also possible not to say look I got the brownies there was somebody make and how do you know I made up I just brought him to school I didn't know who made them I got him from a friend or this that and the other\nApes do this is just me rises my commonsense thinking here and I know it's completely stupid how dare I Do anything like this at all so we just say\nLook stupid and kind of laugh a little bit ... by let's say look dumb thing to do we're going to suspend you for a week on top of that boom you're off the cheerleading\nTeam and dumping idiot again and we'll go from there\nIt's always gonna be the harshest thing in the world and I've been telling everybody thank God she didn't bring gluten 'cause she would have brought gluten the school that have been at\nI mean what else would you been forced to do you have to get rid of her I mean it's ...\n\nDo you know dangerous it is for people three two three five three twenty four twenty three ... beds and show is your Twitter you can tweet at us by the way a speak speaking of gluten what a week for Ireland so they open up\nTheir first right there first\nCrispy cream and then this weekend oh lordy in Las Vegas it's McGregor it's can be what what what\nI did not planned this I tried to gay and like I said I'm only a couple of them and have almost ... say that my backwards instead of just say\nWant to be around me you know they have [laughter]\nHey what it is [laughter]\nWhere's your user and those those things you hear where they fade out it's because well as we know he's a colorful character I had a friend in Vegas and uh\nIt is it the the the fight may be the prelude to the fight because the Irish and the Russians have taken over\nLas Vegas who will win the fight to be is one of the big favorites you know who this is this guy is a beast one of\nMaybe the ... as far as just ... him going to the ground in fighting is like it's other worldly he is a he takes world champions and tears apart hitting he's twenty six or twenty seven to no he's telling everybody wants to win this knock out the golden boy finish off the golden boy and then he wants to retire\nI don't think they're both him you know I have ... I have a schedule fit him discussing against the beginning because I have schedule I have to make waves I have to worry about myself\nWhy I have to think about it come on now [noise]\nMy problem [laughter] so what happened was he didn't show up\nMcGregor is supposed to be there for this he didn't show up and it is just and of course McGregor is just being McGregor\nIt's ... by knocking at out of high\nKnocking not mine knows who knows what kind of happened on Saturday\nThat that's going to have it on Saturday Night dot is what's gonna happen\nSo ... it's going to be very interesting to see how this thing goes in and and and a lot of what does he had to go to see if he had to go to make weight he had to go make weight that was the big thing McGregor didn't show up the fight before the fight their same McGregor may make a hundred million dollars off that that'll be very interesting honestly\nNot underestimate these guys\nReading my way to go when I have to make way\nLike the tomato also it's a mother and focus on opposite tomorrow hospitals they were going to talk about that because I\nHave done demar after tomorrow after tomorrow we'll see\nYour face off at all the all the all the years so I'm here to fight this mass Saturday Night he has to make way too many goes against our way off I'm not smart upon me I wanted\nTo make in a way I Want them to show up on Saturday nights because he has pulled out very last minute bin ... there's a follow whoa get the money that I saw and I told\nIt's like you do you go in there yet chicken tend to leave it there all day long cooking like Iraq\nBe very interesting I might actually watched that smart I still jak maybe we'll watch that that's always a good thing right like that's a father something to do like that [noise]\nWe're going to Vegas to watch the fights kids three two three five three twenty four twenty three out you had mentioned shows your twin oh my lord God sometimes you just need to McGregor to take your mind off all the other things maybe they should be the ones finding out over Kavanaugh jet mentioned Joe [noise]\n\n\n... [noise]\nNinety six point five ... Orlando going by new sound window for about ... group station if\nYou have a full time responsibility\nWhen you weren't using as the shore and can't get into the hands of curious children\nOr anyone else might misuse\nMore information on firearms storage safety presidency PC or business in brought you buy the value of crime prevention council zero justice is a certain\nA system that has developed in\nAmerican history books are being rewritten right at this very moment to add the name Brett Kavanaugh to become one hundred Thirteen justice or the United States Supreme court Monday morning make sure you click on the news Ninety six point five ... button on your dashboard and you will hear American history unfold\nSo if you knew about it they are also helping to cover up gang rape parties but okay I mean sort of defies logic what's here what she has to say though she went on MSNBC yesterday I talked to a Kate Snow about her story and she backed away from the suggestion that Kavanaugh was part of anything that happened to her well\nYou know and I'm going to wondering if one of those with right now [noise] I\nCannot say that he was one of the ones who assaulted me\nBut before that happened to me that party I saw red cat on their my song judge there\nAnd they were hanging down the area we're starting to feel disoriented and we're the ruins and where the other boys were hanging out and laughing I can share the laughing and laughing\nAnd very hard for me to talk about that but it's important that somebody said something because if ... was one of those people that did this to me there is no way in the world that have gotten ...\n... if yeah I mean I Know with the okay we'll get to the rest of the clubs if yeah if\nThat he should be it's a pretty important I think ... if he dies there's no justice in the world\nSo we all lost their minds a story\nThat she's coming out with his that Brett Kavanaugh and mark judge we're at a party were gang rates were going on as well as she by the way and if your presence at the party means you're guilty of gang rape then wouldn't she also be guilty of that\nAnd you have a couple of high school kids are yeah I was high school at the time right according to her a couple of high school kids laughing\nAt a party my gosh that proves that are gang rape is well and the timeline\nIf we were to believe her she's in college going to high school parties yes which also doesn't make sense but whatever but what about and Kate Snow follows up and ask a are there any other friends you told about this at the time anybody who could help us corroborate your story\nAnd [noise] they I vaguely remember people that I'm not quite sure in a hundred percent or their friends who are liberty party to remember now I think everybody in the county remembers this part of what we have we haven't heard from those friends so\nI'm asking you know was either people live in today I I I had more easily yeah there are people that know that there's already\nEverybody in the county new but the NBC News can't find any of them ...\nInteresting so you had friends there but no one can say they were there right well that's a familiar theme or Julie later gave for names of people that she says she told at the time one of them was a police officer who was dead and another person says I don't know anyone named Joey sweating it to others didn't get back to MSNBC\nShe also couldn't say whether or not she saw Brett Kavanaugh or mark judge spiking the punch of these parties which is something that she alleged in that sworn statement\nThey were definitely near the punch bowls though [laughter]\n[laughter] okay here's the Brett Kavanaugh flights were times when I die I saw him getting red solo cups took quite a few girls during that time there was green punch it those parties\nAnd I would not take one of those glasses from mark half of them right now not get paid I saw him around the punch bowls are the containers I don't know when he did that I saw him by them yeah\nHe was by the punch bowl Jamie or are we talking about is you get bad proves it okay and and then I mean she has trouble coming up with the timeline for her own reasoning for coming out now and you even here Kate Snow saying it's not make it a whole lot of sense what you're laying out here\nI wouldn't be here today except for about six weeks\nNow I happened to learn that you cannot be coming one of the people really short let that go to the Supreme Court then I became aware of Dr Ford and her description of what had happened to her at a party one time\nAnd then I might have information that might corroborate some of the things that she has faded from the ... thought about coming forward when you learned about darn good for you because I did not know how close I cannot ... possibly becoming the next ... then\nThey just want to get the timeline right about that because we nominated in July\nChristine for Dr written money's going forward for the Washington Post more\nRecently in September ... September they do it it's been several weeks but I'm not somebody who followed the rules and not political at all [noise] yeah\n[noise] ... and I don't know what may have happened to Dr forward but right now this lady sweat Nick and she's not credible and it's very it's very telling that MSNBC has this big exclusive with her and the today show doesn't even mention it in their opening today\nWell I mean they know that NBC News and MSNBC or actually branded differently here there is another [laughter] and it sounds almost funny to say level of credibility [laughter]\nBe seated MSNBC yeah but I yeah they're not going to touch that I'm actually\nKind of disappointed that they didn't touch it because she's not credible throw this case out barring anything else barring any real bombshell report you can throw this allegation in the dumpster\nAnd Megan Kelly with the you know case by case about Julie sweating it to ... and now I have an ... saying I've got another one right but says they were at the gang rape parties ha ha ha ha okay\nBut okay when is this all going to end is the big question a lot of people are saying and how far is it going to get pushback is they're actually going to be a vote\nLater this week is it going to be early next week we will get to that coming up a bit also a story about the NC double a shutting down the Gulf on me for that player\nThat had to leave the injury the head injury hair but he's still may die in the hospital\nBut they're shutting down the go ...\nNo you can't do that because he might not be able to play again if you did that because of anti double A. B. okay we'll get to that as well coming up this is the marquee event game show [noise]\nThree three star Michael turned into a category ... hurricane making landfall in the panhandle later this week [noise]\nThere is nothing there say will not do to make sure that every family in visitor and prepared for any possible impacts from this storm\nRick Scott has issued a state of emergency for those twenty bucks county\nBeing called the deadliest traffic athletic events since two thousand nine twenty people died when a limo driver in upstate New York randomly stop dying Corinne Bailey intersection and crashed into a parked car\nTrump will be in Orlando today speaking at a convention as police chief however revenge is not opening from the public\nIs anything ...\nListen to news Ninety six point five W ... wherever you go\nMy car when I'm On the go and the\nAn hour at home on my Amazon Echo\nNews Ninety six point five ... Ninety six twenty five\nSally did he knew all in one hair color kiss and make it easy telling your hair and home\nEverything you need to call it for ... you know\nLed by professional open to everyone Sally beauty [noise]\n... lounge presents for me as a what a greater\nMuch stimuli for this next one\nToo much but there there's got to get things just write like progressive name your price to tell us what you want to pay and we help you find coverage options at your budget and no way to like our back on it and\nDrink and you know it's completely dark to grab the insurance company and I can cabbage match limited by state law\nOne five nine and on line and accurate window indoor dot com that's accurate window and door dot com and joined me on the Florida homes and gardens show every Saturday morning at Penn right here on news Ninety six five WD via\nThe IRS doesn't mess around if they want your money they'll take it they can take your paycheck and bank accounts to even threatened your home or business and it's about to get worse the IRS just hired an army of new tax enforcers so if you owe back\nTaxes are smartest thing you can do what's called optimal tax relief\nOptimum has access to a special IRS tax assistance\nProgram called the fresh start initiative and their clients to qualify\nOr saving thousands even tens of thousands one call starts the process to stop the demand letters stop aggressive collection actions and stop at army of new enforcers from targeting you but don't delay it's important to act now while you still have options stopped him is a rated with the better Business Bureau optimize already resolved over a half\nMillion dollars in tax for their clients get your life back call now for your free consultation\nCalled eight hundred three zero five eighty Ninety six eight hundred three zero five eighty Ninety six eight hundred three zero five eighty Ninety six\nPopped him release\nSome restrictions apply for a complete details leak out to much actually dot com\nIs nothing just for all of you sitting in the passenger seat and apologies if it gets a little uncomfortable but how does it feel to be at the mercy of someone who thinks a random taxed more important than your life someone who takes their eyes off the road was speeding along and has three kind hunk of steel cranky right\nWell mine I just ask them to stop or better yet volunteered attacks for them it might be a little awkward I Believe me you know laugh\nLearn more stop tax dumped rex dot org ... by the ad council in the national Highway Traffic Safety Administration\nIs news Ninety six point by having your baby we'll turn first for breaking news\nBeing home family as transportation accident in\nThe U.S in almost a decade twenty people in total or dead Eighteen and a limousine that missed the ... here in New York and to pedestrians ... sister was one of the people in the little that lost their lives\nI was told that the limousine was going over sixty miles an hour on going down the hill hit on like ... a traffic stop on hit another car and then not other car had to put ashtrays\nAfter wrapping up his fourth visit to North Korea secretary of state Mike Pompeo went to China is a dictator Kim Jong own and he made significant progress toward a denuclearization deal China's says among hung way vice minister of public security is being investigated for bribery and others\nSupposed to fight and crimes among also president of Interpol was reported missing friday by his wife China's says mom has resigned as head of the international police agency Richard Gere to ABC News\n... waste gas and ruin your tires right now not retire and I was there was a formula Lyman special just Ninety nine Ninety nine well we'll give you a recovering courtesy in such a job or you die or an auto we fix cars shopping done right\nUp to Seventy percent off that's right and court furniture parents and her campaign Seventy percent off new retail prices and she was from a wide variety of previously leads furniture and acorn for your home or off from one Ninety nine Ninety nine bedrooms that from three Ninety nine Ninety nine\nDining from two Ninety nine Ninety nine and more all items are guaranteed an anti labor delivery aren't you take home today make US Marshal he's ended they one of our five locations in the ... Oregon line at the heart clearance furniture dot com mentioned radio twenty ... twenty percent off\nBeauty new only one hair color kids make it easy to come in your hair at home\nEverything in his color for you to sleep Rudy ...\nLed by professional open to everyone Sally beauty [noise]\nJamie progress AS number one number two employees leave a message hey Jamie Jamie [noise] this is your daily pep talk I Know it's been rough going ever since people found out about your archipelago ... Matt harmony but you will bounce back I mean you're the guy always helping people find coverage options with an enterprise tool it should be you giving me the pep\nTalk now get out there hit that high note and take mad harmony all the way to national this\nCatch all the insurance company in a fairly expression coverage match limited by state law\nA recent survey forty percent of Americans said they're unsure if they'll have enough money to last them through time for more than forty years certified financial planner professionals are certified to angel had been providing what time is planning an investment advice run the because they were independent they don't have any house\nProducts to sell you gotta complimentary consultation my calling for us at an age six nine Ninety eight hundred or one eight hundred execute\nThey're planning to borrow today what time finding ... corporation I registered investment advisor on line and financial dot com\nI'm John Morgan Morgan Morgan\nOr Thirty years we've been in the business of bringing dignity\nBack to those who've lost it and it isn't something we take for granted\nDignity means bringing the paycheck home being able to put food on the table and provide for your family\nThirty years I fought to bring dignity back to those who lost it after an accident or an injury\nAnd because we believe the dignity is also the heart of our charitable contributions and our fight for the powerless\nIs why we donated ten million dollars to pass the legalization of medical marijuana in Florida\nSo that the most ... people live and die\nLet my family's fight for your family\nAnd your dignity\nCall us for a free consultation\nSolve pound wall on your cell phone\nThat's pound five to nine\nFor the people dot com offices Orlando\nHey it's time Terry this is we're Orlando turns first for breaking news weather and traffic news Ninety six five W de Mayo\nTo buy to retire in auto service Monday morning Seventy three degrees heading back to work with scattered rain in the forecast rain chance forty percent\nAnd brief patterns showers will be possible both morning and afternoon with the highest eighty nine in the rain chance was just going up your chance for heavy rainy increases Tuesday Wednesday and Thursday from channel minded witness news I mean Iran with just your Walden burger\nSex security triple ... in a crash reporter Huey avenue and central boulevard it's going to find overnight construction on the turnpike dot families are closed from orange blossom trail the freeway and we've got a portion of life for shut down for roadwork west bound for colonial drive out to think read for oh wait a\nTriple team ... Lewis news Ninety six point by dumping you ... you\nKnow the ... Beckham show a news Ninety six point five ... a\nVery largely David band camp\nOkay last week we know the dark and Ford really didn't want to fly to Washington DC from California right going all over the world but find a D. C. would have been a no go whatever happened to that that story I'm sort of died on the vine\nThere's a lot of those inconsistency outages died on the vine now if this Russian report had come out a week ago I said I don't blame her for ... wanting\nTo fly so Jeff Ross in everybody's favorite ... national investigative correspondent is on the today show frequently he is back with another well another\nBig time breaking news story that well ... to ... see a blown the lid off of major doesn't other major scandal adding to his resume are telling us about how Starbucks is building up your life the way JC penny using skinny ... okay which I knew the words wrong might hurt you might wind up hurting yourself\nI don't know ... comes on the today show every once in a while\nAnd then he's got some reports yes sometimes they're ridiculous sometimes I'm like you know what I I wouldn't have known that okay you coming from a news background you say he's a little hockey\nYes she really enjoy making fun of him behind him watching this today and I was like I it it had me a little captivated I'm honest there\nOkay so he is looking at airports in airplanes all over the country right yeah it was the Emirates flight that got quarantine at JFK a few weeks ago yeah one of the ... so he breaks out the dirt monitor\nIt's called age or monitor\nAnd it well it measures how many germs or in any given space\nOut here on the plane was fourteen\nLoves little\nRobin services a major airport court major airlines find curious do we go near\nHer stuffed up in the security why do I get embarrassed while they get all that you\nHundred and sixteen on the German leader anything over one hundred on at least he has he been failed by a lot\nOver six times\nHundred and sixteen on the German meter anything over one hundred I got\nIt I heard that part already I don't need to hear it again even handle touch oh\n[laughter] okay we get it that good a\nSort of us have flying it or not too distant future so you know it's just a little dirty right it's not that bad Jeff six sixteen over\nA hundred of news gets even more ... than the samples was certified lab TSA misery swap contained ... tough led to the yellow and something called what's in it so that you're put us all that stuff\nThrown bacteria that we find normally are attacked them on the call and fickle bacteria so it just means that the surfaces are contaminated with less [laughter]\nOh that is gross [laughter] I'd like to take this moment to sincerely apologize this morning to\nWell Jeff Ross because he's telling me they got ... Philip ... poop at the airport that's what we're saying that's what we're hearing here that\nThat is correct with ... oh boy [laughter]\nAll right let's\nGet a lot of places in the airport are grows right the bends can't be that bad relatively speaking\nTo give you an idea how gross but the SATs or let's compare them to the airport bathroom\nSwab the toilet remembered\nThin came in at the look at that\nBad knees this airport bathroom you succeeded passengers at the airport\nWas on the buses are clean hands on", "show_name": "The Buck Sexton Show", "year": "2018", "city": "Orlando", "day": "08"}