{"month": "10", "state": "NY", "station": "WRUR", "content": "\nWas ... Amri talking with us in two thousand six he died earlier this month in Egypt Seventy two you can hear more about ... ...\nIn ... on our website sound opinions dot org ... what are we on the show next week\nNext week I'm going to have a conversation with any winning music supervisor Susan Jacobs\nFor more sand opinions listen to our podcast wherever you find those things the show was produced as always by Brendan banished act Alex clay born I on the contrary and Andrew Gillum\nMm Mm\nNot down to ... everyone the reading so now it's time to you what you have to ... ...\nYou\nKnow the man is losing the\nNew messages and engage me this is from Montreal I was listening to your episode where Iraq Dr Rebecca ...\nEvery time you have to expand my musical horizon to bring him up in a household that showed him that he could be a whole bunch of different things that he didn't have to just be a toxic\nAnd I think you're going to get a lot of mail from now on the airports now and that's why I actually agree basically with the position that the anti patriotic doing a gender our I Wonder if you pick the right song I may dislike but we but you know bribe you know also help to on the east there's got to be produced heroes\nAnd I thought that that is a personal trainer\n[noise]\n\nIt it's not exactly full of gender I don't think ... your outfit dominant\nMale but he is a male which I think it's also important because you know the traditional stuff as virtues them happy structures about how to be in the world as well that helps a boy ... which is also as important for boys or girls are so I Would suggest heroes and see\nHow that goes maybe you want to give me this and actually the show thanks for oh you did I\nSay this\nWas when policy German North Carolina I'm calling on the excellent empty barge show I go way back to these guys to that\nFirst uncensored album my roommate John and I was sitting in military school at China she [noise] and not like he lives in it but he had a good record store connection so anyway we got this up\nAnd we had no idea what was on it we put on that first track flu Armand [noise]\n[noise]\n\n[noise]\nAnyway I enjoy the show keep up the good work\nThis Russia for my expert on North Carolina I really appreciate and they'll hire interview a machine\nA leash a walk in the state of our plan they probably and I've often said this for the American version of the ... energy that had to seal and ah [laughter]\nI paid a it was definitely not for the faint hearted but uh anyway that was long very that uh they lay down\nAnd learn it all away delivering the average thanks for the shape and\n\n\n\nPay sound opinions this is Greg from Las Vegas awesome interview about Wayne Kramer I designed a couple of his albums\nWhen he was on epitaph in the nineties way was the coolest guy to deal with I'd gone to a chocolate you on TALK about the record the lay out at the top graffiti\nEverything she was such an approachable man and it was refreshing to hear the interview and I haven't talked to wing and so many years but a great show great interview and keep it up thanks [noise]\nNo more messages\nTo give us your opinions on sound opinions color hotline eight eight eight eight five nine Eighteen hundred\nWill be back next week with more sound opinions produced by WB easy Chicago and distributed by NPR acts\nAnd my question we all ... I'm ... I'm going to die and we'll get the answer that question when Mary ...\nCounteract prepare white national die on October thirtieth after little theater all the talking about all things to reality ... book kill or be able to pull that out about my ancestry more than ... black you that\nI Am a Christian Bailey from life from here with Christian dealing we're proud to be the highest rated to our live musical comedy variety show on public radio in this time slot during this weekend for our show in college leader in Saint Paul Minnesota with the school our brothers mismanagement Cunningham\nDirty projector live from here we make great radio [noise] good people [noise]\n\nThis evening at six and that we are you are ... Rochester\nWe got two dozen unable\nNo no no I mean\nMy opinion Jamie\nJ. lo o\n[noise] [noise]\n[noise]\nLet me\nWe were over on the news\nLa la la\n\nSaid oh\n\nYou're in radio a whole lot of shaken Joel W. R. U. R. W. I. G. H. Mike here with\nBorenstein [noise] God [noise] man I thought I Am [noise] I went and saw the rent [noise] and I'm Down to your eyes [noise]\nAnd you're on the right way to make [noise] God told me about the NFL announced the Carnegie\nMellon came a million dollars [noise] sugar Dr Richard ... [noise]\n\n[laughter]\n[noise] I'll go out and [noise] that and I found I Am [noise] and you wind up rather than [noise] than on your height\nYour rent your neurons are not concerned about the only thing I got in a bad guy\nFails [laughter] but I Know a dollar a day and that will come about kangaroo about John John with us Dr Jana go to the mail [noise]\n\nA\nWhole lot of chicken W. I. G. H. W ... are you are\nDr phil go up there malpractice they'll be from Nineteen Seventy five a song written by will go Johnson and you shouldn't go the doctor if you got aboard the\nBills before or that we heard music on the grill record label from Nineteen fifty six big company and the ...\n... by the way to have some great instrumental music out of the Pacific northwest I Believe it was your son Jordan a big guitar which is the al\n... and we heard a Bobby's bogey fifty now that that takes a second single sixty ... would you do something to me\nAt the Emmy angel who while we will hear from later on in the show with the low straight jackets incarnation but is it ... L. P. Eddie angels guitar party we heard caveman that goes back to Nineteen Ninety three whole lot of\nChicken that whole lotta shaken up baseball music here right now from and R B Hsu joined by Carl Perkins an album released back in Nineteen Seventy the only\nA member in this ... ... you might think I'm a firm the later lineups and R B Q is Teri Adams but Carl Perkins on guitar steep burgers at a guitar and vocals and heart Monica Jody technicals on base and vocals Tom stay on drums write gambler\nOr vocals and tambourine records Teri Adams on keyboards vocal and ... Monica Donald working with an R B Jews Charlotte Charlotte\n[laughter] [noise]\nMean [noise]\nCharles\nDo you do on a low maintenance all\nCharlotte does she have any\n\nDid you you mean by\nShe you know we\nCharlie Rose\nSupport for W. argue our digital media comes from our members\nFrom capital ... small batch come boots your brewery located on railroad straight were fermentation meets labor like ginger me and more open to the public on Saturdays from tend to growl are available to go online at ... ... dot com\n\n\n[noise]\n\n[noise]\nNo\nNo I don't know I like all ah [noise] well by by not bad in a hockey mom and dad and I lost my job bad guy\nHockey's a ban on an airliner\nYou know I Know\nWatching raw I don't know I was a guy that by not and bank and I found my basketball and you know I got back to the bank and I thought well\nI Am I right now and I said\nMan I met your by not dead and gone on\nLike a dog by\nDa da da\nDa da da da da\nDa da da da da da da da da da da da da da da da da da\nDa da da da\nDa da da da\n\nDa da da da da\nNa na bombing and all this done by a car wash it wrong about God and\nYou know I don't see the guy and then now than\nA bit and then they'll do it on a lot of the law but they you know\n[laughter]\nAnd why don't you go ahead and do it just got an addict and bought a whole lot of the you know you\nJust on that and they are paying a pocket not break the law on the line with God is that a bargain shopper they come back into the old model Don good about a\nMan and a dog you know I didn't do it I just oh my God that is a\nAnd roll out on it and my dog bed and I think\nGod God you know\n[laughter]\nBy play\nGet out of my life when I was a British soon\nThat\nPlace\nAnd my la la la la la la la la la\nLa la la la la\nMake it right when I'm Around\nAnd then we're not really been there and the genetic\nPlease man\n[noise]\n[noise]\n[noise]\n\nLa la la\nThings are very worried about assuming is doing All right we'll\nMy\nAnd\nWay down and talk\nAnd John McCain over\n\n\nMonth\nAnd\nA man\nAnd [laughter] [noise] I made a\nOf very\nAnd then the last day or you know in\nLife and now\nI'm not a\nBad now\nAnd\n\nThen you don't like hearing all then I don't remember names [laughter] you know and then they ended um\nA long\n\nAnd on and on\n... and\n...\nAnd and and\nThe\nNext day he died in Ninety Days and days and days and days and days and so now you're saying\nAnd I\nFound a\nJob and\nI Know my name is ... from North Germany but I'm ... I'm the drum aerobics go ... go ahead you're listening to ... ... I think you're on different radio\nMan\nThat's about\n\n\n\nAre now but\nI\nI'm\n\nOh oh\nNo it was our average wage I'd rather have returned [noise]\n\nJoined us here at all\n\nOh\nOh wow\n[laughter]\nOh [laughter] oh\n\nGod [laughter] oh\nOh oh\nI\nReally don't know I understand you\nAlso\n[noise]\nWow [laughter] oh [laughter]\nOh [laughter] God [laughter] oh\n\nWow\nDiploma from stupidity on you're listening to the whole nother shaking showroom disrupt radio oh\n\nI'm\nA ... ...\n... ... oh\nYou know\nAgain to pay me when\nWe [noise] we let\n\nOmega say mom I'm\n\n\n\n\n\nKnow my\nLed\n\nMe\n\n\n\n\n\n\nWith\nThe the\nOne\nA medicine\n\nNo no\n\n\nI'm ...\nI'm\nDouble you are you are a bad age do Rochester W. R. G. a job at my age the one that is like a different radio\n[noise] you'd think it'd be nice to be with\nRunner [noise]\n\n[noise]\n\nNo\nNo no no no no there's not many\nIt didn't really limited number\n... ... the\n\nThe the person who lives in\n\nDa da da da da da\n\nDa\n\n\n\n\n\n\n[noise] na na na\nDa da da da\nThat\nShow\n\nYou know a ...\nSay\nLamb\nDay [noise]\n[noise]\nNah nah nah nah\nTo [noise] try\nJob John ...\nDa da\nDa da\nDa da\nDa da da da da da da\nDa da\nDa\nDa da\n\nNa\nNa na na na na na\nNa na na\n\nNa\nNa\nNa na\n[noise]\n[noise]\nDrive by and then they go\nOn a key thing by some one I Know that the low\nYoung woman\nNa people\n\n... ...\n\n...\nAll other shaken bank tribute to the late John ... three songs with this group\nThe records that one from the Nineteen and we'll be crashes\nThat I don't remember your name before that the single story August Nineteen Seventy nine would lose my my ... Clark and he'll just a few months before and it was really getting into the birds and then I heard that\nOn the radio in the summer of Seventy nine and what what is that we found out what it was I was ... said I was lucky enough to see 'em live\nThat all of them are that single peak the number fifty six here in the states in October I'm Seventy nine kicked off the debt with another record a song off crashes from Nineteen eighty hearts will be broken the envy John ... passed away earlier this week at the age of sixty five years\nOld well I don't need to remind you but I Will need the different radio friday night\nSix o'clock rejuvenation would Mr Scott Wallace ... music from bad to Joe six 'til nine o'clock and then it's black and blue from nine to midnight with a great job curry all here on the radio different radio dot org will tell you all about it and I got to tell you\nAbout a boss happening\nThis week October seven genes the bug jar in Rochester lonely marsh\nWill be visiting Rochester danger bird will be opening the stroller and in between two will be provided by the war and the only B. J. J. both here are the will of Bush went off their latest or do we know they will be in Rochester on October seven genes\n[noise] um\n[noise]\n\n\n[noise]\nWell\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise] the ... I'm writing I don't know what's wrong with me\nJust say I'm not thank God that I read that remain [noise]\nWell it's\nAbout a mile na\nNa na\nNa na around the lab but I'd like to ... no way [noise] but if\nYou're buying a no I can say\nWell well\nWell\nNa\nNa na na na\nNa na\nNa na na na na\nNa [noise]\nDifferent reveal a lot of shaking ten years before they were staying alive the Bee Gees soft their first don't be issued outside of Australia and I close my eyes before that\nMusic from groovy uncle ... is a boss twenty music Jennifer nose up but meanwhile in medieval Britain it's all the trials are on a record label as always more music ought to be ... from the shadows going back to Nineteen sixty four and eat the cold rhythm and greens\nAnd the main idle del Shannon from the suburbs sixty five I don't think he shared with anyone thought about that one movie on over ... voices cracking the needles are up in the red man it's last been away\nActually got quite a number one twenty eight for a couple of weeks on billboards killer rock and roll from a a\nLong lost great rock and roll Mr del Shannon kicked off shoot the set that's close with the ... will the Bush but something new is when we heard author or do we know\nHe'll be in the wooly Bush men will be in Rochester the bugs ... Wednesday October seventeenth with danger bird and B. J. J. Boehner\nWhere where we'll coming up or what would we got later tonight you are stuck in the psychedelic era with the urban setting up to this show you dig that one\nOf the dog ... number one\n[laughter] [noise] I knocked\nDown and you know in a jar growling and joking that I'm going to\nThe lam gone in and and\nMy rent by the Jewish\nNominees giant Hi Roger I'm Crying\nBrian ... and Tom soon in I'm\nBrennan is in favor of\nThe moon and and and I\nMean why is trying to you know I Try to\nAnd\nMy daughter you know\nYou know the mom\nAh we\nBut the polish Donna I'm\nRyan has done\nHim on the show\nAnd a number\nMurder\nAn hour on and on and on the Internet\n\nAnd I\nAnd dance\nAnd way too\nDi John ...\nFrom the bottom by allowing rah rah\nRah live and die and no longer you know\nOn Iran's Josh I'm\nAnd they were strong and John\nTry and stop or and and and ... and ... and ... and ... and Ryan and and really\nOn [noise]\n[noise] [noise] Mm\n[noise]\nMm [noise]\nMm\n\nMm [noise] [noise] [noise] [noise]\n[noise]\nAnd she and\nHer\n\n\nAnd she\nShe\n... ... ...\n...\n...\n...\nAre\nAny news or [noise]\n\n[noise] mhm\n[noise] [noise] yeah\nBut but\nI've heard from\nDon't know how to model", "show_name": "Whole Lotta Shakin'", "year": "2018", "city": "Rochester", "day": "13"}