{"month": "10", "state": "MA", "station": "WFCR", "content": "Listen to all things considered beginning a five day on New England public radio where weekend edition is funded by you and the hearts brook school accepting applications for the twenty Eighteen Nineteen school years early childhood through high school programs\nClarity of thought warmth of heart and strength of purpose heartbroken dot org by Springfield technical community college offering information on except in the spring or fall semesters during an open house on Wednesday October seventeenth from four to six thirty\nStreaming of New England public radio is funded by you and they pass university graduate schools and asked and applied laboratory science that operation San rolling now for August twenty seven applications at bay paths dot edu\nRight they're featuring rare books now brings in more\nToday tend to for its missile ... school in North Hampton flamingo shows dot com this is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst stand it end he's P. R. ... ten o'clock good morning [noise]\n\n\n\nMm\nHa\nStreaming of New England public radio was funded by you and they passed university graduate schools and I asked in higher education administration enrolling for October twenty second applications that they pass dot edu\n\n\n\n\n\n[noise]\n\n\n\n\n\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic under appears AFC certify technicians Massachusetts state inspections she keeps garage dot com [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [laughter]\n\n\n[noise]\n[laughter]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the bench basis for a board room to ball rolled with Avi equipment and getting house catering hotel north Hampton dot com\n\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise] [laughter]\n[noise]\n[noise]\n\nStreaming of New England public radio was funded by ... riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\nThat's music of our country look\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nSix and a major performed by this whole her money or baroque orchestra directed by Nicholas begun it's approaching twenty four minutes after ten o'clock on Sunday Morning I'm drawing someone's thank you for joining us today and\nHope you will stay with us for musical box selections from the little Oregon book also if you should bookstore Huda bucks great predecessor and we'll hear a sacred ... them having with\nThe great surprise him a ... inch fantasy ... Benjamin Britten symphony number five of Vaughan Williams some English Metra goals\nAnd music of parents talk a composer you don't hear from very often 'cause orchestra work Peter Pan\nNow although one of the great ... Paris symphonies are functional sudden which were pre mirrored in the French capital in Seventeen eighty six part of a set of six that were commissioned and performed tighten at the at the very hiked up his international fame\nThis is the symphony number eighty six in the major it's performed here by the orchestra of the Eighteenth century directed by from Brooklyn\n[noise]\n\nSo here's an e PR is offering a special piece failed the tickets are are jazz baby oh buddy party on Saturday December first grab your tickets now at any PR but I Know\n\nDreaming of New England public radio was funded by un June riddle architect of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dog call Mm\n\n\n\n[noise]\n[noise]\n[noise]\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA creative non fiction writing enrolling no for August twenty seven applications that they pass dot edu [noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org\nAnd\n[noise]\n\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call [laughter]\n\nOn [noise]\n\nNa da da\n\nStreaming of New England public radio was funded by you and they got university graduate schools and I asked in higher education that dentist racial rolling for October twenty second applications that they pass dot edu\n\n\n[noise]\n\nStreaming up the waitlist public radio was won by ... Greenfield Caldwell virtual school public all like eight to twelve school first logic education from Massachusetts du da was rolling fall C. V. S. dot or\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\nSo here's the too many years offering a special ... chicken origins may be hurting joined us run you think about ... ...\nIt's ... some bubbly our car in the ... the dog put some of the first few clients that early bird this ... once they are Seventeen\nGrab your tickets no any PR\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at events bases from boardroom to ballroom with Avi equipment and inhouse catering hotel north Hampton dot com\n[noise] for corrupt ... from the little ... of Johann Sebastian Bach\nWith a performance by organist Christopher ... it was playing\nIn Oregon and have a source church built by the ... company not an old Oregon but one on baroque lines for short Christopher Eric with music of Johann Sebastian Bach\nWell it's pushing eight minutes now after eleven o'clock I'm John saloons thank you for joining me today on New England public radio WFCR ... Springfield Hartford in partnership with the UMass Amherst ended and eat P. R. dot net\nThere was a quick look at whether a nice day to day mostly sunny but cool with a high only only around sixty tomorrow is that is tonight it's cool but not as a frigid as last night was in many areas flows around forty\nTomorrow showers are likely a high in ... around sixty two degrees then mostly sunny day on Tuesday with high in the mid sixties and mostly sunny on Wednesday has swelled up cutting up during the day and it's a chance of showers Wednesday afternoon\nThursday looks like a beautiful day although quite cool was high so me and the forties but sunny on Thursday so we're\nGoing to go through some uh uh\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\nSing onto the lord a new song\nThat was the setting of the text from some Ninety eight ... books to who to\nWas performed by soprano Emma ... with a an ensemble consisting violinist John hallway and unfair to Kramer the gumbo played by up to religion and the Oregon by Lars Earl Lars Erik Martin ... sorry about that\nIs of books to who them\nIt's a just short of twenty minutes after eleven o'clock on a Sunday Morning I'm John ... and this is New England public radio in Amherst in Springfield that idiot five plus one north Adams at one on one one ended any P. R. dot net\nStill to come we had music of Benjamin Britten riff on Williams some English metro goals and we'll hear a piece by the Austrian born composer who lives in the United states for many years Ernst tough\nInteresting piece which I Hope you'll enjoy\nBefore that the way I Want to remind you that New England public radio is planning another jazz baby holiday bash you can act now to get a special a deal on tickets for Nineteen twenties themed party\nKill so it was hot six will be coming up from New York City as they did before to play for the dancers and speak easy at the hotel north Hampton will be mixing up some prohibition era cocktails\nYou can get that early discount before Wednesday October seventeenth last year's jazz baby did sell out so grab your tickets now go to an E. P. R. dot net and scroll down into the you see the are linked to jazz baby and you can buy tickets at any P. R. dot net you can also\nLearn all about all the great ah\nInformation in music programming here in New England Public radio at any P. R. dot net and if you're interested in more detail about any of the music that are playing you can access art playlist on that site as well it's a great place to to go to wander around the west\nStreaming of New England public radio is funded by you and valleys solar local TV design at the installation helping household secure state or federal incentives and live carbon free and the Fort won three valleys solar dot solar\nSand on me sick as well and it's definitely worth this\nOkay we're going to move to England now to the Nineteen thirties and really work by Benjamin Britten and one neck really put him on the map promising young composer worked for oh about and strengths called the ... cortex\nHere's our boss sheriff Francis with members of the down the court\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n[noise]\nMhm\n[laughter]\n[noise]\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org\n[noise]\n\n\n\nUm\n[noise] um [noise]\n\n\n\nStreaming of New England public radio is funded by us they have to go to ... graduate schools and applied laboratory science that operation rolling now for August twenty seven applications that they pass dot edu\n\nSo here's they get to any New York is offering a special treat failed the tickets for our Janis ... the whole buddy party join us for an evening of that to to help folks taught sex\nSipping some bubbly our car in the ... the hotel does that put on Saturday December first few clients would that early bird this help before Wednesday October Seventeen\nGrab your tickets no any PR\n\nOh\nOh\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional ... education business health sciences psychology A. I. C. dot the Mm\n\n\n\n\n\n\nNew\n...\nFor ...\nSo here's they get to any New York is offering a special treat he'll be a lot of chicken or jazz be the whole body already joined us for an evening advancing to ...\nIts sipping some bubbly our side car in the ... the hotel north happened on Saturday December first few clients with an early bird just tell people when they are Seventeen\nGrab your tickets no any PR yup yup\n\n[noise]\n\n[noise]\nStreaming of New England public radio was funded value added American International college offering low residency graduate programs for the working for ... education business health sciences psychology a icy ... Mm\n\nMm\nStreaming of New England public radio is funded value added American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n\nMm\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\nDreaming of New England public radio was funded by ... rental architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\n\n... for\n\nStreaming of New England public radio is funded by you and they have university graduate schools and asset applied laboratory science that operation that rolling now for August twenty seven applications that they pass dot edu [noise]\n\n[noise]\n\n\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the\n\n\n[noise]\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts do now would rolling fall Gees easy yes dot org [noise]\nJohn Ritter conducts the Cambridge Singers\nNo I'm not so na na na na na na\nNa na na na na na na na ... [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nUm I don't know\nThat that\nI Love the\n\nShow and I\n[noise]\nMean you know [noise]\n\n[noise]\n[noise]\nStreaming of New England public radio was funded by June ... architects forty year legacy of commitment to community design celebrating the next generation of leadership vacuum read all dot com\n[noise] no no\n\n\n\nNo [noise]\nOh\n[noise]\n\n[noise] [noise]\n\n[noise] um\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\nYou know\n[noise]\nHere's NPR's offering a special treat failed the tickets for our Gen is the holiday party join us for an evening advancing helpful taught sex\nSipping some bubbly our car in a speech at the hotel dog ... on Saturday December first few clients with an early bird discount before once they are Seventeen\nGrab your tickets now at any PR\nThe or na\nNa na na\nNa\n\nNa\nNa\nNa na\nNa na na na na ... have\nTo the ...\nNa\nNa na na na\nAnd AA who\nAll\n\n\nAlone in\nA in a on a on a\nDay\n\nAnd my\nManager\nFor a long\nNa\nNa na ...\nStreaming of New England public radio was funded by you at the American international college offering ... residency graduate programs for the working professional education business health sciences psychology hey I see the uh\n\nLong line and\n\n\n\nWe\nHave now Sean na na na na\nNa na na\nNa na ve change deeper must be very interesting\nBut then they told me I Would do that and they may not be\nAll today\nAll the junk bond strongly Quinton that's gone for\nA\nLong long long long long haul and da da da da\n\n\nDa na\nNa na na na na na na\nNa na na I'm\nA new\n\n\n\nOne or two away I own my\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now we're rolling fall gene C. V. S. dot org\nTown that's about one third\nGoing on and\nOn your knees\nToo small for\n\nActing\n\nAnd na na na na na na na I Can't concentrate is long gone by the\nWay the other one said\n\n\n\n\n\nStreaming of New England public radio is funded by you and they pass university graduate schools and asks and applied laboratory science at operations enrolling now for August twenty seven applications that they passed dot edu [noise]\n\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for full gene C. V. S. dot org [noise]\nOh\nOh whoa whoa whoa\nWhoa whoa whoa\nWhoa whoa [noise]\n\n\n\n[noise]\n\n\nScreaming of New England public radio was funded by you and they sat university graduate schools and I asked in higher education administration enrolling for October twenty second applications that they pass dot edu [noise]\n\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu oh\n[noise]\n\n\n\n\n\n\n[noise] we've been listening to selections from\nThe ferry queen music for the theater by Henry personal depart earlier instruments and the ... instruments baroque orchestral conductor by ...\nStreaming of New England public radio is funded by you and they passed the university graduate schools and asked and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\nOr Chu Chu stay tuned for the Boston symphony orchestra coming right up we've music of Eric Nixon and a few hundred us problems including\nThe first piano concerto with soloist alien Corey mo hope you stay with us\nAnd to enjoy the afternoon of ... New England public radio WFCR in Amherst Springfield Hartford\nW to four to eighty Williamstown W to six six eight W north Adams Wu ... each Pittsfield W to five to ... Lee and W. to five for a great variation in partnership with the mass Amherst ended NPR dot net\n\nThe following as an encore broadcast from the twenty sixteen twenty Seventeen season of the Boston symphony orchestra for information about the current season of the BSO visit us on line at classical WC already dot org slash BSO\nFrom city hall in Boston I'm Ron delegation are welcome to a W C R B broadcast of the Boston symphony orchestra\n\nWould you ... ... is the result of a unique balance between order and emotion now undress Nelson leads to be a so in a celebration of you're honest ROMs that includes the first piano concerto which was angry moment [noise]\nIt's part of a program that also includes the composers exuberant symphony number two [noise]\nUnrest Nelson's leads masterpieces by ROMs without anger among them\nAs well as the world's premier by Eric Nathan coming up on this Boston symphony orchestra\nStreaming of New England public radio is funded by you and killed riddle architect of forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com [noise]\n\nWe'll do matter where your own loyalties fell during the presidential election of two thousand sixteen\nThat we're all reminded of life's unpredictability\nAnd as the election recedes into the past and the country moves towards the future\nThe artistic expression of what we share as human beings becomes ever more vital\nThe Boston symphony answers that need with a series of concerts that feature heartfelt illuminating or Castile masterpieces by Brahms\nSide by side with brand new music by dynamic and expressive composition of voices of our own day\nI'm Ron delegation joining you from the W. C R B broadcast booth at symphony hall here in Boston's back pay this broadcast from city hall is supported in part by the Gregory budget foundation dedicated to supporting the performing arts in greater Boston\nWell a constant you're about to hear leg throughout by R B music director ...\nIs one of four programs over two weeks that celebrate bronze\nIt begins with Eric Nathan's the space of a door\nFollowed by the piano concerto number one by problems with soloist aligned with ... and then after an intermission the concert ... with the second ...\nEric Nathan's relationship with the Boston symphony goes back informally to his childhood and family visits to tangle what he later participated in the Boston University tangle with Institute as a trumpeter\nAnd like so many of the young musicians or be you TI it was during those summer days in the Berkshires\nThat he decided to devote himself to music\nProved to be his calling not performance\nSince then the cultures in histories of physical space is\nHere's they didn't do any yours offering a special treat he'll be a long time for our Janice baby over the party on Saturday December first grab your tickets no and in your\nVisit to the provenance at the maintenance fired the base of the door\nIn his notes for the peace and writes [noise]\nUpon entering this temple of books\nBuilt in Nineteen thirty six one is welcomed by a grand sight\n... books rightly illuminated I imagine the energy late ... and all of the countless stories the voices of offers and the characters\nEach work a portal to another world\nThis was my starting point providing a kind of scaffolding for the peace and he goes on to state that the space of a door also pays homage to Brahms by taking inspiration from his symphonies numbers one and two\nParticularly the rising minor Stewart in the horns that opens symphony number two in individual that plays a key role throughout my work both harmonic leap and\nStructure [noise] say George opened and use our music director Congress voting against this Boston Djibouti orchestra conscious with Arab nations let's face it the door from WFCR be [noise]\n\n\n\n\n\nStreaming of New England public radio was funded by ... riddle architects oh forty your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\n\n\n[noise]\n\n\nStreaming of New England public radio was funded by ... architects oh forty your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\nBut is Ramesh flushed out the or Castro textures of a symphony he retain the voice of a solo piano\nUltimately forging a large scale unified artistic statement for\nGone [noise]\nNow coming on stage and Ramona and music director adverse no serious to continue this Boston symphony orchestra conquered we'll hear [noise] read ... number one by Brahms from governor you see are the [noise]\n\n[noise]\n\n\nStreaming of New England public radio was funded by you advocate that university graduate schools and I asked in higher education administration enrolling for October twenty second applications that they pass dot edu\nOoh\n\n\nStreaming of New England public radio was funded by you and they sat university graduate schools and they asked in higher education that dentist ration enrolling for October twenty second applications that they pass dot edu\nA a a\nA\nA\nA\n\n\n\n\n[noise]\nSo here's the too many years offering a special treat failed the along tickets for our gender speedy although the party on Saturday December first and grab your tickets now it's any PR na na\n\n\nMm\n[noise]\n\n\n[noise]\nWell\n[noise]\n\n\n\nUh\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n\nStreaming of New England public radio is funded by un they pass university graduate schools and that's and applied science enrolling for October twenty second applications that base paths dot E. D. [noise]\n\n\n\n\nStreaming of New England public radio was funded by you and they passed university graduate schools and I asked in higher education minister ration enrolling for October twenty second applications that they pass dot edu [noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with a the equipment and again house catering hotel north Hampton dot com\n[noise]\n[noise]\n\n[noise]\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot the\n\n\n\n\n\n\n\n\n\n[noise]\n\nNo no ...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\nMm [noise]\n\n[noise]\n\n[noise]\n\nSo here's they get to any New York is offering a special treat failed the tickets for our Gen as being the holiday party joined us for an evening of dancing to help folks taught sex\nIt's sipping some bubbly our side car in the speaking at the hotel non happened on Saturday December first few clients with that early bird discount before Wednesday October Seventeen\nGrab your tickets now at any PR yup yeah\n\n\n\n\nSo here's a tip any PR is offering a special treat failed the tickets for our Gen is basically a buddy party on Saturday December first grab your tickets now it's any PR but I Know [noise]\n\n[noise]\n\n\n\n\n[noise] no no\nNo no\n\nA\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n[noise]\n\nWe've just heard the piano concerto number\nWhile you're a hunter Strom ... country director for the hall\nBy soldiers\nThe Boston office and music director\nNow see [noise] a lender mow it will just orchestra three previous occasions [noise] so much the rebels piano concerto when gene much or Nineteen Ninety seven [noise]\nWith James ... concerto in March of two thousand with David did many things you want to share with Hank in July of two thousand [noise] but I'm very mo now heading to the stage door followed by our conductor undressed Nelson [noise]\nStay with us this celebration of ROMs continues woody exuberant simply number two still ahead in this Boston symphony orchestra\n\n\n[noise]\nMm\n[noise]\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [noise]\n\n\nUh\nUh\n\n\nA\nStreaming of New England public radio was funded by ... architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum red dot com [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\nSo here's they didn't do any of the earth is offering a special treat failed the tickets for our Gen is the whole buddy party joined us for an evening advancing thick helpful taught sex\nIt's sipping some bubbly our side car in the ... the hotel not happen on Saturday December first have a few claims that early bird discount before Wednesday October Seventeen\nGrab your tickets no any PR met\n\n\n\n\n\nStreaming of New England public radio was funded by you and cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n\n\n\n\n\n\nStreaming of New England public radio was funded by you and they passed the university graduate schools and asked in higher education administration enrolling for October twenty second applications that they pass dot edu [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\n[laughter]\n\n[noise]\n\n\n\n\n\n[noise]\nKnow\n[noise]\nStreaming of New England public radio was funded by ... architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\n[noise]\n\n[noise]\n\n\nOh\n\n\n\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com na\nNa na\n\n\n\nBy a gift from the Richard ... the Hartford foundation for public giving\nAnd by listeners who include any PR and their will or stay planning more information is at N. E. P. R. dot net coming up next it's from the top at three o'clock my colleague Cory and Jerry is planning an island hopping adventure through ... in Athens\nAnd you could go along New England public radio will lead a small group\nTo her on a twelve day adventure through Greece next to me you could walk ancient archaeological sites and tour an island winery sunset cruise around Santa rainy will be something to remember to take advantage of an early bird discount before December first get the ... details that\nSo ears are too many years offering a special Korean Sylvia long term storage as baby already party on Saturday December first [noise] grab your tickets no at NPR net [noise]", "show_name": "Sunday Classical Music", "year": "2018", "city": "Amherst", "day": "14"}