{"month": "10", "state": "NY", "station": "WAMC", "content": "This is Northeast Public radio WAMC F. M. H. D. nutty point three Albany W. R. U. N. H. D. Ninety point three rooms and Utica WAMC ... Ninety point nine Kingston W. O. F. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC a an HD\nNinety three three candidate Harry WAMC age do you want it for nine taekwondo rogue of WAMC wage do you want to buy one great Barrington W W E S H da da na na na Kisco W. A. N. D. H. D. Ninety point one stamper W. A. and our eighty eight by\nBrewster and WAMC am fourteen hundred Albany Hi this is Alan\nI'm here with Joe Joe ... I have no fingernails with who you're we did very well on the lot box we we've got five hundred thousand dollars a little over that and and and and now we have to worry about another five hundred thousand dollars in the address\nFrom Dr begins Monday morning at six AM every dollar we make now over this weekend we don't have to make dream of Andra\nWere counting on everybody the great people and WAMC lend\nSupport comes from Belvedere home care professional logo in home care for family members since two thousand one working to help people stay in their homes peace of mind starts here nobody your home care dot com\nAnd from third I associates limited life planning transition planning and wealth management strategies registered investment advisors with offices in New York City Washington DC and the Hudson Valley\nTheir diet associates dot com\nLive from NPR News in Culver City California I'm Janine Herb's four days after hurricane Michael slammed into the Florida Panhandle search and rescue workers are still coming through the rubble searching for survivors and emergency crews are delivering badly needed aid\nStreaming support for WAMC come from virtually Center for weight loss surgery with a focus on life skills and support for a long term success would weave district to me and gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nIn family and friends in local government has been slow in the town of Mexico beach fire chief Joseph ... is leading a search team working for about two hundred people who had told local police they plan to stay but he's not sure they did\nTo stand wrapped up so quickly it wouldn't surprise us if a lot of people get scared and ended up evacuating\nThat's his hope because looking around Mexico beach in Panama City with entire blocks of houses leveled it's hard to imagine how anyone who did stay survived and authorities fear that the death toll rises the search continues Quil Lawrence NPR News Miramar Beach Florida\nMeanwhile damage estimates from Michael aren't complete but early estimates are putting the figures into the billions of dollars it's ratings predicts the actual cost of hurricane Michael will be substantial but it's not expected to be more than ... companies can bear that's always a possibility with these huge powerful storms\nPresident Trump is planning to campaign more campaign rallies this week the latest in a long list as he tries to get support for Republican candidates around the country ahead of the midterms his rally they're designed to rally his base but are they working NPR's\nMara Liasson has more we'll know after November six that's a really important data point because midterms are often a referendum on the president and his party and that is a role that Donald Trump has embraced more than any other president he goes out\nTells his supporters at these rallies he says I'm not on the ballot but I Am on the ballot so go out and cast a vote for me\nAnd here's Mara Liasson this week Trump plans to campaign and supportive geo candidates in Montana Arizona and Nevada in Germany conservative allied with chancellor uncle America will have been dealt a major laws after elections today in the state of the area from Berlin and dear sir I as a hearty Nelson reports of far right party has benefited from voter anger\nIt's the first time in decades at the Christian social union or see a few is losing its majority rule in Bavaria\nThe reason was a protest vote linked to anger over Muslim migration to Germany German public broadcaster A. R. D. estimated a hundred and eighty thousand former C. su voters cast ballots for the far right alternative for Germany but not every frustrated Bavarian voter turned right\nThe second biggest winner with the left leaning environmentalist Green Party to see his use expected to partner with that party or with the liberal free Democrats in a conservative coalition called the free voters that way to see if you can continue to govern Germany's most prosperous state\nPsoriasis or how do you Nelson NPR News Berlin and you're listening to NPR News from Culver City California\nSupport for NPR comes from NPR stations other contributors include the corporation for public broadcasting and the state of John crock who's ... serves as an enduring investment in the future of public radio and the Robert Wood Johnson Foundation and R. W. J. F. dot org\n[noise]\n\nComes from ... to Woodstock on market street run back to Hudson Valley restaurants specializing in contemporary Italian would find a table ingredients seasonal drinks and wind selections on Instagram that Cuccinelli Woodstock and market street run back\nFrom jak Miller contractors full service general contractor building in renovating homes in the Berkshires in southern Vermont traditional craftsmanship and applied building science more information out to jak Miller contractors dot com from Berkshire Bank providing begging insurance and wealth management with over one hundred and fourteen locations\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for what three four nine nine six six zero zero\nShare bank dot com and from the Samuel ... museum of art city new posts presenting the art in court to benefit adoption at the century association New York city October seventeenth at six PM Newport's dot edu slash music [noise]\n\n\nFrom Northeast Public radio this is the Media Project a weekly discussion about issues confronting the media\nAll news from the interesting\nNo no no no reliable\nCharming of\nAbout\n...\nReally\nI don't really know that I read all about it\n[noise] it on the road [noise]\nMedia Project gets underway with an opportunity for you to have us in your ear for a half hour we hope we do a good job of giving you analysis commentary maybe even some insights into the media issues of the past week\nI'm Robert Smith under the times union here with Dr Allen sharp ... CEO Northeast Public radio Allen wonderful to see you and likewise I'm sure I'm sure I'm sure had as well with Judy Patrick of the New York press association formerly editor of the daily gives it and likewise of course there's a whole we need to save likewise likewise\nYou have anything to say Ira Ira fuss filled how was your merits of the daily Freeman in Kingston New York charmed I'm sure charmed ... we have a lot to talk about\nPerhaps we ought to start this week something local one of the major stories on playing the national media has originated in\nOur community not far from where we're sitting here in New York's capital region and that is of course the tragic accident of the limousine carrying Seventeen passengers a single accident causing twenty deaths\nHas brought national media to the capital region as well as created quite a challenge for local media to cover\nAny initial thoughts panel on on how this has gone\nWell I'm interested in from the media point of view how well everybody's done your papers done great stuff they've been looking and asking for documentation in terms of whether the car itself was legal whether the driver was legal when you've been getting a lot of good stuff\nWAMC the station where we're sitting today's and\nIt was very interesting a whole bunch of people showed up here at the radio station they didn't have to and they went out and they went four or five different ways and I've encouraged them to put their step in for a radio award as I'm sure you're doing for the times union wrecked so it's interesting that\nThis is a story that a lot of people recovering from a lot of different directions\nKnow what I found is fascinating is the intersection of local national media\nBecause I you know you're a local radio station or local TV station or newspaper sometimes get annoyed when the national guys come in and kind of cherry pick your big story\nBut this is interesting because I have seen the national guys come in and do the big story and they do nice job of writing a very comprehensive story but they tend to gloss over and then they walk away and it's the local news operation\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for what three three nine five seven five one zero to register\nStruck by what Alan said about how many people he put on it and this that station put on the story and typically smaller newspapers community newspapers\nWhich are hard pressed to staff stories just routinely\nWell I don't know I'm a member Eleanor Roosevelt had a renegade newspaper column in my day by day and it's called right about that I thought you said it was in your day [laughter]\nIf you've ever been to Hyde Park where they have the statue of Eleanor and Franklin sitting just having a cup of too little tiny baby next to them as Alan\n[laughter] part of this that you've done more than I can say you know\nStreaming support for WAMC comes from my dog ... dot com and no ... no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\nAt that they did run it so and that matter I tend to agree with you well you know what it's very subjective\nI mean you know ... and his editorial board are sitting there and they're making a decision based on what they think is right it's their sense of what is right and what is wrong so I get that I mean it's very subjective which is why I think it's very dangerous\n... drew in that case it is subjective and it is one of the few places where all of the facts themselves are not that the reason why we're criticizing USA Today is not because they let the president have space it's because they let the president has faced to tell how many\nLives I'm interested that he chose to use the u._s._a. today or any newspaper\nTo provide an op ed is contrary to so many things not not the least of which is the fact that not as many people read newspapers as they used to and what I take out of that\nAnd there are other examples not necessarily him that they send in op eds knowing that that is going to be a springboard for the cable networks and an op ed today in the New York times so and so I've been and that's what gives that that piece of hair and ...\nThat people should know that probably the president didn't actually write that a lot of it\nProbably is a [laughter]\nA ... a Judy Patrick Arafat filled Ellen started talking ... here in the Media Project return to a bit of a foreign affairs let's say although it involves\nA man who's been living in the state of Virginia writing for the Washington Post his name is ... he's the guy the opinion contributor for the post for the past year\nHe's the Saudis citizen who went in to an embassy let's say and never came out again he has disappeared and apparently has been murdered in Turkey and this is creating an international incident and the question is what is the administration if anything doing about it\nAnd the reason this is so important is because it deals with the fundamental question of a free press here's a guy who is a writer for the Washington Post and it is an insult to that you would kill somebody who is disseminating an opinion that the Saudis don't like\nAnd you even see it with Donald Trump who tends to side with the Saudis and not with anybody else and it was a great friend of theirs but\nI think this is so dangerous because of the freedom of press aspect that even the Trump piece that are being careful about it and the Saudis were so brazen about it they may know effort to really cover their tracks they're sending a message to everybody who who dares to suppress any dissidents that you know you better shut up you're going to end up in body parts like\nIs the guy who ah he's one of the best known journalist and Saudi Arabia and in the past he was very close to the Saudi royal family but then he began to object to things that were going on in the new young crown prince\nAnd his column in the newspaper over there all high yacht was cancelled and so the government banned in from Twitter and so then he started to write for the Washington Post and came to Virginia\nAnd it is now kind of a remarkable thing to contemplate that the Trump Administration has based a lot of its foreign policy in the middle east on this alliance with Saudi Arabia which we know to be a repressive regime\nBut this is a president who has pledged to foreign leaders to death threats and dictators that you know it's your business we're not going to try to tell you what to do with your government\nSo is he then going to say the United states is not going to\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nNot spoken out in the manner that one would expect the United states president to speak out\nIf one of its people one of its citizens and a journalist is murdered as appears to have been the case here but it would be unfair to lay this event at the feet of Trump except for the fact that Trump's\nConstant barrage of criticism of the press I don't know fake news of the enemy of the people seems to have given license to dictators around the world to do the same and then some in their own countries and this is something that this country is supposed to be standing up for the freedom of the press\nAnd should be speaking out and more if in fact this occurred as it appears to record and Trump is as we speak is doing quite the opposite\nThat's actually a profound statement which I Want to associate with myself [laughter] I go to John usually so\nProfound you know when you get to be a certain age you could you are but I think the word ... ... it's it's a wonderful thing markets Sullivan is the media writer for the Washington Post's longtime editor of the flow news before that and then she became the last of the public editors of the New York times\nFor which deserve some attention from this panel which we have given it before that you would set up a public editor who would investigate whether stories were fair and then the\nHeat may get a little too hot you get rid of the position\nWell they kept it for twelve years so I think the heat was hot from the get go that I think they decided that there might be a different way to approach it is what rex we [laughter]\nEven valley ... yeah well the interaction that the digital world is Ford's newspaper is such that we newspaper can hear from their readers without necessarily having one\n... come on come on I ... a senior blew it you have found well you know they're not alone in that I already know how to not\nKnow their the it seems to be a trend away from that and that from a possibility now from my way of doing this that is the whose time has passed in search of other ways of doing\nYou guys have such a policy just write anything that anybody ever does in the press and say it's okay I'll give you the other side shame on you or somebody that you know there's a little bit of crowd sourcing of criticism of the press now in sweater and then other forms of social media like you don't get the skilled expertise of them are asked All right\nI Know that that's a pretty good point that\nSaid I hear that I win that ramp [laughter] owned A L K when when a new car [laughter]\nSo here's the point about raising the name of Margaret Sullivan because we digress is that is a very intelligent critic of press a behavior is raising the question about whether we are doing enough to cover climate change because there is this dire report that has come out from the U.S going to get in a governmental panel on climate change that\nSays that really we need a type of rapid response such as the world has never seen on any issue if we're going to avert disaster a disastrous levels of global warming\nAnd Margaret Sullivan point is this she said quote we need to figure out how to best make the main thing matter just as the smartest minds on earth science has issued their warning the best minds in media should be giving sustained attention to how to tell this most important story\nIn a way that will create you know she is so right in fact is I was thinking about it in fact in a recent commentary I said to quote myself I'm you know that this idea\nStreaming support for WAMC comes from my dog ... dot com no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog current S. dot com\nA climate change you mean that's not an impeachable offense wiping out the world potentially so I think she's right I think this doesn't get enough attention nobody gives it the intention it really deserves you know the the challenge is to make it interesting something people will actually read it and observe\nPeople are clearly interested in whether we probably have all seen that but those stories it's someone who's watched real time consumption news media those climate so we do not get the kind of engagement with readers that they should show it's on us yesterday I to do it\nRight yes but when we watch and I do when you do apparently Judy\nAnd maybe even Ira does you watch the news and you see this terrible Michael Storm so it's at that point that somebody on the air says and this is what has happened\nThe ocean is now eighty six degrees which has not been before and that is directly attributable according to scientist a B and C to what is going on\nSo this is the time I I agree with you it's been proven the ratings were places like the weather channel and the network news increase during these storms when they want to I don't know if it's because they want to see the weather the report is going to be blown off into the ocean\nBut this would be the time when they have people's attention when they're reporting the magnitude of bishops answer for them to have a segment saying how come this is happening how come as it happening as frequently as a trapping again how come it getting it's getting worse\nThis is when you have the readers and viewers attention I appreciate your I appreciate your support on this I was profound [laughter]\nFast so we will at ourselves back for\nPro funding around and maybe that would encourage you to come back and join us next week that the Media Project I referred fell Ellen sharp ... Patrick and Rick Smith we thank you will see in", "show_name": "The Media Project", "year": "2018", "city": "Albany", "day": "14"}