{"month": "10", "state": "CA", "station": "KPCC", "content": "Then the kind of resonance the idea that somehow that they had been tried was before that they hadn't had serious economic consequences in the Nineteen thirties that can have a resonance with people with a broader public [noise]\nMy hope is a great economic literacy will make our government's more accountable for the economic decisions they take which impact on our lives improving economics will only make a difference if those in power take notice of rule it's not as if nobody saw the two thousand crushed coming many economists alone economists\nSo the housing boom in the U.S was unsustainable the politicians were not prepared to protect the bubble [noise]\nIn the u._k. economics professionals virtually unanimous in saying that breakfast would be bad for the British economy but that do not stop the majority of votes supporting us [noise]\nMore recently President Trump has ignored a growing chorus of economists saying that the trade war would cause great harm to the U.S and the world economy [noise]\nIt's easy to be wise off the events but have we learned enough to stop the next financial crisis joined me next week when the b._b._c. World Service for the last program of the series when we'll discuss what's next [noise]\n\n[noise] Hi this is Larry natural next time on air talk our state wide voter cram session\nEleven state ballot proposition in less than an hour our panel of experts guides us through the pros and cons of each from huge bond measures to propositions on rent control and the gas to talk with Dan Iran eighty nine points three K\nPCC [noise]\nYou're listening to Southern California public radio\nEighty nine points pre K. PCC Pasadena community service of Pasadena City College in Ninety point three ... Palm Springs eighty nine point\nFive K. J. I. L. I. N. eighty nine point one K. U. L. are rattling community service at the University of veterans with more resources on line I K PCC dot org [noise]\nNice no access for for for like three days four days or maybe more\nPeople just need more help practical and emotional younger golly says and they're still remain places where rescue teams have not yet reached [noise]\n\nFive days after the earthquake sister's name flashed up on her phone [noise]\nI also like to see the naming my phone and it's called illegal galley\nAnd I pick up an asset\nI mean ... it says you can if you live and can you can you give me some credit for that because he needs to like tell everyone that the U.S all I live near their first time in my life\nSomebody asked me funding credit and I'm so happy [laughter]\nIt is a story of how\nThey were still many thousands missing\nWhich sophisticated any warning systems in place in Indonesia and practice drills at quakes and see ... ... you know prevented [noise]\nThe warning chain\n\nSpace to Louisiana between two thousand six in Tucson searching as an advisor to support the development of the early warning system in the ...\nThat has been a geologist from Germany [noise]\nEver staging waves hit the coastline across a huge region [noise]\nIt's affected must've Southeast Asia and thus far away as East Africa\nIn places the main wondering the Indian Ocean tsunami and two thousand and full which left every two hundred thousand people dead across the region he went to Indonesia to help the country develop an early warning system\nThere is a agency in a drug Carter was to be cagey\nYou'll be hearing about the ... loved they operate the national ruining cents an hour just Indonesia's capital\nThey receive information on us quakes and decide whether or not they likely to cause us to know me\nIn case of the nominees shreds the warning ruby disseminated by being cagey to national institutions you'd go through goes directly to the media rich are supposed to publish it informal breaking news and it goes to local governments\nThen local governments are in charge to decide on immigration locally and to inform the community at risk in the area of responsibility\nSo from the moment of quite takes place the clock is ticking\nAnd the owners have to be happening within thirty minutes inclusive that people have time to leaves the threat area\nThat's because in Indonesia the time between us quake and tsunami is usually up to thirty minutes\nSo this is a lot of very challenging\nIt's not enough time is is that a few minutes\nUm no it's it's next to nothing\nAnd as we know in a situation in ... they didn't have that he minutes a day they had much less\nApparently what we know from a now is that the two nominees\nHave reached even after ten minutes\nAnd if you look at the timeline in ... the band cagey disseminated ruining ... minutes\nThat the ... he was moving too fast to the city time was running out\n\nReal good government would have received this morning after five minutes in ... but let's not timeframe or you can still bought on immigration or make a difference [noise]\nEven with the best technology given the specifics of what happened the earthquake and tsunami hit in ... in ten minutes\nWas there anything that could have been done to save lives\nThe survival of people depended very much on their own ability to take a personal decision to immediately leave coastal areas the first line of defense is listening to understanding warnings by nature [noise]\nSo I think that most of the clear warning by nature the ground shaking from the earthquake\nAnd there is um simple strategy you're the earthquake is long and strong\nGet going\nBut why should you go\nIn the ... case it would be sufficient to ah get five hundred meters or so away from the coast so you are mostly out of the reach of the waves\nOr you go to higher ground if anything's um nearby you much go to a second preferred floor of a building which has survived the earthquake better than nothing [noise]\nSo am I missing the city of people in the ... watching that yes what are they doing the right thing being where they were\nYes definitely is I Would have taken the decision seeing wave to run an inland they wouldn't have been killed I mean if you see the wave already [laughter] then I think it's nearly too late because you kind of odd run the wave\nPeople can't just rely on the technology how ... it has to be a Jew approach you need to know what to do when you feel and knowledge us quite which doesn't seem to have happened in all cases in ...\nIf you look at it from the outside of perspective it's really hard to believe that for ten years after the big to nominate Indonesia not everyone is aware above that situation as a threat and knows this simple rules [noise]\nSo I think there must be a really tough investigation on why that happened\nAnd he has concerns not just with public awareness but at the hunting as as true to Palestine national to local authorities on the scene on the Internet has given when time is so precious\nReal touching here very critical point if you look at the whole system in the new Newseum recall it and to ... from the warning center on through to the community of risk [noise] for me is the is the design problem in its which proof to produce a really serious and deadly gatherings of owning train\nSo what could be down my idea would be once you get out of warning this\nUltimately implies immigration and this can be announced by every offer already not only by the local one but also the national ... could announced the immigration order\nWhat went wrong in Indonesia\nHow ... believes the national government must have a greater role\nBut would it have made a difference in policy\nAnd where were they during the disaster and it's often or [noise]\nPart three powerless\n[laughter] [noise]\nTwenty years ago that is a quite significant landslide\nThat was in the middle of the night might get spin a baby so I have to talk with in the middle of the night\nYeah [noise]", "show_name": "The Inquiry", "year": "2018", "city": "Pasadena", "day": "18"}