{"month": "10", "state": "MA", "station": "WBUA", "content": "And streaming at W. B. U. R. dot org W. B. U. R. Boston's NPR News station\nOh ooh\nFrom the Daniel oh marsh chapel in the heart of the Boston University campus ... nine W. B. U. R. brings you today's injure denominational Sunday service of worship\nThe lord be with you and do so with you lift up your heart we lived in the ...\nWhere the dawn of the nice to meet the twilight of the west and the cool at the north touches the calm of the south and the transcendent power of God to earth and the humility a lot of a crisis\nOf the Charles reaches out to the heart of the country we gather for ordered worship\nThe liturgy music and normally this Lourdes day are awkward and the grace of God where our congregation here within marsh chapel where radio but your ship across mingling the W. B. U. R. Ninety nine at them\nAnd it's work Internet listenership around the globe it W. B. U. R. dot org we welcome your prayer pulling material support\nYour origin or email responses your self selection of forms of leadership service and ministry in our midst\nAnd asked the spirit moves on Sunday your presence with us in worship as our custom and this season we particularly welcome\nOur radio and Internet listeners to join with the residents congregation in the strong stewardship supportive marsh chapel\nTo give ... give generously to build being downgraded the dean shipped here to support music and ministry here into guiding airport pass through work or grammatical why\nAnd worship here this is the day that the lord has made we should all rejoice it'd be glad and yet as we are able maybe stand in the grace of God\nNo [noise]\nNo no\nNo no no no for\n\nA\nA I'm\nA little for\nI'm\nNa\n\n\nNa\nNa\n\nNa na na\nA\nA\nNa\n\n\n\nMaybe Craig ... never lasting God\nIn Christ you reveal your glory among the nature preserve that works you're virtually the church throughout the\nMay persevere with steadfast faith in the concussion of urine name drew Jesus Christ are\nWho lives in range could you send the Holy Spirit one God\nPlease ... to ... you are\nThe salt of the ... you are the light of the world you are solved\nAnd like many in order that salt might not lose it safer and light might not lose it's really just maybe we pause\nTo pass to lay aside to let\nGo those burdens those mistakes those sins of the days gone by ... ready to receive would read it to the heart rate\nAnd love of God they are required guy so maybe we are for our theory they smoke\n... yeah yeah\n\nNa\nNa na na\nI'm\n...\nI Am I'm\n\n... na na na\n\nNa na\n\n\n\nNa na\n\nNa na na na\nNa na na\nNa na na\n\n\nNa ...\nFor ...\nThey were greatly astounded and said to one another that who\nCan be said Jesus looked at them and said\nFor multiple as it is impossible but not for God for God all things are possible\nPeter began to say to him look we have left everything and followed you Jesus said truly I tell you\nThere's no one who has left house or brothers or sisters or mother or father or children or fields for my sake and for the sake of the good news will not receive a hundred full now in this age how is this brothers and sisters mothers and children infused with persecution and in ...\nBut many of our first will be lost in the last will be first\nThe gospel of the lord pray to you lord Christ that\nA\nI'm\n[noise] a\n\n\nA\nA\nPlease be seated [noise]\nPresent moments\nLift up your heart's in the present moment to hear the good news within this present moment a\nWord of faith in a pastoral voice\nToward a common hope hope passed two handsome sons presidents and pressure both meet you in the present moment the presence of low\nPressure to love\nThe presence of good the pressure toward good I Need die presence every passing our\nWhat about like grace can spoil the temperatures power\nLike myself my guidance they can be through cloud and sunshine lured\nBy with me the present moment the presence of\nGood the pressure toward good here good news\nJust as the present moment for all its dangers and diminution reveals presence the presence of love as we affirmed last week so to the present moment for all its tweets and humiliation reveals the\nPressure of good the pressure toward good as we have from this Lourdes day hoped second handsome sun is pressure\nAfter worship here at marsh chapel last Sunday you may have noticed that our student mission team set up a table on the plaza they are called move this team the acronym of whose actual words I can never remember\nBut it doesn't matter these are delivered students are on the move and that is the point is it not they went out to commonwealth avenue armed only with the table a box of pamphlets\nTheir camaraderie and also one guesses for that present moment perhaps\nOne other thing the wind up pressure blowing through their lives like\nLeaves in the breeze to paraphrase Rowan Williams' towards some good toward some goodness they spent part of the day passing out information on how to register\nTo vote\nThey were moved to pressure\nTo press on to impress to press on toward the high price to do something\nGood who knows when it's that sort of impetus emerges\nBut it does in the present\nIn the present moment ended up a sudden it I'll bet sudden you are greeted by hopes second handsome sun no pressure notice in our gospel how the rich young ruler\nPrecedence he presses the point\nHere is not satisfied with the generic response in this case and odd listing and partial assortment of the commandments Jesus Says they answered giving the points of the law though notice only some and notice in odd order\nBut in the question and again and the answer there is a pressure there is a pressure is is why the churches memory of the conversation includes the phrase and Jesus loves to you know\nThe good presses the rich young ruler to question the good presses the lord Christ\nIn his risen voice remembered and interpreted in the life of the earliest church to answer one thing you lack\nThere isn't this present moment in every president moment the pressure\nGoodness we come to a church for such a reminder\nEspecially in our national season of the shredding of ceremonies a courtesy international season of the ... of incivility international season where there is a willingness and the part of many to support\nOr countenance the denigrate shouldn't have civil society and the abuse of inherited forms of culture meant\nTo protect us\nBassist cell\nLook for a moment again at our gospel reading barber ground Taylor said once if memory serves at the church usually misses the point of this teaching either by understanding the passage exclusively in terms of money or by avoiding altogether any discussion of\nMoney she said further that money is like nuclear power\nPotent with power for good but requiring careful\nManagement protections against disasters recognition of what can go wrong\nAnd the humility in practice\nIn the city of Rome under the thumb of Caesar mark in Seventy eighty reverses Jesus lakeside lessons\nGathered in secrecy hearing news of of Jerusalem temple in flames rightly fearing impending persecution marks Roman Christians heard hope\nIn these teachings so frequently as today related to wealth\nIf you notice only one word and this passage mark\nMark's inclusion of persecution\nVersus thirty four there's an urgency to Mark's passage that Matthew and Lou later left behind mark exude draw energy under the pressure of apocalyptic expectation\nCell and give notice\nThe telltale apocalyptic marks\nThe coming of the resurrection of the dead this age and the age to come\nThe heart of Jewish longing camel and needle\nEnd of an age hyperbole known is good but God the apocalyptic distance of heaven and earth the reign of God\nThe essential apocalyptic hope\nPersecution harbinger of\nThe end last to become first apocalyptic judgment\nBut there is no mistaking the primary announcement life is found in a refreshing lake water of giving not on the dry shoreline of having\nLife is found in the refreshing lake water or giving not on the dry shoreline of having yes\nYou must honor the past including the commandments yes we must preserve and protect\nBut as Lou Timothy Johnson used to say the traditions of the church are meant to open the future\nConserve what you can protect what you moss\nThen give develop\nGive enhance give open the reign of God\nThis is what life is all about ... about\nToward the end of one remarkable election in California a leader in Los Angeles humorous Lee and memorably implored his people to look to the future\nListen for him listen to them\nAnd learn from them and learn to find your own voice both critic and cook\nAnd Monday evening this past week you may have walked past the cafeteria\nOne hundred base state road\nThere you would have seen a loan woman sitting in a chair her hair gray her presence little notice her age probably making her eligible for Medicare armed only with a table a box of voter registration pamphlets\nIt also one guesses for that President moment perhaps one other thing\nThe when the pressure blowing through her life like leaves on the breeze to paraphrase Rowan Williams' toward some good toward some goodness\nShe sent she spent part of that evening passing out information on how to register to vote\nMaybe a couple of generations ago she was a member of a student group like ours\nLike move or maybe she is a for a taste\nOf what our students will be and do a couple of generations from now\nWhen they're hairs grey and they are eligible for Medicare\nGood for you said to her I'm trying she replies and you\nMay I ask you a question to conclude discernment\nYou before you leave the sanctuary consider one thing you might do towards the good\nYou have not yet to this moment designed it will you before you leave the sanctuary consider one thing you might do for the good in the next week or something you have not yet to this moment\nDesigned in the present moment the up your heart's in the present moment\nTo hear the good news within the present moment a word if they didn't know Castro boy towards a common hope hope has to answer them sons presidents and Chris you're both me and this president ...\nThe presence of long the pressure to love the president's oh good the pressure toward good need presidents ... has been our what but like ... ... ... ... is our\nWho liked by cells and the guy that they can be\n... and sunshine I Would be ...\nA\n\nWe now come to a time nurse service we turn our hearts and minds to prayer and lift up her lied to God\nPlease do an attitude ... by either remaining seated dandy kneeling are coming to the community rail as we think together a call to prayer lead me lord\n[noise] ooh\n\nA um\n\nFor\n[noise] oh\n\n\n\nYeah oh [noise]\nUh\n[noise]\nMm\nCreator of the universe may we see the eternal\nThat as president in the moments that passes by your results only I mean we see the weight of importance and our present moment we pray that we never forget that the future is yet to occur in our satisfaction about here\nRight now in the momentary fleeing space where we'd be in our\nMain weed through the eternal ground of our being the the power that brings\nForth from the embrace of the president's just as the conscious things idea of the future has transcended on the cross where the ... just like in the mid ... was displayed may we through the new being Christ\nShe that life is more than our sense of control or material wealth and their ability to create produce in slightly work against inevitable entropy around us\nFor the moment Christ took on things id found in the loss of control well to create a capacity he quips\nMay we threw the spare the courage of this courage resist\nThe desires to live in the future in the past\nAnd it's that exists in the light found in the momentary presidents we pray that we would not mistakenly confused or material means for the ends of our human stories and community that we meaning the meanings we live and to\nAnd that we would not mistakenly separate or productive human and environmental meetings from the end of profit and accept\nHelp a lot of members of our communities to see the importance of ethical conservation practices and environmental regulations\nFor the resources that spring up from nature spring up from only grounds and help us as members of our communities to see the importance of the ethical treatment of those who work in the various industries that make up or global economy is\nNever forgetting that the new being of Christ is president in them\nIn the present moment we pray that we'd be the divine hospitality and love of the new being Christ those meats and that we see Christ in them help us to love to serve to forget and it isn't the one who caused us in the president's Christ's name we pray a man", "year": "2018", "show_name": "Marsh Chapel Service", "city": "Tisbury", "day": "21"}