{"month": "10", "state": "GA", "station": "WSB", "content": "A minute wait a minute there's science behind fly fishing in choosing a fly fabulous science behind the\nThe debate and the lawyers that you use if you're a deep fishing so there's there's really a science behind all that stuff\nYeah and all of that is based own reading education and more than anything else experience yeah yeah I'd love to be in one of your classes I gotta go recall more often\nWell thanks a lot for talking to me I enjoyed it\nI did two very very much so you have to call\nBack again soon let's say who's a who do I have Next Fifty one after the hour\nAnd I've got a let's say I've got\nTodd calling from Conyers' Georgia about ... let me bring him up properly go morning Todd at Sony or you're on the air\nMore on on there or you good lovely\nEnded up calling me this morning we'll do a little bit of fishing with a tournament girl okay relatively new the bass fishing just started this sport a couple of years ago okay or if I found out there's a whole lot more to this or that I ever\nOh you any dialogue is not a surprise that good people are good at it\nExactly what I'm trying to find out what this cold snap that we've had today actually temperature for about twenty degrees out my world last week in right um what uh what would you recommend we\nGot what if I if I had to go and I hadn't been on the like this is this would be my strategy for fishing oh Coney today I Would start out with the first hour with a ... or some other top water by weight on the low points but\nAfter an hour I Would put that away then I Would you solve plastics in ... on the sides of the points and get a limit fast\nBut I'd go for the big fish early\nYeah that's what I'm trying to do\nOne by early on and bought on maybe you get two bites in that first hour but don't stick with that all day no sure\nYou'd get away from that when the sun hits water real high\nYeah and it's going be up early this morning of\nAn outcry over you got ... most you've got an hour\nAway anyway comes I hadn't flipping\nYeah that that that would be a dependable way to the limit out that's\nWhat you have to do you have to limit\nOff\nA lot of well that's what all now now you owe me not tired I got to go but you owe me a call next week\nYou will definitely get it I'll let you know our did\nModify budget call by al this fifty three after the hour fifty four now this is O'Neal one more little segment will return\nNothing offers an opportunity to bond and give thanks quite like breaking ground together [noise] this is especially true for our service members rambling far from home nine years in east\nSince two thousand eleven to ... foundations serving heroes program has shown gratitude to our nation's defenders and their families\nBy serving up more than sixty thousand hearty classic American meals and traveled hubs and military locations\nAnd now thanks to our friends have Bob Evans farms near purple barn and there are farm salutes program will be able to provide even more meals nationwide [noise]\nServing heroes offers aren't defenders a moment to gather the taste of\nThe show America's gratitude to food and fellowship look for the purple barn and your grocery stores and visit our farms to lose dot com\nOr near he's a nice foundation dot org to learn more [noise]\nWhile we can never do enough to support the men and women who served\nWe can always do a little more\nOur kids better off in an intact family you bet they are this is Joe Cornell at the domestic litigation from Cornell Cornell kids living in a house so with married parents do better in school they're emotionally healthier and they're more likely to stay out of trouble with the law\nIf you're in a troubled marriage of course you should do everything you can to save your marriage if only for your kids say this includes considering alternatives to the force of course in some circumstances divorces on avoidable in either case if you're a man facing a crisis in your marriage let us help you at Cornell Cornell remember where the partner men can count on\nContacted domestic litigation from of course the Ellen Cordell to schedule an appointment with one of our firms had Lana area attorneys partner men can count on for zero four seven nine three zero zero zero zero on line at Cornell Cornell dot com that's Cordell Cordell dot com offices in Sandy Springs Fayetteville Lawrenceville and Marietta\nCordell in Cordell one Glenn parkway northeast sweet nine Seventy five and a leather Georgia three zero three to eight paralyzed veterans of America national service officers\nWould seem more you're going to need voices during the advocates paralyzed veterans of America is here to how we're going to make sure that the Veterans Affairs gives them everything that they're entitled to get all the health\nCare they need to make a personal house adaptable for them to go back home and rent\nEducation for its lost focus on getting them a job and if something happens to the veterans and you know we're the spouses advocate\nWe help our veterans for three the way that paralyzed veterans of America down fat\nNational service I'm located in the United states\nWork is important because people depend on us\nAnd they do when they come to paralyzed veterans of America they don't get the right answer and they know that we're there for them twenty four so because we are\nChanging lives building futures that's paralyzed veterans of America to learn more visit PVA God or [noise] or a public service message from paralyzed veterans of America\n... ... ... if I had in ... well it's\nBeen a busy morning hasn't in Yemen and we our ... close up unless you talked to Charlie he's calling from Dallas texas alone O'Neill outside your morning Charlie\nHey good morning Neal thank you so much for taking my call I've got a quick question about uh some use out outdoor okay my my son\nOr he's going to have is the first season this this season a deer hunting it's killer here pretty soon\nAnd my question is should or should I get him out early you know what everybody has a fever and you get all these new hunters out there kind of getting set up or should I wait a little later in the season where I don't have as much trafficking as any people out and\nYou know just I was just I'm worried about that oh well it to me that's not the important\nPart the ... and so you can do either or either according to your pronunciation and you can uh be successful in either case also\nThere's nothing wrong with the camaraderie and the other people that are going to go hunting with you\nThe important things to me is that he he fully he fully participates from the fact that he cited in his rifle at the range he has his own binoculars he has his own outfit he gets to go in with you with his own flashlight he ... he participates fully\nAnd it's so short trip is not a wet tree up it's not a super hot trip\nNor is a super cold trip these need to be fond memories from preparation all the way through to hunt and then if you get something you need to put it on the grill with him\nThis uh ... okay ... early ... and I have\nLots of photos if you it doesn't matter whether you kill anything\nOr not sure\nOkay well I I really appreciate that I was I was really worried about picking 'em to make sure he was enjoy it and I know there's a rush\nOf our lives equal within the first few weeks sure how old is he\nWell that's that's good enough does have its own rifled everything\nHe does he's got a little to forty three with a toy down stock and he's ready to go [noise] congratulations to you well\nThank you I I appreciate that you do it right in the right thing Charlie I gotta go ...\nThis is O'Neill what a great called in because I'm going to tell you if you're too busy to go fishing and hunting and take a kid along you're entirely ... so you guys next week\nLong when you ask me Herman Cain is daily pure Cain perspective I Am going to bomb deals are non scripted just pure\nAgain I don't have to be politically\nEvery day lemon ... pie six I'm not going to call\nFollowed by the U.S be expended new moon but\nAm going to stay the fax machines daily fear came perspective every weekday at eleven to to say on it Leno's news weather and traffic station is ... ... am seven fifty something yesterday\nWhen you asked me about ... media group station is twenty four hour news weather and five and am sent\nMe this news\nAt four o'clock I'm Charlie O'Brien individual has to be twenty four hour news center top story goes to our number two Georgia's I'm beaten season comes to a screeching halt with a thirty six sixteen lost to number Thirteen\nUnless you several us B. J. block is in Baton Rouge\nIs not the most dominating loss ever but it's close\nMe twenty four hour traffic Center for dinner before a carrier WNBA twenty four hours in a red alert\nIn effect to camp Jody ... road exit forty eight all lanes blocked right now due to a crash investigation\nYou could try to exit often ... as your alternate but once again always want to eighty five each spell the outer loop pets why shoulder road exit forty eight in DeKalb County always brought you to crash investigation abide shields W. S. B.\nTrenches or that the white people to fight to sue rules you stuck exactly right [noise] what I thought [laughter] my perspective I tried to understand that living in DC I Try to figure that out because you know ... or at least suspected minority and they said you have to figure out why politics\nMm [noise]\nSo awkward yeah yeah [noise]\nSo that was just not great just wasn't good you know cut to also this is this just shows you how\nLike low they'll go oh so April I'm\nApril Ryan asked get this after the ... kind of thing she decided she wanted to go ask gray Jay oh yeah yes she did listen to the ...\nAnd Wolff I Am I'm going to give you a little something I talk to someone who's very familiar with the car dash and they used to be a text messaging with re Jay or you know who ... is he's he was once close with Ken ... dash and he said I\nThought it was great a great opportunity for young black entrepreneur is an artist to talk oh my God I Can't even believe America then hey well oh my\nGosh I Can't even believe that they\nWent and asked ... of all people they went and asked ray Jay oh my\nGosh and you don't cut my this is why I had the question that's the way she ... million dollar question how does she have re days number April Ryan that's a good question I get a hold of rage day some producer oh and then there's ... there's somebody David Gergen on CNN listen to this\nAnd that is what is a ... I think so to serve me I don't know about Kanye West mental condition [laughter] I don't know what I what I did pick up one was something I haven't really thought about these ships saying about this ... and put in his head on his head on they didn't feel like a man\nI'm Wondering is that what's going on with some of them in this country and our relationship with Trump is paying for Trump's makes him feel more muscular I just don't know joking\nHow tight are these people but that they have to be this like a humorless stuffed shirts\nAny other like\nComparison I can make metaphor seriously he was joking and he's\nThat makes me feel and well you know I mean I think I saw something about ... deep dive into the saw this a joking phrase here I mean I think a really\nOh my gosh this is what [laughter] that's not even oh\nBut wait there's more if you like if you like your laptop you\nCan get your second flap chop for free audio soundbite nine Don Lemon\nContinues this is like ... or ... I hate ... coverage\nSo we stopped putting people like calling us and Kim Kardashian and again I've no shade the concussion to go to the ash and help to get one person free this is not some copper tend to overhaul of the criminal justice system this president love celebrities and so that helped\nBut cautioned brought no experts than that I Know of no one's who knows about criminal justice reform no one who can hold a son and plus nothing\nI Can't make it that's right because you don't get to have an opinion or go talk to anyone in Washington DC and if you bring with you an expert on the issue which you claim to care so all of you individual is out there who hope to\nImpart some effect on your lawmakers he can go ahead and sit down because if you don't have an expert on speed dial no go\nThat's what he's saying that's the same I'm Sorry there was Marco had\nNothing she sat there ... another celebrity with another celebrity at another time of the minister of a former administrative we would've criticize us and said that he was disparaging the office so let's not we should stop putting Kanye West and one car dashing on the same\nFew the situation room under the previous president they like took selfies in this situation room not even getting you how many conservatives were like\nI don't you all are sitting here\nPlaying the race card and calling and crazy and everything out of the experts to be able to bring in nine or or a zero hey guess what guess how many experts ludicrous brought with him when he went to go talk to Obama about criminal justice reform\nSure it's a lot but not a oh wow that's weird yes less than one that many how many chance the rapper ... got to be love seeing as women who\nAre well I\nThink you know [noise]\nSo how many did um I mean I could go Nicki Minaj bring to the Obama White house a lot of\nThe field\nSo that you know I'm not one not one so where's the standard lemons talking about it's just all of a sudden manufactured from the either because bias that's what happens it just well suddenly now we demand\nExperts yes\nYou're too stupid to have an opinion and as you you have an expert seriously oh mom living where I'm not part of the resistance them no he says he is not but well hold on because I I Want to get until we get all the I Want to get to that this yeah go ahead and he says he's not listen\nAnd your friends and your and your allies and there was just in the ... I'm not an ... minority have the power that I'm not part of the resistance it just because the truth is not a ... on your program I think all of them you're not watching I that I call them on tonight\nI'm not sure who have yet or they're just about every not going to do things\nNormal and on it [noise]\n\n\n\n\nA busy I hate it when I miss white and Jamie breed and when they stormed than we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and go play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty new to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on ms ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nOn ... hour\nBe breaking news weather and traffic either end on now on your\nW. W. F. B. radio until the latest WSBIU more traffic onto their hand when\nLive coverage of people you depend on the radio I downloaded out in the outdoors\nAnd Google's play [laughter] morning workout\nI'm busy I hate it when I miss white and James brain\nStorms and really power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah your station all your time\nAnd the bad news I heard all day I'm downloading that happened right now do you have the radio ads downloaded out in the dark and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia sports on not buy buy them at a um\nSeven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on mute ... him on your radio and on a um seven fifty W. S. B. W. F. B. program and continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\nI'm a junkie here on the road a ... hour\nCan you know breaking weather and traffic you demand on now on your\nDoor you had to do when you ask me radio waves until the latest WSBIU more traffic on demand when\nLive coverage on any people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports on\nNot by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game at bulldog talk on these ... them on your radio and\nOn a um seven fifty U. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\nA busy I hate it when I did ... and James debris and when they stormed in power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece all their latest news in traffic on demand is always the beer weather coverage about what would happen breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out on the store and get into play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on TV by by them at a um seven fifty broadcast restrictions we cannot operate the UGA exports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on\nThese ... by them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYou're my job to bring back the on the road on ... hour\nBe breaking weather and traffic either end on now on your\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand\nAlive continuing coverage of people you depend on the radio ads downloaded\nAnd Google Play [laughter] early morning workout\nA busy I hate it when I miss light and Jamie breed\nWhen a storm didn't release power would be\nGuy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news\nYeah if you were stationed on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nYeah my job to be on the road a ... hour\nWhat can you know breaking\nNews weather and traffic you know on your\nDoor you had to do when you ask me radio waves until later WSBIU more traffic on demand where\nLive continuing coverage of the people you\nDepend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on music ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n[noise] [noise] morning workout\nBusy I hate it when I this white and Jamie brain when a storm did we lose power when\nThe guy you know you can look to the ws be anytime anywhere with a double USB radiolab paid all their their latest news in traffic on demand is always severe weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store\n[noise]\nNow when you asked me a broadcasting University of Georgia board somebody\nBought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north readable USB radio dot com CNN and I hard here the game as bulldog talk on music ... them on your radio and\nOn a um seven fifty U. S. B. W. F. B. program and continues here at a later our as normal and on it [noise]\n\n\n\n\n... power like that can be bringing\nWeather and traffic either and on now on your skin\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand when\nLive coverage on the people you depend\nOn the radio ads downloaded out the door\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this white and James brain when they stormed in relief power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with the ws be real lab he's all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it down to the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and buy hard here the game as\nBulldog talk on these ... them on your radio and\nOn a um seven fifty W. F. B. W. F. B. programming continues here at a later our normal depend on it [noise]\n\n\n\n\n... power\nThat can be breaking weather and traffic you depend on now on W. W. F. B. radio with him to the latest WSBIU more traffic on on demand way\nLive coverage on the people you depend on\nThe radio I downloaded out in the outdoors\nNow with us being broadcast the University of Georgia board somebody bought by them at a um seven fifty to broadcast restrictions we cannot operate the UGA exports presentation on the USB radio up\nThrough ws be radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on AMC seven fifty W. F. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nMorning\nI'm busy I hate it when I this white and Jamie brain when storms and we lose power\nWhen the guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab paid all their their latest news in traffic on demand is always severe weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store\n[noise]\nThat when you ask me is broadcasting University of Georgia ...\nPi by them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on the menu at the radio up north to W. S. B. radio dot com and and I hard here the game a bulldog talk on\nMusic ... them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\nMy job to bring back the on the road and ... how\nCan be bringing weather and traffic you demand on now on your\nDoor you know you asked me radio waves until the latest WSBIU more traffic on on demand and wait\nA live coverage on the news people you depend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nA busy I hate it when I miss white and Jamie breed\nStormed the Willis Tower would\nBe the guy you know you can listen to W. S. T. anytime anywhere with a W S P radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out on the door\n[noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north through double USB radio dot com tune in and I hard here the game and\nBulldog talk on these ... them on your radio and on AMC seven fifty W. S. B. W. at the programming continues here at a later our\nNormal depend on it [noise]\n\n\n\n\nI'm a junkie from here on the road on ... hour\nWhat can be breaking news weather and traffic either end on now on your\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand\nLive coverage on the people you depend on the radio I downloaded\nNow what you ask me is broadcasting University of Georgia sports on not buy buy them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on WSBIU radio up north through double USB radio dot com tune in and I hard here the game at bulldog talk on\nMusic ... about them on your radio and on AM seven fifty W. S. B. W. at the program and continues here at a later our\nNormal and on it [noise]\n\n\n[noise] [noise] morning workout\nA busy I hate it when I miss white and Jamie the brain when a storm did we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always have your weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio ads downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty new to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ...\nHim on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... hour\nBe breaking news weather and traffic you demand on now on your\nDoor you had to do you ask the radio waves until the latest WSBIU more traffic on demand and\nLive\nCoverage of people you depend on the radio I downloaded out on the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I miss late and James brain\nWhen it's warm than we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news yeah is your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio ads downloaded out in the store and they don't play [noise]\nWhat you ask me is broadcasting University of Georgia sports I'm not by by ... am seven fifty a broadcast restrictions we cannot\nThe UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on ms ... them on your radio and\nOn AM seven fifty W. S. B. W. F. B. program and continues here at a later our normal that can do that [noise]\n\n\n\n\n... and we want our\nBe breaking weather and traffic you've and on on your\nDoor you had to do when you ask the radio when it comes to the latest WSBIU more traffic on on demand where\nLive continuing coverage of people you depend on\nThe radio I downloaded out in the outdoors\nThat what you ask me is broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and buy hard here the game a bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. at the program and continues here at a later our\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] early morning workout\nBusy I hate it when I this late in gym to breathe when they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the ws be real advocates all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your tie and the bad\nNews I heard all day I'm downloading that apple right now to do what do you have the radio and downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north readable USB radio dot com tune in and buy hard here the game as bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B.\nW. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to bring back the on the road on ... hour what can be\nBreaking news weather and traffic you demand on on your\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand when\nLive came in coverage on the news people you depend on\nThe radio I downloaded out in the outdoors and Google Play [laughter]\nI'm busy I hate it when I miss ... and James and brain when storms and we lose power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always the weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now do you have the radio I downloaded out in the store and it'll play [noise]\nThat when you ask me is broadcasting University of Georgia board or not he bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game at bulldog talk on ms ... about them on your radio and\nOn a um seven fifty W. S. B. W. F. Lee programming continues here at a later our as normal that can do that [noise]\n\n\n\n\n... hour\nCan hear breaking weather and traffic you demand on now do you ever do you have the radio when it comes to the latest WSBIU more traffic on on demand when\nLive continuing coverage of people you depend on the radio I downloaded out in the outdoors\nNow when you ask me is broadcasting University of Georgia board or not he bought by them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on music ... them on your radio and on a um seven fifty W. S. B. W. at the program and continues here at a later our as\nNormal that can do that [noise]\n\n\n\n", "show_name": "no_show", "year": "2018", "city": "Atlanta", "day": "14"}