{"month": "10", "state": "NY", "station": "WRUR", "content": "Well rooster took a lot of pride in being tough\nAnd having committed a crime which landed him in in prison in Texas when he was only Seventeen and he wanted his sons to grow up to be at least as tough as he wasn't as bad as he was and remind us what was his first arrests for\nHis first arrests was for a burglary of the local a grocery store and he was living in Amarillo, Texas\nAnd in fact almost everybody in the family participated in the burglary including a roosters mother and one of roosters sisters as well as all his brothers and they they made off with twenty thousand dollars which doesn't seem like a lot now but\nAnd in Nineteen sixty it was a lot of money yeah\nBut it was like a family day it was like going on a picnic or something\nYes exactly going on a when a picnic a barbeque in Texas\n[laughter] but as Mr grew older he continued his criminal behavior and the families of the race he taught them that it was kind of a badge of honor to get in trouble with the law\nYes and he would he would take his kids out and commit crimes of them they would break into their neighbors' homes or they would break into their mailboxes and take their Social Security checks\nThey would steal people's cows and chickens or they would go into a lumber yard and take lumber with sure they would resell or anything that they could do and a one incident that the kids talked about was the one night he had organized his entire family including his wife\nSons and daughters and they go on to the ... dam which is big dam on the Columbia River outside of Portland and going into the fish hatchery and stolen all the Cohen Chinook salmon if they could find in the fish hatchery they're at low to them in their truck and drove them home and either eight them are sold them\nBut it was more than just adventures and shenanigans I mean you explore in the dark side to the wave rooster raised his family there was rampant physical abuse sexual abuse psychological abuse\nWhich leads me to the ultimate question what's the more powerful force when it comes to shaping criminal behavior did you find it with genetics or family values\nI started out looking as family values\nWhat was obvious in talking to the moguls was that they were very conscious of imitating the behavior of their father end of the aunts and uncles and grandmother and grandfather oh who met criminal records\nAnd then they did not have any what criminologist we call social controls so they didn't go to church on Sunday school we didn't belong to any organization like the boy scouts\nThey didn't have other adult role models but beyond that I began to get interested in if there was any role of genetics and this in criminology has been a no no or taboo subject for a long time\nBecause they can dangerously threatened to the question of how race yes and he turned in criminality\nIs so there were in recent years certainly since the voting of the human genome some scientists began to look at behavioral genetics\nAnd there was a professor at Duke who is a criminologist and her work indentified several genes which could be precursors to impulsivity which is a characteristic of a lot of criminals\nBut she stresses that there's no such thing as a criminal gene it works in combination with the environment so if you have a family environment like the moguls and you have this variant of the gene then you have kind of a double whammy\nI Want to end our conversation as un that your book um by talking about Ashley she's rooster vocals granddaughter she was kind of the operation in his family she's a good student she wants to do ... became the first member of the ... and a hundred and fifty years to go to college\nI graduated from college and graduate from college what did you learn from Ashley story\nThat she herself says it's a matter of individual choice in the end she chose not to do what she saw around her she didn't like what was happening to everybody else in her family\nSo she decided to try to stick to a good path and that she can break the cycle and she broke a cycle ended in her case she had a little help because\nHer mother was actually the daughter of policemen and a a prison guard and a grandmother who was a nurse so she had some very good influences in her family that would help to overcome some of the Bogle side of her family\nFox Butterfield new book is ...\nAnd in my father's house new view of how crime rent in the family thank you very much for talking with us thank you very much [noise]\n\nYou're listening to all things considered from NPR News\nSupport for NPR comes from the station\nI'm from the financial services for of Raymond James offering personalized wealth management device and banking capital markets expertise along with the legacy of putting clients financial wellbeing first learned more it Raymond James dot com\nFrom Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles the family's experience of survival relapse in recovery starring Steve corral and Timothy shallow may know plane\nI'm from love me and makers of go to meeting the collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more is go to meeting dot com\nSupport for your public radio station comes from our members and from Nazareth college art center welcoming standup storytellers genes judge engine Colbert on Saturday to remember third uttered on public radio snap judgment this comedy double bill adds humor to stories of everyday life\nTickets on line that art center dot ... dot edu\n... just before six o'clock or listening to all things considered for members or to public radio mornings or had a double us which I Am Thirteen Seventy Rochester\nW exercise them each each to Rochester in the pool with Jim Kelly is just moments away on W. or you work up in each the Rochester to believe or you are in the broadcast partnership\nOf the University of Rochester WRX excite public broadcasting\nForty eight right now in downtown Rochester going down to the upper thirties overnight\n\nYou are listening to different radio on W. R. U. R. eighty eight point five FM an HD Rochester\nW are you are in the broadcast partnership between the University of Rochester and W. ... public broadcasting it is Monday evening six o'clock Gen Kelly and you're especially in the fold\nAre going to start things off with boy in there and southern and\n\nTo go to Darren Darren [noise] or\n[noise]\nSteam during John nervous about it\nOwn mind in my mind\n\n\n\nThey used to\n\nSupport for different radio comes from our members from ... college art center walk standup story tellers James John and John Culver on Saturday November third as heard on public radio snap judgment just comedy double bill at humor to stories of everyday life\nTickets on line at art center dot and AIDS the dot edu\nWe started out the evening with boy in there with southern radio from their two thousand and Thirteen harlequin dream after that it was ... was another reason to go ... in the mix spectacular girl off of there are two thousand and ten tomorrow morning\nAnd jade bird rounded up that way and lottery\nUp next it's Willie Mae Seaton with talk me down you're listening to W. or you are eighty each side\n[noise]\n\n\n\nWhat did you talk let me do I go I go no go down the road Utah I go about [noise]\n\nWere numerous\nJoe ... Joe Neel is really a a Joe\n[noise]\nRole do who use use use\nThe road ... ... ... [noise]\n\nWhat are the correction Jews you know you\nWere in a crash and burn zoo\nSo much so much James\nStarted to shake my\n[noise] I don't\nCalled um [noise] but it is just you know the\n\nDoes when you talk to me and says I'm going to get\nI'm In new\nJersey [noise]\nOh no no no new jobs and\nBut Joe Joe Joe with you live to make\nRole does hold\nWhat does a news or\nAbout you know like\nYou know the crash to do\n[noise]\n[noise] [noise] [noise] uh\nWhere it is they do ...\nA campaign\nThe the you\nFind a you\nSurvey\n\n[noise]\n\nWe did it in the rural\nNo the ... the ...\nAnd the pain in the morning\nThat the the ah did go who\nCan't find the truth\nAnd how the law and can be tomorrow any of the days that\nWanted to be an asteroid no\nShouldn't have been planned\nOn non no\nAnd na\nNa na na\n...\n\n[noise]\nTerm\nMean when I make or [noise]\nA\nThe family\nMember and by the way I Am I I'm not saying I\nMindy and yeah [laughter]\n[laughter] I mean I imagine\n\n\nAgain [laughter]\n[noise] [laughter]\n[noise]\nAnd they [noise]\n[noise]\n\nKnow the truth\n\nChambers again and\n\nAgain\n\n\n[noise] [noise]\n\n\n\nAh\nState yeah with the skin of my fellow country he ... off all their debut album the down to the sounds of\nLanguage land that was back a while for me to south ... be set free Ryan Adams in the cardinals were one of my favorite track before I go I heard ... opened up that ... Lazarus from the two thousand and eleven each other we\nUp next it's rough zone Kayla David ... delivery you're listening to in the W. R. U. R. E. E. we saw\n[noise] [noise] [noise]\n[noise] [noise]\n... ... ... ...\n... ... ...\n... ...\nWas my mother you\n\n\n\n\nThe\n\nThe\nThe the\n\nWell it does is try\nLive to oh about yeah\nDoes your bill\nLa\n\n\nWinding down six o'clock hour we just heard from Nico case with a deep red bell from the two thousand and two blacklisted Regina specter with her version of John Lennon real loves\nJohn Lennon with how from the Nineteen Seventy one imagine and the ... started off the set with delivery\nYou're listening to you in the fold on different radio W are you are eighty eight point five at them an HD Rochester you can also find us on line three W. R. U. R. dot org moving into the seven o'clock hour here is king soy with groove me [noise]\nOh [noise] and then do you do not\n... they do do we stand now so I\nI just can't do they come\nAnd sleep in\nAnd out to be so we can have a free speech and no you go to\nAll of\nBig no\nThe ball and and now let's call no\nPain than the dominant than there's a\nNeed and and\nIt's not good at all they plan to hold your blue cute little\nFaint\nTo me you know we don't need to all the little man can get a chance to\nKnow that you've been through the day off you\nWhen they did\nGo mow\nThe ball to\nOh I've done that in that\n...\nMillion dollars to be just to keep 'em up\nYou know in you know I don't know how bad enough\nTo just [noise] don't know\n[noise]\nAnd Anna\nAnna Anna Witter ... around her\nAnd\n\nRowdy game change and [laughter]\nAnd Turner\nAnd [laughter]\nAnd your name and and you know and\nToo big to do that [laughter] [laughter]\nTime between the two of them came\nAnd then there was\nHer at all [laughter]\n[noise]\n\n[noise]\n[noise]\nAgain about the child was\nMoney\nAnd you\n\n[noise]\n\n\n\n[noise]\n\n\nThe same\nWell well\nWell\nWell then\nWell well\nWell well\n\nTo an all men or not we know\nAre not yeah ...\n...\nDoes she do not\nHave been in the last\nThe\nUm in them and then there was when the\nWhen\nWell well\nThen\nWe ... we know gee injection\n\nAnd\nKids and and this and then you carry on and they don't let you go\nNews to not say in the next and then then maybe\n\nOh oh\nOh\nOh\n\nTo say about love and she'd go from a bottle\nAnd I'm from below\n... miles below where the lips of a say\nMiddle\nOne room all along the street from the\n...\nDo we are should a man\n... on\nA low a\nJazz Can change good out um but I'm\nDown la\nLong and we live in a while I go oh yeah\nI just can't seem to get it out I'm\nMan moral [noise]\nShe used to you that much\nBy some dollars I\nGone on so long\nA\nDollars a month last month\nThing you know\nLast now look down on me you know stress\nDon't see God\n[noise]\nIn fact when I\nAnd if not\nThe line you know ...\n... ... and\nNo no no not\n[noise]\n[laughter] oh man\n\n\n\nLetting here say the new\n... ... you know\nThere's great ... na na na\nMade already and you know you say\nThere right now\nI'm not going to run out\nAnd said\nLuxury\nThat is why young man and a girl\nFire ...\nOr if they paid a\nAnd actually use her and uh\nMy my my\n\n[laughter]\n\n\nYour room ... New York is\nAnd\nLuck I say I'm Antonio\n\nAt the bread dough the woman\nMy uh dad bought\nThink the dragon\nBy the by\nThe end of the\n[noise]\nWe just heard from Clifton trapper\nWith dragon or off of destroy your of the boy and ward with his version of buddy Holly's radon Jim James here in spirit off of his latest solo collection eternally even at that opened up that with the golden age from the album teaching", "show_name": "In The Fold", "year": "2018", "city": "Rochester", "day": "22"}