{"month": "10", "state": "NY", "station": "WRUR", "content": "State Republicans in a statement saying they are the victims here and we're subject to vandalism and threats simply because they invited a controversial figure to give a talk at their club Republican candidate for governor mark Marlon arrow called on Cuomo to condemn the vandalism and called for calm on the political left\nCuomo says he does not condone the vandalism and anyone who committed those crime should be held accountable state GOP chair Ed Koch sat in a tweet that Cuomo was silent on the vandalism for a full day and has now decided to blame it all and President Trump\nCaught says Cuomo is all politics all the time in Albany Karen too wet W ... news\nJust a reminder this is never supported public radio do you exercise a um Rochester W. O. U. R. S. H. D. Rochester and all the ... H. D. to Rochester W are you are as broadcasts partnership of the University of Rochester and all the ... public broadcasting\nSupport for your public radio station comes from our members and from the New York state office of alcoholism and substance abuse services supporting opioid crisis programming on W ... information online at combat addiction talked and wide dot Gov\nI'm Evan Johnson alongside sue Rogers Alex Creighton\nReady to make are closing argument to you over the next six minutes on this Monday afternoon as the end of our first day of the fall membership campaign and people like Mary in Rochester Amanda in Ontario Susan in Pittsburgh of just called for five four sixty three hundred\nThere are five more minutes to double your dollars in this and I want to ask you what it means to be part of a community is part of the community a bunch of chain stores and a bunch of radio from national programming from some nebulous station deep in the mid west broadcasting trying to pass itself off his local when it is not\nOr is being part of the community supporting local when you can supporting your local public broadcasting and supporting local journalism to keep it strong I think that's what it means to be part of a community it's not just calling and pledging ten dollars or fifty dollars or a hundred dollars or fifty bucks a month or whatever it is\nIt's being part of a community that is growing that has culture that has journalism has local ideas and local folks who understand that community covering it in holding people accountable that's what it means when you call four or five four sixty three hundred and we ask you to do it and double your dollars right\nNow that's why we're coming up there on the end of the day here are new member Monday thank you so much to all people who took the first step\nAs membership I promise you will not be sorry you feel good that you're helping support that the station that you listen to every day the station rely on I Want to say now if you haven't called this is a great time your dollars are being doubled\nAnd having just her current with report think how much you rely on Karen every day to to bring you something from Albany so we know what's going on\nI mean it's so easy for for governments to sort of operate under wraps if nobody's watching\nIf nobody's asking them to be on the talk show if nobody's going to the press conference if nobody's going asking questions\nIt becomes a situation where people are running things in the back rooms we have too much of that already we need people who are asking those questions like avid like Randy like Karen and we're asking you right now to ... I I personally I can join me and making sure that happens\nAnd making sure that this community remains a strong democracy because we have a press\nAnd we have a core of public media journalists were making that happen the number is four or five or six to three hundred or one eight hundred tonight by nine nine nine four we want to grow this service we do not want to shrink and we want to remain committed every single day\nI Know it it gets the news can be tough it can be tough to take at times you kind of need mentally a break turn of the things I think NPR and all things considered does so well this and do all all things not just all the credit really is it it it's a diversity of programming it does give you a breather a moment to laugh or\nConsider something that is more along the lines of the arts\nAnd I'm with you I mean sometimes I get on Twitter and the best ... you know what I mean it's just this funny it's cats jumping out of paper bags and mowing people and that's better than reading news sometimes a but we also need to be informed and this is a time where it's an awfully privilege thing for me to say\nThat I'm going to avoid the news we really can't afford to avoid the news especially for those who need journalism the most right now think of the people who are the most disadvantaged in our world they're your friends and neighbors who can't afford to call for five or sixty three hundred they ...\nWe would love to make a pledge of support they don't have the disposable dollars you do you can call and make a contribution on their behalf you could think about the people in your community who need\nGreat journalism public broadcasting NPR reporters here in Rochester around the country and around the world that's what you're supporting a four by four sixty three hundred if you are already a member you can make a onetime gift say ... you want to increase or make a onetime contribution\nOn behalf of someone who can't afford to call for five or sixty three hundred you know what the next three minutes we're going to double your dollars because\nOf the Donald Maxine Davison foundation\nAnd things have really picked up in the last twenty minutes or so were finishing strong help us British this Monday strong four or five or sixty three hundred\nThat's where the weak always goes better when the first day is strong and uh it\nIt it sounds like a cliche about these dries out you know we we do this blah blah blah we ... we have these pictures but you know their true I mean I I\nI Am the general manager I I watch our budget I make sure we have the resources and these Dr matter they make a difference in so many ways we get funds from the federal government based on the amount of individual money we can ... we we can raise\nIts it's totally true so your pledges support actually has doubled up again by the federal government so make those pledges\nIndividual donors are the largest single support ups that we have and you can be one of them at a really small amount you can be part of making this community a better place to live it's as simple as that to me having a strong public broadcasting station having the stations that have music on them\nHaving the the television stations all of that makes Rochester and the entire journey see belly region a better place to live and it's because your neighbors your friends and now maybe you are putting five bucks ten bucks a month toward making the station strong for five or sixty three hundred\nAnd I will make a final kind of pitch to you if you are listening and you can afford to do something really special\nIf you can write a four figure check if you can do something that would make you feel amazing to start out this week this is the time to do that for five four sixty three hundred and the next minute or so get that Colin will double your contribution\nAnd think about the impact you can have with just one phone call the first time I called it felt great I remember the feeling of it I felt like I was part of something find there wasn't just sort of consuming something from a bar\nI became part of the community to great chance for you to do that I promised it feels good the members of the volunteers were going to take your calls\nOr just about the nicest people you will meet\nAnd then you're on your way with your evening everyone's busy you're thinking about dinner or are you thinking about finishing up a work day or all the things that you've got to do with you did very very busy time we're not asking for much in terms of time we are asking you to become part of our communities from Alex in Sioux and every one of W ... everyone who's\nCalled would keep the week going strong thank you for calling for five four sixty three hundred\nAnd you're listening to different radio on W. R. U. R. eighty eight point five at them an HD Rochester W are you are they broadcast partnership between the University of Rochester and W. ... public broadcasting\nIt is Monday evening six o'clock this is Jen Sally and I will be with you for the next two hours you are officially in the fold are going to kick off the evening with the clash and Magnificent Seven\n[noise]\n\n[noise]\n\n\n\n\nSo do you\nOf going back\nYou know when my\nI Am and damned\nIf you are\nBut I\n[noise]\n[noise]\n\n\n\n\nNa\n\n\nNa na na\nMm\n\nStarting off our evening we heard from the clash\nWith the magnificent seven dating back to their Nineteen eighty Sandinistas tucked in the middle of it was David Bowie with the young American and rounding out the that we heard from her vile and courting Burnett was over everything off of their collaboration album lotta\nUp next moving in a different direction here is Duffy with stepping stone you are listening to W. R. U. R. eighty eight week by\nThe way that we\nI Know well yeah when you look\nThey end up on the you know\nI mean well yes I Know they may may ...\nKnow just\nMinute me maybe who were\nGetting in a good gig from me\nLet you gave them a little album no well they just need to\nNeed aid on levy and do all\nWay and they make no\nTo me and then they\nGo oh\nLeaving low\nSchool to\nAnd\n\n\nNo\n\n\nAnd\n\nThink\nThat\n[laughter] [noise]\n[noise]\n[laughter]\n[noise]\nMy aunt\nAnd\n[noise] na na\nNa na na\n\nNa\nNa na\nAnd [noise] and [noise] and um\n[noise]\n\n\n[noise]\n\nNo\nWe do you think all day\nYou know in our minds\nThat are we doing\nAnd\nOr would you know\nThe police\n\n\nShame shame shame\nShame shame shame on you\nGame game ...\nShame shame shame shame on you\nI Know\nA\nNo no\nSaying\nNo\nNo\n[laughter] no\nNo no no no [laughter]\nNo\n[laughter] well\nA good man and nobody was\n... on\nBut\nNo the one where we're there was\nNo other measurable\nBoth Bernie I'm a\nThe long run the the ... no not the\nBack home\nNa na na\n\nAnd a\n...\nYear old but I had ... or ... or\nNa\nNa na\nMore no\n\nThat bad and then maybe every day to\nNearest one or the ... don't get the phone\n\n\n... ... ... ... ...\n... ... ... ... ... ... ... still you know\nHow you made my heart three ... ... ... ... ...\n... a try so hard to see it from your city\n... ...\nBut never ... lab boy yeah ...\nDid was hit the gym\nAnd\nGetting men or even knew when I said you're a\nRandom\nAnd I don't know why and\nOr even knew ...\nAs the branch manager\nDirectly in me everywhere I go\nTo my mind\nYeah it was ...\nMan or even when I did that and I'm a\nBig change them and I know\n\nWords are written down in ... ... ...\n... ...\n... yeah\nThe\nIn your hand or yeah\nMan\nKnow in\nSee the good my name is Amy\n\nThat was a husband and wife buddy and Julie Miller with chalk featuring Patty Griffin up there are two thousand nine written chalk before that we heard from Bruce Springsteen within ... city dating back to Nineteen eighty to\nNo\nThat me\nAnd my gosh\n\n... ...\nAnd\nAnd\nMaryland and Virginia\nMan\nAnd\n...\n\nAnd\n...\n\n\nNa\nAnd\n\nAnd na na na na na na na\nNa na\nNa\nNa na\nNa na\nNa na na na\nNa way is right change [noise]\nNa ...\n... ... and we will\nAnything and then we move drainage ditch day in the\n[noise] na na na na\nNa na na na na\n\nWinding down six o'clock hour at the top of the SAT we heard from Phoenix with trying to be cool from their two thousand is Thirteen bankrupt\nFollowed by Fiona Apple with extraordinary machine that or even with conceived from her two thousand six strangers and Steve Earle rounded out the set transcendental leader\nHe will be coming to anthology on December first with the you know they believed tickets are still available\nYou're listening to you in the fold on different radio W are you are eighty eight point five FM an HD Rochester you can also find this on line through W. R. U. R. dot work moving into the seven o'clock hour here is el though with magnificent she says\n\n\n\n\n... babies are\nGot around he's telling me that at\nFor not crowded windowless Tovia\nNot in the U.S reveal but nothing is following\nNews drinking from and where it was\nAnd all of our dogs I\nThere he was old and a rose or\nIs much weaker than live with it all or most\nI remember when we were alone in your\nEar and out your window and you'll be going so\nI Would do about\nI thought I Do but\nBlown back um there were there again\nKnow I Love dealer now was waiting\n\nThat was laced with all back with a lady from his two thousand Seventeen twin solitude before that we heard from Gomez with air stream driver the shin with sea legs from their two thousand seven when things like way\nAn elbow started out that way the magnificent sad that from their album little section\nUp next we'll go with a ha ha [laughter]\n\n\nOh no no no ... yeah the yeah\nMm\n... yeah\n\nYou know we'll try living\n\nAlone in ... ... ... yeah\n\nWe don't know where does that do ...\n... ... ... no ... no\nNo no no no no no no ...\nNo\nUm no no no no no no no no no\n... ... ... ...\nYou know the show or do a lot of\nThings in\nA woman and then you know ... ...\nEmail to\nDo ...\nNa na\nNa na na\nNa na\n\n\nNa\nNa\nNa na\nNa na na na\n... yet\n\nTo win a dry making man\n\n[noise] [noise] [noise]\n\nDo\nThey just\nThe right to\nThey ask you to really\n[noise]\nAnd I'm sure you want to be\nReverse the leaders of the day\nKnow we really ought to be drinking from match and asked me you know I\nI'll watch [noise]\nHow are you\nI Am ...\nNow my brother then I'm sure\nThey do that now there is a myth that are that is very very angry\nWith Mary Jane on the\nNews today\nShe is good to me and then you're just\nLike to be but it's been a man\nAnd allowed\nOn Jan\nJan\nThere are now argue\nI met the guy I\nDon't know I Wish that you hear\nBut I did I\nSay and I noticed that in the church that argue\nWant and then\nI Am on the\n[noise]\n... ...\n... ... ... ...\n...\nHe\nOkay\nThere's\nSee\nThese\nThe only you know the\n[noise] [noise]\nWe have a\n... [laughter]\nWell let's see he\nHe he he\n[noise]\n\nHe\nMm Mm\nMm Mm Mm Mm Mm Mm Mm\nAnd I'm\n[noise]\nThe um\nAgain once a\nNa\n[noise]\nThe uh\nNew to\nThough\nThere's none of\nYou\nThat mean they ...\nRight there where she got\nMan [laughter] you go\nGo\nNow\nBegging this man I'm about\nSame\nYou guys doing good\nAnd ...\nWe just heard from the kinks with a well respected man before that in the middle it was broken dealt with the high road ... rumor has it there'll be releasing a new album forward to that and the Camp David started up that we live very\nUp next year is Loni with atomic\n[noise]", "show_name": "In The Fold", "year": "2018", "city": "Rochester", "day": "15"}