{"month": "10", "state": "AZ", "station": "KJZZ", "content": "[laughter]\n\n\n\nMm\nAnd\n\n\nAnd ...\n\nAnd\nNa mhm Mm\n\nAnd\nMm\n\n\n\nNa ...\n...\nNa na\n\n\nMm\n\n\n\n\n\n...\n\n\n\n[noise]\n\nI guess I'll hang my tears out to dry that a tenor saxophone into Dexter Gordon from his L. P. go released in Nineteen sixty two sunny Clark is that the piano\nDexter Gordon was one of the top ten or ... to come out of the ... era and you work with such names is Lionel Hampton we Armstrong Nat King Cole Billy ... and dizzy Gillespie\nExtra burdens careers stretch from the Nineteen forties to the Nineteen eighties you made major comebacks in the Nineteen fifties seventies and eighties growing more popular each time absence does make the heart grow fonder\nEvening and walk into a late night jazz or Ninety One point five FM key Jay's easy Phoenix H. D. N. H. D. too I'm writing Houston I Hope you're enjoying a tear free evening unless they're tears of joy of course\nI have a program that will make you happy music from Coleman Hawkins kitty dorm and the latest from Houston Person are all in the play list plus many more so stay with me and thank you for joining me tonight\nHe Jay Z is supported by boat Degas Thirteen featuring lived jazz dinner concerts every Thursday Friday and Saturday Night from seven to ten PM in North Scottsdale\nSpecial guest auto ... performs his John Lennon tribute on October twenty seventh bodega Thirteen dot\n\nJoining me tonight he Jay Z is supported by boat Degas Thirteen featuring live jazz dinner concerts every Thursday Friday and Saturday Night from seven to ten PM in North Scottsdale\nSpecial guest auto ... performs he's John Lennon tribute on October twenty seven will dig at Thirteen dot com\nLeader track from rock Winkler ensure all been teens new CD is coming up being just a few minutes first ... check Baker as someone you must meet\nWith tenor saxophone is George Coleman you seize jak bakers Nineteen sixty five recording of Rodgers and heart composition ears have you met miss Jones on ... [noise]\nTeam to them [noise]\nThan we need\nYou're not going to [noise]\n\n\n\nThe [noise]\n[noise]\nJob to do\n\n[noise]\nTo back new tunes on K jazz that's called ... and it's performed by having the three Oregon bend Patterson ... CD live advantage elders with guitarist edge Jerry in drummer Jason ... riding out his trio that was in ...\n\n[noise] factor\nBack new tunes on K jazz that's called ... and it's performed by having to be three organist bent Patterson interim ACT live advantage elders with guitars ed Sherry and drummer Jason team in rounding out his trio that tune was composed by Wayne Shorter\nBefore that you heard a devil may care to do it by mark Winkler ensure open teen their album is called eastern standard time they wanted to recreate the sounds club goers would here at uh Manhattan hot spot in the late Nineteen fifties\nJust ahead we'll listen to a romantic tune from another dynamite duo the legendary Paul McCartney and Diana crawl\n... is supported by mirrors all providing alternative treatment for eating disorders and now including residential and the programs for men women and teens detail that nurse all dot net\nRight now here's clarinet player and band leader Benny Goodman the king of swing this is his making forty seven recording of all the cats join in you're listening to late night jazz on Ninety One point five FM cage aids easy\n[noise]\n\n\nAnd ... and one of the remaining money or do\nWill [noise] send a buddy\n\n\nThat\nStand that\n[noise]\nBut [noise]\n[noise]\n[noise]\n\n\n\nFish tank\n\n[noise] yeah\n\nBefore him you heard my Valentine it's never too soon for a love song especially when it brings together vocalist and composer Paul McCartney pianist Diana crawl and guitarists Eric Clapton and John pits are really that is from Paul McCartney he's twenty twelve release kisses on the bottom\nYou're tuned to late night jazz I'm Ninety One point five FM cage aids easy Phoenix H. D. N. H. D. too and Brian Houston it's quite heavy lifting along tonight\nI Hope you're having a good evening there was a full moon out tonight and coming up organized Larry young will take us on a ride did this guy's gay Jay's easy is supported by quaint and university nationally ranked by us\nRelease guesses on the bottom you're tuned to late night jazz or Ninety One point five FM DJ's easy Phoenix H. E. N. H. D. too and Brian Houston squared heavy listening on tonight I Hope you're having a good evening there was a full moon out tonight and coming up organized Larry young will take us on a ride to disguise\n... is supported by waiting university\nNationally ranked by US News and World Report bringing new and expanded health sciences programs to Phoenix\nLearnt how crayton is training the health care workforce at writing dot edu slash Phoenix here is trumpeter Kenny dorm with being is to Jordan and composer and baritone saxophonist Cecil pain it's there and Eighteen fifty six recording of bringing up father on K jazz [noise]\nSee during the month or two or\nThree of them voted\nFor him to the to the people from some\nOf the most birds to burn burn ... bird\nMost people are from\nThe\nBird\nBoom boom\nBoom boom [noise]\n\n\nThat\nKnow\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\nMhm\n\n\n\nThis is members of the key jazz Ninety One point five FM gay jade these the Phoenix H. D. H. D. do service a real it's a lot of college and your classic jak connection\nEvery week they are made in the evening into one in the morning and streaming twenty four hours a day seven days a week a jazz Becky Jay Z out of work\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\nBoy meets warn that is the jazz at Lincoln Center orchestra among the many many artist on that song were ... markets Belgrade and what didn't Marcellus dribbling his wife live Gordon being as sure rural Indiana and baritone saxophonist Joe temporarily\nBoy meets warnings on the orchestras they came to swing album that Nineteen Ninety four release was a celebration of the music of the legendary Duke Ellington\nLate night jazz continues on Ninety One point five FM gauge as easy Phoenix H. D. H. D. do and Brian Houston and interesting with me unless you're enjoying the music red Fishman is on the way for you this hour as our new sounds from drummer Bobby Santa Maria and in just a few minutes singer Christine hit\nFirst up the great guitars Charlie Bird Barney castle and herb Ellis this is the original cast of the super group which formed in Nineteen Seventy three and recorded albums together\nHouston interesting with me unless you're enjoying the music right Fishman is on the way for you this hour as our new sounds from drummer Bobby Santa Maria and it just a few minutes singer Christine hit\nFirst at the great guitar Charlie Bird Barney castle and herb Ellis\nThis is the original cast of the super group which formed in Nineteen Seventy three and recorded albums together until Nineteen Ninety One the songs from the great guitar is to be released in Nineteen Seventy six [noise] this is their version of the Antonio Carlos ... composition I'm pyro\nYour are the great guitars on K jazz [noise]\n\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n...\n\n\n\nYour music on the jazz they just called the navigator and his performed by tenor saxophone as Greg Diaz is CD is called begin the Gore with him on that release is the art of imagination jazz orchestra which includes guitarist Christian Davis\nPrior to that we heard your bird sweet sun by Christine hit that is from her CD metric tight off the saxophonist Bob Sheppard drummer Jeff Hamilton and peanuts to John Beasley played on that classic Charlie Parker composition\nDrummer ... and the multi versus big band reworking Broadway favorite for you in just a few minutes that followed tenor saxophone as Coleman Hawkins who brings his trademark big sound to this Nineteen sixty recording of Duke Ellington coke opposition\nWith pianist Tommy fled again ended trumpeter Joe Thomas theories Coleman Hawkins performing I'm beginning to see the light\nYou tuned to late night jazz or Ninety One point five ... easy [noise]\nDid this Nineteen sixty recording of a ... composition with pianist Tommy fled again Andy trumpeter Joe Thomas Yuri's Coleman Hawkins performing I'm beginning to see the light your tune too late night jazz or Ninety One point five ...\n...\nThem\nThis is a member supported gay jazz Ninety One point five FM cage aids easy Phoenix H. D. H. D. to your classic jazz connection\n[noise]\n\n... who was on its way to be\nJust get that way you do when you're ready to learn the\nLevel and does go where the average American dreamers dreamed to gather\nOh no man's on a number of things go this way and have to be a dream dream to gather\n\nI concentrate on you and wave guitarist and vocals John ... and vocalist Daniel Joe Bean teeming mentally of songs from two of the world's greatest composers Cole Porter Antonio Carlos ... being\nPrior to them it was the jet song performed by drummer and vocalist Bobby Santa Maria he's leading the multi versus big band on that song from the new album west side story reimagining\nTrumpeter max dark shape was one of the soloist there\nYou're listening to late night jazz or Ninety One point five after ... Phoenix H. D. in each de to Arizona artist great Fishman is coming up in the next short sick\nAnd if you'd like to see Arizona artists inaction visit the events calendar at jazz dot ... dot org to learn who's playing when and if any near you around in the valley or around the state\nHere's clarinet a kitten to plow ski pianist junior man's and guitarist in ... Howard old it playing between the devil and the deep blue sea on K jazz um\nAnd guitarist and composer Howard old it playing between the devil and the deep blue sea on gay judge\n\nCan do\nThat [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] we're going to\n\nTalk to people on the need\nTo be able to\n[noise]\n[noise]", "year": "2018", "show_name": "Classic Jazz with Bryan Houston", "city": "Phoenix", "day": "25"}