{"month": "10", "state": "AZ", "station": "KJZZ", "content": "... he\n...\nDish\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\nAnd\n\n[noise]\n\nDo not only\nDuring\n\n\n\n\nLady good pianists gene Harris recorded live in London in Nineteen Ninety six at concert was at London's pizza express and Jean Harris played with a quartet that was rented out with European musicians\nIncluding Scottish guitarist Jim ... a man who spearheaded the British jazz fusion movement in the Nineteen seventies\nDrummer Martin Drew from England worked with another piano great Oscar Peterson\nGood evening welcome to late night jazz or Ninety One point five FM K Jay's easy Phoenix H. D. H. D. too I'm Brian Houston it's good to be with you again\nIf I show is waiting in the wings for you over the next two hours I'll bring you some ... he was playing a famous standard you'll also your new music from the Count Basie orchestra performing one of the legends most beloved iTunes stay with me for them and much more thank you for joining me tonight\nGauge aids easy is supported by the Maricopa County recorders office the general election in Maricopa County is on November ... early voters should watch the mail for a yellow on below with their will Fishell ballot to mail back by October thirty first Maricopa I'd vote\nNew music from Cyrus Chestnut and singer Christine hit finish this\n... is supported by the Maricopa County recorders office the general election in Maricopa County is on November ... early voters should watch the mail for a yellow on below what they're all Fishell ballot mail back by October thirty first Maricopa I'd vote\nNew music from Cyrus Chestnut and singer Christine hit finished this first set which opens with a pair of great guitarist Tommy Emanuel well and Martin Taylor here their team to perform these standard lullaby a bird land this is Tommy your menu will and Britain Taylor on K jazz\n\n\n\nTo do something\nTo do\n\n\n\n\nTo see things from ... to ...\n\n[noise]\n\n\nNew music on gauge as that is called entree crochet you just played by pianist Cyrus Chestnut from his album kaleidoscope it's a relief that features songs from all over the musical map\nThe one we just heard was composed by Maurice rebelled in the early twentieth century Cyrus Chestnut adapted that two players song as a solo according to the liner notes\nPrior to him you heard we eat in the water some by Christine hit it appears on her album magical kite that tune featured Alto saxophonist Bob Sheppard being at the John ... easily and drummer Jeff Hamilton\nEven more new music is still ahead tenor saxophone as we see Barnes and Larry McKenna play a famous theme from an obscure a television show\n... is supported by mirrors all providing alternative treatment for eating disorders and now including residential indie programs for men women and teens detail that mirror Saul dot net ... we're a third of the way through the fall we can still enjoy this\nTenor saxophone as we see Barnes and Larry McKenna play a famous scene from an obscure television Joe\n... is supported by mere assault providing alternative treatment for eating disorders and now including residential Andy programs for men women and teens\nDetail that mirror assault dot net ... we're a third of the way through the fall but we can still enjoy this June performed by pianist George cheering\nYour they live recording of joy spring you're listening to late night jazz or Ninety One point five F. M. K. Jay Z\nBut the next year return to the other side of the brown joy spring\n[noise] and [noise] those who'd been\nAnd\nA win but uh [noise]\n\n\n[noise]\n... [noise]\n[noise]\n[noise]\nWho they\nAre trying to stay\nThe\n...\n\n[noise]\nFor people\n[noise] [noise]\n\n\n\nThe\nHave uh\n\nNa na na\nNa\n\nNa\nNa\nNa\nNa na na na\n\nNa\n\nDa da\nDum la Mancha\nAging\nNew keys in my mind ...\nMen do ... ... dollars via a man who would do much to learn more about how much time to be ... I think they do\n... do you mind die when when you would I don't\nAnd ... and the ...\nThe average of ... when when I graduated in ... by\nYou\nThe goal is a dome his dad died\nIn the ... car law\nAbu ...\nThe money down down down\nBible ... ball and why is ...\n... ... ... and the average ...\nThen in ... in Atlanta ga but then they got about ah\nWhen you go down and down\nOur but he does the dodge balls wise to go with it on a\nThe average day that the average ... ...\nThen in other words either they got about\nA little bit of\nKnow them and then\nLater on human none of them up and\nThis\nBit in the middle of the ... southern\nRange in fall on just a desire to do bring get involved with a bomb in\nThe\nBrain can football for a number of the flower\nTo default lettuce farm loan me\nYou know with a ... day\nI was you been there\nCan on on the flower [noise]\nTo fall on land falling on me\nOn regime in man\n\n... bear bear that his vocals and guitarist John pits are really and vocalist Daniel ... D me up on a composition by Daniel Drew beams father Antonio Carlos ... will be\nPrior to that we heard Mr lucky dinner saxophonist boots the barns and Larry McKenna joined forces on that tune from their album the more I see you that TV seem was composed by Henry Man Seaney for the Nineteen fifty nine series at the same name\nYou're listening to late night jazz or Ninety One point five FM cage aids easy Phoenix each D. H. D. too I'm writing Houston I Hope you're enjoying a good evening it's good to have you listening along with me tonight\nMuch more music is ahead for you including another new tune played by the skin kid didn't look at the orchestra directed by Michael ...\nD jays easy is supported by easy five to nine years on a college savings plans you can celebrate college saving money\nYou too bright Houston I Hope you're enjoying a good evening it's good to have you listening along with me tonight [noise] much more music is ahead for you including another new to you played by the skin kitten legacy orchestra directed by Mike backs\nDJ's easy is supported by easy five to nine the Arizona college savings plans you can celebrate college saving money by starting a college savings plans for someone you love complete details at easy five to nine dot Gov\nRight now it's time to reminisce with Trump ... he's with peanut mo blue Miller and tenor saxophone as James Carter here this is called back in the day here's Steve gray on K jazz\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nThis is a member supporting key jazz Ninety One point five FM kj the Phoenix each ... each ... to a service so real it's a lot of college and your classic jazz connection\nEvery week that are made in the evening until one in the morning and streaming twenty four hours a day seven days a week at jazz decade Jay Z dot org\n\n\nGiant steps that tenor saxophonist John Coltrane with the title track of his Nineteen fifty nine L. P. giants ... says it all in Nineteen fifty seven in Nineteen fifty eight you partnered with a ... month Indian Nineteen fifty eight you recovered from his addiction problems\nReally are in Nineteen fifty nine you partnered with Miles Davis on kind of blue\nWith his popularity with fans and critics at its peak John Coltrane delivered one of the best jazz albums of all time giant steps is a masterpiece of innovation that's been highly influential nearly six decades since its release\nYou partnered with a ... month Andy Nineteen fifty eight he recovered from his addiction problems really are in Nineteen fifty nine you partnered with Miles Davis on kind of blue\nWith his popularity with fans and critics at its peak John Coltrane delivered one of the best to jazz albums of all time giant steps is a masterpiece of innovation that's been highly influential nearly six decades since its release\nLate night jazz continues I Ninety One point five FM cage aids easy Phoenix H. D. in each key to embrace Houston glad you could stay with me run a reporter is on the way for you this hour and a new music from vocalist and being if Deborah man is in the middle of this first set\nRight now here's pianist Joel Robin he's in Arizona artist if you'd like to know when you can see him performing live the events calendar at jazz dot ... dot org will have the details for you this students called love is a many splendid thing here is Joel Robin on the jets\n[noise]\n\n[noise]\n\n\n[laughter]\n[noise]\n...\n\n\n...\n\n\nOne more time\n\n\nOne more try [noise]\n\n\n\nApril in Paris that is the Count Basie orchestra on gauge as it comes in their new album all about that ... we're going to join the Francesco intersects opponent Doug Lawrence with these special guests on that recording when orchestra favorite since Nineteen fifty seven\nPrior to them we heard both sides now that's singer in peanut Deborah man's new CD full circle the music of Joni Mitchell\nVocalist reporter follows this June by tenor saxophone it's Johnnie Griffin and ... joined David this comes from their album of dinners back again recorded live in Nineteen eighty four ears intermission risk you're attuned to late night jazz a Ninety One point five FM kj is easy\n[noise]\n[noise]\nUm [noise]\nHer\n\n\n\n\nOr [noise]\n\nAnd\nAll that and here we are\nIn a bank they know they were reading\nDo\nAnd\nAll that we are\nIn a bank now they are right\nOh\n\nI'm just saying her [noise]\n[laughter] [noise]\n[noise]\nNa na na\nNa na na\n\nNa\n\n[noise]\nYes as members of forty K jazz Ninety One point five FM kj the the Phoenix each ... to your classic jazz connection\n[noise]\n\nThis is members of forty K jazz Ninety One point five FM cage aids easy Phoenix each D. H. D. to your classic jazz connection\nWell they do\nTheir ...\nIn preparation for the ...\nThe sidewalks\n\nEvery saw a shiny things\nVery movies for\nA day\nWhen they hear him say\nTo me to read a\nTake me to the fleet didn't want a\nTake me to the new ones\nThat somehow or\nTheir way or the [noise]\nLet them hear me\nSay ...\nI Am your friend\nAnd\nI'm\nSo much say whoa breast your hair and my God then\nUh\nAnd the ...\nI Am your friend\nAnd\nI'm\nSo much say whoa Richard Gere and much of a sudden\nA\nTo me to be a highly [noise]\nWe used to be in Flint geared more a ...\nTo use the new ones that some how long is that where\nThe [noise]\nLet him be Saturday or Sunday [noise]\nAh nah\n'em\nToo much cheese\nRisk in my ... ah\nNo no\n\nOh whoa\n\n\n\nMhm\n\nAnd ... and ...\nMaine in ...\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\nOh\nLook\nYou know\n\nThe\n\nUp to\n\n... ...\n...\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nAs a\n", "show_name": "Classic Jazz with Bryan Houston", "year": "2018", "city": "Phoenix", "day": "24"}