{"month": "10", "state": "AZ", "station": "KJZZ", "content": "Doo doo doo doo doo doo doo doo doo doo doo doo doo doo doo doo doo doo doo\nDoo doo doo doo doo doo doo doo doo doo doo doo\nDoo doo doo doo doo doo doo doo doo\nDoo doo doo doo doo doo doo doo\n[noise]\n[noise] ah\n\nDa\nNo\n\n\n\n\nLittle Duke struck crop or Nicholas Payton ms album Pete and it's like he grew up in a musical family his father was a bassist and his mother was opinion Nicholas Payton steady for me to injury\nLittle Duke strut trumpeter Nicholas Payton from his album paintings plates he grew up in a musical family his father was a bassist and his mother was a pianist Nicholas Payton steady forbidden to Ellis Marsalis and has performed with Wynton Marsalis and Clark Terry over the course of his uh claimed career\nWith him on little Duke strut was tenor saxophone it Tim Maurer field and pianist Anthony ones the\nBeginning and welcome again to late night jazz on Ninety One point five FM cage aids easy Phoenix H. D. and D. H. D. too and Brian Houston hope you're enjoying a finite if you're looking for some good sounds to ease you into the back nine of the week you're in the right spot\nDiana crawl in Charlie Rouse or on the bill along with Ken and bought out early who's playing an optimistic tune all that and much more is waiting for you so stay with me and thanks for joining me tonight\n... supported by the Maricopa County recorders office information on polling employment opportunities can be found at government jobs dot com or by calling six so to five or six one five one one\nChildren teens things about a guy who just doesn't get the hint right after this song by jazz at Lincoln Center is from the album the music of John Lewis after the pianist and founder of the modern jazz quartet\nThis is one of his compositions featuring soldiers by clarinet is Victor Goins guitarist Doug ... and pianist John ... east\nHere is jazz at Lincoln Center with two degrees eased three degrees west on K jazz\nRight after this song by jazz at Lincoln Center it's from the album the music of John Lewis after the pianist and founder of the modern jazz quartet this is one of his compositions between soldiers by clarinet is Victor Goins guitarist Doug wobble and pianist John ... east\nHere is jazz at Lincoln Center with two degrees eased three degrees west on key jazz [noise]\n[noise]\nOh no\nNo\nNo\n\n[noise] mhm\n\n\n\n\n[noise]\n\n\n[noise]\n...\n...\nAnd\n...\n\n[noise]\n\nDo\n...\n\n...\n\nAlready\nThen and then\nFood\n[laughter] [noise]\nDoing the\n\nTo do\nIt\nDo this\nShe\nNew music on the jazz that's called swing with it and it's played by the yellow jackets saxophone Bob ... and pianist Russell for on the lead the ban the album is called raising our voice for that\nNew music on gay jazz that's called swing with it and it's played by the yellow jackets saxophonist Bob ... and pianist Russell ... lead the band the album is called raising our voice\nBefore that we heard the gentleman is a dope sung by Cheryl been teen saxophone as Bob Sheppard joints are and that song from eastern standard time it release from Cheryl in teen and more Winkler\nTrying to put on your dancing shoes Robin mckell will be in step with you in just a few minutes\n... supported by Mr Arts Center at asking snap judgment live the radio show in pod cast by WNYC Studios is bringing their storytelling was it'd be to the stage friday November sixteenth tickets that means or art center dot com\nEra for jazz greats playing the music for a fifth grade pianist Oscar Peterson guitarist herb Ellis basis ray brown and drummer buddy rich released the album Oscar Peterson plays Count Basie in Nineteen fifty six this song is called easy does it\nAnd you're listening to late night jazz a Ninety One point five FM cages easy\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\nDrawing them telling them you know\nSome of her\nShe has\nNothing\n[noise]\n[noise] [noise]\nLady that's being if James Austin junior performing a song from his latest release songs and the key wander trumpeter Joe magna really was hurt on that one\nPrior to that we heard it she did she sung by Robin McHale\nYou're listening to late night jazz or Ninety One point five FM K. J. D. C. Phoenix H. D. and D. G. to Brian Houston glad to have you lived along with me and I hope you're doing well so much more music ahead free including Joe Papp pondering romance\nFor tourists desk reporting on key Jay Z is made possible in part with support from the Ford Foundation addressing inequality and all its forums worldwide learn more at Ford Foundation dot org\nWho's also saxophonist Kenny Ball at early with a rosy forecast fiber phone as Milt Jackson peanuts within Kelly and drummer Art Blakey or with him to deliver the message things are getting better you can ...\nFrom the Ford Foundation addressing inequality and all its forums worldwide learned more at Ford Foundation dot org\nWho's also saxophonist Kenny boy at her league with a rosy forecast fiber phone as Milt Jackson peanuts when Kelly and drummer Art Blakey or with him to deliver the message things are getting better you can ... on the jets\n[noise]\n\n\n[noise]\n\nNo\n\n\n\n\nAt\nThe same name\nA\n\n[noise]\n[noise] [noise] to do with\nThe money to go to the to\nThe window\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise]\nBack and\nAnd [noise]\n\n[laughter]\n[laughter]\nHa ha\n\nDa da da da da\nYou\n\nCan\n\n\nLittle\nBit\nBut we\n\n\n\n\nDo do do do\nDo\n\n\n\n\n\n\n...\n... ... ...\nOr maybe\nThey\nNeed and then ...\n... na na na\nNa na na na na na\nNa na\nNa na na na na\n\n\nNa na na na\nNa na na na na na\nA shame that\n\n\nA man who then\n... ... ... ...\n...\n\n\n\n[noise]\n\n\n...\n...\nNamed ... ...\n...\nMaybe\n\n...\n...\n...\n[noise]\n[noise]\n... Mm Mm Mm [noise]\nNa na na\nNa na\nNa na\n\n\n\nThis is a member supporting K jazz Ninety One point five FM cage ACC Phoenix H. D. and D. cheat to service so real it's a lot of college run the Web a jazz ducked K. J. D. C. dot org\n...\nAnd ...\nI bet ... easy Phoenix H. D. and D. H. D. to service so real it's a lot of college run the Web of jazz decay J. C. C. dot org\n\n...\nMhm Mm\nMhm mhm that\n\nCan be\nGood thing [noise]\nMm\n\nI don't\nKnow\n[noise]\n\n\nNew [noise]\n\n[noise]\nOf that\nIn in\nOf\n[noise] [noise]\n... it up and he did\nBecause that now but the\nBut if you go to go well\nYou gotta go give me a kid from all\nBig awesome man and\nBut if you gotta you gotta go get a meal go\nDown to my ...\nPlanning burn you've done\nThat yeah\nYeah and it is\nBecause I Want do you do\nBut if you go oh\nWaiting for you done\nTo try\nAnd and it is\nBecause I Want you do\nBut if you go go\n\nYeah\nIt is\nBecause I'm new to it\nIf you got to go it alone\nOh yeah it does anything\nBecause of all you do\nBut if you go like oh yeah there\nGo you know again\n\n...\n[noise]\n[noise] [noise]\nMhm [noise]\nMhm [noise] [noise] [noise] Mm Mm\n[noise] ...\n... ... ... and ... and ... and [noise]\nMm\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\nReal and\nWhat's the\nBest\nAnd\nThen and then and then and then what is\nThe\nWhole\nTime and then the judge and\n[noise] and\nThen and\nThen and then\nWhen the Pentagon and then the [noise]\nCity and in da da da da\nDa\nDa da da\nDa da\nDa da\nDa da da na na na\nNa na na na na na na na na na na na normal in and\nDo that\n\nMhm [laughter]\n[laughter] [noise] and [noise] and [noise] and [laughter]\n\n\nNo no no no no no no no no that's what I Am an hour and a\nHalf an hour and [noise] she\nDoes and gas and ... and ... and [noise] and then in\n\n\n... and and [noise]\n[noise] Mm and\n\n\nBack to back new musical engage as that is cold flat tire rude posed by played by saxophone\n\n\nBack to back new musical engage as that is called a flat tire blues and he's composed and played by saxophonist Rob Dixon Charlie hundreds on guitar Rob Jackson's album is called coast to crossroads\nPrior to him we heard Peter say goodnight that's Marty Elkins from her album fat daddy\nTenor saxophone is didn't flute player Bachmann sir is ready for his close up in just a few minutes the modern jazz quartet is still waiting for it's turned to shine on the standard composed by the group twin brothers\nHe reads ... Milt Jackson being as John Lewis basis Percy ... syndrome or Kenny clerk with their and Eighteen fifty three recording of but not for me\nYou're attuned to late night jazz or Ninety One point five FM cages easy\n\n\n\nJim T shirt\n... been\n\nWell no\nIsn't a multi ... but I Love ...\n\nAnd they know that I ... ... and ... ... the\nTo move in and day shift\nJay and Jay ...\n\nJay and Jay ...\nA\nFrom\nYou do and the valley and blue cheese is waiting for you [noise]\nMy ... had this to be heard and now in the region is old school in here\n\nThey send\nThem\n\nAgain in\nThe\nIn\nThe food ...\nJim ...\nTo to get into you\nI Do\nMm Mm\nGee\nI'm going to change [noise]\nJames sure I can\n[noise]\n\n\nThe\nTemptation be innocent singer Diana crawl prior to that it was my shutting our by saxophonist Bob minister and his big bad promoters Michael Davis and Pina's to fill Merkel which had the soul was on that song\nYou're attuned to late night jazz I Ninety One point five FM K. J. C. D. Phoenix H. D. H. D. to divert jazz ensemble dashes through the next set which opens with tenor saxophone it\nA crawl prior to that was my shutting our by saxophonist Bob minister and his big bad promoters Michael Davis and peanuts she'll Merkel which have the soul was on that song\nYou're too late night jazz Ninety One point five FM K. J. D. V. Phoenix H. D. H. D. to\nDiverge jazz ensemble dashes through the next step which opens with tenor saxophone Charlie ... this is from the long time alone is ... ... men Nineteen Seventy eight album moment's notice\nEars the clicker on ...\nDo do\nThat\n\nDi\n\n\n[noise]\n[noise]\n[noise]", "show_name": "Classic Jazz with Bryan Houston", "year": "2018", "city": "Phoenix", "day": "11"}