{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n\n\n\n\n\nYou're listening online at him be be online or gee\n[noise]\nShould that you're a composer and you're a long long way from home except to the post at a conservatory in New York City and then I'll tell you to cheer for a short period of time\nYou get a break summer holidays [noise]\nAnd you spend it with some countrymen abroad instill do Iowa to check community there well that's where I'm thing where she was [noise]\nIn his summer rented [noise]\nHis children came from but he ... he was happy happy happy he wrote this string quartet he ... he finished it in a very very short period of time surprising even himself the American ... cutting out [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\nNa\nNot the lion king queen of Judah round about Eighteen forty one B. C. or sell looks great for her age that overture from incidental music from Racine right Mendelssohn supplied the music the ... led by clown painter floor\n[laughter] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[laughter]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[laughter] [noise] [noise]\n[noise]\n\n[noise] where Jack was really happy and you can hear the a bully into almost effervescent attitude toward what was going on in his life in this American string quartet he was in Belleville Iowa\nAnd he wrote home to a friend in that summer he said I've been here on vacation since the third of June ... in the Czech villages they'll they'll be going back to New York until the last letter half of September\nThe children arrive safely from Europe and we're all happy together I'm working hard and in good spirits well a couple of weeks later actually less than two weeks later he wrote again I thank God I'm pleased at all went so quickly he\nWas finished with his American string quartet to an Eighteen Ninety three here it is with the Cleveland Quartet\n[noise]\nMm\n\nMm\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n\nThere had been [noise]\n\n[noise]\n\nThat's what\n\n\n\nGet in and they can get it\n\n\n[noise]\n\n[noise]\nHe was a happy than summer an Eighteen Ninety three I mean divorce shock his kids were gathered around him having traveled thousands of miles from the media to spill they'll Iowa to spend the summer with dad\nThe string quartet number twelve the American just kind of fell out of the road within about twelve days that summer that was performed by the Cleveland Quartet\n\n\n\n\n\n\n\nFrom all over the Oprah show\nUp in the day like one of those\nI'm not even a little lower\nKnow my father\nLaw or work for\nA walk and\nKnow we're talking about I'm a\nLittle over a little bit\nKnow so so I'm just not for for for for the little things like that for for for\nFor for for\nWhat what do\nMm\nMm Mm Mm well\nI'm On the lookout for love or\nMoney\n\nOn\n\nPhone rang and\nWe're going to look for for for for some of\nThe north for her\nWell I don't know [laughter]\n\n[laughter] [laughter] [laughter]\n[noise]\n[noise]\nNo no no no\nThe ... the number one by Francois dead yeah played by a car you know I Believe it's still on faculty at the University in Berlin teaching the Susan dislike about chamber orchestra led by boat on vox ... I'm ...\nHi this is Christine early inviting you to join me right here every Saturday from prairie home companion [noise]\nWe'll be joined by the best musicians some you'll know when others you might not know yet but we'll\nPlus a bit of comedy I knew some of the week ... biscuits instant song request and if you'd be surprised that his well All right here each week on the prairie home companion Saturday five on MP be music radio [noise]\n\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\n\nThere is a delightful picture a Charlie Chaplin\nWhen he was a younger man and he is very intently and very passionately playing cello very artistic photo [noise]\nThe truth is about chaplains life is that he took cello lessons very seriously and throughout his life he would play three four sometimes more hours a day\n\nIn quite the renaissance man he was one of the pioneers in Hollywood pioneers of making\nPictures starring in pictures writing pictures and writing the scores went along with his movies\nAnd mentally of chaplain scene is coming up [noise]\n\n[noise] this is the flower duet from Locke mainly to lead to music with Natalie du ... heightened and the orchestra to lose led by ...\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise] well [noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\nDefinitive the finale ... D minor symphony by say up front the Paris orchestra led by ... today's classical music is supported by Barrett financial partner guiding families businesses communities in institutions since Nineteen Ninety ... dot com has more information\nAnd\n\nAh [noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise] his trademark character a moustache a bowler hats bamboo Cain funny walk the little training of Charlie Chaplin one of his creations in Hollywood born in London in Eighteen eighty nine to a couple of musical performers he wound up as we all know coming to Hollywood\nAnd being not just a silent film star or a star in the east for that matter but also the director or writer producer and along with his friends in Hollywood at Douglas Fairbanks senior and Mary Pickford\nThey formed United Artists yeah still around the state that originally I it was um a bell just a teeny have these artists especially those three so they could have more creative control over the movies they were making back in the early days ... Chapman also adored music he played cello\n\nOne hundred years in London Square room worthy principle concert venue starting in Seventeen Seventy four so when you're on Christian Bach and call Frederick ... open them up on Christians spending so much time in London they called him John London bombing\nAnd heightened symphonies were crummy are there including this one night the chandelier ... except it wasn't ... number Ninety six it's really the miracle that he probably number one hundred and two Ninety six noticed a miracle on the last several ammonia like I like it\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Jackson", "day": "05"}