{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n\n[noise] a fantasy on French populace themes are basically French folks on music buying ... with the ... show him on a plane that they were led by Ishaan knock ...\nIf you'd like to expand your classical music library they free way to do that you go to your classical dot org and check out a thing called the daily download there's also the daily download newsletter we get those MP threes delivered to you every day\nSo why would you want to contribute to MPP during this week when when you contribute to Mississippi Public broadcasting you're contributing to a better ... Mississippi when the children that are affected\nBy the TV programming whether they're touched by our education outreach programs where the rich adults who are listening to news program here in in ... think radio you were making a difference with every dollar you\nGive at M. P. B. online dart board that's M. P. B. on line ... ... ...\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi it'll be in may ... W. M. A. you view there'll be MP in Jackson W. M. A. W. ... that'd be it may be structural W. M. A. V. Oxford W\nYou may know ... chicken what's happening on MTV music radio and listen online at ... be online duck or gee\n\nNow normally when somebody right to a piano concerto they they give the orchestra a little bit of a start but not so Comey assigned some Mm\nWhich called cutting to the chase\nPart of the deal may have been that he wrote that dairy herd lay it didn't have a whole lot of time to finish up the copying or even the composition\nFortunately he was a solo that's\n\nAlmost like you said the orchestra I'll I'll just keep playing until you get ready [noise]\nBecause of the very nature of the preparation rehearsals they didn't get a whole lot of critical acclaim on his first performance ... matter of fact one critics said it starts with Bach and ends with often ...\nTrust me there's an orchestra in there it's coming up\nThis is the English concert led by Andrew ... wells\n\nNa\n[noise] nah\n\nUh\n\nAh\nNo I'm na\nNa\n\nThe overture to Esther or tore up my hands on with the English chamber orchestra led by Raymond ... this is the St Petersburg string quartet performance short ... novel left by Alexander gloves and all\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\nMm\nMm [noise]\n\n\n\n[noise]\n\n[noise] [noise]\n[noise] the way it's orchestrated the way it's composed I should say a lot more ... more than four players doesn't it sounds almost like it might be a a sex chat or more that was the St Petersburg string quartets playing the novel led by Alexander gloves in\nToday's classical music is supported by dared providing global financial resources and market expertise to clients the world over our W Baird dot com has more information\n\n[noise]\nThis is music from an English composer without them you wouldn't have that last night at the prom so at least the fun part of the last night at the prompts where everybody sings rule britannia and it looks a little bit like refugees from let's make a deal back in the old days if you remember that\nI remember when Britain terrible strode out on stage one time and he was wearing a suit\nOr make completely out of the very flashy I think if I remember glitzy Welsh flag he usually does that he comes out somehow wearing a wealth rugby shirt or something on last night the prompt anyhow Thomas ... role pretend yet and a bunch of other stuff like the symphony number three an e flat Catalina is led by Adrian shepherd\n[noise]\n[noise]\n\n\nThe symphony number three in a flat Catalina led by Adrian shepherd in that performance coming up next a work by Camille sound sounds he did admittedly kind of throw it together a little bit and believe me the critics ...\n[noise]\n\n[noise]\nThis is a piano concerto by Camille sense on his second open twenty two so kind of an early work he was still a relatively young man when he wrote it\nAnd it was done very hardly he wrote it in less than three weeks and had didn't have a lot of time to prepare for the premier so it wasn't rehearsed a lot rather ... style anyway and the critics kind of slammed him for it anyway here's the G might've concerto with Andrew von ... and the ... Mm\nMm Mm\n\n\n\n[noise]\n[noise]\nMhm\n\n[noise] Mm [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\nMm\nMhm\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise] Mm\nMm Mm Mm\n\n\n\n[noise]\n\n\nMhm\n\n\n\nDo\nThey\nThey\n\n...\n\n\n\n\n[noise] [noise] Mm\n\n[noise]\n\n[noise]\n\n[noise]\n\nMm\n\n\n\n\n[noise]\n\n[noise] Mm Mm\n[noise]\n\n[noise]\n[noise]\nNo no no no\n\n\n\nThe G minor piano concerto number to Comey sound sounds up is twenty two so you can see how early that came in his in his career that was Andrew on oil and the ... silver ammonia\n... yes I'm Talking to you know obviously you've listened to the radio we\nAppreciate your point when are you a member but how did you become a member of my members are\nPart of it needs to go and put them in spite of vengeance contributions Bebe ...\nGrams you come here don't see how they have to be become asleep they never today by calling me three seven yeah that's one eight three Seventy four for me to me\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. ... W and may be struck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him be be online duck or gee\n\nEighteen century saw a lot of improvements in a lot of things one of them was an improvement any instrument the clarinet\n\nEncroached on it was one of the composers family actually held sway the place that posted they had the best orchestra in Europe back in the day and they did so much that the Mozart went to Mannheim to see what the quarter extra was doing\n[noise]\nAnd like the ... family the ... family are the royal family at the clarinet [noise]\nThis is Andrea ... is one of the sons of the family playing the cost damages choir\nAnd it can Sharon number seven a whole lot of really neat detailed in trivia coming up when you hear it [noise]\n[noise] this is yo yo ma to play mark O'Connor's Appalachian well\nOh\n\n\n\nMm\n\n\n\n\nWell\n\n[noise]\n\n\n\nA definitive ending to the finish folk dances likes to hold ... that was the finished radio symphony orchestra led by you can take a ... well this is music from England loop music played by Yucca blend Derek Carmen ... what's the name of the tune by John John\n...\n\n\nTo do things\n\nDo something\n[noise]\n[noise] [noise]\n[noise]\nLet me\nTo play ball to\n[laughter]\nDo something to\n\nDo that\n[laughter] [noise]\n[laughter]\n... nest playing ... whistle by John Johnson\n\n\n\nMm Mm\n\n\nMm\n\n[noise]\n[noise] [laughter]\n\n... ...\n\nThis is the ... family held sway headquarters in mind that the court orchestrated there\nAnd it's ... clarinet can share to number seven it's played by another member of a famous and very accomplished family Andreas ... who was born in Nineteen eighty nine in Vienna he's a clarinet is principal clarinet is\nAt the Berlin Philharmonic and not more than oh maybe about ten or twelve years ago um his father and stop his armored his older brother Danielle who are also both the silver clarinet is under the NFL demonic\nFormed a clarinet trio called the choir or not now sadly his father passed away a last summer the summer of twenty Seventeen really kind of a big loss to the\nTo the music world and to the audience armor family Andreas has been doing very well as a solo performer and even a company Tori Amos on one of her most recent albums anyhow here is Andres Oppenheimer and the pot stamp chamber academy to play the ... cheered on number seven by Carl stomach\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\nClarinet is from an accomplished clarinet playing family Andreas ... born in Nineteen eighty nine he's principal a principal clarinet is with the Berlin Philharmonic and studied also at Harvard University\nAnd that was the ... chamber academy company Andreas in the clarinet concerto an e flat number seven by Carl Sean\n[noise]\n\n\nThis is one of the English sweet to set up six sweet steady on Sebastian Bach wrote originally ah for Harper's accord maybe for climate accord there not quite sure\nThat you talked to the earliest up his Nineteen keyboard sweets nobody knows why they're really called the English sweets some say at the style isn't really English but perhaps he wrote it for a member of the English inability\nBut nothing is really emerged to substantiate that claim either so kind of shrouded in mystery here's the English we number two and a minor and the piano playing it is Anne Marie ...\n\nA little bit [laughter]\n\n[laughter]\n\n\n\n[noise]\n\n[laughter]\nNo\n\n\n[laughter]\n", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Jackson", "day": "25"}