{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nDid you learn\nBut the dog [laughter] for me\n[noise]\n\nYou know\nWith the book [noise]\nAnd I don't\n\nThen you would have\nUp a lot about the\nBattle\nThe I'm not\n\nThe U.S\n[noise]\n\nMaybe they do\n\nThat was the keyboard concerto ... fine is buying your ... maybe you've heard that for ... or sometimes will find a link that today Murray pariah played the piano when he also was conducting the Academy of St Martin in the fields and militias counseling thank you for listening\n[noise]\n[noise]\nThere were two obituaries written for France would do the ... that had since ... ... all\nThe information question was when he was and he wrote a mass which was performed by the musicians to the royal cavalry regiment that wasn't quite true\nBut we do know is that he played both flute and soon he was also a teacher and ... and when he got around to ... often built\nFor those instruments which you'll hear a little later this hour is can journal by Francois demand from the new recording I'm ... I'm we\n\nIt's music is ... ... ... ... and it's from a long way no scientists we\n[laughter] [laughter]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nDuring the years after the first World War civilians had to kind of rebuild those whose career and his finances and yeah it's a means of doing both he wrote a great deal of music that was a little more accessible and um [noise] to pull some of the\nOther pieces that he wrote very light I Would say that was the sweet meal from that period with the English string orchestra there were some flew to what's in there to William baton at the helm [noise]\nHere is the ... movement from a serenade for strings it by ... ... it's a new recording with the national sample\n\n[noise] [noise]\n\n[noise]\n[noise]\n[laughter]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise]\nDo anything to do\n\n\n\nDuring the day\nI mean I think you're going to\nHave that okay [noise]\n\nOkay do\nDo do do\nDo you\nTo\n\nHave you know that Mm\n[noise] no no no\n\nThe ... movement for ... for strings by air no ... new recording featuring the London based Nash Ensemble\nWhen it came to playing instruments Francois demand was a pretty good when player but soon especially in loot really especially in fact he kind of wrote a message for the root of his day published in the late Seventeen hundreds with information on\nFlip techniques and performing practiced as well as to what sport beginners intermediate\nHis output includes quite a few ... concerto number ten is coming up in just a moment\n\nFor a\nI\n\nMhm mhm\n\n\n\nHere's the protein shared all numbered tend to die from swine to be in the way I wanted a ... I don't again and the Munich chamber orchestra\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\nYou can tell just by listening that the composer that piece really knew how to get around on the flute his name was from sweat did the end and he was a composer\nBorn in Seventy fifty Ninety dining parents at the very early Eighteen hundred left behind a lot of the journals that particular one number ten in the major was played by and rush out or John and the Munich chamber orchestra\n\n\nWhen Clinton BC thought about music he thought very much about ... what he called written aside time this is an example of that a section about Spain from his ... orchestra it's played here by members of the Los Angeles philharmonic orchestra and the conductor is able to take a shelling\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMuch of what Debbie seat you about staying with us from reading from paintings in Spanish songs and dances some of that coming to life Darren ... the section called ... played by the Los Angeles philharmonic under age ... selling in\nThe evening and ... ... what the doctor ordered a great ... Coltrane ... among\nSeemed like short ... Ron Malone and then for joining me marrying Michelle the W. J. yes he gone [noise] seven to ten we\nOnly ... music radio on [noise]\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA bimbo W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be online dot O. R. G.\n... or Texas or what you might call a tourist destination is one of the town of fewer than Fifteen thousand residents boasting a small college notable perhaps as the home of famed pianist Van Cliburn\nBut in the Nineteen thirties Google was a boom town the heart of the vast east Texas oil fields discoveries\nAnd oil is still very much a part of the president to kind of me\nThe city's culture\nSince the profits from oil the Louds were amongst other things the creation of some remarkable musical instruments\nThere why ... why you should too to hear pipe organs built by the famous Boston for him of aliens Skinner installed throughout the region by the Williams family a remarkable cruise organ technicians and most importantly designed by a colorful kill Gore character\nWithin an ... year for the ... of Oregon pipes his name Roy Harry and the instruments over which she ministers in Mississippi and Louisiana as far as Washington DC but particularly in east Texas around killed or\nThese have become legend show to celebrate them the east Texas pipe organ festivals established eight years ago the next festival coming up this November eleventh through fifteenth and to give you a taste of why kill ... is an important place to be\nToday our share excerpts from the twenty Seventeen festival recorded at Saint marks the rules Shreveport First Baptist church Longview and where it all began at first Presbyterian Church in killed or\nWith a chance to hear marches and dances ... much more [noise]\nReflects on what truly are east Texas treasures do stay with me I'm Michael Barone this is pipe dreams from American public\nContinuing supportive pipe dreams is provided in memory of West receipt doubly by his family\nWith additional support from Walter McCarthy clever unit into the gravestone foundation from Gen ... on behalf of her Family Foundation from the are more of the camera fall under the age are key foundation in celebration of the life of Martha hulings camera\nMr contributors to this public radio station provide support as well as does harkey Oregon builders of Duluth, Georgia and Parsons pipe organ builders are kind of dig when New York who are members of a poll by the associated pipe organ builders of America\nCollaborative of designers creators at ... pipe organ found in religious and educational institutions concert halls and residences throughout the United states and beyond\n...\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\nWe took a drama that are not sure whether I was thinking of the beautiful weak euro of missed or the spy really galaxy\nBearing that name may be a bit of both the music does seem to spiral and surely just beautiful and it's like ... composition by Paul highly\nLike by the composer all the alien Skinner Oregon at St Mark's Episcopal cathedral in Shreveport, Louisiana which is always a must hear stop during the east Texas pipe organ festivals each year\nThe twenty Eighteen east Texas festival get underway on Sunday November the eleven ... runs through Thursday the fifteenth simple feature at all star cast a yes or just\nThe usual collection of Roy Perry voiced instruments plus some surprises and also great sociability you can find details with a link from us either a pipe dreams dot O. R. G.\nDwyer music director ... had been in Boston was one of many illustrious guests Jeff the twenty Seventeen east Texas festival and equally impressive list performers will be featured this year including Jane Parker Smith from England and you'll have ... from prince\nCharles Kelly had wrote a book on alien Skinner organs and there's also a regular festival fixture in east Texas as player in frequent the composer events you feel the Thomas gator will team up two premier wanted Charles his most recent works it's a lovely pre lewd and dance\nCommissioned by the festival to honor the memory of Oregon builder nor Williams who was a long time collaborator in the execution of Troy theories ideas just music is itself quite dreaming up ... and dance music of Charles kept my head\n[noise]\n\n\n\n[noise]\n\n\n\nOh\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Jackson", "day": "10"}