{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\n[laughter]\n[noise]\n[noise] [noise]\n\n\n[noise]\nNa na na na\nNa na na na ...\n\nMm\n[noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise] [laughter]\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n[laughter] [laughter] [laughter]\n[noise] [laughter] [noise] [laughter] [noise]\n[laughter]\n\n[laughter] okay [laughter]\n\n[laughter] no no no no [noise] [laughter]\n\nBut there\n\nAre some books that are on\nThe phone number ... na na na\nNa na na na na na na na na [laughter]\n... ... if you think that's a nearly ... ... in the major cake size forty fine that was no sex music I'm putting ... thank you for\n\nBBC Radio when my local from eight thirty minute every weekday providing you with unique shows that keep you up to date on the news\nAnd provide you with useful information on the issues we face in everyday life become a sustaining member was ongoing monthly contribution to ten dollars or more or increase your monthly support so we can continue to broadcast these unique to the program to empty beach on blind poor now to make your contribution thanks\nStations bin ... music radio R. W. M. A. H. Biloxi it'll be ... ... ... you may you used to be in the in Jackson W. M. A. W. ... have you and may be struck W. M. A. V. Oxford\nIt may oh ... ... what's happening on MTV music radio and listen online at ... be be online duck or gee\n[noise]\nOne day composer Eric coats got an unexpected letter from represent Arthur homes that got him thinking about creating a peace based on several generations of the British royal family\nWhose idea was to focus on winning owning Elizabeth\nAnd he started by going all the way back to Queen Elizabeth the for [noise]\nMatch the time during which he lived he opens with a fanfare\nAnd then he goes on to reflect her appetite for swashbuckling adventure [noise]\nBecause that's actually how few days and it's on the way in Fifteen minutes I'm Melissa how sleep I Hope you'll stay with [noise]\nAlso in five minutes a London trio by heightened here's music built by car all started with the New Zealand to the orchestra [noise]\n[noise]\n\nDo you do\nYour\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\nI trust those three enjoyed that recording session that was jump yeah Ron Paul ... violin and rounding out the trio misty flop Restrepo which cello in London trio number one\nSeed by heightened [noise] here's\nA piece that Eric coats wrote\nAs part of this week called the three Elizabeth he wanted to create something that would sort of evoked the spirit of British history and its people will Elizabeth the first the queen mother and then princess Elizabeth who later became and still is queen of England\nThis week was first heard on the BBC broadcast it was Christmas Eve Nineteen forty four end this section was later used genetic British TV series called the foresight saga let's listen to a healthy on days it's just the one that goes with queen Elizabeth's at first\nAnd the music is play here by the east of England or history under Malcolm to borrow\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nIn the in the ...\n\nTo\n...\n\nTo ... ... ...\n...\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n... ... ...\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nAnd\nThere's\nBeen [laughter]\n\n\n[noise] [noise]\n\nThey they can they\nCan\nTake the\nThings [noise]\nThen [noise]\nAh down here\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[laughter]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n[noise]\nYou know\n...\n\n...\nMentioned [noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\nYou imagine hearing that for the first time it would be hard not to go a little while for that kind of music ... really odd for piano with orchestra by a young Felix Mendelssohn Stephen ... played it but the city of Birmingham symphony orchestra led by Lawrence Foster\n[noise]\nDid you hear that interesting news story on NPR isn't that auto correct a great way to get advice about your car\nI heard Karen brown saying it's gonna rain today if you listen to Mississippi Public broadcasting you probably can say yes to that state police show your support in pie by making a contribution to go to impede be online dot org or call one eight eight eight\n... a three we need you to do your part to support him ...\nStations have been Bebe music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online duck or G.\n\nViolinist ... is a great fan of composer noodle go into the she thinks he's a divine storyteller and then once you hear is music you're hooked here she's talking about a piece he calls like from life\nWhat I Know because I went through with mystery you know the little on each piece he told me that in that particular piece you was inspired by the folklore Rick violin\nInspiration so when you listen to the ... you can't see that the violence is really in the middle of the piece I Would say it's just like a fiddle player [noise]\nThat is you have to go with her ensemble lumpy ada they'll play life by being a little later this hour I'm Melissa ... [noise]\nYour music for strings by the ... ... from a string quintet in the minor [noise]\n\n[noise] [noise]\n[noise]\n\nConcerto Grosso number for over six by handled that was Tony ... and Amsterdam for real orchestra today's classical music it's supported by the S P certified\nAngel planner professionals trained in providing holistic financial planning in the client's best interest for short and long term goals from starting a business to saving for college to retirement let's make a plan dont\nOh Archie\nViolinist ... uses words like captivating and luminous when she describes music by neutral be go into the she also thinks it's full of hope here's a piece he calls life played by development her group lucky ... to\n...\n... ...\n... ... ... ... ... [noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n\nLife is the name of that piece by new there'll be go into the play by ... ... with my limits on Jeopardy though\n\n\n\n[noise]\n\n\nOkay this is a little hard to believe but apparently Beethoven wrote this sex tests for when in one night he describes it as an early work and he says a synthetic pose that I've written much better but\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\nMm\nMm Mm [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\nAnd um you know\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\nThat's that's what I don't know [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise] do they come\nFrom it [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nBut there's been a number for the men and women [noise] [noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\nCan pose in a night by Beethoven Beethoven according to the ... that was a sex test for when declaring it's two horns and to the students played by six members of the late ... orchestra radio when\n[noise] it just a moment George Gershwin and his brother in California November Nineteen thirty there to write to score for a Fox Studios musical called delicious and starring Jeanette gainer this get called for an extended or Castro sequence that was supposed to pick New York street life and Gershwin decided to", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Jackson", "day": "22"}