{"month": "10", "state": "MS", "station": "WMPN", "content": "...\n...\n[noise]\n\n[laughter]\nMen or\nMother was [noise]\n[noise] [noise]\n[noise] no no no no no no no no no I don't\nThink either that\n\n[laughter]\n\nSo I'm going to\n\n\nTo [laughter]\nI don't know\nMoment I'm not gonna\nHappen [laughter]\n[noise] [laughter]\nNo no no no no no none of them\n\n[noise]\n\n[noise] [noise]\n\nNo no no no\n\nTo keep our concerto when asked number six by Johann Sebastian Bach played by marine pariah also was leading the Academy of St Martin in the field\nThere is a fabulous story about mark McKenzie who is orchestrated music for more than one hundred films and worked with some very famous film composers\nAnd he has some original scores as well his latest is max and made the true story the priest who struggled to keep compassion a line in Nazi occupied Europe and he's feature with Julie I'm ... new classical tracks and you can catch up with that at the end of the give away for his new release at your\nClassical dont work I'm an ... really glad you could join me on this first Wednesday in October\nI'm Larry Gross gets mountain stage live performance radio for NPR\nThat'd be Ninety seven on MTV music radio [noise]\nStations have been Bebe music radio R. W. M. A. H. Biloxi there'll be him a boondoggle Wu may you view\nW. M. B. in Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. ... chicken what's happening on MTV music radio and listen online at MVP on line or G.\n\nYou know as you're learning about classical music you have to be a little bit careful because every now and then I Know I have I don't know about you\nYou start to believe things that are not really quite factual about certain pieces of music\nLike the slow movements Rodriguez kids can get put out an acquaintance everybody says oh he was writing about the Spanish civil war Mrs Rodriguez said no no no he was celebrating our marriage to entirely different things\nAnd but this one for a long time I believed that Aaron ... went into a Music Hall in Mexico city when he was on vacation he did and he remembered what he heard and went home and wrote it down he didn't\nHe remembered what he heard but he bought the sheet music and took it back to the states with him ... coming up\n\nThis is a portion of fourth movement from the string quartet by Eduardo told\n\n[noise]\n\n[noise]\n\nMm\n\n[noise]\n\n\n\n... so many go Erin coping remembrance Simpson time that's probably drinking tequila who knows in a musical in Mexico city called el salon make up the New York philharmonic played that they were led by Copeland protege and friend and ally Leonard Bernstein\nComing up a violin concerto by military\n[noise]\n\nIt's often forgotten the Mozart was a really fine violinist no surprise there his dad Leopold was one of the outstanding teachers and violent us and Europe at the time so\nHe got lessons when he was very very young and he kind of shows I don't know if he gravitated toward the keyboard at his father's encourage met with his father's encouragement or because he didn't want to be like dad wants to play something different I think the latter it's probably more likely although I don't know that for a fact\nAnyhow you wrote home one time to lay polled when when both gone without on the road I played violin last night like the best violinist in Europe and late ... fired back a letter as fast as you could fire a reply back in those days and said you are not to be the judge while you play some\nKind of putting it back in his place could one worrying maybe perhaps that he was getting a little distracted his boats are both gone on the dance a violin concerto number three and gee whiz pick a Quincy's do and the ... cents on yet\n[noise]\n\n\n\n\n[noise]\n\nMm\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\nAnd that means the\n\n\n[noise] the violin concerto number three by Mozart would pick a Quincy's do and the ... sign yeah\n\nI Know\n\n[laughter]\n\n\n\nThese are six eight to ... foreign by Robert Schumann with piano smart arguments and Daniel paranoid\n[laughter]\n\n[noise] [laughter]\n\n\n\n[noise]\n[noise]\n\n\n[noise] [laughter] [noise]\n\n[laughter]\n\n[noise]\n[laughter] [laughter]\nYeah [laughter]\n[laughter]\n[laughter]\n[laughter] [laughter]\n\n\n\n\n[laughter]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\nWhen at the piano do ... six eight to ... in ...\nForm with Marta Irish and Daniel ... boy playing piano ... I'm a little more fun\nLooking for a youthful perspective on classical music oh I'm going to play the list transcendental numbers and then it's very exciting and energetic and that is hard parts of South Park and overall it's a pretty good [noise]\nNo further from the top joined me for for a rally for our tenth anniversary the sweet right here on NPR Saturday morning at nine on MTV music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. B. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online duck or gee\n[noise]\n\nThis is the music from one of those composers who started out to be something else in life [noise]\nSwedish compose occurred out her back was born in ... his father was an engineer and brother of a very famous chemist by the name of Albert other back and we've got that stuff and I didn't understand it\nBut he's famous [noise]\nHis mother was the daughter of a famous opera singer [noise]\nAnd money was very young he started playing cello probably got the idea for this line from his symphony number eight [noise]\nHe started off life studying to be an electrical engineer but music just wouldn't let him go his eighth symphony an e mine are coming out [noise]\n\nThere's this new classical tracks from American public media I'm Julie I'm On her [noise]\nIf you don't know the name mark mackenzie you're certainly recognize some of the blockbuster films he's orchestrated including dances with wolves men in black nightmare before Christmas and sleepless in Seattle [noise]\nMark grow up in Lake City Minnesota He stayed in Los Angeles after earning his doctorate in music composition at the University of Southern California that's where he studied with composure is like ... did told that Islam ski and Martin Lawrence and\nI thought I was planning to go to teach but of course I always had a love for writing music you know I was living in Los Angeles so I ended up I'm getting an opportunity to orchestrate movie for a considerable named Bruce brought in and it was a Steven Spielberg film called young Sherlock Holmes\nAnd from that of beginning I ah ended up working straining over a hundred films ... many of them huge blockbusters for composers like Danny Hoffman and ... and John Williams and so on [noise]\nAnd uh maybe ten years ago I just stopped orchestrating because he actually was works for jury Goldsmith kind of one of the giants and the film music world\nAnd a jury passed away from cancer at that point I really felt like it was it was Mike you'd have to go and do what my real ambitions wearing that his to compose music [noise]\nPlus the latest is for an animated film called max and me the film which tells the story of the polish priest Maximilian Coby has yet to be released the film score however is available and it brings his compassionate story to my [noise]\n\nThe mood to port St Cecilia is day the overture a much larger work by Henry personal celebrating the patron saint of music\nAnd that was the Gabrielle ... led by Paul ... next to lovely new release from mark McKenzie who did a lot of orchestrating for famous Hollywood composers including Jerry Goldsmith an either is and he also has written about oh two dozen or so original film scores his latest coming out\n[noise]\n\nI'm In ... he could be here just in time for Julie all migrants feature on new classical tracks which is composer I should say who is composer mark McKenzie and Mark McKinnon seeds in Minnesota native an has done hundreds\nA scoring for other composers a lot of film composers started this way they'll have a ... you might recognize like Francois X. men or John Williams or whoever\nAnd they can't do all the orchestrating and the arranging themselves once they write a score so there is a battery in\n... other people at the studios who help out mark McKenzie one does but he does have some original score is this is a new one is called max and me is the true story of a priest\nWho was struggling to help his parishioners and others in Nazi occupied Europe and here is part of the score a mark McKenzie from max in me this is a mother's prayer Joshua Bell the violinist Dave arts\nAnd the studios orchestra led by Gordon Johnson\n[laughter] [laughter]\n[laughter]\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n\n\nMusic by mark McKenzie from his recent film score to max and me that was a mother's prayer Joshua Bell in the studio orchestra led by Gordon Johnson\n[noise] this is music from Sweden the symphony by Kurt author berry who started off life in science because his father was a was a science scientist and so it was his uncle\nAnd so he kind of followed in their footsteps at first tentatively we've studied electrical engineering and then music took over his like this is his symphony number eight and a minor with the ... and brick symphony orchestra led by name began the\n\nMhm\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nWell we seemed to have a problem with some of the hardware in the studio soak in the meantime substitution till the back to the correct Atterbury this is a substitution for that performance by a manual pump Eric let's say from the ... states actually\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise] and then in a\nNa\n\nNot enough\n\nNumber\nAnd then\n", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Jackson", "day": "03"}