{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] the music was a big hit back the plane not so much lazy and sweet number one uh incidental music to yours say retrieved and kept the Cincinnati since the place\nLooking for a youthful perspective on classical music oh I'm going to play the mainstream something door to number standing it's very exciting an ... and that's hard to South Park overall it's a pretty good [noise]\nNo further from the top joined me Christopher running for anniversaries each week right here on NPR Saturday morning at nine on MTV music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi debate you may ... ... you may you view W. M. P. in Jackson W. M. A. W. ... W it may be struck W. M. A. V. Oxford doubled\nIt may ... ... check out what's happening on MTV music radio and listen online at him Bebe on line or gee\n[noise]\n\nSounds Joyce calling it is the apes simply by daytime [laughter] you got a little grumpy about\nNot about the company itself but about its reception\nHe wrote the seventh and eighth companies almost simultaneous [noise]\nAnd for nearly a symphony had to wait [noise]\nThe concerts including the seven symphony which already had it had its premier and was wildly popular and of course a very large Wellington victory sell the eight symphony much somewhat overlooked [noise]\nAnd he you know why he said the AIDS has better but they just didn't notice [noise]\nThe eight symphony coming out [noise]\n[noise] this is a pretty famous ... by ... ... and it's played by pianist Steven\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\nNa na\n[noise]\n\n[noise]\n[noise]\n[noise] no no no\n[noise]\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[laughter]\n[noise]\n\n[laughter] [noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nLuckily thank sink to the sound like he had animosity toward the instrument the flu or test number four by Mozart with Emanuel pope crystal pop and ... and John Gray yet Kayla making up the rest of the ensemble\n\n\n[noise] just a short yeah dance sweet brown a larger work by Jack Ma Meyer bear the northern start with the north stars how'd you know with the Barcelona symphony led by Michael ...\n\n[noise] [noise]\n[noise]\n\nMhm [noise]\nThis is ... eight symphony with the Berlin Philharmonic led by Columbia about it\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nBeethoven really kind of bad sabotage himself a little bit because the Simpson never ate had its premiere after the seven had\nSkyrocketing popularity and so when he premiered the eighth the seven was performed at the same evening and people like the seventh better because it was already popular so uh we're not the eight symphonies fault and Beethoven always loved it especially the Berlin Philharmonic led by cloudy all about how I'm Lynn ... thanks for joining me\nEven ancient music from centuries ago from town fresh and alone\nEven contemporary every week on Sunday corrupt you can\nHear a variety of modern performers treats the music it's a living art form and put their unique imaginative stamp on music from the Eighteenth century and earlier I'm Sudan's on that and I hope you can join for Sunday borough\nSunday Morning at six to impede be music radio\nStations have been ... music radio R. W. M. A. H. Biloxi WMA boom bubble W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be struck full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot org gee\n[noise]\nMm Mm\nThe men who wrote this music as well known for writing for the guitar now it's not Joaquin Rodrigo or\nThe other guy Matteo customer well though to desk go\n[laughter]\nHe was a big star in Italy before he came to America at the outbreak of World War two\n\nAnd not only the writing great concerto as for the guitar he wrote a lot of film and music and had a huge influence on a whole generation of American film composers like Henry meant teeny Jerry\nGoldsmith and Andre ... yes and one John William\n... guitar can shatter number one coming out\n\nThis is a serenade it's by Roman ...\n[noise]\n\n\n\n\n\nMm\n\n\nTrumpeter Ron Smith vegan the Scottish chamber orchestra led by yucky all laying the Trump ... number one in the body tell them\nThis is a very unusual work it's a longer work it's not the kind of typical ragtime music you expect with Scott Joplin but it's really lovely it's called the scene here it is but it's a prominent Andre ...\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\nScott Joplin the music played by a couple of super stomach to be talked Perlman an entree present to the now\nToday's classical music is supported by fracture creating modern photo decor and gets by printing photos directly on glass a fractured image frame and mount all in one hand made in a carbon neutral Florida factory you can learn more at fracture me dot com slash classical\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\nMm\n\n\n\n\n\nOh\n\nKnow some you know\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Jackson", "day": "18"}