{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n\n\n\nOh\n\n\n\nThe one movement symphony number seven by ... ... with the Minnesota Orchestra the times of London hailed the Minnesota Orchestra not ... complete survey of civilian stay wrote\nWith these recordings ... confirms his status as our greatest living civilian irreplaceable\nI'm Alison young you've been listening to the Minnesota Orchestra in the spotlight on symphony cash to end the concert portion of simply cast they were on a historic tours in South Africa we caught up with them in ... South Africa music\nFrom the United states from Finland and also from South Africa some music written specifically for the occasion\nYou can listen again from our website just go to the company cast page and your classical\nThanks to producer Bradley all talk technical director Zack wrote an audio producer Michael Osborne and thanks also to ...\nThe south African broadcasting company\nAPN city cast is produced by ... [noise]\nI'm Alison young we'll see you again next time I'm simply can't\nThis is a pie and American public media sharing the power of classical music\nFor Twenty years the world cafe has been looking forward to what's next in music and keeping an eye on the richness of the past I'm David dye would live interviews and music you need to know about I mean you may have\nNever heard before but I sure did lob the world cafe has become Public Radio's most listen do popular music programs don't miss our next show and I tend to be be music radio\n\nStations have been ... be music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MP be music radio and listen online at MVP on line duck or gee\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise] [noise] [noise]\n[laughter] no team Rodrigo didn't play the guitar he knew how to write for it [noise]\nAnd what's most impressive is the way he captured the spirit of the instrument and a handful of pizza script guitar with ... [noise]\nMy [noise]\nKids number one concern there was that the orchestra would drown out the soloist and it was probably that constant worry that help them achieve such a wonderful balance between the two often like a conversation\nGoing on [noise] I'm\nMelissa ... joined me for like three goes music in about twenty five minutes\nOr [noise]\nIf something I think you'll recognize Raichlen Williams his fantasia on green sleeps\n\n\n\n\n\n\nOh\n\nMm [noise]\n\n\n[noise]\n\nI Love those units in trail sort of at the end of that symphony number one in the major by Carl ... that was ... leading the English concert\nOh absolutely adore per coffee and particularly the score to Romeo and Juliet is a piece that I first played as a violinist in my twenties so of course having that connection to having played it when I was a young musician uh makes it even more special that's conductor Marin\n... who also love the pallet typical the abuses the color is he is able to extract in the way his score conveys the story here she is with the Baltimore Symphony orchestra in an excerpt from pro copious ballet this is a section called the arrival of the gift [noise]\n[noise]\n\n\n\n\n\n\n\nMm [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n... and the Baltimore Symphony orchestra in the arrival of the gift that's from ballet music by Kofi if that goes along with a story the famous story of Romeo and Juliet\n\nDuring the second half of the twentieth century Joaquin Rodrigo was ... best known classical composer and he was writing music that was quite removed from what was happening in Europe he liked to especially to mix old and new you just a moment to piece you wrote in the fifties for ...\n[noise]\n\n\n[noise]\nThat's\nThat's [noise]\nThat's [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[laughter]\n[laughter]\n\nMm\n\n[laughter]\n[noise] [noise]\n[noise]\n\n\n[laughter]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[laughter]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[laughter] [noise]\n\nDo do do do do you do\n[laughter]\n\n[noise]\n\n\n\n\n\nThey ... concerto by Johan Christian by\nAn evening and ... can be just what the doctor ordered take great Ella culturing guy now my mum\nMixing the contemporary giants like short written more chronic Malone and been joined me mariners Michelle the W J yes he evening seven to ten we\nOn MTV music radio\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line duck or jeep\nAt the globe is your home for the great American song what each week I'll showcase the best in local jazz in popular song Nineteen\nThirties do today from Frank Billy and Ella looks like curtailing Dianne Reeves and Gregory Porter my mortgage alum and spend some time when after low Sundays that same on MTV music radio\n\n\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\nAttention all educators NPT has partnered with the secretary of state's office this year's promotes the boat initiatives and help your students learn important\nLessons about civic engagement wow having fun in the classroom this opportunity is for K through twelve students across Mississippi get than engaged with the ... election plus are an essay contest for more information about promote the boat or just sign up your class or school visit NPD on line ...\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line duck or gee\n[noise] on Mississippi Public broadcasting this sounds Jewish I'm anti motion back within our music from various points to Jewish space time continuum including popular songs you may know aunt rare recordings that\nIce dusted off just for you the Jewish people's in tents autumn holiday season culminate this week with a day of wild celebration\nOn some ... the day for rejoicing with the Torah juice complete the annual cycle of public readings tourist scroll\nAnd begin anew by chanting from the first chapter of ... genesis then they sing and dance with the tourist squirrels and some may even drink a toast\nOthers may drink more whether you understand that tour as God's literal word as human writings inspired by God\nOr as a document that various Jews compiled over the centuries the Torah remains central to Judaism today on sounds Jewish we welcome some star ah with music from around the globe praising the tour and the holiday\n\n\nBut\nCan\nNot\nOh we're\nSupposed to tell you read by the Clintons medics off of the Nineteen Ninety five album juice with horns the music was by band member Frank London with lyrics buying nineteenth century Russian you dish poet composer and lawyer mark worships ski\nNext more toward joy from the value of dying the Jews Abou ...\nHuman life\n[laughter] ...\nYeah I Know and he\nWill have a bad day you\nKnow I really\nSee all the\nI see\nPeople\nI Know\nI got to be a\n\nGuy\nIn even\nThough you may you\nMay know\nYeah\nYeah yeah I\n... from the two thousand three CD I buy you die a music from the Jewish people up who got into\nI don't know how many of you know how the tourist grow is produced a trained her so fair or scribe writes each word with a quilt pen I'm part you meant following it he turned to lay out the goal is to precisely reproduced the tourists grow each time\nReading a new ... takes months of concentrated\nEffort here's a short song from India for the dedication of a new tourist grow\nTheir Lynette or black man was a yeah\n...\nDay and to me though who more than a man\nOh ... or any either\n... that the damn guy will now be but ah yeah no I mean he ...\nGot back then that was one man and he knew a lot of the men that yeah the man I mean he has a\nAnd the\nSong for the dedication of a tourist scroll off of the two thousand four CD oh lovely parrot Jewish women songs from ... India\nSet of global Musa ... story continues on child Jewish with the literature go song from the roof ... Jews Zimbabwe for removing the tour from its place of honor in the sanctuary the holy arc to be read\nThis was an Eighteenth century devotion in the show the language that goes he's great name is the holy one no one is why can't even under there is no one Mike unto God or in heaven\n... nobody\nWas what [noise]\n[noise]\n[noise] [noise]\nYeah [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\nYeah [noise]\nYeah [noise]\nOf course who are quite arc my course of ... Jews from Zimbabwe on the two thousand three CDs hitting gate Jewish music around the world\nAnd speaking of arc here's all mature juggle song that reminds us whenever the arc which carry forward Moses would say a rise lowered may your enemies be scattered may you're supposed to be put to flight\n... show come from Zion praised as God who wouldn't God's holiness gave the Toro to God's people Israel [noise]\n[noise]\nYou know I have a A R o\nO lo o lo o\n\nLo O O\nO O\nO\nYou'll know no ... on\nA\nLow\nYeah you're in a\nIn a row\n... whoa\nWhoa whoa eh\nHa ha ha ha ha yea\n[noise] [noise]\nWell uh [noise]\nOh oh oh\nOh oh\nOh\nOh oh\nOh whoa no no no\nThem of being among young love each\nOther about the ... of all I\nThought oh no no\nNo no no no no no they don't like maybe you know I I was young when the little known as one of them I di di di di di di di di di\nFrom getting anything bumped either going to be looking to get a good\n... O O O G O G G\nO O [noise]\nAnd believe me I'm not really been the baby boom boom\nBoom boom boom boom young enough to be in any little the little light up di di di di di di\nDi really mean don't you think it'd be it'd be\nA lot o getting rid of any of them don't even have any bucks\n[noise] [noise]\nAbout dum dum dum dum bum bump up and I don't believe in having them all the I'm not really maybe some of them really maybe I'm going to be\nThe only maybe ...\n... who led us rejoice by capture our Michael send up north Hollywood, California and he's Nineteen Seventy six lp a world of Jewish music\nThe character and teacher a company is modern sound with a band contemporary look worse hair long and on this album jacket photo sport it loud print shirt\nActually that's pretty much how I look to that next along with the rich and Tora Judaism also consult the oral Torah notice the mission now\nMultiple discussions on the mission now are recorded in a set of legal books known as the ...\nThe attorney to grab my eyes were not writers of books but teachers by word of mouth creating an expanding Leo wrote or\nWe do not so much read quite these great sergeant said as over here I mean they're session this is the way the Babylonian comment again from her time in the evening may ... hobby recited\nFrom the time the priest who may begin to eat up there he's offering until the end of the first round\nThis is the tax the time and wants to discuss and explain\nAnd here's the way the discussion and explanation go on what basis does this say set for what the state moved from what time I'm quite as the first state it in terms of the evening he should first stated in terms of mourning\nFor the same age as the basis of scripture comes the reply\nWhere it has written about shot rehearsed them that is recite them when our lives down and Gwen got riser stop this therefore the meaning of the state and\nWhen is it the recitation number ... ... lying down time may take place from the time the priest may begin to eat out their he's offering\nIf you wish say this\nThis age is taking his cues from the stadium in the town to the creation of the world where it is written and first there was anything and then there was mourning one day\nNotice no cast of characters described or even named know worried about the time and place of the give and take\nA state and just quoted and immediately one plunges into the questions and answers which were exchanged from the academy as scholars try to understand and explain attacks\nThe heart of the matter interpretation of tax is what counts it alone hardly anything else what do we mean by only interpretation of the tax cut out there\nThat the town where there's not a code or cat accusing laying down in summary form ... men's obligations are it is on the contrary the record about process the actual process my means er which for law is made clear\nFor the focus of the Talmud is on the law in a sense law it's studying practice was\nThe time you did mystique this indeed is what the rabbis at the time I'd hoped that they could supply the exercises which would become second nature in the world to come\nAuthor and scholar Judah golden reading from his Nineteen fifty seven book the living ... on an lp of the same name from I presume about the same time next to sounds Jewish ... cars Tara three songs about biblical characters first here's the king of rock and roll\nThat's the singer not the character\nWell off and it won't solve\nDon't know I\nI got a well\nI don't know when the\nHard headed woman a club dimitrius song that was the number one hit for Elvis Presley in Nineteen fifty eight it's from the two thousand two CD elders dirty number one hits\nElvis Aaron Presley had a Jewish grandmother on his mother's side which makes him a member of the tribe recording to Jewish law\nBut he was a practicing Christian who recorded a lot of gospel in addition to rock and roll and pure pop\nNext to a song with much more sympathy for a biblical woman\nIt's based on a ... story about the matriarch Sarah's experience during the sacrifice of Isaac her son was Abraham shaped in shows share the preparations for the sacrifice but stops before Isaac's rescue\n[noise] [noise]\n\nMaybe [noise]\nDo I\n\nIn the ...\nThen yeah la\n[noise] oh\n\nUm\n\nThink in my", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Jackson", "day": "08"}