{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n... Olson has become somewhat of a specialist in playing Chopin to music and that was the fantasy impromptu and see sharp and that was a can't guarantee Olson playing ...\n\nIf you'd like to expand your classical music library you can do that by going to your classical dot org which is kind of cold wet tight anyway and it's a thing called the daily downloads and each and every day there was a free MP three classical music could be ... could be at very Greek\nOr and you can get a free piece each and every day it changes today it's one of the ...\nBy Alexander ... and you can sign up for it\nDownload MP three each and every day absolutely free you can also sign up for the daily download newsletter\nAnd you'll never miss those MP threes plus you will be entered in a drawing for I gave away for brand new clinical CD so again another great way to build your classical music library if you're just starting out or if you've been listening to classical music all your life it's really kind of a neat thing is it your classical out of work and it's called the daily down\nReally glad you could join me on this Friday I'm a little more fun\nYou know around the world\nAround us and around Mississippi is what we usually on MTV thing for you and me to\nDo a whole lot more such as when I ran to the news every gang\nEntertaining programs on the weekends we make an investment in Mississippi so I Hope you'll make sense to me in what you just go to our website now MTV online dot org or call one eight three seven to ten and thanks so much\nStations have been ... music radio R. W. M. A. H. Biloxi there'll be somebody ... W. M. A. U. U. W. M. P. in Jackson W. M. A. W. ... W and may be struck W. M. A. V. Oxford\nIm a low ... chicken what's happening on MTV music radio we listen online at ... be online or gee\n\nIf you're a fan of heightened symphonies you probably know that he was not responsible for the nicknames that they gone [noise]\nEspecially when it came to London symphonies we had a huge and very avid fan base [noise]\nIt was almost as if the London fans were coming to the universe where we want to hear the concerts and to see their uh their idol but the ultimate people can be called the symphony\nRole on the company\nAnd then it gets really quiet for about two minutes [noise]\nDespite the fact that you don't usually hear that drum roll again very much and the rest of the symphony the name for the number one oh three London symphony the drum roll has stuck [noise]\nIt's coming up in twenty minutes [noise]\n[noise]\nWell speaking of Tiffany here's a concerto over seven trumpets in ... by Johan Elton bird performed by the New York Trump it ensemble led by conductor and trumpeter Gerard short\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nThe symphony number one boy says up to the ... and he had a lead by Ronald Thomas\nToday's classical music is supported by gobble Neal prep service delivery fresh square made dinner kits that are cable ready in Fifteen minutes with just one Pam gobbled as the prep work so you spend less time shopping and more time with family lay more at ... dot com slash classical\nDoesn't harvest Andrew Lawrence king this work is called the data it's by chance that I make it easy\n[noise]\n\n\n\n\nAndrew Lawrence king the ... better by she has a negative\n[noise]\n\n\n\n\n\n[noise] the head of a square rooms were still in London at the turn of the twentieth century although they were demolished late in the year in Nineteen hundred\nWhat a history they had largely constructed in the mid Eighteen century as assembly rooms and they certainly I made their mark ... has a home for musical performances from Johan Christie and box time a right on through of course uh heightens who performed a lot of his London symphonies there\nThe room I guess on the first war they said what about Seventy nine feet by thirty two feet about thirty feet high um and it had heated beautiful feelings on it and that's where a lot of heightened London symphonies had the premier like this one\nFrom his second trip the symphony number one of three called the drum roll for reasons that will soon become obvious here it's ... ...\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] and\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\nThe ... by Beethoven hugely influenced as he often ... by his own admission by get his writings this email boulevard symphony orchestra ... did a man and one more call\nWhere the research projects for your your your house your car something tasty to get you know managing\nYour money back to the beach make radio has\nThe information easily get done right your financial\nFor be just the NPD helps keeps one with the radio program me on the air throughout she was simply should also support to buy gas and the Internet screen that you can take it with you wherever you go to visit Jim ... beyond my dodge or can be done was just thinking in which the gifts to dollars per month\nThe stations have been ... music radio R. W. M. A. H. Biloxi there'll be a may ... W you may you Butte\nW. M. P. in Jackson W. M. A. W. ... W and may be starts W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him be be online or gee\nI don't know if you're a fan of mysteries or maybe Sherlock Holmes I Am but it's a mystery that\nAll these years later and nobody has really been able to\nSolve and it's this one his client is it like\nThe enigma and Eldar is enigma variations the opening scene which all the variations are based [noise]\nEldar himself said this he said the enigma I Will not explain gets dark saying it must be less I guess\n\nWas it a whole set another and larger theme goes back to it is not playing [noise]\nOh my gosh what can it be\nNobody knows to this day the enigma variations coming out this is music by Amy Beach\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n... ... ...\n\nPeople\n[noise] [noise]\n... ... ...\nA\nA song\nOr just\nThe\n\n[noise]\n\n\n\n\nYou\nPlaying lewd in a fashion\nThat would impress him rhythm guitarist in rock bands today I think that was a large lead player Lucas Harrison Alison Melville\nOn recorder joined by as soon as the dean of Mackey Johnson hearts of course bars ... and be a bass player Joelle march on and the violin sonata by our country look really based on the old very old tune law fully yeah\n[noise] well next a whole bunch of variations that depict Edward el guard as friends in a cryptic fashion although he explained them fairly clearly the mystery there is not to stick however the real mystery is what was the melody and the first place\n[noise]\n\n[noise] there have been so many guesses over the decades better part of a century and then some from Eighteen Ninety nine until now\nOh what was the main theme the enigma the real big by itself in Eduardo guards and they move variations and he really\nIs his own words gave a very cryptic in kind of creepy ... description of what he said\nAll these variations that the melody is played over the whole set another and larger theme that fits it goes but is never played so you never hear it but in the world is el gar have in mind people have guessed everything from happy birthday to oh gosh I don't know other things as a Santa melody in there and\nSleuth uh over the decades have tried to figure out what it is it's been understood mostly to be a famous tune that is played along with the enigma variations would fit in\nAbsolutely perfectly but nobody's come up with the ... the rest of the well Nick ... who was the name rod variation for for instance wellness um rod a famous hunter that was for a friend of el guards by the name of the bigger whose name is German for hunter so he can kinda figured those out fairly easily\nBesides el guard told you here are the enigma variations but listen carefully to the opening scene\nMaybe you'll come up with it I don't think there's any great prize that it might just be fun if you could figure it out there were also her Monica ... Andre pregnant\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Jackson", "day": "26"}