{"month": "10", "state": "PA", "station": "WESA", "content": "Front row orchestra you never know what might change a life for Hamilton for Alexander Hamilton it with a scholarship to college but maybe listening to a story on the radio can direct someone else's life in a new direction\nSupport the idea of opportunity and information call for one to six nine seven to nine five five or go to W. E. S. A. F.\nN. Catherine thank you Catherine is in Pittsburgh made a contribution soda in Linda we also heard from Laurie in the drone hides out new Wilmington Amy we appreciate your generosity Lauren in Spring Hill checking in with a contribution we also heard\nFrom folks are Lauren arrogant O'Hara township we're hearing from all over south western Pennsylvania the Pittsburgh region many of the neighborhoods checking in why don't you check in with a contribution of your own for one to six nine seven to nine five five\nWhen you turn on that radio what you're hearing is everyone in our community stepping up to pay for the radio it is expensive to keep NPR programs and do the local coverage that you count on\nAnd it gets less heavy that burden if more people step up so if you've been waiting to make your contribution it's fungi please how the good time to call for one to six nine seven to nine five five W E S H ... FM your the biggest part of our revenue fleet helps keep it on the radio\nAnd this is the last call to get in and are free press pack which is Fifteen dollars a month for those for great thank you gifts at seven o'clock the pledge level goes up to three hundred and sixty dollars you're listening to Ninety point five W yesterday and W. E. S. A. H. D. one in Pittsburgh Pittsburgh NPR News station\nFunded by listeners we're done with fundraising and all things\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nThe drive ins at ten o'clock tomorrow morning still time to get into the Hamilton drawing when you give it W. E. S. A. dot FM and thanks for your support\nUnderstood Macintosh with the b._b._c. news hello European Union leaders in\nBrussels have decided that despite intensive talks with Britain does not been enough progress on ... to learn calling a special summit next month to seal the deal but they said they were ready to cold one in the next few weeks if talks going well Kevin ... reports\nThe two sides are United in a determination to avoid a situation in which the u._k. leaves the EU without to agreement prospect of threatens political economic and legal chaos there is a tool that Ninety percent of the withdrawal agreement has been completed the problem of the Irish folder if the main issue that remains\nIncreasing talk around the ... process a transitional\nPeriod off to the u._k. leaves\nCould be extended by here to the end of twenty Twenty one\nAnd he you saw said tonight that Mrs may told other leaders she was willing to consider the idea\nPresident Trump has denied covering up for Saudi Arabia over the suspected murder of the Saudi journalist ... G\nBut he said the U.S with don't walk away from it satellite meanwhile Turkish police and forensic experts have left the residents of the Saudi Arabian ... after finishing their search for evidence of Mr ... suspect people killing on Mondays I carry it out of the nine hours to show that comes to that itself\nTwitter has publicly release to old ten million tweets it believes a link to Russian and Iranian state back to count that we're trying to influence political opinion abroad he has Rory ...\nEarlier this year Twitter shutdown thousands of accounts said to be linked to Russia's Internet research agency the body accused of trying to sow discord and intervening on behalf of Donald Trump during the U.S twenty sixteen election campaign\nNow it's released details of nine million Russian tweets along with a million ... Iranian propaganda campaign many of the Russian Twitter accounts posed as angry Americans are planning on all sorts of divisive issues from both sides\nThe leader of Crimea say gay acts young officers declared three days of mourning after gum and bomb attack at the college in the city of catch lifted leads to Nineteen people dead Russian investigators say the assault was carried out by an Eighteen year old student at the school but should this to reports\nInitially the investigators said this was a terrorist act tensions still similar on this peninsula of the Russian takeover four years ago but the authorities and now describing this simply as mass murder carried out by one of the students many of the victims with teenagers what prompted the attack isn't yet clear\nOfficials have now confirmed the BLM detonated in the college canteen they said they've also found and diffused a seconds device as bad as this walls it seems it could've been even worse\nThat report was by Richard list a understood Macintosh in London with religious world news from the BBC\nThe world Health Organization says it well the U.N Security council to approve additional results sees the international peacekeeping mission in the Democratic Republic of Congo where health workers at tackling an outbreak of the Ebola virus\nIn security due to armed groups and mistrust from the local community of ... to stop the spread of the virus\nOne hundred and Seventy nine people have died in the current outbreak which began in August the president of plus a mother\nScreaming on WGN supported by Carnegie Mellon university integrated innovation detail on a master's program\nAt the end news dot edu slashed I I I\nMade over migration on Tuesday President Trump said he would cut off millions of dollars in aid to Guatemala and Honduras if local authorities didn't act to stop a caravan of more than two thousand migrants traveling towards the U.S border\nAbout Gary and men suspected of raping a merging of Bulgarian television present has been extradited from Germany to his homeland prosecutors say Sanford and crashing Nerove attacked suddenly eroded Victoria manner nova while she was joking around the poking Ruth's on the border with Romania [noise]\nOne of turkey and the middle east best known photo journalist ... has died at the age of Ninety they'd been for looks back at his working life\nNicknamed the ivy stumble are a good ... was born to ethnic Armenian parents in Nineteen twenty eight during his life he chronicled the history of the city at the time of profound social and political transformation and then you check his republic\nHis best known what included his melancholy black and white pictures taken mostly with a like a camera\nAppointed as time life magazines each card spending in the late Nineteen fifties he traveled widely across the region and photographed world figures ranging from Winston Churchill and Indira Gandhi to veteran dressed all in Salvador Dali\n... BBC News\nSupport for the world comes from time share exit team helping people negotiate releases from time share commitments learn more at a time share exit team dot com\nMark a woman and you're with the world it is hard to get beyond the lure of details behind the disappearance of Saudi journalist Jamal ...\nTwo weeks ago he went into the Saudi consulate in Istanbul to take care of personal business and was according to Turkey's version of events and Bush killed and dismembered by a team dispatch from Saudi Arabia the Saudi Government says it's investigating the Trump Administration is saying give the Saudis time and they will tell us what happened\nSecretary of state Mike Pompeo said as much after meeting Saudi officials including crown prince Mohammed bin Salman\nHigh stress the importance of\nConducting complete investigations disappears or devolved show\nAnd they made a commitment is that they do that but that it would be a thorough way and transparent investigation will all see the results of that that made a commitment that they would show the entire world the results of their investigation\nThey also indicated they would get this done quickly so that they could begin to answer questions\nThe pressure is on the Trump White house to hold Saudi Arabia accountable but it's tricky there are deep ties between Saudi Arabia and the United states the U.S has long relied on Saudi oil for starters more on that later in the program the relationship that was also about money and there's lots of moving between the U.S and the Saudi kingdom\nSo let's start by following the money two parts to this Saudi money invested here in the U.S and also how reliant Saudi Arabia is on us investment I asked Steven Cook about that is what the Council on Foreign Relations\nIn twenty six teen mom at bin ... something called the vision twenty thirty which is this great transformation clan or the country that essentially\nPoll Saudi Arabia away from an economy that's reliant on Petro chemicals to one that has more diversified in a central piece of this was to make Saudi Arabia attractive to foreign investors and they have pursued\nScreaming on WGN supported by Carnegie Mellon university integrated innovation detail on a master's program\nAt ... dot edu slashed I I Try\nTo create what this plan vision twenty thirty cause any investment hub\nSo in the past year what are some of the big names in American business that the crown prince is kind of focused on\nWell he's focused on rubber on apple and Google on the big tech\nCompanies that Saudi Arabia sees itself as a country that I'm going to be a player and the twenty first century and uh where are you a player but in the tech sector and they're being discussions with all of those big companies also Facebook\nOn establishing significant presence is an investment in Saudi Arabia\nSo we got to remember the crown prince coming over to the U.S last spring spent three weeks here toward the Google alphabet campus was Sergei brand how successful as it were us corporate giants rushing in\nElia brown with Wall Street journal really appreciate your time thank you thank you\nScreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nWithout Saudi oil\nStick around the world the world is supported by as low dedicated to those who make build and do more offering mobile business banking with tools for freelancers and entrepreneur including built in in voicing mobile deposits in online accounts that I've learned more at A. C. L. O. dot com\nAnd by babble a European made language learning program babble teaches practical conversation\nIn Spanish French German and other languages available in the app store or online at B. A. B. B. E. L. dot com\nI'm ... from the world when you listen to Ninety point five W\nE S say you hear the sound of a free press and you hear how the actions of government business and citizens are changing our lives we can do journalism like this thanks to listeners support please become a sustaining member now by giving ten or Fifteen dollars per month\nOn line the W. E. S. A. dot FM or call for one to six nine seven to nine five five\nSupport the news by giving the W E S saying now and you were entered into a drawing to win a pair of tickets to see Hamel to\nHand\nCamel to just come into the bird and W. E. S. A. is giving away apparel front row orchestra seats to see the show as a Bennett I'm center on Saturday January twenty six you don't have to give to be ... but it's the end of a membership drive your support\nWould be greatly appreciated the W. B. S. aid on FM ... W E essay daughter have found\nA marker worm and this is the world Brazil just held elections the newly elected Congress represents a major shift to the right and then there's the presidential race which in eleven days is headed to a runoff\nThe candidate who's leading the polls after the first round would be Brazil's most right wing leader since the country emerged from military rule in Nineteen eighty five here's more from Catherine Osborn in Rio\nBrazil's presidential rivals have one thing in common so far it their campaigns have been defined less by what they're for than what they are against\nIt's a moment as extreme discontent with the political establishment\n\nWe've got to clean it out to protest or at a recent rally in Rio\nIn Brazil dozens of sitting lawmakers have been implicated in a corruption scandal unemployment is at twelve percent and violence is on the rise\nMany Brazilians believe it's the fault of the leftist workers' party or the team the party held the presidency for Thirteen Years until president Dilma Rousseff was impeached and removed and twenty six pain\nIs not really the whole party I think it's a criminal organization\nThat's lawyer Henry at crude men because the workers' party candidate Fernando had died isn't a run off at the end of the month she'll be voting for congressman an ex army captain ... year both NATO\nIt's not as worse as he is he coming back to the power both\nOn the far right and you star roads at the workers' party became mired in scandal he maintains he's a rare ethical figure in Brazilian politics that despite his repeated praise for the men who ran torture centers during Brazil's dictatorship\nBoth in defense of the dictatorship had sent tens of thousands of Brazilians into the streets chanting [noise]\nHere's demonstrator and translator but the the\nUnbelievable that we have\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News the sound of a free press\nTrying to do in the the the [noise]\nThe for the first round of voting neither ... nor had died gave much\nDetail about what policies they would enact as president and they've never held a public debate in part because both of them was stabbed on the campaign trail and hospitalized ...\nPolitical scientist on a cold enough I should I used to says both NATO has done a better job of tapping into voters fears especially fear of violence\nBoth not promises to implement hardline security measures to stop Brazil's homicide epidemic asking them what the media both of them at all to position themselves as a defender of socially conservative values essentially says that and that's one over many of Brazil's poor who used to vote for the left\nMost wanted an even better in the first round than the poll suggested he would and he's leading in polls for the run off its surprised many Brazilians who'd considered him too radical for mainstream appeal now some are scrambling to debate the potential consequences of his proposals wherever people will let that\nIn real low income neighborhoods might acting a group of residents as a result to talk politics at their monthly give away a free book shoes and children's clothes\nMade out of [noise]\nOne is journalist she's marching she's thirty three and she thinks both modest proposal to loosen gun control who make her and her neighbors live more violent not laughing she strikes up a conversation about both of NATO with a woman looking through the donation\nHow\nThe woman is a retired janitor\nHer name is ... and she's six\nOf them though you know they thought that they\nSay ... says she wants things to change she voted for both NATO and the first round but this time she says she's not going to vote for either candidate she started voting both of NATO might not bring the changes she want ...\nTruck driver clouds ... who also stopped by says he's leaning toward both tomato but he's still undecided\nFifty fifty he said could go either way\nVoters like these may propel show you're both ... to victory\nMachines says Brazil's left last the supporters when it retreated from grassroots work in for neighborhoods they might soften into about ... ...\nBut she says it's these neighborhoods that would pay the highest price it both NATO when [noise] for the world's Catherine Osborn in Rio de Janeiro\nCatherine mentioned Brazil's military dictatorship\nIt lasted from Nineteen sixty four to Nineteen eighty five some Brazilians are actually must allergic to that time but it's an era many others would like to forget Frederick afraid does teaches history at North Carolina State University in Raleigh he says the years of military rule in Brazil involve brutal repression during that time about\nFour hundred and thirty four people were killed or disappeared and more than a hundred thousand people were arrested for political reasons and many of those where at some point tortured\nTen thousand people left the country so why for not very easy for people living in Brazil during that time who had political ideas that were against the military regime including my uncle was one of the four hundred and thirty four people who were disappeared\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nReally wants to repeat so what do you think it is about that period that some people in Brazil are nostalgic for that seems to be resonating when ... talks about it\nWell I think the main issue is that Brazil never ... what is its military dictatorship past and the military controlled the process of transition from dictatorship to democracy\nIn Nineteen Seventy nine they passed it abroad amnesty law that prevented anyone involved\nIn human rights violations working for the regime to be prosecuted for eternity so unlike Argentina or Chile Brazil never prosecuted to military bowl and the dictatorship that military involved in the extrajudicial killings and the torture\nSo Brazilians have developed this idea that there was a time without crime without economic problems and I think that both so now is trying to tap into that\nWhen both scenario started his political career for many years he was as fringe figure and present in politics but given the current political crisis and economic crisis in Brazil you managed to become popular because\nHe's a message of law and order and return to walk some people see as disco they era\n[noise] aren't there are people Federico the who are alive today who were tortured under the dictatorship and are now talking about it cultural icons in Brazil like a ton of ... were tortured these are important people in Brazil\nThere are many people were tortured there are still alive and that's not a secret but they think that what the price to be paid\nFor their own economic boom that Brazil experience in the Nineteen seventies for example ... recently went publicly\nAgainst both in Ireland saying that he's raising four dictatorship is a very bad for the country but people are not listening people are really thinking that at the time not to listen to cultural I come to journalists to media\nIn a way it's kind of like the same thing that people experience during Trump distrustful of media distressed worlds intellectual they want to listen to this populous message\nFrederick off right does teaches history at NC State University Thanks very much thank you [noise]\nAnd Jay Akbar as accuses are more than a dozen senior women journalists colleagues he'd worked with as editor several Indian publications Akbar denies the charges and does even filed a defamation lawsuit against one of the journalists Priya Romani she says she looked forward to seeing him in court\nThis one case as part of something bigger though over the past week the me too movement in India has really ignited as more and more women have used social media to tell their tails of sexual harassment assault and even rape ... with the BBC in New Delhi I asked her to tell us more about the women who've been speaking up\nThey are somewhat actresses they on a screen right to stay on a journalist and I think the biggest impact that has happened is they joined this women journalists who have come forward and talked about that have asked me basically in the hands of one particular person who is just resigned and who was junior is\nTo in the cutting government these women that he counting dad hiring experience in hand the different people from stand up comedian to\nMusicians to adjust to make as active as I've never ever in my for two years of my life never ever seen hut any single ... back then they just\nComing out in recounting as if there was movement of evolution in the lives of these professional women who just want you to talk and diesel woman who already counting the experiences of you know Twenty years back or twenty five years back accounts of me just the violation of their personal space and buddy\nI'm really cares about timing why now I mean was there an article expos they pulled the lid off the problem or did the women just spontaneously start talking there cruise\nI think since the beginning of last year the whole me too movement which began in Hollywood it did gain momentum across the guilt India started talking about it but what she was a ... is an account of a young woman who talked about her experience to stand up comedian\nAnd that actually kind of you know the good old ... ... and a lot of different ... and ... from wanting to come from India they meant industry it went on to the ... and that is then it became really intense none of them and came out to get there and\nEspecially when they started talking about one particular but that was the moment then\nIt just says it is ... ... one of ...\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News the sound of a free press\nReaction alike to me to how women reacted andme man\nI mean I don't know how to put it you know for the audience so it was just I Know but it is a moment we can go to a mixed reaction they didn't know just the men and men who are seemingly exonerated and they feel that this is a moment of\nTruth in India which has been updated for so long and it has been extremely brave of these women who have come forward media is to be supportive but\nThere's also mean is more criticism off some of the ... and some of the women coming forward and there is some kind of backlash water that you know the name of the forward and be brave that it's going to affect a lot of men who were innocent but I think overall the support has been demands and overall has\nReally given that impetus to women voice and it also tells us what feminists politics and due to social space\nSo I just want to ask you one more thing because there have been several incidents in recent years that have prompted national conversations over a sexual assault and abuse in India I think of a twenty twelve gang rape\nOf geology saying uh she was given the name nearby oh there was a lot of media attention in India all over the globe but then after the trial for the perpetrators international discussions\nIt kind of felt like that news quietly went away and then there'd be another attack that wouldn't get much attention just situated for us what's happening now and what feels kind of like a pattern up to now is this different\nIn twenty two has been\nThe same as they happen and thousands of men women came out in the protesting and demanding stricter law in our life there were changes it became most shake the definition of rape was why didn't they test that did you use\nViolence against women know if you look at the data the number of violent incidents again woman has not gone down this is also true that more than ... cases of violence but stick laws because I Know of course you know the law said that if\nThere is a vape for juveniles afoot young person than ... option captive punishment is something that Indian government disappointed people in general has supported the government have been gathered yesterday such a ... mind that people should but\nTruly does something feel different now\nI think what is it different is that people are talking about that they've been coming forward I think that is a big move and there is much more as a nation that\nYou cannot just lie down and take it I think for me as an Indian woman this is a big change it has taken ... just to realize that this is a problem and that just has to be deserted and each one of us have to come forward and do that every possible point of ... and it's something which is\nWhich is a big victory the sea of indicated definitely\nThe BBC's Rebecca ... in New Delhi thanks very much for your time thank you [noise]\nOr next door ... out of India and process in North London in the u._k. but it's also about women taking the initiative in this case we're talking about a gym run by women were exercises mixed in with a hard edged political message throws Alison Herrera has the story\nThe first thing you notice about full search him the last of staff know pedal bells know treadmills\nIt's no fancy cross that class in the middle of what looks to be a meeting room it's just a large black Mac and a pile of boxing gloves [noise] another thing you notice insults are is there are guys working out here\nIt's mostly women doing that that's the way you see women kind of oil that McCain had left\nStreaming on W.\nE. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt CMU dot edu slash I I I\nBuy it in a fit and healthy that's co owner ... she opened this gym two years ago it is coed but among stream was to create a place where women would feel comfortable and learn some basic self defense in classes\nLed by women they all sorts of the ways few minutes but we didn't want to to find it's completely said it's not something that we ...\nWhat is simply isn't done this all start tee shirt it's politics\nSo it's a breaking up a solidarity\nSoul as in solidarity solidarity among different kinds of people from all backgrounds who want social change and the big red star in the middle of the T shirt\nIt will see the the ... the ... the owner to shut and branding\n... is training people at Seoul start for what she sees is a bigger fight and ideological [noise]\n\nEarly August twenty Seventeen Neal knocked the rally in Charlottesville, Virginia for a turned violent and a counter protester was killed [noise]\n... gym in London open before that but like in the U.S there's been a rise in far right nationalism in the u._k. [noise]\nJust last month far right activists held this anti Muslim rally in Sunderland a city in the northeast of England interrupted invite [noise]\n\nAt this rally in Charlottesville there were counterprotesters shouting down racist chants and clashing with marchers [noise] poll amount\nSays that's why the motto at Seoul started training together for the struggle\nMiscount implanted with climate we're in is necessary that people are able to defend themselves\nLamont proudly advertisers that this is an anti fascist jam she believes it's time for the left to toughen up its image and she supports anti fascist militant groups like ...\nI wouldn't have present the left as strong as bold as competent and I think there's a tendency and I it worries me that there's a tendency to create a little bit from the victims position [noise]\nKick boxer and as you Kelly teaches self defense here\nPart of it is thrown jobs in conscious yes but she says it's also how you carry yourself\nAnd sometimes you do need to fight back and present yourself as a confident and capable person\nAnd being led that seeks to fly in society [noise]\nEven though so stressed spaces small classes like this one are packed it seems like the message of training people to be strong both physically and politically is catching on for the world and I was in that letter London [noise]\nWhy average life expectancy is growing in Spain and yes it involves oil extra virgin olive oil to to the world\nSupport for the world comes from babble or language rap the teacher's real life conversations in a new language like Spanish French or German babble ten to Fifteen minute lessons are available in the app store or online that battle B a B B. E. L. dot com and from legal\nDot com offering a network of independent attorneys a tax professionals who can provide the advice needed to get through the daily grind of owning a business\nScreaming on W. E. N. appointed by Carnegie Mellon university integrated innovation details on a master's program\nAt the end news dot edu slashed I I I\nCould have an outsized influence on the mentor still both major parties are giving these communities cause for concern", "year": "2018", "show_name": "PRI's The World", "city": "Pittsburgh", "day": "17"}