{"month": "10", "state": "PA", "station": "WVYA", "content": "And translators W to want to a T Clark seven to eight nine ... son dairy W to zero seven eight Williamsport and ... to seven eight ... wells borough listener supported public radio\n\nPartly sunny this afternoon with hides in the lower forties partly cloudy this evening with Lowes in the lower thirties and mostly sunny on Monday with highs and the lower fifties you're listening to W. V. I. A. F. am\nWu vi listeners just like you provide the financial support that enables us to provide such fine programming thanks for your membership if you're not yet I'm ever go to W. V. I. dot org to learn more and become a member today\n[noise]\nThe church bells are ringing one o'clock in Williamsport, Pennsylvania and this is\nFrom the W. V. I. a studio in the community art center on west ... street [noise] today as October twenty first\nWith a Russian pianist who\nHas been hailed as the true successor\nTo the great Russian piano it's of the past\nBoris Berezovsky\nNo relation to the\nFamous oligarch by the same name was born\nIn Nineteen sixty nine in Moscow he studied at the Moscow Conservatory and although he describes himself as not a virtuoso at least not a child prodigy virtuoso he achieved a level of technical expertise that few pianist have\nHe's made recordings of some of the most [noise] transcendental the difficult works in the panel repertory including Leopold ... transcription some the already forming a bleak difficult Chopin eight to ... we're going to listen to ... perform what is probably a specialty of his and that is\nMusic we're going to hear him now in a transcription of Missouri ... famous night on bear mountain Boris Berezovsky playing ... [noise]\n\n\nMm\nOh la la la la la la\n\n\nThey may\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\nSame\nDay\n[laughter]\nAnd then\n[laughter]\nMm\n\n[laughter]\n\nMm\n\n\n[noise] [noise]\n[noise]\n\n\n[laughter]\n\n\n\n[noise]\n\n[noise]\n\nUm\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise] [laughter]\n[noise]\n[laughter]\n[noise] mhm\n\n\n\n\n\nDi\n\n\nOr the\n[noise]\n[noise]\n[noise] [laughter]\n\n[noise]\n\n\n... ...\n...\n\n[noise] [noise]\n\n[noise]\n[noise] [laughter]\n[noise]\n[noise] [laughter]\n\nMm\n\n\nMusic by Nick ... and early twentieth century Russian composer good friend of mine off we heard a romantic sketch where the young and the fairy tale opus fifty one number one in the minor performer was rushing pianist Boris Berezovsky [noise]\nMimi ... Islam may is one of the legendary pieces in the piano repertory it's magnificently difficult but also a great audience favorite\nIt's been tackled by many of the greatest pianists Russian and otherwise and it was in a way a model for Murray's Roosevelt who composed his\nFamous Scarborough in an attempt to out\nA play ... works\nIn terms of PMS that difficulty well we're going to hear this\nLegendary works Islam\nAre based on foot tent that ... heard in the ... mountains not far from modern day Georgia back in the Eighteen fifty Islam may a fantasy an oriental fantasy he called it performed for us by Russian pianist Boris Berezovsky\nMm\n\n\nMm\n[noise]\n[laughter] [noise] [noise]\n\n[noise]\n\n[noise]\n\nWell\n\n\n[noise]\n\n[noise]\n[noise]\nWho\nKnows\n\n\n\nKnows\nDa\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\nOr\nOr or or whatever", "show_name": "Music to My Ears", "year": "2018", "city": "Williamsport", "day": "21"}