{"month": "10", "state": "PA", "station": "WVYA", "content": "Translators W to want to a T Clark summit W to eight nine ... sundry W to zero seven a Williamsport and up to Seventy eight ... listener supported public radio\n\nMostly sunny this afternoon with ties in the upper sixties mostly cloudy this evening with a forty percent chance of showers lows in the mid forties and most of the cloud in Monday with early showers likely eyes in the lower sixties this is double ...\nW vi listeners just like you provide the financial support that enables us to provide such fine programming thanks for your membership if you're not yet I'm ever go to W. V. I. dot org to learn more and become a member today [noise]\nThe church bells are ringing one o'clock in Williamsport, Pennsylvania and this is music to my ears [noise] I'm Gary ... of broadcasting from the W. V. I. a studio in the community art center on west ... street\nToday is October fourteenth and appropriately our theme is music for autism I suppose when any of the seasons come to mind for a classical music lover\nThe first works that would appear in the memory would be the charity by Antonio Vivaldi one for each season\nHis autumn is perhaps not nearly as frequently performed as spring but it's a wonderful work\nWhich reflect perhaps more of the spirit of Thanksgiving than what we normally think of as appropriate music for the fall of the year he includes poem with this concerto is with all of the can charity included in the seasons\nAnd it's like this the peasant celebrates with songs and dances the pleasure of about to fall harvest and fired up by back in ...\nMany and their revel pre and sleep that's the description of the first moment\nThe slow moving every one is made to forget their care's into sing and dance by the air which is tempered with pleasure\nAnd by the season that invites so many out of their sweet slumber to find enjoyment and finally last the third fast movement the hundreds of marriage at the new dawn and with ... horns and dogs and guns depart upon their hunting\nThe beast fleas and they follow its trail terrified and tired of the great noise of guns and dogs and the beast wounded\nThreatens language lead to flee harried dies the three moments of Antonio of of all these awesome concerto the violent soloist is Alan love day should never Mariner conduct to the Academy of St Martin in the field\n\n\n\n\n\n\nA\nOh Mm\n... ... ...\n\n\n[noise]\n\nYou\n\n\nOoh [noise]\n\n\n\nBought him from Frederick dealing with North Country sketches performed by the workers to the Welsh national opera\nConducted by Charles Mick Harris\nAlmost his famous these days that's about all the seasons are the four seasons yeah when uh salaries by ... pm yo la\nTengo with so many fascinating turns unexpected twist ... studied jazz while he lived in the United states and when he returned to his native when Assad ... he created tank\nThat way the fascination of his audience is Sam and now we're going to hear now he is often from the four seasons when us ... performed by ... ...\n...\nAnd ...\n[noise]\n\n\nMm\n\n\n\n\nOr so\n[noise]\n\n\nMhm\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]", "year": "2018", "show_name": "Music to My Ears", "city": "Williamsport", "day": "14"}