{"month": "10", "state": "AZ", "station": "KJZK", "content": "\nYou're listening to the Arizona community radio network on eighty nine point five FM cage eighty eight Drake Prescott Sally Ninety point one at ten K. J. C. P. Prescott Chino valley Ninety point seven to ten K. J. C. K. Kingman Boulder City Nevada\nAnd translator came to one seven ... months apart at Ninety One point three FM the king the center for the arts is a nonprofit company committed to promoting the urgency\nOf the group is renovating the Beale Street theater which will be the center for culture creativity and community if you'd like to contribute time or money please visit Bild street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nGrand Canyon defined eight miles east of William's on the interstate forty welcome any fear feeding him right out of your hand he hundreds of animals that elk buffalo girls camels collecting Mindy kangaroo mommy Rainier in more the Grand Canyon deer farm near Williams sixty two\n\n\n\nThen he goals and little camera and that's the bird jazz ensemble what Josh spelled sting drums seat of green blanket on trumpet Alexa turn to you know flu Steve runners and piano in in ... daily basis for their CD called connect the dots\n\nAre you doing welcome you're listening to jazz what they want a pleasure to have your windows and it's great to be bringing you all of this great American music we call jazz here's drummer Kenneth brown and a two dedicated Roy Hargrove it's called grove in\n\n[noise]\nNo no\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\nNo no no\n[noise]\n\nThere is something that was recorded in Nineteen eighty nine but wasn't released until two thousand three\nBoy my glad they put out finally stand gets on tenor Kenny Baron on piano George writes on base and Victor Lewis on drums\nIt's a verb release called bosses and ballot last sessions stand gets doing yours and mine a tune by fat Jones and before that we're decides brother Hank Jones with Dave Holland on base and Billy Higgins on drums\nFor their CD called the oracle and Jerome currents classic to yesterday's\nYou're listening to jazz right here in right now with Dave ... certainly glad you've joined us please stay with us for a lot more great music\n... county library is hosting small business workshops presented by Andrew soul men this week there'll be featuring creating a profitable company it will be this Friday afternoon November second from three to five at the human mean library which is located at twenty nine fifty one twenty first right you can find for the details are you my library dot org\nIs Thirteen twenty an border radio kill Afghan border radio easy ... or a service of Arizona west in college for more than forty five years\n... general manager at border radio and I think everyone who called during our recent pledge drive if you didn't get a chance to make that call it's not too late even call eight seven seven eight three eight five to nine to to make your contribution or visitors that border radio aids eat out or to make your secure I'm like get\n\n[noise]\n\nThe BJ Perry quartet and Charlie Parker squads the motor lodge that at the yard bird sweet in Edmonton, Alberta in May of two thousand Seventeen\nPG Perry is the Alto saxophonist there John Mayer on piano steep Wallace based in Quincy gave us on drums and the CD called I'll do who stole\nYou're listening to jazz with Dave one\nHere's another large set this uh your sheets Jack London square in Oakland great place to your music\nAnd the great ... grew Miller with his trio Derrick Hodge on base in Korea Reagan's gone drums this was from a two thousand three sets with ... with your ... and Horace Silver is too\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n", "year": "2018", "show_name": "Jazz with Dave Schwan", "city": "Kingman", "day": "30"}