{"month": "10", "state": "NY", "station": "WRUR", "content": "Well continuous seven Fifteen eighty eight in next week's grateful that I\nMom row\nYou'll find grateful that our playlist another useful information online at about surfing dot GED our dot com you might also want to bookmark that dot net where you'll find a show from the grape all that our archives posted in every Wednesday you can follow me on Twitter day begins all one word and there's a Grateful Dead our page on Facebook\nBike touring schedules posted it begins dot com in October I'll be in South Carolina North Carolina Georgia and the ... Bible Eli both Florida and I'll be performing in the north eastern November\nMore info at ... dot com where you'll also find information on my book this is all a dream we dream in oral history if the Grateful Dead\nSupport for the Grateful Dead ever come to speak from bill a bill farms handmade chocolates recognized as one of America's top ten chocolate tears by pastry arts and design lily bells award winning creations include the eighty percent dark star bar the Seventy percent rambling rows and more made by heads foreheads\nL. I. L. L. I. E. B. E. L. L. E. forums dot com\nAnd from real gun music the label that brought you all those Dix picks and road trips releases over the years finally taking the plunge into Grateful Dead vinyl they're releasing Dix picks thirty four recorded eleven five Seventy stepping in Rochester in the six el ... hundred and eighty grams vinyl set mastered by David go after it air show\nThe box includes a four page lp sized inserts and it's limited to Fifteen hundred in number copies it's available at real gun music dot com\nAdditional support comes just wait from the Capitol theater and Garcia is in Port Chester New York\nMichael ... spearhead bring good bye to musicals finch I did the cap on Thursday October eleventh an Upper East muggy takes their shredding gym so the cap with southern avenue on Sunday October fourteenth every Wednesday is great but that night Garcia events information and ticketing at the Capitol theater dot com [noise]\nThe cat has also announced the second show with ... friends on Thursday December twenty seventh with Melbourne CEOs Eric crowds no John capitalistic Jay Lane Jennifer hearts weigh in weedy brame\nOh deal in transit the cap December twenty seven second show added by popular demand the tickets are available at the box office and at the Capitol theater dot com you can learn how to become a spots where the Grateful Dead our in other ways up supporting\nThe program a GED our dot com slash support and you can reach me anytime by email G. A. N. S. at ... dot com\nThis has been grateful that our number one thousand five hundred and sixty seven thank you for your kind of tension everybody I'm David gas in your back here next week [noise]\nHello I'm Johnny Cash [noise]\n\nThis week on American roots we look back at the men in black light to me that gives out preacher country Jupiter and rockabilly rebel Johnny Cash remembered by his family and friends I'm Nick stricter with American roots from Charlotte\n[noise] [laughter]\nTomorrow afternoon at foreign double your your ... the Rochester every day hour after hour public radio brings over with interesting an inspiring contact for you to enjoy\nVery soon you'll have a chance to invest in that experience\nTune in for a new member Monday and unprecedented opportunity to get on board as an active supporter your contribution in any about will be matched dollar for dollar that you can also editor when an Amazon smart speaker yet another way to access to this important community resource it all happens this Monday here on your members supportive public radio station\nBedroom right hurt your hopes for the job and I'm an ex girlfriend we're going to have moved to the upper or just come from a fire in the wind as well as ruby plus music for me was staples new mountains solar Richard Thompson enter into video I guess for the week attorney discussion with ... that are more next time on a cruise to cap\nOn\nMonday morning at five on the way you are your abdomen agency Roger\n\nHello this is Howard ... down up and coming newcomer John Marlin in t._v. no or musical guest let's hear from Burton who survived both party in listening to go on to help other in the re enter society where he can hold\nThis week [noise]\n\nTomorrow at one PM a different radio\n[noise] strengthen your brand and benefit the local community by underwriting programming on different radio to learn more about partnership opportunities than that now you're underwriting at that age you argue are dot org [noise]\nThis is never supported public radio W. R. U. R. FM an HD Rochester you can also go public online at W. R. U. R. dot org\nMm Mm Mm Mm Mm Mm oh hey how are we going\nIn and and and the answer\nFor the next two hours you are stuck in this like adult care or the ... then we're going to get things going this week was one of the biggest TB signs ever recorded from the Jimi Hendrix experience\n[noise]\nRivers waiting\nYou got\n\nCheese\nAll Russian\nNot\nIn the\n\nI Am\nSpring\n\n\n\nYou're stuck and so we can do with your with the [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\nWhen\nYou were you know\n[noise]\n\n\n\nThey\nLa la la la la la\nOther than that\nOne in the\nAbout do\nKeep your cattle\nThey\n\nTo think there was a big deal to stay\nThen in the name of it\nA\n[noise]\nShe\n\n\n\n\n\n\n\n[noise]\n[laughter] [noise]\n\n[laughter]\n[noise]\n\n\n\n\n\n\n\n... the ... three from Nineteen Seventy the June ... Oh yes I Do that over ... their way the music machine the last\nWell besides actually the last single the ever released the school Mother Nature bother her came out in Nineteen sixty nine can heat was in there with him who ski ... woman number two\nOn the movie with candy though I Am a walrus legal strict of course some magical mystery tour starting it up you mean as you experience still free you originally beside me Joe\nIn Nineteen sixty six so low took three years before it finally came out in the U.S\nHas an album drag on the smash hit so you are stuck in the second over here with her but we might be listening and W. R. as GM knew were named sisters ... West Virginia Ninety One we live in one at one point seven have been serving time our county and surrounding areas well\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nAnd you know you you got to see me with\n\nThen that the marine [noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\nReally and Jay\nAnd then they can do it then that would be bad for the game [noise]\nAnd\nThen you you you know Julie yeah the only way\nThey're doing really\n[noise] well you know what I'm saying well\nYou know\nWe were on a\nDay\nIn\n\nYour story ...\n... ... with us from\n... to ... to ... five dollars that you know me and I have a\nChance to go in da na na na na na na na na no\nHuge and [laughter] she has\nTo do that [laughter]\n[noise] na\nNa na na na na na na na turned chanted and turn to\nIn a trash you know\nOur [laughter]\n[laughter]\n\nUm\n[noise] and [noise]\nShe said she said to me and\nI'm changing their daughter she will get dressed\nThere's no John jak years old and they're they're rolling grinding Arizona\nAnd my\nDidn't they just go home\nI Know and you\nKnow to major\nIn the\nLast thing I\n\n[noise]\n\nIn many many nano\nAs\nWell below grade girl like the\nBomb\nReally don't know\nI think oh well no no\n\n... well being drawn some ...\nSome odd when God you\nKnow [noise]\nYou know\nA\nJanitor\nAnd tone three long uh anything well I\nMay change in Maine [laughter]\n\n\n[noise]\nAnd then they [noise]\n\n\nThey they were just going to be an issue\nIn deep doo doo doo doo doo doo doo doo doo doo I watched you know that you know getting married and like I said well no no\nAnd then there are no audio\nAnd what not and then like a job where I'm mad as searching rock climb and I'm\nLike oh\nMy\nGod I Know\nThat ah I\nJudge Judy Blume draw\nYou try and the only ...\n... ... what do you think would be ... or ... [noise]\n\nAnd uh\nThe murders project rubbing up a Nineteen sixty six but that also included the beside of shows a night\n... Gloria June ... written by a couple of band members we motives in June so\nYou Bob Dylan starting things all up to the sweet Marie from the bond bond and you are stuck in the circuit over here with armor where you might be listening on W. y G D you ... you know Neal\nI mean you're the you're real money one point nine of them it is a predictable radio\n[noise]\n[noise]\n[noise]\n\nOur our\nOur our uh\nOur car\n[noise] [noise]\nNow that they're going\nDidn't you will\n\nFrom\nMaine [noise]\nIn the day\nI don't know me\nAnd not\nLet your\n\n\n\n[noise] well\n\n\nYou know we saw\n[noise]\n\nPretty close to ... the midnight six man came out in Nineteen sixty five and did the kings too weird for me baby\n[noise]\nAnd you are stuck in this era with urban where we really don't have enough time for one more tune\nSo we're just going to\nA kickback\nOr when you're telling about talking about other show actually it is going wrong in the days confusion and scaring them a lot of the scene stations on all of them know you know here's isn't one of them get hold of these guys into me when Iraq and then the daisy confusion do similar\nTo stuck in this era except it's a little more in the early seventies a little more in their home tracks\nAnd like what early seventies rock radio sounded like rock and then the days in the Asian\nAnd of course you can get more information about that by visiting the Web page it's radio dot com and of course while you're there is a contact but I like to hear from you\nAnd if you were in wind then you're more information about this week songs to skip the blog but ... percent number Eighteen forty one in fuel bringing to explore the site Mardi Gras has been read a couple of their links there because of one of the things that are harming radio dot com\n\nFor the sixty minutes you've been stuck in a second look here it's a production of Herman radio in association with Finger Lakes public radio\nProducer is Steven our Web or associate producer is Greg ... shows new sets studios W. E. O. S. N. W. H. ws Hobart and William Smith colleges in Geneva New York\nProduction funding for stuck in the ... comes from Joe's Garage where things happen\n[noise]\n\n\n\nMe and be be na\n\n\nNa\n[noise] [noise]\n\n\n[noise]\n\n\n\nMemory [noise]\nYou may or may may you may you may\n[noise]\nA special model makes me for single release from the Nineteen Seventy\nThe doors\nOriginally appeared on the horse you know do do you make me real if you are stuck in this like Italy Guerra with Herman where this\nDue to the dance like like with this week we've got something that kind of sounds like a good meal it'd be like Sigmund back this\nBand was so far ahead of their time than most people still would have a nerd who recalled man river they operated under the Berkley area although they were originally who somewhere in Ohio\n[laughter]\n[noise]\n[noise]\n\n\nAround [noise] [noise]\n[noise]\n\n\n\nFrom late in Nineteen sixty seven\n... or the other one single ... to their huge yet earlier in the era when she\nWas a special stereo remake song was originally released in stereo but few years later someone putting together the first greatest hits baggage for the ban\nThe whole of the original master tapes and made a few stereo copies of tunes that was one of them were mad river and there are there in Nineteen sixty seven he'd be released in Berkeley and around the bay area\nWas cold wind chimes in particular to really for track and three sons ... pie in the song was leader recorded\nFor their first album at our was the original model which apparently the beer kind of considered a demo that they shopped around and sure enough they did manage to get a\nContract with a much bigger legal\nSo I guess it works for you are stuck in the psychedelic era with their image we might be listening on ... radio dot com ... Arizona one hundred forty five ... you get stuck in this like your toys week Thursday nights and Saturday morning\n\nMhm mhm ...\nShe wants to do the things you know the three dollars and ... and I knew the nuns live the\nShe's the\nAnd she does the ... or a\nAre you in the\nLa la la\nLa la ball\nIn an\nOdd that none of the ... and you can move on to the people\nThat do exist but a a ... who are going to be ...\nNot think that when she was ...\nAh do you ever you\nAnd I can uh live without a\n\nWhy can't you did the one I Want\nWhy can't you can't name\nLa la la\nLa la\n... you know\n[noise]\n\nBuying New Years just to draw a line on\nThey didn't\nWant to live on the line Jen ... de la\nLa\n\nA girl her\nDown and down do you\nA van\nCalming down down down down down the mayonnaise da\nDa da da da da da da na na na na na na na na na na na\nHave any kind of time ...\nAnd I'm not on a game\n\nThan\nNever\nNa na na na na na na na na\nNa na na na na na na na\nAnd I really\nBetter than the ban\nUh\nNa na na na na na na\nNa na na na na na na na na\nNa na na na na na\nNa na na na\nNa na na\nNa na na na na\nYours does this look at the ... with her\nFor\nWe in\nAny do\nRight\nYou know the\nThat and\n\nDid not used to love\n\nThe\n\nWhen\nHe was he\nA long long ...\nMen\nAnd men and all that you know\nKnow\nNot be\nMe\nOn in the number that just\nNa na na na na\nNa na\nNa na na na na\n\n\nNa na na ...\n... ...\n\n\n\nMm\n\n\n[noise]\n\n\nMm\n\n\nMm\n\nMm\n\nMm\n\nYeah\nThey do not need to be a human\n\nBeing\nOn the long term\nNa na\nNa na na na na\nNa\nNa na\nNa\n\n\n...\nMm\nLike\nYou were stuck in like a dog with her\nIs ... ... ... ... ...\n... ... ... ... ... is the\n...\n[laughter] everyone look wow ... ... ... ...\n... ...\n... ... ... yeah ... ... ...\nIs on the uh the uh the ... ... ... ... I rely on the ...\n[noise] yeah the ... ... ... August ... view the\nNa\nThey may not a good [noise] um maybe\nThe ... but it's a good ...\n\n[noise]\n\n\n\n\n\n\nI go to the car called the um [noise]\nJust to see it man any day go\nBomb [noise]\nI could have been dead still night time Neal night time and time when they need a ...\nA non\nVanity August ... ... ... and a new dang\nDark day a gun and then the ... is the na\n...\nBut it is now [noise] and they went to a ... [noise]\n[noise] but ah", "year": "2018", "show_name": "Stuck in the Psychedelic Era", "city": "Rochester", "day": "14"}