{"year": "2018", "show_name": "Dr. Asa On Call", "day": "27", "month": "10", "state": "AL", "content": "What is being in recovery from a mental or substance use disorder which is something we proudly show the world it might be surprised millions of people are in recovery sharing hope help and support with family friends and community showing the boy says for recovery\nFor twenty four hour free in confidential information and treatment or for all for mental and substance use disorder spur you or someone you know call one eight hundred six six to help\n... by the U.S department of health and Human Services\nAnd seven six that's one eight hundred nine nine oh sixty nine\n... W windy E. F. M. Coleman W. I. D. E. A. M. Birmingham\nW two three Seventy K Birmingham W D. J. C. H. D. to Birmingham ruining\nMaybe to a third down and [noise]\nThey say that\nYou don't see it on a we're under a third\nPeriod [noise]\nScrambles to the physician [noise] throw out to\nThere in the past\nIs intended for him great\nYou know it's like you should go up\nFunny situation [noise]\nEight and a good number will stand in his own yard last [noise]\nFictions the again [noise]\nThe stock that's out as the down back at about the forty or I did too that was Gibbs Richard fields that is Larry Moe cameras going around riding a switch fails again he's still still up there shooting the getting down\nTo somebody did you [noise]\nYou know you got to be out of ... about a hundred yards staff\nAre going back and forth they wanted to break free that [noise]\nThirty one just seven Hoover leading mount real over with the ball thirty more themselves [noise] officers all lined up over here and it's just a way by\nI just took a peek at the age ESPN that game's all sat at thirty five thirty five\nYou trust me this time [noise] [noise] that's a shootout over there that's Seventy points\nFor probably four or five minutes [noise] gone and the fourth quarter\nWe get some kind of Italy looked like probably a either a clear up or\nHolding or something on the move all back\n\nTell you we had enough that you address off you back Paul bear Bryant can be\n[noise]\nI tell you we have enough kids from a huge trust so few weeks back ... Brian can be\nVery proud of his grandson he's for real he's what six foot\nFive to one\nMaking ... half the ... you have to buy a man on a dime\nOn the field will try to take one or two we'll be back here to stay tuned everybody\nRuin you listed really bad from high school football\nWinning the foreign service exam without hearing we have\nLast chapter three in the New Testament the Bible says whatever you do whether in word or D do it all in the name of the Lord Jesus giving thanks to God father three yeah\nThe balanced athlete knows the theories power not only in defeating their opponent but in doing so with character and integrity abiding by process that arms with the respect of those they compete against because that is fun and exciting to win the game\nBut there is a true peace and content to know that we've done it the right way\nMy name is Nathan corn and I'm the pastor at the church it Ross Bridge\nWell back in everybody did or didn't mean to have that seven twenty four to go in the third period [noise]\nGoes to the right side when I was wondering if we're going to see some\nClaimed jerseys in there\nSeven minutes to go in the third period [noise]\nEspecially as we get closer and closer to playoff season once again one welcome everybody listening O W why the radio I live in one at one point\nWhy these call letters to the changes we used to be W. J. C. W. H. O. J. C. F. new one on one point\nStill a hundred thousand watch it'll be Christian tell\nThe sister of a Christian music which is W. D. J. C. push it off [noise]\nThere's a kind of Utah pass\nOne of the running back Jesse Kelly I Believe in about thirty\nUp the middle on that I don't know we got it up for the first thing I Do not generally just short of the first\nDown and maybe three\nYards to go for a first got the ball to the\nThirty four yard line got to make for more yard for a first name [noise]\n\nFor the buccaneers on their own thirty for your land back to throw actually\nCivil rights are looked down to peel froze way down to ... see\nThe the receiver I'm trying to think it was a new phone number one pick in ... he was trying to put itself in a position to catch the ball was unable to do that and that brings up for down somebody's hurt out there on the film I\nDown here looking at the far into the field down [noise]\nCan't tell who it is oh\nI see him [noise]\nVegas well yes you see the hell is going to be mountain ... move mountains for a\nGuy\nHe finally got laid out way they get chasing the quarterback didn't seem to block company will take time out to um unfolded to let you know who it is is her\nDo they face in the quarterback\nDidn't see the block coming\nWill take a timeout to unfold and to let you know who it is is her thirty one to seven\nMinutes ... seconds villain the third period when the staff\nPatrick promotions attends are handling them\nAnyone with you're asked for that form on occasion leader in Birmingham as Mr merge with seven locations in town there is a mystery hurts near you with thousands\nOf times he doesn't die Mr Burns has the largest selection in Alabama if it's ... it's a once in a lifetime occasion don't leave your party wedding or celebration the chance Mr Bush was rainy and fast specimens for quality of service same day and out of town services\nMr birch especially the first ... Patrick Henry war was when I missed emerges taxi to he's one of the number of deaths you know simple\nAnd all of them is diverge Tennessee those hate him to fit in confidence that you have to have when you're listening events were close to celebrating there's no comparison just ask ... he's wearing and Mr birch tuxedo this weekend that scene is for sale on the leader in Birmingham and all of Alabama is Mr birth\nWell back in everybody uh we did\nNot we could not get the number of the mountain broke player that we heard we don't take her seriously they walked out on his own power of our family [noise]\nOn over there on the sidelines [noise]\n\nWell off the supply monopoly Hoover now not off into the lab deep Islamabad\nHoover has the ball they're metal were\nDown and fifty yards to go on the Twenty one yard line their own when he was\nI saw the referee picked picked up a a yellow flag but then I guess it was a mistake\nI didn't notice a penalty being called during\nWill be a being killed there on the sidelines on Mount royal or yelling there's some kind of ... or something [noise] that was going on and it looks like they moved the ball forward I don't know\nIt's gonna be [noise]\nFourth down now there's like the changing from officer deep and both teams just all ran out on the field I don't get their\nOil [noise]\nLooks like they've they've got the ... out there and the\nAmount broke his hand green standing at his own twenty five yard line\nWill rocker got appointed away is hockey\nAnd green calls for and except for kids at the Nineteen yard line first intent\nOr mount royal at their own Nineteen yard line\nDoubt that was a booming pot it was ...\nI mean that was from the twenty to twenty I think\nYour great great [noise] [noise]\nThere's a flag on the fillet\nSeal [noise]\nLet go because they are they going to move it back further\nWhich are Fifteen your family do you probably won't take the ball all way back to the thirty eight yard last thirty six your last at the school\nYou know the old adage that there could be theoretically a penalty on every single flight right yeah I agree\nI mean this is the ... game that the season I Know these games and Morsi's\nBobby Ashford quarterback takes us map gives it the McCammon coming up the line of scrimmage\nGet tackled go down that about the forty five yard line going to be way short of the first down\nThat I'm running up a\nIt was that third down or forward\nAnd his hands of the third period more to the store who were thirty one mountain rogue seven\nWill take time out you're lifting to the best of high school football\n[noise]\nThe store who were thirty one mountain rogue seven\nWill take time out you're listening to the best of high school football\n[noise]\nEver get the sinking feeling when you turn on your computer and nothing happened or interns own won't move into windows maybe you have viruses or maybe you've been hacked your hard drive in your warning\nAbout him on a failure or don't spread calls the oldest most trusted computer store in Birmingham\nSince Nineteen eighty seven for computers\nCan feel all your needs that they are far computers can feel all the sales repairs upgrades aren't success rate payers to a war you wrote in Birmingham, Alabama the phone number to call seven eight three eight zero zero this area code two oh five\nSeven eight three man a zero zero foreign computers Elsie column today\n[noise]\nYou're listening to\nMass in high school football [noise]\n[noise] well back in every body fat Patrick along with me gal were ... his friends calling Michael\nI Can't call him and he won't let me be free so it's ...\nYou're clubs I was trying to get yourself a little time they'll be so hard on your son's day I've I thank you thank you for that\nHas the ball we've turned we change into the field Hoover has the ball in his third down\nAt least twenty yards to go third in twenty the balls at the forty five yard line who were there oh forty five\nThey've got across the fifty or forty five yard line\nAnd get inside the forty yard line or a purse down\nA TV Time ... says thanks nother Gibbs can not ... but as for the quarterback looked out of the bill has plenty of time going to throw the way down the field for one of the receivers you know he almost counted that time will tell you that is I have your alone I Believe\nThey say Rodriguez\nI'm not sure I think is Xavier loners\nThirty five to say who that is maybe Rodriguez alive or\nOkay there's spores down\nWill record the punter standing in his own thirty yard line Let's see if he gets to the end zone\nHere's the kicker is so beautiful the\nWobbly spiral taken at the five yard line by mount rural only return get get to that too about the twenty twenty five yard Landry person from mount broke\nEleven minutes thirty seconds to go in the ...\nWar ended up in the ... as they change out a pang\nAnd forty two truffle forty\nThat's a shootout that's just the gun slinging shoe that that's just an evenly matched teams both [noise]\nThrows out to the right side and uh [noise]\nThe region three leaders Hua truffle\nThat's the region three leaders you trust will\nA Thompson with a regular five and one you address but overall record of seven into Thompson was an overall rented\nSecondhand seven yards the goal\nTo tell you who that is that is AJ Jay to get\nA wrinkle [noise]\nYeah is AJ\nGets paid to just not going to turn the\n[noise] they're gonna containing they have all year long their coach so well they're the guys stay home [noise] they don't go for the sake [noise] third\nTwenty eight yard line got across the thirty\nThrow their gives the quarterback gonna run option throws a Utah passed back to the inside\nWas also going AJ Jay Z there's just\nNothing there and\nRoot [noise]\nRun with me here a little bit [noise]\nThey're deep in their own territory minutes left to go on the ball game [noise] and you run about three times [noise]\n[noise]\nWhere's your where do you justify that there is there's a snap\nIt's it's a forty yard line\nBegins needs to get on out of the way you read\nA ball rolls dated the Twenty one yard line first in jeans but Hoover at that\nPoint I kind of case a man the planners\nDepartures from both sides have been exempt or you were talking sixty to Seventy yard but they they're grown that's for sure\nIs is thirty one to seven\nDo you think you have a chance to come back your mountain ... no but you so what do you do in practice in your\n... your cheapen the ball\nYou know throw interceptions you're not throwing incomplete you're keeping the ball keeping the clot ruin\nWell you can see the TV get down there on the twenty yard land so we've got TV Time out they're going to be taking a lot of those it took me to ship this\nThat's what makes this like it's it's about\nUsually we're about ...\nWell my take on is just simply this\nI see mount Brooke is is predominantly a running T I haven't seen much in a way of\nOf a passing attack so it's thirty one to seven\nYou're right coming back its\nWay of a long shot so wouldn't you wouldn't you\nFor the upcoming games and the rest of the season practice on that but you're weak is on\nYou know maybe you'll do in a real a real situation not in practice but you're out here against one of the foremost teams in the states so back that throw the ball ... can you gangs and the arts I don't know that's just that's just my title Don it\nI mean that the ... and that's that's the way I look at it\nThe Hoover buccaneers at their own Twenty one yard line McCammon with the ruining gets across the twenty twenty five yard land going to be just short of the first down and the approaches to thirty or bring up second down there\nRuining gets across the twenty twenty five yard land going to be just short of the first down and the approaches to thirty or bring up secondarily maybe three two or three yards to go I\nJust as just as well I'm ... I'm pretty surprised that they still got their first stringers their hair [noise]\nYes anything can happen or green\nYou lose somebody you wish you wish you had no way oh no\nHe's behind that begins but I hear the right side he's a blue chip\nCameras in the back bill\nAsher rose to lay off Dodgers away from one player throws that he just kind of power says it out there\nTo one of his players are doing it did see do you go around right in their own is be\nVery goes he's going around to see who that was that was a layer of McCammon ozone number\n\nOr what he was he was really dance [noise]\nAny somebody down and they're slow to get a\n[noise]\nI Wonder if there was a\nAnd he was slow to get out hopefully he is not her\nHe's still down\nWhen we take time\nAnd see who it is the Sears years\nWe'll be back here today as they do everybody you're listening to the best in high school football [noise]\nTakes us now\nThat's not McCammon right there who is this number twenty eight there you go sweetie I\nDo have twenty I Michael do need to leave the or the number of the ...\nYeah well the Hoover buccaneer\nJust what you call just cite tight [noise] who da da\nDa da da da da da da de la ...\n\nYou have a number\nMember twenty six [noise]\n\n\n[noise] it's\nYou see there you go just\nThere [noise] I don't know what that is the most is that come to the sound system [noise]\nOf course I've been pretty man [noise] [laughter]\nSo go down and\nGo [noise]\n...\n[noise] now we have a new quarterback number Eighteen [noise]\nThere [noise] so I told them to still do that Hoover and whenever I see it as a Joshua lending calling Josh he's a tenth grader [noise] we're under a half a minute to go now [noise]\n\n\nThat's going to be it I don't think the coaches are going to have Saturday when my other one that's going to be the end of the ball game with the Hoover buccaneers winning thirty\nSeven seconds six five\n[noise]\n\nI guess we're supposed to be in a jar [noise]\nMake sure they use to start heating and cooling distributed camps\nBrown and supply company Arnold Relman\nSupply has been serving Birmingham and Jefferson and surrounding counties Nineteen forty ... owned by Barry brown and mark brown old graduates mountain Brooke Hi Sue the Arnold\nBrown company is the major distributor temp star and keep heating and cooling products in this area\nOf mountain Brooke Hi Sue the Arnold brown company is a major distributor of temp star and keep bright heating and cooling products in this area as for them by name when you replace your heating and cooling ... when you do you can have confidence knowing a couple of Spartans are there\nTo make your temp star and or keep heating and cooling unit all winter that's Arnold brown metals and supply\n[noise]\nIt would turn some of this [noise]\nI Am going to keep on playing\n... selling to calm down a little bit [noise] three showed you being with us not only best high school football we're going to take a break you mention that come with our Limbaugh Toyota teachers if we [noise] we don't have much to offer [noise] much more to do during a post game show\nWill uh see if we can [noise] at least the we're we're we're all here we go [noise] nice gentleman\n... has been to San Francisco Simpson pepper\nAnnouncer [noise] to participate in the post game call\nNine four one one oh one one's a number to call man for one one oh one one\n... ... to call\nSo you see we we let you get on\n\nAnd exits leading from the stadium or now\nConvenience ...\nThere is no need to congregate\nOur exit as you leave the stadium thanking\nCoach Simpson pepper or missing a beat really amazing we can recognize our Limbaugh Toyota teachers of the week [noise]\n[noise]\nIt's time for the Limbaugh more yoga teacher we ought\nIf there's a new car did you want\nGas mileage low maintenance\nToyota your Toyotas headquarters for good deals and great sir now\nThe teacher of the week you're more [noise]\n\nFirst hour visiting team [noise]\n... teacher the principle\nOr the Hawley bill of holidays the principal\nOr what to over university where he's got his masters degrees master's degree are you a beat his wife and three kids ages five to Eighteen taught biology for Nineteen years before\nFive years ago or ... years of mount ... junior high and also coach for sixteen years book ball basketball and baseball congratulating the feel of Holly for being our\n... now I live about Toyota teacher from\nIs Dr phil Donahue Lynn\nDelivered year's principle of super high school that\nServed as a teacher coach\nYeah Dr Don human\nEntering his level gears principle of super high school\nServed as a teacher coach assistant press one press\nIn Louisiana and ate pie in Alabama\nYou're saving bachelor horse degree from southeast Louisiana Nineteen eighty four master\nOf education versus southern Mississippi is ideal for education experiences agree at the university\nMain outstanding graduate education is a wonderful thing that Dr\nGoogle agreeing to hold their first ever\nAnd I think Dr phil Donahue was on\nAnd leading that possible possibility [noise]\nDown here in his is a wide Holly members that clear Alabama very proud of their daughter Jennifer son Jeffrey\nThe Don ... and the Hoover buccaneers will take a break come back with some more power to the state to their body you're listening to the best in high school football [noise]\n\nCongratulations to our Limbaugh\nTeachers of the week each Limbaugh Toyota teacher we invited to my family and I looked on ... what are we going to live on Toyota nature of the ... were you can get a ... year on an automated okay I'm just driving Limbaugh Memorial Day and on any of the friendly salespeople Montoya\nTo dial horse horse in the morning talk after these messages and you're listening to marry me and I you know\n[noise]\nThe ...\nIf you're looking for a new car issue be mini van truck or ... and they assume I'm ready to wrap up you'll know where we will lower the bar when it comes to white says\nYou need a new\nOne do\nDeal with Joe\nYou know there's\nKnees pull the\nLocated just south west of downtown Birmingham on ice with fifty nine drive a little and save a lot when it comes to the best score prices in town\nHow low ... will they go by yourself\nYou\nKnow when\n\n[noise]\nAlright boats you will find a better place to buy an automobile new new or used\nThe Limbaugh Toyota right there on our twenty fifty nine right just not just a little bit out of the way a out of town ... a a gym Limbaugh started the Chevrolet businesses that for the Limbaugh family over there Bruce took it over made in the Toyota ... to decide on course their son I'm\nAbsolutely and let's get a fight on that Thompson a trust of the game on goodness\nLove as like the reader and we're sorry for your forty nine that your bread I wrote a quick break come back with more your phone calls were comments you're listening to the best in high school football [noise]\n\n\n[noise] do you want to do enough him Goldman W why do you are you in Birmingham W two three Seventy K Birmingham W DJ singing to Birmingham\n[noise]\nIf you're looking for a new car issue be mini van ... on they assume down to Limbaugh Toyota where we will lower the bar when it comes to prices\nYou do need a new\nOne you should go you know mom made your do your job\nMaki ...\nAmong the there'd be a good job\nAnd Maki ... right\nYou know there is I could ride when you walk us\nThe new book that the mom\nLocated just south west of downtown Birmingham on I when he fifty nine drive a little and save a lot when it comes to the core prizes in town in limbo Yoda how low we will be go let him\nWhen it comes to heating and air systems plumbing gas in standby generator for both residential and commercial customers\nGo with the name you know wouldn't recognize you and you and service has been serving the Birmingham metro area since Nineteen fifty a family owned and operated now for sixty years due in service company will service and install all makes models of eating an air systems\nHow about automatic standby generator mounted brought graduate Joe's Brett ... is the third generation family owner to carry on the un tradition or tradition that takes pride in his service in its elation\nCalled Joes a brass wore a Jew in service that next time you need a heating and air system plumbing or gas repair new standby generator for your home or officer company\nDue in his own called twenty four hours a day seven days a week three hundred and sixty five days a year remember this number area code\nTwo oh five five nine five for eight for six five nine five for eight\nFor six get you in touch with the Birmingham based service company that always is available that doesn't ride the first time and has done it right for years remember there's no extra charge for overtime or emergency service gee you are in the service company doing service\nWhen the staff of half Patrick promotions attends our annual award banquet each guy will have on a tuxedo for Mr birch formal way or\nIf you want to look at a fast for that formal occasion the leader in Birmingham as Mr Burch with seven locations in town there's Mr bart's near you with thousands of to see those in stock Mr birds has the largest selection in Alabama if it's ... it's often a once in a lifetime occasion don't leave your party wedding or celebration the chance\nMr Burns was rated best specialist for quality to see those service same day and out of town services Mr merchant specialty first tuxedo pat Patrick every war was one of Mr merchant ... he's worn a number of to see those thin and all of them is diverge tuxedos gave him to fit in confidence that you have to have when you're looking for best\nWe're close to celebrate in there's no comparison just ask pat Petra he's wearing and Mr birds sexy do this weekend tuxedos for sale\nOr ran the leader in Birmingham and all of Alabama his Mr birds\nEver get that sinking feeling when you turn on your computer and nothing happens\nOr interns own but won't move into windows maybe\nYou have viruses or maybe you've been hacked\nYour hard drive is giving you a warning about eminent failure will do for you call the oldest most trusted computer store in Birmingham since Nineteen eighty seven bar computers\nCan feel all your needs that they are\nFar to computers can feel all a guarantee sales were hairs upgrade parts of the accessories Mac repairs to a war you wrote in Birmingham, Alabama the phone number to call seven eight three that eight zero zero this area code two oh five seven eight\nThe road in Birmingham, Alabama the phone number to call seven eight three [noise] not a zero zero this area code two oh five seven eight three nine eight zero zero\nFor computers Elsie column today [noise]\n\n\nOnce again all hope mount an eagle reports are being brought to each week by Doug Philips\nAnd former oh mount an eagle son Bruce Philips and their gray stone tire an automotive repair and Maine to shop on highway two eighty keep your car running the way you should and cared for by the professional what the right parts in service located in the British gray stone area on highway two eighty\nGray stone tire an automotive what they eat all Evan Bayh's and professionals will give you the peace of mind and all repairs and auto service at reasonable prices locally owned and operated by the Philips family combined see some time gray stone tire an automotive\nCounty commissioner Joe Knight wants to thank you for allowing him to serve this past term although Jefferson County commission as commissioner of district for\nJoe Nye hope she'll allowed him to continue when it comes to commissioners you'll want to make sure that your commissioner served your district and not special interests do not has proven that he puts his district before himself\nRemember the Knight in shining armor would you vote this November the ... re elect Joe night for county commissioner district for\nGym to me as a candidate for the Alabama house of representatives and ... and Hoover he supports an education lottery to provide funding for public schools we must prepare our students for twenty first century jobs\nAlabama is at or near the bottom and almost every category that counts however we our number one in corruption of our elected officials\nGM will restore your trust in our officials and make your voice heard November the ... vote Jim Toomey Alabama house of representatives to find out more about gee I'm at this Web site\nGo to W. W. W. gym to me for Alabama house dot com\n[noise]\nI welcome back in and everybody's going brasher Gary Ingram my men women you served you'd have you back you know maybe you'll more let's go it classes up the joy that's only going to say about that he's dressed in good swag\nThen we got to have all been gay are we going to represent\nAre we going to talk of college football ... doing right now being believe this now three games up on me and I said to the beach and this year I'm going to give a football is are pulling for Manchester United three games a bone in Wyoming throwing millions more of a tactician\nMay get a new ... got ...\nOur own little home we might as well here it's rather well that's right and regain [laughter] very very true really good quick school board one down a Ricky a hangover and come to you in a second and a\n... don't you remember who she called it a night for nine one one nine four one one zero when when I was messed it up a second time doing this year none were one what happens when you wrote one one here's the thing\nYou get a few months after that number about thirty seven thousand times so how do you miss out on around I have no idea what's going to give us the big wars going on right now Glenn okay over with or almost over with the two\nSeven thousand times so how do you miss out on around I have no idea what's going to give us the big scores going on right now Glenn okay over with or almost over with the two biggest games that everybody's been talking about are over now\nTrust ville comes back ah for being twenty eight points down to win sixty three are sees me sorry Thompson comes back from being twenty eight points down to win sixty three to forty nine\nThat was just an incredible comeback or in some crazy things happen at the end of that game if any of your watch it on TV\nJamie curly who is going in the show is going to call in and hopefully talk to us a little bit 'cause I Know he's a huge man he's in Tennessee night but I guarantee that happy about that you got to be pretty incensed about one crazy on side chick that happened or we'll talk about that if you will but those were lost more scores\nA Hoover as we said or one thirty one to seven over mountain broken so they fill up the region championship after all of a sudden I Am\n... playing and open our plan for nothing but pride tonight both of them are limited from the playoffs the vest ab one twenty eight to fourteen also plying just for private Spain Park uh he'll be Tuscaloosa County forty two to Twenty one\nHomeless went down to jail last night in a heartbreaking loss for homeless but a huge win for the jail program they win Eighteen to ten and when a six day region five\nPelham and hell Leno we're fighting for the for spot in six say region five tonight uh with pat him winning thirty seven to seven which kind of a surprising score there\nLast night and five a region for Broward would a defeated Fairfield eliminating Fairfield from the playoffs securing number two for ... twenty six to zero\nDot org most tougher his records in Alabama high school football history [noise]\nPeople who live in the EU we tend to pleasant grove area no when it comes to pharmaceutical neither one rule neighbor to count on and that's what we'll do pharmacy\nThe world and families care for people in pleasant grove in town for generations now but I still keep the down home touch and most of the time to remember what your drugstore needs are before you even ask them\nAnd will do pharmacy keeps up with the latest and Medicare and insurance regulations to see that you get the best buy on your medical supplies located in Newtown road called ... shatters the wilderness for nine one\nTo a zero five and have your order ready when you get there welded pharmacies ready when you are when you think of high school sports single pleasant grove Barnes and the golden gophers when you think of your family drugstores think of the one and only welding pharmacy\nFor over fifty years in the heart of downtown Huey town welding pharmacy [noise]\nLoves the sights and sounds of football I'm sure mark ... remember justice safety is important in the field is equally important when you drive\nThe consequences of driving distracted far worse than a miss bill go or miss tackle\nEnjoy the game but please don't drive in Texas said\nThis message was brought to lead into everything can share his\nOwner ... Roy invites you to try a village imbibe or in style shop\nLocated on the yellow Seattle bad red house shopping center on a highway in Hoover they build a gentle offers dry cuts and wet cuts walking through welcome at a point let's veiled all\nEight to two Ninety six Twenty one is whatever to call for an appointment eight to two nine six to one mostly banned but some women used a village in the ... and former owner limb and make sure you say a special hello to Susan who's got ... years where's that again\nThe village and barber in style shop open Tuesdays through Saturday affordable price it you'll be wanting to whistle the Andy Griffith theme song when you come out village and Barbara styling [noise]\nWinning is important but how we win is equal importance the book of glasses chapter three in the New Testament of the Bible says whatever you do whether in word or D do it all in the name of the Lord Jesus giving thanks to God the father threw him\nA balanced athlete knows that there is power not only in defeating their opponent but in doing so with character and integrity and abiding by process that earned the respect of those they compete against\nBecause it is fun and exciting to win the game but there is true peace and content to know that we've done it the right way\nMy name is Nathan current and I'm the pastor at the church Ross Bridge\nDanny car has been a prosecutor for Seventeen years current\nWe've done it the right way my name is nice and corn and I'm a pastor at the church Ross Bridge\nDanny car has been a prosecutor for Seventeen years currently Danny is the chief deputy district attorney a local product of the Birmingham School system car attended Alabama State on a basketball scholarship before serving as interim district attorney\nDanny ... believes the da's most important role is wash right regardless of race religion or economics\nVoted one of the top one hundred lawyers Danny car is recognized as one of the top forty influential miles in Jefferson County and has received a labor union endorsements and the apple pie endorsement from a large number one\nWhen it comes time to vote this November six think of the candidate that is supported by people you know and care about vote Janey car\n[noise]\nI Walk back into the school board show we got wind brush your women green Gary Ingram and I am Jamie you're more\nNow we absolutely love talking football we're going to talking a lot to nine months ago to break we have a a very special event going on to moral my next guest room and talk a little bit about it so let's bring her in now it's um more Moore Roberts welcome in\nHey thank you thank you ... agenda you'll more and um you have a very special going on tomorrow morning but I'm very happy to be a part of\nTalk about this event were the idea came about and just give us ...\nOkay great thank you so tomorrow I'm starting to ten thirty we're having a chili cook off the late Robert foundation and the angel warriors foundation or partnering for\nOur first hilly cook off to raise money for children and so the Elaine Robert foundation um we are about spreading awareness\nFor childhood cancer and we are about raising money for childhood cancer research and the angel warriors foundation supports um the a special needs children in and around the ... area so we're having our first\nA chili cook off we're hoping to make this an age where all of it and it's at West with that this church\nStarting at ten thirty we have entertainment side that day which is a great ... and we've got an inflatable for kids and some other kids' game say you'll come out and taste the chili and um\nYou know just listen to the music and have a good time while you're supporting the late Robert foundation and the warriors foundation\nIt sounds like it's going to be a blast ... war when did you come up with this idea when do you think are decided that she really wanted the drug is\n[noise] well I'm at so I I wanted to try it last year was kind of you know we kicked it around and um thought about it and then we just went for this year so\nUm this is you know the first one I'm sure we're going to learn a lot of things that I think that if people will come out give it a you know give it a try I think it's a big fun um it's fall whether it's getting cooler where I'm Kelly is comfort food and I just you know if people will come out I think they'll have a great time\nWe're I'm I'm I'm excited to be a part of it and I'm looking forward to it and hopefully we can get a lot of people out there and really really ... and make a difference for such a great ...\nThank you I appreciate it yet the U.S Fifteen dollars at the gate we open at ten thirty and we're going to give out trophies and there's the people's choice award so everybody that comes in and vote for their uh\nAnnette ten thirty and we're going to give out trophies and there's the people's choice award so everybody that comes in and that that their favorite hilly it will get out of first place a second place award and people's choice award\nWith Laura I'm looking forward to meeting tomorrow and uh it's it's going to regret event any bottle words for let you go\n[noise] um yeah I Want to give a shout at ten Thompson warriors\nBeyond way ah how 'bout that come back you watch the game\nYes we're watching the game so Elaine wintertime since she was a junior at all that's all the way and the tennis player ... um say or fix supporters of the line Robert foundation and the angel warriors foundation that we were watching it and it was just a great great victory\nWell Thompson got it got your weaken started the correct way you're going to finish it off the more\nMore that's all right I'll look for it and they will solve you Tamar nice guy like\nLord Roberts big advance in morals that again it's it's an honor for me to be a part of that and to see is going to be a great time so come on out it's a\nIt's a ten dollars I was actually two dollars advance fifty dollars a door kids under ... GOOD Music local band the day's going to be playing and so we have left so I'm excited about it and uh once again what a great cause\nNow she said Thompson and that might be the best comebacks of the will of the year when you were sitting here in Studio you've been watching the whole game I watch to talk about the ... though you were bothered by that\nThat are ... did you know that at one point in this game there were three the three Tedisco within\nTwenty two seconds off the clock\nRight I mean that was no decent [laughter] I was wondering I when I Want to be friends is off when I was there was a crazy series\nOf events a ton of all around for a touchdown then on the on the ensuing kick off a there was a fumble\nThat it was recovered in one plane touched down and then on the ensuing kicked off and he goes nine nine yards\n[laughter] twenty two seconds off the clock three touchdowns but anyway yes an incredible combat combat from twenty eight points down to win that game sixty three to forty nine but yes there was one point in the game there were six minutes to go in the game when are you at trust will tied it up I think at that point it was forty two to forty two they\nAre still six minutes to go he would trust about three time house and they all inside kicked it who didn't get it gave Tom's on the ball on the fifty yard line to places that are Thompson a takes it in and never looks back I mean do you have to really good offers to really good quarterback going at it\nI Want to ... Alabama fans feel you've got to future quarterbacks going Alabama well we've been talking about that we got another quarterback controversy here we go to transfer and that's what I Want to know\nAnd with and we just crazy region\nYeah the best regional football yes agreed yeah oh yeah I've got this while this is going on pet Patrick who does joined us in the lead and walked in the door and he was do actually broadcasting the Hoover the other big game mountain road game Hoover handily\nWas able to uh take care of mountain Brooke so again I started to show off with the more things change\nThe more they stay the same ... is your region champs now about\nFour or five weeks ago\nWe were going over the rankings and we were going to ruin regions and who didn't belong and who would we both kind of said you know it's an interesting match up here we were trying to figure out if there was anybody can be a rain we first get for a second we\nUm had a couple of gray scars I didn't get as you already so they can he was around the ... century mark\nLooked really solid a you know the human county parents showed up in the second half a pitch to shut out in the second ... and you turn ended up putting it away thirty one to Thirteen um it was just it was daylight and dark for first half a second\nAnd you know the gas all the wine a day pounded the ball looked really solid and just it just really took over the game late start\nAnd birth order so they they came out and played like the huge than we've seen\nYou know in the last you know five six week it was it was it was a relief but frankly it's the kind of showing they needed going into the playoffs you know we got this last a regular season game with prior was gonna obviously a test their five eight power but you know it was\nIt was a a a tough competitive game\nThat you can just you know they showed their moxie and they took over and all the way and that's what they really needed so\nIt's a tough competitive game that you can just you know they showed their moxie and they took over and pulled away and that's what they really needed so you know you got to Phoenix and bruises heal up and you know getting ready to try to make a little playoff run and we want we want to be playing football for Thanksgiving\nWhat's the what was the final on him\nAnd we end up being thirty one to Thirteen um you know the we had a had a couple of ... and that's I asked and you know the what it means on a couple of time I think you know you had both of them are in the second half and I'm like I said he just really look\nHe looks solid or read the boy you know get things together found him a couple of times also I'm a nice pass\nAnd a huge amount just like I said they they showed a lot of activity and a lot of fight in that\nSecond half and you know they reached down and found something 'cause I taught a course man sell this week he was a little worried\nYou know because everyone was it wasn't hung over ... with us much of a you know it wasn't one of those things where it was a pride hung over but it was more that market or just tough football team and everyone was just beat up tight uh you know it's been a long couple of weeks and\nIt was a lot of intensity that game you were there you felt the environment and it was just tired\nFootball team coming into the night and they went out and did they did a yo ... work on the road\nIn a poll Bryant team that it was their homecoming and they were looking to try to get into the playoffs and I actually stopped often got something to drink on the way home and some of the hill crafts players were or very thankful that uh we actually put them in the playoffs tonight\nThat is good you know when I'm going to say this too we talked about you talk about the ... and she talked about ... and\nTony ... and everything that is the opposite if you didn't but what's interesting it gets down to ... years since the opening week September fourteenth in the back part of the season the beef is if you ... to give up more than fourteen points and again that that some Providence\nNot since those guys from Hillcrest\nYeah so I mean you're looking at what two one two three four six games in a row of not giving up more than fourteen points that's impressive in the defense and you know everything's going to hit their stride and you're you're getting ready for a playoff run that like you said who was going to be deep deep and well\nWe know Jamie ... travel and that's what we really like you know um we we should have some ... hole playoff\nGame obviously but but they that's the kind of thing that travels works well the playoffs\nAnd writes ... solid and we were concerned going into the year about what was going to do the back end was questionable we've had a lot of nice I suspect there but they have really wasn't the turning point in that same Jordan or every picked on all you know back there was a gorgeous diving interception\nOkay and then making a name for themselves and secondary and and and what has to entertain this a lot of points in the Balkans quickly becoming no sense\nWith John before I let you go you know we've got to talk about the sponsor taste good you don't go ... who takes care of the town of ... become a silver included is I'm In Houston and every day who takes care of us all our pharmaceutical needs\nAnd we did it cause I going to tell you what for sixteen years those folks opens pharmacy they have been there to take care of everyone\nHere you're a prescription needs not only that all our guys we're stopping in there this week at night packing pain because we're a little ... little feet up after that after that what the blade on negative race that we had to uh\nHad to go by welcome to get some stuff for the whole you know what they had it they took care of him they told us when we made his hometown former saying there's no one compares to well we all love 'em into town and I tell you what they are a huge ... you know and I I don't think it'll be the same without him\nBut one compares to well we all love 'em into town and I tell you what they are a huge cannot institution you know and I I don't think it'll be the same without him you know we really appreciate those guys have been spot on the ... and uh you know they take care of the ... are supposed to their sponsorship and for the services they provide\nWell John thanks so much looking forward to talking to you next week and are looking for to the one I Will definitely makes a huge sample of game this year\nYeah next week we can talk about that bracket Italy Italy we will have it out will and Freddie\nWere fight we're probably going to have you all at coming into the Gulf are down there for the first week but that subject to change a little bit so or\nEven go out and you'll be able to make that hopefully you'll be able to make that game\nI think John we're pretty sure that All right John eggs right they're telling\nYou that possibly right now hosting you follow in the first round the playoffs and that's not a hundred percent said we've got to talk of the reasons they got there'll be ... next week but you fall it'd be interesting game so that's the first round opening match will go and go ...\nWhich should be a lot of fun there\nAre Oman we outline what I've been making this guy wait along the guy to be honest with you I make I'm making them weight\nBut he's not here and you got to show up your job you got to show up the broadcast when the red light comes zone\nJamie curly you don't miss the show even if you got to skydiving via satellite from Tennessee where you go you got to find a way to show up 'cause that's what I Would do Jamie as a broadcast well award winning me with me when I Would do\nYeah well you know you're so humble\nAnd over [laughter] very humble what's going to listen to how do you uh you're in Tennessee but how how was the a ... game housing how's it affected you don't mind what did you think about that on science gigs Jamie\nLet me say this was so boring I think I fell asleep [laughter] why women's curling it was so good\nOh my [laughter] [laughter] it's funny you say that you know Glenn was actually almost Seventy nine women's curling Olympic things is that yes this was that in Georgia or Notre Dame and that was David ... a transfer to Georgia the one who\nGot I'll tell you what ESPN could not have scripted a better game or for this game tonight and and to show off the two quarterbacks right\nOh goodness and you know you know nothing was ever said about Alabama\nThat's what it was just you know those skills they were they require you know [laughter] as long as they're saving\nTheir too is there a Jay Lynn hertz is there\nAnd he's in there in August and those are going to\nYou may not have seen that there's a tweet going around of a a ton of Iowa and overdrawn talking on the sideline and someone caps and the man there must be a language barrier between those two [laughter]\nYeah they're like me because there was a lot of folks in that place was packed [laughter] it was a loud\nI'm watching it on TV I got up here was listening to it on the way up here my my oldest son is actually in a performance up here he goes to school up here we're up here see his play so I have to give up my football a knife or some say is being work so I'm\nA anyway I'm happy to be up here with him but it was a great ball game in which case I mean it started off it was a nightmare for Thompson because here's Thompson coming in you know their averaging ... associates average about three hundred\nA three hundred thirty yards passing off into the game about a hundred and fifty two hundred and eighty are rushing per game a Tom says averages Thirteen points per game given up on deep sense why he would average given up Seventeen point some days in a in this was unbelievable one hundred quail\nPoints scored in the ballgame twelve hundred yards off the interest or this this is like you know Oklahoma State versus\nBaylor windows ... [laughter] yeah no there's only like five guys playing D than\nThe whole night so it was one of those things that was a nightmare for Thompson open up I mean it was twenty eight to nothing\nYeah there's only like five guys playing defense\nThe whole night so it was one of those things that was a nightmare for Thompson open up I mean it was twenty eight to nothing before they knew what was going on and this is where he really reached down you know as a coach and I've been on both sides of this when you when you're up big early\nAnd you know your partly in shock on both shot junior partly in you know complete just a anger if you're that losing team and something's got to fire something's got to change and I'll I'll tell you one is twenty eight to nothing I was thinking they there is going to get really bad or about to get really good and I looked over my wife and I told her I said\nYou watch a sitcom she's going to eat their way back in here um and and I found out the day that you know to uh uh his little brother is a two Leah and then the Hawaiian culture if you add Ala age at the end of a name that means a little brother\nSo he really is a little too uh um and he performed it tonight because he put on a show starting in that second quarter\nWhere he was just not going to be denied and it was an awful passing if you watch a lot of the game he was wise in his own reads a he would hand it off and he keep it he'd hand it off and keep it and he would get up field and they weren't killing them with\nBig major plays it was just five yards paid yards twelve yardstick thing and it got back in the game you know thirty five to fourteen at halftime and in in in Thompson comes out in the third quarter in scores on their first to position so boom boom is thirty five twenty eight\nYou kind of gets in a slump and you cannot believe this acute had four yards of all the ants in the in the third quarter\nYeah when you when you actually that actually the Saddam keeping that looked at you're absolutely right I mean do you think you know she would as good as they are often as we get at the same is do you think this this is the deepest is not a ball that's going to be there and do that's going to be the real issue going forward a deeper wells\nFor you or twenty nine ... [noise] she is she okay we've got [noise]\nAlabama crew she got to be a\nGood thirty four Fifteen and this last one we go to the slogan defeat forty seven seven\n\nDo you want to do them comb W why do you um Birmingham\nW two three Seventy to Birmingham W do things to to Birmingham [noise]\n\nEver get that sinking feeling when you turn on your computer and nothing cameras\nOr it turns ... boot into windows maybe you have viruses or maybe you've been hacked\nYour hard drive your warning about him on a failure\nWill do three calls the oldest most trusted computer store in Birmingham\nSince Nineteen eighty seven for computers\nCan feel all your best bet they are far computers can feel all guarantee sales were hairs upgrade or success reasons back repairs to war you wrote in Birmingham, Alabama the phone number to call seven eight three Matt zero zero this area code two oh five\nSeven eight three nine eight zero zero\nComputers do we'll see column today [noise]\n\nYour office executive altered the leader and small business office space in office support services get the name your office located in a legal point corporate Dr use your office for your headquarters with a professional staff to receive your cold and assist you with the ministry the needs have your own probably the office with bone\nAnd Internet service maybe your own private post office box heavier meetings in a stylish office area where the conference room for gathers\nYes your office gives you the high profile but you need to get to the next level at a fraction of the calls remember what is time to go to work go to your office\nWhen you call on your favorite heating and air conditioning company for supplies and installations make sure they use temp star and keep bright heating and cooling products distributed by Birmingham on Arnold brown metals and supply company Arnold brown metals and supply has been serving Birmingham\nAnd Jefferson and surrounding counties since Nineteen forty six owned by Barry brown at bart brown both graduates of mountain broke high school the Arnold brown company is the major distributor of temp star and keep bright heating and cooling products in this area\nAsk for them by name would you replace your heating and cooling unit when you do you can have confidence knowing a couple of Spartans are there to make your temp star and or keep right heating and cooling unit of winter that's Arnold brown metals and supply [noise]\nIf you're looking for a new car issue be many band trucker ... on\nThat's Arnold brown metals and supply [noise]\nIf you're looking for a new car issue be many band trucker ... they assumed down to Limbaugh Toyota where we will lower the bar when it comes to prices\nGave me a new although [noise]\nThey're the ones who should do them on may help with Joe [noise] hockey ...\nWhen you want to\nDo both the bomb\nLocated just south west of downtown Birmingham on I ... when he fifty nine drive a little and save a lot when it comes to the core prices in town in limbo Yoda how low we will be go Len ...\nBeer man or a warning on my garage broke up tax resolution services company do you owe the IRS over twenty thousand dollars or ... years of an filed returns or navy or being audited if so\nYou have a serious problem we can help there is a solution in fact we've been helping people resolve the IRS problems for Fifteen Years it's all we do all day long is the Irish Scottish paycheck or had they just empty your bank account\nAs the iris filed the lean on your property\nOr maybe you won't payroll taxes\nApril fifteenth is right around the corner are you going to lead to put another nail in your tax confident these problems aren't going away on their own unique to deal with them right now before they get worse IRS problems I have a way of ruining all aspects of your life you need to call eight eight eight four five six five oh three oh\nThat's eight eight eight four five six fifty thirty the call is free\nConsultation is free call eight eight eight four five six five oh three all tax resolution dot com man or a woman\nOnce again all open mouth an eagle reports are being brought you each week by Doug Philips\nAnd former oh mount an ego son Bruce Philips and their gray stone tire an automotive repair and Maine to shop on highway two eighty keep your car running the way you should and cared for by the professional what the right parts in service located in the end of British gravestone area on highway two eighty\nGray stone tyrant automotive what they eat eleven base and professionals will give you the peace of mind and all repairs and all the service at reasonable prices locally owned and operated by the Philips family combined see some time gray stone tire an\nAutomotive David ... have been representing seriously injured people in Alabama for over fifty years if you need a lawyer to be like a member of your family and get you the best possible result from your injury case called this telephone number area code two oh five\nThree two to three six six three that's three two to three six six three\nNo representations made by the quality of a legal services to be performed is greater than the quality of legal services performed by other lawyers\nAll right we'll come in every body to the school board job we got a a lot of people in Studio let's go ahead and reduce everybody's shabby Glenn brasher who younger every week you know her name's finest so we've got pat Patrick a living legend ... great thing is with us presidents\nDo you have a good brasher who you know your every week he's never named finest we'd God pat Patrick a living legend women green racing is with this president when you're not doing his show on HBO and we got the magician Mr Gary Ingram I'm Jim Gilmore and great to have you going to be with you to midnight we're going to turn to college when we do that though\nWe have a special guest and I know he's going to be happy 'cause uh\nOn national television he just said these teams that one of the best comebacks you could possibly have its head coach of the Thompson warriors coach Martin Freeman coach Freeman's Jamie Gilmore welcome in the broadcast [noise] again how you doing buddy I'm doing great coach ... well I Would ask you how you do but I Know you're doing pretty well right now [noise]\nI I lost her second I couldn't hear you\nI'm gonna say coach I Know I Would ask you how you do but I Know you're doing really well after that great comeback win tonight\nOh man we're doing bright so blessed God's good and that will give you an far as it goes all this and not\nGo to a when you were down when your team was twenty eight now what did you say what was the mindset what was your team ... what we are talking about because it seemed like you said you know what we're still in the U.S we're going to find a way to win this game\nI mean I I don't I don't remember anything being said about school I was trying to save up learning and they're grown up and down so fast you keep up with it so you know they got out of the ... ... can nothing pretty quick and\nThen I got to be Twenty one and not have flashback to watch that chance one towel down to one and that's what came back once ... once I thought you know\nYou know guys will then down this road before so I Know you just gotta keep battling it got to be twenty eight and\nOur goal was to try to find some way to get to justice and so when we got to keep testing out of the house and we'll get ... investment\nYou know China while it it costs to come back and\nWe got the ball would come to drive down we'll cut said in the bathroom and and so you know we'll just fortunate that we were able to put some drop together and we got a couple of holes on the fence but no\nTraining really went up and down the field in art\nShows what is it like having to watch film and get ready for this huge trust will obviously then getting on the field and having to try to match up and stop this off minutes 'cause they really are juggernaut once they get going\nWell they are and and the thing is you can simulate here they're running back and they walk out and and of course Paul does a great job to stand in the pocket on the ball around and you know um such great character on the bottom rung of some ... they get by guys like his bart's on his like\nYou know I'm I just know the ball around here and they're running back really good uh both or were you know all all their minds that there's going to the ball you got a lot of tackles and not that good a lot of the new to the way the\nI welcome back in everybody college football we're going to turn now to the greatest game of all time besides how school for both ... and we're putting\nWe're putting I Am I say I am I Am putting the games together during the commercial break and we're going to pick a lot of good game I got to pick because I was in the late last week well I'll tell you one that ... when the warm during the break we can do this we can do a little collage we've got another two sets of commercial breaks to go through the night so we're going to have to be really quick and make it happen during this time for him\nBut I I'm right now here's the thing ... okay I'm going to tell you that make sure he's on the brasher but you know what women yeah what I've always stayed on the show\nI've always said this is it doesn't matter who wins or loses and he's back you know\nIt doesn't matter what matters is happening I\nThink we have a good time and we try and we play hard and everybody gets the participation\nTrophy now I'd always honest and fair you've never said he was always Italy's\nNot me know what else I don't care about when they're done area and everything you know for me if I've ever been up on somebody I've always been very respectful I didn't ... jet though jab that in ...\nSo you sound like ... we have the truth and I just\nRemember last year when he was impressed by said he went I was in ... oh yeah yeah I had for last for an adult you know I don't I don't remember that and I don't know I mean I don't remember that but anyway so I put the games together but not to be fair where neither one of us are doing and you know ... and I was thinking about some\n... I'm doing okay owned the between two fans podcast the best is he broadcast out there right now right now I'm doing horribly I'm In third place and getting lapped we pick three games a week before this read this the ... and then three and he's getting ... now and in this we I think I was\nThe third place and getting a laptop we picked three games a week we're spread just three three and he's getting lamb ... now and in this we I think I was one in six to ... you were\nToo and yeah I was two and five or something but I was five and one it was a lot of time you get into ... man you've been number one for a while but we had both of us had a pretty decent last week I was five and when you were foreign to it it it's tough um I the Oregon pick is what I regret that I wrote the organ would come and get it done I really thought they'd go in the Washington so all the pirate man swinging getting done\nBut uh you know that was tough but it's okay\nA lot of football left and so we get the games writing\nBefore we I'm In a position where I can start to play it safe now that to do my ... but here's here's do you pick always pick before\nMe so I can just go opposite catch ... yeah you got to get that much [laughter] maybe that's what I did last year I'd go whatever Glen when I go in and then ... and the question I beat mark and that's one of the reasons mark has not been allowed to come back to the studio he last ...\nLast year to me and that's the one hand I might as well but anyway a real quick and suck out all of them are because I Know that we got un studios will go out on first I'm not a big surprise I said this on a podcast too it's funny what am I what am I great pleasures in life\nIs not just watching all of them went on a Saturday is watching possibly pulling for the team that Alabama's playing right that Saturday and they're used to be a time where there was a good chance or a possibility or at least a shot the ban would lose to a tendency maybe there\nWas a shot it's been twelve years and as I sit down and watch the ... the game to see me which I think the great game I like that series and I just sit down and watch it and I tweeted out you know I Want to say this once a year Rocky Top\nAs I sit down and watch it I go in with some people in the room and said you know this is going to be an absolutely boring game CBS what are you thinking Alabama's good cover if they don't cover they're still gonna win by twenty seven twenty when there was no doubt in my mind that Alabama would win this game and so that's what made me feel better because I really really wanted to see that much\nI enjoy swimming I and I can understand that because I I relate to what you're saying completely\nI enjoy watching the ... games and cheering for the opponent the force you to as much as I enjoy watching the Alabama games you know and understand what you're where you're coming in ... and if the people that go with my pool for I pull for Auburn moving they're not all about you know that yeah that would that but that's all we all did but see here's the ... and ... and more power to you if you do that\nEven if you want to think you're a better person that's on but the thing is when the robbery wouldn't be the robber me\nPersonally I don't actually pool against Alabama because half of the team they play I don't like anyway means you gotta leave ... I mean but the other team did they play I don't like either I don't I'm not tendency fan I've never like to know that women by no means if I got a smoky teacher yeah you know I'm not going to Iraq but I mean let's see I I never thought they would be competitive because you had a tendency team that\nBeat all been in the last minute feel go against the ban are between those terrible you know there's still a little weight I was going to be a good game may\nSoon as he is a garbage or in Auburn secondary may gr into like Joe Montana or on the eighty twenty balls but speaking as the only Alabama\nFan in the rain right now yes yes uh watching Tennessee totally just get demolished and wiped off the four of their own stadium like that was it was very exciting especially as I was marching on my speed these chips\nDuring the [laughter] the legend or the you know I had a friend of mine that is a huge fan and he ate since the in fact he would go to the tell you the tendency is to be at least favorite during the\nStreak of seven that you're getting beat up to what he does he goes back and he watches Peyton Manning leading the band or a round goes back and watch his Philip former talking he goes out and there's all that\nAnd I've always thought that that to me was just the most amazing thing was that's happening\nYeah and I've had a lot of good times and they own stadium I mean\nKnow there's all that and I've always thought that that to me was just the most amazing thing was that's happening yeah and I've had a lot of good times and they own stadium I Me and my father used to go every other year and I've had a lot of bad times up there\nA but it is a fun trip to go up there I Wish I had gone this time that I had a friend that went and they said they were Tennessee fans or leave it on the second quarter man and the owners and there was no [laughter] but uh I mean it's not\nIt's not like it's not like it used to be not Tennessee Alabama ... who are going to say that and it was Alabama's great uh I don't\nI don't see anybody to what's healthy I just you got to be able to score forty five fifty points and your defense is going to be\nWith you got to be that would be if it's got to be good now this year I could say the album has a terrific oh since I've never seen are going to be friends they're very suspect especially on the back and\nYeah All right um I agree with that and I I think the deep\nAnd people were getting on the defensive even still good they're they're good but they're just not great 'cause I mean you've you've seen the Alabama defunding just completely go in there\nIn Washington I mean that was no hope they're not ... but they're not going to give up forty some of the points to anybody no no we're always going to school now so they're not going to give a forward to some point but that LSU game is going to be very is to come in as you can put pressure on the court or not to throw the ball better than any quarter boxing on the ruin those Akron me\nBut if you take a couple of years he's not a drew ... quarterback All right before we cannot take too many\nBefore we start talking or some arm football school on one cowboy cowboy welcome in to the\nBroadcast Jeremy how you doing buddy I'm good man how are you doing\nGood yes so uh that's awfully era get anti over cycle loses\nWeight right [laughter] that's what I'm banking but they'll find a way [laughter] figure it out so what's so what's as you were about to go into the talk about ... minutes last week or last week you know ... what do you what do you think you ought to give your opinion at all but I Know well I didn't\nI I didn't see much last week I was doing it on par camp I work for the ... of baseball so I didn't see much of that already probably found a little bit a little bit of little ... little bit of a confidence there they they got the way that helps them out or it's probably sells about ... miles on but I think uh next week in as a tough game and uh\nHey I'll never comes down to a they'll they'll kicking out ... game because they get kicked off those\nYeah but don't forget what you got ... you wouldn't be able to seven points on before that even matter is that I didn't ... this year there's you know what I'm going to say this though I'm In ... that I think the U.S in the short term it's kind of ruined Carlson a little bit of confidence is gone\nYou can't keep chicken ... missed on that's at her kid but ah but I think I think we've got all of a swagger they got am next week three and a half white favorite I think I got a shot next week to meet them and get a job at five and a avoid the Birmingham bull\n[laughter] well I mean yeah right now ... good right yeah melt all music city bowl at all take that right now so let me ask you a question of quick before we were ever gets bragging the second question or are you pro Gus are you saying keep him or you saw what are you that actually\nKeep it well enough to go on to him if you look at pet dies or six years is famous glasses if pat that was in this era they probably want to get rid of him but then it's going to do any better and he's two and three against a saving he's he's played pretty Logan say but so I mean what are you gonna do he'll he'll get\nWell they ask you this do to okay you say keep him so we're having the same conversation next year as to what what what are you going to say I mean and I mean actually this is what you're having the same conversation because here's the thing regardless of all that that's great that's that's that's fine but if you're having the same conversation because you're a good chance\nThat you're going to have the same conversation next year and they're sitting at the same record and what what's going to be the what ... what are you going to say after\nSeventy or Seventy there's probably something to look at but six years right now you get a given country the president leads has an idiot I mean you can't give that guy\nWhat ... what are you going to say after Seventy or Seventy is probably something to look at but six years right now you got to get in touch with the president leaders and idiot I mean you can't give that got nearly two million dollar buyout though is that ... that's ... that's ... that's I guess my fault\nThat we agree with that is a terrible contract is terrible contracted listening about guess for the longest time I was I was on board was you're not a ... of support and you've got to support your coach but the thing is an absolutely this is my biggest issue\nThe question is okay so let's just say for ... your best running back is booby you agree with that\nYeah absolutely movie that what it takes seven games to see that um you're off the line if not very good it's not gonna give you the opportunity to run the ball and run the ... like you want to you should see that in August she should see it in June while a great give him so on\nOh I went to I Want to practice in August and believe me is the right guy I mean I don't know why it takes them so long to figure out what running back they're gonna use what receivers are going to use it just it's frustrating but after they show you got to keep him you're not going to anybody else during dust but next year if it's the same ball game you might want to look a different direction\nTammy sects and him on the road I mean the state also another layoff favored in this game which is quite I ... I mean it will eat fish smelly there's something going on here I don't know what it is\nPeople want to talk about girls not mentioned his quarterback what about when do ... I mean the guy can ruin the ... but he can throw the ball\nAnd he's the only office they've got no that's the problem yeah but I mean how many turkey you run your big quarter\nBats are well relatively against a good defense in ... ... ... what is you know if they were to play any kind of game whatsoever yes they would have one that you know with the way you when you're on the field for Seventeen out where you are having to you just\nCan't keep running your quarterback but I'm going to go without him I just don't think a ... can get it\nDone All right what are they going to guess what Mr Bissett is averaging points per game in there for us to see games nine point seven points and for SEC gay\nNasty front seven though nasty ... they do have an incredible defensive right there in their defense is only one in the SEC\nRanked in the top ten total defense but Jim ... got take saying I'm running a had a schedule what scares the crap out of me as an Alabama fan um but I'm going to take CNN although the cow bells at night is going to make this may be a closer game than we think this is an interesting game for me\nI think is the state's good enough to make ... and have to throw the football ... he's been good but he's been not ... he's been good I like trivial Williams though to run the ball if Trayvon gets a hundred and twenty yards they win this game I think you will\nI like am I going to cover you could hurt this is my as the pick of the week on the between two fans ... I I Know you always have to it but don't discount those those bales at night I'm telling you know it's a tough\nEnvironment man it it is I just my problems you're stadium is if you have to bring cowbell oh I agree totally then I got into that yeah I agree with you totally and I've been to ...\nAnd the studios bigger there's more to do [laughter]\nI agree with you totally it it's crap but it is effective though but once they get it off as a line the line they have to something else I Do like jumbo Fisher and I think they the spinning the ten million\nBucks am has more money than the country of Canada is right and that's you know sit on her show or the year jumbo out there with all that money and all that Texas recruiting scares me and it scares me more that there apparently had a schedule would they be brings to things there he the first one coach\nYeah but he has a structure and the discipline that Kevin someone did not have you know Kevin someone was loses the goose he didn't I mean he players will do what they want to he was also promising everybody this in the liver and that's one to five star caliber look at marine now what he's doing Oklahoma and it's going to be playing professional baseball writer\nBy the way Boston in uh LA one to one in the Bible the eleventh\nUh we've got about halfway watching this really watch the games are a lot of our listeners are too high a price of chicken go Dodgers All right so you're ab Texas El Paso are a big game of the week I had several people\nUm tell me I we had some tickets at work for a kid so we gave it should have gone away and yeah we should have went shutdown trust me I Would have went after that after all when I was looking for some fun\nTo do some pretty magic environment down there too I was good and the comeback was great and we were attacked we're both talking about it yeah I Wish I could have went for sure but I'm All right here's a question for yeah ... biggest when ever and you just are bigger than the LSU in\nI think it is the one that was it matters yeah that was a big win but in the grand scheme of things also mentally what to do this one of the division for you\nThat was it matters yeah that was a big win but in the grand scheme of things all the mentally\nWhat to do it is one of the division for you and now you could apply for coverage here say title and you may be coming back what this is the second or third year\nSecond nearby that conducting your battery me dead for being there for being SMU without and and I was on my short list a coach or to replace goes mother bill clocks on it I don't know if he's ready for that is a big jump but yeah yeah he's a good job yeah okay so you're able to get it done to fix up as a younger would embrace got millions and scribbling\nThe blazers they probably got it includes can cruise control into that conference championship game maybe middle Tennessee state is a tough game for them\nBut there's no way they're going to go out there in ... so\nI'm so yes give me a B six al Paso the team that beat Kentucky\nThat with you know the first in and start off of African Americans you tip is that it ... you get me on that I think you're talking about basketball right right yeah yeah yeah yes yes you're right you got the other business maybe they did the outcast what I thought so that makes me kind of want to pick them up and and I've been given you updates on two different sports I mean give you updates on your stats\nThey're still tempted total day in the country can you believe that wow they're still tent you might be ... coming in coming until last week they had given up fourteen points like three games would even with a whole season's they're not coach I think works at a fantastic I ask coaching their their third\nAnd defensive third down conversions and the country you're on the conference of the country and they get an opportunity to this new stadium\nIs going to be special I think he's got a chance at ... degrees legion field of it is it's just a word dinosaur but it's it's also huge\nWe don't have as you would you get half of shut off yeah thirty five thousand people the new stadium is going to make it would be the right to have already five thousand last week you put them in that stadium you know smart and they put him in time but by the way I Want them to move to the high school state championship game to that new stadium when that happens\nI great right we've got we're gonna take quick right when it come back we got two games left to pick stay tuned you're listening to Patrick best in high school football\nPeople who live in the Yucatan of pleasant grove area no when it comes to pharmaceutical nice there's one rule neighbor to count on and that's welding pharmacy the world and families care for people in pleasant grove in town for generations now but I still keep the down home touch and most of the time to remember what your drugstore needs are before\nYou even ask them and will do pharmacy keeps up with the latest the Medicare and insurance regulations will see that you get the best buy on your medical supplies located in Newtown road called down to shatter Steve welding it for nine one\nTwo eight zero five and have your order ready when did you get their world and pharmacies reading when you are when you think of highschool sport single plus groves Barnes and the golden go first\nWhen you think of your family drugstores think of the one and only welding pharmacy\nFor over fifty years in the heart of downtown Huey town welding pharmacy\nThese shores looked till the leader and Alabama high school football history a H. S. S. H. S. dot org brought about a high school team record coaching records pet historical civic\n... David Parker fully motives you just a ruse his website and make comments if you sold design [noise]\nIf you play football for any high school of Alabama at any time at any level and a year more than likely you are the record is listed\nAs David Parker's Alabama high school football Historical Society website again that's eight H. S. S. A. T. S. dot for the most comprehensive records in Alabama high school football history [noise]\nWhen it comes to heating and air systems plumbing gas in standby generator for both residential and commercial customers\nGo with a name you know wouldn't recognize Jew and Human Services been serving the Birmingham metro area since Nineteen fifty a family owned and operated now for sixty years doing service company will service and install all ...\nServing the Birmingham metro area since Nineteen fifty a family owned and operated now for sixty years due in service company will service and install all makes models of eating an air systems\nHow about automatic standby generators mountain Brooke graduate Joe's Brad ... is the third generation family owner to carry on the un tradition a tradition that takes pride in the service and it's all Asian\nCalled Joes a brass war at human service the next time you need a heating and air system plumbing or gas repair new standby generator for your home or officer company\nDue in his own call twenty four hours a day seven days a week three hundred and sixty five days a year remember this number area code\nTwo oh five five nine five for eight for six five nine five for eight\nFor six gets you in touch with the Birmingham based service company that always is available that does it right the first time and has done it ride for years remember there's no extra charge for overtime or emergency service gee you are in the service company\nDoing service when your car or truck or a motor vehicle needs toying it's not a very fun time who do you call let me recommend a Birmingham based company who's been caring for local record needs for over forty years\nWill recur by far is the leader into a needs serving seventeenth police departments in municipalities with over one hundred towing units on hand to take care of you right away when you need to move your vehicle rolls\nWill record can move it lifted toilet or haul it with over water dedicated employees will recur sets the bar for totally needs in Birmingham and surrounding municipalities call two oh five\nFour two seven five oh for for for your record needs\nWhere there's a will there's a way for two seven five oh for for makes the toll you experience of a bad occurrence better\nWill recur the twenty four health club has multiple locations to serve you\nDowntown Birmingham Gardendale trust for the twenty four using Hoover and the twenty four in Huntsville for those who are listening to us up there the twenty four the clubs in their facilities are truly open twenty four hours a day three hundred and sixty five days a year with\nThe fattest professional equipment you could want treadmills elliptical machine weight machines free weights multiple TV screens for your pleasure you work out\nThis is the place twenty four hours a day seven days a week three hundred and sixty five days a year go to your nearest twenty four eat health club and get your membership in membership key and realize now that you have time to work out when your schedule permit that's the twenty four health club affordable and professional\nGet in shape today like you want to be at twenty four eight it's easy", "station": "WYDE", "city": "Birmingham"}