{"month": "10", "state": "CA", "station": "KFMB", "content": "\n[noise] me tell you about it that we talk about it I Am seven sixty talk and breaking news\nIn the I guess\nYou just received your highest electric bill ever servers delivers has this illusion go solar removing American style Brazil or is it said he goes local a veteran no silver with Ruben goes for\nVery limited time see six thousand dollars to leave your independence from the electric company goals for ... hours\nA day five Reno and eighty five sixty three eighty five three nine eighty five sixty three fourths of Brazil numbers dot com\nOverexposed or something which is what she looks like a completely deal the U.S will be like when I Do I follow the great time to change your old windows\nAre you tired of exposing your retirement to stock market rate how would you like to participate in stock market gains but never stock market ... doing Thomas year for the retirement income radio show on Saturday and two PM you can also called Thomas year now for your free customized retirement income kids in one hundred and Fifteen paid retirement\nIncome book for for Greek Greek date for for ... three seven to three three feet were born three three states\nFor for three three seven to three three\nIf you have an accident probably somebody else's fault but if you do remember mark motors body shop that's M. A. R. C. K. Mart motors body shop and they're going to fix you up\nRight to make you happy it's what they do what they've been doing now for nearly Seventy years mark motors I may are CK mark motors dot com\nMark Larson here for mark motors they're the best nobody better free shuttle service for you they work with a talent of artists to make your vehicle beautiful and make it look from a better than it did before the accident so that gives you peace of mind and don't just take your insurance companies word for it if they say yeah we got some guy outback or auto body repair\nNo they can't insist on that you have the legal right to choose where your cars repaired after an accident you choose the best as we do\nIf if if something happens just relax called mark motors their hotline to happiness six one nine four four zero zero for three six six one nine four four zero zero for three six mark motors\nShop online anytime it's mark motors and the R. C. K. Mart motors dot com\nIs fine is Seventy five years to see 'em ... with us and the San Diego's talk\nBomber arrested two oh one on AM seven sixty I'm sure I'm sure that that's one of the stories we're following first a check on your traffic\nJust reported one sixty three freeway north bound just before part three car accident and everything right shoulder but to look out for traffic to start to crowd in that area\nAs one sixty three north bound just before park and on like Fifteen north on your community they'll north day getting rid of a stall this report sponsored by LA tax relief the oh the IRS ten thousand dollars or more LA tax relief can help for free consultation call ally tax relief in eighty nine eighty Eighteen eighty five or go to LA tax relief dot com [noise]\nWe're learning more about the arrest of a Florida Man accused of sending more than a dozen pipe bombs to prominent Democrats and critics of President Trump CBS News Peter King reports\nFBI Director Chris Wray says a fingerprint found on a package that the California congresswoman Maxine Waters positively matched us either say oc racist because if they opt criminal history in Florida there's also a possible DNA connection between samples collected\nFor pieces of two different IDs mailed in separate envelopes which looked like a match for DNA collected during previous arrest\nSay our faces at least five charges races there could be more if he's convicted on those five he faces forty eight years in prison Peter King CBS News\nA scene of terrorist strikes to school in China more than a dozen children were targeted in a nice attack CBS News Gwen Bumgarner report\nHere like here I was doing kindergarten in southwest China where children as young as we stood in shock with tests on their bodies believe than\nThirty nine year old woman showed up at the nursery school in the city of Tong king and started slashing students\nOn the playground teachers jumped in the dumps a woman and believes took her into custody for children were taken to the hospital there conditions from Maine I Know [noise]\nSimilar night the tax has hit China is here in April\nMan killed nine students at a middle school and northwest China in June to children were stabbed to death outside of primary school in Shanghai\n[noise] the motive for friday's attack it I Know Chinese police will continue to get Saddam gardeners CBS News [noise]\nThe department of homeland security secretary Kirstjen Nielsen is paying a visit to the border today she's in Calexico to view the first completed section of the border wall she also gave a news conference where she spoke about homeland security commitment to border security\nWhen asked how the military plans to stop the migrants Nielsen said there'll be apprehended and that there's NO PLAN for troops to shoot it them each\nCounty residents are continuing their battle to keep a proposed sand mining project for moving\nCounty residents are continuing their battle to keep a proposed sand mining project from moving forward and seven sixties damned new has more\nOpponents of the ... valley San mind say the project would destroy hundreds of acres of land near lake side as well as diminished property values damage the environment and cause air pollution as trucks hall ...\nAir over here and they're planning ... in the world\nI think the missions and all the colony the air is just going to get worse with all the extra traffic lakeside\nResidents also say the soil could contain valley fever spores and then excavating the same could release them and get people sick for am seven sixty I'm dean noon\nNow here's news H carry lane with your weekend micro climate forecast\nA lot since ... are really going to warm up today and not warming trend will continue through tomorrow\nThat's caused making their way on outta here a lot sooner than what we've seen the last couple of days as far as temperatures today along the coast or in the upper seventies inland valleys some spots could reach close to eighty nine degrees framed seven fifty I knew they carry lane right now it's\nFair in Seventy three downtown well it's the closest you can get to an elimination game without it actually being an elimination game tonight up at Dodger Stadium a loss would leave LA down three games to none and no one has ever come back from a three oh deficit in the world series\nThere's more bikes later next am seven sixty talk and breaking new\nThink you guys sabotage here we go [laughter] might have been Mike\n[laughter]\nSo there must be wrong what what did you have on your spouse for for the by item\nThat you're so uh yeah pretty much I just got an email notification here it says a hundred and thirty dollars sales confirms sale price hundred and twenty dollars\nRight I'm going to a hundred ... I just see twenty dollars and like I Would be happy if I were you looking for more than that wait a second wife and into bigger win and then the ... teacher just to just under\nTwenty bucks where was the run up where was I had a ones are where are you know you said you talked about friends coming in deep at the end I was young and as we've seen this last week watchers really didn't come through you know I'm really unfortunate for my today I ate watchers\nOther there was a bit for twenty bucks instead of the great star or wherever the other seven people what's up with that were were ya I forget what else you're\nDoing it to a ... I Hope my song grass down right All right that's fine [laughter] isn't how your you know this is\nI Hope you enjoy it while you allow a\nGreater [laughter] dinner at the theater\nBecause it's on twenty bucks All right miles with the parents are doing a lot\nDon't go\nSelling it to you [laughter]\n\nTwenty my still a pretty good when\nYeah All right but I don't but I was a pointed out to go from one okay 'cause I didn't really want to part\nWith which is the spirit of the game over all that we don't really\nWant to part with ... I see that original Mike Slater show T shirt from twelve years ago about first radio station twenty bucks\n\nI also find a back and said we're joined by games supposed to go to like ... [laughter]\nActually used to be so fun now all the way that vintage ... [laughter] so that was my mom's so that I don't care who's the um okay so this is the final or\nIncome book for for three three states I think for for ... three seven to three three eight four four three eight three states\nFor for three three seven to three three\nIf you have an accident probably somebody else's fault but if you do remember mark motors body shop that's M. A. R. C. K. Mart motors body shop and they're going to fix you up\nRight to make you happy it's what they do what they've been doing now for nearly Seventy years mark motors I may are CK mark motors dot com mark Larson here for mark motors they're the best nobody better free shuttle service for you\nThey work with a talent of artists to make your vehicle beautiful and make it look from a better than it did before the accident so that gives you a peace of mind and don't just take your insurance companies weren't forward if they say yeah we got some guy out back for auto body repair\nNow they can't insist on that you have the legal right to choose where your cars repaired after an accident you choose the best as we do\nYeah if if if something happens just relax called mark motors their hotline to happiness six one nine four four zero zero for three six six one nine four four zero zero for three six mark motors\nBody shop online anytime it's mark motors and they are C. K. Mart motors dot com\nBusiness needs fast secure networks to be efficient and profitable detail can help you keeping your data secure your business safe and connected\nWe've been helping San Diego businesses since Nineteen eighty three days you can provide expert solutions for networks voiceover IP wireless in video security we can help you make the right choices for your business\nCalled detail it eight five eight five seven one thirty one hundred\nWhether you're networking four or four hundred systems we have the solutions the answers and knowledge to make it happen we have expert icy consultants have experience in helping local business schools state and government with experts solutions such as voiceover IT systems from Cisco why and secure professional video surveillance solutions using top quality components\nDetails here thirty five years strong we have the experience to do it right and we would love the opportunity to help you and provide you with the right solution\nGive us a call and talk to the details corporate sales consultancy eight five eight five seven one thirty one hundred or email us his business at\nDetails as dot com da T E L. S. Y. S. dot com\nImagine Pecker parked filled to capacity then imagine you have the microphone you have the chance to tell them all why they should do business with you you don't have to imagine anymore\nSeven sixty KF MBA um reaches hundreds of thousands of listeners each week that's right I said hundreds of thousands of potential customers that could be yours if they only knew about you how could that impact your bottom line why do they return month after month well it works several our clients have been with us for decades\n... audience sports are sponsors enabling us to continue to bring you live and local programming\nThat matters to San Diego and\nHere's the best part it's more affordable than you might think\nOur experience team can tailor a campaign around almost anyone's budget\nTo put the power of am seven sixty can be to work for you today email Brian Busta at the bus to at ... dot com that's B. B. U. S. T. A. J. F. M. B. A. dot com and put the tower seven sixty cave and be am to work for you\nRight arm left leg or both like above the waves\nOr to my left hand [noise] lost my legs in Iraq [noise]\nThese nine eleven veterans or just a few of the heroes we surveyed homes for our troops\nFor nearly two thousand severely injured veterans everyday life has become filled with\nBarriers so we build specially adapted homes with features like wheelchair access rolling showers\nAnd pull down cabinet that allow them to function independently\nFocus on recovery and\nThis life changing gift of freedom is provided mortgage free to these veterans thanks to our donors and supporters\nBut we need you to join us too in completing this important mission\nPlease visit each year foe team usa dot org\nAnd rebuild lives\nFinale miles is in ... by a six\nBucks or ... miles one way I see you All right this is for two hours how are you guys hear a rogue out on a item here you know listen there's a new thing\nThis spot fives and these huge tubes and these uh what's the other one Pandora but I'm old school like throw back\nI'd like to bring a record player everywhere I go\nAnd that offering this week this is a portable record player here scientists do wearing wherever you want to know you just walk in and you just plug in and you got it there for my favorite show listeners\nJust said this week exclusive I'm throwing in this album one in my face down another Twenty one that album top album for many many months ... and everything I've met his album okay Cosby record virus is fully functioning\nFully functioning I got the power wire the whole thing you have your okay\n... and and really hasn't been used very often I got to I you know what I remember playing this at miles his house\nAnd I went out and I bought it I own a while\nAnd I own that record player okay can you tell us about how that is very nice we use it every day is a very nice item [noise]\nStrong\nShowing from a Mr him all here today right to save gas mileage decided to finally put an actual you know if you've been blocked by here's a fifty cent among some guy in DC\nI got a bunch of papers leftover without like inside [laughter]\nHe comes with the actual item okay All right why give us a lot of the big I have another five ... plus record I well I don't want to see it on ... on you but my father passed away he had one I had one so consolidated record player so is this Larry symbols record player or they could actually see\nYa [laughter] [laughter] oh I\nDo my my girlfriend and I were talking about what we should bring in I was like I really don't know and we finally came upon this I Wish her idea was to go we have of like a old rocks from when the house burned down just outside like there's just all burned dry probably sell to bring it in in February ... house\nBurned down idea that's critical might've heard okay so we have Larry handles\nRecord player wow okay very good miles [noise]\nShould I start with the Arab but if you order now so let me do they let me just\nSay oh it's a package deal oh always always\nTired and I've got to see this as the first things\nOkay because of the if you order now right here we have a Roku too\nHave you here that if you got to have a real talent you on that one was that have you ever played it [laughter]\nWhat I call it doesn't matter sure none ... TV re I was a three D. T. V. isn't really that average [laughter]\n[laughter]\nI don't have like a couple of lines out it actually I have a story about that TV I offered his own uh Craig's list for twenty bucks is broken how these lines down so we had to buy to do so I we\nWere like out of town and I had to go and we couldn't so I said I Do a little social experiment I'm going to put a put my truck on the street by like a like a private he kind of street lights out like a main thoroughfare a and I'm going to put the in the back of the truck and we tell the guy leave twenty bucks and the gap Ken yeah thing\nLike if you're going to do it or not right I'd say no way [laughter]\nDo you think the guy was going to be like no not yet didn't leave that must have\nTVs golf [laughter]\nWe've gotten do twenty well maybe a bit on this okay okay so strict too okay complete with regard to oh they've gone through Donald Carty ... down there\nThis could be yours may be a great gift for a grandchild here for years maybe going to give herself treat yourself\nPlayStation three [laughter] oh wow they say\nThey're just so hot with the electronic yeah this is a whole bundle but there's three yet a roller drives diluted controller [laughter] storage until you're ... games or you can play with friends on the Internet\nOkay in different locations would your controller he's ... now why do a lot okay\nI thought it was a PlayStation ... [laughter]\n\nI was walking in today but it's a place where did\nSomeone in this building was going to sell something like that was about a guy so I got a Roku to wow ... two and three days at a PlayStation ... numbers go wow that's fantastic what a starting my\nNose or ... I Want to go for over a hundred dollars wow okay that's the going rate for PlayStation threes right around ... position for [laughter] watch I'll take a hundred bucks her three daughters and a half how about we still wouldn't be the contest until we go well\nGentleman it's finally time [laughter]\nCan take all those wonderful prize is home\n[laughter]\n\nGrandpa as beautiful\nVideo later surface showing an officer throwing bell to the ground while hand topped the lawsuit alleges the officer used excessive force violated belt civil rights and committed assault and battery that officer is still on administrative leave\nFor a um seven sixty I'm Dan noon\nConstruction crews have made it unusual discovery in Georgia CBS News Jim ... report\nSara Lee one thousand teeth have been found inside the wall of a former dentist office in Valdosta, Georgia they were discovered by a construction crew renovating the second floor of a downtown building researchers say it was constructed Nineteen hundred and its first attendant was a dentist named Clarence wedding said\nThe building later ... another dentist until at least Nineteen thirty teeth I've also been faulted the walls a former dentist office in Greensboro and Carol to in Georgia Jim ...\nWho said carry lane with your weekend micro climate forecast\nA lack of sunshine are really going to warm up today and not warming time they'll continue through tomorrow that's caused making their way on outta here a lot sooner than what we've seen the last couple of days as far as temperatures today along the coast or an upper seventies inland valleys some spots could reach close to eighty nine degrees\nFrames and fix the I knew they carry lane\nBut now it's sunny and eighty seven and alcohol on the world series resumes tonight with game three at Dodger Stadium the red Sox lead the series two games to none Rick Porcello guess start for the Sox Walker Beulah for LA Mike Slater's coming I Am seven sixty talking breaking news\nBy Monday Mornings Armstrong you get a show will have everything we need to know about the guy send it all the bombs all over America here's the latest right\nNow it's much later on AM seven sixty talking breaking new virus finally made it giving away a car\nPosition from them or are we doing what we're doing for the lord if we do it for man one thing the Bible doesn't say you don't get anything ... whatever you get you got [noise] that's it that's all you're going to get\nTo do Jeremiah or is there going fine thank you\nI've to Dr David during my uh experiences last week man share them with you real quick\nOr went to I spoke at a pro life pregnancy center\nA and three tables of the banquet war\nWere filled with members\nOf the ... mountain south St campus very they were very excited to be very proud members\nOf shot amount and South Bay so I wanted to give us a great\nAnd then I was at an event last weekend and a young man came up to me [noise] thirties or something and he said my grandfather Ninety four year old grandfather recently started listening to talk to David during my on the radio and\nHe and I had been able to bond and connect over\nOver your sermons on your radio broadcast or in the final times of his life and he just wanted me to pass on to you or how much he appreciates the time that has been it was met with his grandpa\nOh great is that that is wonderful thanks for sharing that\nYou're welcome he's over in Ohio the grand by as an easier obviously um and they can connect over the word you pretty cool [noise] [noise] yeah\nSo in the past that you're with a surveys on last week so I mean how can you tell when you're doing a good thing\nVersus doing a good thing\nPlease God and for the glory of gun how do you know\n[noise] well [noise] you know I think that's the big challenge for all of us as I said on Sundays sometimes you look back over the history of your life and you ask yourself have I ever die that anything truly am totally for God without any of me involved in it and\nSo I mean that's that's the thing I think the biologist says whatsoever you do do it all to the glory of God to the rest of your ability to serve him and I think how you can tell here's\nHere's here's a good a good little test if you're not doing it for the price of men you won't be upset when you don't get it\n[noise] Ah yes\nIsn't that interesting to think that way\nYes you know if\nI have people that I've known people in our church people that I work with\nYou know if they don't get a pat on the back when they do something I'm now that doesn't mean we shouldn't have be you know supportive of our people and complimentary and grateful and always certainly but\nSo somebody once said to me how do you know if you're really a service while you know if you're serving by how you act when somebody treat you like one\n[laughter] oh\nSo how do you know if you're doing something for God enough for the price of Ben by how you act when you do it and you don't get the price of man\n[noise] Oh hi that's going to take some reflection and uh yeah well\nGood yeah maybe something to think about during your commercial\nBread [laughter] absolutely um so are you excited for the judgment seat of Christ\n[noise] you know I think we all have a sense a certain sense of\nI'm all\nAbout it I I got to say this I'm not afraid of it okay I'm not in not in terror of it\nBut I'm sure that what I stand before the lord had the judgment she'd done he reviews my life as a believer that are going to be some things I Wish I had done differently or things that I Wish I had\nDone that I didn't do you know is that what is that old saying it oh lord forgive us for the things we've done that we ought to have done the things we ought to have done that we did um you know all\nAll of that is part of it I I think the most important thing for me I'm Mike is this\nWe don't just become Christians and then go into a sleeper mode and then we go to heaven work or to be where it could Be Sober and and what you have a war to live our lives with a sense of\nMonitoring what we do so that we we stay where we ought to stay in don't drift which is so easy to do you were to hold ourselves accountable you know the Bible says if we judge ourselves we will not be judged isn't that that's a wonderful passage that's a judgment hardly anybody ever talks about\nWhat does that mean if we judge ourselves so self for our own\nBusiness if if we see things that we're doing the way that we know we shouldn't do what we're doing the wrong way and we correct that we judge it will never have to reach us for it\n... as opposed to just being ignorant about it and just the dollar is knowing it and\nJust letting it go I mean just just a living your life in such a way that you don't you know you you just say that I'm going to heaven and the rest of it doesn't count\nAs a way I just wait out the clock and keep doing whatever I was before I got saved yeah and that's not going to have to wonder\nAbout the the genuineness of that but but I Know people like that\nHave to be a new person right now a lot of districts your size really good I'm On a cruise everyone to go last week it goes down and out or\nOr listen to last week's serving in the prairie fire analogy a as has been a big change in my life I've thought about that every day since then um [noise] is really good I Love that visual it's a powerful visual um\nDo you think about when you go to the go to the website ... not All right uh what do we have coming up this week so [laughter]\nWell this week I'm going to begin the teaching of the book of Philippines [laughter] I'm gonna teach through the entire book of flip over these next few weeks\nWe're going to end up\nAt Christmas Time and the second chapter which is the incarnation chapter and this week I'm going to talk about how\n[noise] community is so critical to us as it was with Paul I haven't been studying the book flip eons for a long time and it's my favorite book in the Bible and I'm In the process of trying to memorize it I don't want to give you any reports\nOn how I'm doing what I'm worried at all [laughter]\nYeah anyway it's a it's a great book it's the book of joy seems to me we could all handled a little joy right now I don't think that's right um\nHow many times in your years there have you ... and and I asked that because how do you approach it differently or ... or my son\nAt the first time Thirty years ago and I think I've preached on at once Twenty years ago but I haven't I haven't really reached on it in Twenty years\nOh wow okay so what is new again in in a lot of ways yes it is interesting and\nYou know all the things that you go through and that you learn and your experience between the time when you first studied it now the interesting thing is the text doesn't change but your understanding of it changes and your application of a chair or life changes and\nSame thing is the text doesn't change but your understanding of it changes and your application of what your own life changes and\nSo I'm I'm pretty thrilled about the opportunity to do this very funny it's a it's a shorter book so you can do it in a reasonable amount of time shot like Rome ones that I spent forty five weeks teaching them this is this\nIs a short book and we can do it but it's so practical and I'm ... I Believe it was a book that Paul wrote to his favorite church ... so I Can't prove that but I have this feeling as I read the book the true\n... beautiful okay wanting to wear certain very excited\nFive o'clock on Saturday Night and then nine o'clock and ten thirty or ten forty five on Sunday Morning\nAnd does the website have information about all the different regions that since I gave a shout out to the south bay\n[noise] Ah yes yeah you know when we will give a shout out South Bay this weekend will will do something that is a great church does it got a great pasture yep those people are engaged in the community and uh I'm so proud of our South Bay congregation they're just really a basic", "show_name": "no_show", "year": "2018", "city": "San Diego", "day": "26"}