{"month": "10", "state": "CA", "station": "KFMB", "content": "There's no way that a normal person you were I could figure out and navigate that entire process and the Social Security administration is going to go out of their way to help you with us this is why I recommend David Epstein and Bradley why they have a free Social Security seminar coming up on Tuesday October twenty third or Wednesday\nOctober twenty fourth at six thirty in scripture and I'm going to be at the one on Wednesday have you can make either I'd love to see their\nDecisions little decision little differences here they could get you a hundred thousand dollars or more and lifetime benefits eight five eight five six four eighty thirty six to RSVP Paris sandwiches will be served she'll come under five eight five six four eighty thirty six David Epstein and Bradley white\nIf you plan on buying or selling your home listen to this important message from rex there is no longer any reason to pay six percent to sell your home introducing rex rex sells homes for the lowest the in the industry to ... percent\nTotal saving consumers thousands of dollars per transaction we were actually get a full service team back my technology they don't market homes to wait traditional agents do refuses big data and machine learning to attract hundreds of\nQualified buyers directly to your home\nThe moment he goes on the market and wrecked charges only two percent total not the six percent commission your local broker expects\nGet started now by calling eight three three rex home that's a three three R. E. X. home rex can also help you buy a home you're licensed rex agent Lorraine showings negotiate offers sky due to escrow and even get your pre qualified for a mortgage at the lowest available rate rex is with you every\nStep of the way to speak with a rich representative call now and a three three rex home that's a three three R. E. X. home C. A. L. D. already licensed zero one nine seven six zero one zero\nAmerica's finest city Seventy five years the seven than be San Diego's talking\nHurricane Michael his two o'clock\nOn AM seven sixty I'm Jim sharp ... that's\nOf the stories we're following first to check on\nTrack crashing mission valley a little bit earlier one sixty three freeway sent them for the freeway interchange it looks like a now final through stages\nAnd the traffic could still be a pinch extra slow they're they're just know removing a and in ... some still can be traffic starting to build ... east between ocean view hills Parkland britannia boulevard this report sponsored by ...\nGet your flu shot today at Walgreens receive a coupon during the tendency to reward on your next purchase a thirty dollars or more rewards evidence future purchase vaccine restrictions apply terms and restrictions fly to hurricane\nMichael's beginning to make landfall on the Florida Panhandle where the storm surge that it's devastating the coastline overnight it strikes into a category for storm life threatening storm surge and one hundred and fifty mile an hour winds are whipping the coast this hour see me as soon as difficult Killian has more\nFor the most part people have heated warnings but some are staying put\nNever been to hurricane before had lots of ... watch them on television which day and said at\nFlorida has deployed at least three thousand National Guard troops search and rescue teams from states as far away as Indiana I'm Pennsylvania are also ready to help once the storm passes\nHumanity's going out and help and who ... who are in the\nMichael is shaping up to be the most powerful hurricane Kent ever hit the Florida Panhandle forecasters date they've never seen anything like it Nicole Gilligan CBS News Panama City Beach Florida\nPope Francis is courting controversy with his latest comments on abortion CBS News Vicki Barker reports\nSomehow calling abortion the moral equivalent of hiring a hitman abortion he sat in a weekly audience devoted to the sanctity of life is not a human rights in the past Pope Francis has echoes Pope John Paul their second in saying women who've had abortions can\nFind forgiveness his words a reminder that terminating pregnancy at any stage remain strongly against Catholic teaching Vicki Barker CBS News\nThe trial continues for a man accused in the shooting death of a woman driving home from church and asking depot news eight Eric Connor has the story\nDo you need the oath tore his junior is facing murder and attempted murder charges fifty five year old Kathryn Kennedy was killed in March twenty Seventeen when she was shot in the head while driving down grand avenue prosecutor said tourists was chasing two rival gang members when he opened fire in the Kennedy had made an extra stop that day putting her indoors is pat\nTourists faces life in prison without the possibility of parole if convicted for am seven sixty I'm new dates Eric\nCountered with cooler weather and the kids in school flu season is not far behind across San Diego city leaders are trying to keep people from getting sick this year news aid Shannon handy is that the central library with what's being done\nThis for any leaders announced they are installing the hair fan of every single library and rec center in the city or county public health officer doctor would explain why so crucial specially falling last year\nLast year three hundred and forty two individuals died\nFrom complications associated with influenza two hundred and fifty five more than the previous year\nThe highest number documented in the county sent to the department began tracking flu related deaths dire\nYou five more than the previous year that's the highest number documented in the county since the department began tracking flu related deaths dire new states had their Myers with your micro climate forecast\nA gorgeous day in ... in San Diego county few clouds out there are lots of sunshine and temperatures very comfortable although cooler than yesterday for most of the county upper sixties and seventies at the beaches today only making it to the loaded mid seventies for the inland valley communities\nWe could see some body drizzle moving tonight through tomorrow morning I named seven sixty I'm is they have their Myers\nRight now it's partly cloudy and Seventy one in Chula Vista the asked texture backed out on the practice field this afternoon gearing up for Friday nights game against air force that S. D. C. C. U. stadium kickoff will be six more my Slater next am seven sixty talking breaking\nUh what we eat a lot of people in the studio we have to we can't have them all\nOn so right there when I was saying is we've had a lot of action in the\nLast hour usually it's just nobody you here staring at each other [laughter] hey we're talking about who does that strike this has been a pretty fun\nAll right um so gentlemen or I've been saying for a while that it will get worse\nYou have been and I've thought about that it's a scary thought yeah I Do you remember what percentage I said where to be raised like ... like one for a temporary time\nIt may be right um [noise] so\n\nDoes I mean I we could start this progression anywhere right but let's do let's say Clarence Thomas was accused of sexual harassment ten years prior to the the moment that he was being confirmed what am I forget the exact opposite right but yeah years ago\nA then we'd have judge Kavanaugh justice Kevin uno accused of something happens thirty six years ago\nIn high school Seventeen at the top okay each week between bacteria do okay do we uh Lucy think it can't get worse\nBecause one of the things we said gosh even if something like this happen in high school like can you have a real conversation like how much can you really hold someone accountable how much can you judge or how to man no team Seventeen years old but you can't just so so I mean that's a conversation that could\nBut we got to get worse right\nWe're going to get worse than that because I said oh it's only gonna get worse sure sow can you get worse than that you might ask\nIs an actual article I thought it was a joke is an actual article\nStephen Miller just you know Stephen Miller\nYou've seen him he's out and like you know Steve Miller who's one of Trump's adviser I'm familiar with John Miller [laughter] he's a great mad don't you dare to hear somebody of a bad\n[laughter] uh\nThis is seen as a scrawny guy mal younger looking\nUsing them here is that what that might have started to go right into I'd like to hear that headline that Steven Miller's third\nGrade teacher now we're talking about here we go he was a loner and aid glue oh yep get them off kick him out he was a loner\nAnd eat glue according to his third grade teacher\n\nSo I'm like ... there's got to be from the Babylon beer onion or so that is a joke like we're not really judging based off of his third grade\nThird grade we was a third grade I get like a jak ever runs for office one day they're going to say I'm a [noise] [noise] just for a second birthday is parents tried to potty train 'em ... wow\nAnd lower risk don't worry about any high pressure sales tactics all the ...\nWe've been helping San Diego businesses since Nineteen eighty three days you can provide expert solutions for networks voiceover I. P. wireless and video security we can help you make the right choices for your business\nCalled detail at eight five eight five seven one thirty one hundred\nWhether you're networking four or four hundred systems we have the solutions the answers and knowledge to make it happen we have expert IT consultants have experience in helping local business schools state and government with experts solutions such as voiceover I. P. systems from Cisco why fi insecure professional video surveillance solutions using top quality components\nDetails here thirty five you're strong we have the experience to do it right and we would love the opportunity to help you and provide you with the right solution\nGive us a call and talk to details corporate sales consultants today eight five eight five seven one thirty one hundred or email us ... business at\n... dot com da T E. L. S. Y. S. dot com\nVisit branch will sleep president of will see Asset Management and also smart ... show on Saturday mornings are you concerned with the ... the market maybe you're not getting the investment returns you would like at will see Asset Management we use a proven strategy for investing that delivers good returns\nAnd lower risk don't worry about any high pressure sales tactics all the office eight five eight five four six what's real sex eight five eight five or six ... you're a free consultation or visit the website smart investing two thousand dot com\nAnd this is my Slater I Want to tell you about my dentist Dr Jeff gray got a million great endorsements I mean this is Susan she says I had a great experience for Dr ... office I'd\nAsk for a high quality honest and professional dentist treatment and I received exactly that Dr ... kept me completely comfortable during my procedure he respected my time and was over the top and making sure I was completely satisfied\nWith my oral care of the staff was knowledgeable and friendly so if you're debating whether to pick this office for your dental care and smiled do not hesitate you will be completely satisfied and then some and then of course has been my experience as well on that Susan\nHer husband is a dentist and she's a dental hygienist and she drove over two hours from pure county just because of the reputation of Dr jak right\nHis staff hundreds of five star reviews on Yelp and all over the place where people are satisfied as I've been six or nine three three seven\nSeven seven zero zero or Jeff gray with an A. D. D. S. dot com\nImagine Pecker parked filled to capacity and imagine you have the microphone you have the chance to tell them all why they should do business with you you don't have to imagine any more\nSeven sixty KF MBA um reaches hundreds of thousands of listeners each week\nThat's right I said hundreds of thousands of potential customers that could be yours if they only knew about you how could that impact your bottom line why do they return month after month well it works several of our clients have been with us for decades ... audience sports are sponsors enabling us to continue to bring you live and local programming\nThat matters to San Diego and\nHere's the best part is more affordable than you might think\nOur experience team can tailor a campaign around almost anyone's budget\nTo put the power of am seven sixty can be to work for you today email Brian Busta at ... at ... dot com that's B. B. U. S. T. A. at ... dot com and puts power seven sixty cave and be am to work for you know\nGoing on over\nOf the San Diego performing arts to grab a taco what's your favorite hosted by levy yeah then listen to them talking seven it's tacos and talk it gets sold\nOut keep listening to weigh up seven sixty so I'll\nThe asset management level you know financial central look managed housing game rooms outdoors\nAnd vibrant water\n[noise]\n\n\n\n\nBrain\nAs you're living in the Senate Eric can no longer be our producer because in second grade [noise] he warned\nUgly sweater to school oh no that was in second grade that was all of high school you you should see the outfits he shows us it's a good point and\nI think I'm guilty now [laughter] yeah [laughter] well how would how can you get worse in third grade third grade teacher coming out against Stephen Miller right in the soil hippies about how that's that's bad\nOr go to Mike here have already Mike hey get my area of good ... the guy I'm speechless about this I really I don't even know what to do with it\nI Am too and it's so frustrating I'm here so we got to remember that it is that the teacher or as zero about Stephen Miller now know intellectually honest adult cares what now productive successful\nAdult [laughter] straight up but it speaks volumes to that teacher then and now that tells me everything I Need to know about that lady\nAnd Iraq right now that that's a very good reminder I appreciate it makes me less ah ah I don't know [noise] uh I I I ... yeah the ... states might appreciate that makes me less concerned about the whole\nThing and and I guess I'm so concerned\nAbout people who would like this article or think it was significant in some ways I'd be concerned about them too but that principal ... yeah that says a lot about this person wow I think the thing I resent so let me see if I can be articulate\nA tells me that there's going to be fewer and fewer\nSafe places to do anything\nFor my kids so I got my kids knowing that like my my kids third grade teacher could one day come back around and shoot my kid down for something that he wants to do as an adult\nWell even if he's running a business what they've been jak one day opened up a pizza shop or something and this teacher right to your point of view I can and first grade he was a real loner eight glue lady\nWhat are you doing how's messed up okay moving up [noise] ah I Believe yesterday in this very segment I Try to do a better job of spreading segments around the three hours a but this is just a coincidence or\nWas it yesterday at the time we talked about the UT and the two ridiculous articles that I wrote yes sadly showed like another one\nA duty is doing there a door spends their endorsements for candidates right\nNow means nothing\nNo one can possibly care about this right like a newspaper endorsement\nOf a robust every newspaper in the country endorsed Hillary Clinton for president I didn't even I don't even know what they do the same I don't know why newspapers do it especially in the era of fake news and and biased accusations everything why don't even do endorsing who who reads them\nWho's influenced by them I guess that I understand maybe groups doing endorsements and and maybe ... influential individuals'\nOf doing a voter guide or endorses like is there a single person in San Diego\nThey don't matter [laughter] it's good for a ... I saw a headline duty\nAbout their endorsements or San Diego Unified School board so I was like okay I'm interested in the school board because I think they're the worst ever\nA so I'm curious about the uh and by the worst ever I mean corrupt and sixty five percent of kids in San Diego and if I Can't read a grade level that's what I mean by worst ever is that fair fair and not gain thank you uh so I'm kind of read the the uh this is short the San Diego Unified School district has been through a ... a few years\nYes the district can claim some academic success with approved test scores and perhaps perhaps the best graduation rate of any large urban district in the nation but it also has its embarrassment and disappointed\nAt this point as well OK UT All right pretty good I'm surprised that this I thought this would be just as\nTall glowing thing about how wonderful the school district is and everything especially cause that um [noise] well what was the opposite\nOf hippies so this third grade teacher wrote a hippie so good Stephen Miller who want to UT a couple months ago or ... or about sending Martin shut mild this is all I Want to use as far as the fluffy ... about sending Martin and how\nShe's so heroic because did you guys know that she broke her arm ... still goes to work you know [laughter]\n\nAnd she's been on the job for was it three years yeah five five five years she's been working there for five years which is pretty big deal really really amazing ... and I'm indicted on her and she goes around and she finds and collect\n'em a\nFortune cookie fortune ... yeah there is something to be said if you follow just a total Bozo like mayor folk singer or this woman while I was learning about all I don't know if you follow it no no no Fulton followed Bob Filner\nAnd often you got any Martin followed Mardi foster now ... it's like oh there was a great by ... being ... that makes sure\nThat everybody is like oh great guy and it's like I don't I mean yeah the record not simple just called Kevin Costner bono na na na listen Kevin Kevin\nKevin or you know that's not true covered [laughter] there you go to bed at ... come on you know these guys you know both on the mission bay\nParts give me out I drove ... miles one day you could be married to one party [laughter] didn't\nMatter of fact there are gathered one time and mother up to him and said hey I'm On the visual ... humidity and fucked or said\nIs the fact is I read said that's where I started out maybe one\nDay you can be mayor [laughter]\nOkay what do you live wire leave from the swamp through miles\nYeah uh the gentleman we had in uh for the warrior foundation freedom station\nI forget how many tiny tiny tiny ah was at a staggering six nine inches tall [laughter]\nAnd when you're a guy like my size around six foot a fun to watch that but I have a when you're on five seven that's pretty darn early on and I can't imagine I Can't do what kind of is this a hit piece does so I Can't imagine you're sitting there\nAnd something swims up to you that's eleven feet long now that I've seen tiny foot nine and I know that look like\nAnd so that's what my basketball and that analogy doesn't work because the basketball ... it's\nA it's a poll so you can't do that with your you have no concept for that so tiny here six nine and and to portion of six night he's tall lanky six nine like a poll he is a enormous massive can barely put to the door six night\nIt was probably as tall as or as wide as Ewan miles side by side does not fat no he wasn't looking over what it's like all proportion all of a man and he\nAnd and the shark and five feet on it yeah and just as crews and in the water to\nYou know what I'm saying he's struggling to make a point valid you\nBarely like sifting is what is it like a human drop all pet or something like this is why in forty miles an hour before the razor sharp teeth [laughter] you know but you know what you do if you encounter a shark is much ... everybody knows\nI'd like to see that they're sort of like Eric as his vision where if you ever want to fly off a cliff and his car she could have been exaggerated tire climb on the roof of his car czar is that you read more kinds of ... which is the land\nTakes later if he's ever on a plate of playing God Forbid terrorists\nBreak the guy's neck I could hold on to the cockpit\nLand the plane as planned [laughter] the driveway so here's the thing that I I visit about if I were in the ocean\nA shark or coming at me and I have such just nerves of steel sure that I'm able to calmly bottom and then\nAs he swimming at ... shirt forty miles now it's just yeah just a little while you are now he doesn't really like knock him out just on this story for ... well I think we do yeah I mean it goes off and just goes back never quite understood the punch\nYou much prefer to kick 'cause now I ... I guess you lay the kids kick a shark in the nose you don't want to get them a ... a lot more than just ridiculous I don't know a shark and it took a shark\nNo I'm not I don't ... up on land young bought out bought them and then I was [laughter] it was like shaking his head like\nWell okay\nSo we do find ya [laughter]\nThis is off when I when I probably know how that's going to happen like the new life really sad\n\nAll all loan sharks are from New York [laughter]\nThey'll lose swimming here to see if we pitch\nNice vacation with the family loop and put some ...\nI thought the guy was a seal what are you going to do\nBut then on top of it but I was a golf ball but it was a guy you live what [laughter] so ... um UT ... coming out a little hard on the on their endorsement\nFor the school board right pretty good right and they said that San Diego school board has had its embarrassments and disappointments very nice\nTo go on here um\nSo a robust starting with super super tender Cindy Martin and the school board members enabling awful behavior a former board member Marty Foster\n... got a nice little shout out we don't need to go do all that the legend actually he didn't go on that list a couple of things are near to the ... you know a leader has a coherent long term strategy for dealing with ballooning pension costs and none has the courage to take on the teachers union by having teachers sharing the cost of their health insurance\nSo we kept beauty like saying that these are things that need to have been pretty cool officials have resisted calls for district only elections that would ensure wider representation so having an independence thoughtful new voice on the board would be of great\nValue so here we go they're going to give us somewhat nonetheless\nThe San Diego union Tribune editorial board endorses incumbents Kevin ... [laughter]\n[laughter]\nWhat kind of the door so that is that like really thoughtful and logical\nShockingly so like here's some here are some actual embarrassments disappointments that we have with the incumbents and they're pretty bad\nRight and then\nGosh it'd be so great to have a thoughtful new voice nonetheless we endorse the old guys\n... let's just through this again [laughter] because\nThat is true and if not I mean who die over there was a whole new to get it a couple of years [noise]\n\nHow do you work with that I've been ... says his whole hour this has been a lease coherent\nOur road on ever done in my entire life yeah but you summon up well not great to be speechless it's the talk show host so I Know it's not advisable I and I rarely am\nI what do you say would they be from the third grade teacher on Stephen Miller and what do you say to UT editorial board who says gosh these two guys are pretty awful but [laughter] you know like to nothing so maybe if the the other candidates are in\nGreat than you do this don't endorse sure which they did have done it yet they didn't do for someone to just the other\nDay yeah I'm under no they win a market for hunter oh today they were very and they were very for like ... you know we do like hunter it's very obvious remember the name out of this number one that I've done this or I don't know what are your own [laughter] yeah I'm always for just fire in a way\n[noise] come on a write\nIn his eyes for the record this is a [laughter] just comes out and get on the law I didn't [laughter] there we go [laughter] better than they used to do All right let's see if this goes better than re electing Kevin buys or typical\nFor um [noise] a person came up to the three of us right after the hunter thing kind of went down yeah and said yeah this camp in a jar he might have a chance especially because he has no baggage oh yeah yeah yeah [laughter]\nAnd we're we ... we don't really want to get in a political ... argument really anyone really so I was\n... we looked at each other or the religious I really like\n[laughter] his dad or ... is grandpa was a Palestinian\nTerrorist who murdered ... eleven Jews and has a hospital named after him in the Palestinian territory for being a heroic murder\nBut no back it was no I don't think I really\nGenuinely don't think that that has anything to do with him right I'm not I'm not sure but\nIn the game of politics it's ...\nYeah I Would you would call that balance it seems like a baggage they like or if you were if you meet with your campaign advisers and they say or do you have any you know explicit photos that are out there that we should know about a third grade teacher who's a political hack and may come back and tell you tell the world that you ... when you were a third grader\nReading on his on anything that could come back and get you and you say no and\nThen a couple of weeks come by and it turns out that your grandpa was a terrorist who murdered Jews about right or your dad was a Soviet killer [laughter]\nSomething you would you want to come up with something\nThat's all [noise]\nNonetheless [laughter] I yeah\n\nWould sit down and then he lives [laughter] so it's been for using Kavanaugh of lying [laughter]\nSlate things because I Am\nYeah\n[laughter]\nFirst of all Trump did say that it gives the national Enquirer as true [laughter] guy for people like that and say well we're asking people were just saying OK responsible not to bring it up the responsible not everybody's been talking about that is the author or did you do it you know if\nWe're asking people were just saying OK it's responsible not to bring it up the response without everybody's been talking about trying to figure out a year to it you know if\nTed Cruz's dad killed ... do you have any ... video while I don't know that we talk about it for three days before the election [laughter] where did that connected me\n[laughter]\nWhat's your nickname for the dog or off\nA dodge and do a garage in donor or the running for power Mawr College Board so we're going to put out of order got here I'm going to work on it as we can\nAnd I'm going to put that right at the top sure but\nPowell our college for the most important ...\nSays whatever you do on average ... ... fake it ... a voter fraud you ... your vote against the Dodgers ... [laughter] the other three people listening now know who the dog or off as yet but it doesn't matter is the most important race the entire city", "show_name": "no_show", "year": "2018", "city": "San Diego", "day": "10"}