{"content": "KBC [noise] roses are\nRed and pilots are blue comes from around go for Swedish day it'll be good\nFor you know your top five reasons to visit my mom do this we are far\nNo fleet or\nCan you give them away\nThe points on your reward Monday to Fifteen and only had three\nAt your chance to win a Mercedes\nHard to say like\nOne reason or other casino resorts\nGarre painting and I'm\nNow\nWe're run to conceal resort as well conveniently located on the tip less than Ninety minutes from wherever you are wrong and good times\nThe online trading academy is the leader and investing education and they can help you generate income for today are socket away for your retirement\nYou attend one of their free three hour classes they'll send you home with to do it yourself invest your kid that's pre loaded with some of their most popular video based investing courses it's a big fake you just for attending classes by the way are inconvenient times in located all over Southern California in the valley the west side Orange County you name it\nIf you've been following the financial news today\nThe stock market has really taken a dive it's because the fed is doing all kinds of things with the interest rates market volatility is real now imagine if you knew when to get out of the market before it falls so you can protect your life savings and also knew when to get back in so you can make money on the upshot\nWell if you want to learn how to create daily weekly or monthly income using the online trading academies patented supply and demand strategy\nAll you have to do is give him a call ... eight eight eight nine nine one trade that eight eight eight nine nine one eight seven to three to attend to get to free passes to their three hour class or you can check everything out for yourself\nIt's a limited time opportunity in seats go fast so called right now eight eight eight nine nine one trade eight eight eight nine nine one trade or visit them online at ... dot com that's OJ class dot com the online training academy\nI don't know how much clear I can make it is but there is only one name to trust if you want to face or neck left without surgery Dr wrestler\nI go there and I put my name on it because I've seen the results Dr wrestler and the team in L. D. I have done for me so I Know that they can do the same for you I wouldn't trust anyone else with my face plain and simple tighter scanner on your face snack even those lines around your mouth or eyes\nL. D. I. is the place\nNow tightening her skin is one thing but that's just the beginning of what else I can do for you how about removing those red and brown spots and blocked you scan or the sun damage from all that California Sun oh and all those unsightly broken blood vessels L. D. I can help the combination of technology at L. D. I. is not available anywhere else in the U.S\nAnd if you or your child is struggling with acne are all Daphne scars just call LD eyeing book you're one hundred percent free consultation total eight hundred six six six thousand eight hundred six six six thousand it's eight hundred six six six thousand or a book on line and get L. D. I. dot com\nHey I'm Andy if you don't know me it's probably because I'm not famous but I did start screaming company called Harris the idea for Harry's came out of a frustrating experience I had buying razor blades\nMost parents were overpriced over designed and out of touch at Harry's our approach is simple here's our secret\nWe make sharp terrible blades and sell them at honest prices for as low as two dollars each we care about quality so much that we do some crazy things like fire world cause German bleed factory obsessing over every detail means we're confident in offering a hundred percent quality guarantee millions of guys have already made the switch to Harry's so thank you if you're one of them\nAnd if you're not we hope you give us a try with the special offer get Harry starter set with a five blade razor waited handle shaved Joe and the travel cover all for just three bucks plus free shipping\nJust go to Harry's dot com and enter for three four three at checkout that's Harry's dot com codes for three four three enjoy\nAll the other day that little voice in my head says he knows why you should have been a little tiny like any hold high to go to a tiny non lemon ... pie banana cream French apple doesn't\nJust tiny nine [noise]\nDown that's what I did because when that little voice in your head the\nCalendars ... delicious home times to go to ... [noise] that little voice in your head saying I now\nSeven Ninety ABC about Julius ... to the day\nYou know this isn't a I was going to go to Rudy rose the first pictures of her\nAs that woman but we talked about that already so I'm going to talk about a couple from Michigan a horrible horrible couple who called nine one one and they said on our babies not responding and the dispatcher said\nUm\nWhat's the condition of the baby and then the man said that as a darn door mail during door now data in the Dardanelles with the father said oh well when the paramedics got there the police then intervened because this baby who's almost one\nWeighed eight\nPounds do you understand that that's what my daughter was adverse almost eight pounds I Hope the guys in prison this is disgusting the judge said this is horrific as it gets the baby was a ... like posture of a child in my opinion the speaks volumes for how long the baby was not cared for\nA forensic pathologist said the girl died from quote malnutrition associated with dehydration\nDue to know let the neglect of adult caregivers yes I'm just saying that they are are in jail right now one more hour coming up on the drive home seven Ninety K. A. B. C. [noise]\nYou could grab a thousand dollars more times\nWhere do I grant here it's so not\nThere for a day on some of the money starts falling from the sky at six and nine with ... with Dr grew in Lawrence with Jillian and John Kades ABC Los Angeles county cumulus station [noise]\nPicturing them in the uh and the TV room you know and you've got your sports up there and then he's watching Wendy Williams and then half the other inmates are irritated that he's watching Wendy Williams and and then and then and then and then and then she starts to speak to him in front of all of his ah cell mate and\nDo you think she's going to show up and talk to him no why not why should why should she talked to a he's a piece a felon he's a rapist what kind of waiting is what she did if she talked about her conversation with Bill ... no she should tape it then those would be those will be through the roof but you're young widow confessed\nYou're dealing with a guy when he before he was caught he thought he was on top of the world told everybody how to do their comedy Eddie Murphy you shouldn't swear Chris Rock you got to do it this way you don't use curse words and now that he's in jail\nI don't think it's calm him down at all well and you got fired one's already got her fired one sets writes\nGot her fired guy ... Bruce Tammy Bruce horrible despicable human he is well the guy was Calvin ... they were asking him a question one at a couple of reporters and one report in particular and he said basically do you know who I Am you're asking me that we\nI read the barest yourself you're going to hang on your career and I could get you fired so he's\nHe's thrown that threat around a lot he's used it he's done good with it uh but now he's behind bars any less than ... you should be able to take criticism that's it like why wouldn't a Wendy's say get a divorce Camille everyone thinks that\nShe's not going to do it well I think real pinion you ding dong I think Camille knew about this for a very long time and I think she was fine with it got to be Bill Cosby's wife on at wow how exciting is that I'm married to the Google Yahoo pervert rapist\nI don't know it was the biggest TV star in the long time right and maybe there's that cache and yes but do you think she knew the extent of it I think you've said she knew ... yes\nYou gave me the new he drugs women and raped them I did a special on Spanish fly\nBut then I had a guy with a suitcase full of cash to pay women off because he was such a cash cow for NBC again ... ... that's\nOne thing I mean I Know my friend David worked at Warner Brothers\nWere constant payoffs to women that got these men would sleep with their wives drugged and raped I'm totally like I'm saying there isn't that is another level yes you could ... the studios don't want\nThey don't want any imbalance they don't want to upset the the the lot so if a guy is one of their big male stars which happened he was the biggest male start at the time and he bought breast implants for his mistress his wife sees the bill at home opens up this doctors bill and sees breast implants and she goes through the roof\nDavid how to get on a plane and fly to BC where the show show was being filmed and they have to ... down or they have to you know there's different ways that they but that that's been done forever\nDon't know that if NBC knew that he was drugging women and sleeping with them that they would have I don't know you\nStill you're of yes yeah you talk to people who work for organizations I Know someone who used to work for the Lakers yeah okay and the Lakers used to take care of a lot of their players\nWith a lot of what they wanted and needed and then the clean up the mess yeah flying out of it and that's what ... about it happens so often you know what everyone's into and this was a fetish Bill Cosby's it was a weird illegal Pettus but that was clearly what he was into\nBut if they do it enough times you know the ... you know what's gonna happen it's almost impossible to be in that world and not know if you're close enough to them and you're the one that's cleaning up the mess\n... so I think Camille new I think NBC new I've certainly been Cosby's attorneys new\nProbably his his people knew\nYou knew that he was drugging women to the point where they're passed out and he's raping a ... because I Believe Jana Dickens and wrote about it in her book no talked about no they wouldn't let her remember they wouldn't let her\nWrite about it in the book she went on Howard Stern and said there was a chapter I left out and then she talked about it after that right and then he tried to go after her for talking about it oh my gosh all things\nCrazed would just think about a number of people if you write it in a book and it gets spiked my doubt about it so the writer knows about it the editors know about it they probably running up the food chain\nAnd then ... shine Simon Schuster said no this is too hot we can't we can't accused him of that and she said but it happened but they talk to their attorney believe yeah twenty people\nThat knew just because she was going to write about that in your book at a minimum and then people talk to other people and it becomes a game of telephone yeah [noise] oh it's horrible you do that to enough women and word gets around\nI'm just glad he's behind bars right now because let's say you know that's the worst thing that he did was drug and right but um and we don't have\nTo say allegedly anymore right so convicted of it yeah so I'm In the case of Andrea Constand right so I guess for some women this is you know\nVindication but he also did he didn't just do that he ruined people's careers and had no problem doing it although with Wendy Williams he may have gotten her fired but she is a huge she's got her own show she's got her own clothing line that kicks acetate says that she's doing just fine\nBut talk to other people you know they they hold grudges against him because he really had it out for them like Tammy Bruce and deal he he did yeah and he\nClearly doesn't understand that he has zero power at this point no he's behind bars demanding meeting so he can direct people\nDown [laughter] you got that one day Williams oh that's too much too much expect of course people you're behind bars you have no power you've been convicted of raping a woman just what I Would end up she made it out of ... Williams yeah would you if you were him if he were her\nIf I were her ... I Would show up because this what better way to\nTo let them know that you want and he lost he had to have a meeting where he's an orange jumpsuit and what she looks like a million bucks and you're the biggest TV star on day tiny all of a well maybe for that reason somebody will say that exact thing\nTo her maybe one of our people and she'll say okay let's do it and\nIt'll be a huge and then she can dress him down for getting her fired years ago that'd be\nAwesome now he wants to meeting to be private though he ... not going to fly now I Would only do the cameras could be an arrow she's ... he's not calling the shots\nHe doesn't get to call the shots anymore sorry you did that for decades and we saw with that guy you know I I I Love one day I I I Hope she does this and I it would be great if it was he doesn't want it on tape 'cause she'll dress him down she'll rip him apart and and he does not want that\n[noise] he just wants to do as I Want to you know happy talk down to buy them and I was going to stay with um cautious she thought how old eighty something not changing the way you know you know\nBut what a life I mean I've in a way I don't I tend I never try to victimize the woman twice 'cause she's the wife I don't know what she knew and they've lost a son together she's already gone through the horrors of that I feel\nI mean [noise]\nI just think that people talk I think many people know a lot more than they let on sometimes people are willfully ignorant like take it back to the Las Vegas shooter yeah new cannot convince me that that wife or his didn't no more ... she knew something yeah if he's out shooting guns in the desert practicing for this\nAmazing act of terror mhm you can't tell me that she didn't know that he was going out doing that and she wasn't making them sandwiches\nBecause he wanted his life so that was beaten down by this guy this guy was\nA weirdo yes but he might have gone listen when you're married to somebody with guns that's what they do my ex used to go shooting guns all the time it's what they do what you ask the same thing it's like I'm going shooting what do I\nDo have fun let off some steam but if all the ... starts buying guns at an amazing color you kidding me right now like twenty something\nThat I knew of but that that that's what they did he was a former marine\nOkay well he came from that world so that's a little bit saying soda and guys you need a fresh it'll gambler and he's and\nWhen you're married you got a sitting there and watch I Hope you're not sitting there keeping tabs on your husband or wife like that because that's just I mean you gotta both have a bit of a life and\nI'm not saying that they're going through is trash on all of a sudden how do you know out of a character ordering guns how do you I\nLove doing that though because they were showing up\nFirst of all you see every package of ... I Can't tell you how many that my ex hat or bought I still to this day I don't know but I Know there was a lot [laughter] so I'm not sitting there keeping dams you know like oh didn't you just order one last week ... I'm probably at work one half the stuff ... what do you know what I'm\nThey will kill journalist just for being journalists having no background whatsoever yeah but I ...\nIt may be beyond that there may be more to it to who knows it's five thirty let's take a look at all the latest headlines [noise]\nABC News is live and local at five thirty and I'm just a little\nOut of twenty thousand dollar rewards now being offered hoping that leads police to the person who murdered in east Los Angeles college basketball player of the mother of ... to ... ... a charge that Carter she hopes that the his killer has caught\nNot just really want someone to parents upon people's hearts and their minds to know that this young man he did not deserve this\nIvy was gunned down two years ago just after he turned Twenty years old uh Lancaster man was charged today with trying to threaten California Senator Dianne Feinstein life\nCraig Steven shaver allegedly emailed a threat to the longtime senator on September thirtieth according to the LA county district attorney's office you schedule to be arraigned tomorrow in Lancaster on one felony count each of attempted criminal threats\nIn possession of a firearm by a felon the criminal complaint alleges that shaver was convicted of grand theft in Nineteen Ninety One\nAnd he faces up to three years in prison if he is convicted as charged and Florida governor Rick Scott survey the damage today one day after hurricane Michael\nDecimated parts of the Florida Panhandle and he cautioned residents but there's still plenty of danger in the wake of the storm\nAt this point you something ... there's a lotta downed power lines there's a lot in Panama City there's a lot of [noise] so we really have several about that there's still a lot it around a down trees and stuff like that to be careful about that [noise] if you're going to use generators how were\nThese chainsaws really careful of survived the storm don't get hurt afterwards talk\nRadio seven Ninety K ABC for the LA kings or skating in Montreal tonight against the Canadians and the New York giants are hosting the Philadelphia Eagles on Thursday Night Football giants just one in four in the season\nThe defending Super Bowl champion eagles they are two and three and that sports on seven Ninety K. A. B. C. traffic markets check whether the more the drive home with Jillian and John next to ABC News time five thirty two\nI don't know how much clear I can make it is but there is only one name to trust if you want to\nFace or neck left without surgery Dr wrestler I go there and I put my name on it because I've seen the results Dr wrestler and the team in L. D. I have done for me so I Know that they can do the same for you I wouldn't trust anyone else with my face plain and simple tighter scanner on your face snack even those lines around your mouth or ice L. D. I. is the place\nNow tightening her skin is one thing but that's just the beginning of what else I can do for you how about removing those red and brown spots in blocks you scan or the sun damage from all that California Sun oh and all those unsightly broken blood vessels L. D. I can help the combination of technology at L. D. I. is not available anywhere else in the U.S\nAnd if you or your child is struggling with acne or old acne scars just call L. D. I. and book you're one hundred percent free consultation tall eight hundred six six six thousand eight hundred six six six thousand that's eight hundred six six six thousand or a book on line and get L. D. I. dot com [noise]\nHe has doubled traffic when you need it the most or the downside of the one can\nHave the forty three leading downtown LA and into Pasadena a stall in the right lane stacking up traffic here to Martin Luther king junior boulevard he's still sunflower was an earlier crash in lanes delays madre all the way I talked with a boulevard\nVery difficult conditions remain on C SPAN Santa Monica before Roberts and make clear to stall the twentieth street all the way into it east LA it's jammed\nA couple of problems continue along the seven ten south added Lennox an accident just clear from lanes but sloth and all the way up towards Florence another problem in the Long Beach south seven ten it will lower the left lane flocked to last maligned or north found out a Long Beach and north down for all five struggling from Culver City all the way up into the valley towards ...\nIronic Kramer talk radio seven Ninety KBC [noise]\nHere's your seven Ninety K. A. B. C. market jak another a rough day on Wall street stocks falling for the sixth consecutive day without tumbled five hundred and forty six points that's when the five hundred lost fifty seven points of vows that gave up Ninety three points\nKBC so Cal weather partly cloudy overnight lows mid fifties low sixties partly cloudy warmer tomorrow ... upper seventies to the mid eighties with a\nForty percent chance of rain in the LA basin on Saturday right now Seventy one in walnut Seventy three and four sixty eight and it's you know you hear a lot about polls the only poll that counts as on Tuesday November sixth election day be sure to be heard and vote on ... ... ABC News\nCalifornia's cost of living is too high do something about his vote yes on ... the gas tax repeal\nPoliticians will fix the roads they just want more of your money vote yes on prop six to repeal the costly and unfair gas and car tax hikes\nYes on prop six the gas tax repeal ABC News about somebody reform California yes on proposition six the gas tax repeal [noise]\nOf bone lines are open\nThat now that eight hundred ABC ABC that eight hundred to do to [noise]\nDo you want to win a grand the easy way all you have to do is play the game how do you play the game you say well you listened to KBC everyday starting at six am ... top of the show jumping Lee it'll give you a word and you get back to nine five eight one night\nYou can do that at noon the doctor drill and Lawrence avant at three o'clock with that same thing we give you that word and you checked it back to nine five eight one night before they give away right here on seven Ninety K. A. B. C. where we give you\nA thousand dollars and if you want to\nPlay Florida or not floor to give us a call right now at eight hundred to two two K. A. B. C. one eight hundred to two to five to two to today's big winner gets a pair of tickets to see slash the Hollywood Palladium on Tuesday October the sixteenth\nStart dialing right now eight hundred to two two K. A. B. C. one eight hundred to two to five to to to [noise]\nI've got another update for you on a story that we've spent some time talking about yeah you thought I was going to the show the again\nI Can't stop thinking about this guy I'm can you imagine any way ahead\nWhat do you think happened to the body the body was brought back to the yes to the yes forty that gets in the belly of a camel by now\nOh God I I don't know how do you get out of a constantly like this was a very well oiled machine that they could go in there and do this that's that's hard core\nBut do I think I think didn't you say something about duffel bag so I'm assuming it went back and they got on private ... he's the prince of Saudi I mean he's loaded probably has a gold plane they get back on the plane no one asked any questions they bring him the proof and that's that\nThat prince really wanted proof yeah\nOh what a video he was a body pretty horrific huh God at all yeah All right but we told you about the story in Malibu where there was a guy who was camping with his kids yeah\nOh and he was shot in front of his children\nRight that's right and you know arrest forever may will figure out what\nHow we're right in between Calabasas in Malibu and that little state creek area\nAnd there were other stories about suspicious activity about yeah or bullets as well yes in an area where people were camping yes\nWell a man dressed in black and carrying a rifle was arrested yesterday oh my God we're Malibu Creek state park that's what it was a camper was shot and killed as he slept in a tent in June\nOf vast church involving LA county sheriff's deputies a helicopter search and rescue teams and detectives led to the arrest of one Anthony Rhoda or a U. D. A. K. already two year old\nThe surge was prompted by a series of at least eight and burglaries over the past two years in the Calabasas Malibu area in which food was stolen from local buildings over now rouda who has a long criminal history was only being held for parole violation\nOh so they they're not see the person of interest is right say writing not necessarily a suspect yet\nMaybe that's the perfect excuse to get them because you can hold them and you don't have to charge something real fast yes because he's already broken and other law right so you just leave him in jail on that and tells you build the case against American prosecute him\nInvestigators not ruled out all linked to the shooting at the wilderness park and the rifle undergo ballistic testing to determine if it was used in any of the crimes\nWell once they figure that out and he if he is he's done because they can figure with ballistics and all of that they can tell and that would explain\nTo if the guy's just a career criminal who's out just wreaking all this havoc that would explain why there's no rhyme or reason why this guy in the tent was shot\nThey said they said that it was random it happened at like two in the morning and maybe even for in the morning if I'm not mistaken and he had his little kids with him his wife was not there if I'm not mistaken she was a dentist or a doctor and this guy was an engineer of some sort and write killed right in front of his children I mean the whole story is and it's so hot heart wrenching\nRouda has a criminal history for burglary and weapons violations\nI'm Down to Brazil and her uh distasteful comment\nYou know like cheesy and some of these other powers they send out the left the ... the white liberals said though black surrogates go back and dragged he's tried to ... these people out of the plant back on the plantation punish them for walking off so we have a way to go and I just want to um you know cooked people's enthusiasm in terms of thinking that automatically know\nYou know blacks in large numbers are going to come out in the midterms isn't and twenty twenty and vote\nA Republican and into people who to vote for what party I'd just say you know what people earn your vote\nFair enough I guess a red we should all be ... everyone should be thinking exactly that ... there's somewhere you like people to follow you\n[noise] [noise] yeah I'm a new Web sites up it's been rebuilt its America's sheriff dot com just put the search engine America's sheriff dot com one stop shopping you can see everything that I talk about right about oh my media interviews on my Twitter Facebook everything is right on their website\nSure thank you so much say what time of the British isn't that much pleasure\nChairs eight hundred to two to five to to do we're up against ...\nI don't know how much clear I can make this but there is only one name their trust if you want to\nFace or neck left without surgery Dr wrestler I go there and I put my name on it because I've seen the results Dr wrestler on the team in L. D. I have done for me so I Know that they can do the same for you I wouldn't trust anyone else in my face plain and simple tighter scanner on your face snack even those lines around your mouth or ice\nL. D. I. is the place\nNow tightening her skin is one thing but that's just the beginning of what else I can do for you how about removing those red and brown spots and block the scan or the sun damage from all that California San Diego and all those unsightly broken blood vessels L. D. I can help the combination of technology an L. D. I. is not available anywhere else in the U.S\nAnd if you or your child is struggling with acne are all Daphne scars just call L. D. I. and book you're one hundred percent free consultation how late hundred six six six thousand eight hundred six six six thousand eight hundred six six six thousand or a book on line and get L. D. I. dot com\n[noise] and now the top five reasons to visit my run the casino resort his father's wheat number five weeks what what do you mean for my similar in here okay then I'm only going to do one reason to go to\nSmoke in good times has happened\nYou get three three cigar money for\nA Romeo and Juliet\nAnd aging room after\nA three three meals on me\nThe first three hundred people and\nOld this\nJazz great punch all ...\nNow mastered dot com\nRather casino resort\nGrounds smoke in good times Sunday October fourteenth only ever run into a casino resort spa\nTimes when it comes to retirement people often ask well I have enough money to retire when will retirement be a possibility for me how do I maximize my money during retirement if any of these questions sound\nFamiliar or you have other questions about retirement you owe it to yourself to learn more don't miss the money matters retirement seminar to get your questions answered reserve you see that the next seminar by registering on line that money matters dot net are called eight hundred nine four oh three oh two makes\nSeminars or on Saturday activity thirteenth that'd be into the sleep by helping Arcadia Pasadena area and Thursday I said we're Eighteen at the devil train Anaheim\nHometown guy now from\nHating for your home after Fifteen Percent on when you and I know my hundred dollars more after twenty when you send a hundred dollars or more\nDollars off your dollar on my home for the past\nAs a small business owner you make every dollar town\nSo what can you do with ten dollars go to this to print dot com today and you get five hundred high quality custom business cards for only nine Ninety nine that's less than two cents for cars and Mr branch pure satisfaction is absolutely guaranteed it's never been easier to turn five hundred strangers to connections just visit this to print\nDot com and use promote code forty six forty six and check out that this to print dot com ... code for six for six [noise] you\nTalk radio seven\n[noise]\nCall this number eight hundred due to fly now [noise]\nIf you're right the phones here Andre been patiently waiting go ahead\nSo ... what's up you have I I personally\nBelieve that the cutting edge was simply for another photo op or trial and he was exploited or in an effort to yellow eyes are more votes or maybe just the hip hop culture and I think it's also\nPretty pathetic to watch now that John Brown was stood up at all five ... Ali protesting the Vietnam War well he's still dating with fellow such trouble [noise]\nYou know the question is was the exploited we only do we find out you might have anything to say that hearing air for\nI I felt kinda bad about Jim you sort of sort of leaning back like while he was thinking what did I get myself Brian's hurricane up for it here\nYeah so I I Believe are you so that they were gotcha yeah so I just\nBelieve this is uh just another photo up for Trump I mean granted let me just say this although such a low brow once was a private conflicts with Johnny and I was with President Johnson years back\nBasically saying what they can do to help young men progress he also\nUtilizes friendship with Richard Nixon to try to put for progress for blacks and you know\nAs you know as a likely than they think Richard Nixon was the President Bush for affirmative action so I mean Joe Brown has done it on both sides with people who were going to do something but in in the case of dial up he's just using them okay Rob\nThe interesting thank you for that point of view appreciate very much into Patricia let's get to it\n[noise] uh yeah you know I I've been listening to everybody the United states of America we just let somebody have their own opinion everybody have to weigh in on that thing he shouldn't have said that jury bipolar that's why he did it or Trump used and whatever the\nFreedom of speech I get the feeling that people who don't like what he said are trying to control everything this is a big change that I see in our society over fifty years ago and he's got to control everyone else's opinion\nOpinions guide gay so oh mine so\nBut it is if they I I Want to make sure I hear what you're saying it's kind of an interesting observation which is in the past people would give opinions than others would analyze dissect respond to that opinion\nIsn't just giving your opinion is is having a one on one with the president which most citizens don't have the opportunity to do it\nIs it fifty years ago\nIt wasn't involved in all of the you know the ... the media chases police cars the media is looking for every saying that they're going to have the millennium Trump interview with ABC News tonight this stuff is\nBusiness is business and people get to over ... about it\nYou know everybody needs to have their own opinion now we've got to have people can pop things on their way out next door dot com everybody's giving their opinion\nAnd let live it's said yesterday is not appropriate for you that's your business he and I never liked the way you want he has as much right to say what he said yesterday and any other living human being in this country\nThere you go and so say a Patricia and and but I and I don't disagree with you however I did see something interesting in in print today there was saying that most voters are getting so burned out by all the polarization\nThey are not registering it's what's motivating them the apathy is if people are pulling out they can't make a decision they don't know what's going on where they every time they turn the media when hairs on fires they can't figure out what's really happening they can't arrive at any sort of\nDiscourse they should they go over listening this have been a day live [noise]\n\nGay day think of supporting your little habit unless of course you have it as drugs drugs are bad\nShot at Rand is coming up\nThe gear\nLos Angeles or a ... station\n\nWhere\nYou could win one thousand dollars right\nThe national keyboard tonight by one nine that happy ha why nine five have one nine will test back from your entry\nI nice you'd think that I think that the ... the whole thing of prayers are\nWith your number one hobby to watch people done yet is dark laid over God she'll come does it does it a shock Nader for the best one guy had jumped on it wasn't violent enough let me say this is the fourth time I say or does it does it [laughter]\nYes to the gentleman and blew a set of does\nOr does it give you a second thoughts about what ...\nNo it doesn't guys so I started working with this one job ... years ago on scares you from flying I started working here don't scares them from doing write it [laughter]\nIt's a girl I tell you wouldn't have vast because she was afraid of shore yeah pretty much I won't go in the Pacific we wouldn't have you still nothing in the Pacific ocean\nI when I go in the Pacific ocean there why it's cold and rocky and ugly is actually relieve I say mind you know my ... I went in the Miami every single day and by the way they are more and I can see the sharks there because there's more clear and there are more shocking killed him ... minutes Twenty years no dip your total once\nI went surfing with my accent surfer\nBaseball player I got up on the board and I said is that it needs to go All right I'm done and that was twenty that's where he divorced them anyway so my point is is [laughter] I said to me that every time he gets on a plane mhm you ready for this yeah you wanna hear morbid Everytime he stepped on the plane he thinks he envisions the plane\nGoing down it's because I ... documentaries of the rally understand why you drink to blackout [laughter] I get out I started getting on planes of course I fly every you know I'm going again next week\nAnd I and I started thinking the same thing so when the pilot comes on and he says that we're thirty two thousand feet I Want to shout yelling shut up stop it because\nI don't want to know these things so many favorite was going to start taking the bus now a lot of planes don't shout out shut up to the pilots I have another thing to share\nAbout once a month I have a dream about flying but it's an we never crash\nBut we're we're up in a big jumbo jet and we are doing stunts and we have to land on free weights or we have to land in the water and I don't know if it's because of all the videos I watch but it happens over the past couple of years about once a month they're pretty scary about different kinds of dreams scary\nNo oh [laughter] Oh yes\n[laughter] would you would not take the same plane as your why I told him yeah that's right\nNo really yeah I have friends that did that we never did\nThat because the thought was if if we if\nWe if you were on the plane together and the kids or somewhere else and both of us are gone the Veterans Affairs is one of us has gone they still have a beer or if it's as simple as that\nI Know and I think I'm Mart to me again more but\nNo no that was more of it at all\nNot smart practical that's a good word now asked me if I Do that now because I travel with my when I got to put them in another place you know if you're with your kid that's yeah\nI'm a smoker but if you go down with your kids at least you're altogether yeah\nYou know yeah well what do you think about that Philips how do we get to this\nWhat we're sounds like the president and vice president allowed at the same place but then I go in the same car is your wife and you're more likely to get killed in the car that on the plane right well\nThis is why as you get little though run will likely than if you go in the water Joe I mean none of the guy out\nTogether and she just brings up a great point hello ... the family the kayaks together when\nThey get together with a kayak may not kill [laughter] where are you know by the way I Know huge population\nHere right wing bring everything back to a shark that that kayaking moment when you know you were afraid that you\nWere going to give us a shark so somebody ...\nSomebody got me a kayak lesson you learned my birthday I went out it was great it was wonderful is going to get ... and just as I'm about to purchase ... two people died they found their kayak it was ... in\nThe shower cap and to Malibu yeah it was a ... a guy and his girlfriend yes and they were young they were like twenty four twenty five years old\nBut I was I wrong to take this was an omen drugs [laughter] well now in Malibu you have to worry about that guy picking people off although they made in Iraq and just see that all the valid blue state yeah we all over the park\nThey did make an arrest they they they found a rifle and this guy they were trying to\n... this is the one who shot into the tent and kill the found one way or at least like he was committing crimes before that sometimes you know ... ... well no no\nLogic he shot a man and a hammock at one point shot shot him and his armies shattered his aren't they think he shot at cars driving shot a harder than you know the shots in a while this man in his tent with his two year old and a four year oh this was just ...\nThere's such a terrible story you know so what do we know about this good well they arrested him yesterday and the park it'd been shut down because they had no idea where these bullets were coming from but people were getting shot out right and left and apparently he'd been burglar rising homes there to court yeah maybe the past two years\n... mentioned you mentioned vice president what is what is the feeling you're the Nikki Haley is going to replace parents two years from now on the ticket\nWell I think she's definitely running for something if not twenty twenty then maybe twenty twenty four\nNow she said I'm not running for president and there are some people saying well ... maybe there's a deal here that you might wanna she might run for vice president Pence will step away to something else\nBut isn't it easier to get elected to office if you're already in office like here we go see it when he ran for governor it'd been years since he was married LA just kind of like God about he didn't do a little red riding it's better to stay there because that will your names in the paper you're out there but I just making money at some bank then no one no one remembers\nWould you agree to using a unique position she is the number one Republican woman right\nNow and I think she wanted to get out before the midterms just in case the midterms were ugly but she's going to stick around 'til the end of the year though right she's already said I'm leaving so I think you know what what whatever whatever falls it doesn't fall on her\nJillian and I've been pulling for ... to replace her\nRecord now the ... really amazing person\nHe is he was an ambassador at the un or not was he a lawyer ... spokesman yeah for one eleven you like eight years I think he is a very diplomatic helped me a lot with my friend Kate del Castillo when she was in her a bit of a hot water and and and he was able to navigate those waters he's an incredible\nBut here's the grown up about ... make a quick emails yeah baseball baseball managers are not as important as it used to be because of analytics just the general managers going ... president of operations if the UN because of ... you want to ... or may not be that important to position because the will be calling the shots\nBut it's still a big deal fancy job and I think it would be for this eater Hal and Chilean Barbary I think [laughter]\nYes I hosted by\nMy sources reading three things are just did a poll\nPretty much as a lock on it\nI don't know why she said that she's out isn't she can she make it a lot of money at all I'm ... years ago\nYeah now we have this discussion a couple of days ago if you had an opportunity to be an ambassador ... would that be a job that you would\nSay oh my God yes [laughter]\nI I'm not I usually go are already right and you have for the okay hall why does it taste or the alcohol he ... her to send our time [laughter]\nI mean part I wanted I wanted the Vatican but thank God that I Would rather be a ... just because you don't drink that's why you got to be a big ass out to be a big hot oceans\nHorizon mall talk with all kinds of\nDoors that's sad doors these great yeah you you said the same thing I usually say ranking in small\nTown yeah not me I said I couldn't do it all those parties and the worst of all I'd make fun of everything they're gonna be like one of them facet or making fun of our country and make fun of our people [laughter] what we do\nIf you're invested or it means either you have a lot of money and contribute a lot of money on this will happen or you're somebody like Scott Brown the former senator from a Massachusetts choosing basket of two to zero and which\nSounds less than ... do you remember who became the ambassador to France Jefferson nope\nWants to overturn no no I'm Talking about now Ben Franklin [laughter] that's what Steve was in you know [laughter] I you know I\nI was sued by [laughter]\n\nThey weren't buffet says look I look at it must get into the\nRadio and this is you gotta figure he's ... he's going to take a stand I said I'm against\nThe [laughter] come to fix them killed quite telling a stitch in time [laughter]\nIt's JV record the former owner of the daughters right ... remember them a guard or sheep or wrong\nYou know Iraq a Monica ... she might have to hire oh you can handle money well not the heart of that he can eat that's the\nPerfect job it's a country the size of the studio it's gorgeous you know there\nWas a moment you know her was ... when ... McCourt bought the dog for a shocker because we're so that was it was horrible the guy with the parking lots in Boston what does the law as long as they can handle on\nGood ... I remember and they came on and they sat there and we talked and we talked and I looked at her and look he talk\nAnd he talked and talked and talked after they're often here in the hallway and our producers or this and she turned to him and said\nIf you're not going to let me say anything I'm not covered with you on these though [laughter] earlier sorry\nAnd implemented I really don't have to struggle waters them and just the way the relationship was yeah\nUnlawful search and seizure assault battery sexual battery negligence civil rights violations in some other stuff\nHundreds of Beverly Hills students were calling on President Trump to stop the construction of the controversial metro purple line [noise]\nAbout Fifteen hundred students and teachers in the Beverly Hills Unified School district or bust his home in the neighborhood protesting Macron's jak this student hope he's listening\nBelieve that metro the special benefit millions of people but they see is the number one fire to protest\nIs that to be a last ditch effort to put an end to the road from downtown to west would that would run underneath Beverly Hills high school and metro spokesman says the project underwent a five year environmental review before being approved in twenty twelve James throw Hi Katie the news\nFlorida officials saying initial search of about ... percent of the path of hurricane Michael turned up no sign of widespread deaths Miami fire chief Joseph ... who is leading the search efforts at the storms round zero turn out of Mexico Beach Florida so it's at least one survivor needed to be freed from the debris\nWe successfully extricate it than they were okay and we uh we sent them all up to the hospital and then about five or six other people needed MS treatment or nothing really serious but they didn't need to be seen at the hospital so we set them off as well\nWalt Disney company is donating a million bucks for relief efforts to areas devastated by the storm but company said today in a news release that the money will be funneled through the Florida disaster fun\nMembers of the Christ humidity church in Montreal North Carolina or overjoyed of Turkey's release of evangelical pastor Andrew Brunson\nA Turkish court today convicted runs on a chair related charges but released him from house arrest and allowed him to leave turkey\nAfter initially rescheduling concerts while he recovers from surgery including the Hollywood Bowl appearance this week rocker Ozzie Osborne says he's forced to postpone all of the remaining North American shows on his no more tourists to tour until next year Osborne was set to perform at the Hollywood Bowl\nYesterday but at the show was a push back until next Monday because Osborne was being treated at Cedars Sinai for infections on his right hand\nTaking a look at the BCS for [noise]\nSame one of the you know the U.S is going to get started in a couple of hours at Miller Park in Milwaukee what the Dodgers east but ... Shaw\nOpposing the brewers ... as far as the ... the red Sox will be meeting the world champion Houston Astros that won't be until Saturday evening though and the rams beaten will hit to Denver this weekend the play the Broncos Billy chargers\nWill play in Cleveland Sunday KBC news time is three thirty three\nI don't know how much clear I can make it is but there is only one name to trust if you want to face or neck left without surgery Dr wrestler\nI go there and I put my name on it because I've seen the results Dr wrestler on the team in L. D. I have done for me so I Know that they can do the same for you I wouldn't trust anyone else with my face plain and simple tighter scanner on your face snack even those lines around your mouth or ice\nL. D. I. is the place\nNow tightening her skin is one thing but that's just the beginning of what else I can do for you how about removing those red and brown spots and block you scan or the sun damage from all that California Sun oh and all those unsightly broken blood vessels LD I can help the combination of technology at L. D. I. is not available anywhere else in the U.S\nAnd if you or your child is struggling with acne Earl Daphne scars just call L. D. I. and book you're one hundred percent free consultation caught late hundred six six six thousand eight hundred six six six thousand it's eight hundred six six six thousand or a book on line and get L. D. I. dot com [noise]\nHas dependable traffic when you need it the most CSPAN sided Botanic Arlington stalling lanes busy now from Santa Monica Atlanta downtown and south four or five around Sheri avenues of working at a ... five\nSix o five north we're still be at the hearing lanes delays ... stop that from the sixty any than sixty a diamond bar big rig in the middle ain't busy from the six o five north fifty seven is affected from a bat in the area I'm Roger Kramer talk radio seven ... [noise]\nHere's your KBC so Cal weather forecast mostly sunny warmer\nToday even some gusty winds here in their\nAttempts top yup inland in the seventies for the most part some low eighties\nEighties in the valleys as we're experiencing right about now the trend expected to continue right through the weekend right now it's eighty five and Porter Ranch Seventy seven hawthorn and also Seventy seven in downtown LA you hear a lot about all the only poll that counts is on Tuesday November ... election day to shore to be heard both\nRob Miller into seven Ninety ABC News\nMean if you're interested\n\nIn front of phone are not about that as that eight hundred to two to five to ... to parents [noise]\nOf Steve and Dorothy ... the thing you can check out I guess my first of all your personalities right here KBC dot com you can check it out on friday of them I think we just take number twelve if I'm not mistaken and they said they would never say we are\nWho said it wasn't loan number it's well [laughter]\nI Can't believe that went through an Avon to deal with the amazing yes it does fly by the way to get it out how to get out safety KBC still an audio and dot com and but we are now on I Do and we have an e which I don't think means excellent\nExplicit what does it mean Steve someplace way because of you we got the right idea means you've you've ... you ... when he called me [laughter]\nIt's pretty thirty six in the ... casino resort in spot studios so we've been spending a lot of time talking about this missing journalist ... ... breaking news term government is saying there is an audio\nOf the missing journalist alleged murder and it was transmitted\nBy apple watch loan like gone while we don't really think he's missing no no and let me out on this they said torture as well I Know yeah it's all there is oil\nIn many authors audio there's no alleged murder murder\nCorrect It's got all that would be out Saudi Arabia said that they are going to work with turkey to help find and Charlie was like oh that's laughable um\nThis is frightening and everyone is denouncing Saudi Arabia which means ... Canada than we are not working with them but Trump won't do it\nWell gee why is typical first of all United States has always been tremendously invested not just financially but politically in Saudi Arabia was always are outpost in the middle east and especially in the battle against the wrong Saudi Arabia is our biggest ally there is that the other is\nThere are suggestions that the Trump family has been or wants to be heavily invested in terms of ...\nI Believe they are yeah I Know and for that reason the president hasn't come down a strong and this is a problem with a citizen without any political background becoming a president because you should not have vested interests you shouldn't be able to profit will try to get his he still\nEssentially owns and runs his ... and I thought the George Washington did well he wouldn't keep this\nIsn't a [laughter] it'd be very into money [laughter] that's the way it's an ... you know the more concerned about the American public as opposed to your business and while you\nWould hope that you divest totally at that point and get away from your business in the family business and his family's involved\nWould I make a political argument sure not and here's the heavily involved\nAnd here's the only man who didn't show the taxes outside of Nixon was Nixon got this guy is not an American citizen\nWho was killed and American he was a medical resident read like I was not a citizen doesn't matter you still get the ... don't have the ones that don't show it compares with you but yawn at one point when I when I was a resident alien as oh man I\nHad over making a joke protection so he would suggest saying that he's he's on his way to citizenship perhaps it's ... it's one of the stuff he was certainly a resident\nHe was a resident not a citizen the other thing is she was much more than just a journalist he used to be part of that royal court in Saudi Arabia and then had a falling out\nWith and presumably a lot of inside information yes\nSo he was essentially part of the government will end and heard also\nStirring it up because he was part of a group opposed to the leadership is every listen if you're president of United says John we'll put it on a nuisance yeah our program or with Joe on the drive home\nOr you're the president this happens now what do you do\nI'd say it's awful and I'd say look the un handle it you would yeah because governments around the world kill people that they shouldn't kill all the time\nBut this one we know about and there may be\nAnd it really bad for the audio there may there's there are ... are good for him but also a journalist and I think it's it's a bigger picture that if you oppose us we don't like it and will kill you kill you\nWell here's a ... where do things become either a liberal or conservative most issues sadly what about this one is this bipartisan or the conservatives are the different taken liberal\nThe cells oh it is now nickel right or wrong darling because he played for the Mets and again he's not too much\n... doing the games you know yes he's married to a girlfriend of mine she's who make up at the NFL Joanna dying and they had a baby about that you discussed as he just got involved in a controversial Ron yeah he's like a wealth of her die\nHe talking about an Asian pitcher you use the phrase the ... something and it's but you referred where was the chickens armor and ...\nMember there this year half of his little a week ago and there was a little bit of an explosion and undergo\nSasha armor lady just happened to be agents stop if it is it in and and run our nation is any stunt yes yes yes yes\nHawaiian Chinese uh stepped up and said I I really apologize with friends\nAnd then they shouldn't have had to apologize though and memorably Ralph law alert the legendary voice of the ... rose great play by play got in trouble because there was a player from Iran and he pronounced it Iranian instead of Iranian ... and then he got suspended for a couple of\nI don't got suspended for sending Iran entity that's what it was a review didn't say anything that is the reason I ... the people I Know say Iran and Iranian as opposed to Iran will say that\nYeah right but if you're from there you say Iran Iran yeah yeah I remember\nA million years ago covering a big parade in New York when the Mets won the world series Enron was playing there then and he was like you know so cute and he was such a hero and they're driving in a convertible and a girl jumped in\nThe car [laughter] like sort of odd route herself up on him while I remember probably around who's I ... I remember\nOne of ... she's a lovely beautiful Canadian girl she did make up for a hot second that the NFL and I remember her doing his makeup and everyone 'cause he was the gas and everyone's saying oh my God he's flirting with you and she was like no he's not and then he fell on came out and said I I Want to take you to dinner and they were inseparable and they have a baby\nAnd um but people say things and it's kinda crazy German the time I got in trouble like a daily and I told someone sorry\nI I well I wake up screaming during the night I wake up a lot about our ... and we'll have that story when we return Steve dark studio but yesterday I Know what I Love it I Can't wait to hear it a second [laughter]\nSeven diet KBC\nItself isn't that a little more than I had\nYou know why should have been a long time like any hold high to go to a tiny non lemon ... banana cream French apple\nJust raining down that's what I did because when that little voice in your head the\nCalendars ... delicious home pies to go to ... [noise] that little voice in your head saying I now\nIf you're retired or retiring soon there's one financial show you don't want to miss money matters with Ken Marie this entertaining a topical radio show arms you with a financial knowledge you could use today can discuss his ways to grow and protect your retirement portfolio\nEstate planning taxes Medicare and long term care planning a more growing and preserving assets for those retired are retiring sooner ... top priorities Ken has been featured in Wall Street journal CNN Money Forbes and many other\nStudents are getting ready for the money matters on Saturday and Sunday one to two pm on seven nutty KBC [noise] roses are red and\nPilots are blue come to him around go for Swedish day it'll be good for you and your top five reasons to visit my long ago this week number five\nFleet or\nA kitchen away or five of the points on your record Monday to Fifteen and had three\nAt your chance to win\nTable games to give her worst tart taste like chicken gadgets\nReason the bronco casino resort spa\nTo guard painting and I'm\nAround all casino resort us far conveniently located on the tip less than Ninety minutes from wherever you are no longer good times\nTaxpayer advocates across California oppose crops and John ... president of the Howard sharp as taxpayers association\nPrompt and could create more than five hundred rental boards full of unelected bureaucrats and allow them to imposing government fees on all housing plus control how much homeowners can charge to rent out their own home or even a single room\nRobert ... from California taxpayers association\nPrompting cost state and local government and hundreds of millions of dollars if this flood plain gets challenging core prompting for taxpayers on the hook to defend to protect your wallet vote no on ...\nCheck the facts at ... dot com\nPaid for by ... flight initiative that will make the housing crisis worse coalition of housing advocates renters large and small businesses Pakistani groups that are in committee major funding from Blackstone poverty partner ... on that whole thing is I Love the blacks can real estate partners ... and their holdings\nIndeed knows it's hard to find qualified candidates when you're hiring it's like finding a unicorn ... job on indeed it's easy to find people with the skills you need\nNurse practitioner for ... plus years experience acute care certification indeed has a huge pool of amazing candidates and screen or tools that help you find\nYour most qualified applicants and entire shortlist of unicorns see one more than three million companies worldwide using deet to hire post your job and indeed dot com slash higher indeed the world's number one job site source contour tool visits\nRight now the cooler summer on comfort heightened along at a toilet that is the lowest price at the Home Depot just one Ninety nine you say fifty bucks at that price you can raise your expectations but leave your budget exactly where it is\nIn the best news of all the code\nThey never compromise why should you start with the best the coldest them wrong comfort high toilet just a hundred and Ninety nine bucks now the number one cold a retailer\nAnd I'm Lawrence of I you know you don't want to miss a minute of our show every day\nI'd probably have a life and they want to live\nYour schedule well you can\nCheck out our daily podcast staff to do midday live with north of on what I Do in Tunis and Katie\n[laughter]\nThree fifty seven in Morocco casino resort boss the grid of\nYour head poor care day on seven Ninety ... things in the bucks listen it's six to nine with Doug ... with Dr druid Lauren ended up three with us\nHere the national key word and texted to nine five eight one nine and you can grab one thousand dollars it's for care day on seven Ninety K. A. B. C. so simple to play remembered don't text and drive but listen to win for kid a on seven Ninety ... ABC rules in in ... a PC dot com [noise]\nAll right so let's hear about this apology one apology on good day LA\nThat the ... we were talking to somebody\nYou know in Canada it's a little confused like whoa you can't say nothing like\nWhat the American now I say\nOK he says to be in the ... maybe should come to know is that the station gets this thing about this woman said an appropriate thing I thought it was like the ... you know it was the next day I don't even remember [laughter] I think they came to June so they came to door\nTime we scanned the big whopper or they walk\nAnd she looks at me because this is your an idea of an apology [laughter] and you want to call me a Mac and I don't care my mother was born in Ireland and a half drunk yes they were proud John this is my college I found that there are good\nTimes good times good times people I\nBelieve that I Want to hang Lynn I Want to hang with that per job thank you for I don't want to know what I stand in for calling in that hello Steven Levy thank you for coming ... to ... that's the only way you little Mickey leaving and you're saying how can you know what\nWas your idea\nLike advice\nOur ... driven up by a thirty minute nonstop news blessed on seven Ninety\nKABC don't\nGo anywhere [noise]\nLos\nAngeles orange\nMueller station on the top\nThirty minute na na da da da Silva Ninety\n\n\nEight four o'clock in the west in Morocco casino resort and spot studios Jillian Barbary John Philips here until six o'clock in the evening I tell you what\nThey just don't want to leave these two [laughter] they want us to see the blood or they want to hear they're going to go get let's just covers city I Love you guys love you mean that you just gave away where they are going now they're not going that that's why I gave it away okay that's where my dinner was where the high Christmas came by\nWebsite to donate as he said I'm a dollar can make a huge difference the\nDevastation is just unbelievable looking at pictures are on the road with them it's unbelievable\nSeveral FBI employees stationed across Asia were recalled in Washington DC admitted probe into prostitution party complaint proven prostitute same cells that that's an extra charge you know funny the Justice Department's inspector general for them to the allegations which involve agents in about a half dozen\nCities in the east in Southeast Asia that's according to the wall Street Journal\nThe employees were sent home in recent months as the investigation continues it's still unclear exactly what the nature of the allegations are although I have an idea based on their headline\nThey'll prostitution is legal or tolerated in some of these countries FBI officials worried\nCould be a potential avenue for their agents to be compromised by foreign intelligence services ...\nDidn't this happened in Brazil somewhere down in South America long ago fact come on I'll make it legal and just stop on defense already well imagine if you're in the FBI or ...\nOr whatever ... and they say guess what you're going you're going to Bangkok or you're going to Hong Kong and you don't speak the language mhm\nWhat else are you supposed to do what are you supposed to do your undercover you under the covers your you're\nGoing to say don't go to a donkey show you you can get a lot of information at a donkey show classy one of course the best of the best but the oh yeah [laughter] talk about the local flavor [noise] oh\nReally married they knew most juices there's really testing out all the local flavor to get to the bottom of story I don't see a problem I have a feeling their boss herself [laughter] even Elliott a writer\nBased in New Orleans alleged to have committed various sexual misdeeds on a crowd source list of bad media men circulated a year ago is now suing the spreadsheets creator more a a dog and\nThe defamation lawsuit was filed Wednesday and appears to be the first legal action pursued by a man named in court which open to debate about anonymity self protection and the Web as the prevalence of sexual misconduct became a focus of national attention now the list of been populated with the names are more than Seventy men\nThey range in age from their twenties to their sixties\nMore than a dozen had been marked with red highlighting the doting accusations of physical sexual violence by multiple women one of them was Elliott who's alleged wrongdoing included rape sexual assault coercion an unsolicited invitations to his part but\nHe's now seeking one and a half million dollars in damages from dawn a gun and threatening to expose up to thirty yet unknown Jane does who edited or publicized the spreadsheet and this is one of these circumstances where\nIf you accuse him of rape\nYou better be telling the truth mhm because if they didn't commit an act of rape there's going to be held to pay and there should be held the fate you shouldn't accused someone of this unless you're absolutely a hundred and ten percent sure that they did it\nWell I I don't know if you just saw I was reading the story about the the ... you know I think it's pretty obvious what assault is what rape is people have different\nYou know what his rapist is did you leave being pro does it you know whenever I'm their sexual misconduct and then there's rate so to me it's not a fine line that is what it is did you see the Dodgers that was in trouble they don't say which one what happened\nIn our new splits no Dodgers were told a player sexually assaulted a maid and they kept quiet and he stayed in baseball so I guess he's a they don't say who it is but how long ago was this is this current or is it her in a while back\nCurrent no two thousand Fifteen I'm Sorry okay so yeah it happened in two thousand Fifteen and he allegedly sexually assaulted a made a and one of the hotels three or four times and uh he continues to play sometimes I have to read the whole story but\nI bet you they get assaulted all the time who may because they're not on your door you're the only one in there they come in\nIf you're a bad dude and there's a woman who is in there by herself then that's a a circumstance where\nAnd these guys are we going to help at all and he's coming on to them and wanting to sleep with them constantly that I'm sure this guy is you know nurse assistant thought well what's the big deal and he came out like three or four times and groped her\nAnd she was like no I have a boyfriend got off me and he just would not take no for an answer and I'm sure that it's the ego and the like I can have anybody I Want what he's talking about you know I'm interested in you know she wasn't interested\nOr the Dodgers releasing any more information about this is the whole three pages and I'd just glance over while you were doing that story wow so I'll have to get back to you on that one ...\nBother Julian Hoeber almost\nThirty million Facebook users phone numbers in the email address is ... access by hackers and the biggest security breach and his I\nCome on Facebook there's just in the news every week when it's ... and those black shirts with those ... little eyes the attackers access\nTo even more details on fourteen million of those users including the area where they live their relationship status in their religion the\nNew details comes two weeks after Facebook first announced that attackers had access more than had access to fifty million users accounts meaning they could have logged in as those users for the fourteen million worst hit by the breach the attackers were able to access the following information username\nGender locale language relationship status religion\n... hometown I'm not on Facebook a lot but aren't those things out there pretty much anyway so I'm thinking I'm like okay what do we know who you are sometimes if you talk about the church that you're going to every one puts the relationship status I I don't\nI'm not everyone oh they don't yeah what do you mean there are people I guess that if they're in a relationship and we're seeing other people on the side I Would imagine you just leave it blank\nOh I see what you're saying okay you're going to the motel motel for the most part you can pick up a lot of this information but okay Hi\nI Would imagine if they're getting your banking information ... wouldn't have your credit card information which I don't think\nFacebook has unless they breached some information on Facebook that could lead them to those things I don't see a problem with this but\nYou know oh my God when target got hacked a couple of years and even Marcus that pissed me off so much\nWell wait to get at least told everyone three weeks after the hack Neiman Marcus told everyone it happened in November they told everyone in January gee I Wonder why targeted at least ... sorry I have to turn this\nAir off I'm Sorry ... up it is so hot in here or you don't you feel like if I Do feel like we're we're at the equator Seventy three Seventy\nThree is not the temperature of an easy bake oven which is what we're sitting in right now oh my God it is to say I'm sitting here ... I saw is that where the hell am I it's Donald or drew I'm beginning to\nThe yeah I met a possible [laughter] he does like it hot some like it hot that Dr Drew okay I thought he\nWas on the Quito diet you can be breaking bread in here [laughter]\nI you know what it is I'll get back to you any money he's getting all super skinny he has no layers of fat because he only eats protein and now he's always so he likes it super warm although he's always liked it warm he does and I don't I don't like freezing but this was my\nCats are would be that way too I feel like I'm In uh\nSaint saint a bar and so what did you go sent semi ten\nA man who listed his girlfriend for say a lot of ... as a prank shocked when the bits reached over a hundred Nineteen thousand dollars within twenty four hour and then he's like well wait a second maybe we're on to something and wasn't really a joke Dale leaks who lives in London wanted to have a laugh so we thought it would be funny to lift his girlfriend\nOf one year Kelly Graves on the auction website he described her condition is more parts are not working oh my God and wrote that she starts okay but after that there is a constant winding noise that I Can't seem to stop body work is fairly tidy but close up show\nSign by the way this is a Canadian Man no serious damage to see what I mean see this and that you see the sense of humor over there it's\nVery tough south\nWhen leaks showed the listing the graves she went along with the prank thinking no one would see it but when it comes with a couple of what's dinner that night leak cell phone started going crazy no ... beds and crude messages from interested parties all over the world I thought oh no what have I done\nThe ad was removed by ... after twenty four hours for violating the websites policy against selling human body parts of remains but not before being seen hundreds or eighty one thousand times\nThis is the TV news which is in Toronto so obviously this couple of thought it was kinda funny and threw it out there but ... ... lives in the world we live in you're going to get takers she must be good looking woman\nAnd a eighty one thousand people joined in on the ah on the auction if you will well I Would imagine there are parts of the world\nYou can probably buy somewhat on the Internet\nNo doubt no not on the Internet while this is ... ... [laughter]\nThis is ... and it has it has ... rules right\nYeah I don't think slavery is allowed on E. bay like they don't think it's funny what do you do it over there that computer Bob I'm selling my wife abide some beanie babies and buying a bride\nHey Bob what's she what's the going rate for one well we're up to a hundred and Nineteen thousand dollar you know I'll tell you what\nHoney he's like honey actually you know what a hundred and Nineteen thousand I mean it's just one night of your life\nNever stops [noise]\nDavies news live and local\nWhere for thirty I'm Rob marine do a man who gun down a former Santa Monica high school football player after running last year\nWas sentenced today to forty years to life in state prison forty three year old sure when Mendoza ESPN those who was convicted August twenty first or second degree murder and the gun\nDischarge obligation stemming from the February twenty six two thousand Seventeen slaying of one calf steal the panel acquitted that's been those are the more serious charges of first degree murder\nFacebook now says it wasn't fifty million user accounts that were hacked back in September it was twenty nine million bucks some of those accounts were compromised more seriously\nFor about fourteen million other twenty nine million hacked\nA lot of information may have been stolen user names where they live check ins other geographic information also gender relationship status religion and more\nFacebook created a website for users to get more information Facebook dot com forward slash health forward slash security noticed Facebook says the hackers took advantage of the platforms vulnerabilities motor abilities Facebook says it's continually trying to secure\nThere were still information about the hacking that is unknown including who the hackers are ... Los Angeles\nMetro officials broke ground up today on a project aimed at improving bus speeds and safety for the orange line\nAlso be prepared for the rapid transit lend the San Fernando valley for future conversion to light rail the project will install to Ariel bridges and stations as well as bike and pedestrians ... separation and then I spoke with a boulevard two of the lines busiest crossings\nTurkish media say American pastor Andrew Brunson has left turkey following court ruin the convicted among church charges but also set them free evangelical pastor from North Carolina and his wife Noreen arrived at a private terminal in Arab man ... airport in the coastal use ... province late today\nSeventy percent of young people trip to join the army are not eligible based on a lot of factors but for the ones that get through the door but number those down even more\nThirty percent of those applicants will be too fat that's according to making Myers senior reporter for the Army Times and that can be a long term problem\nThe army deals with obesity as something that costs a lot of money and causes a lot of injuries and keeps a lot of people out of the play ability they they can't go to Afghanistan you can't go to Iraq because they are and a lot of the time just because they're overweight the army\nIs preparing to help you lose weight wire Cheney but you can spend a long time in the army and all that weight to continue to be back on you\nMight as well as a guest on mcentire in the morning ... hey be seen is KBC sports [noise]\nIs getting ready to go out in the ... starting about a half hour or so in the Milwaukee\nPutting pressure on the mouth of the Dodgers a ... for the brewers red socks they're preparing for their match Saturday Night against the world series champion Houston Astros LeBron James is first game against the warriors as a Laker drew nearly two million viewers making it ESPN's most watched preseason game ever\nThe network said the Lakers won Twenty one Thirteen victory Wednesday night in Las Vegas was washed by one point nine eight million viewers you're getting the rams head\nDenver this weekend to play the Broncos and the chargers are headed to Cleveland the way the brown figs use time is for thirty three [noise]\nThere's nothing small about your ... your passion your hours your reputation all huge\nTheir partnership even bigger\nWith ... you'll get the tax advice and one on one partnership to help your business ground\nBecause with a reliable down these would end up in court processors you can focus on what matters most getting done\nA seventh heaven by down to speak with an advisor today at age seven seven by down\nTo some of them is to [noise]\n\nAnd among traffic when you need it the most censored by the California earthquake authority sell them for all five freeway right around Inglewood that earlier crash cleared but the damage done by all the way to work in Long Beach and north for aside national has stalled vehicle so now than I Do all the way over the hill to know more than four oh five Westminster\nOh that's a stolen the right lane delays here from the fifty five sixty a diamond bar was a big rig clear from lanes but also very busy east LA probably after the fifty seven and it's affected the fifty seven north from Yorba Linda six o five north at Florence an acting class\nElation and won all five in South bend is affected coming up I'm sixty I'm rather Kramer talk radio seven Ninety ...\nSix days till the great California shakeout repair to survive and recovered from the next damaging earthquake joined millions in the largest earthquake drill in the world on October Eighteen but Jimmy Dean am a registered earthquake authority dot com slash shake out ... by the California earthquake authority\nKBC so Cal weather forecast sunny and warm\nTemps in the seventies and eighties about the same thing tomorrow right now\nIt is Seventy nine and Burbank Seventy seven and four Seventy five downtown LA here a lot about poll the only poll that counts as on Tuesday November sixth election day be sure to be heard votes Rob ... seven Ninety KBC news\nAnd personal injury attorney ... if you're injured from an accident don't ... your insurance company alone I Am that up with our life let me thank them for you\nThis segment is brought to you by ...\nWait a minute what these guys explain\nEvan Bayh PBC\nRight it is that time of year again to join K. A. B. c.'s winning team ... McIntyre is doing the AIDS walk Los Angeles it's the Sunday October\nTwenty first so it's not this week and next week and I'm assuming I'm In downtown LA Southern California's largest HIV aids fundraising event will once again be hitting the streets it raises funds for a pie LA health and twenty other LA county aids\nService organizations it's a great cause it's ten K.\nWow and um you can be part of it joined the teen K. A. B. C. team get more information or you can go to Kate ABC dot com but to its search right there in LA city hall finishes at Grand park and you can just go and you know walk beside Doug pick his ear the whole time I'm sure he'd love that yeah\nDone a lot of it when people chowder him in particular a chatty for ten miles or ... [laughter]\nWe're effort to get Mike Baker on the program or CIA covert operations officer and he's always calling in from some remote\nRural they can't tell us where he has enough to kill us is he going to weigh in on the show gave the yes oh I'm dying to hear what he has to say\nOkay so we have more information I told you that the murder may have been audio recorded\nBy his wife now I heard yesterday that it might have been audio recorded his murder slashed torture by the way I did not know that it was his watch that I mean that's just on\nBelievable can you imagine being in that circumstance where you have you know that was coming down you know exactly what's going to happen and you you think far enough ahead yeah we're we're with all to the radio and go to record your own torturer into\nBut let me ask you this is recording it how did they get to watch or was it that recording in the room I don't understand\nAll of us an apple watch it probably recorded it and put it on the Internet right away or recorded I Would have would have done I don't know I ...\nOkay I don't know how can the same thing because obviously they took them if they killed him and did what they\nPurporting to have done which is chopped them up I'm assuming they're keeping his clothes and his personals and his wife would be part of that so he makes sense saying that maybe it went up to some sort of iCloud account and it was heard from there oh my God how how loud slowly\nChilling let's go back to my victim blaming yeah because if you even play at all I mean I Swear to God you're it's a fine line but go ahead\nGo ahead if he's in love with this woman obviously marry or she wants to not be wars you know you're not married you have no idea how dumb love makes you makes you an idiot why can't you just maybe it's just filled you Ashton but what's the matter with living in soon [laughter] I said that\nYou the other day but he probably wasn't thinking along those lines and he went to the conflict once before and he was fine um this was an additional paperwork situation that they needed him to come in and do so you probably thought well I've already been there even though you had reservations he thought ... you know and I want to marry her but it was a ... now I'm with you John\n[laughter] I didn't go to your church if it really means something to you to have some sort of religious ceremony you can go to Richard leashes and even\nReligious this for him this is like when I went with my accent Beverly Hills city hall that's all this was just a formality\nThat he had to do but how important is the paperwork though if you're with the person and you have a bond you exchange rings yeah I just don't see why you would make this risk\nFor me how do I maximize my money during retirement if any of these questions sound familiar or you have other questions about retirement you are with yourself to learn more don't miss the money matters retirement seminar to get your questions answered reserve received it the next seminar by registering on line that money matters dot net are called eight hundred nine four oh three oh two next\nSeminars or on Saturday October Thirteen at the embassy suite by Hilton Arcadia Pasadena area and Thursday October Eighteen at the devil tree in Anaheim\nWe are new\nBoy babies [noise]\nWe were\nAble to locate my Baker [noise]\nHard enough to join us right now my Happy Friday you\nMight know likewise thank you uh sorry about that as a was delayed flight and just a touchdown\nWe got a big bigger name line to have it might just have to worry because he'd been following what a story a\nIs saying I don't understand you know ... you know he's going in there it's just a matter of piece of paper it's like he lost his life from this marriage license and I think the bigger picture as when I was saying to John look it did happen I'm sure he's dead\nOn this is horrible but don't you think these the Saudis could've found him and gotten and maybe not on us soil but he was in Turkey that he checked into a hotel they could've assassinated him anywhere except America\nYeah yeah I suspect or what happened then again there's still the short this association out and and again it it points out the fact that those are those are flipper for everything nowadays with with all the technology that's out there\nUm so we will get clarification on this and correct for the state department is is a is pushing a very hard for that right now and and as a federal law enforcement uh two degrees they can with their counterparts but uh it it is odd and I suspect what happened was the Saudi saw an\nOpportunity in a in a sort of a a\nA something that they didn't think through particularly well but I suspect that he he advised them that he will be stopping by the council it and that was sufficient time for them to uh put some resources into place to carry out this just a it's a tragic idea that they had so\nI I don't think this was long time in the making I think once he indicated that it will be stopping by um that I think that's what would happen to adjust your tips of your question they could have done this in a variety of other ways that probably wouldn't have left a sort of the trail that they've left\nThat tells you about that earlier did they leave a trail to say FU we don't care we did this and ... yeah uh because now we're hearing all this craziness John you were saying about his apple watch could have picked up the actual recording of the interrogation slash torture slash murder\nUm to me they must have known that the walls can talk somehow ah what\nDo you feel that he's got a lot of journalistic capability right now I get to eat with turkey is recording device on the court on you know it makes perfect sense ... and and again that doesn't just court to you know some decrease the wristwatch on your phone nowadays it it can help loaded\nSo uh I think that I I don't think this was a case where the Saudis or we don't care whether we get caught I just think they they they thought they were being clever and I think they also are felt as if it wouldn't raise much of a concern I think they viewed it as an internal matter uh they tend to be very uh", "show_name": "The Drive Home With Jillian Barberie & John Phillips", "station": "KABC", "day": "12", "state": "CA", "year": "2018", "month": "10", "city": "Los Angeles"}