{"month": "10", "state": "TN", "station": "WJCW", "content": "They will be placed in the NFC West and the Jacksonville Jaguars any place in the central and south west and Phoenix area the body again so that we\n[noise] we're in a way [noise]\nFor the money\n\nFor the camera and that's the song would lose in the northeast United states snowstorm nearly two million residents without our\nCar racing at Wayne Tony Stewart let them to win the national league [noise]\n[noise]\n[noise]\n[noise]\nWhat do they take the same number of sugar\nAnd those are some of the events that are coming out this weekend a monster energy NASCAR Racing cars to Tripoli Texas five I've read that's her life review here's our\nSteak with two tickets to the final four seal up for grabs the team's practice Texas motor speedway this week for the triple a Texas five hundred April winter Kyle Busch likes his chances they capture up for the victory in Fort Worth and advance the strength to go in the final championships they saw\nThat place has always been fast and it's always kind of in a one room is around the bottom and and so far it's kind of what we got what the ... have you know obviously you hope that with time and er an age and the asphalt surface said it becomes better more racy you know it it was um\nA good place for us before the repaid and and now sensory have I think it's been a pretty good place for us as well to wait for a while there we want to or the spring so hopefully we can continue that sort of a matter of fact\nCheckers at Lawrenceville speedway learned tricks juniors all fired up and ready to have his first PMS trophy on the fast one point five mile plot overall\nIt's been a really good track for us and for me throughout much of the journal\nJust haven't been able to put it all together in the first grade so far as the heart racing you know it's just a lady walk sometimes she goes to show me but I Love ... separate area\nOr somebody officials around I'd like to I'd like to have so little coming into\nThe Clintons' lawyer desperately needs of land to make the final four only three top finishers in the last ten in Texas last year the championship hosts remain skeptically optimistic\nIt's a challenge you know and and and within those challenges you got to be open\nMinded about you've got to be excited about that challenge and in and ready to attack it because you do definitely have to attack that I mean it's it's a it's attracted\nA grip levels through the roof and tell us not a very very tricky you know to to get a hold of the\nGreen flies over the AAA Texas Texas speedway this Sunday afternoon just after three PM Easter for this week's NASCAR live race preview I'm Suzie Armstrong\nLike as soon as he this has been the auto zone commercial free zone brought you buy auto so does your ticket July you guessing on his own free fix fighter service can help you find a solution so you can do both get in the film autos though that this week show we like to thank God all for joining us also chase LAX and Johnny\n... and for the rest of the crew back thank you so much for joining us on this week's edition of NASCAR live talk to you next week right here everybody [noise]\nNASCAR lived with the production of some voters racing that for the studios in Concord North Carolina at the tone of each floor and was to unify\nHercules right on our ... today's broadcast prefers used by rich cobra pilot for now\nRemember to visit him already dot com to get all the latest NASCAR news and information NASCAR lives is produced under an exclusive license with NASCAR and to use the the accounts are descriptions contained in this broadcast must be with you express permission if NASCAR fans of Moses racing\n\n\n\n\n\n\nTrying to talk radio station to Eugene W Johnson City team sports [laughter]\nPittsburgh attack first right calm I mean President Trump has this is a side of the Pittsburgh synagogue massacre\nInside the synagogue the president and first lady lit candles for each of the eleventh victim tree of life rabbi Jeffrey Myers then escorted them outside where Olympic stars are set up\nThe president placed a stone at each memorial and the first lady then added a white wrote protestors who were kept at a distance made clear their opposition to the president's visit\nMany holding signs excoriated the president ... Pittsburgh\nPresident Trump wants to take away the constitutional right to American citizenship is born in the u._s. but house Speaker Paul Ryan tell somebody be OK radio at like ... I think that the president cannot do that\nYou can't change this exec at a at the very least it would have to be statutory see Congress\nNemo Senator Lindsey Graham says he plans to introduce a bill to end birthright citizenship for children born in the U.S to illegal immigrants Speaker Ryan says that would require changing the constitution\nAre even more shameful you on the ears of Judas some at Mr ... met a Holocaust survivor escaped death by four minutes before he was a little Lake Shore because he was he's also a strong supporter of Trump\nFrank Julia would you stand before this eighty year old man not in a tweeter on line peace but face to face and tell them he's responsible for the death of his friends that people with whom he prays each Shabaab would you barred him from the show where he almost died again it\nAnd some Jew haters really and that would make us the righteous one\nThere is much that smart journalists and observers like these folks say that I agree must be said yes we must be vigilant underwear and ready to spot in combat the virus of hatred yes we must call out public voices from the president on down who speak in ways we believe in danger to radicalize the population who writes\nMy congregants are not the ones who are dangerous and manipulating responsibility to turn Jews and the perpetrators\nIs ethically appalling and community and communal late toxic we can only be a Jewish people when we don't actually communicate\nEach other for religious reasons or political reasons or cultural reasons everyone is welcome to pray in my synagogue right or left no matter how much I as rabbi may object\nTo your views because we do not praise Democrats or Republicans but it Jews they'll let us chair our clothes\nAnd mourn the dead rabbi David wealthy\nThey're rabbis and then there are rabbis there priests and then there are a priest there's preachers and then they're ...\nThey're really good ones you can tell at times like this like well the like the rabbi the synagogue in Pittsburgh\nAnd they're good reporters embedded reporters there's good commentators embed commentators and unfortunately most of the reporters\nAre bad and have been awful and same with most of the commentators on MSNBC and CNN and some others\n\nI Do not think that Schmidt and Matthew is neither of whom are Jewish\nUnderstand that when they told you\nThat he has blood on his hands\nWhen a Jew hater walks into a synagogue and murders eleven people\nWhat a what a slander that is you out there\nMost of whom are Jewish you understand\n\nBut these insane ... with their talking points who want to see their names in the media\nThey don't care they could care less these are insane idiot logs\nAnd they were given a platform and they're given a voice\n\nAnd when you really think about it is the owners have Comcast\nIs the executives at NBC and MSNBC who not only tolerate this but perpetuated it is the owners of Time Warner and CNN and the executives are these corporations who perpetuate this even more than tolerate\nThey know what's going on when these media platforms that they are now\nAnd I've come to conclude that there are hosts and they're paid contributed reflect the views\nOf the investors and owners of Time Warner and Comcast the New York times in the Washington Post I've come to believe this because otherwise why would they tolerate it this isn't freedom of the press this isn't the press\nNot as traditionally understood not is historically understood\nThese or hate machines MSNBC is a hate machine\nChris Matthews\nChristopher Hayes and let me know that guy Schmidt and the ... these are haters these are\nThese are viable human beings who said just blurted out these comments\nFor which they are celebrated in some crazy dark corner of our society\nYou look at MSNBC is raining there miniscule\nYou look at CNN's ratings are even smaller so what are they doing a smaller and smaller audience a more radicalized view\nThey're desperate they're desperate I'll be right back [noise] month\n\nDo you all back taxes to the IRS you may qualify for the\nFresh start program civic tax relief can give you free information on how the program works they're professionals have over twenty five years of experience negotiating with the IRS they know the proper steps to save you the most amount of money they won't negotiate your tax that and protect you from bank ... wage garnishment call for your free\nFresh start information now eight hundred nine five five eight four wage that's eight hundred million five five eight four oh wait a hundred and five five eight four oh wait\nYou wouldn't put a square peg in a round hole so why would you deploy a traditional firewall in a modern decentralized network\nFire walls have new requirements for businesses leveraging fast paced applications and public clap platforms like a double us Asher and Google Cloud were in the cloud generation now so you're fire walls have to be engineered to fit right in\nReclaim your club at work trying barracuda cloud generation network or application firewall free at barracuda dot com slash fire walls\nAttention all authors page publishing is looking for authors have you read the book and want to get it published page publishing at your book into bookstores and Brazil online at Amazon apple I do in other outlets\nThey handle all aspects of the publishing process for you bringing ... publicity copyright and editing go eat under advisor or one thirty six eighty nine now for your free author submission get that seat under advisor or one thirty six eighty nine for your free author somebody should get again eight hundred visor or one thirty six eighty nine\nOr you or someone you love one of the nearly one million Americans living with Parkinson's disease there is no known cure\nThat you have the power to help the change that and I've read dissipating in a clinical trial the Michael J. Fox foundation will help you get some died in and visit Michael J. Fox\nDot org slash but then I had to download the new park in childbirth discipline and it's free and it's available right now that Michael J. Fox dot org slash his it didn't pack\nLive Christmas the salvation army is fighting to ensure that every child in our community is warm faith and will marry for thirty dollars you could feed a family of four for a week for a hundred and fifty dollars you could be a meal to a hundred and fifty children in need\n... an army provides every nine million nice sheltered do people in need us how to Salvation Army fight for those in need all over our community this holiday season by donating Salvation Army that list and then give dot org [noise]\nThis is a court ordered notice current and former foreign Lincoln and mercury owners are less ... can receive payments and other benefits from a legal settlement related to allegedly defective take on it airbags in their vehicles\nTo see if your vehicle is included and to file a claim go to auto airbags settlement dot com or cold one eight eight eight seven three five five five nine six that's\nSex fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nThat didn't they raised me please not talk to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they use babble the number one selling language learning up in Europe battles award winning technology gives you speaking\nRight away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was added languages but after using battle I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within weeks\nI was amazed that I can start having real life conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning avenue Europe strive for yourself and see my battle is the quick way to get conversational in a new language my Spanish French were more you can try battle for free download the average tax vote job\nTo forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to dry battled for free that the O. C. A. B. till four eight for aid for eight\nLately it seems like everything we use every day is getting an upgrade from the better we sleep in the raise that we use when we wake up but we've neglected one of the more impulsive products in the daily routine that old worn out toothbrush I'm Simon and ... and I'm a product designed them after I learned how important brushing your teeth is overall health I worked with a dentist to ... toothbrush that makes brushing most simple affordable\nAnd surprisingly enjoyable quip how sensitive suddenly vibrations that a gentle on your gums and a built in time of the pulse as the guy do around your mouth all packed into a beautifully slim and dies I leave many um design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with\nFree shipping backed by thousands of dentists quip as one of the first electric toothbrush is accepted by the American dented association upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life where the regional plan sign up now I'd get whip dot com slash W W O and you'll receive your first revealed pack free with a quip electric toothbrush that's your first refill pack free at G. E. G. U. I. P. dot com slash W W O\nIf he stays at sea she's children's research hospital we're fighting against childhood cancer every day at\nThe heart of this battle or our donors most of us want to make some difference in the lives of others saint Jude dead miraculous or\nThe fact that no one has to pay its place where everyone history to visit me [noise]\nEverybody was welcome here and it doesn't matter the religion or what part of the world you're from all that is taken away it just gives you some hope [noise]\nIt's just a nice feeling to put your energy into something that really does genuine we make a difference in a child's life [noise]\nThere's just no grey area [noise]\nIf we have the ability to help [noise]\nAnd when you have a responsibility now\nFinding cures saving children\nSaint Jude children's research hospital find out how you can help at St you dot org three zero\n[noise] was just it was this every day and wants to those\nThings we need everyone\n[noise]\n\nWith the conservative movements simulate package go mark within fifty seven seven three one two three four months I really think\nWe need to look at this at a different level now who are the puppet masters Don Lemon doesn't think for himself Joe Scarborough doesn't think for themselves none of these people do they are being encouraged to do what they do\nThey're being encouraged to do what they do Jeff Zucker runs CNN but who runs Jeff Zucker\nOver Time Warner\nThe faceless nameless suits the corporate executives who enriched sucker who enrich all the editors and producers and\nAnchors and hosts\n\nWho are the suit so or the executives the faces and the names behind MSNBC and NBC beyond Andrew lack that funky\nAlright Comcast you people have Comcast Cable while you're paying for MSNBC\nWho are these people why do they want to bring down our president why do they want to install Democrats\nAnd the house of representatives and in the Senate\n\nYou gotta look behind the curtain like the wizard of Oz and who are these people behind the curtain\nWe spend a lot of time rightly so dealing with the mental midgets that are these anchors and hosts and guests and all the rest\nThey are the mental midgets\nOf Comcast they are the mental manager at some Time Warner who are they\n\nThe masterminds it's not a conspiracy but these are corporations like any other corporations\n\nAnd they have these employees are out front they can see what their employees are doing\nDon't tell me they don't have any say in this of course they do they've created these hate machines and these have machines are constantly trashing the notion of constitutional is on private property rights individual isn't\nAnd Republicans not to mention if president so what do they want they want power that's what they want you might think these corporations\nWhile they should be conservative don't they believe in capitalism no they don't believe in capitalism they believe in centralized concentrated government power so they have individuals\nOr an individual they can work with the get what they want\nThat's why\nMy humble opinion\nSo who are the masterminds behind the ... and the stooges\n\nHave you heard of and oh and I'm referring the nitric oxide or you know it's a gas that your own body makes in the lining of your blood vessels from the time you were a baby\n\nBut with each decade or body produces less nitric oxide on its own now why does that matter\nBecause nitric oxide as a Nobel Prize winning molecule that signals your blood vessels to relax and ... and now super beach by human has harness the power of nutrient rich beach\nThey create a super food it helps your body make more nitric oxide on its own and it's a it's a pure product chemicals one\nTeaspoon daily that's all it takes one teaspoon of super beach daily support your cardiovascular health and blood pressure levels\nGiving you a natural energy without a quick caffeine kick or sugar high real healthy natural energy listener Steve from Illinois who says the taste as great as has the increase in energy great caffeine substitute without the negative caffeine side effects\nI Want to encourage you to try this\nCall eight six six to zero five for nine o seven eight six six to zero five for nine zero seven or go to super beats dot com slash ... super beach dot com slash L. E. V. I. N.\nAnd find out how you can get a free thirty days supply super beach and free shipping with your first purchase\nTry it right now seriously pilots in front of mine eight six six to zero five for nine zero seven or go to super beats dot com slash L. E. V. I. N. slashed living\nTry it out right now and again I don't want to wanted to remind you that my beautiful father's book from my wonderful father\nAre police is out today so if you're thinking about Christmas or Hanukkah or a gift\nFor a child\nOr just thinking about reading them a very wholesome book about law enforcement and how they protect us and in a different ways they do it it's not a propaganda book it's just a good solid American book 'cause that's what my father was a good solid American\nIn my view still is it's a beautiful book you did the illustrations you wrote it that's what he did and\nRight away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was added languages but after using the apple I can tell you I was just taught the wrong way\nUsing Donald ten to Fifteen minute lessons you can be speaking confidently in your new language within weeks\nI was amazed that I could start having real life conversations right away because it's so fast now I'm speaking Spanish\nNo wonder battle is the number one selling language learning avenue Europe trying for yourself and see my battle is the quick way to get conversational in a new language my Spanish French were more you can try battled for free download the app or tax to vote cab\nTo forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for aid for aid for eight\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in to the raise that we use when we wake up\nThat we've neglected one of the more impulsive products in the daily routine that old worn out toothbrush I'm Simon and ... and an opponent designer after I learned how important brushing your teeth is overall health\nI was a dentist to ... toothbrush and makes brushing most simple affordable and surprisingly enjoyable quit sensitive suddenly vibrations that a gentle on your gums and a built in time and that poses to guide you round your mouth old typed into a beautifully slim and died many um design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with\nFree shipping knocked by thousands of dentists quip is one of the first electric toothbrush has accepted by the American dented association upgrade you'll are okay\nAnd stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life where the regional bland sign up now like get quip dot com slash W W O and you'll receive your first revealed pack free with a quip electric toothbrush that's your first refill pack free at G. E. D. U. I. P. dot com slash W W out what\nYou want to sell a squeaking way toward Margaret\nAssuming office noise at muster we can't stop that noise but we can call it all the noise around and finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of the smoker\n... eighty eight months or to talk to someone without noise today\nAid with all the recent news about online security breaches it's hard not to worry about where my data goes making an online purchase was simply accessing your email would put your private information at risk you're being tracked on line by social media sites marketing companies and even your mobile or Internet provider right well that's why I decided to take back my privacy by using ...\nThe pie and expressed VPN has easy to use apps that runs seamlessly in the background and my computer phone and tablet turning on express BBN protection only takes one click expressed VPN secures and ...\nYour Internet browsing by encrypting your data and hiding your public IP address you heard me protecting yourself with expressed VPN cost less than seven dollars a month I Want you to protect your online activity today and find out how you can get three months free and express VPN dot com slash Savage\nThat's E. X. P. R. E. S. S. V. P. N. dot com slash Savage with three free months with a one year package visit expressed VPN dot com slash Savage\nI [noise]\nGet\nIs the Savage Nation as we move into the final phase of the program\nWe have time for a few more corps ... show on line to go ahead please you're on the Savage Nation\nStarting you for taking my call I have to say just as much as ... and other folks who are scared I was I guess Latin folks will cause the Amish Thirteen Days are folks\nThat come from anywhere they could be Islamic terrorists found as a person of coke coke cutter differentiate somebody to his wife was a far right extremist government that could be my neighbor so cannot very very treacherous the structure as far as ... as well\nSo you suspect ... so you think all white males should be one arrested deported or what\nThey are ... are less than ...\nWhile you're raising the issue is saying all white males a suspect to you because you're a man of color is that what you're saying\nIt for the same way about math and as long as\nWell but don't put me on the spot it's my show asked me what you think you called to express your views\nBut this is for you guys that's all you know\nI'm not guys I'm not I'm not us guys I'm not a part of a a group so you're sitting in your house or do you fear all white men\nI cook\nWell what is it in your background that puts you went to such a paranoid state\nNo that's not what's her background as what you guys put in our background so\nHow long have you ever you born in America I assume correct\nCome and matter of fact a native of San Francisco\nYou are and you you do know the history of America do you\nHow you do know who defeated or the Nazis in World War two don't you\nI Know that China is as well\nOne of the let's stop within that turned already we're not in high school who defeated Superman ... who who are the majority of people in graves from World war two\n[laughter] I was you know what this\nWhat are you laughing about what's what do you live because you're not getting the answer you want in your in your little apartment there if it was not for the white male going to war and World War two I wouldn't be here and you wouldn't be here and Ninety five percent of the invention is\nThat we use in our society would develop by white men so what is it you're saying you're trying to make everything into racial thing aren't you\nKnow five percent of inventions were discovered by white man yes that's correct correct yourself okay\nSo I've studied this whole shows on the inventions you want me to go down the list again all of us has so why do you have white people so much what is it that happened to you that has you walking around San Francisco hating white ...\nOh I said I Need to because it's like you like it costs as\nWell obviously you're paranoid lunatic a walks around looking for a fight you're exactly the reason the city is dying it's men like you are destroying San Francisco\n\nHammering [noise]\nHe is giving them the region not close enough so that space between you and me as the the way all the way into the museum and girls ... move in every time you cross my mind here and then\nI like to play the country he claiming okay\nWith Amazon Music to voices all you need to get tens of millions of songs download the Amazon Music yesterday\nReince teaching Children Research hospital we're fighting against childhood cancer every day at the heart of this battle\nOr donors most of us want to make some difference in a life than either saint Jude dead miraculous or the fact that no one has to pay its place where\nEveryone history do this and he [noise]\nEverybody was welcome here and it doesn't matter view religion or what part of the world you're from all that is taken away it just gives you some hope [noise]\nIt's just a nice feeling to put your energy into something that really does genuine we make a difference in a child's mind [noise]\nThere's just no ...\nIf we have the ability to how\nAnd when you know there was constantly\nFinding cures saving children the children's research often find out how you can help it at ... dot org\nWho do I performed for\nEither find from the Austin compose music deserves to be hiring ...\nPrefer for all of a stagehand you\nMake sure I never missed a key\nFor him for high school choir we taught me to breathe and the guys\nA speech debate theater using the performing arts teach valuable life lessons typically aren't taught in the classroom they held high school students learn leadership skills that prepare them to enjoy more satisfying productive lives\nAnd this is having my high school debate parents really helped me become more confident than the average dreamed ...\nThis message presented by the Tennessee secondary school athletic association and the high school in your community [noise]\nFor you who you perform\nFrom the gyms motorcycle sales studio this is W. J. C. W. Johnson sea kings were Bristol accumulate say should gyms motorcycle sales on the motorcycle mile west markets re Johnson City [noise]\nSome bumps troop count grand jury indicted in Senegal killings I'm Christopher cruise President Trump says he's considering sending Fifteen thousand active duty troops to the southwest border too good project caravan headed north through Mexico\nKnown that fear mongering at all immigration is a very important subject the Democrats have less immigration there are countries get out of control with horrible not allowing us any votes to get that we need democratic votes to change the immigration laws avid given us any voter the president\nSpoke to reporters at the White House he repeated his threat to stop sending foreign aid to countries that don't stop illegal immigrants from traveling through their lands to the U.S border the suspect in the Pittsburgh synagogue massacre has been indicted by a federal grand jury\nHas not appeared on CNN or MSNBC\nAnd any significant way or meet the press or any of the rest of it\nThere's a reason why Iraq Obama is not campaigning for John James in Michigan there's a reason why Oprah Winfrey is not campaigning for John James in Michigan and yet Obama's campaigning for Joe I'm In Florida\nAnd Oprah's in Georgia campaigning for another radical\nThere's a reason why a guy named Robert Francis O'Rourke who calls himself veto has re Seventy million dollars on his receiving all this media attention\nFree media attention all other candidates or not\n\nWe're going to have a special show on life liberty and all of them this Sunday ten pm mine is the last of the shows without reruns on Fox on the weekend before the election on that Sunday and I'm going to do things a little differently\nOn that show I'm going to uh do a monologue and I'm not going to do it normally but I'm going to do it in this case because it's an extraordinarily important time in our history and I'm also going to have an expert on the program to go through a number of races that are very close and I consider very important\n\nWe're truly battling a very bleak force they very dark force in this country that do not share our values and principles\nThey lecture us while they attack us they tell us to tone it down why they call our president Hitler\nAnd there's many big it's among them many\nLike Don limit of CNN the thing he said the other day is a fireball offense or Steve Schmidt on MSNBC another big it\n\nAnd the things he has said and I've gone through and look these are firing offense is but the executives the corporate executives on the boards of directors of these companies Comcast Time Warner and the rest they obviously want this\n\nThey want a divided country they want the race baiting they want the anti Semitism coming out of the media\n\nThey don't want a United Nation the United nations\nThey don't want people having civil substantive serious debates\nThey want centralized power\nWith these corporations and these executives believe they can uh they control outcomes in this society\n\nOr we're going to talk more about this is the program goes on but I Want to hit this issue again the birthright\nCitizenship you are hearing people who make absolutely no sense on this issue\nSaying that the president cannot use an executive order to address birthright citizenship again my caviar there that I Know the courts are going to be hostile to any effort\nTo curb birthright citizenship statutory or by executive order\nBut I hear people say a statue will be stronger first of all they're not going to get a statue because it'll be filibustered in the Senate so it's a non issue the Democrats aren't going to allow it they want birthright citizenship\nSome of the filibuster rule in the Senate there will be no statute the president as aware that\nThe commentators on TV even some conservatives they pretend they're not aware of it but we're all aware of it or would have been done already these are the same people in Congress refused to build physical barriers on our southern border to protect this country and to enforce immigration laws suddenly they're going to pass a statute\nOutlawing birthright citizenship but why passed a statute if in fact as the laugh says and some of these conservatives say 'cause they're no not things that birthright citizenship is in the fourteenth amendment which is what Paul Ryan said preposterous\n\nIf that's the case then how is the statue gonna fix statute won't fix it because they're saying you have to amend the constitution when's the last\nTime we actually amend the constitution the old fashioned way or want it to the old fashioned way it's been a long time why because the left changes the constitution all the time and now when we want to address something that they did outside the constitution now we're told we have to pass a constitutional amendment helps her\nAs we discuss\nThe other day\nAs I discuss this Daniel Horowitz from conservative review discussed with me\nBirthright citizenship\nWas not actually implemented in this country into the sixties and seventies the Nineteen sixties and early Nineteen seventies by the bureaucracy\nBy the bureaucracy\n\nIt wasn't in the constitution no court ordered it and the statute was passed so why do we have to amend the constitution or pets or statute while while the better chance in front of the Supreme Court if that's the case we have no chance in front of the Supreme Court\n\nAnd as much as this battle of Kavanaugh was so crucial\nHe's not Clarence Thomas he's not Antonin Scalia and neither is John Roberts\nIt's just what it is\nThe president happens to be right about this president happens to be right about the constitution the president happens to be right about an executive order however it turns out and all of his critics happened to be wrong he knows more than they do\nIs Daniel Horowitz put up there on the conservative review today leftist concocted an ingenious game of judicial sir premises and that creates say one way rash it for their policy outcomes heads they win tails they when you have the so called conservative legal community chooses to play the game\nNo where is this more evident than in the debate over so called birthright citizenship with a left\nCherry picks one non binding footnote of a terrible decision misrepresenting another bad decision that violates previous presidents that plane meaning and purpose of the fourteenth amendment sovereignty and the social Compaq walk collectively ignoring enlist uninterrupted case law indicating the opposite\nOff for the political outcome of giving our sacred birthright to illegal aliens\n\nThe fourteenth amendment representative James F Wilson Republican Iowa the chairman of the house Judiciary Committee back in the Eighteen sixties who helped draft the fourteenth amendment spoke in fat ugly that it was quote\nEstablishments no new right declaring no no principle on quote\nQuote it is not the object to this bill to establish new rights but to protect and enforce those which belonged to every citizen unquote that's what he declared in Nineteen sixty six I Want you to think about it how many states ratify this amendment\nIf they believed it wouldn't be applied\n\nTo illegal alien babies known as birthright citizenship not want\n\nThis madman west pastor protect African American former slaves not foreigners\nYet to be born\nWho have no right to come into this country illegally\nPeriod\nThe notion that an amendment designed to grant freed slaves who lived here for centuries and had no allegiance to any other jurisdiction the basic rights of American citizens will be used as a tool to prevent Congress from regulating citizenship for immigrants of all stripes is scandal is\n\nThe first sentence of the fourteenth amendment all persons born or naturalized in the United states and subject to the jurisdiction thereof are citizens of the United states and the state where they reside we need not speculate what subject to the jurisdiction there are means as I said the other day\nSenator Lyman Trumbull of Illinois the chairman of the Senate Judiciary committee at that time\nSaid during the debate over the fourteenth amendment quote subject to the jurisdiction unquote of the United states means subject to its complete jurisdiction quote not allowing allegiance to anybody else on quote\nOf course persons present inside American territory are subject to our partial jurisdiction in the sense that they have to obey our laws and our subject a criminal prosecution for disobeying our laws but one congressional drafted added the second phase of jurisdiction to citizenship clause\nThey require it clearly limiting citizenship to those who in the words of one of the three key draft ers were subject to complete jurisdiction as American\n\nSenator Jacob power to Michigan the principal author of the citizenship clause of the fourteenth amendment in the Senate explicitly said that candidates for citizenship must be born here and not all allegiance to any other authority echoing Trumbull\nNo wonder battle is the number one selling language learning gap in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language my Spanish French were more you can try battle for free download the app or tax to vote job\nTo forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to dry battled for free that the O. C. A. B. till for aid for aid for eight\nLately it seems like everything we use every day is getting an upgrade from the bed we sleep in to the raise that we use when we wake up\nBut we've neglected one of the more impulsive products and the daily routine that old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is overall health I worked with a dentist to ... toothbrush that makes brushing most simple affordable\nAnd surprisingly enjoyable quip how sensitive suddenly vibrations that a gentle on your gums and a built in time of the pulses to guide you round your mouth old typed into a beautifully slim and dies I leave many um design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with\nFree shipping backed by thousands of dentists quip is one of the first electric toothbrush has accepted by the American dental association upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life where the regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first revealed pack free with a quip electric toothbrush that's your first refill pack free at G. E. D. U. I. P. dot com slash W W O\nMessaging data rates may apply when did it become OK for men to be lazier softer fatter really to bring them into this country back to greatness with age list male Macs a patent pending formula within a greedy or that helps boost your total testosterone promoting greater increases and muscle size and twice\nThe reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by try your first dirty diaper bottle free not tend to not Fifteen days for the full thirty days supply free\nWhen you text the word quick to Seventy nine Seventy nine Seventy dollars just to shipping and handling finally a formula that boost total testosterone if you'll results with age was male ... too and says please decrease use for your free bottle text quick\nSeventy dollars Seventy nine Seventy nine\nText Q. U. I. C. K. to Seventy nine Seventy nine Seventy dog who [noise]\nWho may be out for the day but that doesn't mean the learning has to stop that Bob a great president of the Tennessee education assess the\nFitness success depend on learning in and out of the classroom so after the school bell rings practice math on the way home with your town talk about the latest news and take time to read together every night didn't success as a team effort\nA message from the Tennessee Education Association\nHigher wages one pound one ounce at birth she was one of about three hundred eighty thousand babies born prematurely in the U.S help them are in time for ... babies like higher were born or very thin line up today at march for babies five fifty eight\n[noise] keeping our hands held\nHands off in terms of art show\n\n... [noise]\n\nIf you turn off your radio an open the window you can probably hear him straight from the studio call mark Levin a seven seven\nThree one we have one one you want to open borders you vote for Democrats\nYou want to continue this birthright citizenship without challenge you vote for Democrats\nYou want to destroy Medicare and your private employers supported health care and some of your with your own private health care\nThis notion of Medicare for all which means Medicare for no one then you vote for Democrats and that'll only costs to three thirty two point six trillion dollars in the first ten years and the attorney or a healthcare system of with the Democrats who've done such a wonderful job under Obamacare\nThat's their proposal every one of them are supporting every one of them you want to undermine the United states military\nYou vote for Democrats and I cannot say this too often enough who do you think China's rooting for in this election who do you think Russia's rooting for in this election\nIran North Korea the United nations there rooting for the Democrats\nBecause they want to see the president weekend in bogged down with a thousand subpoenas and and so forth and so on\n\nYou want to see that culture to continue to unravel you saw that Kavanaugh hearings you want to see them shred the constitution and spit in the face of people who they who they make allegations against vote Democrat\nOr better yet shit I'll\nIt to everybody else to try and carry us through cross the finish line\n\nUnbelievable what's going on in this country\nThe bottom of the hour we'll have Patrick Morrisey on the program the attorney general West Virginia and running against a fraud by the name of Joe Manchin who sits there and wait to see if his votes need it or not before he votes one way or the other buddies are shorter vote for Chuck Schumer that way now\nWest Virginia I'm not trying to send this guy in the past year and if the eight thirty arrowhead represented relieves Zeldin represents most of Long Island he's in a tight race another army vet New York first congressional district good man\n\nWill continue to do this I Believe tomorrow we have cruise and some others\nWere doing our part\nPlease write it down a you're responsible for five six seven eight nine ten votes people who you wouldn't normally tell to go vote people that you wouldn't normally make sure vote if there's early voting going on them by God what are you waiting for\nThis is your country it's up to you is your state it's up to you it's your congressional district gets up to you\nAnd that's the truth\nNow\nDo you remember when comedy was great\nIt wasn't political wasn't profane wasn't worried about hurting someone's feeling not like these are these frauds at night\nOr if they're being gone for far too long great comedy is back now announcing see our TVs make comedy great again tour and coming to a performance theater near you\nTonight of one hundred percent clean politic free stand up comedy featuring an entire line of of comedians who are ready to make you laugh until you cry you'll appreciate safe hilarious laugh out loud language during the night of label free tell it like it is vintage comedy\nSee our TV twenty Eighteen make comedy great again or that tour features veteran comedians like Jeff ... brat opt in or all David read in many many more\nSo bring your grandma bring your kids bring the family get ready to experience what comedy was always made to be great fine\nTickets for a theater near you that make comedy great again dot com made comedy grade again dot com that's make comedy great again dot com I'm also in a bit of a mission here folks but I Need your help\nI Need the help of all the living ... out there we have a beautiful book illustrated in Britain are police by my ah father\n\nThis book is entertaining it's a lot of fun it's got beautiful colorful photographs of police in different ah responsibilities\nIt's not propaganda it just supportive of the law enforcement in this country we need to get this book is many hands as we possibly can the hands of adults who will read it to children in libraries\nWill you help me do that it's not about money obviously it's called our police this is how we push back in the culture\nThis is what we do go to Amazon dot com it's right up there on my social sites market living show Facebook Martin live in show Twitter\nThirteen dollars and thirty seven cents it's thirty percent off when a new book comes out that's when they discount at the most\nSo if you're thinking at Christmas or Hanukkah or some birthday or if you just thinking well maybe I'll get in a few weeks you kind of need to act right away to ensure that you get the discount and you get the book within your hands twenty four to forty eight hours from now\nWant to encourage you to to acquire it I Want to encourage you if you go to a bookstore beautiful book stores all over the country I Love bookstores and there are there as well\nOur police if I don't mention it nobody else will my dad's not here to mention that it's not on Fox it's not on the you know I think that it here I mention it\nSo I wanted to mention it to you know\nI Want to swing back into Florida this Florida race is particularly important as far as I'm concerned\nOne nine Seventy seven Ninety six\nIf you can't seem to stay ahead of your bills than this messages for you how would you like to have a large portion of your credit card debt medical bills and department store debt forgiven\nNational credit card relief would like to give you free information on a proven debt forgiveness program this program has been used by thousands to legally forgive millions and an secured that it's not bankruptcy it's not consolidation this special program actually wiped clean the portion of your debt that his forgiven from what you owe your creditors\nGoal for free information and get all your questions answered in the first free call the more you owe the more you can save\nIf you have at least ten thousand dollars or more in credit card bills this debt forgiveness program can be very effective\nCoal for free information and find out more now eight hundred to knowing one six six seven oh there was no cost or obligation for the information the old way called eight hundred to nine one six six seven oh let's see hundreds to low in one six six seven to get your dead problem solved ... eight hundred to nine one six six seven oh today not available in North Dakota\nUse credit card debt ruining your life\nNow you can have a large portion of your credit card debt forgiven get relief today wants to give you free information that shows you how this program is proven to work for credit card debt medical bills and department store ...\n... people have used it to have a portion of their credit card debt forgiven call now for free information and their consultation we'll give you the sequel to this money saving program absolutely\nFree get all your opening information that could save you thousands of dollars a year or a month depending on how much you owe direct the more you over the more you can see all you need to oh ten thousand dollars or more in credit card debt medical bills or department store debt to qualify to go for free\nDebt forgiveness information now at eight hundred ... eighty five fifty eight hundred do oh seven eighty five fifty eight\nDiscovered the secret to having your credit card debt forgiven call eight hundred too old to have an eighty five fifty eight hundred to a seven eighty five fifty eight\nListen to this the IRS hired a small army of private collectors now if your heart just skip to beat chances are you oh the IRS because hearing the most powerful\nCollection agency just got more powerful is scary if you owe the IRS do what listeners penny and Ken is dead and ... optimist tax relief they own a lot of money and they were living in fear of losing their savings their retirement their business everything I can stop the aggressive collection actions\nAnd stop the small army of tax collectors from targeting them I've got my nose up behind every tax problems are honest hard working Americans with families\nHomes savings in paychecks that need protection they're experts in the fresh start initiative\nThat say special Irish program that could save you a thousands\nTens of thousands if you qualify that's just one way optimum has resolved over half a billion and taxed at for their clients call them a tax relief\nAt eight hundred for nine nine sixty three hundred eight hundred for nine nine sixty three hundred that's eight hundred for nine sixty three hundred\nWondering what is daily or don't do so much with\nJulie ... [noise] [noise]\n[noise]\nI Would like to remind eighties started I Believe that's her name on the all star panel on their show\nThat Donald Trump didn't quote unquote throw this issue of birthright citizenship out there he was asked about it by two reporters and the other day and he was surprised that they knew about what his discussions were going on in the White House\nAbout how to address it it wasn't trucks and throw it out there the reporters asked him about any honestly responded to it\nMore overheard comment that all legal scholars believe you need a constitutional amendment\nA constitutional amendment is ally\nMany of us don't believe you need a constitutional amendment and I now spent multiple shows over the course of a decade explaining this issue but because the media no more than you and I think the media have a narrative because the media hate this president and like these left wing policies that\nWhat you're going to get that is what you're going to get\nIts this Aggie jokes on line ladies and gentlemen it's his jaw line and the double chin that give you your age your way but not anymore introducing the brand new Gen assumption and that treatment with dual peptide in empty of technology ... most advanced technology ever\nIt not only tighten shaggy\nDraw lines but it clumps the life of layers of your skin the contours and define the draw a line within minutes\nUsing peptides and metal lack tones together for the first time it works amazingly quickly\nAnd the results get better every day nothing else works like the new Gen itself chin and that treatment to sculptor chin and smooth out that annoying turkey neck and here's the best news it's yours free\nWhen your water Janice south for under I bags and puffing and for results in twelve hours Janice out immediate effects is also free\n... eight hundred skin six so for eight hundred skin six four are good agenda south dot com right that magic that double chin disappearing in about a week with genesis chin and that treatment\nNow stop imagining call or click right now eight hundred skin sick so for eight hundred skin six so for\nOr gender Sal dot com once again I challenge Paul Ryan ab started all these people\nTo demonstrate to you and me\nAre the people who frame that constitutional amendment\nThat people who passed in Congress people who voted on it in the states yesterday morning said it would apply to illegal alien children and provide first show me any statute\nThat provides for that and they tell me why we a constitutional\nAmendment that I Am sick of these more on the on Bali [laughter]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nTrue struggle border synagogue shooting at like Christopher cruise President Trump says the number of troops he will send to the southwest border could go as high as Fifteen thousand he told reporters at the White House today the soldiers would be used to prevent the entry of migrants now traveling in a big group toward the U.S from Central America\nFive Senate seats for Florida for everybody else's supporter\nBut man suspected of killing eleven people in the synagogue in Pittsburgh Saturday morning was indicted by a federal grand jury today Robert\n... has been charged with forty four counts including hate crimes prosecutors after they will seek the death penalty three more funerals today vice president Mike Pence was campaigning in Ohio this afternoon President Trump made\nYou need to vote and you need to bring several people eat with you or make sure that they vote or that type of ...\nWhat you're going to see and you're going to see smiles on the face of all this so called anchor citizen journalists such CNN and MSNBC they're going to have parties and the news rooms or the wall a Washington Post and New York times parties and the network news rooms\nWhile you're solid while you're depressed been frustrated\nIt's not enough to vote that's the minimum you got to get out there and be an activist you gotta take care of business early voting that still going on now so it's time for\nAll election day Tuesday Morning which is where I'll be at the precinct\nAnd I'll bring several people with me right at least on make sure they're voting with me I Want\nAll of you all of you to vote all of you if all of you out\nAnd you ensure that four five six seven eight other people vote we will crush them\nThey won't know what hit them\nThey won't know what hit them\nLet's talk about some of these races now this guy Donnelly is I've taken a fraud you pose as a moderate in Indiana he voted against Kavanaugh he votes for\nSchumer he says sure my guy is that funky he's just a huge people of Indiana home to Mike Pence\n\nIs made it must be replaced what brought you have a very good candidate number on\nAn outsider a businessman\n\nPeople of Michigan you have a wonderful Kennedy and John James\nAnd African American conservative a constitutional is a combat veteran a successful small business man\nHe's put everything aside to offer himself to you as a senator\n\nWhat a wonderful senator he would be Michigan this is a very very important race Montana\nYou have a wonderful candidate running against fraud\nTester\nAnother fraud pretends he's a moderate when he comes back to Montana buddy comes to Washington DC and I think he's from Massachusetts\n\nThe libertarian has dropped out of that race in Montana unfortunately a little late because of all the uh early voting but nonetheless Rosendale develop all you need to vote for him\nFlorida\nYou have a very very successful governor Rick Scott\nYou have\nA worse than mediocre senator and Ben Nelson who exists for the purpose of filling a seat ain't giving a yes vote to Schumer\n\nThat certainly is Ben Nelson almost half a century and effective\nI'd happily governor or back venture after all these decades in the United States Senate\nYou have an opportunity Florida and make a big difference and I'll get back to the governorships in a moment\nIt's a big deal Kansas I'll get to you in a moment to\n\nNorth Dakota Heidi Heitkamp has been a fraud for decades just like this guy Donnelly in Indiana\n\nJust like this guy Donnelly in Indiana it's up to you\nTo send somebody who truly represent you stayed in this country\n\nAs many Senate races that are very very important look at Arizona\n\nMix Sally look I Know ... rhino let's not play games I Know people are trying to pretend she is a concern I Know she's not a conservative but my conservative brothers and sisters\nDon't sit on the sidelines don't sit on the sidelines\nYou\nTruly have a radical hate America candidate running for the Senate from Barry Goldwater's Arizona\n\nPlease don't send it to the United States Senate\nYou know better so I'm calling on all my conservative living nights in Arizona were not thrilled with Mick Sally I got it I understand but if I were in Arizona I Would vote for\nInstead of Taliban\nOr the Senate candidate on the Democrats are quite serious about this the vet\nHeller I understand that\n... bit of a rhino I got it I Know that\nBut he's got a slight lead and again his opponent is a radical leftist see this is what's going on throughout the Democrat Party the Democrat Party day it's like one of these radical left wing European parties so you have to vote to stop them\n\nAnd if I Lived in that state I Would vote for Heller\n\nRight down the line that's the kind of election that is\n\nYou need to send to hell her back to the United States Senate so all my conservative friends brothers and sisters there you have a wonderful man running for governor to Adam lax all\n\nHaven't talked much about that campaign we tried to get them on but we can't seem to get through\nI don't know why\nHis grandfather and I were very good friends dear man and Adam ...\n\nHave a great opportunity there and you're governorship I run the in Nevada it'd be voting for lack salt and Heller no question about\nNo question about Texas\nThough I really need to remind all you live in I should conservatives in Texas how important this races to repudiate Hollywood to repudiate the big media to repudiate this fraud\nRobert Francis Rourke\n\nYou don't they don't really need me to tell you this to you and yet that's what needs to be done\nMore when I return on\n\nIndividuals and businesses with tax problems listen carefully if you owe over ten thousand dollars in taxes or I've on file tax returns us actually can help you take back control the IRS gets easier but I get ... as your paycheck\nClosure business and file criminal charges our team of tax attorneys getting stopped elections and get you protected us actually offers a price protection guaranteed to get you protected today us tax field is a plus rated with the baby so called eight hundred by one Seventy\nUh Ninety six us to actually build eight hundred by one nine Seventy seven Ninety six\nAttention all authors page publishing is looking for authors have you read a book and want to get it published page publishing we'll get your book into bookstores and Brazil on line at Amazon apple I do is in other outlets\nThey handle all aspects of the publishing process for you printing ... publicity copyright an editing go eat under advisor or one thirty six eighty nine now for your free author service you get that seat under advisor or one thirty six eighty nine for your free author somebody should get again eight hundred buys zero one thirty six eighty nine\nDoes your basement or crawl space a damp must be smell will watch out that's a sign up too much moisture and not enough ventilation\nAnd that could mean increased mold growth and build up of harmful toxins gases don't bother with a D humidifier if just circulates the same on healthier now there's a better way to remove these dangers in odors it's with the computerized wave ventilation unit that reduces moisture and expel pollutants\nWith wave units there are no buckets of water or filters and they cost only pennies a day to run wave can transform your home into a drier healthier environment satisfaction guaranteed ask about our indoor air package that includes the wave ventilation unit\nPlus a sixth stage portable air purifier dealer opportunities available for more information visit dry house now dot com that's dry house now dot com or coal eight eight eight nine seven nine wave that eight eight eight nine seven nine W. A. V. E. phones\nMade calm\nOr you or someone you love them one of the nearly one million Americans living with Parkinson's disease there is no known cure\nThat you have the power to help the teams that played dissipating in a clinical trial the Michael ... foundation will help you get started and they didn't Michael J. Fox dot org slash by then perhaps did download the new parking child participant\nMan it's free and it's available right now that Michael J. Fox dot org slash his a pack [noise]\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for aid for aid for eight\nI'm going to take my little feet to the vet and I did read it I did buy into the binge creek animal hospital dogs and cats have separate entrances an exam areas limiting\nThe stress on pins and their own are closed up their ten down the ads and his staff treated like a member of their family that does it I'm going to feed ... animal hospital for her next to a point that they're at Seventeen the oh great station rode the creek\nCalled relate to one eighty seven Greek animal hospital goal is to make your pet healthy happy\nRefused even if you're not close enough so that space between you and me food in the way all the way into the music girl that body anyway you move and Everytime he crossed my mind you're allowed to ...\nI like the play the country he play list okay\nWith Amazon Music of voices all you need to get tens of millions of salt download the Amazon Music app today\nFollowing is not an actor but a real life story from trinity debt management\nMy story begins with that a lot of debt credit card debt and I heard a commercial for trinity I gave them a call\nIf you're in depth and you need help hold trinity a one eight hundred seven for one eight to ...\nWhen I first called I was a little embarrassed and kind of a shame and I looked at the numbers and I saw how quickly that astronomical debt that was in my life would go way\nCritter he will consolidate your accounts into one easy to manage monthly payment reduce your interests and possibly improve your credit score you'll save thousands what I Would\nTell other people please pick up the phone and called trinity just let them put together a program and see how affordable and easy it is to pay off your debt\nCalled trinity a one eight hundred seven for one eight to ... that's one eight hundred seven for one eighty two oh five\nSix [noise] is reducing the YMCA\nYou already know the one who are so you think sure you know the wife or a swim or worked out even a game of food with did you know we're more than that\nWe're a cause when you take your jumps on his watch someone else is getting job training [noise] take the cardio but [noise] once kids are in an after school enrichment program [noise]\nPractices our facing dogs as its practices are leaderships do\nWe were would people no matter their age income or background and give them the opportunity to learn grow and thrive [noise] old with one simple goal in mind [noise] when the news [noise] and we got so much more that does just that [noise]\nThe one you might think of the wives that plays the with the way we're also about lifting [noise] higher [noise]\nWe're so much more than a place will cause the YMCA dot net last more\nThink fast in the short time it takes to listen to this message a small plane can turn into a big fire\nSeveral minutes more and stick poisonous smoke may have filled your lungs and reduce your ability\nTo respond to that five and your entire home\nThey'll whistling [noise]\nOften\nWorking smoke alarms and he Peters three feet away from anything that can burn\nAt USF said that FEMA ... they could fire is everyone fable in North Dakota\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\nJust in time for Halloween they're Chuck Schumer and Nancy Pelosi nightmare continues call an age seven seven three one two three one one [noise]\nPatrick Morrisey is the attorney general of West Virginia he is a conservative views a constitution list he doesn't have to wait for the Democrats to vote to figure out the way he should vote he will not vote for Chuck Schumer to be the Democratic leader in the United States Senate how are you Patrick Marcy\nI'm doing great work will bend thanks for having me on your show I'm a big fat and I'm really excited to be on line and talking about the big issues and the U.S Senate race has got to be a lot of fun\nWell it's my pleasure go ahead and tell us the big issues where you stand where your opponent stance\nAbsolutely well I think as many people are beginning to really follow this us\nYet they're seeing that there couldn't be a bigger contrast between the Republican and the Democratic candidates and let's start at the base is I'm a conservative fighter mark you know I took on the Obama administration I sued them we had big victories in court\nIt was West Virginia that led the way to defeat the Obama power plant that was just this amazing power grab over the United states energy supply we lead the way built the twenty seventh state coalition we stopped Rocco bomb at the U.S Supreme Court fact it was the last major decision\nOf Justice Scalia's lights that was the big deal we've let on many other big issues taking on the federal government in their own lawful unless I'm strongly pro life\nBy all the pro life groups because not only check the box on the issue of why I Believe in the sanctity of life and I'm actually in part responsible for a lot of the changes which have evolved in West Virginia so we have protections for the unborn\nI'm also strongly in support of the second amendment in our gun rights and we're working tirelessly to help President Trump we think President Trump has been doing incredible things for the country\nAnd for West Virginia and I'm proud to stand with him were running a campaign partnering up with this president because he is helping turn us around now the flip side of that\nIs you're dishonest Washington liberal Joe mansion and he's just another one of these Washington politicians he went to Washington he drank the water\nNow he's in cahoots with Chuck Schumer Nancy Pelosi and all the radical liberals including Hillary Clinton on the issue of life he sold out west Virginia values he actually literally had signs saying that he supports Planned Parenthood and also that he stood with life\nThe issue of life that's not a multiple choice questions you need someone who is pro life who opposes taxpayer funding of abortion\nWho wants to stop the government funding a Planned Parenthood on the issue is Second Amendment we need someone who's going to stand against the gun grabbers mansion is best known for offering a big gun control bill and on the issue of coal\nOh as to say is this he doubled down on his support for Hillary Clinton even after she said we're going to put a lot of coal miners and coal companies out of work big differences between dishonest Washington liberal Joe mansion\nAnd conservative fighter Patrick Morsi and that's why we're going to win an election day in West Virginia\nYou know Patrick Morrisey there's a reason why Donald Trump keeps coming back to West Virginia to support you just because he not only support to he doesn't trust Joe Manchin and I noticed throughout his career in the Senate he waits and wait and wait to see if he can throw a safe vote\nThat isn't with his party he doesn't lead on anything am I right about this\nYear right and I think vice president Mike Pence said it very well he said quote Joe mansion is always there when you don't need him and\nYour great live off that terrific line and and really accurate about match ...\nNow what are your priorities among other you you mentioned a number of them is ... supported the president's tax cuts you reject this caravan you went to wall on the southern border\nRunning man well absolutely so let's START I agree with all the above the Trump's tax cuts are good for West Virginia\nNot only doubling the standard deduction which helps a lot of hardworking families and our state the lowering of the rates are but we also have other changes here they're really hoping lift our economy up to levels we haven't seen before when you combined the Trump tax cuts more with the deregulatory approach\nI mean let's face it under the ... Obama era they tried to put a lot of organized for profit businesses out of work and certainly they went after fossil fuels\nI stood up and I said no to that nonsense when I found those lawsuits and President Trump well he's just finishing the job I was basically the bridge to President Trump who's done so many great things for our economy and for energy jobs in West Virginia\nWe need to continue that approach of lowering our taxes and\nThen ultimately be regulating so that regulations fulfill a more basic purpose markets you know were meant to be a free people that\nMeans we should try to solve most of our problems\nEither individually or within our communities on the local level when you have federal regulations in place there has to be a very compelling health\nSafety well for aspect to it and it obviously must comply with the constitution and that's part of the problem with the rock Obama era or they went so far beyond the pale President Trump is doing it right and we know unfortunately Joe mansion his first vote and the U.S Senate would\nHave power Schumer and that radical team that was on full display of obstruction and resistance during the judge Kavanaugh nomination\nBill adding to your financial misery this allergy season has been one of the worst in the years so now is the perfect time to order a new set of age backers Brazil's or by dot com with over six hundred scientists to choose from including custom options you'll find the perfect and shipped breathing\nWithin twenty four hours with filter by dot com they're made in America that\nStill to be why dot com\nEmail phishing attacks cost businesses billions annually in real cash data loss and brain damage fishing emails are hard to detect it gives the messages appear to be legitimate to unsuspecting employees\nIntroducing barracuda fish lying a groundbreaking cloud based solution designed to ... recognized sophisticated email phishing attacks do interacted training reinforced by continuous simulation transform your employees from the liability into a line of defense\n... barracuda dot com slash piano to learn or\n[noise] ... [noise]\nGet in line behind mark and mark love and radio show [noise]\n\n\n\nHear a lot of activity which trick or treaters\nNow my own view about this is the fewer trick or treaters of the better you know I'm Mr producer exactly more candy for me I'm just kidding for crying out loud\nThere was a time at the bunker when I used to put out I've told you this before a big bowl of Hershey bars I don't mean the tiny little ones one bite I mean the big ones and not the big big ones but a real Hershey bar\nAnd they used to put out a big bowl of them used to have like ... and them and I would do it during the course of the broadcast during the break into a few years ago", "show_name": "Mark Levin Show", "year": "2018", "city": "Johnson City", "day": "31"}