{"month": "10", "state": "MA", "station": "WBUA", "content": "Protests independent journalism no and get entered into all of the remaining prize drawings in our fall fundraiser including today's prize that our grand prize your choice of twenty Nineteen Subaru cross truck part of that\nProvided by city side Subaru a villa give no that WVU our daughter was or call one eight hundred knowing zero nine nine to eight seven\nWere funded by you our listeners and by convince years organizing special events throughout New England for science large and small their team is ready to bring your brand to life more it can ventures dot com slash create\nAnd innuendo providing shading systems for businesses and homes their design team can help you find window treatments for life he prided and glare issues and you win donated canned innuendo dot com [noise]\nFrom Boston University you're listening to naughty point nine W. B. U. R. S. in Boston home a Boston largest radio newsroom now due to point seven WB you wait his very eighty nine point one WVU wage Brewster and streaming at W. B. U. R. dot org\nW. B. U. R. Boston's NPR News station\nLie from NPR News in Washington I'm Laurie London President Trump is again answering questions about Supreme Court nominee Brett Kavanaugh he spoke to reporters just before departing the White House for Philadelphia\nWhile I say that it's a very scary time for young men in America when you get the guilty of something that you may not be guilty of which is a very very very difficult time\nThe FBI meanwhile continues to investigate allegations of sexual assault and misconduct against Kavanaugh even as Republicans schedule a vote NPR's Windsor Johnston reports the agency is working toward a friday deadline to release the findings of its weeklong probe\nThe FBI has interviewed friends of both cats at all and his initial accuser Christine Blasey Ford\nThe agency has also spoken with a second woman who claims Kavanaugh exposed himself to her at a college party in the Nineteen eighties Democrat Chris Coons who sits on the Senate Judiciary committee says all sides need to brace for what ever comes to light\nAgreeing that we should have a week for a Folsom but time and scope prescribed FBI investigation we have to recognize raises the possibility of Kavanaugh being cleared and the possibility of Dr Ford being corroborated\nSenate Republicans say vote town Kavanaugh's confirmation will come later this week Windsor ... NPR News\nThe Pentagon says it has detected a suspicious substance on July ... that arrived at its mail screening facility NPR's Greg Myre e has more on this investigation\nThe Pentagon says the envelopes were discovered on Monday at the building where all incoming letters and packages are checked the building is on the Pentagon grounds but not inside the Pentagon itself\nThe FBI says its agents took control of the two letters on Tuesday Morning and the bureau is conducting a more detailed analysis neither the Pentagon or the FBI has officially identified the suspicious substance all other male that arrived at the Pentagon facility on Monday is currently under quarantine\nGreg Myre ... NPR News Washington\nSenator Bernie Sanders who has been a longtime critic of Amazon's pay practices it's saluting founder Jeff Bezos for announcing that all employees will now be paid at least Fifteen dollars an hour\nToday I Want to give credit where credit's is do we want to congratulate Mr ... doing exactly the right thing\nAmazon's wage increases\n... says it will have a significant impact on employees and their families\nAmazon is among NPR's financial supporters on Wall street stocks are rallying for a second straight day the Dow is not a hundred and sixty six points the S. and P. five hundred gains for this is NPR\nNews this was Ninety point nine WB you are on ... in Boston\nWell it's not New York not Los Angeles and not Chicago Boston as the worst traffic in the country that's according to the company geo tab which gathered a year's worth of data through their own GPS products they found the Boston\nAnd it was the largest drop an average speed during rush hour of any city in the U.S [noise]\nA former janitor Logan Airport suing the contracting company that fired him saying they discriminated against him for his Roman Catholic faith or ... Cruz says a supervisor told him quote call your God do clean urine and quote\nMassachusetts General hospital joining an international trial for an experimental drug to treat the bowl of virus\nCountry the hospital says that while there are ... currently no Ebola patients in the U.S preparedness is important in case of an outbreak in the forecast cloudy skies today with scattered showers highs and the upper sixties\nMore showers tonight Los dropped down to the mid fifties right now it's fifty eight degrees in Boston this is W. B. U. R. we're funded by you our\nListeners in Massachusetts General hospital where better research leads to better care innovative treatments for complex conditions to get you back to the life you love Mass General revolutionizing care\nOnce again this used W. B. U. R. jak levy ours here now in the studio with ... percent of the uh enlist thread podcasts we're asking you to do your part and support the news here at this fall fundraiser we have an hourly goal of ten thousand dollars that we need to raise this hour to stay on targets\nTowards meeting are larger goal of raising almost six hundred thousand dollars by the end of the day on Thursday it's a lot of money but we can get there with your support tens of thousands of people have pledged to support Wu argue\nNow can become one of them here's how you do what you call one eight hundred nine zero nine nine to eight seven when you do that you get entered into when this trip for two to China with National Geographic expeditions and don't forget you can also pledge right online at our website W. B. U. R. dot org Jackie\nSaid that was ten thousand dollars and we now in three o'clock yes ma'am okay so we need to show WB you are that the Tuesday two to three o'clock listeners mhm are uh are behind us are are the best listeners [laughter] air the water out the challenge right away [laughter]\nThey are the ones that know how much this radio station means to them and they are going to support it because WB you are is there for them every day and they're going to pick up the phone right now and say hey\nI'm going to be there for WB you are because I care about programs like fresh air that I'm listening to right now so if this sounds like you if you have not picked up the phone yet and then there for W. B. U. R. why not why not do it right now we need to stay on track we have an ambitious goal but you are a part\nOf the community that has kept WB you are strong and has made it stronger and stronger year after year and you can do that now for us let's get that ten thousand dollars well before three o'clock one eight hundred nine zero nine nine to eight\nSeven I Love how you been in there for two minutes you're already throwing down the guy ... up jak fired um we're we're trying to raise ten thousand dollars this hour Amory says that should be no challenge for the listeners\nOf two to three o'clock we're going to go back to fresh air and just a second we've got to\nAn hour long conversation with Aretha Franklin an archival interview with the late Aretha Franklin but remember when you pledge today at any level you will get entered into windows sweepstakes we have today and today is your last day to get in on this trip for two to China with National Geographic expedition\nTen days nine nights it includes roundtrip airfare meals accommodations and transportation all of this arranged by National Geographic a wonderful wonderful trip that you could win\nJust by doing your part here to support the news at WBUR you are one eight hundred nine zero nine nine to a seven or of course on line at W. B. U. R. ...\nWho sorry we're down to Ninety five hundred dollars okay who's gonna knock out the next five hundred dollars and the next five hundred dollars or five hundred dollars is you know not in your budget I totally get it I really do a let's think smaller how that ten dollars a month how 'bout twenty dollars a month or maybe at one time contribution of of you know a hundred and fifty\nFigure out what your part of that is right now because we're going to get to ten thousand dollars by the end of the hour and we need you to help us get there if everyone out there listening during this hour picked up the phone right now we'd be done like that because that's how this work\nHow that's how this works everybody says I value WB you are I wanted to stick around I got to do my part one eight hundred nine zero nine nine to eight seven is the numbers\nNine thousand so far the two to three o'clock listeners down to ... thousand that's still nine thousand do that we need to raise by three o'clock to stay on target just fifty one minutes left\nSo don't delay on this make your call now make your pledge to say yes Wu are something that I Want to keep strong that I Want to keep vibrant\nThat I Want to keep independent and growing so that I can continue to have this reliable source of news and information here in the Boston area plus on top of that you're going to get entered into when the strip or to to China with National Geographic expeditions and\nI should say this because we are going to go talk with Aretha Franklin on fresh air\nWe've also got this special gift is thank you get where you just pledged ten dollars about ten dollars a month to support the news you'll get a copy of Aretha Franklin's definitive soul collection as our Spanx to you to to discuss the future uh between thirty of her best loved hits\nYours for ten dollars a month and of course you get entered into when this trip for two to China with National Geographic expedition nine thousand dollars we need to raise by three o'clock we can get there with your help\nAh my dad and I think appreciated gifted artist we just didn't\nHave that problem in our home rocking Woodley Roy used to come on when I Would come in from school it was a very very big uh R. and B. broadcast of the day when I was young girl and I would come in and put my books down and lie down on the floor and listen to rock and will lead rowing [noise] um my dad\nReally appreciate it music he appreciated a gifted artist as I sit and she never tried to limit us in any way with respect to music or anything like that\n[noise] was describing your new autobiography great performers like Nat Cole an Art Tatum knew your father and her and with sometimes being your living room at the piano that must have been yeah that's true\nUh-huh ah our trade them was often a visitor in our home he was very good friend of mine dance a Oscar Peterson and at the price uh um but yeah you're Jackson of course James and he loves Sam's Sam Cooke\nA and he just a really very broadly appreciated um one's artistry when they were truly gifted and really good\nWe're listening back to the Nineteen Ninety nine interview I recorded with the release of Franklin\nYour support has helped preserved at thirty plus years of interviews that we have recorded\nAnd if your support that helps us continue to bring you interviews with the artists creating a popular culture of our time we'll hear more of the interview after a break but first I'm asking you to become a member of the station thank you so much this is fresh air\n... used WB you are online the W. B. U. R. dot org ... year in the studio with Emory secrets in from our\nEndless thread podcast you can do your part to support the news here at W. or help us reach our goal for this hour and here's where we stand we need to raise eighty five hundred dollars before three o'clock it's eighty five hundred dollars and the next thirty eight minutes in order to stay on track\nTowards meeting or larger goal you moves fall fundraiser of\nAbout over five hundred and Seventy thousand dollars that we need to raise by the end of the day on Thursday that a lot of money but we can get there and we can get there with your support for asking you to pick up the phone\nMake the call the w._b. war at one eight hundred nine zero nine nine to eight seven or go right on line to W. B. U. R. dot org\nOne eight hundred nine zero nine\nNine to age seven eighty five hundred dollars left to go in this hour okay so we have to bring that down to zero we're going to do that\nYou don't have to donate the eighty five hundred dollars you yourself alone I mean if you can that's great and Jack said we have a lot of money that we need to raise\nBetween now and the end of the day tomorrow so really do what you can for WB you are but let's think about it more as you just doing your part whatever that part is is it ten dollars a month is it twenty dollars a month\nOr is it a one time contribution if that's something that's easier for you you decide but here's maybe a little extra a motivation for you here's Wendy Halloween and who is one of the people who has already done her part to protect independent journalism\nI think everybody knows how polarized things are in this country and one of the things that I treasure about NPR is that they are more facts base and they are truly the fair and balanced medium\nI don't always agree with some of the interviewees and I'm sure that other people don't agree with other interviewees but I think it's essential for us as a country to come together by trying to understand people that don't feel the same way as we do\nAnd you can't do that unless you can listen to them\nWhen they call in from the cats that she's done her part and join her in doing your part if you value what she was talking about opinions that you might agree with opinions that you don't\nInformation that the kind of keeps you well rounded and grounded and you know having a real sense of what's happening in your community what's happening in the nation what's happening in the world do your part eighty five hundred dollars led to go left to go here what is your pardon\nAnd nine to eight seven were actually down to eight thousand dollars I Would have in the next ... thirty five thirty six minutes or so we want to remind you also\nThat this is your last day to get in on this trip for two to China with National Geographic expeditions now that's a sweepstakes that you might win what you can definitely get is if you pledge of the ten dollar a month level will send you a copy\nOf Aretha Franklin definitive soul collection as our thanks to you\nOr your gift again of ten dollars a month to disc CD features\nThirty Aretha Franklin's best love hits it also has some cover songs\nAre like her the Beatles Elena rigged the or her take on Simon and Garfunkel bridge over troubled waters is is a great uh either you either get it for yourself if you want to read the Franklin fan you could get it for them and also get entered into wind district for two to China with National Geographic expeditions\nThe number to call one eight hundred nine zero nine nine to eight seven or online at W. B. U. R. dot of what\nWe're funded by you our listeners and by Geico protecting people and their vehicles rover Seventy five years guy go is proud to offer car insurance in ... Massachusetts drivers to\nAdditional information a guy go dot com or one eight hundred nine four seven auto touch one eight hundred nine four seven eight you'd see all\nThis is fresh air and Terry Gross\nLet's get back to my Nineteen Ninety nine interview with a wreath Franklin and interview we feel especially lucky to have recorded since she rarely gave interviews your support has enabled us to build our archive and were so grateful for it in this next part of the interview a wreath attacks about her friendship with the sole and gospel singer Sam Cooke\nSo let's hear nineteenth recording Sam Cooke hit song\n\n\n[noise]\n\n\nYeah\nHe ...\nThe great gospel singer turned soul singer how did you mean [noise]\nSalmon I met at a Sunday evening program that we had in our church I'm back in the early fifties and uh I was sitting there waiting for the program to start after church\nAnd I just happened to look back over my shoulder and I saw this group of people coming down the aisle and oh my God the man that was leading them spam and his brother Elsie and\nThese guys were really super shocked you know beautiful blue when navy blue and brown trench coats and\nI had never seen anyone quite as attractive a not a male as attractive is Sam was um and so prior to the program I saw was kind of being stirred\nOr in another way [laughter] [noise] well we got crushed over from gospel to pop before you can what impact did it have on you and you know having a hip hop song on the radio\nWe were going down the highway we were somewhere in the south and uh my sister and I and the driver and maybe one or two other people in the car\nWe knew that he had left the gospel field and of course I was rather sad about that but um as as we were driving we knew that he had recorded and just out of the dark\nSeamus fabulous voice was Sam and it was his first record and he was singing\nYou send me and there was just pandemonium in the car my sister and I just had a fit we really had to pull over and stop the car and settled down I I kind of saying it's his record you know it was like that you're saying\nKnow and there was just so much excitement in the car the driver really had to pull over\nWell you're living in Detroit you when you decided to make pop records I mean the the obvious choice I suppose would have been Motown\nSince Barry Gordy was a friend of the family I guess more time was a very new label at the time but um did did you consider Motown\nWithout the support of our listeners to thank you for that before we get back to the recent interview I Want to urge you to support this station during its membership campaign thank you so much this is fresh air\nWere funded by you our listeners and by commonwealth learning center one to one multi sensory instruction for students with learning challenges C O M M learn dot com learning differently teaching differently succeeding\nAnd try to booksellers in cafe a Newbury Street no reopened family owned since Nineteen eighty four with a full service restaurant selection of books and gifts and nightly events\nNice used W. B. U. R. jak NPR's here in the studio with Amory secrets in to tell you about our fall fundraiser we are a\nWe have a goal we're trying to meet this hour and we do need to pick up the pace just a little bit if we want to meet that goal and the goal is we need to raise sixty three hundred dollars by three o'clock if we want to stay on target and and meet are larger goal of this one fall fundraiser and ending this fall fundraiser\nStrong and successfully a on Thursday so here's how you can do your part and help support the news here at W. B. U. art by calling one eight hundred nine zero nine nine to eight seven or by going online to W. B. U. R. dot org\nYeah and if you were a loving listening to Aretha Franklin as much as I Am\nIf we had that sixty three hundred dollars already I'd say just play or the rest of the [laughter] let's just do that but if you're enjoying this as much as I Am if you contribute ten dollars a month right now the w._b. you are you're going to get a copy of her definitive soul collection and our thanks to your uh for your contribution here it's a two disc\nCD featuring thirty of her best love hits\nAnd also have some had some of her best known covers and some lesser known covers\nThat's the one eight hundred nine zero nine nine to eight seven is the number to call to get a little something back\nLike that as our thanks to you for doing your part but the reality is we've got to get that sixty three hundred dollars we know we can get their meaning to you out there listening to step up to the plate and shit then do your part whatever it is one eight hundred nine zero nine nine to eight seven\nWe're down to fifty nine hundred dollars we need to raise and the next Nineteen Minutes Eighteen minutes really or so and don't forget 'em you can get that Aretha Franklin a definitive soul collection as arc thanks for ten dollars a month but any pledge at any level still gets you entered into wind district for two to China with National Geographic expeditions\nUh this is a ten day nine night trip that includes round trip airfare it'll be a private toward Beijing you'll go to Shanghai will go to see on where you can see the the terror Cato warriors that uh or outside the tomb of a chinchilla won due to the first emperor of China\nAnd of course then you can hang out with giant pandas\nAt a ... at the chain do research base in Chengdu China this is a fantastic trip that you could win by doing your part to support the news here at W. B. U. R. so if you appreciate that if you want to try and win this trip now's the time to do it one eight hundred nine zero nine nine to a seven\nJacque I Would bet that there are people out there listening who think that they have supported WB already think that they have already become a member and and haven't or [laughter] or maybe they gave a contribution ... you know a year ago and they thought\nOh that's it I'm done for the rest of my life but but really the news keeps coming and and we you know keep doing our best to bring you up programs like the one that you're hearing right now so considered becoming a sustaining member where you get a little bit of money every month\nYou you sign up we take care of it for you every month if you decide oh no I think I've committed too much money you can always change the amount if you realize oh you know what I Want to give a little bit more you can change it in the other direction too but it's a great way to make sure\nThat you're taking care of the radio station that that takes care of you every day one eight hundred nine zero nine nine to eight seven\nFifty nine hundred dollars to go on fifty nine hundred dollars that we are trying to raise by the end of this hour in order to finish out this hour strong and keep us on pace towards meeting our goal to\nEnd this third the fundraiser on Thursday we can get there with your support just fifty nine people calling in right now with a one hundred dollar pledge and we would be done with this hour as a goal\nDo pick up the phone make that call last chance to get in on this China trip you got to pledge today one eight hundred nine zero nine nine to eight seven\nRon line the W. B. U. R. dot org [noise]\nIndependent journalism no and get entered into all of the remaining prize drawings in our fall fundraiser including today's fries and\nYour choice of a twenty Nineteen Subaru cross trucks out that provided by city side Subaru a villa\nGives now at W. B. U. R. dot org\nOr call one eight hundred nine zero nine nine to a [noise]\nFunded by you our listeners and they aren't emerged in presenting cabinet\nShakespeare's only son takes center stage and that's what it means and what it costs to be hidden by the shadow was great ambition clashes with family in a Tour de force performance from a child's perspective now through October seventh at the Emerson paramount center are Emerson\nThis fresh air I'm Terry Gross the stations membership campaign is underway to his gun deep into our archive for something special my Nineteen Ninety nine interview with Aretha Franklin when we left off we were talking about signing with Atlantic Records the label where she recorded her hips no your second\nSingle uh was respect which is I Believe ... deal a most requested Sean how did you end up singing the sawdust readings on [noise]\n... well I heard Mr ... version of it I just loved it and uh I decided that I wanted to record it\nAnd my sister Carolyn and I got together and I was living in a small apartment a on west side of Detroit and hum piano by the window watching the cars go by\nAnd uh we came up with an infamous lined the sock it to me lying it was a cliche\nOf the day actually we didn't just come up with me to read really was cliche and uh some of the girls were saying that to the fellows like soccer to me in this way or sock it to me that way\nUh nothing sexual and it's not sexual it was non sexual just a cliche learning but anyway I'm laughing picked it up and it just kind of perpetuated itself and went on from there\nLet's hear Aretha Franklin singing respect [noise]\n\n\nWhat did this song mean to you when you sang it I mean really part of the backdrop of this song it was it was a hit during the civil rights movement\nAnd I think you know respect had a a lot of meanings or in the song for your listeners one was you know just the respect you wanted for a million men in a relationship but it also had I think a larger residence with the civil rights movement to you know kind of larger social cultural sense of respect\nYes in a in later times it was picked up as a battle cry by the civil rights movement\nBut when I recorded it uh it was pretty much a male female kind of thing and and more in a general sense from person to person or I'm going to give you respect and\nI'd like to hear but respect back or I expect respect to be given back", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Tisbury", "day": "02"}