{"month": "10", "state": "GA", "station": "WNGH", "content": "Serving making and beyond gp be we're in a ... surface of Georgia Public broadcasting Andre Dawson is a minute before eleven o'clock thanks to noon today coming up at eleven o'clock it's on point\nIn a ... surface of Georgia Public broadcasting under dos and it was a minute before eleven o'clock thanks to noon today coming up at eleven o'clock its own point on G. P. B. S. G. P. B. moves dot org\nHey there is Joshua Johnson the host of one a and I am coming to Atlanta I'll be moderating a conversation about how news organizations try to remain impartial in our increasingly polarized society I'll be joined by journalist and editors from she TB end NPR for an honest discussion on ethics and transparency joined us on Thursday\nOctober twenty fifth at seven PM\nWill be a gp studios in Atlanta it's free but you need a reservation to get it go to G. P. B. dot org slash community [noise]\nNinety seven point seven FM W. J. P. B. S. W. A. G. P. H. D. room for the Georgia Public broadcasting radio network [noise]\n\nMajor funding for on point is provided by Geico offering car insurance as well as services for homeowners and rent or his insurance through the Geico insurance agency additional information can be found at Geico dot com or one eight hundred nine four seven auto [noise]\nFrom WVU are Boston and NPR I make the chalk her body this is on point\nLarge a young former father in law loved gone so young thought learning to love guns to would be a good way to connect with him he got good at shooting really good he became an NRA certified shooting instructor but as a black man gun ownership and gun culture came with complication\nYoung explores those complications in a new memoir and gives voice to the stories of gun owners we don't often hear minority Americans who may carry a weapon for protection but are often seen as a threat simply by virtue of the color of their skin up next on point RJ young on being a black man and a gun owner in America for the news [noise]\n[noise] line from NPR News in Washington on corporate Coleman us stock markets have fallen this morning the Dow Jones industrial average down one and three quarters present at twenty four thousand eight hundred Seventy four this comes on the heels of volatile trading in Asian markets overnight at NPR's Yuki Noguchi reports\nConcern over a slowdown in Chinese economic growth as well as increased global tensions between the U.S in Saudi Arabia over the death of journalist him off the show G are making for dinner and markets Chinese stock markets reverse some of their sharp gained the recent days and other Asian indices closed down\nDemocracy ... are making for dinner in markets Chinese stock markets reverse some of their sharp gained the recent days and I'm an Asian indices closed down two percent or more that sell off continued among European markets\nIn a U.S weak quarterly earnings from three yeah and and panic pillar attitude concerned that the global economy could be slowing down there was also a sell off and technology stocks has that Tobar continues to ... especially volatile ... NPR News Washington\nTurkish president Recep Tayyip Erdogan told Turkish lawmakers today there are significant evidence to murder a Saudi Arabian journalist ... was planned NPR's Peter Kenyon says everyone is calling on Saudi Arabia to disclose who was behind the plot based on Turkey's evidence\nPart of the evidence that they have is that the Saudi team that showed up in advance of the killing scout it out some areas possibly for disposal of a body including a forest in northeast is ... ah and then he also ah in his remarks called on Riyadh\nOr to allow the Eighteen people they've arrested in connection with the shows used it to be prosecuted in Turkey\nAfter a couple of weeks of shifting explanations Saudi Arabia says that ... was killed in a fist fight in the Saudi consulate\nFormer Supreme Court Justice Sandra Day O'Connor has announced she is withdrawing from public life in a statement she says she has dementia O'Connor was the first woman to serve on the U.S Supreme Court [noise]\nTonight is the drawing for the record mega millions lottery NPR's Giles Snyder reports the chances of winning are astronomical\nThe mega millions grand prize rolled over when there was no winter for Friday nights drawing a jackpot is now at an estimated one point six billion dollars winters can choose to be paid that about over twenty nine years what most up to the cash option which totals more than nine hundred million dollars\nA parable jackpot may not be as I popping but it's six hundred twenty million dollars for Wednesday nights drawing you'd still detention grabber\nAnd attention as what lottery officials are looking for they reduce the odds of winning a jackpot to drive up top prizes and attract more players\nMaking billions officials say they expect three quarters of all wedding number combinations who have been sold by the time the numbers are drawn trials Snyder NPR News\nOn Wall street the Dow is down one and three quarters percent or four hundred and fifty points the NASDAQ is down more than two and a half [noise] and\nThis is NPR News\nPercent or four hundred and fifty points the NASDAQ as Dan more than two and a half [noise]\nThis is NPR News\nCPB newsroom good morning I'm drew Dawson just ahead on on point\nIs America and an arms race ramped up by racial fear we'll explore that the salary but\nFirst CPB news governor Nathan Deal announced today that he's calling lawmakers back to Atlanta for a special session to cover the costs so hurricane Michael clean up the session will be goal to order on November thirteenth the AJC reports the session will last about five days\nThe cleanup is expected to cost roughly one hundred million dollars federal disaster aid will likely reimbursed state and local governments for much of that some Republican candidate for governor Brian Kemp picked up another out of state endorsement yesterday this time from Marco Rubio GPS Ross to rail has more\nBefore the Senate or a campaign was kept at a local restaurant in North of land out he used the opportunity to praise the candidate for supporting small businesses and read at a rate of the need for people to get out and vote\nHow do you do not wake up on a Wednesday morning to find out that we did not win an election\nAnd that you and your circle of friends that are made a difference\nRubio told Kemp supporters to take advantage of early voting and not wait until election day which is in two weeks the latest polls show Brian Kemp and his opponent Stacey Abrams in a dead heat for PBS News I'm Ross corral in Atlanta\nIn sports that Lana United manager here I Do much to you know has decided not to renew his contract and we'll leave between following the playoffs or to know who's a native of Argentina that he made the decision because he wants a new challenge\nAnd for family reasons the Georgia News Go to G. P. B. news dot org and follow us on Facebook and on Twitter\nSupport for NPR comes from NPR stations other contributors include Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru a super will learn more at ... dot com [noise]\nCPB whether partly to mostly cloudy across the state today high temps in the mid seventies partly cloudy and cooler front I lose range from the mid forties and the northern tier to the mid sixties south into law goes a mix of sending clouds on Wednesday with eyes and the ... mid seventies a bit warmer in the southern tier\nFive ... several years but [noise]\n[noise]\nFrom WB or Boston and NPR I'm ... and this is on point growing up the only thing RJ young new about guns was that he was black so guns were dangerous but he fell in love with a white woman and her family loved guns\nSo young future father in law even brought up bought him a glock a welcoming gesture young went on to become an NRA certified shooting instructor but he says that being black meant that being a gun on hurricane with complication this hour on point\nA young black man's reluctance odyssey into guns\nAnd you can join us or you know a black American who owns a gun and did you purchase it recently\nTell us why and what are the issues that come along not just with gun ownership but as a minority gun order that you feel that you have to be sensitive to think about uh in America today where at one eight hundred for two three eight to five five that's eight hundred for two three talk you can also join us anytime that on point radio dot org\nOr Twitter and Facebook and on point radio\nAnd joining us now from Oklahoma City Oklahoma is RJ young he's author of the new memoir let it bang a young black man's reluctance odyssey into guns and we have an excerpt of it at a point radio dot org RJ young welcome to the program\nNPR nerd so this is awesome [laughter] that is not the hello good I expected but you just made my day R. J. [laughter] thanks so much well\nYou tell a truly interesting and in in ... in terrific story in your memoir and I just would love it if you could uh tell us a little bit about it at first so first of all what is the first time that you ever held a gun\n\nOh I guess my passionate review ... going to have to wait I'm the first time I hold a gun a my ex father in law handed it to me\nI really didn't have an interest in guns I knew them from TV Watch one movie a listen to what a rap music but there where they weren't really a part of my childhood and they weren't really a part of my adult\nI'm from TV watching movies or listen to a lot of rap music\nBut there where they weren't really a part of my childhood and they weren't really a part of my adult life either but this was the first gun that I held because it was presented to me\nGeorgia governor's race is one of the closest in the nation the future of the state is on the line education infrastructure and healthcare\nJoined us where the Atlanta press clubs gubernatorial debate Democrats Stacey Abrams Republican Brian Kemp and libertarian Ted match will answer questions from a panel of journalists the debate is tonight at seven GP the radio and TV\n[noise]\nYou know selling a car can be a hassle but donating it is a whole different story but I was taking off your hands or off your driveway and turn it into public radio and maybe even ... all the host of marketplace in here is how to do [noise]\nEight seven seven GP be one car or donate securely on line a G. P. D. dot org slash cars ten thanks [noise]\n\nAnd oddly traveled custom trips around the globe designed by country specialist Taylor declines interest more information is available at a U. D. L. E. Y. traveled dot com [noise]\n\nThis is on point I'm making a check her body we're talking this hour with RJ young he's author of the new memoir titled led bang a young black man's reluctant honesty into guns and we have\nOur with our jail young he's author of the new memoir titled\nLed bang a young black man's reluctant odyssey\nInto guns and we have a a excerpt of that book at our website on point radio dot org and energy just just before the break you were telling us about your your first experience at of this massive gun show\nIn in Tulsa, Oklahoma a but a ... there's so much detail that you write about the justice one experience we could spend the whole hour talking about it um but I but I Want to just kind of fast forward to the key moment here is that\nA is that Charles your your uh your one time father in law are uh he ended up actually buying you again at the gun chosen that right\nYeah and I think what people don't take from that is that where I'm from Oklahoma\nGuns or a way of life and not always for the reasons that we might think were the reasons that we might read about they are integral to the way that fathers get to know their son yeah\nAnd in some instances when you're much younger that father might buy you a twenty two rifles so you can go on the Web it's or or you know squirrels or what have you and this was him doing something fatherly for me which was I mean my first gun ...\nWhat kind of gun was it\nLike twenty six color they block ... why did you choose that one because I was interested in self defense\nAs much as any other part I marketing ship came later but at that moment you know we're talking about carrying we're talking about firing weapon we're talking about understanding what lethal force is we're talking about um\nThe mechanics of self defense shooting of defense of shooting a and we're talking about why some people\nHad been gun buying firearms in a even as far back is twenty seven twenty twelve and what that meant and it was where many of the conversations that I was having I was not having conversations about shooting better than any ugly I was having conversations about staying alive\nOkay so what was so what was these are conversations you're having with Charles yeah yeah\nSo what was he telling you about why what was his his thoughts about why some people were buying firearms and twenty ten twenty eleven\nPeople want to protect what's this\nYou about why what was his his thoughts about why some people were buying firearms in twenty ten twenty eleven\nPeople want to protect what's there's people\nFeel that that is their right and and it is I we have lost say this and people are very very interested and letting everyone else no if you come over here you might not walk away\nAnd that for many is a deterrent\n[noise] [noise]\nI I mean I guess one thing I was wondering is ... ... just before a un after President Obama was first elected we saw a a surgeon gun sales to that ever enter the conversations with you and Charles\nOh yeah and also when I approached this topic with other folks ah it was always a question of how much ammunition might cost right and this is the state where you can buy ammunition sporting goods store you know like we have what are called\nUm [noise] at the time or academy sports and you can walk in there and and by any\nReal caliber of handgun ammunition and how much of it people would buy a relates to who's president so for instance now there's there's kind of a surplus in people can't really move firearms is as much as they could win a President Obama was\nIn office because a lot of people still harbor to fear\nThat somehow the president was going to round up your guns and try to take them from you or limit the kind of firearm that you might be able to buy so you should buy this kind of salt right for this kind of handgun a and does while you know\nFictitious\nWere also real fears and I've always said this and I I Wish people would really take it to heart because I Do it does not matter\nIf what you believe isn't what someone else believes it matters that you believe that they believe it so if someone tells you they're afraid take them at their word\nDon't tell them to their face that they're wrong irritates them and make them mad\nNow make their fear your fear and then walk through it you know walk walk that out and that's where I was trying to take this conversation or even before you know I I even thought that I might entertain becoming that good with a pistol and I we get ...\nThis conversation or even before you know I I even thought that I might entertain becoming that good with a pistol and I we get Stein eat mostly for the reasons that we've already spoken about\nYeah [laughter] you know uh I was wondering if you might be able to read to us the section of the memoir where you talk about uh the day that you got home or or ... or or what what you did after you got home with that new clock that Charles your father in law had had\nPurchased for it you can you read that part of the demand more to us\n[noise] yes ma'am Scott lotta Oxford comma isn't it [noise] um\n[noise] that day I got back home with my new gun still in its box I set it on my bed and looked at it for some time I had an open did that the gun show I knew the gun inside the box and never been fired and I knew it was mine I didn't feel proud\nWhat I felt was something more like fear like the fear I was taught to have for the God of the Old Testament the being who was so much trouble he drowned the planet cast out a favorite son and told her father to murder his son to prove his love\nFear the way I was taught to feel it as a black man trying to earn an education navigate among the police stay out of jail and stay alive\nI knew that the first time I lost respect for that pistol no larger than my fist it could kill me or get me killed I open the box and picked up the Gluck\nI was amazed at how intrude if it was the process of removing the empty magazine putting it back and recognize slide was it really that easy a person with a gun tends to feel a lot like Superman with X ray vision laser site and hope smash strength\nWhich is why telling that person to use those super powers will generally result in the person looking at you like your the lunatic\nAppointed a gun at the blank white bedroom wall and my second storey apartment and squeezed feeling the hard click the trigger the soft tap the hammer and an empty chamber\nI put the gun back and it's a case knowing that next week the chamber would no longer be empty and that this bit of polymer plastic and metal would no longer be inexpensive paper wait what a weapons so lethal I Wish we could invent it\nThat's RJ young reading an excerpt\nBe inexpensive paper wait what a weapon so lethal I Wish we could invent it [noise] that's RJ\nYoung reading an excerpt of this new memoir let it bang a young black man's reluctance odyssey into guns\nAre gay I you know I Wonder if you could explain to folks who are listening to that that X or do you do you show this deep respect for the power of the weapon in your hands or some\nUh definitely conflicted feelings about having it at all so how is it that you got from that to being a certified NRA shooting instructor\n[noise]\nI got to a point in my journey that I wanted to answer one fundamental question that was present it to me over and over and over again as a truism that ... was\nA good guy with a gun is better than a bad guy with a gun and I put a question mark at the end of that statement and wanting to find out for myself if that was true\nJoined Emily Jones for MORNING EDITION\nFrom five to nine right here on gp support for CPB comes from you our listeners\nAnd Georgia State parks as things get shorter and temperatures start dropping there's no better time to huddle around a campfire at Georgia State parks\nInformation and rates available at visit gee a state parks dot org checkout GB music on our Web sites we feature videos at performances from touring artists and emerging musicians and you can see short documentaries about people who make Georgia music it's at ... dot org\nMy Peter O'Dowd even among Republican candidates who want to repeal Obamacare they're using appetite to protect coverage for those with preexisting condition what's the truth about what repeal means for those people and how would the issue plane in the run up to the twenty team that's next on here and now\nYou're going to do today on G. P. B. I. N. G. P. B. news dot org\n\n\n\nSupport for on point comes from the listeners of WB you are in Boston and your NPR station from home advisor matching homeowners with home improvement professionals for a variety of home projects for minor repairs to major remodeled homeowners can read reviews of local pros vocal pointless online at home advisor dot com\nAnd Charles River apparel making the New England or rain\nJackets since Nineteen eighty three committed to designing apparel to prepare folks for whatever the day has in store for the new fall collection is on view had Charles River apparel dot com [noise]\n\nThis is on point I'm making a trucker body were speaking this hour with RJ young he's author of the new memoir let it bang a young black man's reluctance odyssey\nInto guns or an arcane just before the break we heard Douglas Jefferson their vice president of the national African American gun association [noise] uh I I'm just what you thought of what he had to say that ... that there is a multi ... there were a bunch of reasons why the association was formed a protection the the desire for self protection amongst\nAfrican Americans and he was also talking about trying to get the word out about\nA African Americans and gun history in America\nYeah and I got the profile dug for the book or so that was cool and heard his voice in\nQuite some time spin on tape but that's that's the message messages there is a responsible way to use this there are folks like myself\nWho believe that they should be armed for self defense and there is the historical aspect of guns were taken from people who look like you and that is not something that you get to dismiss out of hand and I take that part a straight to the heart\nSo I'm just wondering I [noise] I I hear Douglas Jefferson saying that a lot of African Americans maybe there's increasing interest in gun ownership because of the concern about self protection and perhaps ... especially in recent years [noise] but\nAarti did you ever feel like you were actually potentially making yourself less safe by carrying a weapon especially open carry because of the fact of\nImplicit bias or racism in America and I mean I'm dancing around a question but I cannot help but to think of what happened to Philando Castile who was a legal\nOf implicit bias or racism in America and I mean I'm dancing around a question but I cannot help but to think of what happened to Philando Castile who was a legal gun owner in America and disclose to an officer that he had a weapon and was shot dead\nIn that incident\nSpeech more to watch the n._r._a. should have died in an opportunity for them to stand up for folks like ... and like Doug Jefferson and the people for which that organization represents but in regard to me a gun ain't going to help me man a magnet let me\nLet let me let me break it down a I walked into studio right where I'm a member chaos you shut up and I have on a Black Panther shirt Scott ... on it because that's what the movie's really about having a Black Panther hatch\nWhat kinda stand up I wear jumper genes I wear Jordan's I have locks that are rated up if I have a nine millimeter Gluck Seventeen on my hip\nThat ain't gonna be the kind of thing that makes people at home and at ease and that has a lot to do with the way that I'm dressed and also has a lot to do with my skin color believe it or not um I Know people don't necessarily want to believe that but I still encounter rooms where I Am not welcome [noise]\nSo I don't get to go around as if that doesn't matter but I also don't get to go around as if a gun in a room is not bigger than any elephant you can walk in there you're not going to have an open and honest conversation with someone if you know that they have a firearm because that is the threat of hurting you because they don't like what you have to say\nAnd that's not correct and that's not right but it is true it is a fear\nSo in the course of getting really good with a firearm I'm also a journalist than I Am asking questions and I'm looking at data and I'm looking at statistics and I'm taking account of my own experience\nAnd what I come to find out is not only am I not safer I'm In more danger if I have a gun on my person if I have a gun within reach\nHey I'm thinking about your former father in law Charles now did did you ever have did you ever tell them this that that the the very same desire for self protection that made it made him such a firearms enthusiast\nOr even if you shared that desire you actually felt less safe a ham because of the fact of race in America when you had the weapon then before you didn't is that something that\nThat desire you actually felt less safe a ... because of the fact of race in America when you had the weapon then before you didn't is that something that he he he understood\nLater later as we continue to go through this and later as I had my credentials as I had a standing firm which do you have to continue this discussion like we had spoken about I hadn't fired a gun but I also was able to outline this in the book\nWith a use of force attorney here in Oklahoma and he had a similar discussion with a friend of his uh his attorney was white his friend is black and his friend who he was\nReally respect for four of and was Reverend about said hey man when I get pulled over and you get pulled over it's just different and I don't need you to tell me that it's not I don't need you to tell me that people should not judge me by the color of my skin I Need you to recognize that it does happen and to support me\nIn a way you can support me is to speak up for me in the rooms that I'm not in that I'm not allowed in that I might not ever walk into\nAnd I thought that was where I got to with Charles I could see that toward the end\nYeah [laughter] well RJ hang on here for just a second so many interesting people about this conversation uh or or about this issue I should say I want to bring in one more voice Tiffany where joins us now she is joining us from Cincinnati, Ohio and she's founder of the brown drills project to a group that offers\nMakeup workshops and other activities for building self esteem and African American women and girls and she also organizes firearms training classes for African American women Tiffany where welcome to appoint\nHello hello hello thank you for me\nSo so how long have you been a gun owner and in teaching the organizing firearms classes\nI'm organizing the fire on classes Sag Harbor twenty only a couple of years I'm owning one for about a year\nOkay and so and before that and guns and your family\nI'm not really a I have a grandfather from ... Georgia the hunter um so you know he uh oh shot gun that he kept out of the five daughter they drew granddaughters and we ended up with that one but there was a training are interacting with it\nI see so what what uh what was the reason that took you to buy a gun\n[noise] um actually it it it was the new I don't want it they knew what they've heightened racial clients\nUm actually it it it was the new I don't want to say new but this heightened racial tense climate and the area that I live in um that made me say I need to be able to protect myself and as a single mother or be able to protect my children\nUm during the Trump campaign and you know\nMy children were very very um tuned into what was happening with how the newer politics and\nThey were able to feel the tension arise as well um and they were very concerned and when a Trump gotten off as my son who was Fifteen at the time was very emotional about it and he he was concerned\nAbout what was going to happen to us people were being I'm located to be more aggressive to say things that they didn't say before\nWho are either they invade your your personal space and he'd heard all these stories what if somebody does something to us and him being you know I have a son and a daughter and then it myself you've got to have to protect you guys and I'm like no way kid that's my job and I thought about it like how would I really protect us\nDo do you ... Hannah I'm ... I'm Sorry I didn't I didn't mean to interrupt there but do you really do you feel now they're having a gun has made you and your families safer\n[noise] um [noise] I feel protected I feel that if someone crosses my first show I have something other than my fist and iron to grow\nUm I feel that at night when my kids were coming home for extra curricular activities and the seasons change and it's gotten darker um if someone were to approach it I definitely feel like I'm I can handle myself and and make my kids safe", "year": "2018", "show_name": "On Point (NPR)", "city": "Chatsworth", "day": "23"}