{"month": "10", "state": "GA", "station": "WNGH", "content": "\n\nServing making and beyond this is GPA and Eighteen station surface of Georgia Public broadcasting I'm drew dolphin thank you so much for joining us here today it's a minute before eleven o'clock on point to max and at noon appearing now on G. P. B. S.\nYou what your public broadcasting Andre Dawson thank you so much for joining us here today submitted before eleven o'clock on point to max and at noon if you're in now on G. P. B. and GB news dot org\n[noise] she brings your news and information you can trust every day to join us for an in depth conversation about the challenges for news organizations to remain impartial and stay above reproach in a polarized society one a host Joshua Johnson will be\nJoined by journalist an editor's from NPR and the G. P. B. newsroom for an honest conversation about ethics and transparency\nThursday October twenty five to seven PM free to attend reservation required GDP dot org slash community for more information [noise]\n[noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nMajor funding for on point is provided by Geico offering car insurance as well as services for homeowners and ranchers insurance to the Geico insurance agency additional information can be found at Geico dot com or one eight hundred nine four seven I doubt [noise]\nFrom WB or Boston and NPR I'm making a chocolate bar to eat this is on point President Trump is poised to withdraw the U.S from the landmark intermediate range nuclear forces treating the administration says Russia has already violated the Cold War ban on medium range land based nukes\nAnd staying in the packed only hinders the U.S as both Moscow and Beijing expand their nuclear powers\nBut renewed nuclear tensions are putting Europe on edge and accelerating the feeling that the post Cold War hiatus from a nuclear arms race is over but it's tearing up the treaty the right move are there other ways to contain nuclear adversaries\nNext on point the U.S Russia China and intermediate range nuclear weapons\n[noise] first news [noise]\n[noise] line from NPR News in Washington encore of a Coleman the secret service says suspicious packages were sent a former president Morocco Obama and former secretary of State Hillary Clinton NPR's Quil Lawrence reports the packages were all intercepted\nThe packages were identified during routine screening as potential explosive devices one was discovered last night address to Hillary Clinton in Westchester County New York another was found early this morning in Washington D. C. address to the Obama residents authorities say neither package ever gotten near the intended target\nThe secret service has opened a federal criminal investigation this comes after\nAddress to the Obama residents authorities say neither package ever go near the intended target\nThe secret service has opened a federal criminal investigation this comes after a bomb was discovered earlier this week at the residents of liberal activists and billionaire George Soros that bomb was destroyed in a controlled that nation by federal agents\nCirrhosis like Obama and the Clintons has been the target of right wing conspiracy theories for years Quil Lawrence NPR News New York\nMeanwhile CNN is reporting it's bureau in New York City has been evacuated along with the rest of the time Warner building a suspicious device has been identified there are no reports of injuries thousands of Central American migrants are still in southern Mexico their goals the U.S border\nThe Guatemalan government says it's stepping up security at its southern border after hearing that a new large group of migrants is planning a similar journey from El Salvador Maria Martin has more\nReports say a Salvadoran migrant group is being organized via what's up and Facebook and responds what a modest interior and defense departments\nSee they're putting in place more stringent border security measures that were functioning last week was the first migrants march came up from Honduras that once that when government official caught us by surprise\nMaria Martin reporting President Trump is threatening to cut aid to Honduras Guatemala and El Salvador and to close the U.S Mexico border\nThe Kremlin is warning President Trump's intention to develop nuclear weapons banned for the last Thirty years could lead to a new arms race and fears Lucy and Kim reports from Moscow this week the Trump Administration informed Russia about its plans to exit in Nineteen eighty seven treaty banning intermediate range nuclear missiles\nOver the weekend President Trump said the U.S will develop weapons prohibited by the treaty unless Russia and China also refrain from doing so president flooded ... spokesman told reporters in Moscow the U.S plans are extremely dangerous and we'll practically start a new arms race\nNational security adviser John Bolton met with ... Tuesday to tell them about the U.S withdrawal to also discussed a possible meeting between Trump and putting in November\nDuring World War one commemorations in Paris before leaving Russia Bolton told the inter facts news agency the two presidents may hold a full scale some in Washington next year followed by a visit to Moscow by President Trump Lucian Kim NPR News Moscow\nWall Street the Dow is down one hundred eighty three points the NASDAQ has down Ninety five this is NPR fly from\nNPR News Moscow on Wall street the Dow is down one hundred eighty three points NASDAQ down Ninety five this is NPR\nFly from the gp being newsroom good morning I'm drew Dawson just ahead on on point we'll take a closer look at the implications of President Trump's threat to withdraw from the nuclear missile treaty with Russia\nBut first and she'd be be news the candidates were Georgia's hotly contested governor's race had their first televised debate last night GPA Steven Fowler reports they spent a large part of the time talking about voting rights\nMidway through the debate Republican Brian Kemp was asked if he used his position as secretary of state to suppress minority voters in elections his response if you look at the numbers minority participation\nIn Georgia is a twenty three percent we have a million more people on our voter rolls today than we had when I took office but Democrats Stacey Abrams said voter suppression was about more than being on the rolls\nIt's also about creating an atmosphere of fear making people worry that their votes don't count\nThe ... have clashed in recent weeks over everything from rejected absentee ballots door just strict voter registration law they both face libertarian Ted met in November for GB News I'm Stephen Fowler in Atlanta\nA federal judge will soon decide whether Georgia's voter signature match law is constitutional\nAttorneys for multiple voting and civil rights groups were in court yesterday arguing that the law has the potential to disenfranchised thousands of people out of the November election under current law the state can reject absentee ballots if the voters signature doesn't match the one on filed\nA similar lawsuit against ... county voting officials and secretary of state Brian Kemp was heard yesterday as well from what your what your News Go to GB news dot org and follow us on Facebook and on Twitter\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with their Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video [noise]\nYour gp weather forecast for this Wednesday partly sunny and in the seventies across the state today increasingly cloudy overnight with low temperatures ranging from the mid forties in the northern mountains to near sixty south and along the coast on Thursday mostly cloudy showers developing in the central southern and coastal regions high temperatures in the low sixties to mid seventies\nJoe is developing in the central government coastal regions temperatures and below sixty to meet several [noise]\n[noise]\nFrom WVU our bond in an NPR I'm making a top priority and this is on point\nWhen Ronald Reagan and Mikhail Gorbachev signed the\nIntermediate range nuclear forces treaty in Nineteen eighty seven Europe breathed a sigh of relief the deal took almost three thousand nuclear missiles that were pointed at the continent mirror minutes from launched mushroom cloud took those off the map but for the past several years many observers say Russia has violated the historic Cold War packed\nMeanwhile China is militarized in parts of the south China Sea\nTwo reasons why the Trump Administration says it's pulling the U.S out of the INS treaty\nSignaling a further hardening of America's nuclear posture and potential acceleration of the nuclear arms race this hour on point U.S Russia and medium range of nuclear weapons and then you can join us when the president threatened the new nuclear arms race do you think he is bluffing or is he doing what needs to be done if Russia is modernizing its arsenal\nIn China beefing up its weapons how should the u._s. respond and what happened to the hope that humanity would step back from the brink that we do everything to try to ratchet down the proliferation of the most destructive weapons of mass destruction ever created where at one eight hundred and forty three eight to five five that's eight hundred and forty three talk\nYou can also join us anytime but don't put radio dot org or Twitter and Facebook at on point radio\nOr going to start today first with some analysis of a meeting that White House national security adviser John Bolton had in Moscow on Monday\nAnd yesterday and he went there to tell the Russian government face to face why the U.S wants to leave the INS treaty so we'll start today in Russia Anton turn off he joined us he's the bureau chief in Moscow for the Washington Post and we've got links to his reporting at a point radio dot org Anton welcome to them point\nHere right now\nIt's good to have you so first of all what can you tell us about the nature of the conversation between a John Bolton and uh and and Russian a Russian officials about the U.S saying it wants to pull out of the intermediate range nuclear forces treaty\nOr John Bolton true very extensive days of eating here really quite remarkable that are basically everyone who counts and the Russian security establishment from defecting Mr Schorr glued to his counterpart neglect\nThe meeting here really quite remarkable he met\nA basically everyone who counts and the Russian security establishment from defense minister showing glued to his counterpart neglect Patricia too of course ... putting himself on Tuesday um they covered a range of issues or Syria terrorism in North\nAll the results on election night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be alive all night watching the close races around the country listen on election night then wake up and hear what the outcome means for America on MORNING edition\nCritical election the central coverage NPR News\nJoined us for all the results on election night starting at eight Iran gp [noise]\nHey this is David Greene host of MORNING EDITION I'm here to talk with you about that poking feeling the one that keeps reminding you support public radio you can support the programs you loved by donating your used vehicle that old car truck could be worth hundreds of dollars to the station or you have to do is call and you might even receive it tested\nUs just go to G. P. B. dot org slash cars or called eight seven seven GP be one car and bank [noise]\nForefront\nPoint comes from home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd send gauge working to make higher education more affordable with us engaged unlimited subscription students can access over twenty two thousand the text books online homework access codes and study guns send gauge unlimited C. E. N. G. A. G. E. dot com [noise]\n\nThis is on point I'm making a truck or body we're talking about the Trump Administration signaling its desire to pull us out of the INS treaty that the Cold War era treaty that limited or ended the use of me medium range or middle range land based\nUs out of the INS treaty that the Cold War era treaty\nThat limited or ended the use of me medium range or middle range land based nuclear missiles and we're speaking today with just ... he's president of Ploughshares Fund a foundation focused on nuclear weapons policy and conflict resolution unless you're a little bit more uh from the president himself about why he wants to do this\nHere's President Trump after a rally in Elkhart County Nevada on Saturday telling reporters that he's ready to pull out of the intermediate range nuclear forces treaty or as we've been taught calling it the IMF treaty\nWith\nRussia China was and they all got what they say let's really get smart let's none of us develop those what Russia's doing it doing it and we're hearing today agreement unacceptable\nSo president Donald Trump they're saying that maybe we can and proliferation of Russia or China and the U.S all come together and desire to stop it\nHere's national security adviser John Bolton during a press conference in Moscow yesterday where he met Russian President letter but I'm ... and ... said there's just one point on wished Russia and the U.S agreed that other countries with nuclear arsenal in the world\nAren't restricted by the IMF it's a bilateral agreement between the United states and Russia and that's a problem\nSo there's a new strategic reality after this was a Cold War bilateral ballistic missile related treaty in a multi polar\nI think on this latter point of the more complicated global the strategic environment for something that concerns the Russians a very substantial and so we talked about\n... how do you react to what you just heard John Bolton say\nJohn Bolton is on a mission to kill all arms control agreements he believes in a world of power and might a\nOr a world of us dominance he believes that these kinds of treaties restrict military the military power the United states he wants a world where there were no restraints whatsoever on US military freedom of action he seems to have convinced\nA Donald Trump to ... to follow the course of action the fear of our allies the fear of many national security experts around the world and just you if you take down this treaty which is working but just in place which is restricted the arms race in Europe than the next on his target list is the start treaty that had reduced\nUh the the us and Soviet arsons not rushing arsenals by over fifty percent and\nIf you take a nap will bent\nThe start treaty that had reduced uh the the us and Soviet arsons not rushing arsenals by over fifty percent and\nIf you take and that will then toppled that seems to be his goal and then you put at risk the entire non proliferation\nTreaty regime in other words all the rules of the road that Republicans and Democrats liberals and conservatives have built up over the last forty fifty years would come tumbling down and it's a a dog eat dog nuclear world that is a road instability and war\nSo I mean we have seen though uh for at least a year now that America's nuclear arsenal um the ... for it to play a bigger role in the ... in the defense of the nation I mean I was looking at the the most recent nuclear posture review and it's\nAnd and it talks about these exact risk that that are made of Russia or China of a non uh a non a bilateral world here and that in order to counter or these other countries that are\nThat are at hand singing modernizing their nuclear arsenals that the Pentagon and the national Security Council say well the United states must do the same thing so I'm just wondering I mean earlier you you were saying that that stepping out are pulling out of the I. N. F. though\nYou say America loses some leverage them to over Russia I didn't quite understand that how\nAbsolutely look the first thing you do when you want to build new weapons is inflate the threat is provide some justification for why you need even more\nThan ... thousands of nuclear weapons are already have and in this case the Baltimore is pulling out an old ... is using a technical violation to kill the whole treaty that he disagrees with friday a logical grounds what are we talking about here\nWe're talking about the Russians who have modified and existing weapon to give a greater range larger fuel tank and they put a few of them and one of their test sites in European Russia and apparently in one of the site we're talking about a handful of weapons that are technically in violation and we've been detecting since about twenty fourteen\nThere are mechanisms for dealing with these kinds of violations they happen frequently in arms control treaty their resolution measures but instead of fixing it\nInstead of enforcing it instead of going and insisting that they take those weapons down he's killing the whole mechanism if somebody breaks into your house that's a violation of the laws against burglary you don't like repeal the burglary laws you enforce them\nBy repealing this treaty you're allowing ... to do whatever you want now there'll be no restraint on him deploying weapons whatever kind do you want in Europe and here's the they're they're really bad part it's unlikely that we can match it of course\nNow there will be no restraint on him deploying weapons whatever kind do you want in Europe and here's the there is a really bad part\nIt's unlikely that we can match it of course for us to put these ground based systems in Europe we'd have to our country to watch them road no European ally wants them that's why you're seeing how of complaint from France from\nFrom Germany from the European Union who warned that you're taking down and these are their words a pillar of European security\nNo one needs a new arms race says the foreign minister of the European Union\nAmong among others that's what they're afraid of that Trump is citing an arms race that was already brewing as both the U.S and Russia building other nuclear arms and now they're afraid that Europe uh once again be the battle ground\nFor these two nuclear giants as they battle\nRight I mean Europe is signaling as loudly as it can it discomfort with the possibility of an end of the INS treaty I mean I'm seeing here the stigma Gabriel who just stepped down in March as German foreign minister this week said that the demise of the INS\nThreatens to quote again turn us in central Europe and here in Germany into a venue of nuclear madness I mean we should recall that a ... at one time a million Germans marched against nuclear war a weaponry and Europe which is one of the things that led to a\nThe the INS to begin with that just hurts you and I know you have a lot more to say but I Want to welcome in one more uh ... voice into this conversation Evelyn focus joins us now she joined us today from Washington She's a fellow at the Atlantic council future Europe initiative\nEurasia center and the ... Center for strategy and security\nShe also served from two thousand twelve to twenty Fifteen and the Obama administration as deputy assistant secretary of defense for Russia Ukraine and Eurasia and one for his welcome to you\nThank you magnify great to be here so I'm very eager to hear your take on this given your experience here do you think the Trump Administration is a ... is doing is on the right track here in terms of its desire to pull out of the INS well\n... unfortunately I don't really see\nA better option right now because the Russians essentially put our back to the wall this is really like going back to Nineteen eighty seven where\nActually our European allies the Germans asked us to step in and counter the Russian short short range or medium range missiles that were deployed\nAnd threatening Europe at the time with our own missiles so in that case the Europeans wanted us to help them out and President Reagan did so but did so I think ... largest\nI'm with our own missiles so in that case the Europeans wanted us to help them out and President Reagan did so but did so I think largely in a way that he was able to use it to negotiate the Russians out of their own missiles and that's how we got the intermediate nuclear forces treaty and I\nHaving been in the administration [laughter]\nI Know that we tried very hard to confront the Russians to convince the Russians um to do what we could using words to deter them from continuing to violate the agreement but they did not stop 'em as you noted in the beginning this has been public since two thousand fourteen I'm\nThe chairman of the joint chiefs of staff testified openly that the Russians have deployed this capability these missiles and\nSo what are we going to do I I think that for the U.S government the best option unfortunately at this point is to do what we did an eighty seven which is to threaten to counter so the burglars burglars us\nJoined Emily Jones for MORNING EDITION from five to nine right here on ... support for ... comes from generous listeners like you and the high museum of art first friday is back on November second from six to nine PM guess will enjoy live music dad's garage performances and art making with color H. T. L.\nTickets are available at high dot org checkout GB music on our website we feature videos at performances from touring artists and emerging musicians and you can see short documentaries about people who make Georgia music it's at ... dot org\nI'm Jeremy hops in the race for governor of Florida is heating up between Republican Ron dissent isn't Democrat Andrew Gillum who tells us he set afraid to challenge President Trump's behavior and Mr disasters who was run his campaign in complete trust being fashion also has to be called out for that kind of directors\nAnd Davis of politics we'll broadcast from Tallahassee next time around here and now here in now is new to this afternoon on G. P. B. and she'd be news dot org\n\nSupport for on point comes from WVU our boss\nIt's deeply removes dot org\n\n[noise] support for on point comes from W. B. U. R. Boston\nPsycho celebrating over Seventy five years of providing auto insurance for drivers across America\nMore information on auto insurance available at Geico dot com or one eight hundred nine four seven auto and exact science is offering\nColon guard for average risk adults over fifty a non invasive colon cancer screening tests they can be used at home by prescription only information that color guard tests dot com [noise]\n\nOn point I'm making a truck liberty we're talking about the Trump administration's signaling of its desire to pull out\nOf the intermediate nuclear forces treaty that we signed with Russia in Nineteen eighty seven and what effect that might have really a hundred and forty three eight to five find that eight hundred for two three talk and we're joined today by Evelyn ... she's a fellow at the Atlantic council future Europe initiative\nAnd also served from two thousand twelve to two thousand Fifteen and the Obama administration as deputy assistant secretary of defense\nFor Russia Ukraine and Eurasia Joe Cirincione joined us as well he's president of Ploughshares Fund a foundation focused on nuclear weapons policy and conflict resolution and Evelyn and Joe if I may we've had a lot of patient colors waiting so let me just get to some of them right now Calvin\nIs calling from Charleston, Missouri Calvin you're on the air\nThank you for taking my call um I Am a former well military I'm veteran enough Thirty Years' old African American and um\nAs far as uh the U.S goes as far as our our military and our nuclear arms and basically are on\nThe way President Trump went about it is not necessarily the right way but I Do think he's going to go right I'm as your first guest that you know a lot of the way\nWe call a nation of appeasement too a lot of people for too long and a lot of the the President Trump has done has shown no look no longer take this role on the global stage you all for it though but\nInstead of the nation that is or like lack of better words I think we've been to sleep in the military and she says it's best to stay on guard all the way because when you fall asleep at the yearly attacked or breaks like Russia's going\nA military she chose to stay on guard all the way because we use all asleep that we usually attacks or break like Russia's going I think he's going right the we can be asleep watch as far as our allies are on the street we\nYou know we're behind the eight ball Russia is\nCalvin Calvin taking back from there and thank you so much for your call let's go to Margaret who's calling from ... Virginia Margaret you're on the air [noise]\nHi thanks for taking my call I find the whole idea of pulling out of yet another nuclear a treaty horrifying and a logic to think that once we get out of it and we increase our production of nuclear weapons [laughter] this is going to make the safer we already have more than seven thousand new believe\nAnd I don't see how the idea of increasing the number is going to make the world and they say are we have enough to destroy the many times over already it's only a bone in my opinion to the war industry\nMargaret thank you so much for your call Ellen far just how would you like to respond Margaret um well first to um ... and if I could just quickly um I Do agree that we need to be from with our adversaries and I guess my thinking with\nRegard to this move is that it's a deterrent move and hopefully move that will ultimately strength and arms control because\nI'm going to right now give the administration that chance I'm not going to assume that John Bolton has the lead and we're going to tear up the treaty entirely and we're going to drop all nuclear talks oh I'm maybe a little bit giving them too much benefit of the doubt but that's where I Am\nI Do however disagree with President Trump's approach to the allies and again as I said before we have to be more collaborative with our friends and from these heavier enemies with regard to Margaret's point I agree I mean I Do not think we should be wasting money on developing nuclear weapons that we don't need\nAnd that's the whole point of being from and standing up to the Russians and getting them to\nStep back and think about what they're doing 'cause this is also part of the bigger picture which has to do with Russia's military doctrine there over reliance on nuclear weapons as part of their war strategy which I think is highly alarming and you could have a whole nother show on that\nCertain CEO new turn back to here because of course uh we we could also continue to spend the rest of the hour talking about Russia and we will return to it but China has been lurking here uh a as a major part of why President Trump says he wants to ...\nSo they are talking about Russia and we will return to it but China has been lurking here a as a major part of why President Trump says he wants to pull out of the INS here I mean I'm I'm seeing that part of the thinking is that\nFor ... that the U.S has constrained by the ins and not able to deploy strategic weaponry in the in the Asia theater as Evelyn pointed out earlier\nBecause of this and that that's putting us tease Calvinist term behind the eight ball in Asia\nRight you always have to be very careful when you hear people who want new nuclear weapons in the language they use so John Bolton says you know an out outmoded treaty violation ignored were constrained\nAnd so you know it feeds into that feeling that we're being where the suckers and the other countries is stealing a march on us or as one of your callers pointed out\nWe have a six thousand five hundred and fifty nuclear weapons\nThat is to about ... uh several hundred times more weapons than you need to destroy every\nHuman being on the face of the earth we have plenty of nuclear weapons and you don't want to fall into this trap\nOf nuclear war planters just planners who who see this is some kind of board game where you have to match piece for peace so on China\nWhat they're talking about is that China a land power doesn't have much of a navy doesn't have much of a an air force that can reach beyond us borders they have new for now [laughter] okay for now they they they have\nA nuclear weapons are up about two hundred three hundred so nuclear weapons compared to our seven thousand and their land based and they can reach targets like Japan Korea like won a and like the United states they have about forty that could reach us\nAnd we don't necessarily have those we don't have those ground based missiles\nTheir capability exactly and that's what they mean by were constrained you know where the treaty stops us and building those but we have see based\nMissile which them just\nWeapons that can reach them fought just fine we have strategic submarines the crowd the ocean second which just fine in other words we have dozens of nuclear weapons for ... that can hit them for every one that they have they're going to hit us we don't need to match them and here's the other on underlined reality about this\n... there's nobody in no one ever allies want these weapons Japan just yesterday said\nThat they do not want us to part of the IMF treaty they don't they're not looking for the U.S to deploy nuclear weapons in Japan\nTo Japan just yesterday said\nThat they do not want us to part of the IMF treaty they don't they're not looking for us to deploy nuclear weapons in Japan\nWhich is one of the places you would do to deploy them if you want to match up well everyone versus a ... I think the the ... one of the deepest points that Joe is making here it's worthy of of some of this discussion here further discussion because\nAnd I think he's right that that there is\nA sense when you hear I'm certain members of the administration talk now that the United states is weaker than it actually is I mean what's your response to to Joe's point that what there is no need for land based I'm intermediate range missiles when we have such a a overpowering sea bass nuclear arsenal\nThat we could use no one wants us to use them but that that are there for a for U.S Strategic purposes in the Asia theater\nWell I mean I I have to confess here I'm not a military planners so I it's a little bit out of my\nLeague to say definitively that we don't need those weapons um I Will say however that it is true that\nOur president and I wouldn't say members of his administration necessarily better president does speak of America's there for a declining power as if we're not the the strongest military power on the globe right now the strongest diplomatic power at least potentially were squandering that every day\nUm and of course still the strongest economic power so I Do think it's worth bearing in mind that we do have the upper hand and the reason the Russians are developing the capabilities that they're developing has to do with the fact that they can't go head to head with us or the Chinese they have to develop a symmetric means", "show_name": "On Point (NPR)", "year": "2018", "city": "Chatsworth", "day": "24"}