{"month": "10", "state": "GA", "station": "WUWG", "content": "Thank you for sharing a portion of your evening with Iran GB radio can Eighteen station service of Georgia Public broadcasting\nThank you for sharing a portion of your evening with Iran GB radio can Eighteen space in service of Georgia Public broadcasting up next to the international Americana music show on TV being\nWin a life changing the balance what goes beyond a reasonable doubt really mean\nAnything on charges on my mind about ...\nG. P. B. presents the radio way beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis\nJoined us at ten am on Sunday October twenty first start G. P. B. radio\nFrom the University of west Georgia because Ninety point seven FM W. W. J. N. W. W. A.\nG. H. G. Carroll ... part of Georgia Public broadcasting radio network\nAnd welcome to another new and yet old edition of the international American I'm used to kill my name's Mike Park and this week I thought I Would take a break from playing all new songs which have killed ... seats Labour details\nAnd instead of clients backwards until issue entirely with old tracks films that are on teen twenty thirty or even forty years old and oh by artists and I have played\nOn the show in the past and moved back to wait to get a collective journey started with a song called days go by\nNo\nMan or\nOr\nThey go\nYou know I Know it's\nNa na\nGirl oh\nAnd staying\nAnd they know\nGo by a\nThe blow\nThey low\nThey know\nBy a\nMedia and current Raymond kicking show off with his ... tightrope type ... something days go by which is well as being the opening track from today's show is also the contract concurrence Bernie first solo album released back into ... for all the we had been\nThey go by which is well as being the opening track on today's show is also the contract concurrence very first solo album that he released back in two thousand and four although we have been writing songs for many years before that and indeed he started writing days go by Nineteen Ninety six finished it in to say and then one record today in the next three\nAnd then released the album that it's on record lonesome night\nIn two thousand and four and I was with all of currents albums if you buy it on CD you're not just catching the songs\nBut also the chords deliberate and extensive liner notes which for record lonesome night are considerably autobiographical ... car and taking the reader back to his childhood and to some tragic events which took place at that time but which ultimately led them to become an ... ... words meant an incredibly generous person\nThat he has become today so to check it more of his music and the liner notes and I can tell you that his new CD is going to be ready for release and then you hear so hello again and what can we get into this new old traditional the international America ... ... I'm Michael Parks I mentioned it over the past few days I started thinking that it would be good to metaphorically\nPut our feet per week drama than keep our dancing shoes on that is great hearing undiscovered lots of music which is so prevalent at the time of year\nBut occasionally a night in does feel like a treat so this week I felt we can sit back relax and be acquaintance ourselves with some some some other songs from days gone by and including this one when you're dealing banned the wire tops\n[noise]\n\n\n\n\n\n[noise]\n\n...\nMan\nAnd\n\n... it out\nThere that are\nYou want to go\n\n... ...\nThere and she asked me the\nOr ...\n... or\nOr\nFor a ride\n\nA long running boom\nNumber ... ... ...\nWay that it happened and I you know and run by by\nThe parents border on trains going by\nMe but I live really you know the high\nA parent's border on trains going by\nMe but I live really you know the\nThen the ... well we stand by\nAnd I know it won't be long and then there at all\nOr keeping one here and get into a\nStory to become I'm sure I'll be bomb around\nA news from the\nIn your area\nI think the bottom and\nBut didn't know I never seen that in ... na\nThey bring in Eighteen wheel and high\nAnother day drive away the time\nBut the one\nThe memory they mail my\nThe\nAnd try and\nThink in a timely\nBuilding a new day man and\nI mean\nWould a trip back in time be retired a couple of road trip selling books a Celtic ... at first you heard borderline by multi award winning Scottish Canadian singer songwriter David trend they\nCommit debut album torn screen door and then I just played a track called San remote I had about five years from Northern Ireland to nearly singer Steven McCarty who you may have heard in last week's show performing under the name king cedar but as I mentioned in factories where his previous ... bad\nBut they did leave behind the ... century it was on that it's called years ago in our backyard and you can get it from band camp do come so from sound reasonable\nTo San Quentin next told me the fact that was written for some of the inmates and their at ones that were taking part in songwriting and music workshops that this next singer round there her name is Audrey old ... another artist on the show which they sadly passed away a few years ago part two young she was in a trillion singer who lived in California and she began\nThey're her name is Audrey all Missouri another artist on the short stay sadly passed away a few years ago party yeah she was this trillion singer who lived in California when she began running workshops inside Quentin toothpaste and in fact I Know that she wasn't allowed to take everything in with her\nShe wrote the song has her gift to give to the prisoners the first time she went to visit a year\nIt's called bread and roses\nDid the same but bring a bank or a game\nThe fruit and by\nThe pay everything\nThey do not have\nBeen and\nI bring that to\nThe zoo and\nBring 'em\nWell\nHumming again ah know thin\nLayer on every\nKid may\nBring Neal then\nRe play\nBring\nIt would be my\nA\nHurry and Maine\nRain rain again\nNone\nDrown not rooting\nFor the fact that\nHe would be the ...\n\nGood I\nDo in the early ... any more\nFor the new the thank God no\nLord no new indie thank God no no\nWas a good deed no bread and\nRoses and then how do we know\nDay to me the na\nNa na na na\nNa na na na na\nNa na\nDid find good during the ...\nTo Audrey all ... their memorable some bread and roses and go see released into tightened in second and then also added to the final track athlete turned out to be our final record a warden and he'd pee containing several songs is Larry ... like prisoners in San Quentin\n... ... de\nDegree\nOther singer who songs of stumped me in my tracks in the past that was Emily Clapper who's from Montreal and he was just released an album filled entirely with songs in French called Emily Clipper ... uh if you want to check that\nHabit to track I just played by her the title track of her in a decade old album things may come emily's father is from Texas and she was living in Austin for a while performing with a band called the coyotes [laughter]\nBut I think she may well be back in Quebec that although I don't know for how long but I didn't too long\nBefore she records and released this some more American attracts are so Lake Geneva from the album that released after things become remains one of the most beautiful songs that I've ever heard and when it comes to music one of the most memorable things that I have ever seen remains the artist that I played before Emily perform a car ... version\nOf a traditional so called the aisle triangle and getting deserved standing ovations\nEvery type Irish myself and I played her somewhat autobiographical tracked innocent street from her debut album sweetness ... from two thousand and said and she has only released to more albums since then both with Joe dropping tax on them but I Believe a new one is going to be landing in mid December this year so Christmas really is going to become a cowardly if you're a fan of\nIrish might come here's a song that you may recognize as it has since its release in Nineteen Seventy five being covered by artists including pony rate that mainly Harris and the blind boys\nThere's just something that you may recognize because it has since its release in Nineteen Seventy five big covered by artists including pony rate that mainly Paris and the blind boys of Alabama\n... ...\nKnow ... ...\n...\n\n... ... as long as we\n\nNeed to ...\nOr ...\nOr ...\nProduct day\nMore\nWell I'm a man at all or broke and be a\nA row law but\n\nMany years and then ...\nPaying\n\n\nDon't want to know me and\n... the guy\nWho is\nThe most\nThe\nTwo\nOf the day which first appeared on the album poor like silver spent by every couple of Richard and Linda Thompson released in Nineteen Seventy five ... singing leader and a couple of split up six years after was released\nRichard continued to perform at themselves during his life and indeed he has three recorded it several times since ... so I guess you could see the original remains my personal favorite writers type to hear about some rock no princes and junk yard creep\n[noise]\n\nCrazy\nLed to the\n... na\n\nMissouri in their leader Reno\nNa", "year": "2018", "show_name": "International Americana Music Show", "city": "Carrollton", "day": "21"}