{"month": "10", "state": "NY", "station": "WRUR", "content": "For these things in the future I spoke with Gavin Smith the University of North Carolina he's director of the coastal resilience Center for excellence up there\nHe doesn't think we can simply think about a hundred or even five hundred year flood anymore\nWell an era of climate change in weather storms and more intense rainfall we ought to be thinking bigger we ought to be thinking about um regulating an incentivizing and purchasing a and relocating properties in the hundreds of floodplain but perhaps areas outside the hundred year flood plain\nGood morning walk him drop and joining Scott ... going to have your house church or no one we are in it for five to be are you are a ... D Rochester Ninety point one W like Jay ... at the guy from our tickets to go away again for the burn county poets my tomorrow night\nAbilene in Rochester also have a visit with a big blue house they have there should be released party tonight we're off the Internet cafe and another visit with the twenty a teeny tiny desk\nConcert winter for the for the country you're always stop and then later around eleven began with a let me man though\nThere was a different\nMood glow Ludlow ...\nRight\nOh well you know\nJust lie sugar and in a coffee\nMm the\n... and\n... D ... I'm I'm just\nLuck honey ... the\n... the\nGuy in\nThat way because I Know bright blue ...\n\nNo ... on the down side you know no ...\nNo ... ...\n...\nI have a dream job on the ages of gold nah\nJust lie\nIn a ... Mm\nMm\n\n[noise]\nMm oh your way back\nWhen I'm too\nI'm In a real\nMan\nAnd he paid ...\n\nDay and\nRead it it is a right to\nMiss you read and\nIt All right so what do you oh\nTo me all the\nA right and\nI Love you but he then\nThe way they're minorities\nMom\nMay may\nThe hours\n\nAnd if they want to\n\nMiss you know I\nDon't know\nWhat I Need a\nCandy and yeah\nI'm right on the far right there in the\nTell me if I'm All right uh I\nUm I\nI'm right around\nTune into\n\n\nSupport for different radio comes from our members and from del max designers and manufacturers of positioning systems for science an industry for more than fifty years located an east Bloomfield an online at bell max dot com to little\nConcert series from different radio presents iconic soul singer John Ellis in eight pm friday October nineteenth at the little to forty eighth avenue\nBest known for writing she some kind of wonderful Olson was inducted into the west Virginia Music Hall of fame in twenty Fifteen Rochester steep grills will open the show for more information including thirty dollar advance tickets visit the little dot O. R. G. E.\nD. you can get to\nHis own little thing in the town\nWas trying to do it and it's been about which so they try to sneak she's gonna kick it doesn't get to see in in ...\nIn ... keeps getting\nAsked what she walks she actually she managed\nMental making what you did oh ooh little things she do that oh I Love so hot I'm a ... says\nShe kept it for the mountaintop goes like this doesn't even then they try to get them to me [noise]\n\n\nLike our own little science she used to get that oh [noise] I have to also a\nBig ... everything she just just not as we\nWould have to buy a new and she's management company [noise] and then and only she may may be but it's a little thing and oh\nA little funny\n... you're listening to a different radio on W. O. U. R. G. H. we opened up that sat with that she would which\n\nWe are slightly sandwich don't wear that everyday people in the middle where is that there might be high dry their brand new CD called American record and I love you baby from the mighty high and dry Rochester and a ban coming to our area right there and the channel is Travis the chimp or Travis trio\nWere becoming a bottomless brewing on Sunday October twenty first\nAre ... a week away or so I'm ... show in the afternoon to say Smith opera house Smith club series of that you can find more about it but perhaps the website dismiss dot O. R. G. Sunday October twenty first at four o'clock\nA general Travis trio or you can you can hear them every Friday ... channel with Travis to take us it's a weekend\nThere was no W already were there I see\nNew York city's but it was a boy\nWith a bang go to the bankers\nYou are in print and so on\nAbout proving that [noise]\nYour business that can answer weekend\nOn the twenty seventh floor\nAbove from it as\nAnd she that made\nMe more\nEvery day\nLot of damage to ruin plea\nBargain is still read\nShe's happy that you\n\nAlbum for a few years back now I'm Scott Reagan you're listening open tuning ... uh the Saturday in Rochester demographic returning to our area uh a hometown favorite for many many years I've done\nSaturday Night day after tomorrow love in just comes from 'cause she called perfectly well\n... ...\n...\n... ... ... ... ...\n... ... ... ... ...\n[noise] what good's ...\nWas that you be ...\n... ... ... the juice groups revised green and ...\n... we play ... in ... ... ...\n... it was ...\nBetween a house then\nWe moved um\nThe ... those dreams when\nThinking that we eat fun in ... some ringing\nFirst timer so ...\nI knew a we'd love you\nAnd sweet through some more you have ...\nWhen ... I've lost my heart completely\nMm bowl we well we did was just to stay that\nThose dream ...\nHoping that we ... ... ...\n... but\nThe reason I Would change the clip ... am is you\nCome from\n... we see\n\n... Mm\nI guess\n...\nStreams where he may\nSoon as you go to some degree I mean the ... [noise]\nMm [noise]\nYou know a guy you guys\nThe nice\nYou're not you\nNa na\nHey\nI'm\nNot\n\nNa na na\n\n\nNa na\n\nNa\nThat they would just oh yeah that's\nA\nYou know I didn't\nKnow the man\nOr the the ...\nNa na na\nI ...\n\nI\n... I Know\nOh\n... really\nNot no then\nThe way I mean the\n\nI Am\nA young man\nUm [noise] and that is driving a bus driver you know um [noise]\n\n[noise] oh\nI think\nAh\n[noise] ah\n...\n\n\n\n\n\nThere was Jim James from here is a tribute to two album and\nI just wasn't made for these times Kobe Brian Wilson song next graduation is true victorious rock now to John ... they each one a pair of tickets or germ county poets tomorrow night at apple in the eight o'clock on a more about that in all the music that apple yet their website\nAnd we'll have another ... voice tomorrow for that show a search warrant warrant from a chance to win ... thanks so called this is so we're seeing them\n\n\nAnd and\nI see all the time\nAnd and\nAnd\nAnd what\nJohn Boehner\nTheir [noise]\nNa\n\n\nNa\nNa\nNa\nNa na na na na na na na\n[laughter]\nGuns are married and\n\n\n\nNah nah\nNah [noise] [laughter] [noise]\nAnd [noise] and\nSupport for different radio comes from our number\n... college art center presenting dealt with caravan with Jessica and Beth playing tunes around the world blending gypsy jazz low country swing October Thirteen in the new Glazer music performance center art center dot ... dot edu [laughter]\n\nThan it does not\n\nUp reincarnation\nI\nA man by\nAnother guy I\nKnow right\nKind of lie I don't\nKnow of gas\n\nTo me it's a\nDo you\n\nMe in line one name your na na\n\n\nYou're listening to it it would drive W are you are a feminist the Rochester and Ninety when one W. I. T. H. ... foundation the one guy let's see if we just should um we got big house here in cement where some of their new CD called on my street\nFirst let's go back to ... the ...\nSupport for for radio comes from our members and ... ... ... performance what the old country al ... forty Rob lightning along with the afro Cuban sounds of this back this Saturday October thirteenth in the back room all out detailed online that record archived dot com\n... ... ... ...\nGround was was this guy was darn near me to curb it she took your\nOak tree log you did that sixty seven G G ...\nOh no me\nLovers leader gay are glowing quiet corners where he rarely ever ...\nOne person said she was real dispatchers struggling\n... total\nAnd you guys filled the little one I mean there was there was not a seat to be had after eight o'clock and uh\nYeah it was it was a wonderful show you guys are so much fun we pay a lot of our audience to show up\n[laughter] you just have to get on that list a shock I write down and remember that\nBig blue house playing tonight up a little theaters are sevens nine it's been fun to make that this is your third album out of the third elbow yet for big blue house yeah yeah and you always choose interesting science to I mean these are some very familiar songs on here and some\nI don't really know you know it's great I Love the uh the piece of ... I remember we had you in here one time a\nCouple of years ago for my own album when I ... I own see then you go you're\nYou did away last night we were talking about guitar riffs\nOh when we were in the house and like my leisure\nTime I ... and you said a and I said how how much I enjoyed doing ... and then oh and then he just started doing I think the second part of the\nThing is though [laughter] that's right yeah we're we're supposedly going to learn the first part of this song eventually added to the second part of the arts video rental [laughter]\nOurs and so who chooses the sizes you guys get together and is there I\nI think they're all songs that we plan gigs ... and then there's the one other thing is knowing that you can get copyright clearance on ... there are some songs we play we like to find them and yet we haven't gotten a clearance yet but um it's generally things we play and\nTry to just get a mismatch that goes together\nAnd this one is a little different from the previous to that um we only have the one original and this one and usually we try to wage in two or three originals and uh\nAnd harvest so prolific a songwriter and you know there's always a nice instrumental that he's put together that we've had on a on our other cities and the first two but um this one has only Brian's tune but uh it's nice that it's being showcased as the only original to you know because I'm\nA we are pretty much covers band but we're working in more originals all the time and the other covers we always try to put a special spin on you know we we never tried to play them I don't as\nMy I think it is a different presentation 'cause they the songs I Believe feel like you regional but we're a bit of a gym in too and it's always a different presentation especially considering the or the upright bass in the coup stick guitar and electric guitar and\nIt's an interesting mix yeah it is I'm In one of our one of our regular fans said uh you know you guys I don't think you've I've ever heard you play the ... the same song the same way even twice in our own and and we don't we we really don't try to try to vary it and um [noise]\nAnd ah that's that's what makes a cover interesting for us as valuable to fool around with a little bit while maintaining the integrity of the of the original songwriter you know and and and his intent or her and\nSo we're going to play a midnight in Harlem and died who brought\nThat or you know I did yeah I I said it was ... we were\nI was on to them which I think we both were so ... what were you going to see\n... while you're there guitar so it's a dark choice some ... you were mentioning so are you a fan of dark talks yeah and I\nAnd I do play slide guitar he's probably one of the big influence they you know for me I've listened to him alive listened to Sonny ... very you know the two opposite poles that\nSo the slide guitar aspect is real strong there it's just kind of an ... thing in the ... is a great tune that it's not\nAs not all that well known so when people hear it and we you know when one of the spins or that we put on it is we kind of create this drone to start with and and your audience will hear that in a second\nI'm that we kind of started an end with this droning kind of thing that um that's different from what I did ask your truck stayed with it and um and uh we have fun with it gives me a chance\nUse the bully again you use it [laughter]\n[noise] uh-huh it's always good to have that territory that you can draw on yeah yeah ... spicing up to sign a big blue house here from their new CD is called on my street\nAnd again they are releasing the CD tonight at the little theatre in a cafe south the clock to nine o'clock on a more about at the little dot org ...\n\n\nUh\n\n\nDa da da\nDa\nDa da da da\nDa da da\nDa da da\nPuppy in Harlem to\nI went down the river\nWorld\nDa da na\nNa na\n...\nJust jobs around\nYou can almost see\nDoor to carry this dream to the\nLocked in Harlem\nMaybe\n... and yet they say nothing could ever\nGo and get good by non law regarding our na\nNa na na\nNa na na on our\nNear the babies were given a walk down the drain cold morning man\nMy birth or no one ever when\nYet they say nothing\nGo can't buy little non lover she\nDay they\nAnd then on our\nOn our no\nMom read not they sleep on the street not the burning while\nI bring about every day yeah not a cry when I think when they get\nDone and yet they may not being\nKid had been bombing the guys you\nGo on like good\nLong have you\nNa na na na na na na na good I got two years in\nThe lead them to know what I don't want to go I Love the new law we live in a\nBut I can be done and yet they say nothing\nGo on kids you did buy new mama\nNo I got\nMy ... my\nGod I'm not I'm not no\n\n\n[noise]\n\nThere's been so hard to do that too\nSo it's now it's\nTo see the water's goal\nSo much\nThat will now have\nThis stuff going on man some news show are you well I'm going\nAs she is the ... ...\nThere's a huge go\nYou know or you know for\nIs another American is\nMan yeah they\n[noise]\nSaying is\nIn the in the ...\n\n\n\nWell ...\n...\n...\n[noise]\nWhat was what you want to\nPut the newly again so I don't know\nWas going on in your show\nWas that you want to\nGo do you say it again\nAnd I'll be buying a man you can get it to get out of the robot in [noise]\nYou can tell me I'm not\nWe can start at all oh\n\n[noise] [noise]\nWell you gave me that gives\nSome on there and in the shadow\nThere's something you need like [noise]\n[noise]\n[noise] [noise]\n\nWhatever you want to live down the line [noise]\n... to ...\nThe ... the rage and paper and the you know ...\n... ... ... ...\nExactly it was a man or worry and made the news the world is in and out or do\nThey know near the ... ... ... ... s no\nWay man I thought the war ended up out of me\n... ... ... ... ... believe that's why I'm ray although we may need to\nDo all eat Janet ... he\nAnd his new nah he\n... a ...\nIn the air but they won't be where I read the ... ... ... ... ...\nYeah she gets\nIn the ... the brood\nII Joan ... who ... ...\nEvery day ...\nDe\n\n\nLa la\n\n\n\nLa la I usually do\nRun through the law was a number\nOf Rochester\nA\nOr so or ...\nLose their age but you know\n[noise] the\nAnd let me tell you how it was\nOn new bomb them change\n\nThese little birds and he told me to read that\nStrange three now\nLong way man I was raised in a\nWe were then\nNew ...\nMove\nWhat to do a\nAre very very long stage three a\nAre they allege release from ... called the radical San and a\nStraight straight street scraped street\nAudition for that suits event it from her shaped the morale release the danger zone from Susie she was on the air here just last week and a cowboy junkie so open up their new CD called all that reckoning\nAnd they're very nice very moving sign that things we do to each other but a cowboy junkie\nGreat reach so this is David David ...\n[laughter]\n[noise] oh\nYou\nAbout how\nTo tell\nHuge gap\n[noise]\n[noise]\n[noise]\n[noise]\n\nI can and\n\n... [laughter]\nThat\nRight\n\n\n\n[noise]\nGetting the drugs were\nThree\nMan me\n\nHave mercy on the man to hold out much the on the ... main\nUnderneath the living and the cat's tail to get in the shadow of a shady grove ... been thinking why do they\nHe did that how big mirrors inside the ... just below the unity decide the symbolism based on ... and ... just to get my mom when she was just a weird and the in\nHave mercy on the ... man who would I Wish you undercut by one\n[laughter]\nI Do too but and I'm ... I'm a loan from all the fun and so the ... we we will but you\nKnow ...\n... ... you're\nInjury or be happy\nOh\nNo no\n... oh\nYou're listening to a different radio on a number support W. I. T. H. W. R. U. R. we'll wind up with a Peter Gabriel backtrack crocodile man would carry Hendricks and of course ... live by you\nYoung son nah [laughter]\nAre we going to school\n\n\nYears did yeah we\nShe has\nFine way you'd\nFinished ... there's\nAny ...\nOf those two\nDo you do\nNeed to do we\nLive in ... well let me\nI Believe in one\nTeen your little ally Israel for funding you [noise]\nYou are starting to see that and ...\nDo you do\nSome like to read the new\nYork probably\nWhy my skin\nTry to be very early teens\nIn this ...\nHe ...\n\nSupport for different radio Columbus remembers and from Lebanon presenting an evening with singer songwriter musician bat McGrath returning to Rochester for this be strong performance Saturday October Thirteen detail on line up loving cup dot com", "show_name": "Open Tunings", "year": "2018", "city": "Rochester", "day": "11"}