{"month": "10", "state": "TX", "station": "KTDH", "content": "And the brother brothers high plains warning after MORNING EDITION only on listener supported high plains public radio [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\nWho\nGood morning days after hurricane Michael made landfall in Florida many people have no power while others were evacuated\nLawrence reports on life in the Florida Panhandle and I'm Steve Inskeep and I'm Rachel Martin with us secretary of state Mike Pompeo pale in Saudi Arabia today the Saudi regime and the cans of markedly murdering journalist ... read that Trump now says it could be real\nKiller this hour we for the arms deal between us and a new poll says\nThey're arguing issues motivating rural American voters this year drug addiction an\nThat covers the actor director Tim Robbins turns ... years\nOn the news kept coming up next\nLine from NPR News in Washington I'm more of a cold and hurricane cleanup continues along the Florida Panhandle the death toll across several states remains at Seventeen people but dozens of other people are still missing and rescue teams and loved ones are continuing to search for it\nAll across several states remains at Seventeen people but dozens of other people are still missing and rescue teams and loved ones are continuing to search for them and the autopsy lung reports tens of thousands of homes are still without power\nUtility companies are scrambling to repair downed power lines across the region Florida governor Rick Scott has been sending extra crew to help by clearing debris from roads visuals a warning residents avoid touching downed wires and Florida's panhandle hundreds of families now without homes are continuing to shelter in schools and community centers\nHundreds of National Guard members from Florida and other states are helping to lead search and rescue efforts and bingo counties to very hit hardest by hurricane Michael on long NPR News Destin, Florida\nSecretary of state Mike Pompeo has met with Saudi Arabian king cell man to discuss the disappearance of Saudi journalist ... turkey believes he was killed after entering a Saudi consulate the kings amount has told President Trump he has no knowledge of ... fate\nHowever media reports suggest that Saudi Arabia is considering whether to announce that ... was killed as the result of an interrogation gone wrong\nNPR has not confirmed these reports meanwhile Google has canceled plans to attend an investment conference in Saudi Arabia as NPR's Emily Sullivan reports the cancellation\nAs elitist pressure I placed on Saudi Arabia since ... a critic of Saudi policy it was last seen entering the U.S consulate in Istanbul earlier this month the Turkish government alleges he was killed\nPresident Trump has threatened sanctions that the Saudi royal court in behind the show 'cause she's disappearance the Saudis say they'd retaliate even further Google Cloud C. E. O. Diane green has an offer to reason for her cancellation the company said earlier this year it would open five innovation hubs in the kingdom\nOther prominent companies have also pulled out of that investment summit including over in J. P. Morgan last year's conference generated lots of excitement about doing business in Saudi Arabia Emily Sullivan NPR News\nHarvard's top admissions official will face more questions today that's the trial over the school's admissions policies continued for a second day from member station WB you are involved in Sherry young reports that the plaintiffs are trying to prove the school is discriminating against Asian Americans\nAttorneys with students for fair admissions that group that filed the lawsuit are expected to continue walking through the fine details of Harvard admissions process they'll be reviewing officer handbook instructions and statistical analysis of application records\nThat plane to say Harvard uses an unfairly biased formula that puts Asian American applicants edits advantage\nCarry young reporting you're listening to NPR News\nA federal judge has dismissed a lawsuit against President Trump filed by adult film actress Stormy Daniels she'd claimed Trump defend her on Twitter when he claimed she was lying about being threatened over an allegation\nDaniel has alleged she had an affair with Trump an allegation Trump has denied Daniels has a separate lawsuits pending that is over a non disclosure agreement Daniels signed regarding her story of the alleged affair that lawsuit will proceed\nThe archdiocese of Washington DC has published the names of twenty eight clergyman credibly accused of sexually abusing minors as far back as the Nineteen fifties a lot of ... of member station WBUR AMU\nReports of the twenty eight religious leaders accused and the new report some have multiple accusations of abuse more than half were convicted for their crimes and many have already died the news comes just days after Pope Francis accepted the residents\nMore than half were convicted for their crimes and many have already died the news comes just days after Pope Francis accepted the resignation of arts ... Washington cardinal Donald Wuerl who it's been accused of covering up sexual abuse scandal during his time at the bishop of Pittsburgh\nThe survivors network that does abuse by priests criticize the timing of the release the group called the move a quote hastily assembled PR dont meant to distract from World Frederick nation for NPR News I'm a lot to live in Washington\nThe drawing for the mega millions lottery we'll be tonight the prize is currently valued at six hundred fifty four million dollars your chances of winning or about one in three hundred million on core of a cool and NPR News\nSupport for NPR comes from ... a meal kid company that delivers semi ... meals to be finished at home in Fifteen minutes with one pan gobble sous chefs to do the prep work like chopping marinating this week's menu is at ... dot com slash NPR and Americans for the arts\nHey thanks for joining me this morning for NPR's MORNING EDITION on high plains public radio I'm Brian bureau it's five or six am central time and in just under Fifteen minutes we have some regional news for you stick around\nIt's going to be sunny almost everywhere on the high plains today with the exception of the Texas Panhandle region highs are going to be in the mid fifties\nTo lower sixties tonight it'll be anywhere from clear to mostly cloudy depending on location and lows will be in the thirties and North West Kansas northeast Colorado it's gonna be sunny with a high near sixty tonight clear with a low around thirty two\nIn North central Kansas it'll be sunny with a high near sixty tonight clear with a low around thirty two in southeast Colorado sunny with a high near sixty tonight mostly clear with a low around thirty two [noise]\nIn southwest Kansas it'll be sunny with a high near fifty eight tonight clear with low around thirty five\nIn the Oklahoma Panhandle sunny with a high near fifty nine tonight partly cloudy low around thirty eight and the Texas Panhandle mostly cloudy with a high near fifty three tonight the clouds are going to stick around we'll see a low around thirty eight\nHigh on Jonathan Baker and news curator here at H. P. P. R. and we take so much pride and bringing you news stories that you can't find anywhere else but we can't do it without your help good H. P. P. R. dot org today to pledge your support it's\nMORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep let's take a walk around the Florida Panhandle which is cleaning up after hurricane Michael we will focus this morning on the Panama City area\nIn the beach communities there are some buildings are fine others no longer exist and NPR's Quil Lawrence who spent days taking at all in either Quil tasty so what have you been seeing well I mean\nThey're ah they're treated down everywhere these towering pine trees that are just snapped over at the middle in some of the communities along the water they've been they've been flat and then I Know people so to say that word or they try to describe it mostly uh people down here sheep using sort of\nChildren's toys metaphor sayings like a kid swept all the houses off the monopoly board\nOr you know a kid snapped his his toy tree I I don't think people can really believe that uh that if a win could snap that to keep they keep on trying to reduce it to some metaphor they could understand how how this could just get picked up and moved to blocks\nAnd flipped over at the point where you can't see what was the house\nHow could just get picked up and moved to blocks and flipped over at the point where you can't see uh what was a house in what was a vacant lot Mm I'm so in those communities there are people are really asking how can you rebuild that's talking about like Mexico\nYeah yeah Mexico beach I think we've seen the overhead shots were there seems to be about one house that is intact and a couple of other that are severely damaged and everything else utterly destroyed but when you pull away from that spectacular shot do you see widespread damage up and down the coast\nAnd everywhere in this in this a swath dozens of ... miles wide you can cheat at the store and just tore straight up\nAnd regional news one of the state constitutional amendments that Colorado voters will see in November aims to raise money for all of the state's public school as Colorado Public radio reports since the great recession state lawmakers have withheld seven point four billion dollars from schools to shore up other parts of the budget\nThe hemorrhage of cash has left many districts operating at two thousand eight funding levels\nColorado spends about twenty eight hundred dollars per student ...\nOf cash has left many districts operating at two thousand eight funding levels\nColorado spends about twenty eight hundred dollars per student below the national average half of the state school districts have cut back to a four day school week in the state is also facing a teacher shortage because districts can't offer competitive salaries to teachers\nIt passed the constitutional amendment would give all school districts more money bringing Colorado closer to the national average in per pupil spending raising teachers' salaries as a kid objective of many districts for high plains public radio I mean do you have like\nThis is Rafael Rodriguez in answer to your high plains public radio I just want to do a quick shout out to our member listeners you power decision you keep going so don't let them know contributed a H. P. B. R. dot org peace\n[noise]\nThe fall membership Dr continues on high plains morning to stay tuned it nine AM central for a mess and new music often the latest from mountain man Jason is now the J hawks hold her wall fleet Fox's and the brother brother high plains morning after winning edition only on listener supported high plains public radio [noise]\n\n\nSupport for NPR comes from the station and from PBS with the eugenics crusade American Experience explores the history of the early twentieth century campaign to breed a better American rates eugenics crusade tonight at nine eastern on PBS\nFrom western hotels and resorts Weston is committed to the wellbeing of travelers with offerings like heavenly beds and super foods are ex menu and gear lending for one workout years left behind at home Weston let's rise learn more western dot com\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learn more Raymond James dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin drug addiction and the economy ... according to a new poll that is what it's on the minds of rural voters that they go to the polls this election season the poll by NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nBut NPR's Alison Kodjak reports that even with those real challenges many rural Americans are optimistic about the future if\nYou want to picture of the trouble to face some rural communities income Brenda a self described homemaker from the heart of Appalachia she fifty seven and married to a former coal miner\nAnd his eh that from the black lung and having a real hard time where it was time for him to come out anyway\nAnd drug addiction has hit her family especially her two grandsons hard\nMy daughter and her head and um duct tape on and he walked off all of 'em because they couldn't give up his truck\nHe's still alive but some of her other relatives aren't including her niece\nThat found her and her home a lie [noise] September\n[noise] [noise]\nShe was thirty three years old she left behind or a boy\nNPR's not using her last name to shield her grandchildren losing Coburn Virginia a town of about two thousand people near the point where Virginia Beach Kentucky and Tennessee her experience fits into the findings are new poll which showed that in rural America drug abuse ranks with the economic outlook as rather\nTacky and Tennessee her experience fits into the findings are new poll which showed that in rural America drug abuse ranks with the economic outlook as residents top worry\nAlmost half of rural Americans have been personally affected by the opioid crisis when we asked if they personally know someone who struggled with addiction forty nine percent said yes Brenda said it's worse in her community\nIf he were to approach can families randomly\nAnd give them a piece of paper and have you have someone in your immediate family on the road\nI out of town would say yes\nBrenda says in Coburn jobs and opportunities have dried up state officials have been promising to bring an economic development but none of it has reached her community yet\nIf you come out of college with a degree or more than likely going to leave this area to find work\nBut experiences in rural America very widely and are pulled there's that out\nThe survey of Thirteen hundred adults all living in rural areas should that many people are optimistic about the future of their communities most of the people we surveyed say they're better off financially than their parents and a majority think their children will do better still\nRobert Blendon professor of health policy and political analysis at the Harvard th Chan School directed our poll\nThey're optimistic about about the future and they're also optimistic that things can be done to pull them out of these economic problems they face\nLast summer all communities are suffering others are thriving says Christopher thorn burn the founder of beacon economics in Los Angeles\nWho might have a coal town and an oil town well the whole town is doing terrible because coal can compete in this era of cheap natural gas\nOn the other hand because of fracking these rural communities sitting on ... oil are booming and incomes are up dramatically as a result of all that new money flowing into the region for oil exploration and drilling\nThe economy and grenade in Mississippi a city of fourteen thousand about halfway between jak sending in Memphis, Tennessee is doing well says it killed Powell\nAlone job of its own\nTalents to twenty four year old truck driver who grew up in Grenada he says the town has a drug problem but its economy is growing\nIt's almost local authorities into on this starting to experiment fall and bigger restaurants are being put her now within the first two years we really ...\nAnd Brenda says she's seen flickers of hoping Coburn the town's high school has a new football coach and the community has come together to support the players\nYou know one of the inflatable how much that the kids run three way bottom one of them was twenty six hundred dollars we ... the white wearing all in one year so there's good people is that hard working people\nEven though sometimes things still looks bleak Brenda says her view of her community is getting better Alison Kojak NPR News [noise]\nThe Milwaukee Brewers hold two games to one lead over the Los Angeles Dodgers and baseball's National League championship series if the brewers should win the series and Dodgers fans will insist on the fifth day when the brewers would reach the world series for the first time since Nineteen eighty two one man you're celebrating already\nThat is the voice of Bob euchre one of baseball's great voices and he happened to be a long suffering brewers fan euchre has been calling games for Milwaukee since Nineteen Seventy one he was a player to do it's playing career started there in sixty too\nLong ago euchre started an ad where an usher removed him from his goods\nThe one he was a player to do with plane crash started there in sixty too\nLong ago you could start in an ad were an usher removes him from his good seat at a ballgame must be in the front row euchre says only to be taken back to the cheapest of cheap seats high up up up that self deprecating style fit a catcher who had trouble\nCatching you want to explain to Johnny Carson his technique for handling the knuckleball\nEasiest way to catch it was to wait until it stopped rolling and just pick it up\n[noise] it's like ... or number role as a play by play announcer in the film major league in his famous line of the movie he said this to the radio audience about a wild pitch that mentioned the batting down by about a city block\nThe sun\nThis season though he's been enjoying real brewers success there's\nVideo of him in the locker room after one of the teams biggest wins the players crowd around him that's man in his eighties dumping beer on his head course here is reacting tweet Fox Sports Wisconsin were prior\nTo more than any why\nWell they're all they're all we\nKnow what is it near and [noise]\nI mean to be training to be treated like one on one of them all the time\nI think that special for me\nRemember there is no high in euchre Bob ... Milwaukee Brewers face off against the Dodgers once again tonight in Los Angeles [noise]\nIt's NPR news [noise]\nLooking back on October sixteen [noise]\nTo be role of a raging wildfires\nEating getting hotter but won't fire and smoke choke our air Dana Rohrabacher is radically imposed efforts to fight climate change global warming is a flawed\nAds like this have been appearing throughout California Florida and in swing districts across the country targeting Republican lawmakers it's part of a multimillion dollar effort by the league of conservation voters to flip the house Democrats Tiernan sitting failed is a vice president with a conservation group\nIf we had in mind our allies leading how the representative they could do badly needed oversight on the ... minutes agent efforts to cater to poll leaders every day over our communities\nThat word oversight is one you hear a lot from Democrats in part because there's not a whole lot else they can do most of the world backs and environmental policy are happening in the executive branch under Trump appointees a shift in house leadership won't change that\nDemocrats can't force interior secretary Ryan Zinke you to restore Bears Ears national monument for example or to crack down on methane emissions but they can force him to explain himself\nArizona congressman ... is the ranking Democrat on the house natural resources committee\nI Want to change the narrative of this whole thing where the Resources Committee is not just the past of part of the Trump Administration that they're independent and that they have responsibility as co equals for oversight accountability\nTranslation expect hearings lots of them if Democrats retake the house Tom pile heads the American energy alliance which supports Trump's agenda he said a Democratic majority in the house would be a setback for the administration\nAnd they would be able to tie them up mercilessly so that they would\nKinda be able to slow walk a lot of the good work that's being done with respect to these issues\nDemocrats already have a working list here in Colorado congresswoman Diane and to get the ranking Democrat on the oversight committee for energy and commerce\nI think you will be seeing investigation than hearing around them that day in rural and clean power plant in the car rules you're going to be seeing I look more in debt\nConflicts of interest in corruption at the EPA\nAnd the list goes on to get says this year's midterms reminder of what happened in two thousand six when Democrats took back the house under President George W. Bush for the following two years Democrats called hearings and investigations and crafted legislation that they knew would not passed under Republican president\nBut that when President Obama was elected into that and we were able to move our backs legislative agenda because we had spent the last two years developing it now of course reports\nWhen President Obama was elected in two thousand eight we were able to move up Rebecca legislative agenda because we had spent the last two years developing it\nNo of course Republicans could keep their majority in Congress which would mean continued support for the administration's deregulatory agenda [noise] Nathan Rott NPR News [noise]\nAnd later today on all things considered the outcome of the mid term elections could also have a major effect on the future of us health policy it can listen to that story by asking your smart speaker to play NPR or your local member station by name [noise]\nThis is NPR News\nThanks for joining me for NPR's MORNING EDITION right here on member supported high plains public radio the current time is Eighteen minutes ahead of six am central coming up and less than a minute we've got a regional news report for you so stay tuned\n[noise]\nThe fall membership Dr continues on high plains mornings and stay tuned at night in central for a massive new music than the latest from mountain man Jason is now the J hops culture wall fleet Fox's and the brother brother high plains wanting after MORNING EDITION only on listener supported high plains public radio [noise]\n\n\nMy Bob Davis is ... executive director NPR's MORNING EDITION is a great way to start your day a great way to support each bee PR it's become a standing member joined the mission today at H. P. P. R. dot org\nAnd regional news Kansas teachers are increasingly covering subject they're not qualified to teach Stephen ... of the Kansas news service reports that's most common in special education classroom\nThe state can grant waivers allowing educators to teach subjects they do not meet the normal state requirements for and the number of those waivers has been increasing for years with the majority being issued for teaching special education special education has been hit the hardest by the state's worsening teachers' shortage\nSchools are also putting more teachers who have yet to receive their teaching licenses\nIn classrooms to fill open positions\nAccording to the states can't just started the school year with more than six hundred teaching positions unfilled by qualified teacher\nFor ... W News I'm Stephen ...\nThe Kansas news service the collaboration covering health education and politics across Kansas for high plains public radio I mean do you have like\nMorning I'm Rachel Martin the U.S embassy in Australia sent a bizarre email the other day it looked like an invitation to a meeting with an R in the late ... knows this photo annoying how we're planning back holding his latest chocolate chip cookies wearing a blue cookie monster costume the caption beneath red cat pajama jam U.S officials sent out an apology\nAnd yet the invitation what's fake but based on my Twitter feed the world's craving for a cat's pajamas jammed very real that's wanting it\nSupport for NPR comes from the station and from Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information it build on dot W. S.\n[noise] and from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\n\nAnd individuals choose T Rowe price T Rowe price invest with confidence\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep this story starts with a quiz yours your quiz master Noel King\nIt comes from political scientist John ... at the University of Nebraska that he's going to describe two towns and you have to guess which one is liberal and which is conservative here can number one\nThe schools with straps you know patriotism and respect and it would be a very rules based uh educational system the how this would be fairly similar the lawns would be a very nicely kept in a beautifully green and mode or the town of be quiet with lots of churches\nAll right and here in town number two\nSchools would be based more on experience are all kinds of things rather than than rote memory people would prefer older houses with wooden floors or rather than wall to wall carpeting um they would keep the yards natural um lots of bars and community theaters and foreign films are more of those then churches\nThis quiz was probably pretty easy for you and to explain why we're joined now by NPR's social science correspondent Shankar Vedantam Hi center I Know so different than I'm guessing was conservative and the second one with liberal right\nExactly not hitting is drawing on fairly traditional stereotypes about liberals and conservatives conservatives prefer order and rules liberals prefer exponential schools and community theater now those stereotypes which means that they're going to be liberals who hate community theater and conservatives who despised churches\nBut the question that hitting and others are asking is\nHow come these stereotypes are so often accurate\nIf being liberal and conservative is all about our political views how companies labels describe all kinds of other things about us from the kinds of food we prefer to eat to the kinds of poetry we laugh\nTo where we want to hang out he's arguing that our political views spring from something deeper than just our beliefs about big government or small government\nPrecisely he's arguing that political preferences at least in part\nCome from a psychological and biological predisposition\nThe most compelling evidence for this comes from studies involving large numbers of twins some of whom are identical and some of whom are fraternal identical twins share the same genes fraternal twins share fewer genes\nIdentical twins to not to have more political preferences in common than fraternal twins do even though each twin ... presumably shared the same family and upbringing\nHeight for example turns out to be about eighty percent a heritable when you're subject to the same kind of design personality traits are about fifty six percent political views thirty to forty percent\nThirty to forty percent so he's saying some part of our political beliefs come from biology\nYes and of course that conclusion upset a lot of people\nAnd they tended to over interpret those results and make it sound like we were saying that everything was was genetic but you know if it's thirty four percent genetic that obviously it's you know fifty sixty Seventy percent that comes from the environment so our thing is that that genetic component is not zero but apparently that was enough that that some people were upset about that\nWhat he and his colleagues that saying is that biology and psychology play a role in our political preferences know liberals and conservatives in the United states often accused one another or stupidity or malice but if ... and his colleagues outright one reason we might not see the world the same way is because we simply not lie at\nThe same way that is a nice way of looking at it indeed offer some compassion for the other side\nAnd convey done to ms hosted the hidden brain podcast where you can learn more about how psychology Shapes Our political views thanks temperature [noise]\nSupport for hidden brain coming from them loom offered the cloud video conferencing on mind meeting the video conference room solution in one pot farms featuring digital video\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da da Silva serve high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. at H. P. P. R. dot org or call eight hundred six seven eight seven four four four\nWho\nMorning secretary of state Mike Pompeo hail me to the leaders of the hospitals are on the diplomatic meeting Saudi Arabia is and how It's MORNING EDITION from NPR News [noise]\nComing up how the reaction to Jamal to shield gene disappearance is threatening Saudi business I'm Rachel Martin\nAnd I'm Steve Inskeep drug makers base of demand this vote more information the Trump Administration wants them to put the list prices of drugs and have\nAlso what happened when France for three months of rain in two hours\nAnd we have a story of protests during the national anthem to Olympic athletes mosser metal for raising\nTheir fifty years ago and I\nIt's Tuesday October sixteen the singer John Mannes forty one years old and the new shoes next\nLive from NPR News in Washington I'm more of a Coleman authorities in the U.S southeast say at least Seventeen people have been killed because of hurricane Michael but dozens of others still remain missing there are areas where there is no cell phone service especially in the Florida Panhandle\nThat's where the storm made landfall so people cannot check on their loved ones\nNPR's Quil Lawrence is in the Florida Panhandle\nThey're Eighteen shelters in Florida alone and hundreds of people are still living in those\nOthers are having to start finding contractors or get insurance claims filed or trying to get help from from FEMA trying to get their roofs covered up with ... so that if it rains it will cause more damage than what already happened in the storm NPR's\nQuil Lawrence secretary of state Mike Pompeo has met with Saudi Arabian king ... men in Riyadh they're discussing the fate of Saudi journalist ... because he feared murdered news reports suggest the Saudi Government is considering saying he died in an interrogation gone wrong\nNPR has not confirmed these reports\nRural Americans are as concerned about drug addiction as they are about the economy NPR's Alison Kodjak reports on a new poll from NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nThe poll shows that about a quarter of the people living in rural areas said drug addiction or abuse is the biggest problem facing their communities that's about the same share that side of the economy and their biggest worry\nThose two categories overwhelmed all the other responses in the survey of Thirteen hundred people who live in rural areas but even with those worries people say they have a positive outlook about their future\nRobert Blendon is the professor at Harvard th Chan School who directed the pole\nIn terms of the future at least half of people are quite optimistic\nMost of the people who responded to the survey said they are doing better than their parents and the majority said they expect their kids to do even better Alison Kodjak NPR News\nA federal judge has dismissed a lawsuit against President Trump from adult film actress Stormy Daniels she had claimed the president had defame for earlier this year on Twitter NPR's Jessica Taylor has more\nBeing sued over a tweet Trump sent in April thing Daniels with lying about being threatened in twenty eleven not to go public with their story of an alleged sexual encounter with Trump but in his ruling the federal judge wrote that the tweets quote constitutes rhetorical hyperbole\nNormally associated with politics in public discourse in the United states that it's protected by the first amendment and if they meant Trump's attorney called this a total victory for the president\nDaniels' lawyer Michael ... they would appeal the ruling and the other legal action over a nondisclosure agreement Daniels signed would proceed\nTrump has denied any sexual encounter with Daniels but did finally admit to reimbursing his lawyer for a hundred and thirty thousand dollar payment to Daniel's on the eve of the twenty sixteen election Jessica Taylor NPR News Washington\nYou're listening to NPR News\n[noise] MORNING EDITION and supported in part by a gym and\nTo tailor NPR News Washington You're listening to NPR News\nMORNING EDITION it's supported in part by O. H. M. S. cafe in bar downtown Amarillo for twenty six years offering fine dining Tuesday through Saturday and catering for any size event O. H. M. S. cafe dot com\nWell good morning high plains I'm Brian be around you are listening to MORNING EDITION on your ... members supported high ... uh oh let me try that again\nYou're listening to NPR's MORNING EDITION on your public radio station high plains public radio good morning I Am Brian ... joined in the studio by Bob David the executive director how are you doing this morning doing well Brian good morning good morning to all our listeners out there on\nA MORNING EDITION thank you for choosing to make high plains public radio a part of your morning shirts or [noise]\nOr if you're like many of us across the high plains are waking up it's a pretty chilly below freezing and most of the area so you're starting around maybe getting that cup of coffee first cup of coffee go in and out getting ready to start your day you get the kids off to school maybe you're already in the car on the way to work\nAnd so I thank you for listening to us and if you are somewhere where you can stop and pick up your telephone may I suggest that you call\nOne eight hundred six seven eight seven four four four to pledge your support\nFor members supported high plains public radio that's how it works\nBy that is exactly how it works Bob this is a member supported radio station and I think a lot of people are aware of all across the country that public radio is generally a a member supported type of a of a you know set set up\nBut even more specifically high plains public radio is a community lights in the which means we're not beholden to any universities were not beholden to any state governments are already sort of things like that this is a community organization you the citizens of the high plains own this radio station\nAnd the way that you can offer more support the way that you could actually provided financial platform to keep this program and going is simply to pick up that phone and call one eight hundred six seven eight seven four four four\nYou can also go to H. P. P. R. dot org click on the red ... uh give now button the whole point is do it now here's some news [noise]\nI'm just kidding that's there's no news here Bob there's no news here I I I'm just making sure everybody's paying attention we've we're still we've got about another minute actually before the news begins and we're just still getting started here we're letting everybody know that there is a new member challenge on the table today Bob would you do you have any of fashion\nAbsolutely three hundred dollar new member challenges in effect this hour and what that means is when you call in with your pledge of support\nYour money has doubled so that if you came in at the five dollar a month level or you would be like giving high plains public radio and services ten dollars a month\nYou only put at five\nAt a loyal members matching with the other ... other five to make ten so please call one eight hundred six seven eight\nSeven four four four and thick it's\nMORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin when journalists Jamal ... went missing two weeks ago Saudi Arabia said it knew nothing about it even though 'cause she'll gee was last seen walking into the Saudi constantly in Turkey turkey\nThe gal Saudi Arabia said it knew nothing about it even though 'cause she'll gee was last seen walking into the Saudi consulate in Turkey Turkish officials are accusing Saudi Arabia of murdering the journalist who was a vocal critic of the Saudi regime\nNow there are several reports suggesting that Saudi Arabia's leaders may have known more than they let on meanwhile President Trump dispatch secretary of state Mike Pompeo to Riyadh where he's meeting today with king selmont and with crown prince Mohammed bin Salman\nNPR's Michele Kelemen is on that trip traveling with the secretary and joins us now from Riyadh and I will just do what we do have a delay on her line Michelle can you just start by explaining what the Saudi believe happened to ... to show you what are they saying\n\nWell you know officially they've um haven't gone they haven't said anything different when what they've said all along you're hearing sources privately I'm\nFloating some other ideas that he was um a interrogated and it was interrogation gone wrong there are lots of different versions of events out there um but what the U.S officials who are traveling with ... saying is look we haven't heard that from\nUm them directly we're waiting for these meetings we want to hear what they say face to face and that's what\nI'm secretary palm pay was doing here they they've been very tight lipped about what they think about um this changing storyline that seems to be happening from from this outage\nThat kind of story right there that's the that's the story beneath the headlines that strike expand on expand on what we're learning a goes beyond beyond the little snippet beyond the headlines get some perspective there and uh\nWhat I ah in for information is what we're about here at high plains public radio so thank you for listening to your members supported high plains public radio we know that uh our listeners are out there are getting ready to start their Tuesday I kind of a chili Tuesday across the\nHigh plains and uh when we say across the high plains\nWe mean quite a ways across the high plains if you think about just just where the uh the network has a towers relays it covers Garden City Bush Lynn Amarillo Spearman Perry turn Gaiman Oklahoma Lamar\nHayes he'll city Colby Brewster Elkhart [noise]\nDell Dell heart ... and dodge city on K O when Q A this is a mouthful it in a it's we want to hear from every one of those cities and everybody around them a threat everybody around them because that's just where the towers adds to the towers\nPlease consider calling one eight hundred six seven eight\nSeven four four four you can do the same thing by going online to H. P. P. R. dot org when we say in touch with the world at home on the high plains we mean all across the high plains is a big large\nA coverage area you could be at the top of Kansas and go all the way down into the pan handle if Texas deep\nAnd hear high plains public radio to please come in with your support one eight hundred six seven eight seven four four\nFour and thank you for listening\nSupport for NPR comes from this station and from fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learned more it fidelity dot com slash wealth fidelity brokerage services sellout see\nFrom the Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security healthcare and science and technology leadership\nBrown dot edu slash NPR\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email pamphlets dragging drop email editor and twenty four seven customer service Morris campaign monitor dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin flooding in the south of France has killed at least eleven people heavy rain transformed reverse into raging torrent that wiped out roads and bridges even swept people from our house since in the middle of the night Here's NPR's Eleanor Beardsley [laughter]\nFlying in a helicopter over the ... river in southeastern France a reporter from the F MTV points out villages Roseanne feels underwater you can see cars and trucks flooding like toys and a bass\nDuring the night Sunday to Monday three months of rain fell in only a couple hours catching people off guard when most had already\nHe's in a bass during the night Sunday to Monday three months of rain fell in only a couple hours catching people off guard when most had already gone to bed and eighty eight year old nun with sweat from her ground floor room when the floodwaters crashed through the confidence front door her furniture with carried out onto a veranda\nThe nuns body was later found in the trees outside\nThe sound of Ninety nine year old ... such a fate because her bedroom is on the second floor she spoke on French television do you do ... ... I wanted to come downstairs but water was coming up the staircase so I just went back to the vet said and what else could I Do\nI Need help me how many how many ... says never in her life\nHad she's seen flooding like this the French prime minister visited the devastated villages Monday President Emmanuel Macron heads down today as the waters and fear recede anger is rising\n\nWe weren't given any warning that this group of people meeting with a local mayor you couldn't have maybe\nGiven us a heads up at two AM that we needed to evacuate\nBouts of heavy rain in areas of higher elevations surrounding the Mediterranean Sea or regular fall phenomenon the downpours are caused by hot moist air pushed up from the Mediterranean and meeting colder air from the north\nBut the frequency and intensity of these ranges increasing Eric ... the mayor of ... which lost six people he says they did everything they could\nSue convicted approve of it when they come from\nThe rainfall was three times what was protected and he says and the sudden violence of these orders were terrified we're dealing with extreme situations brought on by climate change says ...\nAnd no one can be sufficiently prepared Eleanor Beardsley NPR News Paris [noise]\nFifty years ago up in Nineteen sixty eight Olympic Games in Mexico city track ... anticipated a special you're starting to hundred meter rich [noise]\nBut it was what happened after the roads that was so memorable Karen Grigsby Bates of our Code Switch team has one of our reports on Nineteen sixty eight\nNineteen sixty eight was a tumultuous year around the globe and Mexico City with new exception the games began in ... because a few days before the army had opened fire on thousands of students protesting in a city square\nSome reports say as many as three hundred were killed their blood would wash from the streets and the games begin soon after\nIt was in the atmosphere that runner's John Carlos and Tommie Smith came to Mexico City they had a plan that we're going to protest racism and injustice on the world stage in an oral history for the library of Congress John Carlos said he'd met Martin Luther king just before king was killed [noise]\nKing's vision of how effective a non violent Olympic protests could be left a lasting impression\nI wanted to do something that would be So Paul ... is an hour and you're still in a while\nAt the games Carlos won a bronze medal for the two hundred Smith a gold setting another world record as they walk to the Olympic podium people noticed both of them were carrying their sneakers and wearing black sucks symbols of an impoverished black America\nAs a national anthem played in the last weekend rides Smith and Carlos build their heads and raise their black gloved fists in the air years later talking to ABC Australia TV Australian Peter Norman the silver medalists to share the podium with Smith and Carlos recalled the moment the rise to um\nPeter Norman the silver medalists to share the podium with Smith and Carla recalled the moment the rise to um [noise]\nWas a symbol of unity with the news coming together and a symbol of spring [noise]\nIt was never on done away but was able to me is\nExactly how it was taken by many after a shocked silence the stadium filled with a boost the photo of the rates fits the loop was front page on newspapers around the globe within hours as the ABC tape showed the consequences were immediate\nSmith and highly were told to leave the Olympic Village and Mexico within forty eight hours they were both stone that the decision but regarding the composure\nBoth men were stripped of their medals they got hate mail in debt threat they were ... for decades in the U.S for their silent gesture many black Americans thought Smith and Carlos were heroes though there are up ... became a symbol of refusal to get into racial injustice the precursor to taking any\nSan jose State University professor Steven ... teaches African American studies now but he was an undergrad at the school in Nineteen sixty eight he vividly remembers the two venues reception when they came back to campus shortly after Mexican city\nHundreds of students put their fist up as soon as they saw Tommy and job walking toward the podium and for the rest of that decade the raised indicated the unity and the determination and the real appreciation for Smith and Carlos\nBut there was a cost to those principles for years both men struggled to find good jobs their marriages suffered their children were bullied at school employers shied away from them\nSmith and Carlos were banned from Olympic participation for life to live with that I don't have to go to the number here at talk of the Los Angeles public library in June John Carlos says he realized he was an Olympic presence even in its absence\n... showed up in art work at the games in Munich in Melbourne a huge statue of him and Smith at San jose state it's a much visited tourist attraction\nEarlier this year Tommie Smith till the W. new higher authority inspired the moment\nWhen he finally justified in the meetings of a young black athletes who were hopeful for the Olympic a moment\nThe gesture that was so misunderstood in Nineteen sixty eight now better understood even celebrate it and in two thousand eight this happened\nThe recipient of the audacity of war the courage joined Carlos and Tommie Smith\nVindication Karen Grigsby Bates NPR News [noise]\nIt's NPR news\nToday's oil and gas report brought to you by level law firm of Amarillo representing land and mineral owners across the high plains license in Texas Oklahoma New Mexico and Colorado level ... dot net\nHad called for a transition of the Saudi economy away from oil and toward a more diverse market based model and the crown prince invited the companies to participate\nJacob Kirkegaard of the Peterson Institute for international economics says the ... Jia fair is undermining the crown princes vision\nNamely that the world's most advanced than competitive companies come and establish themselves in Saudi Arabia\nThat scenario is fading as the CEOs of large us and global companies one after another announced they will not attend the second vision twenty thirty conference scheduled for next week Jamie diamond C. E. O. J. P. Morgan Chase has said he wanted to end again Jacob Kierkegaard\nI think the fact that as CEO as prominent as you know J. P. Morgan Jamie diamond not going to the summit and saying so publicly and linking it to the show the disappearance means that many other CEOs will probably put out\nTo other prominent Wall Street CEOs Larry fink of black rock and Steve Schwartzman of the Blackstone group also say they won't be attending\nAccording to the New York times the trio of CEOs tried but failed to get the Saudis to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven ... to stay home\nThe ... the allegations along with previous behavior of the crown prince are making companies nervous says Kirkegaard\nHe says remember that back in twenty Seventeen the crown prince rounded up four hundred Saudi princes and businesspeople detained them at the Ritz Carlton in Riyadh on corruption charges and force them to pay the government as much as a ...\nSaudi princes and businesspeople detained them at the Ritz Carlton in Riyadh on corruption charges and force them to pay the government as much as a hundred billion dollars I mean he\nBasically sending the signal that the rule of law in Saudi Arabia is amiss when you're trying to lure foreign investors into your country that is about the worst signal you could possibly\nSend them but Karen young a resident scholar at the American Enterprise Institute says U.S companies whose snow but the Saudis will likely pay a price because the Saudis will take it personally\nThat decision on the part of the U.S corporate to walk away from this conference and to in some ways you know turn it back on the Saudi Government as a partner will not be forgotten by the Saudis\nYoung says it could be two decades before the Saudis will re engage with these companies young also says us sanctions against the Saudis could be tricky\nThere's lots of Saudi money in us tech real estate and stock market she says and the Saudis on lots of US government bonds not to mention the country's key role in the oil markets so the Saudis have ways to retaliate\nJohn Ydstie NPR News Washington [noise]\nThis is NPR News\nAnd this is high plains public radio your members supported public radio station I'm Brian beer out you're listening to MORNING EDITION I'm joined in the studio by Bob Davis our executive director and\nHigh plains public radio is in the fall twenty Eighteen membership campaign if you would like to become a member and will tell you why you should become a member in a minute [noise]\nGo ahead pick up the phone call one eight hundred six seven eight seven four four four or if it's more convenient Goto H. P. P. R. dot org\nAbsolutely perhaps you're thinking as you're listening to MORNING EDITION on high plains public radio I'm never made a contribution to public radio station or even more specifically H. P. P. R. before could it really is it really make that big of a difference\nAnd the truth is it actually it actually does make a bit of a difference there we get some money from foundations and for businesses organizations the corporation for public broadcasting but\nIf you look at it that that's what can be\nUnpredictable can go up and go down to ... it's not a very ... not at all uh but one of the conscience of high plains public radio community supported high plains public radio is donations from listeners it adds up to an incredibly ... an important part of our operating budget and that\nComes from listeners like you people who have made MORNING EDITION on high plains public radio a part of their morning when thousands of listeners give what they can\nThe collective voice becomes more powerful than any single source of income so thanks to your collective voice high plains public radio can put quality first your individual contribution makes a big underline that word big difference do your part today call one eight hundred\nSix seven eight seven four four four I'll say that one more time just because maybe your little busy you want to slow down a bit has put your coffee down grabbed at Penn or grabbed the phone and dial one eight hundred six seven eight seven\nFour four four or go on line as well Brian H. P. P. R. dot org yeah I mean on line is a very\nSeven ... seven for for ... or go on line as well Brian H. P. P. R. dot org\nI mean on line is a very easy convenient way to do it so by all means feel free to go that route but\nIf you want to call one eight hundred six seven eight seven four four four\nYou get to talk to a human being and that human being is going to want to talk right back to you to go ahead and make the coal\nSupport for NPR comes from the station and from log me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com\n[noise] from indeed used by over three million businesses for hiring where employers can post jobs and youth screener questions to build their shortlist preferred candidates learn more it indeed dot com slash higher and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm Steve Inskeep\nAnd I'm Rachel Martin it's been a year since the most destructive fire in California history the tubs fire destroyed thousands of homes in northern California now despite the reds because some are rebuilding in those very same areas from member station KCUR weedy and NPR's energy and environment team\nLauren Sommer reports it was late at night a year ago when ... was called into work\n[noise]\nHe's assistant fire marshal in Santa Rosa and the Thomas Fire was moving fast it was\nExploding at a rate that I would've never imagine would occur\nHours later he drove past his neighborhood you could actually make out individual homes and heritage is looked like an entire wall of fire and then realized right away that\n... gone ... has spent the last year picking up the pieces and a crucial question came up for him and thousands of others should they rebuilt and\nCalifornia wildfire is a fact of life the Thomas Fire with a repeat of a fire that burned the same area more than fifty years ago but ... says the housing market was too tight\nBut honestly it also added a lot to do with my daughter this is where we were before the fires and that's where we want to be after the\nFires [noise] now the drywall is just about to go up at it you have\nIt abuses on really moving as quickly as you'd like to do but yeah I just don't know the ... site\nAnd knowing what he knows about fire he's making sure this home will be better protected with fire resistant materials\nBetween the roof deciding things let nature um is definitely a stuff that I wanted to\nBut he doesn't have to take that step\nCalifornia building codes require fire resistant materials if you live in a designated wildfires down but loaned those house wasn't technically in that zone before the fire and neither were almost two thousand other housing units and so far they're still not asked Santa Rosa's director of planning David due in about that\nWe don't have a an an extra set of rules are are requirements that we put on people um to to rebuild\nGiven says legally city couldn't change of the building codes overnight and it can't stop people from rebuilding\nWe can go in and take somebody's property and that's not the role of the city\nPlus the the housing shortage is even worse now\nWe need to walk and chew gum at the same time we're going to rebuild our communities fasting quickly sufficiently as we possibly can\nBut we also have to build new homes this weekend\nHe says the city is trying to entice developers to build downtown but one big project is proposed for the hills right\nWhere the fire swept through so this is the forty acre parcel or are they wanted to put the two hundred and thirty seven homes the trees all around me are are black and almost all the way to the top\nI'm standing there after turning off my recorder a man comes up to me\nThe trees all around me are are black and on the other way to the top\nAnd I'm standing there after turning off my recorder I'm am\nComes up to me because I'm looking at the same for the development and said\nI definitely wouldn't want to live there [noise] he didn't want me to record that though\nIn February the city council debated this project\nTo public carrying round barred and village project\nSome members light at the town home to the fire resistant and create much needed housing but one council member Julie combs had doubts\nI just think we need to put more sleeping people in a fire hazard area\nCombs was the only no vote and I know I've heard stories of flooding along the Mississippi and thought why did they keep rebuilding their\nShe says some insurance policies pay people less if they don't rebuild and the same place or they just can't afford to allow swear and the city doesn't have a way to bite people out and some don't want to go\nFor a method new music up in the latest from mountain man Jason is now the J hawks culture wall ... and the brother brother it's high plains morning after MORNING EDITION only on listener supported high plains public radio [noise]\n\n[noise]\nThis is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of H. P. P. orange Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n...\nGood morning days after hurricane Michael made landfall in Florida many people have no power while others were evacuated\nLawrence reports on life from the Florida Panhandle I'm Steve Inskeep and I'm Rachel Martin us secretary of state like Paul pale in Saudi Arabia today the Saudi regime and the cans of possibly murdering journalists them all to show that Trump now says it could be real killers this hour we for the arms deal between us\nAnd a new poll says they're arguing issues motivating rural American voters this year drug addiction an\nThat covers the actor director Tim Robbins turns ... years\nOn the news kept coming up next\nMine from NPR News in Washington encore Coleman rescuers in Florida continue to search for dozens of missing people from hurricane Michael cell phone service it down in large areas and people are still trying to reach missing loved ones that storm killed at least Seventeen people\nSecretary of state Mike Pompeo has met Saudi Arabian king cement in Riyadh to discuss missing Saudi journalist ... who's feared dead the Saudi king has denied knowledge of its faint turkey allegedly ... was murdered when he went into a Saturday consulate in Houston Bowl and never came out\nNPR's Peter Kenyon says Turkish and Saturday investigators have now searched the constantly looking for evidence\nTurkish officials say the nine hours surge involved the collection of samples which will be examine further to constantly research with the Saudis permission and with Saudi investigators independence turkey says it also wants to search the consul general's residence and possibly diplomatic vehicles as well the Saudis denied any wrongdoing\nNPR's Peter Kenyon there are media reports suggesting that Saudi Government is considering saying ... died in an interrogation gone wrong NPR has not confirmed these reports\nThe Trump Administration is planning to require drug companies to include the retail price of their medications in television or other consumer ads NPR's Alison ... has more\nHealth and Human Services secretary Alex ... says he'll require drug makers to include retail prices MTV advertisements for prescription drugs\nPatients deserve to know what a ... could cost when they're being told about the benefits and risks ... may have\nUnder the proposed rules companies will have to disclose the monthly list price of any medication that costs more than thirty five dollars the pharmaceutical industry is already taking steps to preempt the administration's actions the industry group farmer says it's member companies have agreed to include in their ads information about where consumers can\nAdministrations actions the industry group farmer says it's member companies have agreed to include in their ads information about where consumers can look up and medications price but that plan fall short of actually disclosing retail prices Alison Kodjak NPR News Washington\nHarvard's top admissions officials will face more questions today as the federal trial over the university admissions policies moves into a second day from member station W. B. you are in Boston carry young reports Harvard is accused of discriminating against Asian American applicants\nTheme William sending the plaintiffs first witness in the trial attorneys with students for fair admissions that group that filed the lawsuit spent most of Monday asking him questions about the schools for recruitment tactics\nThat plane tickets for questions attendance further today as they continue walking through the details of the school to admission process including its approach to assessing and applicants character traits\nFormer Harvard president through south and other admissions officials are also expected to testify at the trial goes forward\nCarry young reporting you're listening to NPR you're listening to\nMORNING EDITION on your member supported high plains public radio good morning I'm Bob Davis and thank you for listening to us I'm joined here in the studio with a cast of characters including ... and they're both in good morning tail\nThey good to be here this morning I sounded great up and live and rarely go I Am so proud that was by design but [laughter] but we're here to remind you that your pledge of support is what makes MORNING EDITION happen on the high plains um if you think about all of the people potentially that a\nHigh plains public radio and MORNING EDITION reach which just this one network of stations it's probably close to six hundred thousand people that can tune in every morning to a MORNING EDITION six hundred thousand people\nAnd yet the some of them do and some of those who do don't budge so it's important to know that your pledge to support makes it possible if you become\nA not I'm not the word is not addicted but certainly a\nA user invents a dip into a user of MORNING EDITION or you find that important in your morning at port enough maybe the such or alarm or to MORNING EDITION\nOr they you know put a little a little bit of money forward\nTo make it happen and you do that by calling eight hundred six seven eight seven four four four I might suggest a sixty dollar pledge this morning the high plains public radio you could do the same thing H. P. P. R. dot org\nThe beauty of that a sixty dollar pledged this morning because of a three hundred dollar new member match if you're a new member pledging sixty dollars it's like you pledge a hundred and twenty dollars all you have to give us the sixty\nA hundred and it turns into a hundred and twenty dollars and by the way Dale among that that a vast swaths of the high plains or to cut that radio on anywhere from the top of Kansas into Nebraska all the way deep into the Texas Panhandle from the eastern\nSide of Colorado deep into west Kansas how much does it cost to cut down that road radio and hear programming like MORNING EDITION for I'm actually the cost\nThe listener I Know that [laughter] it is a free service ... always has been a radio in the United states is free there's no tax you don't pay a radio tax or anything like that or it solve it comes to you for free but does it cost to the station oh costs the station a lot of money\nThere is a is estimated that a hundred and eighty one dollars per hour\nIs what it takes to run the station and I'm Talking twenty four seven four seven days a week\nHundred and eighty one dollars per hour that's a lot of money\nAnd I'm so everybody doing there\nAnd I'm Talking twenty four seven four seven days a week hundred and eighty one dollars per hour that's a lot of money and I'm so everybody doing their part makes that possible everyone doing a little bit as much better than one person paying for the whole thing and that's what we're asking you to do just a little bit\nThrough your part good match dollar for dollar if you're a brand new member of the public radio but make it happen this morning a workout and down the days and this membership drive for going to we're going to end at some point we're going to end so [laughter]\nUh this opportunity to have your pledge match all those things will go away if you're if you don't call eight hundred six seven eight seven four four four you can go on line at age ... P. R. dot org and do the same thing and you get matched dollar for dollar as well if you're a new member at age ... P. R. dot org\nEither way it's now is a great time to do it eight hundred six seven eight seven four four four back to MORNING EDITION\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep let's take a walk around the Florida Panhandle which is cleaning up after hurricane Michael we will focus this morning on the Panama City area\nIn the beach communities there are some buildings are fine others no longer exist and NPR's Quil Lawrence has spent days taking it all in either Quil tasty so what have you been seeing well\nI mean there were a their trees down everywhere these towering pine trees that are just snapped over at the middle and some of the communities along the water they've been they've been flat and then I Know people so to say that word or they try to describe it mostly uh people down here keep using sort of\nChildren's toys metaphor sayings like a kid swept all the houses off the monopoly board\nOr you know a kid snapped his his toy tree I I don't think people can really believe that uh that if a win could snap that to keep they keep on trying to reduce it to some metaphor they could understand how how this could just get picked up and move to blocks\nAnd flipped over at the point where you can't see\nWhat was a house and what was a vacant lot ... I'm so in those communities there are people are really asking how can you rebuild that's talking about like Mexico yeah\nYeah Mexico beach I think we've seen the overhead shots were there seems to be about one house that is intact and a couple of others that are severely damaged and everything else utterly destroyed but when you pull away from that spectacular shot that you see widespread damage up and down the coast\nAnd everywhere in this in this a swap that dozens of miles and miles wide you can cheat at the store and just tore straight up\nI'm I those are the kinds of things that you get when you listen to all things considered and MORNING EDITION on high plains public radio okay great they you're right they're fabulous fabulous stories that are here there every day but\nHow does it come to me how does it come to turn on my radio there every morning well that's that's that's easy\nIt's the financial support a public radio the part that you don't see the thing behind the curtain\nThat you don't see as the financial support a blister members just like you're doing their part are doing their five dollars a month for public radio doing their twenty dollars a month for public radio that's the part that you may not see but that's really what's making it happen that's driving the whole train right here\nIs financial support at one eight hundred six seven eight Seventy four forty four online that number to call is eight hundred six seven eight no I got that backwards in that six seven eight seven four four four on line at H. P. P. R. dot\nOr get some more coffee tail or [laughter] you know take your point or that there's a poll that was recently ah ah conducted and they posed\nA for people living in rural America and that is a fat is that the ... the majority of the high plains the poll asked you know what's on your mind what is concerning is the new results show that a opioids and economic issues have people worried in rural areas across America\nBut the overall top blind looks like that they are upbeat and ... and and uh remain with a positive view of their communities that story is coming up on MORNING edition it's one of the many reasons that you turned we believe to\nHigh plains morning and MORNING EDITION so please call one eight hundred six seven eight seven\nFour four four to pledge or support right now and thank you for listening\nSupport for NPR comes from the station and from T. I. S. T. A. it's committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more AT T I Am a dot org\nFrom farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ... pounds coverage options and more\nCommitted to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\n[noise] I'm from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin drug addiction and the economy according to a new poll that is what is on the minds of rural voters that they go to the polls that election season the poll with them by NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nBut NPR's Alison Kodjak reports that even with those real challenges many rural Americans are optimistic about the future\nIf you want to picture of the trouble that face some rural communities income Brenda a self described homemaker from the heart of Appalachia she fifty seven and married to a former coal miner\nAnd his ah that from the black lung and having a real hard time to worry if I found for him to come out anyway\nAnd drug addiction has hit her family especially her two grandsons hard\nMy daughter and her has and\nUm duct tape on and have walked a couple of 'em because they couldn't give up his truck\nHe's still alive but some of her other relatives aren't including her niece\nThat found her and her home a lie [noise] September\n[noise] [noise]\nShe was thirty three years old she left behind three boys\nBrenda NPR's not using her last name to shield her grandchildren lifting Coburn Virginia a town of about two thousand people near the point where Virginia meets Kentucky and Tennessee her experience fits into the findings are new poll which shows that in rural America drug abuse ranks with the economic outlook as residents top worry\nAlmost half of rural Americans have been personally affected by the opioid crisis when we asked if they personally know someone who struggled with addiction forty nine percent said yes Brenda says it's worse in her community\nIf he were to approach can family randomly and give them a piece of paper and have\nYou have someone in your immediate family\nOn the road I out of hand with like ...\n... says in Coburn jobs and opportunities have dried up state officials have been promising to bring in economic development but none of it has reached her community yet\nIf you come out of college with a degree uh you're more than likely going to leave this area to find work\nBut experiences in rural America very widely in our poll bears that out\nSurvey of Thirteen hundred adults all living in rural areas should that many people are optimistic about the future of their communities most of the people we surveyed say they're better off financially than their parents and a majority think their children will do better still\nRobert Blendon professor of health policy and political analysis at the Harvard th Chan School directed our poll\nThey're optimistic about about the future and they're also optimistic that things can be done the pulled them out of these economic problems they face\nLost some rural communities are suffering others are thriving says Christopher thorn burn the founder of beacon economics and Los Angeles\nMight have a cold town and an oil town well the whole town is doing terrible because coal can't compete in this era of cheap natural gas on the other hand because of fracking these rural community\nWell the whole town is doing terrible because coal can compete in this era of cheap natural gas on the other hand because of fracking these rural community sitting on ... are booming and incomes are up dramatically as a result of all that new money flowing into the region for oil exploration and drilling\nThe economy and grenade in Mississippi a city of fourteen thousand about halfway between jak sending in Memphis, Tennessee is doing well says a key\nPowell alone job opportune\nPalace to twenty four year old truck driver who grew up in Grenada he says the town has a drug problem but its economy is growing\nIt's almost like a turban tone on this starting to fall and bigger restaurants are being put her now within the past two years we really do believe\nAnd Brenda says she's seen flickers of hoping Coburn the town's high school has a new football coach and the community has come together to support the players\nYou know one of the inflatable how much that the kids run three way bottom one of them was twenty six hundred dollars we ... the white wearing\nAll in one year so there's good people hardworking people\nEven though sometimes things still looks bleak Brenda says her view of her community is getting better Alison Kojak NPR News\nThe Milwaukee Brewers hold two games to one lead over the Los Angeles Dodgers and baseball's National League championship series if the brewers should win the series\nAnd Dodgers fans will insist on the if if they win the brewers would reach the world series for the first time since Nineteen eighty two one man is celebrating already\nThat is the voice of Bob euchre one of baseball's great voices and he happens to be a long suffering brewers fan euchre has been calling gains for Milwaukee since Nineteen Seventy one he was a player to do with playing career started there in sixty too\nLong ago you could start in an ad were an usher removed him from his good seated a ballgame must be in the front row euchre says only to be taken back to the cheapest of cheap seats high up up up that self deprecating style fit a catcher who had trouble\nCatching he wants to explain to Johnny Carson his technique for handling the knuckleball\nEasiest way to catch it was to wait until it stopped rolling and just pick it up [laughter]\nIt likeability or number role as a play by play announcer in the film major league in his most famous line of the movie he fed to the radio audience about a wild pitch that misses the strike zone by about a city block\nThe sun\nThis season though he's been enjoying real brewers success there's\nVideo of him in the locker room after one of the teams biggest wins the players crowd around him that's man in his eighties dumping beer on his head of course here is reacting tweet Fox Sports Wisconsin for more\nWell they're all they're all we\nKnow what is it near and [noise]\nI mean to be treated like one of one of them all the time I think that special for me\nRemember there is no high in euchre Bob ... Milwaukee Brewers face off against the Dodgers once again tonight Los Angeles\nIt's NPR news\nToday's oil and gas report brought to you by love a law firm of Amarillo representing land and mineral owners across the high plains license in Texas Oklahoma New Mexico and Colorado ... dot net\nSo ah thank you for uh making H. P. P. are a part of that we just came out of a story dealing with uh the United states and its relations with Saudi Arabia\nAnd it's as if I think it's an example of a serious global reporting that you can find here on high plains ... a\nPublic radio and on MORNING edition or do you turn to us because of of that sort of global perspective and you also because you hear a regional perspective things that are important almost ...\nThat sort of global perspective\nAnd you also because you hear a regional perspective things that are important almost exclusively to the high plains high place from the radio it depends on your financial support to keep both of those efforts going we know you are a citizen of the world\nBut also a citizen of the high plains and so this is er this is the reason we're coming to you during uh during this time or in the fall and that is to ask for your support for high plains public radio you can take care of it by calling\nOne eight hundred six seven eight seven four four four\nYou may not realize this but you have an employee and her name is Ofeibea Quist Arcton didn't I haven't met her yet have you but she is your employee you make her that you make it possible for ... to ... to report on stories out of Africa\nThat's the kind of world reporting we do\nA Cory Flintoff he's another one of your employees who works out of the Moscow bureau and reports on on things going on in Russia\nYou make it possible for Cory to to be able to bring us those stories that's what you do when you make a pledge to support the high plains public radio so don't let Corey down ... down let them know that you're right here supporting their efforts to bring you the news of the world\nOne eight hundred six seven eight Seventy four forty fourth the number to call to make your pledges of support this morning for MORNING EDITION\nAnd the great world coverage that this uh this program brings and if if you think about it\nOr the BBC is made possible by listener members you you hire a whole to a team of the largest news gathering institution in the world the b._b._c. you there all your employees\nAnd they're bringing you news and information overnight during the day all on twenty four hours a day bringing you news and information that's what you have available at your fingertips\nTurn on your radio listen to the high plains public radio listening to MORNING EDITION listening to the BBC that's all made possible by listener members and thank you so much to everybody who's made that possible for me as a listener I Am so appreciative that you guys have all come together to make MORNING EDITION possible\nUm we like to be able to thank you for your support a MORNING EDITION but you have to call first eight hundred\nSix seven eight seven four four four you can go online and do the same thing we will be happy to read your name on the air if that's what you like or read any comments that you have people out remain completely anonymous that's fine too but we do need to hear from you it's about ah what twenty twenty three minutes before no Eighteen minutes before the top of the hour\nUh there's not much time left in this hour there was a three hundred dollar brand new member challenge grant meaning that any ... if you're a new member never pledged to public radio before in on the high plains or you'll get matched dollar for dollar to three hundred dollars\nNo one's taking advantage of that yet or what that tells me is on there's a lot of new members out there that are that are sitting and listening and thinking that someone else was going to do it now it's your turn eight hundred six seven eight Seventy four forty four go on line at H. P. P. R. dot org\nDale hit a lot of ah spots globe than we what we found around all over the globe and if you will allow me to try to bring it on home because uh uh that information that is compiled it as fact pace that is putting its proper context\nComes all the way in and it's distributed across the high plains region so what we're suggesting is let us hear from me let us hear from you Lamar, Colorado let us hear from you uh Kobe Kansas and Amarillo taxes in canyon Texas in Tampa Texas and I'm In Oklahoma\nFor me to let us hear from you Lamar, Colorado let's hear from you a Colby, Kansas and Amarillo taxes and canyon Texas in Tampa Texas Gaiman Oklahoma and liberal Kansas Garden City Kansas why not dodge city Kansas\nPlease pick up the phone let us hear from you or as Dale said if you if you want to or if you want to hear thank you on the air for a contribution that is perfectly fine if you prefer to to just say that your your calling in from one of those cities that you've checked the box and raise your hand and said I'm going to join with my neighbors\nTo support this service that's great to\nThe way to do it is to call one eight hundred six seven eight seven four four four and by the way just in case you started scrambling for the pencils\nAnd ... and you're not quite ready I'm going to say at one more time one eight hundred six seven eight\nSeven four four four call in with your pledges support when you do there will be a very friendly voice on the other end of\nThe line it won't take much time and ah and then you could be on the rest of your day knowing you've done a good deed\nSo uh I don't just go to say\nWe don't own a great story coming up the hidden brain or as I said but sometimes you hear it's also a regular show that you can hear once a week or it's coming up a on a H. P. P. R. and MORNING EDITION you make it possible when you make a pledge to support a eight hundred six seven eight seven four four four\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's work in food health power jobs and resilient cities at rock found dot org\nAnd from F Jaycee a foundation of donor advised funds working to maximize the impact of charitable giving and to create customized philanthropic solutions learn more it s J. C. dot org\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep this story starts with a quiz here's your quiz master Noel King\nIt comes from political scientist John hinting at the University of Nebraska he's going to describe two towns and you have to guess which one is liberal and which is conservative here ten number one\nThe schools with stress you know patriotism and respect and it would be a very rural is based on educational system the how this would be fairly similar the lawns would be a very nicely kept in a beautifully green and mode or the town of be quiet with lots of churches\nAll right and here it's ten number two\nThe schools would be based more on experience all kinds of things rather than than rote memory people would prefer older houses with wooden floors or rather than wall to wall carpeting um they would keep the yards natural um lots of bars and community theaters and foreign films are more of those than churches\nThis quiz what's probably pretty easy for you and to explain why we're joined now by NPR's social science correspondent Shankar Vedantam Hi center I Know so the first time I'm guessing which conservative and the second one with liberal right\nNot hitting is drawing on fairly traditional stereotypes about liberals and conservatives\nConservatives prefer order and rules liberals prefer exponential schools and community theater now those are stereotypes which means that they're going to be liberals who hate community theaters and conservatives who despised churches but the question that hitting and others are asking is\nHow companies stereotypes are so often accurate\nIf being liberal and conservative is all about our political views how come these labels describe all kinds of other things about us from the kinds of food we prefer to eat to the kinds of poetry we left to wear\nThere was all about our political views how companies labels describe all kinds of other things about us from the kinds of food we prefer to eat to the kinds of poetry we left\nTo where we want to hang out so he is arguing that our political view spring from something deeper than just our beliefs about big government or small government\nPrecisely he's arguing that political preferences at least in part\nCome from a psychological and biological predisposition\nThe most compelling evidence for this comes from studies involved in large numbers of twins some of whom identical and some of whom are fraternal\nIdentical twins share the same genes fraternal twins share fewer genes identical twins to not to have more political preferences in common than fraternal twins do even though each twin ... presumably share the same family and upbringing\nHeight for example turns out to be about eighty percent a heritable when you subject to the same kind of design personality traits are about fifty six percent political views thirty to forty percent\nThirty to forty percent so he's saying some part of our political beliefs come from biology\nYes and of course that conclusion upset a lot of people\nAnd they tended to over interpret those results and make it sound like we were saying that everything was was genetic but you know if it's thirty four percent genetic that obviously it's you know fifty sixty Seventy percent comes from the environment so all we're saying is that that genetic component is not zero but apparently that was enough that that some people were upset about that\nWhat he and his colleagues are saying is that biology and psychology play a role in our political preferences Noel liberals and conservatives in the United states often accused one another or stupidity or malice but it's hitting on his colleagues I write one reason we might not see the world the same way is because we simply not lie at\nThe same way that is a nice way of looking at it indeed it offers some compassion for the other side of it and that means hosted the hidden brain podcast where you can learn more about how psychology Shapes Our political views thanks center [noise]\nSupport for hidden brain coming from them consume\nAnd the brother brother high plains wanting after winning edition only on listener supported high plains public radio [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support tablet H. P. P. R. dot org for details who\nMorning secretary of state Mike Pompeo hail me to the leaders suspected of having a journalist Kelly the chief diplomat in meetings Saudi Arabia is and how It's MORNING EDITION from NPR News [noise]\nComing up how the reaction to the mall to shield genes did the parents threatened Saudi I'm Rachel Martin\nAnd I'm Steve Inskeep drug makers faces demands disclose more information the Trump Administration wants them to put the list prices of their drugs in Athens and\nAlso what happened with France received three months of brain into our we have a story of protest during the national anthem to Olympic athletes who lost their medals for\nRaising their fist fifty years ago and I\nIt's Tuesday October sixteen the singer John mayors forty one years old and the new says next\nLine from NPR News in Washington on corporate Coleman the official death toll from last week's hurricane Michael is Seventeen people but as NPR's Quil Lawrence reports the number of missing is believed to be much higher\nHundreds of people who said they were going to ride out the storm may have actually fled inland as the warnings suddenly got worse last week and since then cell phone service and access the Internet has been so bad that family members haven't been able to reconnect if you do have a signal calling someone within the storm's path sounds like\nThis\nThat particular busy signal was from the police department and the town of Mexico beach a place you might normally ask about whether someone has been reported missing were found not to have survived\nAnd cell phone towers or repaired and electricity is restored the number of people reported missing and feared dead is expected to rise Quil Lawrence NPR News Miramar Beach Florida\nTurkish in Saudi investigators searched that Saudi Arabian consulate in Istanbul Monday Night collecting samples for examination NPR's Peter Kenyon reports pressure is growing for an explanation of the disappeared\nMonday Night collecting samples for examination NPR's Peter Kenyon reports pressure is growing for an explanation of the disappearance of journalists to enter the consulate on October second\nNearly two weeks after journalists and government critic Jim ... G disappeared after entering the consulate Turkish investigators searched the premises along with Saudi investigators\nThe journalists family issued a statement calling for an independent international investigation President Trump's mention of rogue killers possibly being involved prompted analysts to wonder if an effort is under way to insulate Saudi crown prince Mohammed bin Salman from the controversy\nMultiple US News outlets report the Saudis are considering a new explanation that can show ... died accidentally well being questioned Turkish investigators have said they have evidence he was murdered Peter Kenyon NPR News Istanbul\nMeanwhile secretary of state Mike Pompeo is in Riyadh Saudi Arabia and has meant that Saudi king about ... case the Saudi king has insisted he has no knowledge of the journalists faint\nA federal judge dismissed the lawsuit against President Trump by adult film actress Stormy Daniels and NPR's Jessica Taylor report Daniel claimed the president at the famed her earlier this year on Twitter\n... suited for its week Trump sent in April ... with lying about being threatened in twenty eleven not to go public with their story of an alleged sexual encounter with Trump which the president had denied but in his ruling the federal judge wrote that the tweet constitutes rhetorical hyperbole normally associated with politics in public discourse in the U.S that is protected by the first amendment\nNPR's Jessica tailor the judge is ordering Daniels to pay the president's attorney beans the co founder of Microsoft Paul Allen has died his company Vulcan Inc says he died Monday in Seattle of non Hodgkin's lymphoma he would sixty five\nAlan was also a ... tech investor and owner of several sports teams such as the Seattle Seahawks and Portland TrailBlazers\nYou're listening to NPR News\n[noise] MORNING EDITION is supported in part by chamber music Amarillo presenting the gym Laughlin quartet for the jazz on six series friday October twenty six eight PM at the Fibonacci more information at C. M. A. M. A. dot org\nAnd good morning thank you for listening to high plains a more a public radio you were listening to MORNING EDITION is about ah almost five minutes after the hour on a chilly Tuesday Morning and oh\nYou know a everybody we hear from is getting their Tuesday started right you have a [noise]\nYou've probably already done a little hustle and bustle and getting the kids to school and making that coffee and having a a you know there's a busy time everybody has a little bit of a busy time in the mornings and this may be this is the time when you finally get a chance to sit down and have that second cup of coffee and a\nExhale a little bit you've got a you've got the radio tuned in the high plains a public radio you're listening to MORNING EDITION because you want to catch up on all the news of the world may I suggest that as you're enjoying all this goodness all that good and it's\nTo consider calling one eight hundred six seven eight seven four four four to pledge your support for public supported radio on the high plains\nHundred six seven eight Seventy four forty four is the number to call to make your pledge to support this morning you know if we were a TV news magazine if we were the today show\nOr if we were whatever CBS whatever uh eight o'clock hour would be the hour where we just back off from a real hard news and kind of you know have a little more\nWhatever a V. eight o'clock hour would be the hour where we just back off from a real hard news and kind of\nYou know have a little more human the human interest street type stuff like we could have a segment on mutual group you know the the haircut the haircut club you know we all go to the barber shop together\nGreat stories would come only from high plains public radio I'm being facetious but ah the idea is as you said it's a it's an hour we're now we can maybe it's a pleasure in the mountain time zone then you're still on it but the it's our where we can take a breath and enjoy\nMORNING EDITION stay with us we've got some great things happening including a new member challenge new members get every\nDollar they pledge match dollar for dollar if you could make a pledge of or when you make a pledge over ten dollars a month to public radio or to counters come your way and we've talked about the counters will talk some more about them\nTo callers would come your way and another hundred and twenty dollars would come to weigh a public radio so your ten dollars a month to public radio becomes two hundred and forty dollars new members are only the only ones that are eligible for this if you've never been a member of public radio before\nYou find MORNING EDITION an important part of your morning then call right now eight hundred six seven eight seven four for for this a challenge will end at nine o'clock this morning at that point I won't be available to you so why not take advantage of it now by calling eight hundred six seven eight Seventy four forty four\nOr you can go on line at age ... P. R. dot org those pledges get matched a dollar for dollar as well for new members\nEight hundred six seven eight Seventy four forty four six seven eight seven four four four on line H. P. P. R. dot org It's MORNING EDITION from NPR News\nI'm Steve Inskeep and I'm Rachel Martin when journalist ... went missing two weeks ago Saudi Arabia said it knew nothing about it even though 'cause she'll gee was last seen walking into the Saudi constantly in Turkey Turkish officials are accusing Saudi Arabia of murdering the journalist who was a vocal critic of the Saudi regime\nNow there are several reports suggesting that Saudi Arabia's leaders may have known more than they let on meanwhile President Trump did that secretary of state Mike Pompeo to Riyadh where he is meeting today with king selmont and with crown prince Mohammed bin Salman\nNPR's Michele Kelemen is on that trip traveling with the secretary and joins us now from Riyadh Michelle can you just start by explaining what the Saudis believe happened to them all to show you what are they saying\nWell you know officially they haven't said anything different when what they've said all along you're hearing sources privately I'm floating some other ideas that he was um\nA interrogated and it was interrogation gone wrong there are lots of different versions of events out there um but what the U.S officials who are traveling with ... are saying is look we haven't heard that from a them directly we're waiting for these meetings we want to hear what they say face to face and that's what I'm\nSecretary pomp elite doing here they've been very tight lipped about what they think about that changing storyline that seems to be happening from from this outage\nYeah you're referencing all the media reports we saw in the last twenty four hour it's ingesting that Saudi\nArabian officials were about to release a report saying that uh it was actually an interrogation gone wrong as you point out Saudi Arabia has yet to confirm or release any such report\nFor this Tuesday in October or if this is something in because this was something that you value a a companion to spend your mornings being informed about the state of the world what matters to you and the state of the high plains region the country's world everything else\nThan we would suggest that you make a call this morning to one eight hundred six seven eight seven four four four perhaps the busiest part of your morning has already been passed we have ah we've got the breakfast made we got the kids to school we got in\nA we've gotten in the car and we've had to drive wherever we had to drive an hour at a point where we can use or take a breath have that second or third or maybe shall I say fourth cup of coffee\nAnd just take a breath and a while we're taking that breath of fresh consider what high plains public radio means to you and what it delivers to you and when you do that you want to call one eight hundred six seven eight seven four four four\nUs the ... the need is great your public radio station or can't function without the support of listening remembers every listening remember who steps up\nNeed is great your public radio station or can't function without the support of listening remembers every listener remember who steps up a mix of pleasure support or does a little bit of a to make a better program to make it a better public radio station\nWe're asking you for a to make a call at eight hundred six seven eight seven four for for your public radio station is only one polar right now it's sixty dollars one caller ... us before ... eight hundred six seven eight seven four four four be the next caller\nSupport for NPR comes from the station and from PBS with a eugenics crusade American Experience explores the history of the early twentieth century campaign to breed a better American race the eugenics crusade tonight at nine eastern on PBS\nFrom western hotels and resorts western is committed to the wellbeing of travelers with offerings like heavenly beds a super foods are ex menu and gear lending for one workout years left behind at home Weston let Dr learn more western dot com\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at ... dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin flooding in the south of France has killed at least eleven people heavy rain transformed rivers into raging torrent wiped out roads and bridges even swept people from their houses in the middle of the night Here's NPR's Eleanor Beardsley\nFlying in a helicopter over the old river in southeastern France a reporter from the F MTV points out villages Roseanne feels underwater you can see cars and trucks floating like toys in a bass\nDuring the night Sunday to Monday three months of rain fell in only a couple hours catching people off guard when most had already gone to bed and eighty eight year old nun with sweat from our ground floor room when the floodwaters crashed through the convent front door her furniture with carried out onto a veranda\nThe nuns body was later found in the trees outside\nMovie they sound Ninety nine year old ... such a faith because her bedroom is on the second floor she spoke on French television again to do with a ... I wanted to come downstairs but water was coming up the staircase so I just went back to the vet\nSaid and what else could I Do I Need I mean how many how many\n... says never in her life had she'd seen flooding like this the French prime minister visited the devastated villages Monday President Emmanuel Macron heads down today as the waters and fear recede anger is rising\nI mean\nWe weren't given any warning that this group of people meeting with a local\nMayor you couldn't have maybe given us a heads up at two AM that we needed to evacuate\nBouts of heavy rain in areas of higher elevations surrounding the Mediterranean Sea or regular fall phenomenon the downpours are caused by hot moist air pushed up from the Mediterranean and meeting colder air from the north\nBut the frequency and intensity of these rain did increasing Eric ... the mayor of tab which lost six people he says they did everything they could\nSue comes on because I put it on them up from the rainfall was three times what was protected and he says and the sudden violence of these waters with I'm terrified we're dealing with extreme situations brought on by climate change says ...\nAnd no one can be sufficiently prepared Eleanor Beardsley\nWe are dealing with it on your dream situations brought on by climate change says ... and no one can be sufficiently prepared Eleanor Beardsley NPR News Paris\n\nToday's oil and gas report brought to you by love a law firm of Amarillo representing land and mineral owners across the high plains licensed in Texas Oklahoma New Mexico and Colorado level ... dot net\nKudo buyers took tentative steps back into the marketplace on Monday Philips lead the way of the divorce and sixty seven muddy half a dollar a friend so you're a a sixty two sixty seven Seventy five the closer for literal up fifty cents Thirteen set Ron it's in the\nHenry Hope natural gas November quote stopping at three twenty eight\n... Tuesday Morning oil and gas report on the tree PR this is Wayne Hughes\nIt's gonna be sunny almost everywhere on the high plains today with the exception of the Texas Panhandle region highs are going to be in the mid fifties to lower sixties tonight it'll be anywhere from clear to mostly cloudy depending on location and lows will be in the thirties\nIn North west Kansas northeast Colorado it's going to be sunny with a high near sixty tonight clear with a low around thirty two\nIn North central Kansas it'll be sunny with a high near sixty tonight clear with a low around thirty two in southeast Colorado sunny with a high near sixty tonight mostly clear with a low around thirty two\nIn southwest Kansas it'll be sunny with a high near fifty eight tonight clear with a low around thirty five\nIn the Oklahoma Panhandle sunny with a high near fifty nine tonight partly cloudy low around thirty eight and the Texas Panhandle mostly cloudy with a high near fifty three tonight the clouds are going to stick around we'll see yellow around thirty eight\nAnd regional news can bring to want to vote and the general election need to register by midnight on Tuesday for the Kansas news service Celia European jets and reports from to peak at\nTheir separate ways to register you'll find one online option\nThe Kansas secretary of state's website Cass SOS dot org you can also register in person at your county election office pose will open on November sixth from seven AM to seven PM\nWant to avoid the lines you can vote early and person a county election offices the times and dates depend on where you live county by county details alright Cass SOS dot org\nYou can also ask you a local election office to send you a ballot by mail you need to do that by October thirtieth\nFor the Kansas news service until the up his stepson in Topeka\nKansas news service or the collaboration covering health education and politics across Kansas for high plains public radio any anti have light\nAnd I'm ... I'm here with a Bob Davis we're talking about your membership and high plains public radio making public radio happen the number to call is eight hundred six seven eight seven four four four and we just had a world with into her\nWe got to listen to a flooding in France and reaction to the flooding in France as only the French can do it I Love is the part about that there's water there why don't I think I'll just go back to bed [laughter] I Love that part\nThey are they they'll deal with it uh but it's good to know what's going on in the world and it's good to know what's happening right here at home we heard a weather report we heard a story about voter registration we heard is oil and gas report all those things\nJust bring home the idea that you are in touch with the world at home on the high plains where\nAs oil and gas report all those things just bring home the idea that you're in touch with the world at home on the high plains when you listen to the high plains public radio\nBut number to call to support that to make that happen to be the person\nThat ... that that transition person that that upper level person the guy who takes a step up from a listener to a listener remember you can be that guy you can be that person that woman who makes you a pledge of support right now\nAt eight hundred six seven eight seven four four four\nAs I said before the need is great\nThe we talk about the\nCost of doing something like a public radio station that spans a whole large rural area or the cost is great um\nI don't know if you realize this Bob but if we were in Atlanta let's assume we're in ... Atlanta right now right okay okay ah Atlanta they have one they have a public radio station or it has one transmitter and it covers four million people write one transmitter four million people\nAlright so all you have to do is concentrate your efforts on one in one region one area and ah and you got four million potential audience to listen to it we cover\nHad called for a transition of the Saudi economy away from oil and toward a more diverse market based model and the crown prince invited the companies to participate\nJacob Kirkegaard of the Peterson Institute for international economics says the ... G A fair is undermining the crown princes vision\nNamely that the world's most advanced than competitive companies come and establish themselves in Saudi Arabia\nThat scenario is fading as the CEOs of large us and global companies one after another announced they will not attend the second vision twenty thirty conference scheduled for next week Jamie diamonds C. E. O. J. P. Morgan Chase has said he won't attend again Jacob Kierkegaard\nI think the fact that as CEO as prominent as you know J. P. Morgan Jamie diamond not going to the summit and saying so publicly and linking it to the show the disappearance means that many other CEOs will probably pull out to\nOther prominent Wall Street's CEOs Larry fink of black rock and Steve Schwartzman of the Blackstone group also say they won't be attending\nAccording to the New York times the trio of CEOs tried but failed to get the Saudis to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven Mnuchin to stay home\nThe ... the allegations along with previous behavior of the crown prince are making companies nervous says Kirkegaard\nHe said remember that back in twenty Seventeen the crown prince rounded up four hundred Saudi princes and businesspeople detained them at the Ritz Carlton in Riyadh on corruption charges and force them to pay the government as much as a hundred billion dollars\nI mean he basically sending the signal that the rule of law in Saudi Arabia is amiss when you're trying to lure foreign investors into your country that is about the worst signal you could possibly send them\nBut Karen young a resident scholar at the American Enterprise Institute says U.S companies whose snow but the Saudis will likely pay a price because the Saudis will take it personally\nThat decision on the part of the U.S corporate to walk away from this conference and to in some ways you know turn its back on the Saudi Government as a partner will not be forgotten by the Saudis\nYoung says it could be two decades before the Saudis will re engage with these companies young also says us sanctions against the Saudis could be tricky\nThere's lots of Saudi money and us tech real estate and stock market she says and the Saudis on lots of US government bonds not to mention the country's key role in the oil markets so the Saudis have ways to retaliate\nJohn Ydstie NPR News Washington [noise]\nGood morning thank you for listening to MORNING EDITION on high plains public radio we are coming up toward the end of the hour have maybe about Eighteen minutes Seventeen minutes left and that means you have about Seventeen minutes\nTo take advantage of a new member challenge of the three hundred dollars whenever you call in with your pleasure support the high plains public radio you can see you can see what every dollar amount you pledge doubled if you want it to just give one\nPaul and with your pledge of support to high plains public radio you can see you can see whatever dollar amount you pledge\nDoubled if you wanted to just give a one time fifty dollar gift it would be like you're given a hundred dollars a ticket to the sort of programming that you're listening to right now and MORNING EDITION a concise wonderful little uh a\nPackage of news and information to get your morning started a if you want it to be a sustaining member and get five dollars a month for a twelve months that's sixty dollars it would be like you are seeing your money doubles and you would be giving a hundred and twenty dollars\nThe time to actors now the number to call is one eight hundred six seven eight seven\nFour four four I don't know if I told you this but I have a degree in procrastination I had studied this I have practices for years and years and years of the truth uh procrastination is the clock keeps ticking no matter what you do that clock is going to keep moving forward\nAnd so your your choice you have to make right now is are you going to make a pledge to high plains public radio or you begin to become the next new member of high plains public radio in the next Seventeen minutes or not\nIf you are Seventeen minutes is a will pass by you know that you've done your partner for public radio you know you've helped make this meet this challenge grant three hundred dollars on the line for public radio you'll have done that\nIf you don't Seventeen minutes we'll pass by and you'll be in the same spot you are right now so why not move forward why not step up and become a new member to high plains public radio eight hundred six seven eight Seventy four forty four that's the number to call to make your pledge this morning\nEight hundred six seven eight seven four four four we've got great people standing by the process is simple they'll ask you some basic information your name address phone number how much do you want to pledge is probably the most difficult decision you'll make this morning\nAs far as making a pledge to public radio or any kind of what you want to make if you play just a sixty dollar level or more a all that gets double plus you get a calendar\nGreat things can happen if you just take the time to make a pledge of support at eight hundred six seven eight Seventy four forty four on line the number the online site is H. P. P. R. dot org either way you do it now\nSupport for NPR comes from this station and from Amazon Web services used by millions of customers a W s provide the range of cloud services and functionality from tools to security to compliance more information it build on dot H. W s\nAnd from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price\nT Rowe price invest with confidence\nIt's MORNING EDITION from NPR News good morning I'm Steve Inskeep and I'm Rachel Martin it's been a year since most destructive fire in California history the cubs fire destroyed thousands of homes in northern California\nNow despite the risks some are rebuilding inner very same areas from member station KCUR weedy and NPR's energy and environment team Lauren Sommer reports\nIt was late at night a year ago when polo into what's called into work\n[laughter]\nFire marshal in Santa Rosa and the fire was moving fast ill is exploding at a rate that I Would never imagine would occur\nHours later he drove past his neighborhood you couldn't actually make out individual homes and heritage is looked like an entire wall of fire and then realized right away that my house dawn low and\nActually make out individual homes and heritage is looked like an entire wall of fire and then realized right away that\nMilestone lowenthal have spent the last year picking up the pieces\nAnd a crucial question came up for him and the thousands of others should they rebuilt and California wildfire is a fact of life the tub fire with a repeat of a fire that burned the same area more than fifty years ago but no one thought that was the housing market which too tight\nBut honestly it also added a lot to do with my daughter this is where we were before the fires and looks or want to\nBe after the fire [noise] now the drywall is just about to go up at a new house it appears\nWithout really moving as quickly as you'd like to do but yeah you do know that the un's inside\nAnd knowing what he knows about fire he's making sure this home will be better protected with fire resistant materials\nBetween the roof decide and things of that nature um it was definitely a stuff that I wanted to take\nBut he doesn't have to take that step California building codes require fire resistant materials if you live in a designated wildfires down\nBut loaned those house wasn't technically in that zone before the fire and neither were almost two thousand other housing units and so far they're still not ask Santa Rosa is director of planning David due in about that\nWe don't have a an an extra set of rules or or requirements that we put on people um to to rebuild\nGiven says legally city couldn't change of the building codes overnight and it can't stop people from rebuilding\nWe can go in and take somebody's property and that's not in the role of a city\nPlus the the housing shortage it's even worse now\nWe need to walk and chew gum at the same time we're going to rebuild our communities fashion quickly and efficiently as we possibly can\nBut we also have to build new homes as fast as we can\nHe says the city is trying to entice developers to build downtown but one big project is proposed for the health right where the fire swept through\nSo this is the forty acre parcel or are they wanted to put the two hundred and thirty seven homes the trees all around me are are black and almost all the way to the top and I'm standing there after turning off my recorder a man comes up to me means I'm looking at the time for the development and said\nI definitely wouldn't want to live there [noise] he didn't want me to record that\nIn February the city council debated this project\nTo public carrying around ... village project\nSome members light at the town home to the fire resistant and create much needed housing but one council member Julie combs had doubts\nI just think we need to put more sleeping people in a fire hazard area\nCombs was the only no vote I Know I've heard stories of flooding along the Mississippi and thought why did they keep rebuilding their she says some insurance policies pay people less if they don't rebuild and the same place or they just can't afford to go elsewhere and the city doesn't have a way to bite people out", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Dalhart", "day": "16"}