{"month": "10", "state": "CO", "station": "KRCC", "content": "Dot O. R. G. [noise] here's a quick recap of what's going\nOn in the Ninety One point five K. R. C. C. broadcast area this evening we're looking at a mostly cloudy night with ... and the higher thirties to lower forties tomorrow at thirty percent chance of precipitation possibly highs and the higher fifties to lower sixties\nCurrently and divide it's thirty two and partly cloudy fifty seven and fair for Trinidad Pueblo checking in with fifty five and overcast here in Colorado Springs is forty\nAnd mostly cloudy now the eight PM\nWith fifty five and overcast here in Colorado Springs is forty three and mostly cloudy\nNow the eight PM hours straight up here in Ninety One five again just about time for NPR News after that to all hours of the show where the oldies never get old vintage voltage with me stay tuned for more in the meantime here's some more stuff in groceries and taking your up to the news\n[noise]\nMm\nThis week on all things considered here the latest news judge Kavanaugh gave a forceful vigorous defense what it means\nI Do wonder if the bakery is just pretty sick too many cakes and maybe they're not getting the attention they deserve\nAnd even things that parts of Syria and I got my first paycheck to my screw it I'm going to get a path to listen to all things considered to hear the bigger picture every afternoon from NPR News\nAfternoons at three thirty on Ninety One point five ... ... ... ...\nLive from NPR News in Washington I'm Janine Herb's President Trump is celebrating the confirmation of his Supreme Court nominee Brett Kavanaugh but at a campaign rally for Republican candidates in Topeka, Kansas tonight he told the cheering crowd conservatives can't take things for granted with midterms only weeks away\nIf you allow the wrong way to get into office things could change sacred Jay Jay's\nFast that we're not going to let that happen we can't let\nThe Senate confirmed cabinet fifty two forty eight he was sworn in during a private ceremony tonight meanwhile [noise]\nProtestors gathered on Capitol Hill at the Supreme Court building and in front of the U.S Capitol protesting cabinet Kavanaugh's confirmation among them twenty five year old Matty elaborate who traveled from Scranton, Pennsylvania it's just hard\nIn this country that you love and believe in and have so much for it and told me about it and I feel like that's what I get from\nEveryone kind of an eye and\nProtesters also gathered in the Senate gallery interrupting voting screaming shame shame Turkey's officials are investigating the disappearance of a prominent Saudi journalist ... who's been missing for days the Washington Post reports he was killed in the Saudi consulate in Istanbul\nOf a prominent Saudi journalist ... who's been missing for days the Washington Post reports he was killed in Saudi consulate in Istanbul where he went to file paperwork to marry his fiance who is Turkish Karen ... that's the global opinions editor at the post\nThey said that he left outside of outdoor but I have not provided any evidence or that no cameras no nothing so far that official line is that he left the ...\nThe poster board starters investigators say the murder was planned carried out by a Fifteen member team from Saudi Arabia officials at the Saudi Arabian consulate in is symbol though denying these allegations\n\nBut Francis has going for a thorough study of all Vatican archives regarding former cardinal archbishop of Washington DC theater my character in the air Sylvia Poggioli reports\nThe pro will try to determine how Mitt Carrick advance through church ranks despite allegations known to the Vatican since the year two thousand that he slept with seminarians and young priest\nIn July after an investigation the pope accepted mechanics resignation and ordered him to a life of prayer independence\nIn August in a bombshell letter former Vatican diplomat archbishop cardinal muddy of you know accused Francis and numerous church officials having turned a blind eye to eye ... sexual misconduct for years\nSaturday statement does not address the accusations against Francis but acknowledges that a thorough study may produce evidence of past Vatican actions that would not be consonant with a contemporary approach to such issues Sylvia Poggioli NPR News Rome\nYou're listening to NPR News from Washington\nScreenwriter Audrey Wells has died after a five year battle with cancer she wrote and directed the two thousand three romantic comedy under the Tuscan sun and the screenplay for the new film the heat you give\nThat's an adaptation of a best selling young adult book the story of a black sixteen year old girl who becomes an activist wells also wrote the screenplay for the truth about cats and dogs the kid the live action Georgia the jungle and a dog's purpose wells was fifty eight years old\nFirst lady Melania Trump wardrobe for her trip to Africa has drawn criticism not for being on fashionable but for the messages sent and here's Jenny Gatorade has more\nStanding in front of the great things in Egypt Trump told reporters she wants people to stop talking so much about her quotes and I wish people would focus on what I Do not such a way that concern at ...\nTo stop talking so much about her quotes\nAnd I wish he called on what I Do or not but I let\nThe concern I tell him that Trump or in Kenya and some historians say the had similar to those warned by nineteenth century explores an imperial officials in Africa\nIsn't unmistakable colonial simple it's not the first time Trump has been in the news for an outfit back in June she wore a jacket with the words I don't really care to you printed on the back during a trip to the U.S Mexico border Jenny ... NPR News\nThe food and Drug Administration has banning seven synthetic food flavorings that are used to infuse flavors that are brighter foods and beverages environmental and other groups argue the lab tests on animals found those additives posed cancer risk the FDA says companies who used them have two years to find\nThe different replacement I'm Janine her NPR News\nSupport for NPR comics for NPR's stations other contributors include Carnegie Corporation of New York supporting innovations in education democratic engagement it'd be advancement of international peace and security or information is available online at Carnegie dot org [noise]\n\n\n\nYour initial ... at all I knew who she she just she needs to ... hours worth of two shots you are not sure we know you're\nAlways downright unforgettable from the farmers will decades spouses or can she do a lot of ... shortcomings or if you will\nAnd shutting off with for personal ... song shutting machine Rockford, Illinois cheap trick claiming that they can't take it and they're taking it away on this on a show or a shortcoming version of ... Ninety One point five Jay or she sees\nIt's fun to shower shortcomings voltage Ninety One boy by Jay ours these the the\nSure you know\n\nWill be more\nAm\nBandwagon and I\nMy\nKnow I'm\nCan say\n...\nWas his first set of this clinic shower of shortcomings dish Ninety One point five gay or CC's vintage voltage and Eighteen year old ... within the context of this survey this group can't get enough of it\nOr CC's vintage voltage an Eighteen year old Steve Wynwood within the context of the Spencer Davis group can't get enough of it that one coming from Nineteen sixty six\nDischarge top or from Nineteen eighty one Eric Clapton I Can't stand it proceeded Steve one would meant speaking of Eric and Steve not to mention ginger Baker and Rick rich old within the context of proto super group\nBlind faith an alternate rarely heard Jake from their Nineteen sixty nine debut album can't find my way home and it was Rockford, Illinois cheap trick\nStarting off this initial set of a sonic shower of shortcomings from Nineteen eighty three the lead off track from next position please entitled I Can't take it\nAs produced by Todd ... twenty two minutes past the eight pm hour here at Ninety One five this is ... tea or\nA Monday half of all of us here in Ninety One point five tier cc thank you for your support during our fault membership drier your financial contributions will ensure that maybe one forty five years cc provides accurate news and analysis music and entertainment today tomorrow and the day after we could not do this without your banks\n[noise]\n...\nUm group I'm working and you're listening to Ninety One on ... on gay are moving ...\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise] she she gets a\nThing using that will\nTo bother me Carlin\nWhat is the\nMan who maybe\n\n\nYou should\nSee [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] well\n[noise] ... ... ... ...\nWell\nHere\nAll ... uh\nI'm ...\n...\nI Can't stop going to\nSee\nBottom of a new spin three [noise]\nObvious during the ...\nUh the uh [noise]\n[noise]\n\nIs the\nNews or the\n[noise]\nMean\nThey're not a\nCat stop no\nSuicide\nBombers and live in [noise]\n...\n... loan some uh [noise]\nI can stop a huge\nIssues related to use\nThe\nBy the\nEnd tree service during\nThe the\n\nStay\nIn la la [noise]\nI can\nLa [noise]\n\n[noise]\nYou mix you up a little free a mix you up a little ... when you get bad company and you also get bad company closing out the second set\nFor this first hours edition of a sonic shower of shortcomings vintage voltage Ninety One point five K. R. C. C. can't get enough a top five or for bad company back in Nineteen Seventy four\nSome six years before that Nineteen sixty eight to be exact Wooster Massachusetts says\nOr ... I Can't find the time that one may the number eighties spot\nFor if he is and again that was back in Nineteen sixty eight and some three years before that Nineteen sixty five to be precise\nThe very first single released by the who under their own name who uh before that they were the high numbers they released a single\nCold I'm the face however again this debut single by the who under that moniker I can explain\nWhich I sew a belief strove to do [laughter] that was the u._k. top ten or for them back in Nineteen sixty five as I mentioned before Nineteen sixty seven came the doors from their second album strange days I Can't see your face also in that set\nA song that Ray Charles took to the top of the charts in Nineteen sixty two but it was originally sung\nBy Don Gibson it's composer and Nineteen fifty eight\nAnd he had a top ten or with I Can't stop loving you on the country charts so that very or Nineteen fifty eight and it was the star lights that was a ban that hail from Redding Pennsylvania and they're Nineteen sixty six single I Can't see you and that one starting off the second set\nOf this sonic shower of shortcomings edition of vintage voltage it's forty minutes past eight pm here at Ninety One five is GTE let's take a look at what's going on weather wise\nAnd the Ninety One point five K. R. C. C.\nBroadcast area this evening it's going to be mostly cloudy look for Lowe's and the higher thirties to lower forties\nTomorrow at thirty percent chance of precipitation possibly highs and the higher fifties to lower sixties\nCurrently and divide thirty four and partly cloudy it's fair in Trinidad at fifty nine our very own steel city of ... overcast at fifty five here in Colorado Springs forty four and mostly cloudy\nThanks for listening this is David Draine my I'm Stephen I'm Rachel Martin hey there it's\nBrings forty ... and mostly cloudy\nHey thanks for listening this is David Greene my I'm Stephen I'm Rachel Martin he there is Joshua Johnson hosted one egg\nIt died ... joined me and my co host weekday morning for news and cultural coverage on Ninety One point five years cc\nWhether this is Mike ... Beach Boys by John I'm sure the dominant always been the most of\nThem and to me and like many one point five ... the the\n[noise]\n\nKnow the man to be no news in the [noise]\nTo do\nI think that the government because they are trying to think this is saying that they cause she was\nAgainst Iraq for nine\nThe way she filed may know willing to change ... being\nThe baby we were to\nCan't be alone one minute away from nine pm here at Ninety One five is Gigi reminding you\nYou've got it tuned to southern Colorado's NPR station K. R. C. C.\nK. R. C. C. H. D. Colorado Springs K. U. C. C. ... to\n... K W CCF I'm within park streaming at K. R. C. C. dot O. R. G.\nWas well ... well you [noise] Nineteen Ninety seven ... down ... down with them we had tried to sell my teenage daughters thought they would get money out of it and I'm like now in and buy it and probably about six months ago I was like okay we're down at the simplest thing down\n... [noise] I'm Susan I live in Colorado Springs and I can see the\nOr CBC dot ORG for cargo nation information programming on Ninety One point five kill your cc is supported by also Robert now serving menu items featuring locally sourced ingredients from the Colorado tortilla company and savory spy shop to the polar dory sausage\nRobert now serving menu items featuring locally sourced ingredients from the Colorado tortilla company and savory supply shop to the polar dory sausage company and Schmidt ab aries menu and more sulfur Robert Colorado dot com [noise]\nMay ... may have been made\n\nLarge as they\nLa\nLa ... he\nAnd\n\n[noise]\n[noise] [noise]\nYou know but I\nGuess that's ... ...\nYou are always my blood in the hills oh sure\nI grow much\nShe knew\nWell I\nSee you know they\nWe go\n\n\nDo do do you read\nKnow\nMean\nBike\nAnd\nI\nThey're still Christian nation building when\nSo when ... when\nLive from the door in\nAngeles in Nineteen Seventy one with a song that originally appeared on his Alone Together realm of Nineteen Seventy that's Mr Dave Mason rounding off this first set for the second hours sonic shower of shortcomings edition of vintage voltage\nNinety One point five K. R. C. C. the song that day was singing can't stop worrying can't stop loving speaking of Los Angeles was LA's sunset strip mainstays and coal fades love from their debut album from Nineteen sixty six\nCan't explain and before that it was the English Beat\nWith their cover of a song that Andy Williams almost took to the top of the charts back in Nineteen sixty three and it was the number three spot for the English Beat in the u._k. in Nineteen eighty three with I Can't get used to losing you before that the tribes Nineteen sixty six is I Can't control myself\nJust three spots short of the top forty in Nineteen sixty six Nineteen sixty three it was a top ten or for Skeeter Davis I Can't stay mad at you that one being a jury golf and Carole King composition and the head of that Nielsen his chart top or from Nineteen Seventy one\nCan't live if living is without you that one written by Peter ... and Tom Evans of bad fingers speaking of bad finger they started off this first set for the second hours edition of the show with a song from Nineteen seventies no dice album called I Can't take it as produced by\nJeff ... who sadly and recently passed and Jeff was of course probably better known as an engineer in particular an engineer of the Beatles' recordings [noise]\nTwenty two minutes past nine pm here at Ninety One five this is GT my name is ... president\nIn engineer up the Beatles recordings twenty two minutes past nine PM your Ninety One fine this is Gigi\nMy name is Benjamin Sharma presented in order a monument occupational medicine and money was Colorado targeted audience are owners accompany each are professionals safety managers\nAnd injured workers in the medical care that they need to get back to work with ... help is quite a bit and we are able to look team a lot of access to individual we normally wouldn't have access to other means of advertising\nYou would like to become an underwriter like me\nWho's called Jeanette seven one nine four seven three ... hey everybody this\nIs ruby foster this is Chris hello this is Michael from spread within the Ninety One point five king or the the music seven pm to midnight seven nights a week\n[noise]\n\n[noise]\n\n\n[noise]\n\nThat um\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\nAll the\nWe don't\nSay no\n\nSee now I live\nBy a man that\nRead\nSee now\nI\nGo look when you're young and while I'm a\nA man in the\nLiving in\nThe ... and [noise] you know\nAnd and when I looked at my dog\nIs going on with a shrine and\nWas I mean\nThe\nLeading edge I\nLove the\nThat um [noise]\nNow and and now I'm\n\nAnd out and buy a\nWidow and a gun and oh man I go\nBack and talk to you know I can\nDo\nAnd [noise] you know what\n\n\n\n\n\n\nFrom their debut album from Nineteen sixty eight with Alice Cooper in the lead vocalist spot that was originally her I should say eventually taken over by David Clayton Thomas\nThat's blood sweat and tears here on this sonic shower of shortcomings Ninety One point five K. R. C. C. vintage voltage edition and I can't quit are\nAlso in that set from their debut album from Nineteen sixty six\nBuffalo Springfield with Neil Young composition is sung by Ritchie puree and Steven Stills nowadays Clancy can't even sing and before that Elvis Presley his church chopper from Nineteen sixty one\nCan't help falling in love that one coming from Jay Leno's favorite Elvis flick\nBlue Hawaii and he had oh\nSo many to choose from Tibet Gino ginger Gen who is by the way in the house tonight you're going to be hearing him in the ... ah twenty minutes or so\nThat said also was ... with the recovery of the Rolling Stones church hopper from Nineteen sixty five I Can't get no satisfaction DeVos almost made the top forty in the u._k. and Nineteen Seventy seven some ten years before that Nineteen sixty seven to be more precise\nThe ... and a song from their very first stateside lp I Can't see nobody and also from Nineteen sixty seven and starting off the second set for the second hours edition of the show from their debut album a whole new thing it was sly and the family stone\nSeven and starting off the second set for the second hours edition of the show from their debut album a whole new thing it was sly and the family stone I cannot make it\nComing up on forty four minutes past the nine pm hour here at Ninety One fine this is G T we're taking a look at what's going on weather wise in the Ninety One point five K. R. C. C. broadcast area this evening it's going to be mostly cloudy\nA possibility of losing the higher thirties to lower forties tomorrow was thirty percent chance of precipitation with eyes Meyer fifties to lower sixties\nCurrently and divided thirty two and partly cloudy it's fifty one and fair in Trinidad Pueblo checking in overcast at fifty here in Colorado Springs mostly cloudy and forty five\nSouthern Colorado is NPR's mission Ninety One point five to your seat you can be with you wherever you go all you needed your smartphone download the free Ninety One point five to your cc mobile out Google Play or the I tuned app store\nMemberships or the largest source of funding it Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News music thanks for your generous support welcome\nTo your last set of this vintage voltage sonic shower of shortcomings it's usually time for a vintage voltage culture vulture Bexar\nBut tonight we're for going the usual format leaving us just that much more time for a surplus of a sonic shower of shortcomings\nLike this Nineteen Seventy four top ten or for the electric light orchestra entitled I Can't get it out of my head and neither can you as we start off this evening's last set a vintage voltage Ninety One point five K. R. C. C. [noise]\nUm\nI oh yeah oh yeah there's no no\n\nDo what the la\nLa", "year": "2018", "show_name": "Vintage Voltage", "city": "Colorado Springs", "day": "07"}