{"month": "10", "state": "CO", "station": "KRCC", "content": "A month on ...\nOwning your high school\nOwn my\nOwning your body\nGoing around owning your\nOn your hot in\nMy\nMind was out on\nThat stuff in gross but here on Ninety One point five K. R. cc's blue plate special closing out this last set of the special just for this evening's edition of the show with the death come ... before that Buddy Guy was stone crazy\nRight in the middle of that set the legendary John Lee hooker don't turn me from your door and the head of that cocoa Taylor uh-huh bye baby started off this last said again just this evening's edition of the show with something new from Z. Z. top point man Billy given my baby she rocks\nCreeping readily right on up into that eight pm hour here in Ninety One five so it's just about time for NPR News after that to all hours of the show where the oldies never get old vintage voltage with me GT keep attuned to Ninety One point\nFive as well as well you [noise] Nineteen Ninety seven ... absolutely no doubt in my son [noise] we had tried to sell it my teenage daughter stop getting money out of it and and now now it's going to buy it and probably about six months ago I had to take a candy or down at the simplest thing I've done\nAnd I'm I live in Colorado Springs and I have a ... [noise]\nK. R. C. C. dot O. R. G. for car donation informational\nProgramming on Ninety One point five K. R. C. C. is supported\nBy a lot ... gallery on the upper level of chapel Hill's mall from Persian to log cabin in contemporary Latin has hundreds of roads on display to help ease the search for that rug that matches or homes decor a ... rug dot com\nI was one [noise] I'm I live in Colorado Springs and I was ...\nTo your daughter word je ... informational\nProgramming on Ninety One point five ... or she she is supported ... upper level of chapel Hill's mall from Persian to log cabin in from temporary allowed into hundreds of roads on display to help ease the search for the rug that matches or homes record a ... rug Dr\nLive from NPR News in Culver City California I'm Janine hurts the cleanup from hurricane Michael continues across several states at least fourteen people have died but rescuers haven't reached some of the hardest hit areas yet NPR's Quil Lawrence is in Mexico Beach Florida\nPublic opted are buzzing overhead and you can hear chirping of fire alarms inside homes or their running on battery power here for several days [noise] from how did you see are standing three four stories high and right\nNext to them [noise] cinder block [noise]\nSort of outline where they're used to\nRescue squad they're starting a more extensive search of houses now that they were just giving a quick three hours to before and there are fears that the death toll could rise Quil Lawrence NPR News Mexico Beach Florida\nHundreds of thousands are without power authorities say that could last for weeks\nPresident Trump says he plans to call ... over the next twenty four hours to discuss the disappearance unlikely debt a Washington Post journalist ... he was last seen at the consulate in Istanbul and as NPR's Tamara Keith reports that's complicating the U.S Saudi relationship\nTalking to reporters at the White House President Trump acknowledged that it doesn't look good for the show ... who disappeared nearly two weeks ago Trump says his administration is still gathering information and that's why he hasn't yet called the Saudi king to discuss it\nWe don't know nobody knows right now the answer we're looking for the\nTurkish authorities say they have audio and video evidence that show the which tortured and murdered Trump says if ... has been killed and Saudi Arabia is proven responsible then there will be severe punishment\nAsk what that punishment should be Trump said there are many options but he doesn't want to stop sales of military equipment to the kingdom camera Keyes NPR News\nInformation and that's why he hasn't yet called the Saudi king to discuss it\nWe don't know nobody knows rise out of this or we're looking for the\nTurkish authorities say they have audio and video evidence that could show the was tortured and murdered Trump says if ... has been killed and Saudi Arabia is proven responsible then there will be severe punishment\nAsk what that punishment should be Trump said there are many options but he doesn't want to stop sales of military equipment to the kingdom camera Keyes NPR News\nThis book has released more details on a recent security breach that exposed the personal details of millions of users and fears Camila Domonoske reports\nIn the last two weeks of September attackers exploited three bugs and Facebook's code to gain access to users accounts they didn't get any passwords but they didn't have to they were able to act just like they were logged in\nFacebook now says thirty million people had their accounts access about half had their name and email or phone number taken\nBut for fourteen million the attackers viewed more including their gender religion birthday recent location check ins and search history [noise] four hundred thousand people had their post their groups and lists of friends access to\nFacebook wouldn't discuss it who carried out the attack or why citing an active FBI investigation\nCamille dominant ... NPR News\nAnd the company has set up a website so people can check and see if their account was attacked this is NPR News\nThe slain controversial arch bishop ... south or will become a saint tomorrow when Pope Francis canonize seven figures of the Catholic Church and then here's Gary Cohn reports thousands of Salvadorans have traveled to Rome for the ceremony including the man who says the archbishop performed a miracle and saved his wife's life I\nKnow how to read that says if it wasn't for archbishop Oscar Romero his wife would have died three years ago she fell into a coma while pregnant with their third child doctors told reverse at the time to pray for a miracle\n... or the lower than that they are to sell us you indoors or do you go lower than the simplest article but on\nSame hour I prayed to Romero was the same hour she started to recuperate says reversing a call from Rome read his his wife made a full recovery and he and their three children are all attending the cannon is Asian as guests of the church\nRomero was murdered while giving mass in San Salvador Nineteen eighty he was an outspoken critic of the repression by the country's us backed army and defend\nShe fell into a coma while pregnant with their third child doctors told reverse at the time to pray for a miracle\nOn whether the lower than that you're ... you're going to order and the sympathetic but at\nThe same hour I prayed to Romero was the same hour she started to recuperate says read us a call from Rome revisit his wife made a full recovery and he and their three children are all attending the cannon is Asian as guests of the church\nRomero was murdered while giving mass in San Salvador Nineteen eighty he was an outspoken critic of the repression by the country's us backed army and defender of the poor Francis diverse Latin American pope personally push through Romero sainthood Carrie Kahn NPR News\nPresident Trump campaigning in Richmond, Kentucky tonight for Republican candidates in that state the crowd that every voter faces a choice once again saying the Democrats are the party of crime all the Republicans are the party of safety dropped his campaigning for three term congressman Andy Barr who's fighting off a strong challenge from Democrat Amy ...\nA retired Marine fighter pilot\nIt's the latest campaign rally trough it's held around the country ahead of the mid term elections that happen next month\nI'm Janine hurts and you're listening to NPR News from Culver City California\nSupport for NPR comes from NPR stations other contributors include the Walton family foundation where opportunity takes root more information is available at Walton family foundation dot org and the ... and capturing the MacArthur Foundation at max bound dot org\nYou've got to June to southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... to ... K W CCF andme woodland park streaming K. R. C. C. duck or gee\n\nWe'll get another edition of showing live on maturity ... she she she needs to gender songs from the past five years or decades deals with these of if you will and I took all made\nAnd ...\nYet another edition of the show where they live on a useful purpose Judy vintage voltage\nI'm your host Jean she and she needs to gender pop songs from the past five or so decades deals with the duties of if you will and I do tickle nature\nAnd look no further for further explanation\nThen this first selection of what's bought our first of success so sad if slightly perplexing subject\nWith the first song from the first album by the new writers of the purple sage it's Nineteen Seventy one I don't know you do know that you've got to ... voltage I Do scolded ease Ninety One point five K. R. C. C. [noise]\nI don't know ... ...\nWhere you came in\nOf the\n\n\n\n\n\nClaiming that they don't live today from there the realm of the troops east of and argue experience that's the Jimi Hendrix experience\nOn Ninety One point but K or CC's I don't go duties edition of vintage voltage\nBefore Jimmy and the experience it was Elvis Scotty and bill AKA\nElvis Presley Scotty ... and bill black with the very first single but Elvis ever placed on the church back in Nineteen fifty four I don't hear the sun don't shine and he made the numbers Seventy four spot with that want to get back in Nineteen fifty or right in the middle of bats that\nTommy hurt with the original version of the off recorded back correct David composition\nPCs I don't go duties edition of vintage voltage\nBefore Jimmy and the experience it was Elvis Scotty and bill AKA\nElvis Presley Scotty more and build black with the very first single that Elvis ever placed on the charts back in Nineteen fifty four I don't care if the sun don't shine and he made the numbers Seventy four spot with that one again back in Nineteen fifty four right in the middle of that set\nTommy Hunt with the original version of the off the record in ... David composition\nI just don't know what to do with myself that one coming from Nineteen sixty two\nSome five years after that Nineteen sixty seven to be precise it was the monkeys with I don't think you know me with the rarely heard twin lead vocal from Mike ... Smith and ... with a song that was eventually to have a lead vocal from Peter torque\nAnd starting off this initial set of this I don't tickled duties edition of vintage voltage\nThe new writers of the purple sage featuring Jerry Garcia on the steel guitar I don't know you that one from Nineteen Seventy one it's Twenty one minutes after the eight pm hour here in Ninety One find this G T\nHem them every Sunday evening just show on Monday when when you\nJoined me for a journey through mainstream above ... vocal was above covered on Sunday evening seven and a new one point but here's the\nEither this is my little speech flu is this is John from your water the dominant wildly from them upset\nThat each candidate anyone ... the\nProgramming on Ninety One point five K. R. C. C. is supported by realtor marked Ole ... Paso county residents since Nineteen Ninety six combining lifelong knowledge of the community and the real estate market to help advise buyers and sellers more information at mark delay dot com [noise]\nSure ... so county residents since Nineteen Ninety six combining lifelong knowledge of the community and the real estate market to help with bonds buyers and sellers more information that more delayed dot com\nUh\nOh\n\nHa ha\n\n\nWow\nYeah and\n\nYeah yeah\nThen she will talk\nDream to the vet to\nDreaming yeah\nDon't mean\nMan down there and the guy\nThe main thing\n\nAnd you're\nAre\nA\nLot more\nOh\nDay and then\nSure do a\n\nMouse on\n\nYeah and that alone\nCan do a\nHa\nHa ha\n\nMy oh\nFrom Nineteen Seventy five cents land to crunching al ... the mob Stewart Iran Ninety One point five\nK. R. cc's I don't the gold duties edition of vintage voltage and I don't want to talk about it so we sang about it said we were all the better for it originally song and composed by Danny ... know crazy horse song that appeared on their very first album before that\nPeter Gabriel from his third album Nineteen eighties self titled as we're number of the others\nPeter Gabriel I don't remember at the head of that his fellow genesis fellow Phil Collins Nineteen eighty threes I don't care anymore\nMade the top forty four fill in that very year Nineteen Seventy two gay but south Stuart with this cover a Bob Dylan's I don't believe you she acts like we never have met and it was the skyline are setting off the second set\nOf I don't go ... with their top twelve or from Nineteen fifty nine\nI don't have you forty two minutes past eight pm here at Ninety One five is G G we're taking a look at what's going on\nHis fellow genesis fellow Phil Collins Nineteen eighty threes I don't care anymore made the top forty four Phil and that very year Nineteen Seventy two gay but south Stuart\nWith his cover of Bob Dylan's I don't believe you she acts like we never have met and it was the skyline are setting off the second set\nOf I don't ... with their top twelve or from Nineteen fifty nine since I don't have you\nForty two minutes past eight pm here at Ninety One five this is Gigi we're taking a look at what's going on weather wise in the Ninety One point five K. R. C. C. broadcast area\nThis evening it's a fifty percent chance of precipitation lit along the windy side with Lowes limit dire twenties\nTomorrow that goes up to Seventy percent chance of pre sip\nA little windy occasionally with ... in the mid to hire twenties currently and divide got a few clouds at forty it's fifty four in Trinidad and fair also fair in Pueblo at fifty three here in Colorado Springs got a few clouds at fifty\nIf you are looking for something to do in the Ninety One point five care cc listening area [noise] check out the community calendar link care C. C. dot org G and you can submit your event there as well\nHey everybody that this ... this is Krista hello this is Michael from Trump spirit in Ninety One point five K. R. C. the music seven ... seven nights a week\nI don't want to see you again [noise]\nAnd I don't want it to you\nBe a man Mm Mm Mm\nWant this bond is do or do\nTo buy the blind man show\nNa na na while I'm gone been um\nAnd she\nI think Don May go well no\nI Choose a man and [noise]\nAh no\nI beg Don May go well we'll\nDo John I Choose me but\nNa na\nLa la la\nLa la de Maya the blind men do their job so\nJobs and while gum they let me know\nBeing a man to man\nThe man trying to\nMaintain and low\nNye shoes and\nA lab\n... oh\nLady that I Do just broke both of them being young\nBecause I did not\nShe held out don't want to\n... a\nLady that I Know just came from column B a\nWhile because I did not\nBenji held out do not want to\nRounding off this last set for this first hours edition of I don't ... vintage voltage tradition Ninety One point five K. R. C. C. this one with the fab four slant\nIt was indeed George Harrison with the beside of is dark horse single from Nineteen Seventy four I don't care anymore and speaking of the fabric was indeed the ever fab John Lennon with an all star line up on this particular June\nIncluding the apprehension George Harrison arm slide guitar Mike bender of the moody blues on the tambourine and the immortal Keene Curtis on the ...\nI don't want to be a soldier that one from Nineteen Seventy ones imagine now right in the middle of that set sir Richard stark himself AKA Ringo Starr\nWith his top five or from Nineteen Seventy five the ... accident composition known song I don't smoke sniffed snort or drink it no more\nAnd speaking of the fads themself it was indeed them era wasn't them that was ... bad it was the Beatles I don't want to spoil the party from Nineteen sixty four also from Nineteen sixty four and starting off this last set for the first hours edition of the show\nPeter and Gordon the lemon McCartney composition I don't want to see you again that one making the top twenty four Peter and Gordon again back in Nineteen sixty four\nTo nine PM straight up here in Ninety One five this is Gigi reminding you you've got a June to southern Colorado's NPR station\nK. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... stark bill and K W CCF em woodland park streaming at K. R. C. C. dot ORG\nStarting off this last set for the first hours edition of the show Peter and Gordon the lemon McCartney composition I don't want to see you again that one making the top twenty four Peter and Gordon again back in Nineteen sixty four\nNine PM straight up here in Ninety One five this is Gigi remind you got it June to southern Colorado's NPR station\nK. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... start real and K W CCF movement bark streaming get care see see doc orgy\nMore and more people are getting their news on mobile devices and through social media in Ninety One point five K. R. C. C. doesn't have to be any different Mitt this morning and he's got wind that on our website getting out of your car when to keep listening to all things considered download the mobile apps\nMeat into on a local story impacting your community followers on Twitter and feel like passing along that NPR story like us on Facebook and the news never stop and neither do we Ninety One point five K. R. C. Indian\nNPR Ninety One point guard to your cc you supported locally or the Colorado Springs on our general at Colorado College preventing Virgil or cheese revolution rise against the invasion reimagining the sixteen ... five hundred years later on you know Colorado College dot edu swath of the [noise]\n\n\n\n\nDa da da\n\n\nDa da\n\nDa da da\nWell\nC I F ... na na na na\nNa\nNa VE Day I'm a\n... ... ...\n... ... the word got nine or ... ... ... ...\n... yeah they do the right\nState\nAnd the\nPeople who say they are\n\nThose are a ... gallon now mayor man in\nThe the the uh the right\nA in\n...\nYour uh I'm really jazzed has\nAh\nThe night the\nThe head of the barrel a day and men in the\nBe the man I'm All right Bob all the right\nNa na\nBe the man I'm like oh the right\nMe mom\nTell me oh\nYou know a\nA shift I'm\nThe Y. two\nTell me why I say that\nYou say you want to be a\nAnd bad finger proceeded Paul Revere and the raiders\nFrom there are no dice album of Nineteen Seventy I don't mind and speaking of sad and recent departures yet again we want to honor somebody this time the producer of that bad finger cuts fell by the name of Jeff ... who is also the Beatles engineer extraordinary\nAnd starting off this first set of the second hours of identical duties it was Manchester is bussed Cox just about making the top fifty in their native country of England in Nineteen Seventy eight with\nI don't mind is G T and I don't mind telling you the time it's Nineteen Minutes pass the nine pm hour here at Ninety One point five\nThe weight has been along but it won't be long now are you ready to come a time when [noise]\nTerminal actions are about senator and governor is battling for power but the terms aren't just about who wins and who loses or even which candidate said what they're about my you vote there about issues in your community there about you listen to all things considered and hear the bigger picture every afternoon\nFrom NPR News afternoons at three thirty Ninety One point five to your cc memberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your general support\nProgramming on Ninety One point five K. R. C. C. is supported by Kaiser Permanente were members can see a doctor get a lab tests and pick up meds and one connected system dedicated to delivering healthy outcomes and consistent care more KP dot org Kaiser Permanente thrive [noise]\nDelivering lp outcomes and consistent care more deeply dot org Kaiser Permanente right\n[noise]\nIn\n\nA independent people\nBe\nThe Americans\nShore\nAnd nurses and doctors\n\nAround na na na na na na\nNa na na the drama but in the same\nFor them to bring some sounds bad\nThat just makes no God no\nNo no no I ... know\nAnd ah and I don't know why na\nNa na na na na na na na na\nMay do you do when they're out on my mind is the man we\nDo have you seen the man may\nBeing you know what I was young and\nGuy no no\nAnd\nDon't know why\nNa na na na na na na na na\nI'm no no\nAnd but ah but oh\n\nIn na na na na na na na\nNa na na na ve written\nAbout it but\nWere done has learned to read and\nBang bang God there are\n\nNa na na na na\nNa na\nNa na na\nNa na na\nNa na na\nNa na na na na na\nNa young man named\nJohn\nJohn\nYoung and you know I\nI don't know why and na\nNa na na na\n\n\nAbout the\n... ... ... and\nWho wants to do a lot of fun\nLand my knees\nA madhouse IOM poppy or Nineteen sixty six that's Denver's very own moon breakers here on Ninety One point five K. or CC's I don't ... edition of vintage voltage and I don't believe\nThat it was Stevie Wonder his top forty year from Nineteen sixty eight don't know why I Love you also in that set from their mega selling rumors or Nineteen Seventy seven\nFleetwood Mac I don't want to know before that live from the aisle of white Nineteen Seventy though I don't even know myself\nAnd before that are rarely heard beside from them wild things the drugs and I don't know why and starting off the second set for the second hours edition of identical duties\nObscure even by vintage voltage standards we love 'em that way some English freak be courtesy of southern sound and Nineteen sixty six is I don't want to go that one by the way notable not only for being a particularly well prime slice of British freak meet\nBut it also featured her fellow by the name of Robby blown to also went on to play with Robert Plant was aside man for Robert and also co wrote a number of his more significant songs [noise]\nForty minutes past nine PM barrier in Ninety One five this G G we're taking a look at what's going on weather wise in the Ninety One point five K. R. C. C. broadcast area this evening it's a fifty percent chance of precipitation little on the windy side lows in the mid to hire twenties\nTomorrow that goes up to us Seventy percent chance of precept again occasionally windy highs and the mid to hire twenties currently and divides thirty five with a few clouds it's fair in Trinidad at fifty fifty four for our very own steel city ... affair down there and here in color\nThis G T we're taking a look at what's going on weather wise in the Ninety One point five K. R. C. C. broadcast area this evening it's a fifty percent chance of precipitation little on the windy side lows in the mid to hire twenties\nTomorrow that goes up to a Seventy percent chance of pre sip again occasionally windy ... in the mid to hire twenties currently and divide thirty five of the few clouds it's fair in Trinidad at fifty\nFifty four for our very own steel city a pub low fare down there and here in Colorado Springs got a few clouds at forty five\nYou're going to want to keep it to him for a vintage voltage culture vulture ...\nNinety One point five K. R. C. C. can be with you wherever you go all you need is your Android device or I download the free Ninety One point five ... mobile at Google Play or the ... or just search for K. R. C. C. [noise]\nAnd\nI Am ... king and you're listening to Ninety One point on K are moving in\nProgramming on Ninety One point five K. R. C. C. is supported by university park care center in Pueblo providing stroke and Parkinson's care Osama's here as well as long and short term rehab committed cultivating a nurturing skilled nursing facility university park care center CEO dot\nCom welcome back to your last set of songs of and I don't go nature it's time for a vintage voltage culture vulture effects or\nIf you want to score the find new bluegrass new grass virtuoso Allison crowd CD it's cold windy city\nWith Allison Kraus doing her versions of a number of country classics correctly answer the trivia question and I'm about to ask can be the first caller to do so at either for seven three for eight zero one or one eight hundred\nSeven for eight to Seventy seven those numbers again for seven three for eight zero one one eight hundred seven for eight to Seventy seven the question to answer tonight\nI'm about to spin a song from the original Nineteen Seventy recording of Jesus Christ superstar some titled I don't know how to love him as rendered by von element what I Want to know is what recording artist took that song to the top Fifteen back in Nineteen Seventy one\nFor seven three for eight zero one one eight hundred seven for eight to Seventy seven what's the name of the recording artist to took the song I don't know how to love him\nOne eight hundred seven for eight to Seventy seven to question to answer tonight\nI'm about to spin a song from the original Nineteen Seventy recording of Jesus Christ superstar subtitled I don't know how to love him as rendered by a bond element what I Want to know was what recording artist took that song to the top Fifteen back\nIn Nineteen Seventy one for seven three for eight zero one one eight hundred seven for eight to Seventy seven what's the name of the recording artist who took the song I don't know how to love him to the number Fifteen spot back in Nineteen Seventy one\nFirst caller correct answer the new Alison crowd CD while you're guessing dialing hopefully win and I'm a spinning Yvonne element as Mary Magdalene and her version of I don't know how to love him on this last set of I don't ... the ditch voltage Ninety One point five K. R. C. C.\n[noise]\n[noise]\nOne\nOf\nThe\n\nDay when\nI\nAnd she was\nAll\nGreen\nUm\nMarines I was\n\n...\n\n\n\n\n\n\n[noise]\n\n[laughter] [laughter] and I\nScreen from\nAh going out to you my\nWomen on friday night the match you\nKnow for a long\nThem in the beginning\nBut I Do know the top five in my see when you really you know\nThey were going to teach me you know for us today we didn't want it back again [laughter] why should I wear a coat\nPaint anything well do you dream job because I Know you're not too long traverse the day [laughter] [noise]\n\n\n\n[laughter] you can\nGo now to talk to them by the way for them for a while [laughter]\n[noise]\n\n\n\nYou know John you\nKnow your", "year": "2018", "show_name": "Vintage Voltage", "city": "Colorado Springs", "day": "14"}