{"month": "10", "state": "CO", "station": "KRCC", "content": "Blue plate special deep water before that something new from the river in ... big damn banned their latest album is called poor until payday the tune we heard so good before that big Joe Williams and I'm tired\nAnd setting off this last set at least this evening's edition of the blue plate special John mail and his blues breakers from his seventieth birthday concert album and grits ain't groceries\nCreeping right on up to that eight pm hour here at Ninety One five so it's just about time for NPR News after that to all hours\nOf the show where the oldies never get old vintage voltage with me Gigi reminding you you've got a tune to southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ...\nK. C. C. ... W CCF em woodland park streaming at K. R. C. C. dot O. R. G.\nW CCF em woodland park streaming at K. R. C. C. dot O. R. G.\nSupport for Ninety One point five K. R. C. C. comes from local organizations who want to reach a well connected audience than discerning about noon and culture\nAnd how they spend their money becoming a corporate sponsor of Ninety One point five care the means your brand one stand out from the ground for more information about underwriting called Jeanette seven one nine four seven three for a\nProgramming on Ninety One point five K. R. C. C. is supported by the gay and lesbian fun for Colorado supporting public policy reporting and promoting programs designed to ensure all Coloradans have the same opportunity\nTo thrive on line a gay and lesbian fund daughter work\nLive from NPR News in Washington I'm Janine her\nBelief in cities around the country are ramping up security at synagogues after at least eleven people were killed six others injured by a gunman at the tree of life synagogue in Pittsburgh this morning forty six year old Robert powers was taken into custody after a gun battle with police Bob Jones as the FBI Director in charge of the investigation\nThis is the most horrific crime scene I've seen in twenty two years with the Federal Bureau of investigation members of the tree of life synagogue conducting a peaceful service and their place of worship\nWere brutally murdered by a gunman targeting them simply because of their faith\nThe suspects full motive is unknown but we believe he was acting alone\nFederal prosecutors charged flowers with twenty nine counts tonight President Trump condemned the shooting\nThat doesn't mean that we can fight hard\nAnd to watch on our mind but we have to always remember those elements we have to remember the elements of love and dignity and respect\nThe attack as being investigated as a hate crime there was a marked escalation and the release of families who are being detained by us immigration authorities near the southern border that says at Texas Public Radio's David Martin Davies reports from San Antonio the immigrants are being dropped off in math that area bus stations [noise]\nThe greyhound bus station in downtown San Antonio sister Denise ... of the interfaith welcome coalition was scrambling to assist the sudden influx of families\nThe detention centers and the holding centers at the border just gets so\nIt's just like releasing the vowels\nA few sudden influx of families\nThe detention centers and the holding centers at the border just gets so\nIt's just like releasing vows\nGo forward with their monitors and all that kind of\nThe newly released families are required to report to immigration authorities when they reached their destinations for rock says she's been told that detained immigrants were being released to make room for a caravan of migrants now in Mexico in a statement the immigration and Customs Enforcement agency said\nHis releasing these families to comply with federal law for NPR News I'm David Martin Davies in San Antonio\nThe man accused of sending explosives to critics of President Trump is scheduled to be in court next week NPR's Greg Myre reports he faces decades in prison if convicted\nCaesar say I lived in his men and like to hang out in two places\nGyms and strip clubs say our age fifty six was arrested friday and has been charged with five federal crimes related to package ... with explosive material inside\nHe's an avid weightlifter and some of his legal troubles have been related to steroids at some body builders huge he's also worked at strip clubs and co workers say he was the DJ at one late Thursday night in West Palm Beach only hours before he was picked up by the FBI\nCIA is being held in Miami and is expected in court on Monday Greg Myre ... NPR News Fort Lauderdale Florida\nYou're listening to NPR News from Washington\nFormer secretary of state General Colin Powell open the eighty two million dollar national veterans museum and memorial in Columbus ohio today\nThe first of its kind museum was the project of the late John Glen the Ohio born military hero astronaut and senator his story and many others are shared throughout the fifty three thousand square foot building\nFor the second time in a week a lottery jak pot has soared so high it's among the top five biggest prizes in lottery history and here's Amy held reports the Powerball has been rolling over since August in part because it's not hard harder to win\nOfficials recently changed the rules for the nation's two biggest lotteries decreasing the odds of winning the jackpot so it rolls over it and getting bigger and gaining buzz more hopeful Phoebe astronomical figure and figure why not\nTonight Powerball jackpot is that seven hundred and fifty million dollars the fourth biggest ever but the odds of matching all five numbers and the Powerball it's one in two hundred and Ninety two million for perspective\nThe fourth biggest ever but the odds of matching all five numbers and the Powerball it's one and two hundred and Ninety two million for perspective the national weather service says the odds of being hit by lightning are wanting Thirteen thousand\nStill lightning does strike\nEarlier this week a winning ticket for the much hyped one and a half a billion dollar mega millions prize was sold in South Carolina but nobody has stepped forward yet to claim it Amy held NPR News the Los Angeles Dodgers are hosting the Boston Red Sox game four of the best of seven World Series\nI last checked there is no score and the bottom of the six the red socks older two games to one lead I'm Janine hurts NPR News in Washington\nSupport for NPR comments from dream and Gerald catcher supporting the children's movements or Florida dedicated to helping all children after school with the social emotional and intellectual skills needed to succeed more information is available at children's movement Florida dot org and Americans for the arts\nAnd\n\nWhat was your last short run over a gene edition of the show where the ... time your host Jean ... and if you're wondering just won't we wind up for this she needs to gender obscured loves to watch a few of the mill you're always\nDownright unforgettable pop from the past five or so decades says well we're going to tell you watch one but we're also going to give you for one and first up on what was his first six such said subject which is a song from Nineteen Seventy eight cold all for the love of rock and roll\nAs rendered by New York city's salary clubs in as in the stores\nThis mission statement if ever there was one giving you one for for sure on ditch voltage Ninety One point five J. R. C. C. [noise]\nKnow\nBut the\nGet\nIt's all over\n\nRent and\nIt was\nNo\n\n\n\n\n\nWith\nTheir version of the buffalo Springfield classic that made for the Springfield but dropped in back in Nineteen sixty seven moving it up to Nineteen Seventy with Los Angeles obscure rose\nFresh air Iran Ninety One point five JR cc's what or edition of the show and for what it's worth ... stop a watch that so and before that from Nineteen Seventy two the rate Thomas composition moody blues and for my lady\nAt the Moody's Ray Price almost making the top ten back in Nineteen Seventy with the Chris christopherson composition for the good times and it was the tough darts setting off this initial what ... did you all for the love of rock and roll\nTwenty one minutes past eight PM your Ninety One ...\nMore and more people are getting their news on mobile devices and through social media in Ninety One point science ... doesn't have to be any different Mitt this morning news can't find it on our website getting out of your car when to keep listening to all things considered download the mobile apps\nMeat into on a local story impacting your community follow us on Twitter feel like passing along that NPR story like us on Facebook and the news never stop neither do we and I knew when we find NPR's Peter Kenyon\nIf your new to the area or just a little\nTake the news never stop neither do we Ninety One toy science ...\nKeep your duty area or just a little forget solid and you'd like to know when your favorite program airs Ninety One point five can't keep the peace at our website you'll find daily and we think program guy much much boy that's our teeth he's got to watch the\nProgramming on Ninety One point five K. R. C. C. is supported by Ninety One point five to your see see underwriters thank you for helping to fund southern Colorado's NPR station Ninety One point five years cc more information on how to underwrite that to your CBC dot org\nBy the Colorado Springs independent newspaper featuring the twenty Eighteen best up edition available October twenty fourth through November sixth newsstands or at sea as indeed dot com oh\n... right now I\nI don't blame you know\nI mean uh\nI don't really know the ... the\n... more than in am by a\nMan named\nLittle bird was saying along in I\n...\nWell\nTo be there when you are you know\nJust some way or the navy\nShadow women\nKnow no I haven't seen as a\nOr even let them know when you're a\nMy name mean\nWere saying you know getting\n... about you know when\nUh no where\n... or ... or\n... or ... time in a\nNew we're in there and now I'm\nI Love the more then and there are there are\nA lover you for them and they are are there\n[noise]\n\n\n\n\n\n\n\nThe top thirty back in Nineteen Seventy one that's the windy city he's shy lights here on Ninety One point five K. or CC's what for edition of vintage voltage and for God's sake you got to give more power to the people\nBefore that it was a band hailing from Holland called the motions Nineteen sixty fives for another man and that ban featured a fellow by the name of Robby bin Laden who went on to form the shocking blue of Venus fame\nAlso in that set Scottish song thrush sheen to Easton or top five or from Nineteen eighty one and the theme from the James Bond flick\nSo in that set Scottish song thrush Sheena eastern or top five or from Nineteen eighty one and the theme from the James Bond flick of the same name\nFor your eyes only before that we heard from mountain Nineteen seventies for ... farm that was a tribute to max you ask or he was the Woodstock Festival site proprietor and of course that's a festival at which mountain among many others performed\nAdded that the carpenters their top five or from Nineteen Seventy one and also the theme for a movie called lovers and others strangers for all we know and that was ... co composed by a couple of members who happened to be in the band bread at that time Nineteen Seventy one\nAlso speaking of the seventies Nineteen Seventy four to be more exact songs recorded in Seventy four eventually released a Nineteen Seventy eight cult saves big star and a song that was composed by their drummer Jody Stevens by the name of for you\nBobby Darin setting off the second set of what for additional vintage voltage his Nineteen sixty six cover of the John Denver composition\nFor baby for Bobby it's for the two minutes past the eight pm here at Ninety One five is his G. T. we're taking a look at what's going on weather wise and the Ninety One point five K. R. C. C. broadcast area this evening it's going to be partly cloudy expect Lowe's and the higher thirties to lower forties\nTomorrow a partly sunny Sunday with highs and the higher sixties to lower seventies\nCurrently and divide forty eight and partly cloudy at sixty five in Trinidad unfair also fair and our very own steel city of ... sixty three and here in Colorado Springs partly cloudy at sixty return\nA Monday half of all of us here in Ninety One point five care cc thank you for your support during our fall membership drive your financial contributions will ensure that any one point five here she provides accurate and use an analysis music entertainment today tomorrow and the day after we could not do this without [noise]\n\n[noise]\n\nA ballroom last job in the theater guy\nSaw the ... the\nThe oldest child or\nYour ball jak it\n\nBy in\n\nBy the way\nDo with\nThem\nNa\nNa na na\nJak yeah no\nLive in St\n[noise]\n\nHa ha ha\nHa ha ha ha ha ha\n[noise]\n[noise]\n\nShe did she\nNot my\n\n... ... I don't\nI was back in ... ... ...\n\n... ... ... and\nA and to read and I saw the ... in ...\n\nUp there\nRoll on a big way\n\nLa ...\nYou\nI'm Randy price on the owner of Rocky Mountain restaurant group there was a law to address the issue to either outdoor recreational opportunities grade schools great people you know a good business climate and\nCare for it for us we started in two thousand and two was false Robin rocker imminent we've grown to twelve locations up and down the front range on the last Fifteen Years and feel like it's been a great partnership we find out how your messages to sponsor were Ninety One point five or seven or nine four seven three four year old one you'll be glad you did\nThis election year you can count on to put the best journalists on the job from NPR to the Ninety One point five K. R. C. the newsroom we bring you insightful reporting to help you understand the issues and the candidate you make it possible by donating at K. R. C. C. dot org thank you [noise]\n\n\nDa da da da da\n\n[noise] what do ... my\nFriends\n\n[noise]\nOh why oh\nMan oh\nMan\nUh well how long the\nOr black\n\n\nA few\nThe movie\n\nNot all\nBe the main\n\nRarely heard fooling version of their top ten single from Nineteen Seventy four those are the OJ's here on Ninety One point five K. or CC's what for edition of vintage voltage and for the love of money\nI had a bad Billy Joel his top Fifteen or from Nineteen eighty four for the longest time also in that said Jerry Butler and the impressions\nAgain just about making the top ten Nineteen fifty eight for your precious love also in that set live from New York City\nWith a song that was originally recorded on their Nineteen sixty six parsley sage Rosemary in China album Paul Simon and art Garfunkel live from New York City\nIn Nineteen sixty seven for Emily wherever I may find are also from Nineteen sixty seven the tokens for all that I Am and setting off this initial set for this second hours edition of the show the motor city's very own Marshall Crenshaw and for her love\nTwenty two minutes past nine pm here at Ninety One fine this is Gigi\nMotor city's very own Marshall Crenshaw and for her love twenty two minutes past nine pm here at Ninety One fine this is GT\nSome every Sunday evening just show or Ninety One but two years he\nJoined me for a journey through mainstream led by the local wasn't covered all Sunday evening seven or Ninety One point but here's\nThe Ninety One point five kill your cc news team the meeting with the third for scheduled around the ... in the end the ban passed on a six to ... to the over the past five years officials say the jail recognized for excellence by the Colorado broadcasters association\nNPR on Ninety One point five to your cc is supported locally by a e G presenting an acoustic evening\nWith Lyle Lovett and John Hi it that'd be worry eleventh of pikes peak center more information is available at access dot com that's a ... S. dot com oh\nI'm smoking one my cigarette\nSeamus joy when we\nWant to change for the sake\nAnd I see that again\nKnow you and I don't know I live in Louisiana\nUsually oh man\nNow is I\nWe had a lot of jobs doing\nWe once had a lot of jobs do away\nKnow who he na\n\nNa\n[noise]\n[noise]\nWednesday or you can\nThe young men of Manhattan\n[noise]\n\n[noise]\nWas ...\nIn middle\nAge she you know the real\nMr glove living and ...\nPush a\nChihuahua\nOf us in just just sometimes\nNinety three will call\nAnother\nTo be the way up to the street\nHe\nLearned\nLearned to\nHuge another\nJust a little nicer when\nDumb you know\nDo you know\nFrom\nWell we'll get\n\nWe\n\nWe can change\nWill have\nDo we keep a\n\nFrom Nineteen Seventy eight bloody tourists album that Graham Goldman and Eric Stewart AKA tens C. C. here on this Ninety One point five K. R. C. C. what\nFor edition of vintage voltage and for you and I and speaking of Graham Goldman it was the Graham Goldman composition for your love that was originally a top ten hit for the yard bird's back in Nineteen sixty five\nWe heard the rarely well let's go ahead and it was competently covered sounded somewhat like the yard birds but we could tell it was Jerry Lewis and the Playboy's before that live in in concert Joni Mitchell with Tom Scott's LA express live in Seventy four\nWith a song that originally featured on her Nineteen Seventy album ladies of the canyon and for free before that\nFor Pete's sake the Peter tour composition is sung by Mickey donations and rendered\nBy the monkeys that one coming from Nineteen sixty seven and as vintage voltage culture vultures Steve all reminded me it also served as the monkeys TV show closing theme before that Bobby Martin her top Fifteen or from Nineteen Seventy four the love of him\nAnd we started off the second set for the second hours edition of the show\nWith a fellow who was an associate of cat Stevens from way back in the mid to late sixties his name was Peter genes and he did a song from Nineteen sixty\nEight called for the sake of time speaking of the time forty three minutes past the nine pm hour here in Ninety One five is G T and we're taking a look at what's going on weather wise in the Ninety One point five K. R. C. C. broadcast area this evening it's going to be partly cloudy\nLooked for Lowe's and the higher thirties to lower forties tomorrow mostly sunny Sunday with eyes Meyer sixties to lower seventies\nCurrently and divide partly cloudy at forty eight in Trinidad it's fifty four and fair fair also in Pueblo at sixty one here in Colorado Springs it's all of sixty degrees and mostly cloudy you're going to want to keep a tune for a vintage voltage culture vulture effects are\nSprings it's all of sixty degrees and mostly\nCloudy you're going to want to keep a tune for vintage voltage culture vulture effects are\nShooting synagogue in Pittsburgh package bomb some prominent Democrats and President Trump will have the latest on the investigation and it's been Twenty years Harry Potter first which readers look at the literary legacy tearing\nEach in Washington and around them on Sunday on weekend edition\nSunday mornings at six Ninety One point five K. R. C. C. local news on Ninety One point five ... see the numbers from twenty six team showed the sector surpass the entire US Economy ... this survey is part of a large undertaking by the city forestry department southern Colorado's NPR station\nWelcome to your last set of this what for edition of vintage voltage it's time\nFor a vintage voltage culture vulture effects or if you want to score the fine brand new CD by all country pioneers the J hawks it's called back roads and abandon motels\nBe the first caller correctly answer the trivia question that I'm about to ask at either for seven three for eight zero one or one eight hundred seven for eight to seven to seven those numbers again\nFor seven three for eight zero one one eight hundred seven for eight\nTo seven to seven questions answered tonight I'm about to spin a version of the Beatles song for no one has rendered by their liver pool born and bred contemporary sell a black\nBefore I Do what I Want to know is what was similar blacks real name first and last for seven three for eight zero one one eight hundred seven for eight to Seventy seven what was still a blacks real first and last name\nFirst caller correct answer the brand new Jay hawk CD while you're guessing dialing hopefully when I'm spinning someone and McCartney from Nineteen sixty six by way of civil a black giving your what four and setting off this evening's last set of vintage voltage Ninety One point five K. R. C. C.\nMitigate brave young mind they\nLean on them need\nHeat wave you made\n\nNo longer need to you know\nHeat waves you may go out and\nHe has\nLong then leave the room\nThen there's no\n\nYou need\nTo think you need to use\nI\nSays\nHe doesn't need\nA break your mind they\nKnow\nYour head you won't forget him and it is\nI I see\nGoes sweet", "show_name": "Vintage Voltage", "year": "2018", "city": "Colorado Springs", "day": "28"}