{"month": "10", "state": "AL", "station": "WYDE", "content": "Vote for them and you will vote in November two thousand Eighteen reviewed not my fellow American American needs your vote now more than ever\nAbuse expressed here on the Crawford stand are those are the speaker and Mr Crawford wants you to check in send him an email telling him what you think about the opioid problem in America and what we're doing about it\nHis email address is stand at Crawford Broadcasting dot com\nBe sure to tell him on what station you hear the stand when you write when you want to review what you hear go to our website Crawford Broadcasting dot com the Crawford stand is a public affairs presentation of Crawford Broadcasting company and this station serving God and country I built McCormick\nW YDF em Coleman W. I. D. E. A. M. Birmingham W two or three Seventy ... W D. J. C. H. D. to Birmingham [noise]\nZoos yellow hammer News I'm Jay Raman\nThe Huntsville city council is approved a rate increase for Huntsville utility customers the council voted for no one in favor of five annual increases to the monthly availability the\nThe first increase if approved by the Tennessee Valley authority will go into effect January first two thousand Nineteen if he is currently nine dollars Seventeen cents it will increase by one dollar each year over the next five years\nTo correctional officers were injured after being assaulted by inmates\nYou can sense it will increase by one dollar each year over the next five years\nTo correctional officers were injured after being assaulted by inmates the Alabama department of corrections or radio see says the incident happened Thursday at the state and correctional facility an Elmore prison officials say the\nFirst officer was injured when he was assaulted by several inmates a second officer was injured when he tried to separate the inmates from the first officer a D O C is investigating\nThe ... county sheriff's office this morning parents have an app used by a sexual predator yellow hammer news Andrea ties has the details\nA forty year old registered sex offender use the apps whisper to target a new victim Adam narrow more Mississippi used whisper to me the victim and lured him to an undisclosed location where he didn't beat and sexually assaulted the team the app allows users to anonymously post pictures videos and messages where they can\nSend some of their darkest secrets please use the apps to create a reverse thing to locate interesting there are more his bond has been said it two hundred thousand dollars for the ... news radio network I'm Audrey entice\nFEMA administrator Brock Long today updated the federal effort following hurricane Michael near the end of the briefing long voice frustration over insufficient building codes and people who don't have the evacuation orders long urged people to learn from the past and quote build a culture of preparedness unquote\nPeople often behave based on their past experience but when these things happen you know we learned when I'm afraid of is hurricane in Asia ten years is going to go by and we're going to forget what happened to Mexico beach\nBrown to you by attorney Alexander ... men for the people for more Alabama's stories go to yellow hammer news dot com I'm Jay [noise]\nEver wondered what it's like to work at the happiest place in Alabama and any wind creek employee and they'll tell you hit awesome whether you're seeking a career and hotel management administration dining or security our property even aren't more Montgomery an attempt to are filled with opportunities for you to seize\nWe weren't to provide a wonderful experience for all come through our doors if you'd like to start loving your job to do that when the Taliban dot com slash Korea for\nGoogle we create jobs and find your winning moment\nFor more than Twenty years I have consistently fought insurance companies to make injure clients hope I'm Alexander ... and I am never backed down from a fight I've had the pleasure to represent over twenty five thousand injured climber\nAnd with this experience I had developed a winning strategy one must have a good and solid reputation for people to hire you to you must have the legal knowledge to properly develop a case in three you must have the financial means to facilitate the case these three strings make us a great choice for injured Alabamians call me Alabama you'll be interesting to see what kind of\nTrouble and already twenty causing delays this reporter sponsored by tell other super speedway I twenty east bound or a poor Madrid\nKind of crash working there and that's causing ... and I ... from I sixty five and the junction we're also seeing delays the sixty five southbound outta the junction to Lake Shore parkway with afternoon volume\nAnd we've got a crash at St farms now sixty five southbound has got a heavy delays from valley they all rode on a four fifty on southbound we're seeing delays from highway two eighty two are active role was in trouble there is also causing north bound delays from ice sixty five\nLooking for a playoff atmosphere Talladega super speedway has you covered from October to alter the fourteenth enjoy free parking free camping and some of the past is drivers you I've ever seen one NASCAR rolls into Alabama for its double header playoff weekend I'm for it with traffic on super says one that won W Whitey\nClear skies and noticeably chillier tonight the low temperature forty eight a beautiful day tomorrow with plenty of sunshine highest Seventy to clear uncomfortable tomorrow night below fifty two on Saturday mostly sunny skies and very nice for the highest Seventy five\nThe sunshine highest Seventy to clear uncomfortable tomorrow night below fifty chew on Saturday mostly sunny skies are very nice for the highest Seventy five on WGM Thirteen she'd they're all just geriatrician with your forecast and this girl her broadcasting station [noise]\n\n\n[noise]\n\n\n[noise]\nHey no as our number three of the line Andrew in Jessica thank you guys so\nMuch for hanging out with his two oh five nine four one one zero one one is the number [noise] we've gone to a full blown\nDoctor named ... actually you guys have just been throwing us any and every name you can think of [noise]\nSo\n[noise] um whatever you got just bring it just trying to keep it is um\nPretend like when you call in with the name of someone that you know whether it's a doctor or whatever just\nUse this year this test used this a standard pretend they're kids listening and then decide if you need to repeat that night\nWhat'd you say it to grandma which would you do to your grandmother all of us are have like a heart grandma when she was ... I think she was like a firecracker from what he said well rough around the edge or something like that yeah\nThey're just use that to you and use your your best judgment Everytime I say that people will hang up to watch the calls start\nDriving they get nervous or they feel convicted [noise]\nSo anyway we've gotten a lot of them and you guys are continuing to send the men so hooked up the line dash W. I. D. E. on Facebook\nYou got and Andrew maclean who on Twitter at ... am on Twitter and uh if you all will actually sent me some of these names on Twitter I'll start re tweeting them if you got a good one and they got to be real people just remember that uh\nWhat's on the winds onto waiting yet again as I mentioned that poor would break but I Want to remind you guys because we want some some of you guys\nTo show up at the last stop of the home town to we're\nGoing to be Russell puppy there from twelve to three and then Andrew just going to run the show from three to six live it will solve the ones on the way to\nMake it a point to get out there and uh come see us saying Hi take a picture really like taking pictures we are yeah I'm just because\nWell it makes for good show content because one of us ended up looking stupid in the picture like when you had your hand on your hat [laughter] yeah that was good but then it's your picture so there's nothing we can do about it was just floating out there and it turns out to be pretty funny [noise]\nAll right let's go back to it nine four one one zero one month Stevens for storage Dave\nDoing good how are you I mean we are doing great absolutely yes a lot of talk about though\nDoing good how are you oh we\nAre doing great\nAbsolutely yeah sounded a lot [laughter] yup talked about the doctor that they sort of his mom and dad it could have been really wrong name is Richard\nRichard would've been a little more a PG I think\n[laughter] and Richard had no no I'm Talking about the first night right or\nYeah Dr Richard [laughter] that would have been in\nFlorida and he did a report by the way on ... news you left him well I'm doing it again and Jay hauling or whoever it was he would be like and according to reports dig has been charged with ...\n... yeah [laughter] I Love you [laughter]\nThank you we got a message on these on this one I'm Jamie says I knew a lady named gene\nPool [laughter]\nGene pool how 'bout that angry Kerry is next\nWhy don't we talk about what you're talking about ...\nWell it all off and I know these are real names and kind of started off as as a doctor names but it it just kind of blend into people that you've known in the past ... than the actual real names by the way I Love when people call in or pick up the phone they're like so what are we talking\nThat's now they really are sharing above true love it there [laughter] um so anyway\nI just thought I call that even\nAlright thanks Dana I'm Glad that had a happy ending yeah mean than some of these stories though not not like the last one uh but that would that are going to try and squeeze morning before we got to break Terry is next how are you Terry\nHey I'm great this or are they might not be funny but they're kinda weird I went to high school where the guy's name with David David\n[laughter] ran from it and I had\nA girl I work with her name was not enough but she's here uh last name was Morgan she named her son Morgan Morgan\nWith him in ... and David Morgan they'd make a day face wow kings yeah\nEventually became police chief the town where I grew up and then mayor\nNo that's good well you imagine when you go ... what's your name Morgan what's your last name Morgan and then they started mad because they think you're missing [laughter] and yeah thanks gas I think are still moving moving moving moving Frank is next\nYeah a month out your daughter dated a guy years ago which I thought what his name was striking if it were Rushdie total\n[laughter] but\nLike it even worse my daughter first name is Dorrie and I said if you read is Scott what's your name going to be Doritos [laughter]\n\nThank you for your time where I can only do retail retail that's good nine one one zero one one quick rank coming back ...\nWithin ruined just [noise]\nThe superstition never get something that was going on one Ninety five point three of them ... sixty to try\nTo drink more than one place [noise]\nTold the superstition for not\nSuper section one on one\nW was\nHello this is Adrian Hendricks and Jerry Hendricks of say one more now incorporated where our focus is to confront all activities do countering human like created in the very image of God\nWe look for it to joining you every Sunday at one o'clock pm on superstation one oh one W Whitey\nAnd ask you to remember life is good God gives life God is good\nBeer superstition one on one we're committed to bringing equality programming that his formative will\nSend us an email we have one on one to be why the dot com and let us know when you think it was super station one on one\nYou'll buster thinks we're listening superstition one on one\n\nWay\n\nWay\n\nBack with you on the line Andrew in ... [noise]\nSee I'm so happy I'm so glad we're having fun today and I didn't have to beat myself down with news and Kanye West and all this other stuff I don't remember we're gonna talk oh I'm gonna play a clip from the view\nYeah about a downturn that would have been my fault for introducing that to you know to really brought the show crashing down if it weren't for that we got hot cakes coming up next segment right we got there we do ... ... email us they didn't disappear just making sure are so let's see trying to get to guide them before we go over to that\nSign up first is going to be John John how are you\nA a afternoon and I got I got one up in up in Canada there's a grocery store and it's called ... L. O. B. L. A. W. S. but the guy that started his first name was Bob so his actual name was Bob blah blah\n[laughter]\nYeah we could look it up ... each other and then the other one you may have somebody called in already but a lot of famous is actually group and the best thing was that he was in the national guard or an army so he's a captain catching do but when he gets promoted is going to be actually called major boom\nLike that that is true story boat [laughter]\nMajor road that were major boost or thinks John ...\nOn Twitter we've got um mark says he's worked with a candy bar B. A. R. R. and a gay\nBachelor [laughter] there you know gee a white gay bachelor yes Gaylord gay bachelor\nSo bad those great uh Justin is next\nA day of your your body\nSo I got a one of my best friend from high school you walk around her sister's name will ever been laying curator [noise]\nNo [laughter] yeah la la la la ... over here that's all they were all along\nOh that's ... that's been ... by the\nWay I I totally miss an hour I I don't know if I Want to repeat it I'll tell her a on the other side I think struck out here I'm going to tell you what it is right now I'm gonna cut us off and tell you I Can't\nWait wait\nDid you say that on the air you know heavenly heaven was the first name we was middle name not\nKnow that that seems like a stretch but I'm not going to question it entirely possible a gory\nA or a high school English teacher look clocks her daughter's name was okay you\nI Swear I swam alive alive o\nA lot of high school English teacher must clocks her daughter's name was ... you\nKnow I Swear I swam alive alive o feel well there\nThere's two things there one why would you do that what would you give heard that name with that last name a new why wouldn't you just give why would you give her that name and general hurt\nHer explanation for what she loved was Shakespeare's plays or whatever and her favorite catcher was a failure and ever since you look at you when they heard that are that\nNot that when she met her I said I happen to you ... yeah ... good good for her hope she's proud can you imagine the moment for her when she realized hang it my last name and this and this is the name always want to say my daughter\nBad call though feel yeah more or miss misconduct bad call Doug\nI got I got to me that I had a music teacher whose name was Richard\nI'm not going to say the name is ... ... and I had a math teacher named surely fun in the early later only later on she\nUm she married her name was being surely [laughter]\nAt farmers zone dot com\nThat's good it's really funny ... thanks though still moving Jason's next Jason what's up\nYeah I got to see real people one of them with a NATO dot ...\n[laughter] you can't go there and I'm I Need a it's it's ... [laughter]\nI don't need I don't know what they look\nOut or somebody just to an end to this radio show refined right now\nAnd then the second one this lady married in his last name her name was sharing theatre [laughter]\n\nThat's unfortunately that well that may be one of my favorite one it\nWas last year and that's how I got All right thanks so some\nAre man [laughter] that one was man is\nAre we not doing when screening called anymore no and threw him right mine too what do we got ...\nYears nine was a playwright and water\n[laughter] I don't want I Know they're living in Boone county my whole life I Would rainwater appearing well it's\nIt's neat and you said you don't like to go out on all\nThat then well yeah I got somebody with the last name of rainwater so that's in the budget rainwater is up in the night he rang one I pay rainwater\nGot it okay well you didn't get\nThe funniest thing was that was an old man and woman\nWho lived in ... and their last name was ... her first name was ... O P L you and may Muller now in the south anything that ends within a becomes a are yeah\nPlumber plume or when our husbands\nAnd ... and her husband's nine I Swear to God his name was the U. S. C. A. R. D. poster [laughter]\nMost are the employer low road [laughter]\nRight plus start plastered the U. S. T. A. R. D.\nSo how about that first name a new uh Grover no it's not a good though yeah have you with us nothing will be fine [laughter] no yeah no it was good I which I mean we've had literally a hundred names on the show sure and some that we were like belly laughing at but I Can't even remember that so many there's been\nSo you don't stick around for ... is that the one where she collapsed yeah no I Can't get if she'll clap I'll say give me ... All right here we go just as hot cakes\nSays he learned is that this is talk around it occurs siting there this is not what we got gigs [laughter]\nEven a fluffy and see now Lee is even possible to have [laughter] oh my God I live in Mr pancake\nBut like whenever that ensure that comes in Jackson was breaking win [laughter] huh [laughter] so from pancakes tactics alright ... just because there were number one\nNumber one a passenger was there a laser may Cleveland bound flight Tuesday due to her choice evolution all support animal a frontier airlines that a woman boarding flight sixteenth wealth Orlando to Cleveland with a squirrel what she said was her emotional support animal airline said the woman indicated in advance that she was bringing\nNo to Cleveland with a squirrel what she said was her emotional support animal airline said the woman indicated in advance that she was bringing an emotional support animal but they're not say it was a squirrel according to their policy only dogs and cats are accepted on the airlines flight ... airlines that everyone in the flight had to be a plane while police were called\nThey were able to get the woman off the plane the entire situation delayed the flight for two hours\nThat's not fair though I mean if you're going with dogs and cats you going to let the emotional\nSupport no we're all as a rat it's essentially a rodent\nI heard it described as around with better PR um\n[laughter] I just ...\nIt is interesting so squirrels don't bother me rats and mice are filthy beef may have to go but my mom she's terrified of squirrels more than anything in life and so it's interesting the lady getting on the flight is comforted by world yeah where my mom would want to crash the plane to get away from the school\nIt would give her an anxiety problems will calling this lady down it's bizarre to store number to a man was critically injured during the explosion inside his home in Texas late Tuesday night the sheriff's office that had happened around ten PM and a home located in the magnolia area firefighters found demand naked\nWas second and third degree burns ever most of his body and he was quickly taken to the hospital in critical condition\nTheir interviews deputies learned the man was trying to decontaminate himself of bugs by spring break cleaner fluids all over his body and I even tried to use a vacuum to quote remove the bugs and at some point the vacuum sparked and because of the gases has exploded\nThe explosion was so powerful it even blew out the back wall and windows inside the house investigator said they found a lot of empty canisters of right fluids scattered around the home it's unclear if the man was under the influence of alcohol or drugs he was under the influence of something I Would think that maybe even the fumes from the break cleaner\nY'all don't know what ... does for the skin would make it ... it's very ... sure you know like oil ... yes exactly right it's like skin care not just a story number three\nUm you'll like this nobody likes to suffer the consequences of passing a brown cloud at home and and the office or in the car with others\nWhether you the perpetrator or the victim luckily a British company has come out with a product that promises to stop the fart smell from seeping out after the success of its flatulence filtering pants and close\n... has launched a cushion offering discreet toot filtration wherever you needed to filter available and black and gray it's designed for use in the car at ... at the office or at home a hidden carbon lining filters out odors giving you the confidence you need when you let a honey hiccups slide out [laughter]\nYou know ... ... sorry inventor and owner Paul O'Leary has always been proud of the small parties had and making people's lives easier with his flatulence filtration products and kitchen designer by trade Paul said it's fulfilling to help customers will be embarrassing side effects of splitting the same and hopes to continue creating innovative products\nHe has since gone on to develop fart resistant genes and pajamas and has sold hundreds of thousands of products so far\nAs I'm curious why he's in the news now because in Georgia ten years before coming\nTo the show today and I had a radio reporter and we gave him that sort of product really I Can't tell you if it was by that particular name but he would feel the ...\nAnd also living and the girl on the show the Jessica if you will bought him in case you weren't sure what a girl with the Jessica if you will bought him one of those like cushions and it had charcoal lining okay 'cause yeah and I don't know the name of it but I found quite similar\nMaybe it was about what this guy apparently has a whole line though 'cause he's made pants and jeans\nCoal mining okay 'cause yeah and I don't know the name of it but I Will now white similar\nMaybe it was about what this guy apparently has a whole line though 'cause he's made pants and jeans and ... and again you had it for years can you imagine that moment where you can just let let one go\nHe's the yuan mosque to see is he the Avon Moscow much [laughter] and I'm like no [laughter]\nAll right well here's the thing a Russell pay this show ever comes to an end we're going to give you permission to take this segment over to the the way home on WB Jaycee adult show so\nThere you know what we got gigs and you\nCan even use that song I Love it doesn't it answering it really is\nAll right I'm going to try to squeeze in a couple of more before we got a break and hopefully these people getting funny names because I just want to get Russell's reaction on mobile so let's give it a shot while I'm One who do we got\nHello hey now hey uh now this is no line I Know you're not don't believe this but uh we went to school with this guy on his first name was locked in his last name was hunt\nYeah I've ... yeah I've done it [laughter] I Can't I Can't I Can't promote that one actually has the money or said they knew that okay\n[laughter]\nYou know when I was in graduate oh sorry we can't continue the call out oh yeah that's what the south has gotten\nThank you for that here's the thing about that that everybody's on line heard of that ... she is given us an actual German name but sometimes when you're dealing with somebody\nUm of a a a different uh origin\nBut different nationalities that's the word I'm looking for our own off or you deal with names that sound like something really bad in this country that over there would be perfectly normal\nAnd the fact that that last name sounded so much like a really bad word here we had that don't that yeah so ah apologies and I I Want her to know that I wasn't doing it just because uh you know one of the railroad or\nWhat I thought well it's an actual name so I can say right um well I go back to\nOur standard here was before you call ask yourself is it okay if kids here this name\nThat I must have been gift she might not have been listening in a lot of people have just throw out the window let wrestling these last with Russell somebody\nCame in right now I'm Amazed at how many [laughter]\nAnd I had with the outside those last two we've had some really funny well\nNow let me ask you you've been ready for a long time have you ever heard that been dropped on the show that you're on\nI honestly I I heard the first name I heard the window and then I didn't hear the random you don't need to repeat\nOr [laughter] so you completely missed the what is funny because in radio and I guess it's in\nTV too for a live broadcast you do have the dump button where you can you can drop audio of three seconds or eight seconds or twenty seconds seven hours whatever needs to be [noise] were you were working together when I had my dad on the show and in the first thirty seconds he dropped\nAs I was here and then he did it again and then he he meant\nHarm he just talks that way or and I had to give him like the pep talk before he was on the show I my dad You're welcome to voice your opinion it doesn't have to agree with mine it most certainly won't\nJust don't use bad language he's like oh I wouldn't dare do such a thing he's like seven seconds then on the guy for me Jim and Jeff and he says something like a roll my eyes and we had the dump button you know we don't dropping because if my dad drive you say one thing you get tossed\nBut we were able to salvage and we kept\nA roll my eyes and we had the dump button you know we don't dropping because if my dad drive you say one thing you get tossed but we were able to salvage and we kept going and then he said one other thing and like [laughter]\nNo no I remember that because I was in my office listening on line in here listening online you don't get\nThe dump it doesn't come through and I heard it and I'm like it didn't hit me that I was listening on line yeah\nAnd my first thought was they didn't do it [laughter]\nAnd he's still go and neither one of the game [laughter] oh that was that was good family and my father please stop [laughter]\nI'll Try it out of them\nAnd we make that yes I Do we have to break before we got more phone calls aren't will do it to five nine four one one zero one one thing that we saw\nWithin ruined Jessica\nLegacy we're contractor they vertical company that will be there for the rights of your roof they are not here today and gone tomorrow hearing storm season you need the company that can be the most for your insurance claims quickly legacy with contractors has insurance specialist with\nThirty years of experience they are your first call first storm damage get a free birth inspection by calling to well five sixty three thirty three eighty three and mentioned several you waiting for free you blown information to go along with your new route get started on line that legacy ... dot com [noise]", "year": "2018", "show_name": "The Steve West News Hour", "city": "Birmingham", "day": "12"}