{"month": "10", "state": "CO", "station": "KRCC", "content": "\n\n\n\nThis is Eric greed you're hearing in the bedroom shine from his album a light in the darkness there is a reason to play the song at the end of every jazz excursion right before the news\nWho started this with Judas Lorch from her new album the second time around that song featured read\nThose two songs for all we know and I'll be seeing you\nAfter that the first snow from chip white\nOn his album all star ensemble volume five new medications and letting moods than you heard Tony Bennett and Diana crawl from love is here to stay that was the classic tune with the same name\nAnd following that John Coltrane from the recent release both directions at once the last album\nWas nature boy thank you for joining me on this jazz excursion here comes NPR and here comes the do wrong with regular\nLive from NPR News in Washington I'm Jim hawk dozens gathered Sunday in Washington DC to remember the victims of the shooting up the tree of life synagogue in Pittsburgh W. A. amused Carmel del ... reports\nThat normally bustling Dupont Circle became eerily quiet as vigil attendees lowered their heads to pray for the eleven people killed in Pittsburgh\nThe gathering attractive people of all ages and religious and ethnic backgrounds from those walking with canes to innocence in strollers rabbi jets affirming at the new synagogue project addressed a crowd and told them to look to each other for support\nAnd in Judaism we grieve\nAnd we can unity that is because we are connected to one another and support each other\nOther solidarity events are planned around the country throughout the week for NPR News I'm come out all shot in Washington\nThe eleventh victims fatally shot in the Pittsburgh synagogue Saturday have been identified from member station W E s a um Pittsburgh Virginia Alvino young reports the victims include eight minutes\nYesterday in Pittsburgh Virginia Alvino young reports\nThe victims include eight men in three women with ages ranging from fifty four to Ninety seven they include a pair of brothers as long as the husband and wife Allegheny county chief medical examiner crawl Williams says his officers working closely with several rabbi is to ensure the practice of guarding the body before burial as observed\nWe are doing everything in our power to complete the process in a way that honors both civil and religious law\nIt's customary and the Jewish tradition to be buried within twenty four hours that won't be possible for the victims due to the ongoing criminal investigation Williams says some of the bodies will be released today that no funerals are expected to take place for NPR News I'm Virginia Alvino young in Pittsburgh\nThe suspect charge with mailing pipe bombs to former president Barack Obama and other prominent Democrats is expected to appear in federal court in Miami Monday NPR's David Schaper reports from Fort Lauderdale the many acquaintances uh fifty six year old Cesar ... were surprised by the charges\nThose you know say I say he's long been a bit off and known to wildly exaggerated what he's done where he's worked in even his heritage but his turn towards heated political rhetoric is more recent his social media posts used to be about pro wrestling bodybuilding and Native American culture but over the last couple of years became mostly pro Trump in derogatory towards Democrats\nAnd say I started spewing anti Semitic anti gay and racist sentiment\nTo reads a poem or worked with say occupy new river pizza in Fort Lauderdale\nThe white face and said that\nCall her and others to say I was usually respectful not confrontational nor threatening David Schaper NPR News Fort Lauderdale\nIndonesia's disaster agency is confirming the lie on air flight with one hundred eighty eight aboard crashing into the sea of Indonesia's island of job on Monday shortly after takeoff this is NPR News\nIBM's says it will acquire in North Carolina based open source software company red hat and a thirty four billion dollar start the\nThe two companies called the acquisition a logical step after they work together for Twenty years saying IBM served as an early supporter of red ... software that do companies said the deal approved by their respective boards is now subject to read had shareholder and regulatory approval and should be completed in the latter half of twenty Nineteen [noise]\nA strong six point one magnitude earthquake hit in the Pacific off the coast at all sound butter on Sunday shaking\nSeen a strong six point one magnitude earthquake hit in the Pacific off the coast of also butter on Sunday shaking people in the western portions of the country near the border with Guatemala but causing no damage U.S Geological survey so the tremor occurred about Fifteen miles under the surface [noise]\nThe Boston Red Sox are champions of major league baseball Sunday night in Los Angeles the red Sox beat the Dodgers five to one to clinch their force World Series title since two thousand for NPR's Tom Goldman reports\nThe red Sox were the best team in baseball during the regular season winning a franchise record one hundred and eight games now confirmation comes with the dominating four games to one victory in the world series Sunday nights clenching when was fueled by two home runs from series most valuable player Steve Pearce\nAnd another dominating performance by starting pitcher David Price who before this series endured a number of postseason failures Boston now is one for title since breaking its infamous eighty six year World Series drought in two thousand for\nThe Dodgers are World Series runners up for the second straight year Tom Goldman NPR News\nI'm Jim ... NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen program to massages including morning night and stretch sessions retailers nationwide more dream wave chair dot com Andy any case the foundation\n[noise]\n\n[noise]\n[noise]\n\n\nWelcome to the roots where I get your your city you run into one and two you know heard from Tim would adjust exclusion ex each and every Sunday from seven to ten [noise]\nThis is southern Colorado NPR station can see the I guess the C. H. D. Colorado Springs [noise]\n... hunter he's in the Exxon real good WC fmri lumbar ... street\nDid you see the law hunger keeping the dog will get W C. C. F.\nOr more lumbar countrymen I guess we see the whole [noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\nIran Iraq [noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n\nMom does God God died in there\nYou\nWe need to do\nWhen you think you know\nTo [noise] to do\nA job\nBe in the home\n\nBenet junior high school age to bring\nAnd we need to get\nIn\nWhen you're\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\nWhat's on your hand right now that the mission positive movement [noise] better that you heard from Bob Melinda ... onto need be few touring you Roy ... writes on a start you off it wouldn't be all over\nThis was southern Colorado NPR station care to see and Carol you see each the Colorado Springs get used to see the hunter gives you see a stunt will get W cc assembled lump park on streaming at gas C. C. dot org [noise]\nYes you can have a great music seven nights a week from seven to midnight on Ninety One point five K. R. C. C. [noise]\n\nThis election year you can count on to put the best journalists on the job from NPR to the Ninety One point five K. R. C. C. newsrooms we bring you insightful reporting to help you understand the issues and the candidate you make it possible by donating at K. R. C. C. dot org thank you [noise]\nWell the guy going on the other side of the all the other one always learns\nThat you're going to play a lot of what goes on\nAnd going all the other side of the law says I don't always areas there you're going to play a lotta okay or\n\nNa na na na na na\nNa na na na na na na na na na na na na\n[laughter]\nI don't know if you refer to as a last\n[noise]\n\n\nWin and grow you know\n\n[laughter]\nOh no it's very interesting that your team you\n[noise] [laughter] I said\n[noise] [laughter] I\nMean the guys\nIn the city I mean [noise]\n\nThe I\nThe\n[noise] the feed me\nMe to follow in June [laughter]\nAnd you can follow June then\n[laughter] that's really\n\nLabs\n[noise] they\nNa\nNa na na na na na na na na na na na na na na\n\n\n\n[noise]\n\n[laughter] [noise] [noise]\n[noise] [noise] [laughter]\n[noise] [laughter]\n\nAnd the men\n[laughter] queens she shows me\nMom\n\n[noise] [laughter]\n[noise]\n\nWilling\n\n\n\n\n\n[noise]\nJust ... not sure what his Sonia illusion headed up to the world ... the world [noise]\nLucky to be warned crime on a stop to offer the bloody nose on the other side [noise]\nThis is southern Colorado NPR station yeah see I get to the beach the Colorado Springs ... excuse me see if that will get W see see a friend will lumbar on streaming up the R C C O support\nFor Ninety One point five K. R. C. C. comes from our listeners and from local organizations who wants to reach a discerning audience that values quality\nMarketing on Ninety One point five ... the underwriters reach the people most likely to shop in their businesses support their nonprofit\nAnd buy tickets to their shows to learn more about corporate support called Jeanette seven one nine four seven\nOr eight zero one\nNinety One point five K. R. C. C. it's on Facebook and Twitter joined us there and you'll find new headlines local stories they should have been an announcement\nFive K. R. C. C. it's on Facebook and Twitter joined us there and you'll find news headlines local stories they should have been an announcement\nFind that some follow us today on Facebook and Twitter are cc\n\nWhen the weather right now I'm a dumb thing to do Colorado Springs forty degrees unfair right now [noise] Monday\nSunny high Seventy seven ... tonight fear fifty two degrees Monday's mostly sunny Hi Dee\nDee people during the day trip to four degrees Andrea tonight [noise] Monday mostly sunny heights them tonight [noise] long do rocky for\nTonight ... degrees unfair Monday's sunny hike eating for he's a light on one of us are sixty degrees unfair tonight Monday sunny breezy height then the [noise]\n\nThis is the mother and you're listening to our team members supposedly from afar southern Colorado another New Mexico\n[noise]\n\n\n\n\n[laughter] [noise]\n\n\n[laughter]\n\nYou just heard from Jimmy Cliff with a song one more credit that Melinda ... street let a bird ignition originally I cut you off ... sorry born fifty lively and\nThis is southern Colorado NPR station Kelsey see ... each the Colorado free ... hunter excuse me ... [noise] and gay W. A. C. C. F. M. woodland park on streaming at sixty bucks or\nSomething ... is an overdose reversal drug that saved thousands of lives in Philadelphia every year but knowing when to use it can be complicated\nCertainly if somebody is you know six foot four and was like three hundred pounds you want to be very very careful how you wake that purse it up you have to be prepared to protect yourself on the next MORNING EDITION from NPR News tomorrow morning at five AM on Ninety One point five K.\nR. C. C. right this was helping black hosta looking up to nurture on astronomy here on Ninety One point five K. R. C. C. where every Monday at nine AM and nine PM and additional shows are archived at K. R. C. C. dot org and available and I do remember keep looking up [noise]\nSee them actually\nBe them badly you to stay\nEmbarrassed them I live in\nDo you think you know we\nIn a primary\nTo\nThe wrong\n\nThey should be [noise] to to\n[noise]\n[noise] [noise]\nThe people to buy the book\nCame out I and I\nFind them on the PGA man but I'm not\nYou know they might\nEconomy there is a good role models you know they just jump in the desert there are about ... at the time on them you know much about what may be up to you or me am I on the food on the river may\nBe a burden on their part of the old you'll get your name in front of you get it done\nSo under the sun is not an immediate you begin by saying that I'm interested in them and say\nHey let's say you're pulled down by just started to run by gossiping about me that they need more damage to the bottom of all we have they may not be on your body on paying\nJob ... enjoyed beer or you know if it's good mommy geared to sit down meal goes over around ... sitting here going very well ... ... I did one on me there to the bottom of our we'd never pay\nDown on down to zero by far without any comment that they're there by by the time we may not be no mass began modify job on the yeah we're going down not up on day we die over there and make a\nAmerica and proud paid off the you know to to buy them about we'd have a family about about a week I pay ... to say on a big\nBody of a weed there'd be a white man we're pretty far they have to be there in my life where they are they going to say it's not the way DeMint or we may go outside here do in the snow day changed now say a a slow down\nIf they gave up by about ... than she did well by doing about we got they learn right man oh hey\nYou know they gave up by about we got they got up and down the street by about we got paid man or if you're not young\nNow from my Yogi and they keep your mid ... not going by Europeans gun in their region you'll be again after the breed or a pigeon because fish or by someone like most Colorado's\nA robot about we got there may not be the body or do they come on now it's like\nThree weeks ago about the economy no matter what people\nAre lever made me to run and John Goodman known what these people up to you or me and then when they do and we're we're going to buy them about we got the job that you gave up by about we are they just say you're not bought\nThis dumping the robot do your body because there's not been the robot but then by the time\nThese so is there anything that they're on the go nowhere\nMaybe they're they're my way up on the go under one God there and go watch\nI'm missing them showed them I'm about to get your me on your last August dog we do so you know a robot overall we don't\n\nWant to know if you know the bad\nPart in that\nKnow why don't you don't want these two new groove bonding no country for them and we're not going to do nothing you can eat you know carry a lot and I bought it and then turned out\nTo dry\n[noise] I don't know a lot and I bought\nThen then I'm going to\nTry and send them from them about young [noise] and I think the media giants they didn't want to be\nYou know finally one time judge digging all but I Know you'll need\nThat they don't they don't need that\nNobody does that\nMean that\nKnow you know they\nDon't you don't know\n\n\n\nYou know some junior Kelly [noise] me last night [noise]\nI had a doctor who told you recount work at all costs ya been never laws and trying and yellow Monroe adopt tried featuring five had such too often the Mali seat in the lead a [noise]\nDoesn't start on Colorado NPR station CFCC and get to the age of the Colorado Springs [noise] you see the long talk to you see it started the kid WC ... FM lumbar stream in at ... dot org [noise] hey everybody\nThis is where the cost of this is Chris hello this is Michael from from spread between the Ninety One point five K. or the the music stepping PMDD made Ninety seven nights a week\nWhen Sunday nor can is an overdose reversal drug that see thousands of lives in Philadelphia every year but knowing when to use it can be complicated\nCertainly if somebody is you know six foot four and was like three hundred pounds you want to be very very careful how you wake that person that you have to be prepared to protect yourself\nThe next MORNING EDITION from NPR News tomorrow morning at ...\nAre you wake that person up yet to be prepared to protect yourself on the next MORNING EDITION from NPR News tomorrow morning at five AM on Ninety One point five K. R. C. C.\n\nNinety One point five ... years on Facebook and Twitter you'll find news headlines local story station event canned announcements sinus and follow us on Facebook and Twitter K. R. C. C.\nMan\n[laughter]\nThey need to be with you on a limb\nTo be treated me [noise] you know not maybe gee we'd\nLike to walk in ways that no one wants time die on the line to walk again graves read don't mind di da de\nDa de la ... and the [noise]\nLike this raise it with your mind di da de da de do raise it was a day you're around [noise] they got a\nNew strategy [laughter] about it do you\nSee the new our job to job do you think about a job though when did\nThat I could accept during the Reagan did John anytime day you're you're a number I could be a razor blade one time a day or\nAny kind of the\n[noise]\nSame thing [noise] you man [laughter] like\nRadio but the white guy\n[noise]\nLike radio but the white guy\nGame and you're being raised by a gay\nBought up all the time [laughter]\nI'm dying to raise the one guy [noise] [noise] [noise] well by day you're ... you're\nGoing to do\nYou want to be better treatment that's me [laughter] [noise] I don't think\nThey enjoyed every day like this don't they and they do a\nBlog she\n[noise]\n[noise]\n[noise]\nCome from Russia and China and Don King day you're um [noise] like getting your rain that was my time gig to run on the age or\n[noise]\n\n[noise] people more strollers sly side\n[noise]\n[noise]\nGod I'm like come on\nYou know it\nFeel better which means\nBetter which means grew\nMore non white\nGuy and they want to be there [noise]\nAnd I\nCan do without tearing down\nDa da da da da di da da da da da\nDi di di\nDi di di di a day to day [noise]\n[noise]\n\nBoy meets the ground [noise] All right or wrong [noise]\nAll right and that may come in yeah\nFor me the\nMain thing but I don't really see\nIt\nNow she tells me when she gets\nA\nLittle bit of\nAnything near the shrine [noise] and you can you why\nAnd I try [noise]\nCheese and you would find put your finger you shouldn't\nGoing to get\nRead [noise] [noise]\n\n\n\n[noise] [noise]\nKnow who's from Logan heritage has been [noise] yellow mine could have to make [noise] ... I missed the wrong end up with Peter to step in razor [laughter]\nThis is Ninety One point five here the the southern Colorado NPR station I Can't see the beach\nThis is Ninety One point five CFCC sudden Colorado NPR station [noise]\nI Can't see the Colorado Springs ... you see the hunger games you see it's not real unpaid WC FM Willem part and streaming at KFC C. dot tall\n[noise] Ninety\nOne point five K. R. C. C. can be with you wherever you go all you need is your Android device or I downloaded free Ninety One point five care cc mobile at Google Play or the ... or just search for K. R. C. C.\n[noise]\nNinety One point five K. R. C. C. it's on Facebook and Twitter joined us there and you'll find news headlines local stories station advance an announcement\nScientists and follow us today on Facebook and Twitter at K. R. C. C.\n[noise] [noise]\nYou know when you're the only game in the\nUh\n[noise]\nWell the weather I nominate dumped on state you're in Colorado Springs [noise] forty six degrees unfair right now [laughter] Monday's sunny high Seventy seven [noise] tablets tonight for the United agrees unfair [noise] Monday mostly sunny height eighty four [noise]\nTrinidad fifty four degrees unfair tonight [noise] Monday mostly sunny high Seventy nine [noise]\nLong therapy for tonight for two degrees unfair [noise] Monday sunny high fee for [laughter] so I'm going to invest a forty two degrees unfair [noise] Monday sunny breezy higher than the [noise]\nThe pay is any way\nThat it has to be this way [noise]\n... they just wanted to say [noise]\nTen days we guys really fun\nSame way though we got to be a fun little\nMen do alone in a movie in ... new being a\nNine to five job ... name a gay\nUndermined out there for ten years [noise]\nThen that it is mine\nBy and\nBy the union\nThe among many movies\nJust like the [noise] that's a ... gunner\nOr jogging\nVolleyball\nYou weigh it to be this way [noise] [noise]\nOh good ... D Bush to that is the main\nMay know shine you\nGot to be in the\nA guy that may be that\nMaybe they now we\n\nThis is not what these are\nTime in God\nType in God and I thought about that\nMommy I haven't gone in\nProbably\nAbout people away from we got in\nSaw something about the what\nLove buttons on the back row\nFor a dinosaur or many\nDa\nDa\n\nDa da da\nDa da da da da da da\nDa da da da da da da di\nDa da da da\n\nDa da\nAnd\nGo about it\nRobot I\nBelieve in\nWould probably not I mean that", "show_name": "Reggae Show", "year": "2018", "city": "Colorado Springs", "day": "29"}