{"month": "10", "state": "CO", "station": "KRCC", "content": "\n[laughter] [noise]\nThat was Eric read shine from his album a light in the darkness somewhat of an unofficial ... for the jazz excursion here before\nThat you heard Jimmy Smith plays Jimmy Smith live in music city and that's a different Jimmy spelling it with an e playing Jimmy with a wise Smith music\nOr have to look more into that before I can tell you about it but that was the tune route down and get it\nAnd before that Youssef ... chief from his album the doctors in and out and that was the tune the improvise there's\nSo I Hope you enjoy this jazz exclusion of you've got to hear it and the chair warm keep in mind it's going to be a cold evening a there is a freeze warning until ten in the morning at least in Colorado Springs and across much of our listening area [noise]\nDid you Iran will tell you more about that this evening as he does the ... hour coming up right after NPR\nOr so about five minutes from now we'll uh ... the same time next week for the jazz excursion have a great evening\nNinety nine point five feet can be with you wherever you go oh you need if you're in Philly for I downloaded free Ninety One point five carried the the mobile app played for the genes somewhere\nLive from NPR News in Washington I'm Jim hawk [noise] one of the biggest losses from hurricane Michael was ten dollar force base in the Florida Panhandle the base was heavily damaged and some are saying it may never be rebuilt but Florida Senator Bill Nelson is vowing to get the funding\nIt is going to be years\nUh in the making but this\nBase will be rebuilt\nAnd Ariel survey of the damage done to attend those shows every building has severe damage the base remains closed down trees and power lines blocking nearly every road crews with backhoes and other heavy equipment scooped up splintered boards broken glass chunks of asphalt and other debris and hurricane flatten Mexico Beach Florida\nCrews were backhoes and other heavy equipment scooped up splintered boards broken glass chunks of asphalt and other debris and hurricane flattened Mexico Beach Florida on Sunday the death toll from Michael's destructive march from Florida to Virginia stands at Seventeen President Trump plans to visit Florida and Georgia on Monday to see the damage\nPresident Trump has been giving a lot of interviews lately Sunday night it was with Leslie stall of sixty minutes as NPR's Mara Liasson reports the president spoke about the high turnover in his cabinet\nPresident Trump says other officials might be leaving soon\nAsked about defense secretary Jim Mattis the president was particularly lukewarm it could be that he is I think he's sort of a democratic if you want to know that the president also continued to cast doubt on the reality of human caused global warming\nHe said that climate was changing but he didn't know what the causes or manmade even casts doubt on the Ninety nine percent of scientists to say it is\nScientists have a very big political agenda the president said\nMara Liasson NPR News Washington\nIn Germany conservatives allied with chancellor ongoing Merkel have been dealt a major loss after election Sunday and the state of Bavaria from Berlin NPR's psoriasis or how do you Nelson reports of far right party has benefited from voter anger\nIt's the first time in decades that the Christian social union or see a few is losing its majority rule in the area\nThe reason was a protest linked to anger over a Muslim migration to Germany German public broadcaster A. R. D. estimated a hundred and eighty thousand former C. su voters cast ballots for the far right alternative for Germany but not every frustrated Bavarian voter turned right\nThe second biggest winner with a left leaning environmentalist Green Party dizziness use expected to partner with that party or with the liberal free Democrats in a conservative coalition called the free voters that way to see if you can continue to govern Germany's most prosperous state psoriasis are hiding Nelson NPR News Berlin\nA flurry of talks between Britain and the European Union ended Sunday without a brags that agreement leaving the two sides just three days to close the gap in their positions before a make or break some of the key stumbling block is resolving what to do about the border between Ireland and the u._k. is Northern Ireland after\nRags and this is NPR News a federal\nJudge in Alaska will reconsider the government's decision against listing the Pacific walrus as threatening Elizabeth Arnold reports\nA federal judge in Alaska will reconsider the government's decision against listing the Pacific walrus as threatened Elizabeth Arnold reports from Anchorage\nTen years ago the federal government lifted the polar bear as a threatened species because of declining sea ice conservation groups then petition to lift the Pacific walrus for the same reason\nThat last year the U.S fish and Wildlife Service concluded there's not enough evidence walrus need the ice how well walrus are adapting to a warming climate is at the center of the legal battle now over their protection\nFederal judges agreed to take up that question and challenge brought by the center for biological diversity\nHundreds of thousands of lovers have been coming ashore along Alaska's coast far away from where they feed in the ocean at a critical time and their breeding cycle government scientists haven't been able to determine yet if less sea ice has directly affected their reproductive rights for NPR News I'm Elizabeth Arnold in Anchorage\nA member of the Senate Foreign Relations Committee says the U.S Saudi relationship may need to be completely revised if an investigation finds the kingdom's government responsible for the murder of Washington Post contributor ...\nRepublican Marco Rubio of Florida says that includes the multibillion dollar arms deal the President Trump wants to preserve\nMeanwhile Saudi Arabia on Sunday and threatened to retaliate for any sanctions imposed\nA warning from the world's top oil exporter came after a turbulent day on the Saudis stock exchange which plunged as much as seven percent at\nOne point I'm Jim hark NPR News in Washington\nSupport for NPR comes from the Charles Stuart my foundation supporting efforts to promote adjust equitable and sustainable society and it's home town of Flint, Michigan and communities around the world more at ... dot org and that listeners who support this NPR station\n[laughter]\nKnow what it comes to see you know head from the jaws exclusion each and every Sunday from seven to ten\nSheets of southern Colorado infestation ... Colorado Springs [laughter] you see the hunter these tests stock WCBS woodland park's treatment and care for them\nLet's get WC the FM woodland park's treatment of gas\nFor [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\nYou see on my down time playing the when we came up with them to be what\nAttorneys may go down on their knees now these times when we did what they do wear them please\nBothered me building down on their knees and\n... ...\n... the so called ... that showed up on the\nWay they will read P. A. China than to damage on gun owner that domino must be read now grow\nGangs and that kind of evidence and momma momma\nDo not need in science when we get what they do with the with the woman about being seen no you're laying down on the end and all and all\nThose little\nMay\nNot cleaned up\nIf\nThey're not playing by the time and time saying he when\nActually but\nSeas laying down on their knees praying that time he\nBarbie doll laying down on the same job\nPays that then then the cat likes to all\nThese so called really don't have any say in times\nAgain [noise]\nNever be [noise]\n[noise]\n\nYou just heard from my kitchen around with a song in times like these you know that you heard from Damien junior go Molly near the punk rock the boat Marlon away let's coming in from the day after day school outside so\nDid you all day and you're doing what you're doing good work of coming home or wherever you go in please be CFO there and drive safely because it's cold out and\nStart you off the lion Robbie\nBelieve in Doug this is southern Colorado NPR station Cathy Cathy C. H. D. Colorado Springs get used to see the hunter gives me see if that will get W C. C. F. in woodland park bench treatment and care of the C O\nNeil Armstrong's mission to me you know I think he's become and the collective imagination structure poker face to almost marble statues hero to people like his kids he was just that you know people in the neighborhood he was you know he's the guy down the street director\n... cells Armstrong story to a new generation in the film first man on the next MORNING EDITION from NPR News\nMorning at ... am on Ninety One point five K. or see see ... D\nMorning at ... am on Ninety One point five to your see see\n... ... ... um group DOMA king and you're listening to Ninety One point by your movie\nBy a\nWould like them by the\nWay down in my life like them by young and way down in my\nOn and on and he wants to claim that they make monkey they gave\nWas in dollars bother Long Jones and\nThe lounge and all the like the job of ground nicer\nGave me one day later on John and John's pizza and have strong they might not be high and I think the bones\nIn my building and signed by the\nLine is Dr by the\n\n\n[noise]\n[noise]\n[laughter]\n\nGo and they do an engine was on by a lot about\nYou can you can believe that you hide the chart and what I was young they all\nThey but they didn't he dies dollars they must be consumed\nNow by paying their rent and now that guy's name they're trying to find a\nLive in our solar like Miami\nSo it's like a ... a\nAnd like my age and\nAnd way down in ... and like I Am and way down and not to let them by the\nWay down in my soul and by the way down in mind though\n\nAre bitter said will join us for a mini vacation for your soul and the news quiz from NPR's [noise]\n\nHi I'm Lisa ... eye and co founder and that the central co working and the president of the Komen Foundation I've been a member of care cc\nFor over ten years I Would encourage anyone who listens to care sixty talk so becoming number you know if you listen you certainly must find the programming valuable I think that we are listening to care she seemed to keep up to date on what's going on in our world continents our world\nThat's really close to us incidents at certain world for much bigger joined Ninety One point five K. R. C. C. I care C. C. dot org\nSupport for Ninety One point five\nK. R. C. C. comes from our listeners and from local organizations who want to reach a discerning audience that value quality\nMarketing on Ninety One point five K. R. C. C. underwriters reached the people most likely to shop in their business to support their nonprofit and buy tickets to their shelves [noise] to learn\nUnderwriters reached the people most likely to shop in their business that support their nonprofit and by taking their shelves [noise] to learn more about corporate support called genetic seven one nine four seven or eight zero one\n\nWhen the weather right now and then what dumped them to do is Colorado Springs miss the fall Twenty one degrees Monday sunny height to these seven\n... tonight lights no fog missed twenty six degrees one day mostly sunny hike forty\nShould not tonight twenty two degrees mostly cloudy Monday partly sunny hike to the one the huddle rocky for tonight twenty degrees mostly cloudy Monday mostly sunny high forty one\nSo light up one of us the Nineteen degrees like snow Monday sunny high\nForty two telecom pizza night Twenty one degrees foggy Monday through Sunday to the tree [noise] [noise]\nNow watch no faith and make no more partying and I ... the money they make you ought to be still living near what looked like he applauds the ... by the way they made them start the snow fall in the San ... you know free\nMay not when they bought the stage John blip on the other day there's not enough or too old for every thought there with the ... came forth old not poetry thoughts I yard needed I see the economy China's also need them drugs the only ... he was watching a Monet Tony a bona fide beach when they see\nThem coming off the light sauce\nOnes that got that job then\nThey said\nThey knew what the problem with\nWhat votes by young lady because they know and maybe they're not going to be a reason maybe they\nThey knew what the problem with\nWhat both to buy your name because they know maybe they're not up to be a pretty good no maybe did not put down not thirty my by young Ron Paul it couldn't have ...\nWill not to be a politician to maybe they'd number would that make the piece on his new book maybe did not make a hundred million disappeared in ... I mean up here and what you're going to\nThank God they started reality I mean it got there you're about to die young toddler ring a\nMuch more that you already want or need to learn the but then my mom\nThe it's the talk once said stop the speed limit bowed out to read books by greed good clean got repeated pictures there must be made to look look screened are made by ... the ... the leader gets wind up is about ...\nReport brought bought out by the property light my drumming career my new way to deliver on crime crime we buy a new one way or\nThe world Trade Center like you do me much dead baby jokes lately on what you were saying when people leave no democratic being hard price for\nOff all writers they\nYou you you you have a good\nYoung\nYou you you you you you used\n\n... yeah\nIn\n[noise]\n\n[noise]\n\nJust who should a minor strong nice it up [noise]\n\nHow did that you heard from Dennis brought it to my son ... income culture right turn on the wall and I thought you also ... lost money this is southern Colorado infestation care to see a C. C. H. D. Colorado Springs\n... keeps you see a dog on the WTC FM\nLump on extreme minutes get to see the full week on all things considered here the latest news\nIt has been an honor in a lifetime to serve\nMuch what it means what we have a number of people that would very much like to do it it's a great\nPosition and some things that aren't so serious as no structure Monday we'll look I was with a something that tells you feel you know listen to all things considered to hear the bigger picture every afternoon from NPR News afternoons at three thirty Ninety One point five your your cc\n\nNinety One point five here see see we have increased our daily news services please consider upgrading Georgia meaning membership cycling our membership department seven one nine four seven three for eight year old one\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[laughter]\n[noise]\n\n\n[noise]\n\n\n[laughter]\nCan't tell\n[laughter]\nCats\n\n\n\n\nDo I\n\nThe gift shop\n\nBut you can make you don't mind\nThe driven\nBut I\nBe really nice now than they are willing\nTo be but you you're in the\nCountry but when\nKnow\nOh a\nSlow\n\n\n[noise]\n[noise]\n... do we would have song teach the world [noise] how did that for these bind move all the Bible and midnight loved the lights you live on a start you off the modern away low light so this is\nSouthern Colorado NPR station ... C. C. C. C. H. D. Colorado Springs ... hunter he's done the WTC lumbar stream in a you know she's the\nOne I'm Neil Armstrong mission to the meat you know I think\n\nNeil Armstrong's mission to the moon made him a legend about the need to be calm in the collective imagination poker face almost marvels down your hero to people like his kids he was dead you know people in the neighborhood he was you know he's the guy down the street director\nDamien ... Armstrong story to a new generation in the film first man on the next MORNING EDITION from NPR News\nMorning at ... am on Ninety One point five to your see see\nIn the jungles of El Salvador to voters launching drone [noise]\nThey're searching for the new shifts lucrative cargo\nDrugs sharks and their Finn hard there we go\nMoney to spend money sometimes years in the working under brutal conditions there it is\nSlavery as the mother next reveal\n\nNinety One point five ... years on Facebook and Twitter you'll find news headlines local stories station of and canned announcement sinus and follow us on Facebook and Twitter K. R. C. C.\n[noise] and\n[laughter]\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n[noise]\n[laughter] [noise]\n[noise] [noise]\n[noise]\n[laughter]\n\n\n[noise]\n[laughter]\n[noise]\n[laughter]\n\n\n[noise]\n[laughter]\n\n[noise] [laughter]\n[noise]\n[laughter]\n\n\n\n[noise] [laughter]\n[laughter]\n\n[noise]\n\n[noise] [noise]\n\nAh [noise] ah [noise]\n[noise] [noise] [noise]\n[noise] they should know watery Goldman ship 'em all but shut down those are really does go to\nThe\nNext ... yes they\nNice day and then you know they will be nice to get that many\nThings about\n\nHe is the thing\nIs draw the wrong and they don't win win\nThat and I mean how did you see\nOn the\n\nHe can see\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [laughter]\n[noise] [noise] man [noise]\n\nIf\nUh this week's on the media ten years after the financial crash and look at humanities never ending narrative\nMoney I'd like to joke that you know in the beginning was not the coin in the beginning was the receipt from Mesopotamia\nAnd tablets to bitcoin miners in China and the next on the media from WNYC\n\n\nWell the weather right now no one dumped him studio [noise] Colorado Springs Twenty one degrees mostly Claudia right now [noise]\nMonday sunny height thirty seven\nLoad tonight mostly Claudia twenty six degrees Monday mostly sunny forty [noise] turned it on tonight twenty two degrees mostly cloudy [noise]\nMonday partly sunny high thirty one [noise]\nThe hunter rocky for tonight twenty degrees mostly cloudy [noise]\nMonday mostly sunny high forty one\nSo light up one of us the lights no Nineteen degrees right now [noise] Monday sunny high forty [noise]\n\n\n\nMom\nBe able\nTo get to\nRight now\nBeijing has no God along\n\nMillion young strong\nTo me why\nWe were just like\nWe make the judge like\nTo me is no one\nStrange 'cause you know\n\nThe right and then", "year": "2018", "show_name": "Reggae Show", "city": "Colorado Springs", "day": "15"}