{"month": "10", "state": "AZ", "station": "KUAZ", "content": "Is is a prosthetic moment profit from a very significant part\nMany of the visitors say the former U.S consulate building represents something biblical that stories also coming up\nSupport comes from tonal ... annual fall plant fast we Saturday October thirteenth from nine to five and Sunday the fourteenth from ten to four offering more than one thousand plant species fit for the desert climate details or to own a tool that orgy\nAs his Fifteen fifty K. lazy eighty nine boy one ... Tucson and eighty eight point nine K. U. S. F. M. H. D. Sierra Vista service of the University of Arizona\nSomething biblical that story is also coming up\nSupport comes from donor Julian you'll fall plant fest we Saturday October thirteenth from nine to five and Sunday the fourteenth from ten to four offering more than one thousand plant species fit for the desert climate details or to own a tool that orgy as his Fifteen fifty ... eighty nine boy one K. U. HGF ... Tucson\nAnd eighty eight point nine K. U. S. F. M. H. D. Sierra Vista service of the University of Arizona\nKavanaugh says he's joining the Supreme Court with no bitterness but when President Trump took to the campaign trail he blasted Democrats for going after his nominee It's MORNING EDITION from NPR News\nAn increased flow of migrants from Central America are asking for asylum at the U.S Mexico border\nThat story coming up from the ... pm newsroom after NPR News\n...\nA U.S Naval War college professor and longtime Republican who's leading the G O P after watching Kavanaugh's confirmation Noel King\nI'm David Greene will spend time in Europe is our looking at why China invested heavily in a port in Greece and whether workers they're being exploited and his journalism becoming more dangerous in Europe the latest debt Abul Gary and journalists found raped and murdered\nThe agency in newsrooms after NPR News [noise]\nA U.S Naval War college professor and longtime Republican who's leaving the G O P after watching Kavanaugh's confirmation Noel King\nAnd I'm David Greene will spend time in Europe this hour looking at why China invested heavily in a port in Greece and whether workers they're being exploited and his journalism becoming more dangerous in Europe the latest death of vulgarity and journalists found raped and murdered\nAlso with child homelessness rises will need an eighth grader in Idaho with living that reality It's Tuesday October night Britain's former prime minister David Cameron turn fifty two years old [noise] here's the news\nLine from NPR News in Washington encore of a Coleman United Nations ambassador Nikki Haley says she is stepping down NPR's Scott Horsley reports Haley is expected to leave her posted the world body at the end of this year Haley's departure\nTook the international community by surprise that President Trump says Haley told him six months ago but she wanted to take some time off\nTrump praised Haley service at the United nations man said he hope she'll return to his administration in some other capacity in the future Hayley the former governor of South Carolina is thought to have political ambitions beyond the EU and she told her\nIs expected to leave her posted the world body at the end of this year Haley's departure\nTook the international community by surprise that President Trump says Haley told him six months ago but she wanted to take some time off\nTrump praised Haley service at the United nations man said he hopes she'll return to his administration in some other capacity in the future Hayley the former governor of South Carolina is thought to have political ambitions beyond that you and she told reporters she won't be mounting a presidential campaign anytime soon\nAnd plans to campaign for Trump's re election in twenty twenty Scott Horsley NPR News the White House\nThe national Hurricane Center says hurricane Michael has top sustained winds of one hundred and ten miles per hour it's getting stronger as it moves toward Florida's Gulf Coast\nNPR's Windsor Johnston reports the strong category to storm is expected to make landfall tomorrow along the panhandle or Florida as Big Bend area as a major hurricane\nIn the path of the storm are boarding their homes and preparing to evacuate federal emergency management agency spokesperson jets fired says Michael ... life threatening storm surges and all warnings should be taken seriously the main thing that we ask you\nAnd reports the strong category ... storm is expected to make landfall tomorrow along the panhandle of Florida as Big Bend area as a major hurricane\nResidents in the path of the storm are boarding their homes and preparing to evacuate federal emergency management agency spokesperson jak fired says Michael will bring a life threatening storm surges and all warnings should be taken seriously\nThe main thing that we ask you to do is to evacuated asked to do so that is the most important role you can play or to protect yourself but also to protect the lives of our first responders we asked if you do not put the our first responders in harm's way of if they have to come and try to rescue and you've been asked to evacuate\nForecasters say Michael is expected to make landfall on Wednesday states of emergency had been declared and thirty five Florida counties Windsor Johnston NPR News\nIndependent researchers say they've identified another Russian spy accused of trying to poison former Russian double agent Sergei Skripal in England Matthew Bodner reports from Moscow it's another highly publicized issue for Russia's military intelligence service\nSleuth the bell and cat have identified the second suspect in the St Paul investigation as Ross\nTim urgency had been declared and thirty five Florida counties Windsor Johnston NPR News independent researchers say they've identified another Russian spy accused of trying to poison former Russian double agent Sergei Skripal in England\nMatthew Bodner reports from Moscow it's another highly publicized issue for Russia's military intelligence service\nInternet's flew the bell and cat have identified the second suspect industry Paul investigation as Russian military intelligence officer Alexander Michigan but the Kremlin told reporters in Moscow today that it will no longer engage with journalists and these mounting allegations\nTwo weeks ago battling cut identified the first suspect is decorated military intelligence officer and it totally chip ... Russia initially explained that the two men were simply sports nutrition salesmen on holiday in the u._k.\nThe criminal since facing mounting wave of allegations that his military intelligence service is conducting offensive operations across the west for NPR News I'm Matthew Bodner in Moscow\nOn Wall street the Dow Jones industrial average down sixty three points at twenty six thousand four hundred and twenty six and asked accept thirty at Seventy seven sixty six [noise] this is NPR\nSupport for NPR comes from a campaign monitor\nThe criminal since facing mounting wave of allegations that his military intelligence service is conducting offensive operations across the west for NPR News I'm Matthew Bodner in Moscow\nOn Wall street the Dow Jones industrial average down sixty three points at twenty six thousand four hundred and twenty six the ... thirty at Seventy seven sixty six [noise] this is NPR\nSupport for NPR comes from a campaign monitor\nAnd email marketing platform used by more than two hundred thousand customers worldwide with email to ... a drag him drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts\nLive from the ... pm newsroom I'm area and approaches\nTucson border patrol sector chief ... says the increased flow of immigrants from Central America asking for asylum at the border is causing immigration officials to take drastic action Nancy Montoya reports that means the release of more than seven hundred pregnant women and families with children from immigration custody\nCarey says the numbers tell the story from around Ninety individuals that day presenting themselves for asylum or a year ago at the same time to more than two hundred\n... says the increased flow of immigrants from Central America asking for asylum at the border is causing immigration officials to take drastic action Nancy Montoya reports that means the release of more than seven hundred pregnant women and families with children from immigration custody\nCarey says the numbers tell the story from around Ninety individuals that day presenting themselves for asylum or a year ago at the same time to more than two hundred a day now\n... or ... groups of people that are ah surrendering a road that seniors between Austin you more right now\nThere are three main family detention centers together they can hold around thirty six hundred people as for taxpayer cost\nZero when immigration officials released a family to stay with friends or relatives in the U.S until their asylum hearing date that compares to three hundred dollars per day per person held in one of those three family detention centers\nI'm Nancy ... Arizona Public media\nIt's been over a year since the University of Arizona launched its global micro campus network the university's model is meant to deliver programs and decrease to international students in their home country\nFamily to stay with friends or relatives in the U.S until their asylum hearing date that compares to three hundred dollars per day per person held in one of those three family detention centers I'm Nancy ... Arizona Public media\nIt's been over a year since the University of Arizona launched its global micro campus network the university's model is meant to deliver programs in degrees to international students in their home countries actually free to reports on the programs progress\nThe U.S has partnered with Thirteen universities and ten countries at the time of the launch to micro campuses were up and running and China and Cambodia and the you know they started to more this year Brent White had international education at the U. of a he says the goal is to have twenty five campuses and other countries within three years\nThe network is rapidly growing so we have these four campuses veteran operation is fall but launch plans for an additional six by the fall of two thousand Nineteen often campuses in operation\nHe says the campuses are intended to offer a higher education to international students and market rates micro campuses also get the university the chance to collaborate with universities abroad and create research partnerships I'm actually pretty Arizona Public media\nIn other countries within three years\nThe network is rapidly growing so we have these four campuses veteran operation is fall but launch plans for an additional six by the fall of two thousand Nineteen will have ten campuses and operation\nHe says the campuses are intended to offer a higher education to international students and market rates micro campuses also get the university the chance to collaborate with the university abroad and create research partnerships I'm actually pretty Arizona Public media\nActually pretty as a student in the University of Arizona school of journalism and an intern at Arizona Public media\nThe Phoenix Suns have fired general manager Ryan McDonough barely a week before the season begins they've done it was under contract through twenty twenty cents on a Robert ... said he made the decision to fire McDonough after much thought and along evaluation of our basketball operations\nFor more news is at our website news that easy PM dot org I'm Marianne approaches Arizona Public media support\nFrom ... physical therapy to sixty eight East River road Dr ... a neurological physical therapist offering specialized treatment of chronic pain neurological conditions on sports injuries were more at five seven seven forty seven Seventeen or ... P. T. dot com fifty eight degrees ...\nOperations for more news is at our website news that easy PM dot org I'm Marianne approaches Arizona Public media\nSupport comes from ... physical therapy to sixty eight East River road Dr ... a neurological physical therapist offering specialized treatment of chronic pain neurological conditions on sports injuries were more five seven seven forty seven Seventeen or ... P. T. dot com\nFifty eight degrees mid dumped Tucson forty nine and green valley ... forty nine of ... expecting sunny skies one afternoon high above Seventy six good morning I'm John Weaver\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Noel King in Washington DC good morning Nikki Haley the U.S ambassador to the United nations is stepping down from her post\nI'm here now with NPR's diplomatic correspondent Michele ... morning Michele good morning Noel so President Trump and Nikki Haley have given a joint news conference in fact I think Nikki Haley may still be speaking a what she said about why she's stepping down she hasn't really saying why she's\nStepping down other than that she was planning to um leave after two years that it's kind of a natural um time and she's talking about the accomplishments that she's had up there at the un\nNow with NPR's diplomatic correspondent Michele ... morning Michele good morning Noel our President Trump and Nikki Haley had given a joint news conference in fact I think Nikki Haley may still be speaking a what she said about why she's stepping down\nShe hasn't really saying why she's stepping down other than that she was planning to um leave after two years that it's kind of a natural um time and she's talking about the accomplishments\nThat she's had up there at the un and you know it's been really fascinating to watch her over this time she's done a quite an amazing job of finding her voice at the un and building up\nForeign policy credentials which could help her in any future political run\nAlso kind of keeping a bit of a distance from the president you know here at the in the oval office there she was you know praising him and talking about being part of this team but she's always managed to kind of keep her distance I'm from sort of the chaos going on at the White House\nBit of an arm's length and President Trump of course spoke in this news conference as well let's play a little bit of what he had to say here\nDo this because the\nTo the United nations has been very special she's done an incredible job [noise]\nHim and talking about being part of this team but she's always managed to kind of keep your distance I'm from sort of the chaos going on at the White House bit\nOf an arm's length and President Trump of course spoke in this news conference is well let's play a little bit of what he had to say here I wanted to\nDo this because they get\nTo the United nations has been very special to me she's done an incredible job she's a fantastic person very importantly but you also is somebody that gets she has been [noise] as the United nations from the beginning with a with the\nPresident describes a relationship that sounds very friendly very chummy um what what is your understanding of the relationship between between these two people and whether or not this was expected\nJohn kisses has more on China's impact on an iconic Greek port right after a traffic and whether on NPR eighty nine point one sport comes from the ... gallery in the sun the landscape paintings of Tucson artist ... see are featured in desert\nJohn kisses has more on China's impact on an iconic Greek port right after a traffic and whether on NPR eighty nine point one\nSport comes from ... to ... see a gallery in the sun the landscape paintings of Tucson artist Ted deGrasse are featured in desert dwellings a new exhibit at the gallery and the son running through January thirtieth two thousand Nineteen\nLearn more at ... dot O. R. G. this traffic updated supported by the U.S Forest Service and the ad council information about the forest near as you as a discover the forests dot O. R. G.\nWhile we have a closure because of flooding pumped station roads south of silver bell road to average valley road is closed we have an accident clearing from the Nineteen north bound south verdict and rode around eggs in Ninety eight also a traffic incident on Broadway boulevard at the Sarnoff drive\n[noise] this traffic updated supported by the U.S Forest Service and the ad council information about the forest nearest you is that discovered the forest dot O. R. G. it's fifty eight degrees in ...\n... and roads off of silver bell road to average valley road is closed we have an accident clearing from the Nineteen north bound south of or victim rode around eggs with Ninety eight also a traffic incident on Broadway boulevard at the Sarnoff drive\nThis traffic updated supported by the U.S Forest Service and the ad council information about the forest nearest you is that discovered the forests dot O. R. G. it's fifty eight degrees in midtown Tucson at eight twenty\nOn the next fresh air had terrorists governments political campaigns and even street gangs are using social media to push propaganda and disinformation and fear with real world consequences we talk with the W. singer and Emerson broken\nAuthors of the new book like war the weaponization of social media joined us\nHere get fresh air this afternoon one o'clock on NPR eighty nine point one [noise]\nSupport for NPR comes from the station and from capital one offering a variety of credit card options with features for a range of customers from foodies to travelers capital one what's in your wallet credit approval require\nWar the weaponization of social media China [noise]\nYou'll get fresh air this afternoon one o'clock on NPR eighty nine point one [noise]\nSupport for NPR comes from the station and from capital one offering a variety of credit card options with features for a range of customers from foodies to travelers capital one what's in your wallet credit approval required capital one bank usa an a\nFrom Amazon Prime video presenting the return of the man in the high castle where America's history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nAnd from Harvard Business school executive education for executives at any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more at H. B. S. dot Emmy slash executive\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm David Greene China has poured billions into making basically of Silk Road of the sea running dozens of ports in container terminals around the world it's way to ...\nFor executives at any career stage to prepare for new challenges through one of its comprehensive leadership programs learned more H. B. S. dot any flash executives\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm David Greene China has poured billions into making basically a Silk Road of the sea running dozens of ports and container terminals around the world\nIt's a way to move Chinese exports to important markets including the European Union and in Europe it all began in the Greek port of Piraeus the Chinese shipping giant Cosco has spent millions transforming it into the fastest growing port\nIn the world but as Joanna Kakissis reports from previous this has come at a price\nIs as iconic to clean the proper way\nIt's were lawyers set out for each of the battle and more Hollywood ... for the Nineteen sixty film never on Sunday\nAccurate\nSmelling I met with saying that there's no port she loved as much as ...\n... ... my\nThe port of Piraeus is as iconic struggling because the proper way\nIt's were lawyers set out for each of the battle and more Hollywood ... for the Nineteen sixties film never on Sunday\n...\nSaying that there's no port she loved as much as ... ...\nYou mind me\nToday now may he a knee or showed he\nRetired in ... and his wife Maria the song by heart he worked at the port prayers for thirty five years\nWe're going to be able to but better than the average visitors in March of this is my father when I started reporter who didn't have many machines to load cargo into the should we just didn't with our own hands full with all the bags of groceries leather ... we're all made in Greece old bound for North America Australia\nHe says pray us took care of its stock workers he made good money and now has a good pension he flips a string of worry beat says he reminisced says in his living room under a watercolor painting of a shift\nThis is my father when I started to ... reporter who didn't have many machines to load cargo into the reward them we just didn't with our own hands or do we do the bags of groceries leather goods and they were all made in Greece old bound for North American Australia\nHe says prey is took care of its dock workers he made good money and now has a good pension he flips a string of worry pizzas he reminisced says in his living room underwater color painting of a ship\nGroup of ... and then up to ... many heroes using them looking out across from the sewage if you want to get some deep enough of big ships it's got everything to\nBe successful but for years when the Greek state owned the port bureaucratic red tape made it hard to attract investment\nThen came the debt crisis which began in twenty ten ravaged the Greek economy the IV pushed Greece to privatize the port of Piraeus only the Chinese showed serious interest [noise]\nThe Chinese shipping giant Pasco took over the port in twenty sixteen it now owns\nStake and the Port Authority Cosco runs cargo terminals cruise ship peers and the largest\nThen came the debt crisis which began in twenty ten ravaged the Greek economy the pushed Greece to privatize the port of Piraeus only the Chinese showed serious interest [noise]\nThe Chinese shipping giant Pasco took over the port in twenty sixteen it now owns a majority\nStake and the Port Authority Cosco runs cargo terminals cruise ship peers and the largest passenger ferry Wharf in Europe and the Chinese are not stopping there\nThey want to expand the car terminals they want to expand or they want to create the logistics center they want to build a new on a cruise terminal\nCan be done by let us advisors to the Greek shipping ministry he's aware the Chinese lease on the port will run out and about thirty five years\nIf at some point in the future they want to abandon period as we will have all these investments they will not take them with with them okay that would lead them here you see it as entirely a win win\nWin win those are the words of kept it food Chung chill costs goes CEO and pray as heard here in twenty Fifteen\nRun out and about thirty five years\nIf at some point in the future they want to abandon period as\nWe will have all these investments they will not take them with with them okay they will leave them here you see it as entirely a win win\nWin win those are the words of captain food Chung she'll costs goes CEO and parade as heard here in twenty Fifteen\nTo Greece and\nOf course ... one of the port union leaders I ... as another interpretation\nWhen the time he said when when they they mean vaguely why she says the benefits mainly go to China\nThe founder if they if they're if they found them know how their way to organize\nDoing business they ... the same in Europe\nCan actually hear the Chinese expansion half the cargo terminal which are busy twenty four hours a day straddle carriers lip giant metal containers of goods onto shift workers in bright yellow safety vests everywhere these are coveted jobs in a country where the unemployment rate is twenty percent\nBut most of the Seventeen hundred workers\nOrganizers of doing business they expand do these things in Europe\nYou can actually hear the Chinese expansion half the cargo terminals which are busy twenty four hours a day straddle carriers lived a giant metal containers of goods onto shit workers in bright yellow safety best are everywhere these are coveted jobs in a country where the unemployment rate is twenty percent\nBut most of the Seventeen hundred workers at the port or temps without labor why [noise]\n\nTwo years ago hundreds protested and federal police over costs coast takeover and their working conditions\nThirty year old Steven ... recalled how he and his colleagues worked long hours an unsafe condition for less pay to go\nAnother ... ... workers were too scared to speak on it and they kept their heads down working ... chips with outbreaks even to go to the bathroom\nSome of my co workers had to relieve themselves in plastic bottles now he says at least they can take twenty minute breaks during chefs\nOnly about two hundred and fifty workers\nFor less pay to go through many\nAnother ... ... workers were too scared to speak up and they kept their heads down working ... chips with outbreaks even to go to the bathroom\nSome of my co workers had to relieve themselves in plastic bottles now he says at least they can take twenty minute break during chefs\nOnly about two hundred and fifty workers are in the Greek dock workers' union run by your was ...\nHe cannot stomach the new reality for most workers at the port and blames Cosco\n... obedient to workers with no unions in this ... what's the future we didn't go in the future\nWe feel they can for more fathers bust which should have been ... go to that in the future ...\nGoes pray a CEO food chunk chill and his deputy declined NPR's interview request a Costco spokesman said it an email that after quote along and productive negotiations a labor agreement was signed that benefits both sides\nThe European Union's been largely silent on the labor concerns but it's ...\nSo it's been ... blow to get into a future workers\nCosts goes pray a CEO food chunk chill and his deputy declined NPR's interview request a Costco spokesman said it an email that after quote along and productive negotiations a labor agreement was signed that benefits both sides\nThe European Union's been largely silent on the labor concerns but ... says secretary of ports\nSays he has heard from you officials were suddenly worried that China's running a European port\n... me to give ... to the gym in a row aware that the Chinese state is behind a company like Costco but it was the use of pushed off to sell our ports costs during the first place we were in debt with little bargaining power he says the you underestimated China [noise]\n\nAnd now that the Chinese flag is race for re it's too late for regrets for NPR News I'm Joanna Kakissis in ... [noise]\n\nWe had little bargaining power he says the e you underestimated China [noise]\n\nAnd now that the Chinese flag is right and for a U.S it's too late for regret for NPR News I'm Joanna Kakissis in ...\n\nAs we said press was just the beginning China has snapped up about a tenth of Europe or capacity in just the last decade I'm going to hear about that later this week\n[noise]\n[noise] [noise]\nThis is NPR News\n... year after Harvey Weinstein and me to New York is enacting the country's strictest workplace sexual harassment laws\nThey don't have training that goes well beyond sexual harassment you want it to cover discrimination and harassment based upon any protective category not just sexual harassment\nThat story plus justice Brett Kavanaugh birthday on the Supreme Court this afternoon on all things considered from NPR News it's all things considered\nThis is NPR News\n... year after Harvey Weinstein and meet you in New York is enacting the country's strictest workplace sexual harassment laws\nThey want to have trading that goes well beyond sexual harassment you want it to cover discrimination and harassment based upon any protective category not just sexual harassment\nThat story plus justice Brett Kavanaugh's first day on the Supreme Court\nThe landlord decided to sell the property and we just could not\nFind a place that we could afford\nMore depressed I God I just I didn't know what to do\n... small disability type and can the government but that's nowhere near enough to cover rent in Boise controls grateful for the shelter but says it's hard on her grandsons\nOne he can be a little terror because she's upset but you know he gets angry men\nHe'll sit in the corner and\nHe'll just say I hate this place hate this place is typical for ...\nDepressed I God I just I didn't know what to do\n... get the small disability typing in the government but it's nowhere near enough to cover rent in Boise controls grateful for the shelter but says it's hard on her grandsons\nMy youngest one he shouldn't be a little terror because she's upset but you know he gets angry men\nHe'll sit in the corner and\nHe'll just say I hate this place I hate this place\nIs typical for cable too but you wouldn't know it\nCame as a social fourteen year old is a big smile\nOne of his favorite things about school is seeing his friends\nMy friends know about it and me being homeless and and they don't teach me on it I'm trying to work hard and it's just an effort to try not to break down\nIt's harder for students who are anxious and worried to concentrate homeless kids tend to score and lower on standardized tests and have lower graduation rates\nAnd sometimes king does break down with his friends [noise]\n\nUsually that [noise]\nThis case is doing okay [noise] it's kind of school ...\nIt's harder for students who are anxious and worried to concentrate homeless kids tend to score and lower on standardized tests and have more graduation rate\nAnd sometimes king does break down with his friends [noise]\nAgree\nThat [noise]\nAnd this is my ... is doing okay if one kind of school kid and carries his tray of food to a table with his friends\nOf the picture and his mom has a drug problem before his grandma stepped in he had to help take care of his little brother\nHelped him ready for school [laughter] the session one won't wash pesto for days and it was one time when we only had cereal for like two weeks\nHe has been trying to convince his grandmother she should let them get a job so he can help with Brent\nLike so what do you want to help out but can't travel won't have it\nYou need to be a child as long as possible and you don't want to be in a big hurry to grow up honey\nFew weeks later there's good news and cadence world they've got a house\nOne time when we only had\nCereal for what Julie king has been trying to convince his grandmother that she should let him get a job so he can help with Brent like\nSo I Want to do I want to help out but can't travel won't have it\nYou need to be a child as long as possible and you don't want to be in a big hurry to grow up\nA few weeks later there's good news and cadence world they've got a house it's about seven hundred square feet that they share with a roommate for ... it's a huge improvement\nI feel much more comfortable and safe\nAnd probably most importantly he can say something he hasn't been able to for quite some time this is home\n[laughter] for NPR News I'm Amanda ... in Boise\nThat story came to us from the mountain west news bureau and later today on all things considered in a rural Guatemala many poor children are having trouble learning in school but one educator is trying to make a difference you can listen by asking your smart speaker to play NPR or your local member station by name [laughter]\nThis is NPR News\nThat story came to us from the mountain west news bureau and later today on all things considered in rural Guatemala many poor children are having trouble learning in school but one educator is trying to make a difference you can listen my asking your smart speaker to play NPR or your local member station by name\nAnd this is NPR News\n[noise]\n[noise]\nNorth Atlantic writes whales used to feed in large numbers of goes to Maine but not anymore\nI have the legal right as a farmer to keep a crop that is not damaged by somebody else's spray\nComing up and just a moment in the yard and I bought one we'll hear about where these whales have gone and why [noise] sport comes from donor tool the annual fall plant fast will be Saturday October thirteenth from nine to five and Sunday the fourteenth from ten to four offering more\nWhales used to feed in large numbers off the coast of Maine but not anymore [noise]\nI have the legal riders of harbor to keep a crop that is not damaged ... sprayed\nComing up and just a moment on NPR nine point one we'll hear about where these whales have gone and why\nSports comes from tone a chill the annual fall plant fest\nWill be Saturday October thirteenth from nine to five and Sunday the fourteenth from ten to four offering more than one thousand plant species fit for the desert climate details or to own a tool dot ORG sport also comes from Pima County attractions loop store will be at the Tucson meat yourself festival\nIn front of the Joel ... Valdez library offering bike jerseys running shirts loop T shirts hats and sunscreen more information that the loop store at Pima dot Gov [noise]\nSixty two degrees midtown Tucson fifty one in green valley fifty one in Sierra Vista should be sunny and about Seventy six this afternoon clear and fifty two overnight tonight sunny and eighty two tomorrow is things warm up a bit toward the weekend\nIt's eight forty four\nI'm used to Marlins a legal battle rages over a question on the twenty twenty cents as the Trump Administration\nStore at Pima not does sixty two degrees midtown Tucson fifty one in green valley fifty one in Sierra Vista should be sunny and about Seventy six this afternoon player and fifty two overnight tonight sunny and eighty two tomorrow is things warm up a bit toward the weekend it's eight forty four\nI'm used to Marlins a legal battle rages over a question on the twenty twenty cents as the Trump Administration wants to ask about the citizenship status of people living in the U. S. opponents said that's unconstitutional and now justice Brett Kavanaugh could tip the balance and decide who wins that battle\nThe latest from inside the divided Census Bureau next time I'm hearing now\nYou're an outcome joy this morning eleven o'clock right up to one a listener supported NPR eighty nine point one\nGood morning I'm David Greene bears in cat my national park in Alaska both up as they get ready to hibernate and mark is having a little fun with it in his fat\nWants to be on Facebook to look at bears caught on cameras in the park\nThe fattest some of the favorites a bear named thirty two chunk\nAlso the jelly belly jumbo jets seven forty seven I mean honestly I cannot bear\nGood morning I'm David Greene bears in ... my national park in Alaska pulled up as they get ready to hibernate and mark is having a little fun with it is that\nOnce people on both the look of bears caught on cameras in the park\nThe fattest some of the favorites a bear named thirty two chunk\nThere's also the jelly belly ... jumbo jets seven forty seven I mean honestly I cannot bear the competition here It's MORNING edition\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers working food health power jobs and resilience cities at rock found dot org\nFrom the doors to charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm David Greene\nAnd I'm Noel King Thirty years ago researchers from the New England aquarium started studying north\nFrom the doors do charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm David Greene\nAnd I'm Noel King Thirty years ago researchers from the New England aquarium started studying North Atlantic right whales off the coast of eastern Maine large parts of the whales showed up like clockwork in late summer\nNow those endangered whales come to that area only sporadically and more and more they're being seen far to the north Murray Carpenter went out on a research vessel to learn more\n[noise]\nIt's just after dawn and Amy Goldman surveying the waters of the bay of Fundy just off of eastern most main she's a scientist with the New England aquariums Anderson Cabot Center for ocean life your points out harbor porpoises chasing fish near the boat and then something much larger appears in the windswept water\nBehind us probably on fat person will get better look\nTurns out to be two facts one spouse near the boat [noise]\nDawn and Amy Goldman surveying the waters of the bay of Fundy just off of eastern most main she's a scientist with the New England aquariums Anderson Cabot Center for ocean life ... points out harbor porpoises chasing fish near the boat and then something much larger appears in\nThe windswept water behind us probably a humpback whale will get a better look it turns out to be too hot backs once about near the boat [noise]\nIt's a cool citing but these are not the whale she's after\nNote and is hoping to find the north Atlantic right whales that she and her colleagues have been studying here since Nineteen eighty their large bay lean whales with big heads and no dorsal fin researchers used to count as many as two hundred forging here in the summer\nBut they became scarce starting in two thousand ten and their range shifted dramatically many more of the whales are now summary and hundreds of miles north in the Gulf of St Lawrence\nMariano had bloom one of ... research assistants survey that area in August and said it was nothing like the bay of Fundy\nHad days where we were talking about individual working in the ... and [noise]\nRight well and I didn't write\nUniform thing to see\nIn total fewer than four hundred\nAnd their range shifted dramatically many more of the whales are now summary and hundreds of miles north in the Gulf of St Lawrence Mariano had bloom one of ... research\nAssistants survey that area in August and said it was nothing like the bay of Fundy\nHad days where we were talking about the individual working in the ... and [noise]\n... [noise]\nYou know wanting to see\nBut in total fewer than four hundred and fifty North Atlantic right wells remain and their numbers have been falling for a decade as more urban entangled in fishing gear or killed by ships\nReproduction is also declined researchers found no new cabs last winter with the population on edge scientist wants to understand the reasons for the new migration pattern Nick record is with the big load laboratory for ocean sciences in east ... Maine\nMy hypothesis is that this change in the migration patterns of Wales is connected to their food resource mainly ... count is is like the battery of the Gulf of Maine\nColumnist is the type of fat rich plankton that's favored by many species record says a changing climate is not only rapidly warming the region's waters it's also shifting the currents that one swept this important plankton into the deep basins were right will\nIn east ... Maine\nMy hypothesis is that this change in the migration patterns of Wales is connected to their food resource mainly ... count us is like the battery of the Gulf of Maine\nColumnist is the type of fat rich plankton that's favored by many species record says a changing climate is not only rapidly warming the region's waters it's also shifting the currents that one swept this important plankton into the deep basins were right will speed making it less available to them\nMore of brown another scientist with the New England aquarium team so she actually find hope in the habitat shift all the way from the waters near Maine to the Gulf of St Lawrence\nIt's not like it's right next door will have to win all the way around Nova Scotia so what a tremendous response you know this is a highly endangered whales there's not many of them left and yet they're demonstrating that they can respond to major changes in their habitat and that's actually quite encouraging\nBut she says it's definitely slim pickings in the waters near Maine\nIt's not that this area's abandoned the cheese are count for this year is less than a dozen whales\nAt the dock the crew in their thirty mile survey the last of the season with no right well sightings but ... says its worst sticking with the research we're not a whole new era right now with\nAnd yet they're demonstrating that they can respond to major changes in their habitat and that's actually quite encouraging but she says it's definitely slim pickings in the waters near Maine\nIt's not that this area's abandoned the cheese are count for this year is less than a\nDozen well back in the dock the crew in their thirty mile survey the last of the season with no right whale sightings but any note and says its worst sticking with the research\nWe're not a whole new era right now with climate change with habitat shifts it's important with us long term study to sort of maintain some of the basic efforts that we've had so that we can better understand what's happening for the wealthy she says I'll be\nBack in the bay of Fundy next summer gathering more data even if the right wheels are few and far between for NPR News I'm Murray Carpenter [noise]\nSixty three degrees midtown Tucson forty four and Patagonia fifty one up in business being forty nine out Benson we can expect sunny skies today with an afternoon high about Seventy six\nDot com or six one five six to six six\nSixty three degrees midtown Tucson forty four in Patagonia fifty one up and biz being forty nine out Benson we can expect sunny skies today with an afternoon high above Seventy six clear and fifty two overnight tonight sunny and eighty two tomorrow as things warm up a bit\nThis his Fifteen fifty ... eighty nine point one K. U. A. Z. ... Tucson at eighty eight point nine K. U. A. S. F. M. H. D. Sierra Vista a broadcast service of the University of Arizona it's nine o'clock\nKwan McDonald an unarmed black teen who's killer a white police officer awaits sentencing\nWhen will this case I mean in the fight for police reform\nFrom W. A. M. U. and NPR in Washington DC is one [noise]\nHey there I'm Joshua Johnson today on what age the future of law enforcement Chicago police officer Jason Van Dyke could spend years in prison for second degree murder it's a rare conviction some activists considered it unlikely and some in law enforcement considerate heavy handed [noise] but what happens now in the larger push to rebuild\nCan be sued one\nAre you there I'm Joshua Johnson today on one age the future of law enforcement\nChicago police officer Jason Van Dyke could spend years in prison for second degree murder it's a rare conviction some activists considered it unlikely and some in law enforcement considerate heavy handed but what happens now in the larger push to rebuild trust between police and the public especially in communities of color\nWe'll explore that today and we'd love to hear from you sure what you know if you're working to improve policing from the inside or the outside\nEmail won a a W. A. M. U. dot org comments on our Facebook page or tweet us at one day\nLive from NPR News in Washington I'm Laurie London President Trump says US ambassador to the U.N Nikki Haley is leaving his administration at the end of the year Haley surprised many with her decision to leave\nBut as NPR's Michele Kelemen reports Trump is holding out the possibility that she may be back and she sat next\nTo the president and the oval office Nikki Haley was playing down her political ambitions no I'm not running for\nLive from NPR News in Washington I'm Laurie London President Trump says US ambassador to the U.N Nikki Haley is leaving his administration at the end of the year Haley surprised many with her decision to leave\nBut as NPR's Michele Kelemen reports Trump is holding out the possibility that she may be back\nAs she sat next to the president and the oval office Nikki Haley was playing down her political ambitions no I'm\nNot running for twenty twenty I can promise you what are we doing is campaigning for this one so I'll look forward to supporting the president\nIf she was effusive into was Trump who calls Haley a quote very special person adding that she told them six months ago she wants to take some time off\nHe says he will name a successor in the next few weeks before being tapped by Trump to serve at the un Haley was governor of South Carolina Michele ... NPR News the state department\nEvacuation orders are underway as hurricane Michel heads toward Florida's Gulf Coast officials say it's expected to make landfall as a major category three storm FEMA associate administrator Jeff ... says infrastructure damage in power outages can be expected\nMark was going to be a devastating storm\nBy Trump to serve at the un Haley was governor of South Carolina Michele ... NPR News the state department\nEvacuation orders are underway as hurricane Michel heads toward Florida's Gulf Coast officials say it's expected to make landfall as a major category three storm FEMA associate administrator of Jeff ... says infrastructure damage in power outages can be expected\nOr a K. Mart who's going to be a devastating storm that's real for the Florida is not finished all of this magnitude in quite some time\nBuyer and says it is a fast moving high surge storm with very very powerful wins\nAnd it could also produce tornadoes he warns damage to the power structure could be more significant than Florence emergency officials across the Carolinas they're also warning residents to monitor hurricane Michael which is likely to move through those states after coming ashore [noise]\nThe death toll from an earthquake and tsunami in central Indonesia has topped two thousand as NPR's Lauren Frayer reports from ... near the epicenter the government is ending the search for more bodies and ordering foreign aid agencies out\nCharities have been ordered to leave the quake zone immediately from now on they'll only be allowed to distribute aid through ...\nHurricane Michael which is likely to move through the states after coming ashore [noise]\nThe death toll from an earthquake and tsunami in central Indonesia has topped two thousand as NPR's Lauren Frayer reports from ... near the epicenter the government is ending the search for more bodies and ordering foreign aid agencies out\nForeign charities have been ordered to leave the quake zone immediately from now on they'll only be allowed to distribute aid through local partners there's been a rash of foreign aid here and some groups have complained of having to get government permits to operate\nIndonesia does not want to be seen as having to rely on foreign help and officials have stressed that they have enough relief supplies within the country\nMeanwhile there's a rush to recover bodies before Thursday after which the government says up to five thousand missing people will be presumed dead prayers will be held in three ... neighborhoods emerged in mud which will be declared national memorials Lauren Frayer NPR News ... Indonesia\nOn Wall street stock indexes have been mixed in early trading as markets continue to absorb the shake out from last week's rapid rise in interest rates currently the Dow is up thirty points the U.S and pay five hundred gained seven ... composite up forty four\nPeople will be presumed dead prayers will be held in three polish neighborhoods emerged in mud which will be declared national memorials Lauren Frayer NPR News ... Indonesia\nOn Wall street stock indexes have been mixed in her early trading as markets continue to absorb the shake out from last week's rapid rise in interest rates currently the Dow is up thirty points the S. and P. five hundred gained seven enough that composite up\nForty four this is NPR News\nLive from the ... pm newsroom I'm Marianne approaches this October marks the anniversary of the me too movement and domestic violence awareness month Candace ... ran reports on a program at the University of Arizona looking to combat domestic and sexual violence\nUniversity of Arizona's consortium on gender based violence provide education and support services for students survivors of sexual violence domestic and dating violence harassment and stocking Dr Molly I'm more of the consortium says that the me too movement has been helpful and changing the conversation about sexual violence\nPeople are talking about the nuances of sexual violence the fact that sexual violence exist on the spectrum\nSpectrum includes everything from bullying to harassment to section\nBush among gender based violence provides education and support services for students survivors of sexual violence domestic and dating violence harassment and stocking doctor in Mali and more of the consortium says that the me too movement has been helpful and changing the conversation about sexual violence\nPeople are talking about the nuances of sexual violence the fact that sexual violence exist on a spectrum\nSpectrum includes everything from ... to harassment to sexual coercion to rape she says there's also a greater cultural conversation under way\nSexual assault is part of a larger cultural fabric of male entitlement this idea that men are deserving of anything that they won whether it's the best job the seat at the table the loudest voice in the conversation or a woman's body\nMorris says recognizing these cultural patterns is a good first step and eradicating them ... Arizona Public media\nIs the registration deadline for Arizona's who want to vote and then of amber general election people who aren't already registered have until midnight tonight to do so county election officials begin sending out mail ballots tomorrow on the ballot or US Senate and owns nine U.S House seats and many more races to register online visit service\nSays recognizing these cultural patterns is a good first step and eradicating them Candace men are against ran Arizona Public media\nToday is the registration deadline for Arizona's who want to vote and then of amber general election people who aren't already registered have until midnight tonight to do so county election officials begin sending out mail ballots tomorrow\nOn the ballot are US Senate and on nine U.S House seats and many more races to register online visit service Arizona dot com I Marianna precious Arizona Public media\nSupport for NPR comes from NPR stations\nOr their contributors include the law firm Cooley L P with offices and the U.S Europe and China Cooley advises entrepreneur as investors financial institutions Amos Diablo two companies around the world where innovation meets the law\nSupport comes from vantage west credit union featuring full service business banking local decision making\nVantage west believes in having a strong investment in the community by helping Tucson businesses prosper learn more advantage west dot O. R. G. member and see you weigh sixty four degrees ... Tucson sixty in green valley and fifty nine up in Oregon we're expecting sunny\nSince ... companies around the world where innovation meets the law\nSupport comes from vantage west credit union featuring full service business banking local decision making\nVantage west believes in having a strong investment in the community by helping Tucson businesses prosper learn more advantage west dot O. R. G. member and see you weigh sixty four degrees ... Tucson sixty in green valley and fifty nine up an earth works pecking sunny skies today with an afternoon high about Seventy six\n... six good morning I'm John Weaver this is NPR eighty nine point one and one is pre recorded [noise]\n\n\nThis is one day I'm Joshua Johnson in Washington on October twenty twenty fourteen a teenager named liquid McDonald was shot dead by Chicago police officer McDonald was shot at sixteen times as he was moving away from police vehicles\nVideo of his death would go unseen by the public for more than a year and when the footage did come out it sparked protests across Chicago [noise]\nOfficer Jason Van Dyke was charged with first degree murder that\nKwon McDonald was shot dead by Chicago police officer McDonald was shot at sixteen times as he was moving away from police vehicles video of his death would go unseen by the public for more than a year and when the footage\nDid come out it sparked protests across Chicago [noise]\nOfficer Jason Van Dyke was charged with first degree murder that day\nLast week a jury convicted Van Dyke of second degree murder and sixteen counts of aggravated battery with a firearm\nWe find him guilty of aggravated\nBattery was fired\nFirst we find aggravated battery\nShy and then they they only of aggravated battery fire\nThere's one\nBattery count for each bullet the conviction surprised many people Van Dyke is the first Chicago police officer in fifty years to be found guilty of murder the verdict led some to wonder if this marks a new period of accountability for police\nOfficers and police departments [noise] use change\nWe found him guilty\nOf fire\nOne\nBattery count for each bullet the conviction surprised many people Van Dyke is the first Chicago police officer in fifty years to be found guilty of murder diverted led some to wonder if this marks a new period of accountability for police\nOfficers and police department [noise] is change on the horizon\n[noise]\nAnd what does this verdict mean for police reform around the country [noise]\nJoining us from W. B. easy Chicago public media is it's criminal justice reporter Patrick Smith\nHe's covered the clown McDonald's case since the beginning and he is also hurting WB easiest pod cast on the case called sixteen shots Patrick welcome to want to say thanks for having me\nAlso with us judge la Doris Cordell she is retired from California superior court system\nAnd is the former independent police auditor in San jose California judge Cordell welcome that to be is also with us from WIP our public radio in Baltimore Neal Franklin is a retired major from the Maryland state police department\nCurrently he's the executive director of leap\nHold sixteen shots Patrick welcome to want to say thanks for having me\nAlso with us is judge la Doris Cordell she is retired from California superior court system\nAnd is the former independent police auditor in San jose California judge Cordell welcome that did they also with us from WIP our public radio in Baltimore Neal Franklin is a retired major from the Maryland state police department\nCurrently he's the executive director of leap law enforcement against prohibition it's a nonprofit focused on improving relations between police and the public Neal glad to have you with us\nThank you Joshua Russell glad to include your questions and thoughts about improving law enforcement whether you are a law enforcement officer and activists working for reform or just a citizen in a community that's dealing with this issue what's the conversation like where you live and what are you seeing that works or does not work\nIn rebuilding trust email us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one day Patrick Smith let me start with you\nWhat's the conversation like where you live and what are you seeing that works or does not work in rebuilding trust email us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one day Patrick Smith let me start with you\nLearn more at United Way Tucson dot O. R. G. sport also comes from Monterrey court the restaurant music and arts venue with shows six nights a week\nThis Wednesday October tenth will be the ... slide blues of Appalachian artist you like cook reservations and more are at moderate court ... dot com or to zero seven to four to nine\nIt's sixty four degrees in midtown Tucson sixty in green valley in fifty nine up in Oregon we're expecting some of these guys today with an afternoon high about Seventy six it's nine twenty\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise in customer service contract to locate her and more information or at bona dot com\nSixty four degrees in midtown Tucson sixty in green valley in fifty nine up on our own were expecting some of these guys today with an afternoon high about Seventy six it's nine twenty\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contractor locate her and more information or at bona dot com\nAnd from at last in a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at ... dot com\nIs one a I'm Joshua Johnson we're discussing the verdict in the ... on McDonald's case that was a teenager who was shot dead in Chicago by officer Jason Van Dyke we'd love to hear from you whether you're in Chicago or anywhere across the country with regards to what this means\nFor the effort to improve law enforcement in this country comment on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org let me get to a few of your comments before we keep going Nick is in Wilmington North Carolina\nIn the ... on McDonald's case that was a teenager who was shot dead in Chicago by officer Jason Van Dyke we'd love to hear from you whether you're in Chicago or anywhere across the country with regards to what this means\nFor the effort to improve law enforcement in this country comment on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org let me get to a few of your comments before we keep going Nick is in Wilmington North Carolina\nMake rights I'm In North Carolina and the G O P state super majority pushed a bill through last year to not release any body camera footage to the public except for family members involved to view if I could make one law to increase miss trust with the public this would be the one\nBe Sean rode on our Facebook page maybe the real issue here is that the criminal justice system in general and law enforcement in particular are being deployed to manage the effects of social and economic problems that they are ill equipped to resolve\nAnd Seth wrote on our Facebook page as a white person who works in an office that staffs mostly black people hearing stories of police shootings scares me that one day I might lose a loved co worker just because of their skin color when I found out they found this man guilty I was elated it's time for bed\nThe system in general and law enforcement in particular are being deployed to manage the effects of social and economic problems that they are ill equipped to resolve\nAnd Seth wrote on our Facebook page as a white person who works in an office that staffs mostly black people\nHearing stories of police shootings scares me that one day I might lose a loved co worker just because of their skin color when I found out they found this man guilty I was elated it's time for bad cops to stop being protected killers\nJust go do I Know I had to cut you short before we pause my wonder if we do pick up with sets comment and finding officer Van Dyke guilty it seems rare that officers are convicted after shooting someone under questionable circumstances what's the legal reason behind that\nWell there is a decision from the United States Supreme court that really is the\nKey to all of this and that is the decision that the court made many years ago Graham case that basically said that when you are determining whether or not an officers engaged in the use of excessive force in much basically take the in the state that\nThat the steps of the state of the officer so it's a very subjective standard\nWell there is a decision from the United States Supreme court that really is the\nKey to all of this and that is the decision that the court may many years ago when the Graham case that basically said that when you are determining whether or not an officers engaged in the use of excessive force you must basically take be in the seat the\nThat the steps of the seat of the officer so it's a very subjective standard what would a reasonable officer have done\nIn that situation so it is not an objective look is what is the officer feeling what is the officer seeing\nWhat is the officer experiencing so that's what the jurors are required to do and as a result you find very few judgments first of all you know in in civil ensuing\nPolice departments are jurors have to again how hold the standard and prosecutors before they decide to to charge an officer have to look at the standard and say what would\nAn officer reasonable officer in that situation have done so it is the Supreme Court that has set\nThis rule for all law enforcement agencies in the country and there were over Eighteen thousand separate police\nSuing police departments are jurors have to again how hold the standard and prosecutors before they decide to to charge the officer have to look at the standard and say what would\nAn officer reasonable officer in that situation has done so it is the Supreme Court that has set this world for all law enforcement agencies in the country\nAnd they were over Eighteen thousand separate police departments throughout the United states they all have different rules but they are all under the umbrella of whatever the Supreme Court set of that is the rule that is out there now\nYou were by the way referring to the keys is Graham versus Connor Institute's from Nineteen eighty nine and some of you actually commented with regards to what's going on in officers mines like Peter Peter emailed\nIt seemed like to do with the mentality of police officers that their life is paramount beyond all else including their safety I feel like whenever they are threatened with any sort of possible harm the used deadly force in the new somehow justified\nThis is a career in which they signed up for similar to the military were they know they're going to be put in harm's way to protect and serve the are paid for this\nLet's add one more voice to our conversation before we get to some more of your\nOfficers mines like Peter Peter emailed it seemed like today was the mentality of police officers that their life is paramount beyond all else including their safety I feel like whenever they are threatened with any sort of possible harm they use deadly force and it is somehow justified\nThis is a career in which they signed up for similar to the military where they know they're going to be put in harm's way to protect and serve they are paid for this\nLet's add one more voice to our conversation before we get to some more of your comments joining us now on the line is Shannon Spalding the Chicago police officer who was also a whistle blower within the department who worked undercover with the FBI Shannon welcome to the program\n[noise] think he'd show I\nKnow I understand you had been working as an FBI informant within the department and as a result of what happened that caused some of your fellow officers not to be too fond with you what what happened that caused such stirred did it have to do with with corruption inside the Chicago police department\nAt ... I was working as an undercover narcotics officer with the FBI and um I had discovered that some of my fellow officers were actually involved and the money that are kind of trade wet and the Chicago area\nThe officers not to ... to fond with what happened the cause such a store or did it have to do with with corruption inside the Chicago police department\n[noise] absolutely Joshua I was working as an undercover narcotics officer with the FBI and um I had discovered that some of my fellow officers were\nActually involved and the runny the narcotics trade with and the Chicago area and\nTherefore I began\nAnd operation dubbed operation brass tacks against some of my fellow officers who\nI used the term officer loosely because if you are on the other side of the law you are really not an officer but they did have badges and ultimately that\nLed these officers wanted them being Abbas to go to federal prison and that made me very unpopular\nAmong the rank and file within to Chicago police department because before I came forward with operation brass tacks the code of silence\nWas unheard of you didn't talk about it\nAnd ultimately that\nLed these officers one of them being a bus to go to federal prison and that made me very unpopular among the rank and file within to Chicago police department\nBecause before I came forward with operation brass tacks the code of silence\nWas unheard of you didn't talk about it it didn't exist\nA they tried to label man it's crazy for believing that this was actually going on within the ... the department so it made me very unpopular and lead to a lot of police retaliation\nI Wonder why that is from your\nPerspective I mean I Can't imagine I've never been a law enforcement officer have law enforcement in my family but I've never taken an oath so I Can't I'm speaking as an outsider\nBut I Would think you know if I knew that there were reporters who worked for my station who were lying in stories and they got caught I Would be grateful to see them go because drugs all of us now why do you think it's not a similar mentality in law enforcement\nYou know honestly a lot of police officers dead approach man they still talk to me and\nBut I've never taken an oath so I Can't I'm speaking as an outsider\nBut I Would think you know if I knew that there were reporters who worked for my station who were lying in stories and they got caught I Would be grateful to see them go because drugs all of us though why do you think it's not a similar mentality and law enforcement\n... honestly a lot of police officers dead approach man they still talk to me and you are correct on us police officers absolutely do not want to work alongside with corrupt officers however the code of silence\nIs so strong within the Chicago police department and I feel that does go across departments nationwide that officers actually\nFear what will happen to them if they break this code of silence and\nWhat was interesting to discover during this journey of\nBreaking the code of silence is that there is this common misconception that it's a blue officers blue shirt common St officers going against other officers when actually I learned\nDear what will happen to them if they break this code of silence and what was interesting to discover during this journey of\nBreaking the code of silence is that there's this common misconception that it's a blue officers blue shirt common St officers going against other officers when actually I learned that the retaliation came from the top down\nBosses were actually\nInstructing the officers who were working with me not to back me up\nOr they would be the next Shannon Spalding so out of fear of becoming me out of fear of retaliation themselves or putting their lives in danger losing their job what could happen to them they complied\nBecause they it it's easier it's easier than going through everything that I had to go through and even though officers didn't\nWant to they felt they had to I had officers come up to me and say you know I Believe in what you're doing but I Can't be seen ... because I'll be next\n... let me play a clip from the president of Chicago\nOr putting their lives in danger losing their job what could happen to them they complied because they it it's easier and easier than going through everything that I had developed through and even though officer didn't\nWant to they thought they had to I had officers come up to me and say you know I Believe in what you're doing but I Can't be seen talking here because I'll be not\nWell let me let me play a clip from the president of Chicago's fraternal order of police Kevin Graham this what do you have to say after the conviction of officer Jason Van Dyke this clip comes from WB easy pod cast on the McDonald's case called sixteen shots here is Kevin ...\nWhat I Do I Do believe some of the politicians I think that\nOver the last several years the interviews this case one face and I want to remind everybody we answer millions of dollars every every every year and they've used this case to really check around the Chicago police department which has been unfortunate because I'm going to tell you this and\nThe men and women of the Chicago police departments are some of the finest police officers in this country\nTake seriously\nOne face and I want to remind everybody we answer millions of dollars every every every year and they have used this case to really check around the Chicago police department which has been unfortunate because I'm going to tell you this and\nThe men and women of the Chicago police department or some of the finest police officers in this country\nTake seriously\nWhat they do and they try and provide the best protection they can for people in the city of Chicago\nSixty four degrees midtown Tucson sixty in green valley also sixty in Sierra Vista and sixty two Benson\nWe can expect drier conditions with a modest warming trend today and tomorrow with daytime temperatures remaining several degrees below normal increasing moisture from tropical storm surge you all spring more showers and thunderstorms much of the region late this week into the weekend\nProvide doctors access to your medical history better help exhale sixty four degrees midtown Tucson sixty in green valley also sixty in Sierra Vista and sixty two Benson\nWe can expect drier conditions with a modest warming trend today and tomorrow with daytime temperatures remaining several degrees below normal increasing moisture from tropical storm surge you all spring more showers and thunderstorms much region late this week into the weekend for today we can expect sunny skies with an afternoon hype about Seventy six\nClear in fifty two overnight tonight\nSupport for NPR comes from this station and from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself at visit main dot com\n[noise] from logged me in makers have go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more it go to meeting dot com\n[noise] and from the William T grand foundation at W T grant foundation dot org\nA quick heads up about our conversation on tomorrow's program about climate change the world is talking about a new\nVisit main dot com from log me in makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learned more it go to meeting dot com\nAnd from the William T grant foundation at W T grant foundation dot org\nA quick heads up about our conversation on tomorrow's program about climate change the world is talking about a new report by some of the most renowned climate scientists putting a finer point on just how little time we have to do something about our warming planet\nThe report states that we have until about a year twenty forty before we reach a point of no return it also gives reason for hope that we have the skills to do something if we work together\nWe want to answer your questions about what it would practically take to fight climate change leave us a voice mail eight five five to three six one a one a\nWe'd also love to know what you're working on to fight climate change in a big way tell us your story eight five five to three six one a one a or you can use our app won a vox pop to send us a high quality audio file and to keep up to date on fuel\nTo answer your questions about what it would practically take to fight climate change leave us a voice mail eight five five to three six one a one egg\nWe'd also love to know what you're working on to fight climate change in a big way tell us your story eight five five to three six one a one a\nOr you can use our app won a vox pop to send us a high quality audio file and to keep up to date on future topics you can find one a vox pop V. O. X. P. O. P.\nIn the app store and we'll share some of your questions and stories tomorrow on one day\nBack now to our conversation with Neal Franklin Shannon Spalding Patrick Smith and judge la Doris Cordell let's get some more of your comments before we start kind of looking forward at where the effort to improve policing in America might be going\nHey sailor tweeted the reasonable officer standard is a very easy standard to apply it's not that hard we do need to eliminate the criminal justice college major and higher police with degrees in psychology or sociology too many cops have no business carrying a badge and the gun however\nGalvin had these questions Calvin writes the question is what is reasonable\nWhere the effort to improve policing in America might be going\nHey sailor tweeted the reasonable officer standard is a very easy standard to apply it's not that hard we do need to eliminate the criminal justice college major and higher police with degrees in psychology or sociology too many cops have no business carrying a badge and the gun however\nGalvin had these questions Galvin writes\nThe question is what is reasonable\nDoes disobeying a police officer shouting orders constitute the right to use deadly force does a drug dealer running away from the police deserved to be shot\nWhile they may be criminals or the actions from the police equivalent to the criminals actions judge Cornell maybe you should respond to golf and how do we suss out in a finer sense what reasonable mess is\nSaid well this is in the eye of the beholder it really has no one definition and what jurors are required to do is put themselves in the shoes of the officer\n... what was the officers thing and often times incidents happen and you know just a matter of a few seconds so it really is not one definition of it\nReasonable reasonable illness is in the eye of the beholder it really has no one definition and what jurors are required\nTo do is put themselves in the shoes of the officer\nOr what was the officers being experiencing and often times incidents happen and\nYou know just a matter of a few seconds so it's there really is not one definition of it but but I Do want us to get to something you said Joshua about you know looking ahead I Believe it's time to we imagine policing in America\nPolicing in America today is is quasi militaristic and police departments officers are seen as an occupying force especially in communities of color and in low income community if that's not how policing started in this country\nPolicing started with individuals who lived in a community who knew everyone and they were people who were not seen as an occupying force there were people there to basically provide a service and help the individuals in the community and it has dramatically changed we have police departments armed to the teeth\nWith tanks and all kinds of of the equipment\nIncome communities that's not how policing started in this country\nPolicing started with individuals who lived in a community who knew everyone and they were people who were not seen as an occupying force there were people there to basically provide a service and help the individuals in the community and it has dramatically changed we have police departments armed to the teeth\nWith tanks and all kinds of of the equipment that uh are commonly used in the military and I think it's time to to change this whole thing we need to start thinking outside the box why do we need police officers to basically\nA patrol and and take care of traffic issues why can't that come from within the humidity why can't individuals' community members somehow the deputy ties to to deal with with those kinds of things that the minor kinds of things that are happening in the community\nMuslim somebody's ... and I'm not disagree with your just by way of comics or some places we're a lower level of sworn more enforce off or worse when officer does deal with things like parking enforcement and traffic enforcement things that are less likely to require deadly force\nSure but but but my point is that that are are\nCommunity members somehow the deputy ties to to deal with with those kinds of things that the minor kinds of things that are happening in the community\nMuslim somebody's ... disagree with you just by way of conflicts there are some places we're a lower level of sworn more enforce off or worse when officer does deal with things like parking enforcement and traffic enforcement things that are less likely to require deadly force\nSure but but but my point is that that our our whole attitude and this is even within police departments they see themselves as this you know kind of a militaristic force\nAnd and they they do have a command structure and ... and and so what I'm saying is that maybe it's time now to say let's pull back from this whole image we have of police being occupiers and look at a different\nModel entirely I'm not opposed to criminal to criminal justice reform but look what happened\nWe we get body cameras and what what happens while we have officers who oh don't turn their cameras on or we have places like Chicago where it takes more than a year and a court order\nTicket footage out on that for example in liquid shooting so that that the whole lack of transparency policing for example has\nLook at a different model entirely I'm not opposed to criminal to criminal justice reform but look what happened\nWe we get body cameras and what what happens while we have officers settled oh don't turn their cameras on or we have places like Chicago where it takes more than a year and a court order ticket footage out on for example in liquid shooting so that that the whole lack of transparency\nPolicing for example has very little sunshine\nThere's very little sunshine and policing we don't get to know who these officers are their track record their history they're disciplined history it's very very difficult to get that information and state\nI think the ... with the comment that one of our listeners left for us Reggie who lives in Maryland with this in our inbox\nI talked to police both black and white and uh they seem to have this new look thrifty approach to the community I haven't had experiences where you know police just simply\nYou know would rather have conflict with a with community rather than actually serve it I really think that they should you know take away the guns for the first couple of months that leads to buy the inside of the community without guns make them stand community the force you to have a dialogue with\nBlack and white and uh they seem to have this new electricity approach to the community I have an experience is where you know we just simply you know would rather have conflict with ah with community rather than actually serve it I really think that they should you\nKnow take away the guns for the first couple of months but at least two but she is out of the community without guns make them stand the community to force you to have a dialogue with the community I think it'd be a little a lot better uh with serving a community\nWhere did you thanks for calling in and sharing your thoughts with us Neal Franklin I Love you to respond to that but if I could first\nIf we could contrast what Reggie said with another set of comments that we've gotten from some of our listeners like what's scholar Rhodes Scholar writes\nPolice put their lives on the line every day protecting our society Ninety percent nine zero percent of the cases put forward by activists as examples of police brutality involve people not complying why is the outrage not centered around these individuals behavior that got them shot\nIf a cop breaks the law out convict them but if there's any doubt I'm siding with the police one hundred percent of the time Neal what would you say to folks who said that police work is inherently difficult inherently dangerous\nOur society Ninety percent nine zero percent of the cases put forward by activists as examples of police brutality involve people not complying why is the outrage not centered around these individuals' behavior that got them shot\nIf a cop breaks the law I'll convict him but if there's any doubt I'm siding with the police one hundred percent of the time\nNeal what would you say to folks who said that police work is inherently difficult inherently dangerous potentially deadly and then we as a public also have a role to play in easing the tension that officers feel about just being able to get home at night\nSo I Believe it was Reggie that left a message yes um\nYou know that was such a brilliant comment because forcing the dialogue seat when you develop a relationship with those people you are serving the citizens who are serving\nAnd you get their support your job doesn't isn't as dangerous as it is today it you know going back to what the judge Cornell said um\nHow it used to be having relationships walking up and down the street talking with citizens talking with the neighbors when something happens they support you when you have those relationships but when you have this\nA relationship with those people you are serving the citizens who are serving and you get their support your job doesn't isn't as dangerous as it is today it you know going back to what the judge Cordell said um\nHow it used to be having relationships walking up and down the street talking with citizens talking with the neighbors when something happens they support you when you have those relationships but when you have this occupying force\nWere you know none of the people are very few of the people were the ones that you do know there's conflict on the under ... on the other end of that relationship\nThat's a problem this goes to community control policing that I mentioned before\nWhere the community sets the philosophy where the community sets the budget for those in uniform where the community\nDecides who the the leader is going to be whether you call them achieve for commissioner or whatever where the community decides what's important with the community decides you know what we can handle these issues that the ground level\nWe just want you to pay attention to people hurting other people and this is how we want you to do that\nBut policing is very political it's political through the unions it's political through the ...\nThe where the community sets the budget for those in uniform where the community decides who the the leader is going to be whether you call them achieve for commissioner or whatever where the community decides what's important where the community decides you know what we can handle these issues that the ground level\nWe just want you to pay attention to people hurting other people and this is how we want you to do that\nBut policing is very political it's political through the unions it's political through the mayors and governors and we'll never get to that place into the community decides they come together and say we want control over our police departments and this is how we want to do it\nHaving that oversight at the beginning means that you don't need police review boards at the end when something goes horribly wrong\nIs speaking of which we got some ideas from some of you about what could be done with regards to policing and review boards were part of it including on a larger scale\nSpeaking of which we got some ideas from some of you about what could be done with regards to policing and review boards were part of it including on a larger scale", "show_name": "1A Plus", "year": "2018", "city": "Tucson", "day": "09"}