{"month": "10", "state": "FL", "station": "WHNZ", "content": "I especially like\nThe liver protective heart protective and joint modifying properties of this stuff the liver is our greatest detoxify Oregon and we know that we're constantly bombarded by toxins in the environment so we need a functioning super healthy very strong liver\nAnd we know that Kirk human protects the liver at detoxify deliver it keeps it strong\nFrom a cardiac standpoint it's highly beneficial for the heart it's very good for maintaining healthy cholesterol and healthy platelet levels\nAnd from a joint standpoint we have in numerous ... studies showing overall improvement in joined health and relief and stable inflammatory activity better joint mobility as a result of taking ...\nI like the brain protective studies as well I think everybody wants a sharper clearer mind and curriculum and deliver resolve this so I regard it as one of the single most important things that you can put in your body and I'm very well aware pat but most people are not going to eat enough rock tumor Rick route\nTo get the benefits that they should and that they can get from a concentrated curriculum and extract\nScrews I don't want to get to technical here but these ... oxygen green tea or classified as police females and there really aren't super powerful and well respected by scientists but in his green T. C. R. formula there's more it's got the green tea it's got the Turk human the risk variants world we talked about\nClass grape seed extract pine bark bio flab annoyed vitamin C can you talk to me about this a re a really super anti accidents and poli sci fi knows that you put into formula\nOkay we really really developed in the fish and comprehensive program here grape seed extract in pine bark extract both contain a group of highly specialized antioxidant compounds that not only do much of what I've already described\nBut also enhance the physical integrity of tissue in the blood vessels and the skin so we put those in there for extra boost in antioxidant activity additionally the bio flab annoyed and hence the overall activity of vitamin C.\nAnd vitamin C itself is one of the most important nutrients that we can possibly take in so I Would say that we were very very thorough when we went through what could be in this product we said you know what would happen if we put in grape seed extract pine bark extract ... noise and vitamin C.\nWe realize that we would have an utterly superior formula and just to reiterate pat I Want people to experience dynamic health and this formula the green tea see our will make you feel great and that's the purpose of it\nNot Christian I Love this green T. C. R. combination formula and remember the ... for for human and re spiritual what kind of results can people expect to see what can they expect to see a once they start taking this formula\nI think that people will feel greater joint mobility and comfort I think they'll feel\nMore energy because these ingredients also help to stabilize and maintain natural healthy blood sugar control\nI think they'll have more sustained energy throughout the day and I would just suspect that people will have an experience of greater vitality when you detoxify the body when you have a more highly functional immune system\nYou just feel more energy and better overall it's kind of you know like those days when you get up and go wow I feel great this is a while I feel great formula\nNow Chris the green tea see are limited history to provide you bought three cups words the green tea and each to cancel serving plus you get the anti accident with one of several servings of fruits and vegetables plus\nYou get the respect for troll equivalent of several servings of red wine ended the joint comfort in brain function benefits to the Kirk human I mean why are all in one formula in the last two minutes talk to me about these short cut to better health and why you want everyone listening to this program to call now\nFor that complimentary bottle of green tea see are\nOkay fortunately there isn't the man's body of science that it's been growing steadily for the past Twenty years and it's really rich science now\nWe know that of the various plant derived substances that exist green tea extract Kirk human extract and resveratrol extract or at the absolute top of the list of protective vitality and and seeing overall health promoting compounds there just isn't anything like these\nThere in the green tea CRC our standing for ... product in meaningful amounts people will take this product it will be rapidly broken down in the system very well absorbed they're going to\nFeel the difference you're going to feel energy you're going to feel more vitality or just plain going to feel better kind of more fluid and in that flow of good health so I Want people to experience that and given that they can get a free bottle I'm also not saying that put yourself at great risk and spend a lot of money I said no try it free\nLet the product speak for itself\nChris Jones was always fascinating information we appreciate your insight thanks so much\nThank you pat it's always a pleasure to speak with you\nThere is any credible free bottle offered today I'm sure these amazing new Greenpeace ER super formula here's the deal all purity products right now I'll be one of the first thousand polish today just four Ninety five for shipping which is one hundred percent refundable attorney general ... complimentary bottle of green tea she are formula\nFor you to put to the test you try you'll be the judge it's that simple Gertie knows that once you experienced the benefits of ... you're not going to want to miss a day of taking it that's why they're willing to send you a free bottle today she'll call right now operators are standing by dial one eight hundred\nFor nine nine seven five zero five that's one eight hundred\nFor nine nine seven five zero five\nGreen G C R delivers a potent combination of green tea\nPlus ... bc um Ninety five Kirk human and ... in one easy to take liquid soft jumps do it for your energy level you're focused metal clarity your cardiovascular health to support healthy dieting immune defense joint comfort and so much more to claim your complimentary bottle call now one eight hundred\nFor nine nine seven five zero five\nOne little catch this re bottle offer is not available in stores and you won't find it online either only through purity products by calling this number today limited one free bottle per household please call now one eight hundred one nine nine seven five zero five one last time those ready to down slowly here we go\nOne eight hundred\nFor nine nine seven five zero five call now [noise]\nThey're proceeding was an advertisement by purity products these statements have not been evaluated by the FDA this product is not intended to diagnose treat cure all prevent any disease\nThe proceeding was paid program paid for by purity products the opinions viewpoints and promises made during the proceeding program or not those up W H ... am its staff management or parent company I heart media incorporated\n[noise] na\nNa\nIt's all went\nYou can listen taught our for our radio and\nComputer games and New York times best selling author AJ Jay Gould about how we are all family like it or not the way that\nI had to find family is you know we are surrounded by people in our lives that we consider cousins and close close loved ones that are closer to us and\nHe's the news on the hour sponsored by their works release\nAbout from the table I shook his hand unless it's or the interviews over we won't be offering you a job but I think you for coming in then I interview another guy same questions he's doing a pretty good job and when I lean in and ask him my little trick question how do you feel about selling customers things they don't need\nThis guy did hesitate\nTo kind of dropped his head and then he looked back up and then he looked back down and then he said\nI can do it and if I'm being honest I have done it\nCompany that I worked for required that I bring back a certain dollar amount on every single call that I went on sometimes they didn't need anything but if I didn't sell them anything I was going to lose my job and man I got kids to feed\nBut then I got to thinking am I setting the right kind of example for my kids so I had to quit and now I'm unemployed and the market is flooded with heating and air conditioning technicians and it's been hard to get a job\nThat's an example of the type of competitors we have out there guys\nI told stories in interviews about heating and air conditioning companies training there technicians to jump wires on two thousand dollar compressors to sell new systems like crossing wires over to break them and there are hundreds of heating and air conditioning contractors in this area last time I checked\nAnd chances are pretty good that a technician like the one in the story it's going to be coming to your home or your neighbor's home\nYou know you might look down the street today and see an air conditioning technician a heating technician and it might be that guy I'm certain that he didn't decide to quit the heating and air conditioning is this just because I wouldn't hire him and remember there's more guys were that guy came from\nHe got his training at one of those unprofessional heating and air conditioning companies\nThat listen we'd go out to customers houses all the time that have air conditioners with corroded coils or blowers that are all credit up and we have to help them out in that predicament I mean for crying out loud [laughter] that's what we do we make furnaces heat pumps\nAn air conditioners last longer we lower energy bills we give you cleaner fresher error we increase Airflow we make systems run quieter and cost you less money to own\nAbout we're not going to try to sell you something you don't need\nOkay\nNow look in about two to three minutes I'm going to open up these phone lines just be one of the first five people to\nText a message to the number three six to six\nZero okay oh you got to do is put in the message HVAC one and I'm going to do your entire system both heating and cooling not for the two hundred and fifty two dollars we normally charge\nBut for free that's right F. R. E. E. free\nNow I only do this on the radio and I'll tell you why because I Can't send a minimum wage worker to your house for free and make any money at all frankly the U.S government the IRS says that it cost fifty three cents a mile last time I checked to send a vehicle to your home just in gas and wear and tear\nAfter that there's the technicians wages the chemicals and check the ordinary cost of doing business so we're talking about a loss on this first appointment coming out and doing it for free\nOkay why would we do that well here's what we get out of the\nDeal ... federals I Can't tell you how many times it's happened where customers have become huge cheerleaders even before we're done there running around telling their neighbors making calls to family members and say you've got to try these guys out\nThat enthusiasm is why the average radio customer provides us with three to seven referrals folks'\nBusiness people out there what's referral or a new customer worth to you\nIf your furnace or your air conditioner goes out and you call a friend or relative and you say hey I've got this furniture air conditioning problem who do you use for your air conditioner and they say you got a call freedom heating and cooling they did the best maintenance we have ever\nHad at that point are you going to go play Google roulette of course not you're going to take the advice of your friend or your neighbor or your church buddy or your relatives because the company they're recommending served them well\nThat's the power of doing things right for people that's the power of doing a good job customers seeing appreciating it and then spreading the good worried about your business\nNow look I'm going to give this two hundred and fifty two dollar total system rejuvenation away for free right now to the first five callers freedom heating and cooling is going to pay for it all we ask is that if we do a good job for you that you've considered becoming a regular client and\nYou tell other people about us that's fair right okay\nYou have to be one of the first five dollars so grab your telephone so that you can get the number\nIf you're one of the first five people to text the letters H. I. V. A. C. one to three six to six zero you'll get a message saying that your winter and the link to schedule you're appointed all you've got to do is click that link reserve you're spot and\nYou're all done okay you don't have to put it in a credit card or anything like that you aren't charged a thin dime until we come out and finish the work I'm going to give the first five away right now so here's the number are you ready all you got to do is be one of the first five people\nTo text H. I. V. A. C. one two three six to six zero text HVAC one to three six to six zero just type HVAC one in the message box and send it to three six\nTo six zero I think we've only got three of them left okay three of the five so text HVAC one\nTo the number three six to six zero HVAC one\nTo the number three six\nTo six zero I think you've got one left to give away so beat your neighbor to the Bronx okay just text HVAC one\nTo the number three six to six zero put HVAC one on the message box set it up three six to six zero\nNow here's the deal folks here's what you're going to experience when I send one of these guys out\nFirst off he's going to park his truck in the street\nNow while our fleet is meticulously maintained this is just a precautionary measure that's going to keep future leaks where they belong away from your driveway okay\nWhen he comes up to your front door he's going to knock on the front door and when you invite him and he's going to reach down and put on floor savers or shoot covers over his shoes or boots\nHe's going to start his own voice and then he's going to ask you to see the thermostat he's going to ask if he can quickly click it on and when he does he's going to make sure that the system is actually working\nAfter he turns it on he'll then ask you to show him to the outdoor air conditioning unit and then the indoor heating unit and once he's seen those he'll go get to work\nNow his very first task is to remove the top\nOff of the outdoor air conditioning system after that he's going to get the leaves and sticks and mark and debris out of the bottom of the system because all of that stuff holds water when it rains it's going to rush the bottom of your system out prematurely okay so we're going to get all of that junk out of there\nThat alone is going to extend the life of your outdoor unit\nThe next step in my opinion is the best okay we're going to use a semi high pressure nozzle to spray down your out door coils from the inside out\nNow that's going to force all the leaves and grass clippings in dust and whatnot that has been sucked into it over the last six months back out of the coils it's almost like lifting a sweater off of your air conditioning system now\nImagine you are I listeners jogging on a hot summer's day with a sweater on and is drawn your mouth\nYour body can't release the heat right so you get really really hot\nWell the same thing happens to your outdoor air conditioning unit and your indoor unit if it's dirty it's going to overheat you're going to have a compressor failure you're going to have motors fail sometimes we even have to use the booming cleanser to get all that stuff out\nYou're looking at a good forty five minutes just up to this point so can you see now why I say that the other maintenance is our drive by maintenance as if they're there and gone in forty five minutes\nOr maybe I said something in the last five minutes that resonated with you and do you want to make sure that your ducts or not creating a financial or health liability\nHave must come out for the total system rejuvenation for you and we'll do it ducked pork inspection and pressure test at the same time and give it a grade for you it could seriously change your life I Know getting my ducks system sealed up really changed mine\n\nHey let's give it another five of these two hundred and fifty two dollar super tune ups away for free okay if we sound like the company you'd like cleaning up your furnace in the air conditioner or heat pump get in on the best offer we have right now\nJust be one of the first five people to text a message to the number three six to six zero okay oh you got to do is put in the message HVAC one okay so ... the number three six to six zero and put in the message\nH. I. V. A. C.\nOne do right now we've opened up the offer I think we've got three left you don't even have to put it in a credit card okay you're going to give a link back it's going to allow you to reserve your time and then you're done it takes less than sixty seconds okay you're not charged a thin dime until we come out and do the work OK\nTakes less than sixty seconds just send a text to the number three six to six zero input H. B. A. C. one and the message okay boy your phone out\nThree six to six zero text to that number\nH. I. V. A. C. one H. B. A. C. one\nI think we've got one left okay so ... the number three six to six zero that's where you're sending the message and put it in the message box\nH. I. V. A. C.\nOne okay you're going to get a link back you'll be able to schedule your appointment bam right through text okay technologies fantastic isn't it\nIf you're just tuning in I'm Jean and I'm your host over for the next twenty five minutes or so and I'm going to help you save money on the greatest consumer of gas and electricity in your house this is your home for tips and advice on how to keep your furnace and air conditioner or eat bump\nRunning like a top and the show was brought to you by freedom heating and cooling\n\nAll right let's talk about your indoor blower wheel the squirrels cage the hamster wheel the blower we'll whatever you want to call it that's the part that's responsible for pushing the warm or cold air out of the vents in your home\nNow all the air in your home from floor to ceiling from one into your house or the other it goes through your furnace and air conditioning system over one hundred times a day\nAnd because most people don't have really good filtration systems those blower wheels they tend to get a little bit of build up on them and a lot of times we see a good eighth of an inch of build up on them\nThat's about as thick as to corners stacked right on top of one another\nNow when that happens your system just can't move the appropriate amount of air\nNow just one thirty second of an inch will reduce your air speed by twenty percent if that blower wheel gets kinda nasty if it gets just a little bit of build up on it\nThat will show the whole life right out of your heating and cooling system and if you're lucky you'll be forced to spend twenty five hundred dollars on a new heat exchange or or compress are\nIf you're not so lucky you could never wake up again\nDid you know that cracked heat exchange yours leak carbon monoxide into your air stream did you know that according to the CDC someone dies from carbon monoxide poisoning every day in the United states\nDid you know that over fifty percent of the people that survive a one time carbon monoxide poisoning event will suffer long term side effects for the rest of their lives\nHeart problems neurological problems nervous system damage mental illness personality and behavioral changes loss of muscle function and loss of bladder control I mean the list is truly scary\nWhat if that was you are one of your family members you probably didn't realize that you're blow her for you and your furniture air conditioner getting dirty could kill you did you\nLook at that lower wheels dirty my technicians will pull it out and they'll show it to you and they'll say look we've got to get this cleaned up and taken all apart and that's above and beyond what you'd normally do in a total system rejuvenation that's restoration work\nBut when we get it put back together you can get more air flow it's going to ... better you're going to have cleaner fresher air you're gonna have a lower energy bills I mean that's what it's all about folks\nHey you want another reason to get your heating and air conditioning system tuned up\nHave you ever heard of Louisiana State university\nWell they did a study that compared electrical usage of a dirty heating and air conditioning system to clean heating and air conditioning equipment and what they found was that the average customer with a clean system just one system in their house clean one\nSaved thirty two dollars and Seventy cents a month on their energy bills\nThirty two dollars and Seventy cents a month that serious now look\nIn about two to three minutes I'm going to open up these phone lines just be one of the first five people\nTo text a message to the number three six to six zero okay you've got to do is put in the message HVAC one and I'm going to do your entire system both heating and cooling not for the two hundred and fifty two dollars we normally charge\nBut for free that's right F. R. E. E. free\nNow I only do this on the radio and I'll tell you why because let's face it I Can't send a minimum wage worker to your house for free and make any money at all\nFrankly the U.S government says that it costs to fifty three cents a mile last time I checked to send a vehicle to your home just in gas and wear and tear\nAfter that there's the technicians wages the chemicals and check the ordinary cost of doing business so we're talking about a loss on this first appointment coming out and doing it for free\nWhy would we do that well here's what we get out of the deal\nGet referrals I Can't tell you guys how many times it's happened were customers have become huge cheerleaders even before we're done there running around telling their neighbors making calls to family members saying you've got to try these guys out folks that enthusiasm\nWhy the average radio customer provides us with three to seven referrals now that's the power of doing things right for people that's the power of doing a good job customers seeing it appreciating it and spreading the word about your business\nWell look I'm going to give us two hundred and fifty two dollar total system rejuvenation away right now for free that's right free so grab your telephone so that you can get the number\nAs soon as I give it a all you've got to do is be one of the first five callers to text the message H. I. V. A. C. one\nText it to the number three six to six zero gates open up your phone open up your text messages are numbered insects do is three six to six zero\nBut in the message H. I. V. A. C. one H. B. A. C. one okay and you're going to get one of these tuna ups\nFor thirty nine Ninety five and you're not even gonna have to talk to anybody to do it that's the best part takes you less than sixty seconds we're going to send you back link you click on the link bam your appointment schedule and you're done super quick alright\nText message HVAC one\nTo the number three six to six zero I think we've got two left no one left do get get it affects the number three six to six zero but in the message H. I. V. A. C. one and you'll be the last person to get it okay beat your neighbor to the bunch\nOh look I'm going to talk a little bit about the drive by maintenance okay somebody you were sitting there laughing going what's the drive by maintenance\nWell if you have somebody come out to your house for an air conditioning or heating tune up that leaves after only spending thirty forty minutes during a tune up\nFrankly if it's less than Seventy five minutes it's a drive by tune up too\nSo what do you want to do if you've got one of those companies\nWell I'll tell you exactly what to do next time they call to schedule the maintenance for you\nAsk them to have the technician give us sixty second heads up before he gets to the house of quick telephone call and when you get that telephone call half your check already written out and just as quickly as you can run up to the end of the rich get richer\nIncrease lean body mass for those that don't know what that is they're talking about muscle and improve the functional capacity of the elderly they\nGo on to talk about how it supports bone health as well and then they finished with this creating supplementation without training in the elderly potentially they'll lay atrophy of muscle and unproven difference and strength so here again we see bottom line ... is very very effective pat when\nYou think about it this almost sounds too good to be true right right but it is true hundreds and hundreds of human studies back up what we're talking about you're going to love the benefits you get with this ever strong formula\nNow listeners can only get every strong this clinically tested Korea teen blend from surety products right Oh absolutely\nI Know it combines the Korea teen with the vitamin D the coffee buried the fruit X be more on there's also a great value to I Know we have a free bottled today but if you wanted to buy all of these things separately it would cost a small fortune wouldn't it\nOh absolutely I mean if you went out and bought the Korea pure create and that's the purest finest pre teen from Europe and then you went out and bought a separate antioxidant formula and separate joined formula and the vitamin D and it's going to cost you eighty Ninety a hundred bucks a month but you're not going to spend that today that with purity products because today\nIt's for your job is to be one of the first thousand calls you could you be twelve and ... and your average strong you're just pay six Ninety five per shipping we want to get it right out you we want you to be the judge for yourself don't take my word for it\nTry it look in the mirror go to the gym lift some weights do whatever you do see if you don't feel better\nI was talking about how you take this you have these easy to swallow tablets also comes in a very refreshing Sherry Barry powder so how do you like to take and it gives people just choose the tablets are the powder when they're calling for the free bottom today\nYeah you can choose tablets her powder I personally use both you know I'm I work at these days are making a protein shakes on days I'm juicing let's face it juicing is becoming very big these days so if you're doing something like that the jury very powders fantastic could just take a scoop dump it right into your juice your protein shake and that's a great way to take it but if you don't do that stuff\nFor him in the tablets are super convenient they're small they're coated they're easy to swallow it's wonderful stuff\nNow I Know you're shopping at the bit to tell us a little more about this study the purity did on the ever strong powder they tested golfers and purity found out that not only with these golfers getting stronger and more explosive but they were driving the golf ball get this fourteen yards further that's amazing\nI have such a big smile on my face right now I'm remembering when the researchers came back and gave us information we were bouncing off the walls this is so exciting\nThe researchers called this a seminal study in sports nutrition and this was on our average strong formula the products we're talking about right now so double blind placebo control study thirty golfers took our original powder for one month no exercise nothing different in one month they were banging the golf ball\nFor teen yards further packed not only that six percent more power on the bench press more explosive they could lift the weights faster\n... people shouldn't just how how about this this is amazing because this was a golf study but more explosive and there's more speed more power this should help all sports so if you're a tennis player if you're a jogger if you're any kind of an athlete this has ramifications across the board\nI Would just got a few minutes left here I Want you to recap this amazing story today about Korea Team you like to call the molecule of strength who needs it and what about this double free bottle offer today with the ever strong plus the B. twelve energy melts\nYou know what at my one concern with this show is it literally it sounds too good to be true right when I tell folks about every strong right I'm afraid they're going to think I'm making this up\nYou know I Know how you feel because six seven eight years ago when I started to read about Korea Team I almost couldn't believe it I said to myself if it's really this good with an excellent safety profile how everybody's not using it\nBut I started to use it and I noticed some incredible benefits it's as simple as this you're going to get on the restaurant you're going to try it you're going to get stronger you're going to get more powerful you can look in the mirror and see the difference there's hundreds and hundreds of human studies backing us up and of course we didn't just a a decree a pure Korea teen\nWe're the fruit XP remember that join how we'd have the coffee Barry extract that nominal antioxidant that more potent than blueberries and strawberries for powerful antioxidant protection\nI added the vitamin D because it's so important across the board free for bone health but also for seniors vitamin D so important for muscles especially as we get older for strength and coordination so this is a very comprehensive formula again this would easily cost you eighty Ninety a hundred bucks to replicate on your own but today it's free\nAnd not only that let's not forget about the beach twelve energy emails because we're talking about energy here today and when you think ... you think beets will be twelve is critical for making red blood cells to carry oxygen to the two shoes to buy it and then there is great for the ... and then also just make sure\nYou're one of the first thousand colds get your free bottle of every strong your freebie twelve energy ... six Ninety five that's it you're just paying for the shipping and if you don't notice the benefits that we've discussed today purity happy to give you back your six Ninety five\nBut that's not going to happen it never happens people love this formula you're going to tell your friends relatives loved ones you're going to fall in love\nWith the ever strong and to be twelve hundred you know\nFascinating information as always thank you for your time thanks so much for having me\nOnce again purity products a recognized leader in the field of nutritional supplements has an incredible free bottle offer today under clinically tested ever strong this is their exclusive combination of the elite Korea pure Korea teen amplified by coffee Barry extract plus a\nThousand units of vitamin D plus the joint promoting action\nOf fruit ... Bora ears artworks be one of the first thousand callers from today's show purity is gonna rush you want a free bottle of ever strong to try for yourself all you pay for shipping that's just six Ninety five you try you'll be the judge it's that simple even the shipping is one hundred percent refundable so you've got absolutely nothing to lose\nEven better as a special bonus today you also get a free bottle of purity is B. twelve energy melts\nToo awesome products free\nJust call now one eight hundred\nFive eight zero eleven Seventy five that's one eight hundred and five eight zero uh Lebanon Seventy five was over three hundred clinical studies Korea teen support strikes stamina power endurance healthy brain function and basically helps you get back your edge no matter what age you are so give this double\nFree bottle offer try today now there's double free offered is not available in stores or on line it's only available by calling purity products on this special order line one eight hundred five\nEight zero eleven Seventy five that's one eight hundred five eight zero eleven Seventy five call right now so you don't miss out just pay for shipping and handling and even that's refundable teacher free bottle of purity ever strong and the free\nBe twelve energy melts call right now one eight hundred five\nEight zero eleven Seventy five that's so free one eight hundred five eight zero eleven Seventy five one last time slowly call now one eight hundred five eight zero eleven Seventy five\n[noise] they're proceeding was an advertisement by purity products these they have not been evaluated by the FDA this product is not intended to diagnose treat your rent any diseases\nThe proceeding was a pain program paid for by purity products the opinions viewpoints and promises made during the proceeding programs are not those up W H ... am staff management or parent company I heart media incorporated\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise]\nDot com [noise] twelve Fifteen west still fail\nOn our first ... [noise] downloaded\nYou see the news on the hour sponsored by their works release\nBut NOW News is leaking out you may have heard of semesters to loan using human growth hormone yeah and uh discussions about Barry Bonds uh-huh Roger Clemens and his wife who we've seen in the sports illustrated swimsuit magazine right as well as many other countless professional athletes\nAnd celebrities using HGH therapy and you're going to continue to hear about this in the media because within a matter of days from taking these HGH injections\nVery younger version of themselves they started sleeping like babies they have teenage energy levels while they easily lose body fat and gain more muscle definition and strength\nThey're feeling and looking ten to Twenty years younger than they are really age HGH has known as the single most powerful anti aging molecule in the body that's causing the cells of the body to regenerate replicate and repair themselves\nThis is why so many doctors feel that HGH is the closest real thing we have to the secret of the fountain of youth and some patients will tell you it is the fountain of\nYouth wow so Dr West are these HGH injections available to the\n... but it's the\nLee extremely expensive and out of reach for most people\nWere talking about eight to ten thousand dollars a year and and here's another possible price you may pay and that's the fact\nThat some will get side effects from age ... however here's the good news okay we now have newer technology than the age ... anti aging doctors have now developed a new therapy\nThat enables us to naturally in graves and restore our own HGH our youth hormone without having to use the costly HGH injection and how is that fortunately researchers now have identified natural\nHGH and hamsters which helps our own body produced and release more growth hormone like we did when we were younger so\nHow do we get our hands and all these nutrients that help increase HGH\nWell my team of anti aging researchers have taken the guest work out for everyone and they've used this new science of growth hormone therapy to formulate the latest natural and affordable growth hormone release her on the market\nIt's called G H R platinum and it contains natural ingredients that are clinically proven to help increase and restore our body's own HGH level it's the only growth hormone release or that contains organic ingredients and a new breakthrough in HGH therapy called ultra trope in\nNow Oprah trope and is an advance combination of natural HGH and hamsters and HGH amino acids\nThese help improve the communication process between our two HGH producing glands as well as provide the building blocks these glands need to produce more of and restore our very own youth hormone known as HGH\nNow you're saying gee HR platinum is known as the new natural alternative to the HGH injections that all the rich and famous or taking this day yeah that's\nRight we have a lot of celebrities in professional athletes switching from the HGH injections to G H R platinum that are noticing even better results wow there are no side effects no injections no hormones or drugs nor do you have to spend thousands of dollars for these youthful benefits\nAnd what specifically are they useful benefits people can feel with G H R platinum\nPretty much every one notices more energy and deeper sleep\nOther improvements felt are an increasing endurance and stamina which enables people to accomplish the things they want increased muscle mass and definition decreased body fat primarily and the abdominal region\nIt helps replenish the fluids in the skin which lessons fine lines and wrinkles improves mental alertness and memory increases bone density restores original hair color reinvigorated the sex drive re grows hair lowers cholesterol and blood pressure\nSharpens the eyesight helps eliminate sell you light fights depression and strengthens the heart\nHelps restore a youthful immune system and here are two additional benefits we are constantly finding\nAnd ... the fact that many people have less or no more arthritis pain and others have lesser no more allergies on not only is it a natural HGH complex but added to the formula is raspberries role go gee berries ... foster the title ...\nThe famous grape seed extract OPEC as well as two ingredients Reader's Digest reviewed as the new pill that can and aging the alpha ... acid and the ceiling L carnitine combination\nNot only do you get a lot for your money but you can start feeling the powerful improvements within a matter of weeks\nWhere there's a lot more to come but let's take a break and give out the phone number for those interested\nAs previously mentioned over twenty thousand clinical studies have confirmed that increasing our HGH level slows down and even ... versus the effects of aging\nThe exciting thing here folks is and the thing I really like is the G H R platinum contains natural ingredients clinically proven to increase your own growth hormone level so if you're interested in feeling and looking possibly ten to Twenty years younger within a matter of weeks\nPick up the phone right now don't wait until your symptoms worsen\nCall now and asked the operator how you can get a free bottle\nThe toll free number is one eight seven seven thirty one young\nThat's one eight seven seven three one nine six eight six for its all natural affordable\nAt a hundred percent guaranteed shipping is free\nAnd if you order within the next twenty minutes you'll also be shipped a three month supply of Dr West anti aging multi vitamins with an added organic fruit and vegetable complex plus co Q. ten green tea ... ironic asset and much more of forty dollar value free just forgiving G H R platinum I Try\nIf you're interested in getting a deeper sleep gaining higher energy levels losing unwanted fat improving sex drive increasing mental focus if you're interested in living a hundred health the years\nThat allowed G H R platinum to help reverse your aging symptoms an elevator healthier and younger you again called toll free one eight seven seven thirty one young\nThat's one eight seven seven three one nine six eight six for you know what I Love most about this product isn't it really does work judge for yourself\nListen to the actual comments made to our phone operators from the users of G H R platinum\nI Want to apologize for some of the background noise these are the actual live phone calls\n[noise]\n\nBy the name of that made it what I Want [noise] stays around [noise]\nReally [noise] I [noise]\nAnd a lot [noise] like [noise] your energy and fatter it's great\nThat is impressive we're talking with Dr Randall west about reversing aging symptoms with the new natural science found in the G H R platinum now\nDr West what about doctors what doctors think about the ability G H R platinum has and reversing aging symptoms\nAnd this is an important question to answer in fact many of our clients ask their doctor what he or she thinks about the G H R platinum and many times the doctor is already on the product well there's your answer right\nBut the reason behind this is that more and more caring doctors are becoming educated on the powerful health benefits of HGH therapy\nAs an example of this we've interviewed several doctors who are using G H R platinum here is Dr Dan bird listen to what he has to say about the G H R platinum\nThis is where we've been wanting to go and needing to go for a long time we now have this technology inability with Ga jar platinum to naturally increase the HGH levels with no side effects and it's affordable\nThe greatest medical discoveries and the twentieth century were ... and antibiotics this increased life by ten to Fifteen Years per person many doctors feel this is going to eclipse both of those discoveries this is going to reverse aging symptoms in ways people didn't think was possible\nIt's going to restore energy levels increase the deep Ari him sleep and reduced body fat which we know is associated with many diseases from diabetes high blood pressure to cancer\nI mean I just can't say enough about how well this product works and how much it's needed for us aging adults\nWow that's fantastic Dr ... not alone in his thinking we have another guest Dr on the line who's been a longtime user of G H are playing them\nDr Silver is an orthopedic surgeon and editor of many popular health magazines Dr Silver or are you there we appreciate your time I'm I'm here with Dr West and we wanted to ask you if you could briefly share your experience with the G H R platinum\nSure I've been on it\nRenovations presents\nChampionship cybersecurity\nJoins secure innovations for cocktails in conversation with just a doctor Baltimore's championship seeding is limited reserve yours today on secure renovations Facebook page\nThis is there some day thirst and host of fit and I hurt radio podcast twenty three ... listening in and I chat with brothers Darren ... of the ...\nThis is there some day thirst and host of fit and I hurt radio podcast twenty three and me listen in and I chat with brothers Darren ... of the ...\n[noise]\n\n\n\n[noise]\nShe uses squeezes Maryland for terrifying attraction is one location designs just scared or\nWhich has been found within qualify by the U.S securities and Exchange Commission these securities are highly speculative investing and chairs and kind of stuck in my time sold the corporate significant risks the investment of suitable only for persons who can afford to lose their entire investment\nFurthermore investors must understand as such investment can be a liquid for an indefinite period of time no public market currently exist for the security is if a public market developed following the offering me and I continue to send a copy of the ... circuit which contains information about high ten told the court be offering and other related topics including the risks of the investment please this high times invested dot com that high times investor dot com I media and its affiliates are investors and how\nWill still putting off a building that dream home\nNow the perfect time to talk with us about a mortgage loan\nMany options to consider will find you a loan them right or\nCall today and we'll get started\nComputer game and New York times best selling author AJ Jay Gould about how we are all family like it or not the judge\nJudy effect I always hated her then I found out through DNA I'm her like fix says it actually made me sleds my perspective I'm like\nOh cousins or radio from our eye\nOut radio studios here in Tampa this is best of the bay Hi letting the people and organizations that represent the best of the Tampa Bay area I'm your host Brian Gorman in this episode we're joined by stop soldier suicide with us in Studio ... Rachel land an advocate\nFor stop soldiers suicide and on the phone we have the total the chief program officer how we're both of you\nAre not getting paid but you so much Keith how are you\nI'm doing great as well Ryan thank you\nThanks so much for being here this is an important topic a ritual you were here last year we talked about uh the organization and the race that you have coming out before we get to the event itself which will spend some time on\nA let me start with stomp soldiers suicide and the great work the disorganization does recently just a couple of weeks ago we had on a the American foundation for suicide prevention so the topic we've covered quite a bit lately because it's been in the news so much lately unfortunately um let me start with the basic overview\nIt's pretty much self explanatory based on the title but a little bit more about what stumps soldiers suicide is all about showing\n'em well for starters stopped soldiers suicide is on the first and then rain founded in lead nationally um organization and aims to preventing military related suicide I'm keeping you want to take that one\nYeah keep it tell us a little bit about how it got started and how you got to where you are today\n[noise] sure um well it was started by um a three military ah folks who are friends and they saw you know after they um a mustard out a from active duty and back to the states they saw you know an alarming\nAnd unacceptable a number of their their friends and colleagues that you know we're in the military and losing their lives the suicide and decided that it was something that they felt passionate enough to about\n... to form this organization and work on that problem and try to our mission is to see a day when our military uh brothers and sisters are no greater risk for suicide than the average civilian\nYeah because veterans are at greater risk correct in an active duty members as well\nYeah absolutely so you know our veterans are significantly higher or you know risk than uh you know the average American you know at least fifty percent higher and\nAnd maybe even a more than that depending on um you know what steps you look at so it's a you know it's ... suicides public health hazard epidemic\nIn the United states and when you look at the rates of a military suicide if it's just something that um you know really needs to be addressed and it needs to be addressed a you know at a national level\nKey pounded you wind up getting involved with the organization personally [noise] well\nI actually came out from Wyoming I had been do doing suicide prevention for roughly Fifteen Years\nAnd led the state of Wyoming suicide prevention efforts are at department of health before I transitioned to a nonprofit that was doing all the prevention and the state of Wyoming and when we lost our our funding earlier this year was looking to see you know what made sense for me\nUh and got hooked up with a a Nick and Brian who are two of the founders and was absolutely committed and sold on this program and moved out to North Carolina and I'm loving every minute of it so\nYou know you've been dealing with this issue for quite a while like you just mentioned a is even worse now than when you first started Fifteen Years ago\n[noise] [noise] well I mean I I think what we've seen is a steady increase of of rates across the country so for ... you know it's gotten incrementally worse from year to year despite um the efforts and the funding that have been a you know put toward the effort\nSo um you know there's there's that piece of it which is you know a kind of a national level I issue but then when you look at at the growing number of I'm veteran suicides in and military suicides um you know that's even more disturbing and problematic I think\nAnd let me ask you how the organization is set up obviously we're doing doing a run here which we're going to get you in just a bit um to benefit the organization but how how does the organization worth is this the national organization with local chapters tell us a little bit about the structure\nSure so there's a couple of components of the work that we do it stopped soldiers suicide of one of them in the piece that's been in place\nUm you know for a since the founding of the organization eight years ago is a what we call a resource center which essentially you know takes\nAny veteran any active military or family member who has a a need 'em and we hooked him up with an individualized case plan or\nIt's management plan and provide them with you know access to whatever resources they may need if they're homeless veteran you know we try to work on that problem with them if it's a\nA veteran that that needs the connection because of a mental health condition or substance abuse problem we work with them to try to find a provider that um that is in their area that would be a you know suitable a good match for them so it doesn't matter what the problem is\nUh we work on it and we do it in a way that\nIt leads to our knowledge no other organization does which is to provide those folks with individualized one on one a case manager management for up to two years and with with numerous follow ups and called back to make sure they're doing okay during that period of time\nAnd how critical is that both the the personalized care and the follow up [noise]\n[noise] well we think it's absolutely critical of one of the [noise]\nOne of the things we see is that veterans in an active military are coming to us from other providers or system where they're not getting any personalized attention or there's you know huge waiting in line [noise] um that doesn't exist with us we get back to folks right away and uh\nAnd begin to provide them with the resources they need you know tailored to whatever their needs are I'm immediately and so in that way I think we are different and it's also important\nBecause you know as we get veterans who are at greater risk than even the average ... because of whatever circumstance they may be in that follow up that connection\nYou know really kind of provides them with a safety net over that period of time to make sure that somebody is watching out for them somebody cares somebody is there if they need them and you know that kind of personal involvement and personal touch is we think really critical to empower invest\nAnd improving um whatever their circumstances maybe over the long run\nThis is best of the bay with us we have\nStopped soldiers suicide in Studio racial land and an advocate for the organization and on the phone with us ... total achieved program officer these stop soldiers suicide veterans' day five K. honoring a surgeon Erik land and is coming up or it's going to be on November eleventh\nAnd um the website if you want to find out more about the run itself has the Holland G. R. P. dot com\nOr Rachel I Want to bring you in here before we get to the details about the run struck garden obviously give us the backstory 'em to how you became involved and and came up with this uh this event", "year": "2018", "show_name": "Purity Products", "city": "Tampa", "day": "27"}