{"month": "10", "state": "ID", "station": "KRFA", "content": "Stay with us up to twenty five miles per hour otherwise through the weekend and much of next week if you can expect sunny days clear nights and dry weather with possible frost forming overnight and in the morning what was in the thirties to low forties and I was in the mid fifties to mid sixties\nNorthwest public broadcasting K. R. essay Ninety One point seven Moscow Pullman K. and W. V. I. D. point five Clark St Louis and cayenne W O Ninety point one cotton wood Greenville NPR in classical music community service of the ed wood are Maro College of communication at Washington state university\n[noise] mhm Mm mhm mhm [noise]\n\n[noise] [noise]\n\nMhm mhm\nThe next day\n\n[noise] [noise]\n\n[noise] [noise]\nMm Mm\nMm Mm\nMm [noise] Mm [noise] Mm [noise]\n\n[noise] [noise] [noise] Mm\nMm\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] Mm do you do [noise]\n\n\nI Know I sweat native and founder of the in the north west guitar festival gene Reed performing their meal Broward there's two or ... by ... public broadcasting\nSo sudden fine well no I Know you're always treating an awesome awesome harmonies from the town of ... that do they look like now\nWe are Muslims as yours\nAnd you'll hear that tomorrow morning between nine and Noone right here on northwest public broadcasting in W. P. B. dot org\nA big thing you chew everyone who participated and supported northwest public broadcasting in the super Thursday pledge drive a warm welcome to listeners who became new members with their first time donations as well\nYour dollars are hard at work bringing stories of substance ending firing music to yourself and your community\nIf you meant to give but caught a little busy on Thursday after okay you can still make it different pledge now it N. W. P. B. dot org and again thank you for all you do to make public radio possible\n\nWe'll hear now from Carlo Maria ... one of the prominent and thought after ... of the early Nineteen century ... vapor piano sonata number four performed by Alexander Paley\n\n\n[noise]\n... ...\n...\n...\n\n\n\n...\n...\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n[noise] ...\n\n... and ...\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise] I\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n... ...\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\nMm\nMm\nMm\n\n\nNah\n\nNah\n[noise]\nThen you wouldn't you\n\n\n\nMm\n[noise]\n\n\n\n\n[noise]\n[noise]\nAnd then there was nothing to do with the\n\nMembers of the member knew\nOr knew what to\nDo\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n", "show_name": "Climate One", "year": "2018", "city": "Moscow", "day": "13"}