{"month": "10", "state": "MA", "station": "WBUA", "content": "Homo Boston's largest radio news Rome Ninety two points of WB you wait just bury a nine point one WVU wage Brewster and streaming W. B. U. R. dot org W. B. U. R. Boston's NPR News station\nWho resident Trump promises to monitor Saudi Arabia if it's government played a role in the death of dissident journalist ... today is Monday October Fifteen\nMORNING EDITION good morning I'm Bob Beck coming up President Trump's promise on CBS is sixty minutes he said last night it's unclear if the Saudis are responsible for good show you use that and\nThey deny it denied every way you can imagine in the not too distant future I think we'll know and that's\nAlso the shower President Trump today you visited Florida and Georgia survey damage from hurricane Michael once dominant retail giant seniors files for bankruptcy and the new WVU our poll of Massachusetts nurses by them evenly divided on ballot question one mandating nurse staffing levels\nSmart dreads auction patriots both when forecast rain coming later today ... is in the low sixties\nIt's five oh one now the news\nLive from NPR News in Washington I'm Dave ... President Trump is heading to Florida and Georgia today to survey damage left by hurricane Michael the death toll from the storm is at Seventeen authorities say they expect that number to go up as more debris is gone through\nHundreds of thousands of people are still without power\nNPR's Joel Rose says in the Florida Panhandle relief workers continue helping those in need of food water and gasoline\nEmergency officials and set up food and water distribution points in and around Panama City in regular people from the surrounding towns volunteered to do\nOf supplies from Destin, Florida water\nDiapers thought food all that stuff I Know how long it takes for people to get stuff and I know the dangers of this and what's going on\nThere were long lines for food water and gas not only near the coast but also in rural inland areas that were hard hit by the storm and there may be more difficult for relief workers to reach Joel Rose NPR News Panama City Florida\nMichael came ashore as a category for hurricane with top sustained winds of more than one hundred fifty miles per hour President Trump was asked about climate change during an interview on CBS is sixty minutes\nI don't think it's a hoax I think there's probably a difference but I don't know that is man made I Will say this um [noise] I don't want to give trillions and trillions of dollars I don't want to lose millions and millions of jobs I don't want to be put at a disadvantage\nPreviously Trump pass referred to climate change as a hoax in that same interview the president promised severe punishment of Saudi Arabia if it's proven the kingdom had missing journalist ... killed two Republican senators Florida's Marco Rubio and Arizona's Jeff Flake\nCongress may seek to hold US military sales to Saudi Arabia the un says Thirteen million people in Yemen or risk of dying from a lack of food and met the country's ongoing civil war the BBC's or like Aaron reports from Yemen's capital Sanaa\nNowhere in the world are more with our nation I was hearing that on two years ago and it's shocking to come back\nAnd see how much worse things are now\nIn the market at theater harvest for Yemen food that many here can no longer afford they are trapped between the who see forces who control the capital of the Saudi led coalition which ...\nCalls in a civil war which has become a regional power struggle people here feel abandoned to wonder why the world has let them suffer for so long\nThat's the BBC's or like Gehring retailers Sears is filing for chapter eleven bankruptcy protection citing large debts an ongoing losses Sears also says it's closing another one hundred forty two stores once it deems to be unprofitable [noise] this is NPR News from Washington\nThis is not depart nine WVU are good morning I'm Bob ... in Boston, Massachusetts nurses are almost evenly split on the upcoming ballad question that would mandate nursed a patient ratios under state law noble you be you ours Martha ... has the results of a double duty you our poll out this morning\nThe w._b. or pull a five hundred registered nurses find forty eight percent support the measure high under down a nurse for almost forty years says she'll do yes to assure nurses can provide the\nBest possible care not having a short one because you're having to work really hard to keep another patient safe\nBut forty five percent of nurses including Caitlin handles say they'll know\nBecause I don't think the law the way it's written is going to be affected if they don't think it's going to increase patient safety the poll finds\nWidely different experiences for Massachusetts nurses that will influence their vote around job satisfaction workload and confidence that ratios will or will not lead to closures and higher costs for Ninety point nine W. B. U. R. I. market eating\nThis poll has a margin of error of four point Fort present you can see more of it at W. B. U. R. dot org\nSenator Elizabeth Warren says a new DNA tests show she does have Native American ancestry according to the Boston Globe the test shows Warren as a Native American ancestor dating back six to ten generations\nThe test was done by a genetics expert who's as most of orange ancestry is European weren't as faced repeated questions about our ancestry and criticism for her claims about it\nThe deadline to register to vote in Massachusetts in November's election is Wednesday residential want a vote can sign up and ... town clerk's offices or on line that the secretary of state website\nStarting today all drivers can use the south Boston bypass road links interstate Ninety three with the seaport under a yearlong pilot program state highway officials say drivers will also be allowed to use the carpool lane that links Ninety three north with Ted Williams tunnel\nWho said treasures office today will show up some of the unclean property that will be auctioned off on line items such as jewelry will be shown at the state house today before heading to Cape Cod Springfield and Worcester for more showing the auction is scheduled to begin Saturday on E. bay it's ...\nWere funded by you our listeners and fight that university fast track your finance career with a masters in finance firm Bentley University rank number four in the U.S by the Financial Times learn how a masters in finance can help you accelerate your career and finance at their graduate open house on November third\nRegistered today and patently dot edu slash open house\nGr of luxury massage chairs from Japan with Shiites who point detection and sixteen program massages including morning night and stretch sessions retailers nationwide more at dream life chair dot com\n... you end up the American league championship series at one when a piece last night with a seven five went over the Astros have Fenway ... went to for for scoring twice and driving in a run game three is tomorrow in Houston\nAnd knowing what patriots won their third straight lives died forty three to forty over the Kansas City chiefs and Fox borough WVU ours Jim Foley reports\nQuarterback Tom Brady completed a thirty seven yard pass to tighten Rob Gronkowski in the final minutes to set up the game winning field goal brief says that completion stands out as a pivotal moment of the game\nYou gotta match up and made a big play he's making a lot of those as career I'll keep throwing them in the biggest moment\nFor the first time in Twenty one month spread Ian wide receiver Julian Edelman connected for a touchdown next Sunday the patriots will play the Chicago Bears for Ninety point nine W. B. U. R. I'm Jim Foley Gillette Stadium in ...\nWork as today showers coming today in the low sixties tonight rain some heavy rain before it ends lows in their mid forties bend tomorrow and Wednesday there'll be sunny loaded mid fifties both days southern cooler in the forties on Thursday them something in the fifties friday\nIn Boston now forty six degrees forty one big reason was dirty and low and forty two degrees in Plymouth it's now five always [noise]\nIt's MORNING EDITION from NPR News I'm Rachel Martin\nAnd I'm Steve Inskeep watch is the United states willing to do about the disappearance of a journalist\nDemocracy Yogi was last seen alive as he walked into a Saudi conflict in Turkey Turkish investigators think he was tortured and murdered when he was inside you with us resident and he wrote articles for the Washington Post\nBut President Trump has repeatedly said he doesn't want to respond in any way that disrupt us weapons sales to the Saudis he was asked about this in an interview with CBS is sixty minutes and said if the Saudis were responsible responsible for his show these disappearance and alleged death there would be severe punishment\nThere's a lot at stake and maybe especially so because this man was a reporter to something you'll be surprised when they say that there's something really terrible and disgusting about that if that were the case so we're going to have to see what's going to get to the bottom of it and there will be severe punishment\nWas out as you said they would retaliate frantic sections NPR's Jackie Northam followed us Saudi relations has been inside the country and followed it for years either Jackie morning the when you listen to the president's words do you hear an actual threat against Saudi Arabia\nNo not at all he seemed to hedge his answer to that question you know he's he's under pressure to investigate what happened to a gym off the show again he says his son in law Jared Kushner and a senior adviser\nWere funded by you our listeners invite a breast care center at Beth Israel Deaconess Medical center where the standard of cure means breakthrough cancer research innovative breast surgery techniques genetic counseling support services and more learned more in the I. D. M. C. dot org slash breast care\nAnd brilliant earth conflict free diamond engagement rings wedding rings and vintage fine jewelry online at ... dot com and they knew every street showroom appointments available now\nNow the forecast dollars you'd be wire meteorologist Dave Epstein says it will be a wet day today\nIf you haven't put your heat on just yet you may have to buy the middle part of this week we've got a real culture shock coming in for Thursday but\nFirst let's get to the showers they're going to arrive today temperatures in the lower sixties they become most numerous this evening through about midnight temperatures tonight fall down to the mid forties tomorrow it's a beautiful day mid fifties with sunshine almost a repeat on Wednesday mid fifties with sunshine Thursday that cool air from Canada\nReally here only in the mid forties plenty of sunshine but that's the average for the first week of December friday we weren't back up again to the mid that these were unfounded right now the weekend looked seasonable perhaps in ...\nIn Boston now forty five degrees it's five Twenty one [noise]\nI'm Peter O'Dowd from markets to elections and technology we rely on forecasts about the future how good are we making predictions the big famous pundits who tend to dominate the news where there's politics or economics or anything else\nThey don't actually have proven track record scientifically scored track record that's next on on here and now today at noon on Ninety point nine W. B. U. R. Boston's NPR News station\nWhere funded by you our listeners and by virtue techs fueled by the needs of patients' families on health care providers VR techs invest in science to develop new medicines and strike at the core of serious diseases\nLearn more about VR techs and the people behind it science and V. R. T. X. dot com and smart shaped an online platform used by fortune one hundred and five hundred companies to plan manage and execute work across teams in organizations smart sheet\nWork different It's MORNING edition\nMartin maybe this is you you see the signs at work or your pharmacy flu shots available\nBut when he got to make time and do the shots really work anyway this next story may change the way you think last year was one of the deadliest flu seasons in decades and estimated eighty thousand Americans died and a thirty nine year old St Louis man was almost one of them\nNow he's encouraging everyone to do something he had never done before Bram Sable Smith reports\nCurly hinder lighter wasn't opposed to the flu shot he's not against vaccinations or anything like that\nI figured this is something that's dangerous to the elderly and the young not to somebody who's held in their thirties\nCharlie is thirty nine he's director of government affairs at St Louis realtors association\nAnd like more than half of Americans he didn't get one he just didn't think he needed a flu shot as it turns out I was wrong wrong like fifty eight days in the hospital a week and a medically induced coma two surgeries three weeks in a nursing home that kind of wrong\nNine months after he first came down with the flu Charlie still getting medical checkups like with this nurse practitioner making Salinger\nYou send a message to the other day they were having grown up and running out time and that was\nStill out but by and large sums of broods Jones who was actually the first person to realize something was really wrong back in January\nCharlie came in he already knew he had the flu actually his wife had it too but Salinger was concerned he looked terrible she recommended Charlie go to the ER by the time he got there he had organ failure Charlie's flu Hitler to pneumonia and then to sepsis a life threatening complication that can cause organs to fail\nCharlie was put in to medically induced coma for over a week\nHis father and brother flew in from out of town and we are told they may need to say good bye I knew when I woke up that I'd been near death his muscles had atrophied the doctors are worried about brain damage he needed a feeding tube to eat I basically was bed bound to help to move to a chair old this from the flu\nIt's hard to say why hit Charlie so hard\nHis doctor Kevin king says sure there are things that can predispose people the complications from the flu a lack of immunity\nFor Charlie was young and healthy it can affect anybody and it doesn't matter how healthy or going in and that's why king says the flu shot is important for everybody it doesn't offer complete protection but if you get vaccinated and still get the flu you likely get a milder case\nThings to get better for Charlie eventually he left the hospital and spent three weeks rehabbing in a nursing home the same one where his grandmother was being treated for advanced dementia\nWhich was not an experience I expected but all the family members that came to visit got a two for you know I got to visit her and me\nOn April sixteenth two days before his thirty ninth birthday he got out of the nursing home and went to his home for the first time in three months he started driving again in may working part time in June got back to the office in August but the experience was still nine at him\nI was laying awake at night I'm Still kind of trying to process what I'd gone through this year or so I took to Twitter to share that and and use my story is as an example of this is why you should get a flu shot\nSlowly life is returning to normal for Charlie except for one thing in September for the first time he can remember he got a flu shot for NPR News I'm Bram Sable Smith\nIf you step on the sidewalk outside the NPR headquarters you may have to be careful not to trip over an electric scooter sitting there waiting for the next writer companies have deployed scooters from Washington DC to Milwaukee, Wisconsin to Lubbock, Texas people download a phone app and use it to pay just one question\nHow safe are they to ride Deena Prichep reports\nPortland, Oregon is in the middle of a four month tutor a pilot program you see them everywhere\nPark on sidewalks taking that foreigners zipping through traffic but one thing you don't see much of the gas on town [laughter] I won't give you my real name because she's not wearing a helmet nor are any of our friends\nIn Portland and companies both require them and with some of the reason leaders aren't bikes they accelerate without pedaling and take some getting used to for both writers and cars one of our friends almost got run over the brink lights on their don't work you know\nWe've seen things from broken bones to punctured lung ... um shattered pelvis\nKatrin Juilliard as a trauma surgeon ... San Francisco general and an assistant professor at UCF California has welcomed east litters even changing the law so writers don't have to wear helmets whereas other places like the city of Seattle are concerned enough about injuries that they're not allowing them at all\nWhen they enter the factor of transportation that's also entering the sector public health so it becomes a different ball game and we need to make sure that we're doing it safely\nIn San Francisco Juilliard as part of the city's injury prevention collaborative which\nTaylor intersections our people ... or spring ankles or are some types of scooters more dangerous than others\nSo you have to look at the patterns to see where the the trends are and where the low hanging fruit are\nAs a trauma surgeon Juilliard has seen the dangers but she also sees the potential because San Francisco is a city dealing with a lot of car traffic and so much Portland\nAnd have many more thousands of jobs and many more thousands of residents were not going to be building many more thousands of St\nJohn ... is a spokesperson for Portland's bureau transportation to continue to have a city that works that moves they want to welcome innovation knowing you can just hop on a scooter for a few bucks might encourage more people to leave their cars at home\nBut Portland wants to make sure these innovations meet all of the city's transportation goals moving people efficiently cutting emissions and making each trip as safe as possible\nIs at the same time we're seeing a rise in injuries but we also see that people are getting out of their car and potentially helping to relieve congestion you know is that a trade off from a public agency standpoint that we think is a good one I don't know we don't know yet\nPortland of course does not want the rise and injuries they're handing out free helmets and doing a public education campaign\nBut you only have to look at the ... going by to see that this is a big change cars and scooters are still learning how to be around each other and not many people are wearing helmets cities and physicians will get a better sense of scooter dangerous as the data come in over the next few months\nIn the meanwhile good safely bore you could always walk for NPR News I'm Deena Prichep\nIn Portland, Oregon support for your health comes from exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information at color guard pest dot com and this is NPR News\nOr not he bought nine dollars you'd be you are coming up a new WVU our poll of nurses on ballot question one which would mandate nurse staffing levels it's five twenty nine\nWere funded by you our listeners than by not or where you are legal issues are met by a team of proven attorneys using a client centered approach that puts your needs first\nHalf of nurses say mandatory ratios would improve patient's safety Nineteen percent safety would get worse and twenty nine expect a mixed outcome or no change it all\nOne for nurses say they have seen someone harmed during a time when they're nurse had too many patients\nHeidi hunger doubt a nurse with almost forty years of experience will vote yes remembering the times she feels she has let patients down\nI'm not going to say that somebody's died or anything like that I don't have that personal experience but I Do have experience of patients and family members getting very angry at you because they're not they're feeling like they're not getting their due time from you\nHunker down works at Brigham and women's where she's a member of the Massachusetts nurses association the union spearheading the yes campaign among union nurses support for the ballot question rises to sixty percent with thirty three percent oppose\nOverall the poll results very because nurses experiences very says Steve ... president of the mass in polling group which conducted the poll for WVU are\nNurses who say they're gonna vote no are more likely to be very satisfied with their job they're less likely to say they feel overloaded or have too many patients America less likely to have seen negative consequences as a result of hostile for ratios I mean you cite is pretty much the opposite\nA split among nurses mirrors a split among voters seen in several recent polls\nThat's frustrating to nurses who've been lobbying for set patient ratios for more than two decades at the state house and now through this ballot question well only Fifteen Percent of nurses say a ballot question is the best way to establish safe nursing rules many nurses say the vote will feel like a referendum on there were\nCan\nPeople nursing Carey another yes voter who worries her hospital will retaliate has joined Kelly at the coffee shop\nI feel like we're just at a loss America kind of defeat in\nTheir post work conversation trips to divisions the ballot question is driving between nurses this is Kelly again\nIt's so sad that something [noise] that although not may not be the best way to do it with ... to try to\nProtect our says her text patience\nAnd so divisive among the people that if they're trying it\nWill be awhile says Kelly before things calm down regardless of what voters decide about nursed a patient ratios on November\n... for Ninety point nine W. B. U. R. I'm Martha Bebinger\n[noise]\nDo you view our poll of five hundred registered nurses or as a margin of ever more point for ... see the full results at do you mean you are ... and\n[noise]\nDo you mean you are coming\nPatriots last night forecast some rain coming today hears WVU are meteorologists have Epstein\nScott has become mostly cloudy for today and the early morning sunshine fades away from showers developing temperatures lower sixties the showers become more numerous Windsor gusty this evening\nEven some downpours temperatures down to the forties tomorrow sunny mid fifties Wednesday sunny mid fifties Thursday it's like the first week of December or early in the mid forties with sunshine friday mid fifties with sunshine\nIn Boston now forty seven degrees it's five forty three\nWe're funded by you our listeners and by the university they're graduates pursue fulfilling careers with support from a career services team ranked number one bite Princeton Review learn now an NBA or masters of science\nCan help you find fulfilling career at their graduate open house on November third registered today at Bentley dot edu slash open house\nAnd the Boston philharmonic fortieth season led by Benjamin Zander with tell us Jonah Ellsworth October Eighteen to twenty first Sanders Theater and Jordan Hall Boston filled dot org\n[noise] now ... is is the iconic department store chain Sears is filing for bankruptcy with more than five billion dollars in outstanding debt in part as part of its bankruptcy planned Sears will close more than one hundred forty stores\nBefore the years and no word yet on which locations will shut down\nThe greater Boston convention and visitors bureau expects the head of the Charles regatta degenerate more than Seventy two million dollars this year\nThis coming weekend eleven thousand athletes will compete and two hundred and fifty thousand spectators are expected regarding executive director ... says hotels are hard to find\nI Know some teams that actually booked rooms in New Hampshire cause of a slightly lower rate Brooklyn and Newton Walt them all those areas of hotels and restaurants feel the impact of that as a troll this\nWill be the fifty fourth year for the head of the Charles regatta it's five forty five\nWere funded by you our listeners EMT serrano roslin Danville record they style pharmaceutical company transforming lives by developing and delivering meaningful therapy for multiple sclerosis fertility in cancer more at the wrong on dot com [noise]\n\n\n\nThis is Donald you be you are on Bob ... was a good night call it a great night for Boston sports fans last night although one with plenty of drama\nFirst off the red Sox tied up the American league championship series at one way in each with their seven five victory over the Houston Astros at Fenway the series now moves on to the Houston\nThen in ... last night the New England patriots narrowly beat the previously undefeated Kansas City chiefs\nBy a score of forty three two forty\nWell this this morning to recap the patch game as ESPN dot coms Mike ... good morning my thanks for coming in so early well good morning thanks for having me so the stars of the game last night were as expected the quarterbacks it was forty one year old Tom Brady used two hundred career victory he passed\nFor three hundred and forty yards last night at a touchdown and in a rare movie also ran for a touchdown\nAchieves were led by their twenty three year old quarterback Patrick ... homes we experienced his first ever laws as a starter what what stood out about both of those guys\nWell what stood out first about Patrick ... homes is that that the chiefs were down at half time twenty four to nine and and you thought the patriots might run away with the game but here's this young quarterback who just wouldn't quit and he brought his team back he has a great arm and they made some big plays down the field\nAnd then with Tom Brady you mentioned his rushing touched down how many times do you see forty\nOne year old Tom Brady running the ball in from ... over the goal line it was just a tremendous show of we'll put it putting his down smashing into two guys it was because they double covered three of his receivers\nAnd so he said to himself no one's open I might as well tuck it and run it let let like last week the patriots are often included\nMore running plays then fans are used to seeing other Patrick you running backs Sony Michel rush for more than a hundred yards going two touchdowns how big a role do you expect him to play for the rest of the season\nHe is going to play a significant role for the team and here's an interesting statistic Sony Michel a squirt are rushing touched down in each of the last three games he's the first rookie running back to do that since been Jarvis Green Ellis back in two thousand and eight\nPart of the reasons Sony Michel is going to play a big role if he's very talented but also because they've had some injuries at the position so he's really the last running back left standing along with James White\nReceivers uh any standing out so far to you and what do you expect a the rest of the ...\nGame for the patriots is Josh Gordon who's one of the most compelling stories since they acquired him in the trade from the browns plead sixty three offensive snaps in this game a very big off sensitive load for him after playing just eat teen each of the last two games so between him Julian Edelman Chris Hogan\nAnd then fill up towards that end quote arrow Patterson you're starting to see those receivers come together and give them a lot of different options to\nPatch defense you mentioned a moment ago that uh the chiefs scored a a lot of points or ... ... in the second half is the patch defense a worry\nIt is a worry they're very up and down and they've shown that when they are capable of playing to their potential they can play with anyone and they did in the first half the chiefs came in as the NFL's top puffins but the patriots had to turn over in the first half\nHeld them to nine points and then all of a sudden it was like a different defense in the second half so they do need to tighten up\nAnd we need to mention the a ... who ... you know under pressure once again scored that field goal with three seconds left on the clock to give the patch the when\nI'm so glad you mentioned him because the kicker is the type of position that usually only mention when he makes a mess right but this one he had five field goals and the game and the game winner\nWas only twenty yards but the one before that was fifty yards and that was a big kick this sort of keep the patriots and good position patriots very fortunate to have Stephen ... yes they're kicker\nPatch or on the road now a lot of road games coming up starting with the Chicago Bears next weekend how tough stretches is going to be for the past and how tough well the bears be\nAlways health partners and new choice and health insurance with benefits and programs that put you first learn more it always health partners dot org a number of partners healthcare\nAnd fair weather street school in Cambridge igniting passion and curiosity for students pre K through eighth grade open house Saturday October twentieth fair weather dot org\nFrom Boston University you're listening to the point nine WVU are FM\nBoston home of Boston's largest radio news rum Ninety two point seven ... eighty nine point one WVU wage rooster and streaming at W. B. U. R. dot org you'll be you are all students NPR News station\nWho resident Trump believes today for Florida and your judge reviews storm damage after hurricane Michael today's Monday October Fifteen\nDollars will be you ours morning and there's a [noise]\nGood morning I'm ... coming up President Trump's hurricane toward the death stole the death toll stands at Seventeen but some are still missing also what's at stake for Capitol Hill Republicans and Democrats and the White House in the elections next month\nIf Republicans are unable to maintain their majority dumber crowd it will be very much in opposition to the Trump White house\nAnd the new Boston area study on how veterans are queasy when pet owners asked them to take that final step with their pets\nWe are in a really difficult position of caring for patients maybe for their entire lives and then the\nShowers coming today low sixties today it's six oh one now the news\nLive from NPR News in Washington I'm core of a cool and President Trump is scheduled to view hurricane damage in Florida and Georgia today at least Seventeen people are known dead in four states because of the storm but dozens of others are still missing mostly in Florida\nAuthorities caution these maybe people who fled to hurricane but haven't been able to check in with loved ones or return to see their homes Adrian well he has to city clerk for Mexico Beach Florida where hurricane Michael made landfall\nBiggest leads from Mexico beach right now as fuel gasoline\nBelieve ... toilets a cell phone service is a huge thing\nYou could be several weeks before power is restored to badly damaged areas meanwhile rescuers are using heavy equipment and dogs to search rubble in many areas the Florida Panhandle for victims\nIconic retailers Sears has filed for bankruptcy today the American auto center hardware appliance and clothing store missed one hundred and thirty four million dollar debt payment NPR's\nEmily Sullivan has more fears was the most\nWell known mail order catalogue company up the nineteenth and twenty century it's for decades it sold everything from diamonds watches and cars to homes historian Jerry Hancock remembers it to prominence\nFears taught America or about the modern world through this catalog\nToday it's five point five billion dollars in debt it was a long march to the end the company is seen store closures and tumbling stock in recent years I met a constantly changing retail landscape dominated by Amazon e commerce and big box discount retailers\nIt's chapter eleven filing allows the company to reorganize and perhaps emerged from bankruptcy with some of its businesses still alive Emily Sullivan NPR News\nSaudi Arabia continues to deny it was involved in the disappearance of possible murder of prominent Saudi journalist Jamal ... NPR's Jackie Northam reports President Trump said in an interview there would be powerful consequences if it's discovered Saudi Arabia\nCBS is sixty minutes program the suspected murder of Jim ... was terrible and disgusting and that there would be severe punishment if it was discovered Saudi Arabia was involved\nAnd ... the Saudi Government issued a statement that rejects any threats or a chance to undermine that in Warren get any economic sanctions were placed on the kingdom it would respond with what it called greater action\nOn Sunday the king the stock market plunged as much as seven percent before rally slightly assigned to show the case may be having an impact on the economy Jackie Northam NPR News Washington\nThe national weather service has posted flood warnings in parts of south western Texas there's been flooding in West Texas as well over the weekend searchers locate the body other third person up for re swept away by flooding you're listening to NPR\nThis is not important nine do you mean you are good morning I'm bugs in Boston or new to me you are poll out this morning shows nurses are evenly divided on Massachusetts ballot question number one a referendum on whether to require nursed a patient staffing ratios and hospitals\nForty eight percent of nurses polled plan to vote yes on question one forty five percent plan to vote no it was seven percent are undecided Steve ... is president the massing polling group which conducted the poll for the old you are you are\nWe the nurses split on the question so you see all the signs out there and nurses say yes on one nurses say no on wind and really they're both right and they're both wrong he's got about the same number on each side\nOnly Fifteen Percent of nurses believes staffing ratio should be decided by the ballot initiative the poll has a margin of error a four point for present at a closer look at the numbers by visiting W. B. U. R. dot org\nSenator Elizabeth Warren says a new DNA test proves she does have Native American ancestry the task or did your campaign provided to the Boston Globe says Warren has a Native American ancestry dating back six to ten generations\nThe analysis was performed by a prominent Stanford University geneticist who found that most of orange ancestry is European\nWere in his face repeated criticism for years about or claims of native ancestry\nBoston city council or is that I hold a hearing to discuss the dark clothes electric scooters in the city the company bird rides dropped the scooters in Somerville and Cambridge without permission over the summer but pulled out after those city you started and pounding the vehicles\nThe ... excuse me the MBTA will spend at least one hundred million dollars to replace the commuter rail drop bridges at Nord station in Boston\nThe T's new assistant general manager tells the Boston Globe it'll also add two new tracks and an extra platform to improve traffic in and out of the station is six six\nWe're funded by you our listeners and by Dana Farber Brigham and women's Cancer Center bridging science in humanity with new treatment options including personalized cancer vaccines a liquid biopsy to determine cancer treatment is working\nAnd therapies based on a patients' genetic profile learn more at you have a dot org\nAnd campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template dragging drop email editor and twenty four seven customer service more campaign monitor dot com\nSpores Red Sox beat the Astros having five last night at Fenway to tie their American League championship series at one when each Jackie Bradley juniors three run doubled and the third inning but the socks off for good so I've started David Price lasted until the fifth inning he gave up for runs walk for an struck out for\nIt wasn't the the line I Dreamed up a house and I thought it on our office or defensive everybody rally together this was a year and whenever starters needs to be picked up you know they've picked us up and vice versa sells big\nGame three of the series will be tomorrow in Houston Red Sox aids Chris sales spent last night in the hospital with what's being called his stomach element it's unclear when he'll rejoined the team\nAnd then when the patriots stopped the Kansas City chiefs forty three to forty last night in ... one on a last second field goal by Stephen Kowalski bats visit the Chicago Bears next week\nGraphic Ninety three north in Quincy crash blocked one of the center lanes at Fredericksburg parkway the mass pike east bound who's twenty minutes now from four Ninety five to one twenty eight and rent one south is low from Berlin fails parkway to Salem straight forecast rain coming today starting ... hours by around midday\nShould get to the low sixties today heavy rain and a thunderstorm possible tonight before the rain moves out in the forties tonight\nSunny both tomorrow and Wednesday it'll be in the fifties both days in Boston now forty seven degrees thirty seven and Westboro forty in Salem and thirty six degrees and Bridgewater had six oh nine\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin President Trump says the U.S is trying to figure out exactly who is behind the disappearance and alleged murder of journalists ...\nThe president told sixty minutes that is the top leadership in Saudi Arabia is responsible there will be severe punishment Saudi Arabia continues to deny any involvement and said that if the U.S imposes sanctions it will retaliate\nThis was one subject covered in a wide ranging interview that aired on CBS last night with President Trump\nNPR's White House correspondent Ayesha Rascoe joins us now going good morning so Turkish investigators say a democracy Yogi was murdered in their country on the order of the crown prince of Saudi Arabia Mohammad bin some on which would prove very complicated for President Trump who has sought to develop closer ties with him\nDid President Trump in this interview outlined what the severe punishment might be as Saudi has proven to have been behind this\nLater this afternoon on all things considered winning re election should have been relatively easy for Republican congressman Duncan Hunter\nNow he's under indictment for embezzling campaign cash and his opponents are young Latino Palestinian is making it a close race\nYou can listen to that story by asking your smart speaker to play NPR or your local member station by name [noise]\nThis is NPR News Boston largest radio newsroom WB ... gives you a range of coverage you can't find anywhere else from Somerville to Silicon Valley this is Ninety point nine WVU art Boston is NPR News station\nComing up on ... hours MORNING EDITION the latest installment of the W. B. U. R. podcast called last scene looking into the long unsolved Gardner Museum\nArt heist today the FBI investigation\nSupport for NPR comes from W. B. U. R. and from the Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security healthcare and science and technology leadership brown dot edu slash NPR\nT Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence and campaign monitor an email marketing platform used by more than two hundred thousand customers worldwide\nWith email tablets are dragging drop email editor and twenty four seven customer service more campaign monitor dot com\nNow the forecast a wet day today hears WVU are meteorologist Epstein\nIf you haven't put your heat on just yet you may have to buy the middle part of this week\nWe've got a real culture shock coming in for Thursday but first let's get to the showers they're going to arrive today temperatures in the lower sixties they become most numerous this evening through about midnight temperatures tonight fall down to the mid forties tomorrow it's a beautiful day mid fifties with sunshine almost a repeat on Wednesday mid fifties was sunshine Thursday that\nCool air from Canada's really here only in the mid forties plenty of sunshine but that the average for the first week of December friday we weren't back up against the Mississippi's what's on China right now that we can look seasonable perhaps some showers\nIn Boston now it's forty seven degrees it takes money to\nFunding for WVU our weather reports comes from Cambridge trust for a hundred and twenty eight years building in protecting well from what really matters to their clients\nMore at Cambridge Trump dot com primary banking wealth management of their supporters include Bentley University there and the a and master of science graduates get the technology and the data skills\nNeeded for today's most in demand job learn how a Bentley graduate degree in advance your career at their fall open house on November third registered today a Bentley dot edu slash open house [noise]\nAnd they can to talk of already coming up today on point top journalist open up their notebooks and look ahead to the week's news at home and abroad\nPlus Stephen Walt on U.S foreign policy failures he says it all traces back to what he calls a liberal Gemini and the idea that the u._s. can spread democracy without accountability won't says it's time for more restrained approach that's on point this morning from tend\nTo noon on Ninety point nine W. B. U. R. Boston NPR News station\nThis is ... ... [noise]\nToday we continue our investigation of the Israel or steward Gardner Museum robbery the largest aren't used in history and the latest episode of the W. B. U. R. Boston Globe podcast\nLast seen we're focusing on the FBI investigation and who the authorities they might have traffic the yard joining us now\nOur senior producer and reporter for lassie and Kelly horn Hi Kelly Hi, Bob and the first time hallowed a senior reporter jak road ... good morning jak morning to you so in past episodes Kelly we've looked at what happened during the Gardner heist whether it could have been an inside job or have some connections to Boston mobster isn't this week\nAs we said you look into the FBI's investigation of the heights well\nThat's right and what we've discovered is that the FBI investigation has been very close let the FBI\nIn the last time that they spoke publicly about the high schools in two thousand Thirteen that was five years ago they called it a final chapter and and we think that's been a pretty long final chapter and so we just don't know what we don't know but we do know what they said five years ago and that's the sort of jumping off point for this episode\nAll right so let's listen to some of that twenty Thirteen news conference now what you're going to hear is the agent in charge of the Boston FBI off his back then Richard dory\nFor the first time we can say with a high degree of confidence were determined that in the years since the south the art was transported to Connecticut and to the Philadelphia area for example recently were determined to approximately a decade ago some of the art was brought to Philadelphia where it was offered for sale\nKelly how did the FBI come to that conclusion\nThat's exactly what we wanted to know uh they mentioned Connecticut they mentioned Philadelphia they don't mention Maine but that's in fact er we began this a episode because there was a lead that came in a does to the FBI and to the Gardner Museum separately ... different informant who said you want to check out not just this house\nBut a hiding space in this house that art was there and they're talking about house in\nMay you're talking about housing Maine and so we now that uh that was that house was found that has his check\nThere was no art found but the hiding space it had been described was found the former owner of that house man named Bobby gr anti uh was said to have given to paintings in Maine parking lot to another guy named Bobby Bobby gentile\nIt is believed that Bobby gentile traffic the art to Philadelphia at least that was the working a premise that the FBI was going on\nSo jak you went to Philadelphia to look into all this and you talked to law enforcement officials were did you find\nWhat I found was retired federal prosecutors and retired FBI agents who did not believe the Boston FBI story\nAnd they just look me straight in the face and said if something this valuable had been on the black market in the hands of mobsters in this city who they say we're not the most sophisticated kind of guys\nThey would have found out about it when they were pressuring them because they got them on drug dealers on murders on extortion is the the counter parts of the Boston FBI in Philadelphia I don't believe this story that the FBI stood at a podium and told the world\nSo jak you looked into Bobby gentile of ... a person long fought to be connected to the Gardner Museum I used in some way where did you find\nSo Bob gentile is a a Connecticut mobster and what we know is that he had ties to mobsters in Boston\nAnd he had ties to mobsters in Philadelphia and he was never really a part of the gardener investigation until that house in Maine that Kelly mentioned and uh the widow of the individual who own that house said my husband Bobby\nGave the paintings to this other Bobby Bobby gentile and ever since then the FBI has put tremendous pressure on Bobby gentile they've set him up on a sting twice and he's sitting in prison right now till the end of this year\nIn which he will get out again at the age of about eighty two to this day Anthony and more that had a security told us that he firmly believes ... knows something about the gardener heart and if he's sitting on that information\nKelly or after you looked into the Philadelphia lead what do you think uh FBI on the right trail or not\nI think they thought they were on the right to round but I Know one down in Philadelphia on either side it till I was able to confirm that there was a reporter down there who knows the Philadelphia mob inside and out and he said that these guys couldn't even unload\nA Lamborghini at one point or what are they going to do with with masterpieces impossible so we we don't think that this big reveal from two thousand Thirteen really hold any water\nA lot more on this latest episode of the fog cast last Gene Kelly horn senior producer and reporter thanks for joining us about the same to you jak wrote all ego senior reporter lassie thank you for having us [noise]\nNext week on WB you ours MORNING EDITION we have a new leader in the Gardner investigation French gangsters in Miami [noise]\nYou can download the first five episodes of last seen on apple podcast or wherever you get your body can listen on our website for for instructions on how to download a broadcast visit WVU R. dot org slash lassie [noise]\nBowling for less scene is provided by a D. T. A. D. T. twenty four seven monitoring designed and installed for you for more information visit a D. T. dot com and by Samuel Adams Sam adams Boston longer route with one hundred percent heirloom crops\nSamuel Adams dot com bust severe company Boston mass save a responsible\nListening to Ninety nine do would you be you are coming up on WVU ours MORNING EDITION\nOver British prime minister Theresa May's plan for brags exiting the European Union it's six twenty nine\n... supporters include fiscal presenting their new Web ... meetings used by fortune five hundred companies were next allows users to connect on video meetings in real time with a single click more at ... dot com slash go slashed to sweat acts\n... is will be very much in opposition to a Trump White house\nJust the way the Democrats in Congress President Obama's legislative agenda die the minute canter and his fellow Republicans took over when they won the house in twenty ten\nLike it's no fun to be in perpetual minority I can tell you that and especially in the house where a\nSimple majority gives you almost absolute power to set the agenda and get bills across the floor that will greatly affect their willingness for some who had been at it for a long time and make the decision whether maybe they should retire or not\nCancer things more Republicans will head for the exits if they lose but Karl Rove former top advisor to President George W. Bush has a different prediction about how Republicans will react if they lose the house\nI think there will be miserable and voted there'll be miserable because they're in the minority there will be voting because look if the Democrats take it by narrow margins it will be deep divisions within the Democratic party\nAnd Republicans who are experts that opposition will do their best to exacerbate those democratic divisions\nThere'll be other changes in store for Republicans if they lose one or both houses President Trump without control of Congress could decide to triangulate he's already talked about making deals with Democrats on infrastructure for instance and that could lead congressional Republicans on the sidelines\nTrump has never hesitated to throw an ally under the bus says Doug high the former communications director for the RMC\nIt could be bad for Republicans if he tries to do that but it could be good for Trump for his own personal political goals I think the challenge for a lot of Republicans is what is good for Republicans in what is good for Trump or not necessarily the same thing\nAnd something else will happen if Republicans lose big in November their ranks in Congress will get smaller but also whiter older more male and much more conservative in other words more like the Trump the base of the party\nFormer house Speaker Newt Gingrich says even if the Republicans lose even if they privately blame Trump for their loss and even if he cast them aside to make deals with the Democrats they'll have no choice but to stand by him\nThe Republican Party first of all is gonna be the Trump party you know he's consistently at forty to forty three forty four forty five percent approval 'cause he's at eighty eight or Ninety or Ninety two percent among Republicans\nSo Gingrich says Republicans will have no choice but to become even more committed to Donald Trump after November\nThe first thing they'll say the morning at the election is we're dedicated to the luxury election of Donald Trump and that becomes the overriding goal\nAnd if they managed to hang on to power in Congress Republicans will still have the task of showing the country they can govern\nThat means funding of all replacing Obamacare overhauling Medicare and Social Security accomplishments that looted them over the past two years and if they keep the house they'll certainly have a narrower majority making it all even harder Mara Liasson NPR News Washington\nYou're listening to NPR News\nI'm not the point nine do you mean you are coming up federal trial begins today over Harvard's admissions policies also if you're a pet owner you know how hard it is to make that decision to put down your pet new survey finds it's tough on vets to\nForecast rain today then son the rest of the way through friday here's WVU are meteorologists de ...\nWe have a few showers around the area of the first part of the day but a much better chance the second half it into the first part of the evening\nTemperatures this afternoon into the lower sixties tonight down into the mid forties by morning guys will clear that sets us up for a nice day Tuesday sunshine mid fifties ... with the wind in the afternoon Wednesday sunny mid fifties Thursday sunny only in the mid forties that's average for the first week of December ...\nIn Boston now forty seven degrees were\nFunded by you our listeners and by common threads wheezing stories across time at the Gardner Museum see how artist redefined textile art through multimedia music and metal work through January thirteenth\nZoom zoom offers cloud video conferencing online meetings and a video conference room solution and one platform featuring digital video and audio is green cheering account registration and more and zoom dot US\nAnd farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nNow Boston I'm exposed is a federal judge in Boston has rejected Westford base ... North America is efforts to dismiss a lawsuit that claims it infringed on patents owned by rivaled shoemaker Nike\nWho Mossad the suit should be tossed because the patents involved are abstract but a judge rejected that claim saying Nike has enough facts to continue the case Boston based General Electric\nA cell therapy treatment for leukemia the founder of zenith technology to oh the Irish Times the treatment personalized medicine by harvesting good cells and blowing them outside the ball to you before re injecting them ... sixteen officers around the world including one in Cambridge\n... forty five\nFunding for WVU ours business report comes from MIT system design and management flexible master's program in engineering and management\nEducating future technical leaders in the design and engineering of complex products and systems open house virtual info sessions tomorrow at six PM register at S. D. M. dot MIT dot EDU\nThis was do do you are on Bob ... beginning today affirmative action is back on trial this time the defendant is Harvard University\nThe plaintiffs are minorities Asian Americans who accused Harvard of discriminating against them and it's admissions process WVU ours Gary Young outlines the issues in this federal case\nTens of thousands of people apply to Harvard every year in two thousand for Jaycee was one of them\nI was a nice captain of the school Maxine I had found it and was president of my own current events discussion club\nShe also had a perfect SAT score and a nearly perfect GPA at the time at JC thought her application would be a slam dunk to get one of the coveted spots in the freshman class but in the end\nI was late listed and then eventually I did not get in\nBut she says this whole experience was frustrating because she saw others from her high school will get in with lower test scores an GPA's\nThat just seemed extremely unfair to\nDC is Chinese American we're only using her initials because she's concerned about harassment\nShe says she does wander F. or ethnicity played a role in not getting into Harvard the group students for fair admissions would say it did they're suing Harvard in federal court for alleged discrimination the group says there are hundreds of students like Jaycee out there\nIf you're it so much harder to get in your wife and then look you know black\nThat's Ilya Shapiro a constitutional studies fellow at the ... Institute He supports the students for fair admissions lawsuit which is making several big arguments first the racial composition of Harvard's freshman class look similar from year to year which the plaintiffs argued shows Harvard has a quota\nThe second to claims Asian American applicants have better standardized test scores and GPA's than other ethnic groups but Asian Americans are in the lowest personal or non academic ratings from admissions officials\nWere heard is doing at least according to the conclave filed litigation is that it's using race too much\nSo much pure argues that it's the deciding factor in admissions\nWe believe that the facts established to trial oh we'll prove otherwise\nHarvard president Larry back out weighed in on the allegations with our radio Boston team earlier this year\nWe look for excellence and in other dimensions we look for students who are excellent not just in the classroom but who bring other things to the campus\nUniversity says they do consider race in admissions but it's one of many factors\nRecent Supreme Court rulings have upheld that practice in general but at the heart of this lawsuit is a larger debate over affirmative action several Harvard supporters say this case is more about politics than seeking justice\nJang Lee as a Harvard senior he's siding with Harvard in this case\nI think eventually we are being used otherwise\nWe feel that way in part because of the man spearheading this case Edward Blum\nThis is the latest ... challenges against affirmative action he was also behind another race sensitive admissions policy lawsuit Fisher versus the University of Texas bloom ultimately lost that case and the Supreme Court in twenty sixteen\nI think like angry and frustrated 'cause like there's like white guy I'm saying but he supports like Asian American their agenda when actually if you will cause track record it's very clear that he doesn't care about Asian Americans or people of color\nLee has been working with a group siding with Harvard but there are Asian American groups on both sides of this issue and we're bloom declined a request for an interview but people close to him like Ilya Shapiro say the issues of this case go beyond Asian Americans\nAs a society we're or race doesn't matter where government treats us all the same regardless of skeptical I share the Asian American applicants during the jerk but for her because most start illustrates the problem\nAnd Avi FX advanced audio video and lighting services for meeting planners event producers and trade show managers and the FX dot com our passion shows\nFrom Boston University or listening to the point nine WVU are FM Boston home of Boston largest radio news rum Ninety two point seven dogs ...\nEighty nine point one WB wage rooster and streaming told you be you are dot org old you are you are all students NPR News station\nMay be a if it's government played a role in the desert journalists your mouth or choking today is Monday October\nMorning and there is a\nGood morning I'm Bob ... coming up President Trump's promise on CBS is sixty minutes but he said it's unclear if the Saudis are responsible for good show games that\nThey deny it denies every way you can imagine in the not too distant future I think we'll know and that's\nAlso there's our President Trump today visited Florida and Georgia survey damage from hurricane Michael\nOnce dominant retail giant seniors filed for bankruptcy and a new dog you but you are full of Massachusetts nurses finds them evenly divided on valid question one mandating nurse step level's Red Sox the patriots both wind and the forecast rain coming later today highs and lows sixty\nSeven oh one now the news\nLive from NPR News in Washington ... Coleman President Trump is scheduled to visit areas in Florida and Georgia today that were ravaged by hurricane Michael storm is left at least Seventeen people dead across several states and the vast amount of destruction\nDozens of people are still missing especially in the Florida Panhandle cell phone service is spotty authorities don't know if people are unable to check in with loved ones\nThe c._e._o. of banking giant J. P. Morgan has canceled plans to attend to Saudi investment conference later this month NPR's Emily Sullivan says this follows the disappearance of well known Saudi journalist Jamal ... other leaders throughout the world are grappling\nWith the Turkish government's allegations that can show he was killed by Saudi officials in Istanbul this month\nPresident Trump has threatened severe punishment if the Saudi royal court just behind the journalists disappearance\nSo he said they'd retaliate with greater action its state run news agency notes that country place quote an influential and vital role in the global economy J. P. Morgan has a longstanding business relationship with Saudi Arabia the company hasn't elaborated on the reasons for its cancellations\nOthers have withdrawn from the conference including over in Ford Motor Emily Sullivan NPR News Washington\nIn Germany conservative parties that are allied with Chancellor Angela Merkel's party have been dealt a major loss in Sunday's regional elections in the area from Berlin NPR's Soraya Sarhaddi Nelson reports of far right party has benefited from voter anger\nIt's the first time in decades that the Christian social union or see su is losing its majority rule in Bavaria\nThe reason was a protest the link to anger over Muslim migration Germany German public broadcaster A. R. D. estimated a hundred and eighty thousand former C. su voters cast ballots for the far right alternative for Germany\nBut not every frustrated Bavarian voter turned right\nThe second biggest winner was a left leaning environmentalist Green Party to see his use expected to partner with that party or with the liberal free Democrats in a conservative coalition called the free voters that way to see is you can continue to govern Germany's most prosperous state psoriasis or how do you Nelson NPR News Berlin\nCalifornia utility Pacific gas and electric had switched off the power to about sixty thousand customers in\nAbout a dozen northern California counties\nUtility spokeswoman Dana ... says there are extreme fire conditions and the power company does not want it's equipment to trigger any blazes we would only do this and a last resort and extreme weather conditions the utility says that strong wins in the region could gust up to fifty miles per hour\nIconic retailer Sears is filing for bankruptcy the company that supplies everything from watches to washing machines missed a debt payment of one hundred thirty four million dollars it has five and a half billion dollars of debt this is NPR\nThis is not important night do you view are good morning I'm bugs in Boston\nMassachusetts nurses are almost evenly split on the November ballot question to mandate nursed a patient ratios at hospitals interstate WVU ours Martha Bebe gr as the results of a new WVU our poll out this morning\nThe w._b. or pool of five hundred registered nurses finds forty eight percent support the measure hiding under doubt a nurse for almost forty years says she'll do yes to assure nurses can provide the best possible\nCare not having a short one because you're having to work really hard to keep another patient safe\nBut forty five percent of nurses including Caitlin handles say they'll vote no\nBecause I don't think the law the way it's written is going to be affective they don't think it's going to increase patients' safety the poll finds\nWidely different experiences for Massachusetts nurses that will influence their vote around job satisfaction workload and confidence that ratios will or will not lead to closures and higher costs for Ninety nine W. B. U. R. I. Martha ...\nPoll has a margin of ever a four point four percent you can see the results or W. B. U. R.\nYear to vote in the state for the November election is Wednesday residents in sign up at their local city in town clerk's office or at the secretary of state website\nSenator Elizabeth Warren ... as a new DNA tests prove she's part Native American words campaign released a video this morning detailing the test would show she has a Native American ancestor dating back six to ten generations\nWere and has faced repeated criticism for years about or claims of native ancestry which he defended and the video\nI'm not even wrote in his prime only trying to determine tribal citizenship I understand ... thinks family history in my family history\nThe video also features President Trump and other Republicans who've been critical of Warren's claims of native ancestry\nThe south Boston bypassed road that links interstate Ninety three with a seaport is now open to all drivers highway officials say drivers will also be allowed to use the carpool lane linking Ninety three north with Ted Williams tunnel under all yearlong pilot program it's seven six\nWere funded by you our listeners in Boston interior store white event featuring furniture and accessories for your living room dining room and bedroom Boston interiors dot com for locations\nExtending now offering plans with extending the mobile and extend to the Internet details that extending the dot com or one eight hundred extend any restrictions apply\nAnd progressive insurance comparing car insurance rates from multiple insurers so shoppers can evaluate options in one place now that's progressive comparisons available at progressive dot com or one eight hundred progressive\nSports you're American League championship series is not a bad one way and each thanks to the red Sox seven five win over the Houston Astros at Fenway last night ... went to for for scoring twice and driving in a run game three is tomorrow in Houston\nKnowing when patriots won their third straight game forty three to forty over the Kansas City chiefs and Fox borough last night WB you are as Jim Foley was their\nQuarterback Tom Brady completed a thirty seven yard pass to tighten Rob Gronkowski in the final minutes to set up the game winning field goal brief says that completion stands out as a pivotal moment of the game\nYou gotta match up and made a big play he's been making a lot of those as career I'll keep throwing him and the biggest moment\nFor the first time in Twenty one months pretty wide receiver Julian Edelman connected for a touchdown next Sunday the patriots will play the Chicago Bears for Ninety point nine W. B. U. R. I'm Jim Foley Gillette Stadium in ...\nTraffic one twenty eight north in debt um there's a crash at ... one Ninety three north is and a half hour from the brain trees led to Columbia road Andrew three south is low from root for and chums for two conquered road\nForecast rain coming today starting ... hours by around midday it gets to the low sixties today heavy rain and thunderstorms\nPossible tonight before the rain moves out in the forties tonight sunny both tomorrow and Wednesday it will be in the fifties both days sunny and just in the forties on Thursday and Boston hour at forty seven degrees forty one in ... thirty nine degrees in Peabody and forty one into bed for ... seven o nine [noise]\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep Seventy three years ago president Franklin Roosevelt met Saudi Arabia's king on a U.S navy ship\nThe two nations have been allies ever since despite profoundly different governments and different ideas of human rights so could the alleged Saudi killing of a journalist really in danger that alliance with asked by sixty minutes President Trump emphasized how much the United states has to lose\nThey order a military equipment everybody in the world wanted that order Russia wanted it\nChina wanted it we wanted it we got it so would you cut that off like well what I don't want to do going Latino race in all these ... I don't wanna hurt jobs I don't want to lose in order like there are other ways of a ...\nIn recent years Sears has been closing hundreds of stores selling off its famous brands while piling up dead a bankruptcy filing today might be its last chance for survival\nProviding three hundred million dollars in financing to keep the doors open for what appears to be a do or die holiday shopping season David Schaper NPR News Chicago [noise]\n\nThis is NPR News this is do you view are coming up on WB you are is MORNING EDITION a new W. B. U. R. poll of nurses on ballot question number one which would mandate nurse staffing levels\nThis is W. B. U. R.\nFunded by you our listeners by NBC ten Boston presenting the day's news every evening with Shannon malaria and Philippe off on NBC ten Boston news at six and eleven Mass General orthopedics with the highest ranked orthopedics program in New England\nMass General can help you get back to the life you love Mass General revolutionizing\nBoarding and the school in southern New Hampshire was a culture of curiosity kindness and fun grades nine to twelve open house November fourth doubling school dot org\nNow the forecast rain coming today hears do to be you are meteorologist stay up steam\nScarves become mostly cloudy for today and the early morning sunshine fades away from showers developing temperatures the lower sixties\nShowers become more numerous Windsor gusty this evening even some downpours temperatures down to the forties tomorrow sunny mid fifties Wednesday sunny mid fifties Thursday it's like the first week of December we're only in the mid forties sunshine mid fifties with sunshine\nIn Boston now it's forty seven degrees that seven Twenty one [noise]\n\n... founding partner of Davis moments the Augustine WVU are undermining\nDavis mom we work to help our clients understand the often complicated legal issues to confront their personal and business like this is similar to the mission of WB you are educators blisters must issues that affect their lives are climbs thank us for our supporters WVU makes us feel good we're doing something for the community\nFor more information about underwriting called six one seven three five three four five one\nSupport for NPR comes from W. B. U. R. and from Amazon Web services used by millions of customers a job with us provides a range of cloud services and\nFunctionality from tools to security to compliance for information and build on dot the ws had less of a collaboration software company powering teams around the world permitted to providing the tools and practices to help teams play on track build and work better together\nMore than ...\nCapital one offering a variety of credit card options with features for a range of customers for foodies to travelers capital one what's in your wallet credit approval required capital one back USA and ...\n... what are the nurses' day that's a question many Massachusetts voters have been asking as they consider the ballot question that will just average by law how many patients are hospital nurse can handle at any given time\nWell it looks like nurses are about as divided as everyone else on this\nNew told you be you our poll out this morning find forty eight percent of the nurses in this state plan to vote for question number one and the new law\nForty five percent are against it seven present are undecided WVU ours Martha ... spoke to a sample of the five hundred registered nurses we surveyed\nIt's eight PM and pitch black outside a coffee shop in South suburban Boston a nursing Kelly sinks into a chair after her twelve hour shifts at a hospital down the street I'm\nKelly had her usual three patients today on award that's one step down from intensive care but they had extensive ... and Kelly only paused for one thirty minute break Kelly asked that we only use her first name because she says her hospital administrators are pressuring nurses to vote no on question what Kelly\nPlans to vote yes we fight for our patients every day that's part of our job and I can't think of a better way to fight for our patients and to ensure that there's enough staff on to take care of all their knees there is\nNo consensus though among nurses about how many is enough\nKelly is among the forty one percent who say all or most of the six levels of nursed a patient ratios spelled out in the ballot question are appropriate\nBut thirty eight percent of nurses don't agree with most or any of the proposed ratios and fifty six percent say they're just aren't enough nurses to make this law work\nMy name is Caitlin Hamel and I've been a nurse for Thirteen Years\nHamel who works in ICU North West of Boston is voting no in part because she says she's worried about how hospitals would meet the required ratios which would take effect fifty six days\nAfter the election they're going to have to pull nurses away from mental health beds and the state is really short on mental health beds already\nAbout half of nurses say if the ballot question passes hospitals are likely to close units or close altogether many hospitals already assigned nurses the proposed patient ratios on average but the ballot question says hospitals have to maintain those ratios at all times\nAnd nursing supervisors said that's where the additional costs come in\nThat is why Michael good wrote an RN who manages to units at north shore medical center is voting no on question one\nIf this law passes this could be multiple ten million dollar impacts to operating budget so I'm fearful of closure of our hospital in other community hospitals\nThat's just scare tactics says an an ER nurse from taunton who is voting yes and it's also worried about employer retribution she says\nHospitals hold on to nurses and says her hospital has the money for more nurses they spend it on overtime shift daily\nI work like at least eight hours over time a week I got a text almost every day\nIf costs do increase with mandatory ratios Seventy one percent of nurses say it's likely that hospitals will pass them along to insurers which means premiums will rise\nYou know trickle down it will he'll have to come from there I mean there's no other way to pay for the call\nA state report estimated cost could jump by nine hundred and forty nine million dollars a year that moved Jennifer car Loveland who works in a cardiac unit at Mass General it was quite a bit of money [laughter] but perhaps some nurses say money well spent half\nOf nurses say mandatory ratios would improve patient's safety Nineteen percent safety would get worse and twenty nine expect a mixed outcome or no change it all one in four nurses say they have seen someone harmed during a time when they're nurse had too many patients\nHeidi hunger doubt a nurse with almost forty years of experience will vote yes remembering the times she feels she has let patients down\nI'm not going to say that somebody's died or anything like that I don't have that personal experience but I Do have had experiences patients and family members getting very angry at you because they're not they're feeling like they're not getting their due time from you\nHunker down works at Brigham and women's where she's a member of the Massachusetts nurses association the union spearheading the yes campaign among union nurses support for the ballot question rises to sixty percent with thirty three percent oppose\nOverall the poll results very because nurses experiences very says Steve ... president of the mass in polling group which conducted the poll for WVU are\nNurses who say they're gonna vote no are more likely to be very satisfied with their job they're less likely to say they feel overloaded or have too many patients America less likely to have seen negative consequences as a result of hostile for ratios I mean just side is pretty much the opposite\nA split among nurses mirrors a split among voters seen in several recent polls\nThat's frustrating to nurses who've been lobbying for set patient ratios for more than two decades at the state house and now through this ballot question well only Fifteen Percent of nurses say a ballot question is the best way to establish safe nursing rules many nurses say the vote will feel like a referendum on there were\nCan\nMaple nursing Carey another yes voter who worries her hospital will retaliate has joined Kelly at the coffee shop\nI feel like we're just at a loss and we're kind of defeat in\nTheir post work conversation drifts to divisions the ballot question is driving between nurses this is Kelly again\nIt's so sad that some things [noise] that although not may not be the best way to do it with created to try to\nProtect ourselves and protect patients and so divisive among the people that they're trying to say\nIt will be awhile says Kelly before things calm down regardless of what voters decide about nursed a patient ratios on November sex for Ninety point nine W. B. U. R. I'm Martha Bebinger [noise]\nDo you are by Hubbard registered nurses shows a margin of error of war point for who sent me the full results do hold you be you our daughter WVU\nCockpit check our system\nWhy why why why are\nYou hearing all the warnings that the yeah yeah yeah that's normal okay\nHow can we run through all the checks ready to take off [noise]\nPlugged into the internal radio system with your helmet on you can barely hear the war of the plane\nFor Ukraine the presence of us air force more warplanes from NATO members Poland and Romania\nIs a huge deal Russia annexed Crimea and twenty fourteen and foment an armed uprising in eastern Ukraine\nThat continues to this day at first Ukrainians received western political support in the confrontation with Russia but now the Trump Administration is supplying Ukraine was lethal weaponry and last month Ukraine's president Petro Poroshenko wasn't Baltimore receiving two former U.S coast guard vessels\n... also came to chat with the fifteenth pilots at the exercise and after ten of Colonel Chris ... whether you had flown in any of Ukraine Soviet era warplanes\nHeavy hitters slides and I suppose a a\nR I actually had a dog and pony nines yesterday in training [noise]\nMajor general claim garrison is in charge of the U.S forces and the exercise I think about it they're engaged in a conflict right now with a pure competitor\nSo they obviously have things she teaches and plus they're flying equipment that we don't have access to in the United states\nThe U.S and its NATO allies hold dozens of exercises every year as does Russia but these exercises are growing in size in September Russia held his largest maneuver since Nineteen eighties that included a significant Chinese contingent in NATO was about to hold its biggest exercises in the Cold War in Norway\nWith Americans could provoke Russia we are so bitter and independent states and the only Ukrainian people will decide that we do not off the boat mission from Russia what we should do and also the commander of\nThe Ukrainian airbase colonel yet ... says he's happy to be hosting the Americans so he could not have imagined just drilled just a couple of years ago\nYesterday I had the chance to fly in and asked if he didn't it was quite a pleasant experience but my ... better that's my\nPlane back in the air with contended colonel sport Fager I've just experienced seven times for his reputation will pull out my body I've left the horizon [laughter]\n\nYeah now I Want to put down here are shut down that John\nStar lord [laughter] what are\nOur mission maybe coming to him and many Ukrainians hope this is just the beginning cranes bid to join NATO was on hold for now but the government believes exercises like this will prepare for eventual membership\nIn the western alliance [noise] this is Kim NPR News started ... [noise]\nIt's NPR news\nThis is not important nine do would you be you are a head on MORNING EDITION the last second wind by the New England patriots last night forecasts\nSome rain today than some the rest of the way through friday here's W. B. U. R. meteorologist ... we\nHave a few showers around the area of the first part of the day but a much better chance the second happen into the first part of the evening temperatures this afternoon into the lower sixties tonight down into the\nMid forties by morning guys will clear that sets us up for a nice day Tuesday sunshine mid fifties big dusty with the wind in the afternoon Wednesday sunny mid fifties Thursday Sunday only in the mid forties that the average for the first week of December milder per friday\nForty eight degrees in Boston now at seven forty four\nWere funded by you our listeners and buy for Tex fueled by the needs of patients families in healthcare providers verdicts invest in science to strike at the core of serious diseases V. R. T. S. dot com\nThe alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement\nMore an alliance for lifetime income dot org and zoom zoom offers cloud video conferencing online meetings in a video conference room solution and one platform featuring digital video and audio screen sharing\nRegistration and more and zoom dot us\nNow by Austin ... is the greater Boston convention and visitors bureau expects the head of the Charles regatta this coming weekend the generate more than Seventy two million dollars in economic activity eleven thousand athletes will compete two hundred and fifty thousand spectators are expected\nRegatta executive director Fred scotch says hotels are hard to find\nI Know some teams that actually booked rooms in New Hampshire cause of a slightly lower rate Brooklyn and Newton bolt them all those areas hotels and restaurants feel the impact of the Charles\nThis will be the fifty four year for the head of the Charles regatta it's seven forty five\nFunding for ... business report comes from hillside school a structured environment with us seven to one student to teacher ratio\nFor boys grades five to nine offering a rich curriculum was he arts and competitive athletics he'll say graduates confident young leaders open house this Saturday innovation in education he'll high school dot net [noise]\n\nNext we turn to the effort to total the damage damage from hurricane Michael which had Florida's panhandle last week NPR's Camila Domonoske reports since hurricane Michael hit impassable rather than non functional phones made life difficult for residents and rescue teams and for insurance gestures\nWhy don't we just start ... forty miles across\n... networks and the fried division of tower hill a Florida homeowner's insurance company over the weekend he caught ... near Panama City there were still places it wasn't safe for his team to travel\nFor the situation like that we're relying on aerial and things like that and decided to look at it\nAnd it wasn't just buildings that were devastated by the storm\nA lot of areas for the last generation of timber poultry farms are hit pretty hard and the car industry is devastated\nChris Chandler isn't adjuster with alpha ensure\nCounty caught was ready to beat it last week and a sixty Seventy a hundred miles per hour winds just blows it away but last April source of income us our livelihood\nReally estimate suggests this hurricane caused billions of dollars of damage Fitch Ratings says the insurance companies will have substantial cost but it's also says the industry has quote well positioned to absorb the losses\nAnd yeah that's what insurance companies are supposed to do but in Florida in particular every big storm raises worries that the industry will just fail\nAfter Hurricane Andrew in Nineteen Ninety to many companies went bankrupt our backed away from having coastal areas so we had some good news is the analysts say that's not likely to happen now with communities are still facing a long difficult recovery Chandler and Alabama says the damages upsetting\nYou wish that you could just snap your fingers and make everything back to normal obviously that's not going to happen or you know when you're you're talking to people that house was destroyed\nAll their belongings showed pictures no amount of money is going to get an image back of your of your parents that are passed away because your child first birthday\nWhile some things are lost forever he says communities are already working together to start to rebuild can you hold on a ... NPR News\n[noise]\nAcross the country prison discipline come down harder on winning you can give written up for not closing your door you get written up for jumping on the phone without permission and low level infraction can have severe consequences like\nMore time it was sad because I'm a I'm\nAn NPR investigation has afternoon on all things considered from NPR needs it's all things considered today from forty six thirty ... point nine WB you are\nComing up on WB you are is MORNING EDITION of timing what's behind the DNA test and video release just this morning by Senator Elizabeth Warren honor Native American ancestry\nAttend this morning it's on point with magnet charcoal party and the first hour today a look at that we get in the news in the second on point our at eleven\nThe fresh calls for more restraint and limited approach to the U.S role in world affairs that's on point today on W. B. U. R.\nOrgasm showers coming today than heavy rain or a thunderstorm tonight in the sixties today in the forties tonight as you'd clears then both tomorrow in Wednesday's hunting in the fifties chili on Thursday will be in the forties and sunny on Thursday in Boston now forty eight\nDegrees were funded by you our listeners and die TST bombs didn't cross platform IT provider with twenty six years in business more AT T S P Boston point ... me Cambridge trust for a hundred and twenty eight years\nLargest radio news rum Ninety two point seven WB wages were eight eighty nine point one double ... Brewster and streaming at W. B. U. R. dot org you'll be you are all students NPR News station\nResident in Trump believes today for Florida and George road to review storm damage after hurricane Michael is Monday October Fifteen\nWVU ours MORNING EDITION [noise]\nGood morning I'm Bob ... coming up the president's hurricanes or the death toll from Michael's answered Seventeen but dozens are still missing also what's at stake for Republicans and Democrats in the elections next\nMonth yeah Republicans are unable to maintain their majority democratic rule will be very much in opposition to the Trump White house\nAnd this hour a new Boston area's study on how veterans are queasy when pet owners asked them to take that final step with their fat\nWe are in a really difficult position of caring for patients maybe for their entire lives and then be able to\nShowers coming today heavy rain tonight\nLow sixties today and said oh one now the news\nLive from NPR News in Washington I'm more of a Coleman today President Trump is scheduled to visit parts of Florida and Georgia struck by hurricane Michael the damage there is severe than the president will review recovery work\nThe storm has killed at least Seventeen people across several states and dozens of others are missing authorities don't know if that's because people cannot check in with loved ones meanwhile electrical crews are working to restore power NPR's Joel Rose reports it will be a couple of weeks before many customers get it back\nThe utility Gulf powers as optimistic about restoring electricity to Ninety five percent of customers who are ready to take it by October twenty fourth two weeks after the storm made landfall that includes Panama City and other areas that were battered when hurricane Michael came ashore last week\nElectrical workers across the panhandle of been working to rebuild infrastructure that was destroyed the storm snapped electric polls downed wires and even brought down high voltage transmission lines Joel Rose NPR News Miramar Beach Florida\nPresident Trump says the suspected murder of prominent Saudi Arabian journalists to Jim ... is terrible and disgusting and CBS interview he said there wouldn't be severe consequences if that's proven to be true\nNPR's Jackie Northam says that Saudi Arabia is warning other countries against imposing sanctions over the matter\nIs that a foreign ministry issued a blistering statement it said it reject any threats\nOr it comes to undermine the government's sure what it called political pressures or by repeating false accusations and you know it warned that if any economic sanctions were imposed on the kingdom than it would respond with what it called greater action and the statement doesn't actually specify what that actually be [noise]\nUm but you know there are signs that this whole situation is starting to affect Saudi Arabia is a con and me on Sunday the stock market plunged seven percent the Fort rallying likely\nNPR's Jackie Northam Harvard University is going on trial today for alleged discrimination against Asian Americans in its admissions policies from member station WBUR GBH in Boston Kirk Carapezza reports the decision could have consequences for some other colleges\nLive by conservative legal strategist Edward Blum the group students for fair admissions is suing Harvard claiming university broadly ranks Asian Americans lower on intangibles like courage kindness and leadership attorney Lee Jang is with the Asian American legal foundation which is supporting the lawsuit\nHarvard the systematically saying that Asian candidates are not likeable and don't have good personalities by orders of magnitude again less than candidates of any other ethnic group which is really nothing but racist\nHarvard denies that charge saying it's admissions process does not discriminate against anybody and pointing out Asian Americans now account for twenty three percent of all admitted students for NPR News I'm Kirk Carapezza in Boston\nYou're listening to NPR\nThis is not important I Do ... you are good morning I'm Bob folks in Boston a new WVU our poll out this morning shows nurses are evenly divided on question number one the ... the November ballot referendum on whether to require a nurse to patient patient staffing ratios at hospitals\nForty eight percent of nurses polled plan to vote yes on question one forty five percent say they'll vote no seven percent are undecided Steve ... is the president of the massing polling group which conducted the poll for WVU are\nWe the nurses split on the question so you see all the signs out there and nurses say yes on one nurses say no on wind and really they are both right and they're both wrong we've got about the same number on each side\nOnly Fifteen Percent of nurses believe the staffing ratio should be decided by a ballot initiative the poll has a margin of error of four points for present\nAre dot org Senator Elizabeth Warren says a new DNA test proof she does have Native American ancestry more on this story from WVU ours damned Guzman\nGenetics expert at Stanford University says the test chose Warren has at least one Native American ancestor dating back six to ten generations in a video released by her campaign Warren says she hopes the results will stop criticism of both her heritage as well as other native people from President Trump and other Republicans\nCan say whatever he wants to be mocking Native Americans or any order to try to get\nThe DNA test comes just two weeks after Warren said she would look closely at at twenty twenty presidential run following the mid term elections for nine point nine WB you are I'm Dan Guzman\nMost of the city councilor today hold a hearing to discuss those dark was electric scooters in the city the comedy bird rides drop scooters in Somerville in Cambridge without permission over the summer but pulled out after the city's started in pounding the vehicles\nThe MBTA will spend at least one hundred million dollars to replace commuter rail draw bridges at Nord station in Boston which he uses is in general manager tells the Boston Globe it'll also add two new tracks and an extra platform to improve traffic in and out of north station ...\nWe're funded by you our listeners and by applied bio math supplying mechanistic mathematic modeling simulation ends analysis to accelerate and the risk drug R and D more it applied biomass dot com\nThe pike school pre K through grade nine in Andover mass open house Sunday November fourth discovered the power of positive energy at pike school dot org\nAnd Charles Schwab who believes are modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more and Schwab dot com\nSplurge Red Sox beat the Astros seven five last night at Fenway to tie up the American league championship series at one when each Jackie Bradley juniors to rerun doubled in the third inning put those hogshead for a good dog starter David Price lasted until the fifth inning you gave up for runs walk for an struck out for\nIt wasn't the the line I Dreamed up to her house and I saw it on our office or defense everybody rally together this was a year and whenever starters needs to be picked up you know they've picked us up and vice versa sells big\nGame three of their series tomorrow in Houston socks eighth grade sales spent last night in the hospital with what's being called his stomach ailments it's unclear when he'll rejoined the team\nAnd then when the patriots topped the Kansas City chiefs forty three to forty last night in ... the parents want it on a last second field goal my Steven goes cow ski mask will visit the Chicago Bears next week\nGraphic on the local area highways this morning mass pike east bound slow from nine in Framingham to Austin route one south is a half hour now from the river Riviera beach park way to the bridge and all but the there are delays of up to ten minutes on the orange line because of a signal problem\nForecast rain coming today starting ... hours by around midday\nGets to the low sixties today heavy rain and a thunderstorm possible tonight before the rain moves out it'll be in the forties tonight sunny both tomorrow and Wednesday fifties both days then suddenly adjusted the forties on Thursday\nForty eight degrees in Boston now forty one in ... new report and forty nine degrees in Fall River at eight or nine [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin President Trump says the U.S is trying to figure out exactly who is behind the disappearance and alleged murder of journalists democracy ...\nThe president told sixty minutes that is the top leadership and Saudi Arabia is responsible there will be severe punishment Saudi Arabia continues to deny any involvement and said that if the U.S imposes sanctions it will retaliate\nThis was one subject covered in a wide ranging interview that aired on CBS last night with President Trump\nNPR's White House correspondent Ayesha Rascoe joins us now come on good morning so Turkish investigators say a democracy Yogi was murdered in their country on the order of the crown prince of Saudi Arabia Mohammad been someone which would prove very complicated for President Trump who has sought to develop closer ties with him\nDid President Trump in this interview outline what the severe punishment might be a Saudi has proven to have been behind this\nDid not and what he did do is outlined what it will not be in that it will not be any sanctions that limit a arms sales are banned arms sales to Saudi Arabia and he made clear that he felt like that would be a\nAnd listen to that story by asking your smart speaker to play NPR or your local member station by name [noise]\nThis is NPR News\n[noise] Boston's largest radio newsroom W. B. or gives you a range of coverage you can't find anywhere else from beacon hill to Berlin this was already going to die W. B. ... NPR News station to head on MORNING EDITION\nAre a pod cast last scene looking into the long unsolved Gardner Museum art heist today the FBI investigation this is W. B. U. R.\nWe're funded by you our listeners and by virtue tax fueled by the needs of patients' families and healthcare providers protects invests in science to strike at the core of serious diseases V. R. T. X. dot com always health partners new choice and health insurance with benefits and programs that put you first\nLearned more it always health partners dot org I'm number of partners healthcare\nAnd Massachusetts General hospital the number one research hospital in America innovative treatments for complex conditions to get you back to the life you love Mass General revolutionizing care\nNow the forecasts WVU are meteorologist de ... says it will be a wet day today\nIf you haven't put your heat on just yet you may have to buy the middle part of this week we've got a real cold truck coming in for Thursday but first let's get to the showers they're going to arrive today temperatures in the lower sixties\nTo become most numerous this evening through about midnight temperatures tonight fall down to the mid forties tomorrow it's a beautiful day mid fifties was sunshine almost a repeat on Wednesday mid fifties with sunshine Thursday that cool air from Canada's really here only in the mid forties plenty of sunshine but that the average for the first week of December\nFriday we weren't back up again to the mid fifties with on China right now that we can look seasonable\nPerhaps some showers in Boston now forty eight degrees you'd say Twenty one [noise]\n\nI'm Peter O'Dowd from markets to elections and technology we rely on poor casts about the future how good are we making predictions the big famous pundits who tend to dominate the news where politics or economics or anything else\nThey don't actually have proven track record scientifically scored track records\nThat's next died on hearing today at noon on Ninety point nine W. B. U. R. Boston's NPR News station\nSupport for NPR comes from W. B. U. R. and for PBS with the eugenics crusade American Experience explores the history of the early twentieth century campaign to breed a better American race eugenics crusade tomorrow at nine eastern PBS\nTerror data working to transform how businesses worked for the power of data using pervasive data intelligence terror data leverage is all relevant data to deliver answers to complex business issues [noise] ... [noise]\nAnd Linda ... bell learning process is committed to helping all students learn to their potential they're learning centers an online private schools offer instruction and reading comprehension eight hundred three hundred a teenager\n\nThis is ... ... [noise]\nToday we continue our investigation of the Israel or steward Gardner Museum robbery the largest aren't used in history and the latest episode of the WVU are Boston Globe podcast last seen we're focusing on the FBI\nInvestigation and who the authorities they might have traffic the yard joining us now our senior producer and reporter for last seen Kelly horn Hi Kelly Hi, Bob\nAnd the first time hello to senior reporter Jacques ... good morning jak morning to you\nSo in past episodes Kelly we've looked at what happened\nDuring the Gardner heist whether it could have been an inside job or have some connections to Boston mobster isn't this week\nAs we said you look into the FBI's investigation of vice\nWell that's right and what we've discovered is that the FBI investigation has been very close left the FBI a declined our interview requests in the last time that they spoke publicly about the high schools in two thousand Thirteen that was five years ago\nThey called it a final chapter and and we think that's been a pretty long final chapter and so we just don't know what we don't know but we do know what they said five years ago and that's the sort of jumping off point for this episode\nAll right so let's listen to some of that twenty thirty news conference now what you're going to hear as the agent in charge of the Boston FBI office back then Richard ...\nFor the first time we can say with a high degree of confidence we've determined that in the years since the south the art was transported to Connecticut and to the Philadelphia area for example recently we determined that approximately a decade ago some of the art was brought to Philadelphia where it was offered for sale\nKelly had at the FBI come to that conclusion\nThat's exactly what we wanted to know uh they mention Connecticut they mentioned Philadelphia they don't mention Maine but that's in fact er we began this a episode because there was a lead that came in a bus to the FBI and to the gardening museums separately and different informant who said you want to check out not just this house\nBut a hiding space in this house that art was there\nThey're talking about how to make it happen\nUh that was that house was found that has to check it was no art found but the hiding space that had been described was found the former owner of that house man named Bobby gr anti ah was said to have given to paintings in Maine parking lot to another guy named body Bobby gentile\nIt is believed that Bobby gentile traffic Tiahrt to Philadelphia at least that was the working a premise that the FBI was going on\nSo jak you went to Philadelphia to look into all this and you talked to law enforcement officials what'd you find\nWhat I found was retired federal prosecutors and retired FBI agents who did not believe the Boston FBI story\nAnd they just look me straight in the face and said if something this valuable had been on the black market in the hands of mobsters in this city who they say we're not the most sophisticated kind of guys\nThey would have found out about it when they were pressuring them because they got them on drug dealers on murders on extortion is the the counter parts of the Boston FBI in Philadelphia I don't believe this story that the FBI stood at a podium and told the world\nSo jak you looked into Bobby gentile of ... a person long fought to be connected to the Gardner Museum I used in some way where did you find\nSo Bob gentile is a a Connecticut mobster and what we know is that he had ties to mobsters in Boston and\nHe had ties to mobsters in Philadelphia and he was never really a part of the gardener investigation until that house in Maine that Kelly mentioned and uh the widow of the individual who own that house said my husband Bobby\nGave the paintings to this other Bobby Bobby gentile\nAnd ever since then the FBI has put tremendous pressure on Bobby gentile they've set him up on a sting twice and he's sitting in prison right now till the end of this year\nIn which he will get out again at the age of about eighty two to this day Anthony and more of the head of security told us that he firmly believes ... knows something about the garden art and that he's sitting on that information\nKelly or after you looked into the Philadelphia lead what do you think uh FBI on the right trail or not\nI think they thought they were on the right around but I Know one down in Philadelphia on either side it till I was able to confirm that there was a reporter down there who knows the Philadelphia mob inside and out and he said that these guys couldn't even unload a Lamborghini at one point\nUh what are they going to do with with masterpieces impossible so we we don't think that this big reveal from two thousand Thirteen and they hold any water\nA lot more on this latest episode of the fog cast last seen Kelly horn senior producer and reporter thanks for joining us about the same to you jak wrote all ego senior reporter\nLassie thank you for having us [noise] next week on WB you ours MORNING EDITION we have a new leader in the Gardner investigation French gangsters in Miami [noise]\nYou can download the first five episodes of last seen on apple podcast or wherever you get your body can listen on our website for for instructions on how to download a broadcast visit WVU R. dot org slash my as the [noise]\nOnly for last scene is provided by a D. T.\nA. D. T. twenty four seven monitoring designed and installed for you for more information visit a D. T. dot com [noise] and by Samuel Adams Sam adams Boston lawyer brewed with one hundred percent heirloom hops Samuel Adams dot com bust severe company Boston mass save a responsible [noise]\nThis is not deport nine do with you but you are just ahead the latest theory inside her own cabinet over British prime minister Theresa May's plan for ... exiting the European Union said twenty nine\nWere funded by you our listeners and by the museum of science explore what it's like to live and work in space in the exciting interactive exhibits these and out of gravity experience more at MOS dot org\nIf Republicans hang onto their majorities in the house and Senate their approach to governing will be validated they can continue to confirm judges take another whacking Obamacare help President Trump shut down the mother investigation on the other hand says former Republican majority leader Eric Cantor\nIf the Republicans are unable to maintain their majority in the house democratic rule no matter who the speaker is will be very much in opposition to a Trump White house\nJust the way the Democrats in Congress President Obama's legislative agenda die the minute canter and his fellow Republicans took over when they won the house in twenty ten\nLike it's no fun to be in perpetual minority I can tell you that and especially in the house where a\nSimple majority gives you almost absolute power to set the agenda and get bills across the floor that will greatly affect the willingness for some who had been at it for a long time and make the decision whether maybe they should retire or not\nCantor things more Republicans will head for the exits if they lose that Karl Rove former top advisor to President George W. Bush has a different prediction about how Republicans will react if they lose the house\nI think there will be miserable and emboldened there'll be miserable because they're in the minority\nSay goodbye narrow margin it will be if divisions within the Democratic party\nAnd Republicans who are experts that opposition will do their best to exacerbate those democratic divisions\nThere'll be other changes in store for Republicans if they lose one or both houses President Trump without control of Congress could decide to triangulate he's already talked about making deals with Democrats on infrastructure for instance and that could leave congressional Republicans on the sidelines\nTrump has never hesitated to throw an ally under the bus says Doug high the former communications director for the RMC\nIt could be bad for Republicans if he tries to do that but it could be good for Trump for his own personal political goals I think the challenge for a lot of Republicans is what is good for Republicans and what is good for Trump or not necessarily the same thing\nAnd something else will happen if Republicans lose big in November their ranks in Congress will get smaller but also whiter older more male and much more conservative in other words more like the Trump the base of the party\nFormer house Speaker Newt Gingrich says even if the Republicans lose even if they privately blame Trump for their loss and even if he cast them aside to make deals with the Democrats they'll have no choice but to stand by him\nThe Republican Party first of all is gonna be the Trump party you know these consistently at forty to forty three forty four forty five percent approval 'cause he's at eighty eight or Ninety Ninety two percent among Republicans\nSo Gingrich says Republicans will have no choice but to become even more committed to Donald Trump after November\nThe first thing they'll say the morning after the election is we're dedicated to the luxury election of Donald Trump and that becomes the overriding gal\nAnd if they managed to hang onto power in Congress Republicans will still have the task of showing the country they can govern\nThat means funding the wall replacing Obamacare overhauling Medicare and Social Security accomplishments that looted them over the past two years and if they keep the house they'll certainly have a narrower majority making it all even harder Mara Liasson NPR News Washington\nYou're listening to NPR News on that point nine do you view are coming up the federal trial that begins today over Harvard's admissions policies also if you're a pet owner\nYou know how hard it is to make that decision to put down your pet new survey in Boston finds it's tough on vets to\nNow the forecast rain coming today hears WVU are meteorologist Dave Epstein\nScarves become mostly cloudy for today and the early morning sunshine fades away some showers developing temperatures the lower sixties showers become more numerous Windsor gusty this evening even some downpours temperatures down to the forties tomorrow sunny mid fifties Wednesday sunny mid fifties\nThursday it's like the first week of December or early in the mid forties with sunshine friday mid fifties with sunshine\nRead fifty degrees in Boston now at eight forty four\nWe're funded by you our listeners invite gentle giant moving company orchestrating residential small business and office relocation around the block or across the country gentle giant dot com\nAL prime energy consultant distributor of wholesale gasoline and diesel fuel for retail and commercial use AOL prime dot com and the British international school of Boston working with the Juilliard School MIT and UNICEF\nFor a unique global learning experience open house Wednesday the INS Boston dot org\nNow Boston mix business a federal judge in Boston has rejected westward base puma north America's effort\nTo dismiss a lawsuit that claimed it infringed on patents owned by the rival shoemaker Nike was had the suits should be tossed because the patterns involved are abstract but a judge rejected that claim saying Nike has enough facts to continue the case\nMIT is committing one billion dollars to studying computing and AI artificial intelligence the school says it's the largest investment in those topics by any academic institution in the country\nMIT is also opening a new College of computing funded by a three hundred and fifty million dollar gift from Steven Schwartzman the founder of the global asset manager Blackstone ... said forty five\nFunding for W. B. wires business report comes from Comcast Business providing Internet service for businesses that depend on it information at Comcast Business dot com Comcast Business Internet voice and TV built for business\nThis is Donald you'd be you are on buybacks beginning today affirmative action is back on trial this time the defendant is Harvard University the plaintiffs are minorities Asian Americans who accused Harvard of discriminating against them in its admissions process\nWVU ours Gary Young outlines the issues in this federal case tens of thousands of people apply to harvest", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Tisbury", "day": "15"}