{"month": "10", "state": "MN", "station": "KZSE", "content": "Fifty percent chance for rain tomorrow night in a fifty fifty chance of rain friday it's still a chance for rain on Saturday with rain likely Saturday Night into Sunday and that's your NPR weather forecast\n... cursed him around and I report on the environment from the NPR News college wheelbarrow from ...\nElderly me the stories that needs to be told across greater ... NPR News discovered what matters [noise] I Do feel that he's using\nHonest yeah I mean the the the memoir Seventy years in the writing is really candid\nBut um I don't know she said afterwards that it was it was a very meaningful discussions go OK yeah we'll broadcast it in October thirty first by the way Halloween Cathy or this hour we're talking about the facts of um aside from a lot of the campaign rhetoric and the political rhetoric about this migrant caravan\nThat is headed north by the way people are in this Caribbean seeking political asylum so I think that's a point to make and understand welcoming all calls on this but this is this is the facts about this issue and and\nLive from NPR News in Washington encore of a cool I'm In the secret service says it has intercepted too suspicious packages one was addressed the home of former president Morocco bomb and was discovered in Washington DC the second suspicious package was addressed a former secretary of State Hillary Clinton at her home in New York\nSecret Service says neither Obama nor Clinton were at risk of receiving the packages\nThe two candidates for governor of Georgia faced off for their first official debate last night Disney ... from member station WBUR ab ... reports from Atlanta one focus was the right to vote\nRepublican candidate for Georgia governor Brian Kemp and democratic candidate Stacey Abrams spent part of the debate discussing voting rights Abrams says she would focus on making it easier to vote\nAs the next governor of Georgia I Will work with the secretary of state to ensure that there is no question that is a right to vote in Georgia is not a privilege is indeed a right that belongs to those were Georgia citizens and I will work hard to make it so\nRepublican Brian Kemp who's also currently Georgia secretary of state oversees the elections he faces criticism that he has the press the right to vote\nWhen you take off people that had registered ... that had a potential double night or when you count people like Jesus ... from heaven street there on the pending English no one's keeping them from voting\nThe debate was organized by the Atlanta press club for NPR News I'm this name ... in Atlanta\nThe top health official in the Trump Administration says early new data suggests the opioid epidemic in the U.S is possibly beginning to plateau as NPR's Emily Sullivan reports overdose trends are being cited\nIn his speech yesterday Alex days our secretary of health and Human Services cited new preliminary data from the Centers for Disease Control and prevention desks increased by ten percent from twenty sixteen to twenty Seventeen those numbers stole toward the end of twenty Seventeen through the beginning of this year\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nPrograms and support research of non opioid pain relief Emily Sullivan\nNPR News officials in Japan say a journalist has surfaced after going missing in Syria three years ago NPR's Anthony Kuhn reports from Beijing the journalist who is in good health was reportedly held hostage\nForty four year old ... turned up on Tuesday and an immigration center in southern turkey near the Syrian border Japan thanked concert in Turkey for their help with the case yesterday was reportedly taken hostage and twenty Fifteen by an al Qaida affiliate known at the time as the al Nusra front\nTokyo insisted that it had not paid any ransom to secure yes it does release NPR's\nAnthony Kuhn on Wall street stocks are lower this is NPR\nAmazon Prime video with the ... the new serious and the creator of Mad Men Stein Diane Lane Noah Wiley Christina Hendricks and Andrew rentals a new episode every Friday on crime that he out\nHave filled the cardio for Minnesota Public radio news Minnesota congressman Eric pulse and says he did not see President Trump's endorsement for reelection pulse and a Republican has played up his differences with Trump during the campaign all his Democratic opponent dean Philips is out to connect Paulson and Trump\nEarlier this week Trump tweeted his support for pulse and\nA new NPR News Star Tribune poll shows the battle over Brett Kavanaugh Supreme Court nomination is motivating voters as they contemplate who to support\nSlightly more poll respondents said they were more likely to vote for Democrats than Republicans because of the bitter fight involving allegations of sexual assault against cabin on and reporter Brianna beers boxes the split was wider among women forty seven percent\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nThirty five percent of those polls are polled said they believe the allegations against a cabin all well forty one percent do not twenty four percent were onshore [noise]\nUh west St Paul woman in her thirty ninth week of pregnancy saved her husband's life by giving him CPR after he suffered a heart attack last week\nAshley Getty awoke at about five AM Tuesday Morning and found her husband Andrew gasping for air she called nine one one dispatcher walked her through CPR at hospitals Saint Paul in uh in Saint Paul Andrew was later placed in a coma to minimize possible brain damage\nThough doctors warn you might not recover Ashley says she would not give up\nI didn't want to have to think for one second about having to do any of that stuff out and I kept telling him all tanking asleep or an income I was not going to have the Seine until he got\nAndrew did regain consciousness fully responsive and neurologically intact and last friday you watch the birth of the couples first child [noise]\nMinnesota Vikings alignment Everson Griffin is returning to the team after being away for a mental health evaluation the Vikings say Griffin will resume team activities today refund left the team last month after a series of events that included a welfare check at a hospital [noise] this is NPR News [noise]\nGood morning I'm Carrie Miller this is NPR News this hour how to separate\nFact from political fiction non the migrant caravan situation President Trump has had a lot to say on social media about the Central Americans who are moving north toward the U.S border some of it is true some of it is not\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nAlerted border patrol and military that this is a national emergency must change laws\nThere is no factual evidence that unknown middle Easterners are competing these people as the president suggests\nHe also claims that Democrats are advocating for open borders but that is not the platform nor the view of most democratic candidates this is a volatile and politicized issue as you know and the way you view this likely has a lot to do with your own political views and that's fine\nBut there's also some information about who these individuals and families are and where they come from\nAnd why they're leaving and what they're going to encounter at the border that's important to understand and we can use facts and evidence to apply to those questions so\nAs our guest joins us on welcome your questions about what you've been reading and hearing about the caravan it's a good opportunity to do some fact checking and analysis what are you a curious about this what are you interested in as far as what happens if and when\nThis group of people get to the United states border and do you have a larger questions about the places they're leaving from and the situations that\nThey are fleeing from so here's the phone number six five one to two seven six thousand eight hundred two for two twenty eight twenty eight on Twitter at carry NPR Sonia Nazario is our guest she's a Pulitzer Prize winning writer and the author of Enrique's Journey\nShe's in a urbane champagne Illinois Urbana Champaign, Illinois today and so when You're welcome it's really good to have you on the show thanks for the time thank you very happy to be here\nProgramming is supported by white of UCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nOr until fairly recently had for four years in a row the highest homicide rate in the world of countries ... of of\nUh uh uh places not openly in a of a war\nAnd he said that basically some people started talking at the San Pedro Sula bus station there are people who leave that bus station every night on their journey north to the United states uh and that people started talking and saying maybe we should go together and I'm reaching out to other people saying maybe we should all go together and it\nNazario is with us if you just tuned into the conversation I'm saying that this is a discussion in the midst of a lot of overheated and often wrong political rhetoric\nAbout what's happening with this group of migrants headed north we're going to put some facts and information up against that and we're going to welcome your calls because I Know that this is confusing you hear a lot of competing claims about this you hear the president saying things like there's middle Easterners and potential terrorists in the middle and gang members will ask\nSonja about that but I welcome your your well informed questions and your curiosity here today on the issue six five one to two seven six thousand eight hundred two for two twenty eight twenty eight on Twitter at carry NPR to Julie in Bloomington Hi Julie what's your question on this\nAnd get it at a lot to make quite a bit so that as as we know where they care that is where the group that people are coming from and how ladies\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAll over the world from eight countries ... so uh do we have a little bit on the knowledge of ... ... ... that she said it could easily get that could easily get flooded if everyone were to take that legal route but if we're not going to get you a forced a lot to do such a plate of had the immigration laws\nI think I've got it uh the first question though is if we know where they are why don't we stop them from coming to the the southern border\n[noise] well a President Trump urged the countries of Central America to stop this uh group\nAnd um you know the presidents of those countries got on the airwaves and said don't go uh this is a this is not good for our country he's threatening to cut off foreign aid\nUm they didn't physically try to stop people Mexico when people arrived at the there is a bridge that crosses the river that the ... river that divides a northern Guatemala from southern Mexico they did block the bridge they used tear gas um to try to push back people\nAnd there are a lot of women there are people with baby strollers their people would three month old babies on this a caravan there are people in wheelchairs being hauled forward\nI'm On this caravan and I think it created some pushback in Mexico you know many Mexicans have migrated to the United states out while their government is ... has done the dirty work of the United states uh Mexico deport about a hundred and sixty thousand Central Americans a year far more than the United states has\nSo while our president says Mexico's doing nothing\nThey we have given them tens of millions of dollars as I've written\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWhich was to stop people from arriving at our border and Mexico has done that fairly effectively um but we have to consider the politics of Mexico right now um\nMexico is experiencing the greatest level of violence in years thirty thousand people were murdered in Mexico last year\nUm this uh violence and corruption led to a a shift politically where we have a leftist coming to power as president in the south on December first and he said we're no longer going to do the dirty work of the United states\nUm so we're having this real shift in Mexico and the question is will Mexico continue to send deport a lot of people back Mexico did offer for many people in the caravan who are tired who said I Can't walk another step\nThey bus back two thousand people to Honduras so they had done some things are we just don't hear about them ah I I've read your\nPieces about um the unaccompanied children who tried to get into or come into the United states I read the piece about Kendra cruise Garcia and Rob Roberto Gwadar to cruise\nTo on a company children who actually crossed the Rio Grande day by themselves which just blows my mind their mother or tried to hide them from her their father who was a gang member are their children like that in this in this group of migrants who were headed north and what happens to them [noise]\nAre so ... in fiscal twenty Eighteen last year which is included the U.S apprehended forty six thousand children coming to the United states alone a this was a drop from twenty fourteen when it was the highest number about sixty eight thousand chill\nProgramming is supported by white of UCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nMothers in recent decades have come to the United states seeking a better life for their kids they can only feed them once a day their kids cry out to them at night with hunger\nThey can only send them to the third grade that's all they have the money to do so they decide to come to the U.S leave their children with relatives in Central America\nThinking it'll be one or two years separation but it turns into ten years and at least in the past these children would disappear and set off on their own to come find them now often parents are sending their children a head of them because\nThese children are being recruited forcibly by the gangs and places like Honduras in neighborhoods where I spent a lot of time you're nine ten eleven year old boy\nAnd the games are the government in your neighborhood and they tell you you're going to join in the next twenty four hours or we're going to kill you or they they recruit you on the way to school and\nFor the girls they tell you like a a girl I spoke to in a neighborhood in Honduras him eleven oh she said I was told by the gang leader you're pretty you're going to be my girlfriend and if you refuse\nMy gang will kill you and we'll exterminate your whole family here in Honduras\nSo these children now are fleeing this violence in their home countries um Honduras until recently had the number one homicide rate in the world of countries not at war now El Salvador Venezuela or the number one countries of violence in the world um\nThis is what these kids are fleeing and they're willing to face what is the silent slaughter in Mexico to reach our border and ask for safety from our government called from in in ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWays to get a it was it the least and that many people in a\nArea lord of the border is an extensive operation that I'm just curious what kind of planning they've done or what do\nMean when they actually get to the southern border yeah yeah okay so what do you know\n[noise] well ah so that's a good question I you know twenty twenty five years ago a migrants with a mass at the border near San Diego south of San Diego\nAnd they would use large numbers so overwhelmed the border patrol uh and they would just rush to the border and a certain number would get caught but many would get through\n'em now you know we have a lot of uh walls or fences along about seven hundred miles of that border and we have\nA you know ten times the border patrol agents that we once had 'em so we have you know about twenty thousand border patrol agents now on the border we sent the national guard the president is threatening to send the military\nI I'm not convinced that first of all these seven thousand it it's unclear if more will add onto that number as they go through Mexico or if as with past caravans there will be a lot of attrition I mean you're walking your traveling sixteen hundred miles I've done this\nA you see people who's the whole bottom of their foot is one huge a callous ah you're ... you're talking about a hundred degrees and\nA ... about Ninety percent humidity it felt like to me and enough mosquitoes that they drain half of the blood out of your uh system so this is an incredibly difficult journey a very hot and swam pie in the south very desert like in the north there are ...\nProgramming is supported by white of UCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAnd if you go down to the question I I mean per our laws you're not supposed to bar people\nFrom accessing our ports of entry and saying I request asylum from this country but that's what we are doing we are breaking our own laws and if you go to the corner you'll see in ... with a thousand people intense sleeping outside with their children waiting for the border patrol to allow them to access those bridges or border points\nWhere they can come into the United states or ask requesting asylum so\nUm that's what they've done in the past ... a beer asks on Twitter I'm Wondering where the term caravan that came from an I've wondered this also Sonia she writes did the group called themselves that\nOr did the media name them that or was it the U.S government and do you Sonia believe that there's a you know a pejorative kind of sense around that term\nThat they go through their um right but ... isn't I don't know that ... in the long term the\nAnswer I think spending these countries up and and creating a some agency with any uh the people of these countries to you know stand up a country that that they're proud of and that they can they can ... you progress\nOkay I'm One hundred percent agree and you know a two years ago I went to um look at the U.S after the big surge of migrants and twenty four teen and by the way we should say by big surge still the number of people we are catching at our southern border\nProgramming is supported by YWCA Minneapolis bringing the community together to move forward with it's time to talk forums on race on October twenty fifth you can visit wind W C. A. M. P. L. S. dot org to learn more\nBut I'm In since twenty fourteen uh in twenty Fifteen the U.S Congress\nMore than doubled foreign aid to Central American an attempt to address these root causes of this mass migration and that's the only way you're going to stop the caravans to be quite Frank\nUm I we we allocated um about a hundred million dollars to violence prevention programs per year in Honduras\nAnd I went to look at these pilot programs in Honduras I went to the most violent neighborhood in the murder capital of the world and San Pedro Sula Honduras where this ... this most recent caravan left from and what I saw was a neighborhood which was controlled by these six games with an iron grip um\nThey control the neighborhoods so fiercely that one day they were playing soccer several years ago with the head of someone they had decapitated in broad daylight because they pay off the the police\nWe went and the U.S and we funded a outreach centers where kids can go after school and get off the streets away from the gangs and get mentors help getting jobs we've we funded programs that work to reduce violence in the U.S I'm from Los Angeles we have the gang youth reduction program\nAnd you go into the schools and you identify kids with the nine risk factors of going into gangs\nAnd you put them into of about a year of family planning counseling it reduces their odds of engaging in crime or a drug abuse Seventy seven percent and I think most importantly we went into these neighborhoods and we went after the killers in Honduras Ninety six percent\nOf people who commit homicides get away with it a complete impunity\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nNon profit group that is was in part started by a professor from Calvin College in the u._s. it's called the association for more just society it's an arm of Transparency International\nAnd they investigate all homicides in this neighborhood now they go when you pick up the body at the morgue and they say we're us group we have nothing to do with the corrupt time during government can we help you move the body can we get you coffee for the wake only two months into this when you build trust do they say will you testify against this bad person who killed\nYour loved one and they put you under a black burqa like they doing mafia trials in Italy I watch this this woman who testified\nShe arrived in the black broke up with rubber boots with gloves on her hands so you can identify her skin color when she arrived at the courthouse they put her in a little um wouldn't closet with a one way mirror with wheels on it they rolled her into the courtroom\nUnder the black market in the closet and through voice disorder she testified home life and now they're getting convictions in more than half of homicide Denise worse neighborhoods\nAnd this terrible neighborhood homicides went down sixty two percent in two years and it cut the number of kids fleeing to the U.S by half\nThis cause a hundred million dollars a year versus billions of dollars we have to spend once these people arrive at our border we're spending one point three billion a year just to apprehend\nThese kids and put them in detention Centers for two months until we releases them to someone in the U.S and its billions more to pay for schools and court systems and border patrol way cheaper more humane to address the violence the corruption we know how to do some of these things and this is the funding that President Trump is\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nJimmy Morales is corrupt practices but here's what he says Mr Trump or his lieutenants could join the U.S Congress and threatening to cut off economic assistance to Guatemala\nThey could slash military aid I mean what about using right the levers of economic aid when I hear what you've just described to think that doesn't sound like the answer either\n[noise] well you know I've tried the funding to Honduras and some of it does go to the military some does go go to the police although it's largely to try to implement more community policing and to try to reduce ... corruption and the police\nUh I Would say that ... you know as far as I Know in Honduras no one's cutting a check to the ... from the United states\nTo the president of Honduras um were mostly funding uh these efforts to try to reduce violence and if there is any funding that is going\nTo Jimmy morale is who is horribly corrupted and his family is already family members have been locked up by this anti corruption entity which is why he's shutting it down um we should we should strive to strengthen groups like the sea seek a which is a un backed group which is trying to\nPut away people who are corrupt in Guatemala\nAnd this president it has not done that the past president and President Obama had many problems when it came to immigrants he was the deport during chief\nUm but at least he supported these efforts by the sea seek a to try and attack corruption and attack this corrupt president in Guatemala and we should do more of that but we should continue to fund these violence prevention programs that are reducing\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nPatients who they put on the educators the teacher's payroll and they went in and they found\nPeople within the government in Honduras in the educational system who are willing to work with them to root out these people and now the teachers show up all but one day a year and and they are showing up to their classrooms and that makes a huge difference so we need to work with these groups who are like the association for more just society that are will try to attack\nViolence and corruption in these places and we need to find them call here from al in Eden Prairie hey out thanks for waiting\nGood morning thanks for taking the call I'm I'm looking for a little bit of a quick clarification and and and the comment on the news that I've been seeing on on a different sources that have been picking this information out from clarification is\nYou just mentioned a little bit of gold that people are going to be applying for political asylum I'm from the best that I've been able to gather from what I've been seeing the vast vast majority of them are looking to probably be economic migrants a lot of cases at least\nAnd the question about what I've been seeing for different sources is\nIf you look for him was a source that has a certain political banned um you see pictures of you know thousands of mothers and children front and center and horrible stories\nAnd if you look at it from a picture of another bit political bound you see at worst basically nine their claim is Ninety five to seven percent are young you know young Jewish\nMale cat are basically therefore job so it's like\n... yeah what what should we believe on this and are people coming for different purposes Sonia [noise]\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nViolence to the lack of jobs I spent time in a neighborhood where the boy that I wrote about my book and peak in Honduras in the capital of Tegucigalpa\nUm seven and ten a small businesses in that neighborhood\nHad shut down because the gangs demanded a war tax from those businesses and sometimes a business gets hit up by various gangs to pay a war tax every month they up the amount that you have to pay\nAnd they say you have to pay this in twenty four hours or will kill you uh so what people do is they just shut down their businesses so\nThat the control by gangs of these neighborhoods has had a devastating effect on the economy of these neighborhoods paralyze the economy because um you know you you just have to shut down or they'll they'll murder you so I I think it's it's it's disingenuous to say well their economic migrants are they're refugees often times\nThe violence has engendered the control of its engendered by these gangs\nIt's so organized the extortion racket that you know in certain parts of it was he got by you got two pm on Thursday to pay your tax and I and other parts you go at three PM on Wednesdays to pay your war tax is is incredibly a organize and\nI'm NPR News chief meteorologist Paul hurting her start your day with a weather updates from NPR News text the word weather\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more what\nDo they have to do with each other and what should be done about them\nFrom W. A. M. U. N. NPR this is one a [noise]\nHey there I'm Joshua Johnson visiting WB easy Chicago today on one a America Saudi Arabia and Yemen\nIn a tragic way 'cause she'll jeeze murder may have done some good it forced the world to reexamine the U.S Saudi relationship that relationship affects millions of people around the world including those facing be ongoing atrocity of Yemen's civil war will take a closer look at that more at America's ties to the Saudis at at how these ties could and\nPerhaps should change we begin with the latest on the ... cover up and how America plans to retaliate comments on our Facebook page or tweet us at one end\n\nMine from NPR News in Washington encore of a Coleman the secret service says suspicious packages were sent a former president Morocco Obama and former secretary of State Hillary Clinton NPR's Quil Lawrence reports the packages were all intercepted\nPackages were identified during routine screening as potential explosive devices one was discovered last night addressed to Hillary Clinton in Westchester County New York another was found early this morning in Washington D. C. address to the Obama residents authorities say neither package ever gotten near the intended target\nThe secret service has opened a federal criminal investigation this comes after a bomb was discovered earlier this week at the residents of liberal activists and billionaire George Soros that bomb was destroyed in a controlled detonation by federal agents cirrhosis like Obama\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nThousands of Central American migrants are still in southern Mexico their goal the U.S border the Guatemalan government says it stepping up security at its southern border after hearing that a new large group of migrants is planning a similar journey from El Salvador Maria Martin has more\nReports say a Salvadoran migrant group is being organized via what's up and Facebook and responds what a modest interior and defense departments\nSay they're putting in place more stringent border security measures that were functioning last week was the first migrants march came up from Honduras that one set when government official caught us by surprise\nMaria Martin reporting President Trump is threatening to cut aid to Honduras Guatemala and El Salvador and close the U.S Mexico border\nThe Kremlin is warning President Trump's intention to develop nuclear weapons banned for the last Thirty years could lead to a new arms race and here's Lucy and Kim reports from Moscow this week the Trump Administration informed Russia about\nIts plans to exit in Nineteen eighty seven treaty banning intermediate range nuclear missiles\nOver the weekend President Trump said the U.S will develop weapons prohibited by the treaty unless Russia and China also refrain from doing so president flooding near ... spokesman told reporters in Moscow the U.S plans are extremely dangerous and we'll practically start a new arms race\nNational security adviser John Bolton met with ... Tuesday to tell them about the U.S withdrawal to also discussed a possible meeting between Trump and putting in November during World War one commemorations in Paris before leaving Russia Bolton told the inter facts news agency the two presidents may hold a full scale\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nMad Men Stein Diane Lane Noah Wiley Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nFrom Minnesota Public radio news I'm Phil ... President Trump will be in central Wisconsin today campaigning for the state's Republican governor troubled headliner rally in ... and he and his support to incumbent Scott Walker Walker is locked in a tight reelection bid against Democrat Tony ...\nThe candidates for Congress in Minnesota's fifth district met for the debate yesterday the AFL state representative Ilhan Omar is seen as the front runner for the seat being given up by Democrat Keith Ellison Republican candidate Jennifer's Lewinsky brought up allegations Omar improperly used legislative campaign funds for personal use\nIncluding to pay for travel and the divorce lawyer\nRepresentative Omar you'd have some campaign finance violations that I Know that are going to be addressed and I stand with the star Tribune and Associated Press and calling for those to be addressed\nOmar said complaints about her campaign spending were politically motivated\nI think someone who's running for office on that should know that there is a difference between a violation an allegation and and the truth is I have never really been a cited for any campaign violation\nOther issues Omar said she supports a single payer healthcare system and she would vote to impeach impeach President Trump ... said she would have voted for Republican backed tax bill that passed last year\nThe FBI is investigating are investigating the deaths of two men on the red lake Indian reservation in northern Minnesota FBI spokesman Michael ... declined to provide\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nThe deaths of her parents about two thousand volunteers helped investigators comb an area near the Baron Wisconsin home where James and then a Denise claws were found shot to death last week authorities believe the couples Thirteen year old daughter Jamie clause was in the home at the time of the shooting and is in danger\nPartly cloudy skies this afternoon high temperatures in the forties and fifties right now I'm thirty five degrees and the twin cities this is NPR News it's ten oh six [noise]\n\nThis is one a I'm Joshua Johnson visiting WB easy Chicago Saudi Arabia's crown prince Mohammed bin Salman is under increasing pressure over the death of journalists ... the Saudi Government says ... died during an interrogation that turned into a fistfight\nGermany has announced that it will not approve any new arms exports until further notice turkey declared ... death in its words premeditated murder and here's what President Trump told reporters yesterday in the oval office\nIt was carried out and the color was one of the worst in history of covers versus bad deal ... somebody really messed up\nUs now for a brief update is Shane Harris intelligence and national security correspondent from the Washington Post sheen welcome to win a Hi Joshua we also welcome your questions and thoughts about the ongoing search for the troops in the death of Mr ...\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nWe dive in further and that's from secretary of state Mike Pompeo he spoke to reporters at the state department yesterday and he was part of what he said\nWe're making very clear that the United states does not tolerate this kind of ruthless action to silence Mr ... a journalist through violence we continue to maintain a strong partnership with the kingdom of Saudi Arabia neither the president nor I Am happy with this situation\nOr shared strategic interests were Saudi Arabia remain we continue to view as achievable the twin imperatives of protecting America and holding accountable those responsible for the killing of Mr ...\nSo that secretary of state Mike Pompeo speaking yesterday he says it neither she nor the president is happy what actions are they saying the U.S might say\nWell we're still waiting to see right now we've heard secretary palm pay I Will say they are going to be some visa restrictions\nOn individuals suspects who have been identified as taking part in this operation which um I think most people see admittedly is a fairly weak measure that's not necessarily punitive to the regime of Saudi Arabia but he did say that there could be economic sanctions coming and it's actually something is happening right now there's a process that's been triggered\nUnder a law called the Magnitsky Act which traditionally has been used to sanction Russian individuals who've been involved\nIn crimes including crimes against journalists the president has a period of time now where he can consider whether to issue sanctions against individuals Saudis\nSo that could be coming but the key part for me and the remarks that compare me yesterday and you played it was that there's this twin imperative unfolding people responsible but maintaining the relationship it's that sucks\nIf it is related to the other packages partly\nCloudy skies in the state wide forecast today some sprinkles possible high temperatures\nIn the forties and fifties right now in the twin cities with sunshine the temperature at thirty nine degrees It's NPR news\nSupport for NPR comes from the station and from American University's ... school of business committed to business being a force for meaningful change through graduate and undergraduate degrees mission driven curriculum and the hands on approach more Ed Koch God that American dot edu\nAnd from ... am committed to changing lives through math by building math achievements problem solving and the critical thinking skills for thousands of students every\nDay and nine hundred franchise locations math amazing um dot com slash NPR\nThis is one a I'm Joshua Johnson we're discussing the ongoing humanitarian disaster in Yemen as well as the roles that the U.S in the south and the Saudi Arabia play and that\nWas somehow Hamdani from Georgetown University we woke up more of your questions and stories as well especially if you are directly affected by this conflict we'd love to hear from you if you are a Yemeni or Yemeni American or Saudi Saudi American what does this conflict and America's role in it mean to you\nComments on our Facebook page tweet us at one eight or email one a ass W. A. M. U. dot org Barbara emailed I still talk weekly by phone to a Yemeni friends in ... and ... they are living in hell and they ask\nWhy does America hate us so much why does America wants\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nWho are the fighters and what are they fighting for so Yemen's conflict is actually quite complex conflict a it's a it's a conflict that has\nMany layers to it but ultimately what you hear in the news is that's a it's a Saudi Iranian proxy war you also hear that the ... at the who the government in Sana'a that announced itself is actually in fact\nA coup government that is run by a militia and that the Saudi Government is trying to restore the legitimate Yemeni government ah to power in Yemen now the problem with all of that as this conflict is\nFailing to do all of the things that they're saying it's a it's about for example when Saudi Arabia got involved in this conflict with the Arab coalition the aim is to bring back the Yemeni government the Yemeni government has been residing in jail since the war started and\nIs struggling to go back to places where there is no so see I'm bullish on the ground\nAnd on top of that the who the militia in a sense has gained so much more since the war started in the sense that at first they had to share power with\nUh the former president of Yemen where you know in two thousand eleven Yemen had a revolution and I'm the president was removed\nBut he ... himself with the ... and was president for some time\nBut I'm the sheer power with him now fast forward three years into the war they had killed them and and now they have their own control of the majority of the north of Yemen\nAnd of course the the scariest thing about this is the Houthi militia had managed to capture the Yemeni military arsenal that belong to the former government is now\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nNeed of immediate aid and depend on foreign aid to kind of survive and this is a Seventy percent increase since before the war began um\nAnd I didn't want to talk more about the the population on the ground that needs help I just want to move before we were next wars are also didn't want to be clear there was a sectarian part of this do you have these\nThese who the rebels who kind of came after the government you're Saudi Arabia involving itself but there is the Muslim sectarian aspect to this also is Sunni versus Shia conflict as a proxy war right\nSo this is what's interesting and this is what a lot of the people don't realize first of all the shot and Yemen I don't practice the same sect of ... that Iran practices or the Shiites in Lebanon are at all to practice\nThey practice a sect called the DSM and the ideas and is known as five or ... and it's really different from ... which is a the ... the form that's practice in Iran\nWhat's interesting is that it's the closest form of ... that resembles Sundance them a and Indiana and we the Sunnis there are ... and the divide isn't you know the the ... are not a minority like in other places or forty five percent of the population\nAnd so what's interesting about this you know Sunni Shia conflict is that it's entirely manufactured in a sense that of course there are differences between these those two sacks of course there are situations where they don't agree but they managed to co exist for many years now the CDs or the who the sect\nOf of you know what's happening in Yemen they're no longer practicing as atheism as it as it seems like they're trying to politicize say DSM into kind of\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\n... elements of those two are fighting each other and so in a sense you have the presence of the new ... conflict but one thing that I really have to point out to the listeners here is that that's not the only thing going on\nI'm a huge portion of the country in the liberated territory from the control is actually demanding secession and that is something that you don't hear about in the news as much you know in the south so ever since Nineteen Ninety four the people there felt that they were under occupation and the cost is a session\nAre rising day after day as this conflict continues\nOr do you want to make sure we get to a voice on the ground in Yemen but I hear what you're saying summer in terms of all of these very complex fault lines of kind of come together to fuel the civil war today now before we came on the air today\nWe were able to get through to Sana'a in Yemen all communication into and out of Yemen is really tough but we did make contact with least grounding she's the UN's\nResident and humanitarian coordinator for Yemen least laid out what the conditions are like right now for those who are living and working beer here as part of our conversation that we take just a few minutes ago\nAt least one day will come to want to thank you very much can you give me a sense just in a in a larger topics how many people the un fears are at risk of famine right now\nIn game and we are worried that his steps are not taken right now in order to stop the spread of hunger that we could see as many as four ... who are facing fan and by the end of the year this is why the United nations is rain the alarm bells\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nReasonable secure supply of food all kinds of other health problems also come into play right\nThat's exactly right last year the largest cholera outbreak in modern history hit and then there were more than a million people who are suffering either from Colorado or from watery diarrhea there had never been an outbreak of such magnitude in living memory\nNow this year because of the work work that's being done by frontline partners in UN agencies and officials here in the game and we've been able to contain the spread of how the Democrats have similar levels there's a lot of color in the country but it's not spreading at the rate it was last year\nThat being said when people exist for months and months on supplemental rations when they are eating limited amounts of food what happens over a period of time is that they slowly start\nAnd this is absolutely foot we are seeing for millions of people in this country they're immune systems are weakening and that makes some highly vulnerable to infections had water borne diseases including cholera\nAnd just by way of contacts leaves mentioned that there are fourteen million people that the un fears are at risk of famine the population of Illinois where we are right now doing this program from Chicago he's Thirteen million people just by way of contacts least give me a sense of what\nA mother a father a parent has to do in Yemen right now to try and feed their child continue boils down to what an individual might be dealing with just to try to feed themselves and feed their family would they have to do\n[noise] sixty percent of it\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nSo far will happen is a family will use absolutely every means at their disposal to secure\nThe timber wolves play the raptors tonight in Toronto the red Sox have taken a one game to leave in the world series they beat the Dodgers last night eight to four former twin Eduardo ... three run home run for the red socks this is NPR News\nSupport for NPR comes from this station and from Subaru featuring the all new three row ascent with seating for up to eight and a choice of the second row captain's chairs love it's what makes us Subaru was Subaru learn more it Subaru dot com\nAnd from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nBefore we get back to our conversation we would love your help with tomorrow's discussion of President Trump's taxes last in the shuffle of justice Brett Kavanaugh Supreme Court confirmation was a major investigation by the New York times\nIt found hundreds of millions of dollars of financial benefits to the president from his father's real estate empire benefits that Mr Trump had downplayed\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more six\nOne a one day this investigation to the New York times more than a year to complete what questions do you have about it\nEight five five to three six one a one a or you can leave us a radio quality audio file through our app won a vox pop will answer as many of your questions as we can tomorrow on one day\nBack now to our conversation with Jane Ferguson and summer I'll Hamdani still time to get some of your questions and thoughts about the conflict in Yemen and about the U.S Saudi relationship contacts through Facebook our Facebook page tweet us at one a or email one a at W. A. M. U.\nDot org before we continue some al Hamdani let me come back to you for a second I checked in with our audience here at W. B. easy in Chicago to kind of ask them if they were tracking with us\nAnd one of the things that I think confuses a lot of people it confuses me too\nIs the nature of this secretary and aspect like several of us and we have a and a ray of of age ranges here students and seniors and everybody in between have heard of Sunni and Shia Muslims\nBut then that like the the sects within the sects I think that's where a lot of us kind of get lost can you\nCan you bottom line that for us what difference does it make what sect these people are with like why why does the sects why does the sects involve matter to this can you just kind of simplified force\nSalute laced so when it comes to you and I'm like I mentioned the majority of the northern part of Yemen is historically say day and the majority\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nRecently um what we see is the political importation of religious sects of what we're seeing at play as political Islam and that's what you're hearing about you know the chefs in a conflict\nIt's not really religious matter today it's really a political matter of allegiance to what part of the middle east are you going to support and what we're seeing play out is that\nIran is announcing itself as the I'm kind of the guardian of ... and Saudi Arabia on the other hand is presenting itself to the world is the guardian a finance them\nAnd so as soon as she our is pretty much kind of people fighting for the interests of who's going to take control in the region\nAnd that's what this what's happening in Yemen you know for instance when this war started\nWe know that the u._s. then under the administration of President Obama had struck a deal of um a nuclear deal with Iran\nAnd the sense they sacrificed Yemen by saying here you can fight Iran in Yemen but the U.S is gonna kind of sign this deal with Iran now that was a short sighted move because I think a lot of people that didn't anticipate that today President Trump would come to power and then today you have an a nuclear deal with Iran I\nAnd at the same time also have this devastating crisis in Yemen and so in a sense\nBelonging to let me was I think so let me let me back up and try and repeat back to you what you just said that I've been granted diagram everybody here ... been watching you scribble in my piece of paper\nSo we've got these these two sets of Islam Sunni Islam and she Islam it's this old centuries old fight that has been made politic\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nAnointed itself the defender of the Sunni Muslim faith and that politicized Islam has spread into other conflicts and Yemen these factions in Yemen\nIran and Saudi Arabia are supporting these factions is kind of a battle in this larger war for the soul of political Islam is that kind of it\nSure yeah exactly and so what I'm saying is that historically and traditionally the sect of Islam that get many have practiced for years and not necessarily aligned with the Saudi Iranian sex for political reasons they are now aligning with each other\nGotcha gotcha folks here it'd be easy does that make more sense good we got some up all around or if you go and I I appreciate you explain that I think you know part of the complication Jane Ferguson is that this is complicated I mean some wars you can't just\nBoil down to one cause but that also makes it hard\nFor us sworn in Yemen to zero in on them and and really think our teeth and but your reporting has involved some of the people on the ground\nWho are dealing with the results of this larger fight for the soul of political Islam you describe the story of an eleven year old girl that you encountered back in June that kind of stuck with you can you give us the basics of what happened to her\n[noise] sure telling her story is one of the race for the most important reason why journalists need access to this because we have to put a face and a name and the picture to the statistics otherwise they're just ... and I think then we we deal with with a lot\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nThe hospital where like every single hospital that I've seen ... the the children's ward is now a de facto malnutrition wards and we were just filming there with some women and their babies' whenever a young man tall deathly thin\nRushed in with a with a tiny what looked like just sort of like a bundle of clothes and it was his eleven year old sister name was ...\nAnd for a horrible few moments we really thought may mono might dying\nIn front of us on the hospital bed she was eleven years old and wage I think twenty four pounds was what it was about what we had to what we had asked at the doctors at that and it was\nAbsolutely a horrifying to watch her she you know when when a child gets so weak and so a malnourished\nThey also become so vulnerable to any kinds of infection and so they tend to get a diarrhea anyway and so even even if you do manage to get through to them and uh they get diarrhea they get devastatingly dehydrated as a result the whole thing just spirals\nUntil a child's body just gives in um we spent some time they're filming with my own end speaking with her family\nAnd her mother eventually came the next day we were able to talk to her and we were piecing together the family story and it is a story that reflects millions of people's stories in Yemen and it is that her father was a school teacher and a government school\nBut whenever the uh the government salaries stopped over two years ago and he his salary stopped to once people lost that level of income the government was that the the biggest employer by far in the country before the war and that's not just soldiers and police\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nDo have any savings do I have a line of credit at the local store do have any livestock in the backyard do I have relatives who can help us out after two years\nThose coping strategies run out and they ran out for this family and they simply had no money and once a child starts to go downhill it can spiral out of control like this they were lucky family because they were able to afford to pay a cab to take them to the town\nAnd ... and lots of families are not that lucky and so one of the things that is really important to remember by this crisis is we don't even know how many children are dying for ... or we don't know how many don't make it to the hospitals", "year": "2018", "show_name": "1A Plus", "city": "Rochester", "day": "24"}