{"month": "10", "state": "ID", "station": "KRFA", "content": "You are listening to northwest public broadcasting on K are essay Ninety One point seven as than Moscow Pullman a listener supported public service of the added our morale College of communication at Washington state University in cooperation with the University of Idaho school of journalism and mass media\nNorthwest public broadcasting today are of a Ninety One point seven Moscow Pullman K n double you'll be Ninety point five clerks than Lewiston until you W O Ninety point one cotton wood Greenville NPR on classical music or community service of the Edward our moral college\n\n\n\n[noise]\n\n\nRitual fire down found in the score to yet another ballet and the more brutal generally rendered in English just love the magician more literally Spellbound or there'll be which I Love music by ... has conducted thereby Andre cost a lot of\nGood morning eleven over for no on this Halloween here at northwest public broadcasting well this particular occasion that's inspired all kinds of wonderful classical music many of which pieces you're going to hear throughout the course of today and this evening but you also have a chance to do two chances\nTo hear pages from some of the best in some of the darkest classic film scores\nRanging from night on bald mountain to the horror classic bright of Frankenstein to its comic comes to Young Frankenstein listen for Hollywood Halloween at three ...\nThe service of northwest public broadcasting know brooms and buckets at the ready you please we have a famous pulling bike to written at the end of the Eighteenth century\nFamously translated into musical terms in orchestral scared so at the end of the nineteenth century by the French poet you come the story of an assistant who thinks she has a better way of fetching water than pale by pale time after time trip after trip\nHe's going to command all that goes with the master away for a short period of time and he will end chimp them to take care of the water by means of a metric broom but oh my goodness matters quickly get out of hand it requires the masters return to break the bill and restore order\nAnd to address all of that water the torturers princes bipolar do ...\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[laughter]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n... lead or which is wrong by Felix Mendelssohn violin a skill ... and the pianist Jonathan Feldman before that Michael ... at the piano for the ... shock\nWe have many more musical treats coming your way on this Halloween Wednesday here at northwest public broadcasting next door for example a mountain of sweet\nHope your bank is big enough if you're a trick or treating today in any event amounts of tweets courtesy of Chuck ... next hour period N. W. P. B.\nAt northwest public broadcasting listener contributions and business sponsorship make it possible for you to hear your favorite programs thanks to all our partners including Schweitzer engineering laboratories in Pullman and ed medics there's information about sponsors in the community at N. W. P. B. dot org\nRain generally tapering off through the afternoon highest in the mid fifties a breezy Halloween wins costing to thirty miles per hour into this evening Pullman fist\nFifties low sixties one\nOf the most celebrated toned poems by the young recharge throws\nPeel oil in ... Mary prank celebrating that character that goes back to medieval times in Germany it's myth legend in Laura that's a remarkable him than prankster\nWho not only pulled all kinds of practical jokes would wanted to tweak society calling attention to corruption and other kinds of old Fishell ex such as well in Nineteen fifty four the Austrian friends housing or all\nDecided to play a prank upon the prank upon the prankster by creating a work cold chill oil in ... I'm ... under switches to say ... oil in Spiegel another way [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\nMm\nEvery year northwest public broadcasting receives a state gifts from listeners who have included the station in their wealth or trust if you have made the station part of your legacy your generosity will provide the community with public radio programs well past your lifetime thank you so much for giving future generations the gift of public radio\nThis northwest public broadcasting cutting our F. A. B. one point seven Moscow to end up you'll be Ninety point five\nI'm trying to ... to be a one or two point three or a female\n\n\n\n[noise]\n\n\n\n... the blitz spirit founded the score so they go pro or feel send you a British ... by ... cook one of the operatic masterpieces ... Eighteenth century the down to the boss\nOn this Halloween Wednesday here at northwest public broadcasting a very good afternoon to you hope you're enjoying a very pleasant and productive day so far I'm Steve leader which some French music now based upon and old superstition\nAccording to ... death with a capital D\nAppears at midnight every year on Halloween perfect timing death someone's the dead from their graves to dance for him\nWhile he plays his fiddle represented in this case by the solo violin it's going to stand for him until the rooster crows it don't when they have to return to their graves until the next year the same time same place now listen to the very beginning of this listen carefully right from the start because it begins\nWith a harp playing a single note the twelve times representing the twelve stroke of midnight as we begin this don't ... up by Tasoff\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\nWhat was the cold air or sweet number five in the minor by Romo his own extra populations his own arrangements and orchestrate ...\nOriginal solo cups accord pizzas he had written earlier Christophe who say the hopes accord there and leading the Paris based period instrument group late last last week twelve twenty seven on this Halloween afternoon here at northwest public broadcasting here it N. W. P. B. dot org ...\nTrick or treating while they're going to be a lot of that around the region tonight we're going to have some sweet treats for your next courtesy of ... and then to work I have to admit the new to me perhaps to you as well ...\nNine PM from our studios here at northwest public broadcasting\nThis program is made possible with financial support from less there's like you and from pro tech auto repair a locally owned family business providing diagnostic service and repair including work on breaks engines and transmissions open Monday through friday located near the W. S. U. campus on ... street and online at pro tech auto Daschle paired dot com\nRain generally tapering off through the afternoon ... in the mid fifties a breezy Halloween wins costing to thirty miles per hour into this evening Pullman fifty fifty six in Lewiston\nFifty percent chance of rain overnight in through Thursday loose in the forties to around fifty tomorrow's hides in the mid fifties low sixties\nHere we find Clara and her prince charming at the magic castle on the mountain of sweets Oh yes let's immerse ourselves right now in act two of the nutcracker by ... [noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\nMm\nMm\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\nMan [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Moscow", "day": "31"}