{"month": "10", "state": "ID", "station": "KRFA", "content": "\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\nNa\n\n\nClaudio overall was featured soloist and all the ... the conductor of the London philharmonic for music by ... being done to be another two and ... ... ...\nIn the flight made sure those two linked piano pieces together again on a Thursday morning here at northwest public broadcasting well a remarkable young talent a gifted young children\nWho gained an international following this past spring is making his American orchestral debut this weekend within the next half hour we're going to showcase a recording of the very music he's going to perform all live\nIn Seattle has been a royal hold this weekend coming up as we share Thursday together here in northwest public broadcasting\nYou are listening to northwest public broadcasting on K R S a Ninety One point seven Afghan Moscow Pullman a listener supported public service of the Edward our morale College of communication at Washington state University in cooperation with the University of Idaho school of journalism and mass\nNinety point five coached in Lewiston until you W O Ninety point one called ... Greenville in the yard classical music or community service should the Edward ... College of communication at Washington state university\n[noise]\n\n\nOh lovely chic to begin our next door to go to the morning a chicken from the pain of the early English in ... Byrd\nA very important figure in English music whose slight spin the second half of the sixteenth than the first quarter of the seventeenth century or a ... by William bird performed thereby Canadian breath exactly nine minutes now past eleven o'clock greetings Hi there good morning I'm Steve leader hosting into one afternoon\nAnd the arrival of ... who will renew our music today inspired by the one hunts\n... bouquet classical music selections prompted by flowers and other plants in turn inspired by the titles and the contents of the one hundred novels on the list and once more\nYou have until eleven fifty nine tonight Pacific time to cast your vote singular or votes plural for your favorite noble you'll find the complete list of one hundred and the opportunity to vote at N. W. P. B. dot org slash G. A. R. for great American read\nRight now members of a lot of people don't lick the string ensemble with assisting artist for this conversation in the music for for horns and three strings my use of hiking\nMm\nMm\n\nMm nah\n\nMm\n\nMm\n\n[noise] yeah\n\n\n\n[noise]\n\n\n\n\n\n[noise] you know\nAnd then\nDo that\nIt's a catch station basically an all purpose kind of peace uh catch station in ... for for horns\nWith three strings violin viola and base members of a lot of people who deli and the horn ensemble led by up close to her on a period or natural valve was instrument horns without vowels and the cage\nEleven twenty five on a Thursday morning Tchaikovsky comes next here at northwest public broadcasting you were members supported NPR and classical music service on line it N. W. P. B. dot org I'm Steve leader so pleased to be with you today even as we're pleased to provide the communities of pulling in Moscow\nAnd Bellingham was classical music on Ninety One point seven tonight at seven\nBill McLaughlin returns exploring music continuing his weeklong focus on the symphony\nAs a form of musical expression and tonight in particular delving into a pair of twentieth century worked a symphony by the Englishman William Olsen and by the check foreign composer both whose twelve months he knew that this evening it's\nFavorite programs on northwest public broadcasting are funded by listeners like you as well as regional businesses like president's office solutions thank you so much learned about northwest Public Broadcasting's\nVery good ... theme you'll go up please the solo part here at UT timid code of conduct the St Petersburg philharmonic\n[noise]\n\n\n\n\nOoh\n\n\nMm\n\nMm Mm\nMm [noise]\nMm\nMm\n[noise]\n[noise]\nMm Mm\n\nNah\nNah\nNah\n\n[noise]\n[noise]\n\n[noise]\n\n\nMm\n[noise]\n\n\nMm\n\n\n\n\n\n\n\n\nBoisterous applause there at the end and we'll deserve Ford shallow silhouettes yo yo ma Larry company by the St Petersburg philharmonic under the direction of conductor Yuri timid kono of trick ... variations ... theme\nGifted young British ... still a student at the royal Academy of music in London shake a commission\nWho memorably played at the wedding of Prince Harry and Meghan Marco less may well he makes his American orchestral debut in that piece by truck ... with the Seattle Symphony this weekend\nA concert sequenced it begins to seeping in ... oil halls taking notice but remarkable debut on the national and regional state ... northwest public broadcasting your members supported\nForty seven\nThe ratings are on and the daycare high democracy has never been in the near term depression NPR had the latest news and accurate analysis on the Democratic and Republican agenda\nOur priorities is to make sure\nThat we not only reelected that we expand Republican majorities on Capitol\nCritical election and dental coverage\nNPR News listen for essential\nReporting everyday MORNING EDITION all things considered and weekend edition\nHere on northwest public broadcasting a very good morning to you eleven forty eight now on this Thursday\nBy the way you can always stay in touch with our classical side by means of another dimension yes indeed by means of one of our social media platforms Twitter you can find and follow us with the handle at N. W. P. B. classical\nGood morning I'm Steve reader or classical music suggested by the great American read continues that about two forty five this afternoon a bouquet of musical flowers and plants with ... and then concepts of time and space and the seasons the music\nWould chi chi yellow and she has some remarkable pieces to play for you tonight beginning at eight for the moment of quiet\nThe late great sort of Colin ... who's leading the London symphony orchestra [noise]\nMhm\nMhm\n\nPrograms you enjoy in northwest public broadcasting every possible with support from the Washington Idaho symphony bringing romantic favorites from real felt risky course to ... to the stage Saturday October twenty if at home in high school the twenty first had parked in high school ticketed information at W. H. dash id symphony dot org\nThis northwest public broadcasting cutting our F a Ninety One point seven Moscow to an W\nSeven coming to ski object to Seventy to the old wanted to point three or a female\nMm\n... ...\n... ... ...\n...\nBorn in the same year as Bach and handle wrote almost six hundred solo keyboards to not as you've just heard one of the better known among them often played by ... guitarists in our time John Williams there with his own transcription of keyboard sonata in ... uh\nFive minutes into our Thursday Afternoon October Eighteenth\nHere at northwest public broadcasting thank you so much for making us a part of your day I'm Steve and Julie will be along at one this afternoon well there's a good deal of national attention on Washington's fifth congressional district\nWhere a Democrat Lisa Brown recently raised more money than seven term incumbent Cathy McMorris Rodgers\nThe candidates are going to meet in debate next Wednesday evening in Walla Walla and you can watch or hear it live on northwest Public Broadcasting's radio and TV stations also on N. W. P. B. dot org that's next Wednesday evening from six to seven on all the stations of northwest public broadcasting\nThank you so much for joining us today now six minutes past noon as we turn our attention to show up to ... and the first of his two shots or sweets of historical scenes the royals Scottish national orchestra under sir Alexander Gibson's direction\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n...\n\nThe first set of historical scenes by shown to be able to get\nComposed right at the turn of the ... century for a special kind of pageant in Finland\nTo be precise the duck she of Finland at that time in ... to represent the desire of the Finnish people for freedom and independence from Russia and in particular freedom of the press\nLive first of the two sets of historical scenes by shown to be legal standing there with festival in Boulder federal rhythm a performance by the oil ... name of your iffy conducting\nNorthwest public broadcasting ... member supported NPR and classical music service\nOnline at N. W. P. B. dot org twelve twenty six on a Thursday Afternoon I'm Steve leader thank you so much for joining us today indeed we are spending part of our time with you on this Thursday or taking our cues for the music for you\nFrom the titles and the subject matter on the contents of the great American read the one hundred\nRight to vote and then the winter the favorite novel among American readers\nWill be announced on public television this coming Monday evening October twenty second in the meantime you can go to our website you can see the full list of one hundred titled or check out a book reviewer too if you like and cast your vote again it's an W. P. B. dot org slash G. A. R. as in great American read\nAnd the programming or inspired by that suggested by that will continue with ... that about two forty five this afternoon\nNorthwest public broadcasting receipts program support from the Dayton historical depot society who's Goldman House museum is it time capsule containing an array of objects used and say by one family over the eighty seven years they lived in this Victorian home\nOpen one to four Thursday through Saturdays or by appointment Dayton historic depot dot org and on Facebook\nYou are daytime guys looked to be mostly sunny into next Tuesday as this pleasant autumn weather continues\nToday's high temperatures were returning to the mid to upper sixties Pullman sixty five sixty eight in Lewiston with mostly clearer conditions overnight lows in the thirties to around forty behind this weekend may climb into the lower seventies\n\nContinue you know with music ... took the favorite people of that eventually the son in law of on to mean for shock his fantastic scared so for orchestra composed to Nineteen oh for look ... symphony ... conducting here [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\nIndeed the stuff of fantasy and imagination that fantastic scared so when she minor music composed in Nineteen oh for my usual shook ... conducting the Prague symphony orchestra so there you had a substantial or ... by the famous son in law\nNext hour a major piece of chamber music by the much more famous\nFather in law his father in law ... and ... going to share with your performance of his American string quartet era northwest public broadcasting screaming at N. W. P. B. dot org available by means of your smartphone and smart speaker as well just tell us to play\nNorthwest public broadcasting just sixteen minutes away from one o'clock now\nEnjoying another mostly sunny and altogether plus an autumn day all across the northwest hope you're managing some additional time out of doors with your favorite activities here at least through the weekend in into the first part of next week I'm the reader your host every day into one o'clock\nDown to the minute report expert in Alistair on the most significant rate that critical election then she'll coverage NPR News I'm\nListening to MORNING EDITION all things considered and weekend edition every day here on northwest public broadcasting\n\nNo let's turn our attention to Georg Philipp television and this trumpet concerto in teammate your freedom on him or her as the shooter was tear ... conduct true of ... of cologne on N. W. P. B.\n\n\n", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Moscow", "day": "18"}