{"month": "10", "state": "ID", "station": "KRFA", "content": "Ooh\nOoh [noise]\n\nRight\n\nFor shock within the next five minutes this morning we're going to share with you a music well music in a similar vein I suppose a similar tone ... tone\nBy a much earlier bohemian checked composer that and more from one of our birth state figures illness October twenty fifth Johann Strauss junior coming your way here at northwest public broadcasting thanks so much for joining us today\nNorthwest public broadcasting receive program support from Pullman disposal service online at ... dot com a customer focused site created to better serve Pullman residence with improved access to recycling schedule including holiday hours pregnant farms and frequently asked questions that information and more can be found at polling disposal dot com\nNorthwest public broadcasting\nK. R. S. A. Ninety One point seven Moscow Pullman K n double you'll be Ninety point five clerks didn't Lewiston and Kagan W O Ninety point one cotton wood Greenville NPR on classical music community service of the Edward our moral College of communication at Washington state university\n[noise]\n\n\n\n\n[noise]\n\n\n... junior they're collaborating with his younger brother used to in the pits Chicago polka music with pluck which they wrote specifically for a family trip and tour to imperial Russia in Eighteen sixty nine a proposed there but you still at least the tub Yani\nExactly six minutes past eleven o'clock just six days out from Halloween Halloween ... Eighteen you can go to our website right now and find posts about all kinds of new films and television programs and books\nAre designed to give you a thrill and the show at this Halloween season also a lifting of some hunted attractions around the northwest including Walla Walla corn maize for spooky good time\nAnd an interview with Jamie Lee Curtis reflect upon the new Halloween movie sequel it's not a remake it's a sequel to the picture in which she started forty years ago and how ...\nResource for all kinds of things northwest public broadcasting\nLate last hour we've heard these kids took it but he chose to abide foreshock let's turn back the clock built the previous century the Eighteenth for this ... number one in ... by another Chuck composer yawned these must to link up this performance given by the Swiss group known as ...\n...\n\n\n\n\n\nNo\nYou just heard the could preach showed number one in ... by the parochial road check composer young these about the link or better known for his coral in the church music\nAlexander fund find cope leading the members have Switzerland's camaraderie bearing a a return to George ... say but you say as a teenager next to this morning\nHere at northwest public broadcasting herded N. W. P. B. dot org I'm Steve leader and Chile's dirty or will rejoin you as usual this afternoon between one and for\nIf you contribute to northwest public broadcasting you have something in common with hundreds of businesses and organizations such as ... medical center and the Moscow for the call up\nTogether with them and the community and generous lesson airs you're bringing meaningful programs to your northwest neighbors every day thank you\nPartly sunny in Lewiston mostly cloudy and Pullman today's high temperatures in the upper fifties to mid sixties Moscow sixty sixty four encourage them by the overnight hours of fifty percent chance of rain Louis in the mid forties to low fifties more cloud cover on friday or forty percent reinsurance tomorrow an identical to today\n... the French\nTo tell it to be honest and then went on to a brilliant career at the Paris Conservatory\nAnd a victory in the ... competition which many French composers a struggle to achieve Maurice rebelled famously so but not be stay at the age of Seventeen inspired by his mentor good no\nWho would just read a new tone first symphony we said try his own hand did this for with great success yeah that would prove to be the only work if it's going to you would ever writes his symphony in the the youthful be saying no and this performance by the ... the U.S chamber orchestra of New York\n[noise]\n\n\nOf them\n\nBut but but\n\n\n\n\n\nNo\nNo no no\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\nIn\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\nNot last public broadcasting received program support from listeners like you and good medical center serving the region at the new ... dot org to help connect patience with a comprehensive health information education and support\nIncluding access to the online clinic and details about services classes Andy vats online at ... dot org\nThis northwest public broadcasting K. R. I. F. A. I. D. one point seven Moscow K n double you'll be Ninety point five clerks than and K n double you own Ninety point one cut and what\nHeard on translators K. two Seventy four BEK one or two point seven coming to ski and said to Seventy two de ...\n\nRather ... treatment of the two noon is walking the dog against George Gershwin himself courtesy of a piano role\nTo lead off our Thursday Afternoon if you're a northwest public broadcasting ... exactly three minutes past noon you can always find is in full of us on Twitter with the handle at N. W. P. B. classical\nYou could messages with any kind of question or comment about any aspect of our programming through Facebook or by emailing us at this address that would be info at N. W. P. B. dot org thank you for listening and for so generously supporting our programming\nHere at northwest public broadcasting now let's return to Johann Strauss junior born in a suburb of Vienna and born into a highly and highly successful\nThey come through so much trouble back in time to this past January first in together the Superbowl they let me hear by Ricardo boutique for this festival march\n\nJanuary first of this very year New Year's day ... Eighteen but begin to philharmonic blood thereby conductor record a multi in that festival march\nBy your hunch Trump junior and now the curtain ratio the overtures he wrote to his best known stage work indeed\nOne of the finest stage words to the lake nineteenth century in Europe the fleet or most or the bat chock full of gorgeous melodies really vivid characters in characterizations at all kinds of memory Institute Rickles confusion\nInvolving characters and situations that had a very successful premier among the Viennese back in Eighteen Seventy four we overtures to deflate or most by Johann Strauss junior\n[noise]\n\n\n[noise]\nNah\n\n\nMm\n\nMm\nMm\n\nOh no no no no\n\n\nNo\n\n\nNa na\nNa\n\nNa\n\nNa na na\n\nNa\n\nNa\nNa\n[noise]\n\n\n\n\n\n\n\n\n\n\nNa\nNa na\n\n\nWhat\nThe two baroque ... guy fishermen and Sheryl ... joined there at the heart of the court by John Cubans\nFor them to not a number for by the Italian Baroque figure on three I ... I Hope you enjoyed that performance and all of the music that we're offering today still a lot more to go and a long ways to go up Thursday October twenty fifth ... northwest public broadcasting\nHeard at N. W. P. B. dot org you and your smartphone and by means of your smart speaker as well good afternoon I'm Steve leader right now it's twelve twenty eight\nNorthwest public broadcasting is joined by cascade auto center in its mission of bringing distinctive programs to the northwest everyday inspiring dialogue discourse and discovery if you also support these values you can find out more about becoming a program sponsor at N. W. P. B. dot org under support\nPartly sunny in Lewiston mostly\nFifty percent chance of rain loose in the mid forties to low fifties more cloud cover on friday or forty percent rain chance tomorrow an identical to today\n\nNo onto an English composer who attracted not only a lot of respect among his peers back in the day the late teens and early ... centuries but genuine affection and admiration Hubert Perry we read in the correspondents of the period we read from the critics of the period in England and even on the continent\nWhat an admirable and the genial and altogether pleasant personality he held in addition to his musical talent will buy Hubert Perry now an English sweet four strings very English indeed the English string orchestras the group conducted by its founder William ...\n\nMm [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\nWilliam both leading to zone English string orchestra you in an English sweet bike Hubert Terry you're on the NPR in classical music service the N. W. P. B.\nThis is from o'clock on friday the ... the musical boundaries\nI should they be very labor for music from Mr Barr could die\nIt's exploring the role of this magnificent my yard I used to say muggy I\nWeek when exploring music [noise]\nBill returns this evening at seven right after all things considered from NPR oh let's turn now to the Hungarian guitar virtual too and composer Johan costs by merit and that just the young themes from ... ... ...\n...\n...\n...", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Moscow", "day": "25"}