{"month": "10", "state": "ID", "station": "KRFA", "content": "Music festival and Whitman College share many things with the listeners have northwest public broadcasting and love of the arts culture and performance that's why they sponsor our programs\nYour organization can also sponsor our programs\nFind out more at ... dot org under support\nNorthwest public broadcasting\nK. R. S. A. Ninety One point seven Moscow Pullman K n double you'll be Ninety point five clerks than Louis them until you W O maybe point one cotton wood Greenville NPR on classical music community service of the Edward our moral College of communication at Washington state university\n\n\n\nWell there's a ... you may will recognize one of the most famous of the mole lot who ... the the little procession or the little carnival\nWritten back in Nineteen sixteen by feel I don't do much those Rodrigues otherwise known as big show professionally\nQuite famous show ... musician and composer a journalist and for a time a diplomat as we'll let coup proceed but Nineteen sixteen ... played for you today by Canadian breath\nEmpty noting our eleven o'clock hour on this Wednesday morning\nHere at northwest public broadcasting herded N. W. P. B. dot org hope you're enjoying your day hoping you're making the most of it thank you for sharing it with us\nAt N. W. P. B. I'm ... will be joining us as usual from our studios\nAt one o'clock this afternoon let's get right to our major work in this hour no the last of the symphonies by Robert Schumann he'd designated that'd be played straight through which is to say without any effective or definitive breaks or poses between it's\nBrazil to fill her by [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\nMm Mm\n[noise]\n\nMm\nMm\n\n[noise]\n[noise]\nMay be [noise]\n... at the piano with music by all these poor like three pieces original keyboard beaches by him up punched around him and that funnel dynamic took off her\nRoche may playing pool like for you here at northwest public broadcasting here would end up all your P. B. dot org were momentarily we're going to travel back in time to the parochial right in Italy\nHi this is from o'clock on friday the ... music I'm hungry [noise]\nFascinating very flavorful music from listed by talking could die and it was a folk music which exerted a powerful influence on western composer from hiding promise always around the\nExploring the role of this magnificent my yard I used to say my yard [noise]\nThis week when exploring music [noise]\nReturns this evening at seven right after all things considered and showcasing one of the Hungarian Rob cities to list as well as one of the violin concerto by that Hungarian born virtuoso and friend to Brahms goes if you're walking him tonight at seven right after a Wednesday edition of all things considered from NPR\nShe'll let's turn our attention now to a group that calls itself compelling each drop\nYou tell your future on don't look at totally\n\nYou are listening to northwest public broadcasting on K R S a Ninety One point seven F ... Moscow Pullman a listener supported public service of the Edward R Merle College of communication at Washington state University in cooperation with the University of Idaho school of journalism and mass\nMedia this northwest public broadcasting cutting or if a Ninety One point seven Moscow\nTell you one or two points southern Cal me like who's ski object to Seventy to the old one or two point three or a female ...\n\nMm\n\n\n\n\n\nLove Law Order they like ... or the sentiments lower\nThe best known of the many memorable songs by the Peruvian composer ... ... let's go better known as ... on the\nRoad all kinds of ... citizen romantic ballads and songs you've just heard the best known of them should have been flower but also became quite famous at home in Peru for protest songs having to do with social injustice some political corruption\nLove Florida the look on the law by triple cook it under played for you today and that arrangement by the twelve shallow of the Berlin Philharmonic four minutes they'll pass noon good afternoon to you happy Wednesday thank you for joining us ...\nHe wrote it for his violinist brother thirty no this is wrong to win a major bite from Schubert by Uber's Greta used to live with fear and heart would should use the conductor of the CPU by chamber orchestra\n\n\n\nOn now to Marie ... in this hour one of the many work she wrote with a Spanish accent too it his Spanish rep city his own or construction of the piano sweet\nIt begins with a pro you to the knights it includes an ... and ... and it concludes with Syria a festive scene indeed the Berlin Philharmonic has conducted for you here by ...\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\nAnd uh\n[noise]\n\n[noise] ooh\nOoh\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise] [noise]\n... ...\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n\n\nNa\nNa na\nNa\n\nAlexis ... performing book for you today in the form of but Italian could sure to win elf\nLater on the shelf to noon ... going to be sharing with you ... seconds ... from the work for keyboard with orchestra in addition to those impressive symphonic dances bud ...\nComing up on the ... show it begins to just ... minutes should want to call it the afternoon from our studios here with northwest public broadcasting\nDig week on all things considered here the latest news we have people that are trying to get into our country because of how well our country is doing", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Moscow", "day": "24"}