{"month": "10", "state": "ID", "station": "KRFA", "content": "\nOh yes it's a very popular peace with Morris dancers and school orchestra screwed simple Percy Granger is setting of the English folk tune country garden\nHe first arranged ... century or go back in Nineteen Eighteen you about performance the board but should fund yet but English on some book that was conducted by Kendall Montgomery eleven owed to want a Tuesday Morning thank you for joining us here in northwest public bunch\nWe're going to launch into a complete performance of his second symphony but to get us there some cheaper music from the parochial or this is a trio ... miners bought lighting the oboe when violin in particular a trio when she mind your bike ... recorded here on historical instruments but the members of on symbol volt tear\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\nAh\nAnd then\nAnd then the\nNa na\nNa\n\n\n\n[noise]\n\nI found out\n\nIn a men's sleep popular work with the public and with his fellow composers from the very first performance you just heard ... for the number two in the money or otherwise known as his little Russia because of its incorporation of Ukrainian bookstore\nMitch or work in the eleven o'clock hour here at northwest public broadcasting you were members supported NPR and classical music service a very good morning to you and they're happy Tuesday on this October twenty third I'm Steve leader\nNorthwest public broadcasting ... to ... done one island in school in Washington as well as Victoria, BC on Ninety point one in the moments just had some original music for flute and guitar\nIn mid term they're counting NPR rolled out to the minute report card and Alex in on them that they never get raped and critical election then she'll have ranch NPR nan\n... reporting every day on MORNING edition all things considered and weekend edition right here on northwest public broadcasting Marlboro Giuliani that Neal politician guitar virtuoso spent an important part of his career roughly the first quarter of the nineteenth century\nIn Vienna where he wrote this set of a dozen Lynn Taylor rustic or peasant densest scoring them for the combination of fluids and guitar meet ... hill us for the flu this year and you can solve e okay look a tourist\nNorthwest public broadcasting bases program support from what's been hospital and medical center in coal facts providing therapies including occupational speech and physical therapy for children and adults treatment options also include massage and aquatic therapy more information that three nine seven thirty four thirty five or which meant hospital dot org\nThis northwest public broadcasting K. R. I. F. A. I. D. one point\nSeventy four beat Kay wanting to point seven ... ... to ... to the old one or two points three world see no\n\n...\n\nTo dances from that very important early seventeenth century dance collection gold ... put together by me ... ... a pasta but still I think ... yard Philip tickets and the New London ... short\nHere at northwest public broadcasting by the way other means of staying in touch with our classical ... or classical dimension here used by means of Twitter\nLater in the dollar a set of variations for violin string trio masquerading as a string quartet but right no serious and beautiful music by Murray rebelled\nHis tweets look toll booth to Cooperstown originally six piano pieces for the work is treated here but he wrote during the course of the first rule for honoring colleagues and friends who've lost their lives in the conflict\nBut also harkening back to the great era of the French keyboard masters of the baroque\nDelete seventeenth Eighteenth century when famously asked why he would write such often cheerful music given the meaning behind it rebelled simply responded the loss of my friends is already shot enough\nLuke tone voted Cooper Bible reached rebel he's the owner of constriction of the original piano piece as cloudy go above into leading the London symphony\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n... ... ... or ... for his original six piano pieces composed during the course of the first World War cloudy all about on the podium leading the London symphony orchestra even as we're fast approaching the exact centennial of the wars in the\nNovember eleventh twenty eight team\nTwelve twenty two on the twenty third day of October thank you for spending this one with us here at northwest public broadcasting hope you're enjoying a platoon productive day so far I'm Steve ... will be along here at the top of the hour at one o'clock oh and it's seven o'clock tonight bill McLaughlin is going to return\nExploring music with a very specific geographical and cultural focus this week\nI this is bill McLachlan inviting you to come exploring music I'm Hungary\nActually they very flavorful music from Mr by talking to a guy\nFolk music which exerted a powerful influence on western forces from hiding promised me throughout\nExploring the role of this makes my\nBe sure that very rough quote the march by ... a good friend of Franz Liszt who's also represented tonight as well as Hungarian themed music by heightened on Tonight Show it begins to shut them\nAnd it immediately follows all things considered here on the NPR in classical music service of N. W. P. B.\nNo they're very influential nineteenth century German violinist composer run conductor and all the roads musical innovator Luke's which for\nThe who gave violinist which unrest forever more cure or a set of variations in a by sports scored four solo violin with string trio heading the bubble here in Michigan [noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nAnd\n\n\n\nMm\nMm\n[noise]\nMm\n\nMm [noise]\n\n[laughter]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Moscow", "day": "23"}