{"month": "10", "state": "ID", "station": "KRFA", "content": "At the end of two of the double butterfly by put Cheney Barry words worth on the podium they're leading the b._b._c. concert orchestra we have a full length heightened symphony in\nStore for your next door here at northwest public broadcasting\nYou are listening to northwest public broadcasting on K R S a Ninety One point seven as than Moscow Pullman a listener supported public service of the adult our morale College of communication at Washington state University in cooperation with the University of Idaho school of journalism and mass media\nNorthwest public broadcasting K. R. S. A. Ninety One point seven Moscow Pullman K n double you'll be Ninety point five clerks than Louis them until you W O Ninety point one cotton wood Greenville NPR on classical music community service of the Edward our moral college would come in\n\nWill be the\n\n\n\n\n\n[noise]\n\n[noise]\n... you know makes you kinda know literally little Mexican skirt so scared the no ... no by the Mexican composer ... ... say that was performed thereby guitarist John Williams eleven over three you know what a Wednesday morning it's North West\nWork which numerically at least stands right at the beginning of that last set of twelve London symphonies composed by Yusuf heightened although not the first in the sequence to actually being composed\nWe knew it as the symphony number Ninety three in the one of the London symphonies ... played for you here on historical instruments the orchestra the Eighteenth century has conducted by its founder from Brooklyn\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\nUm [noise]\n\nAt least in numerical terms and in terms of the order of publication that would be the first ... the final dose in London symphony composed by use of heightened who's to say the number Ninety three indeed to be precise ... broken conducting his orchestra the Eighteenth century but\nThe Seattle Symphony David Diamond as well as pets to just from a symphony composed by Ravi Shankar tonight at seven exploring music right after all things considered from NPR\nNorthwest public broadcasting BCS program support from Moscow family I care and not some algae end up ... practice welcoming new patients\nCare includes eye exams classes and contacts doctors illicit Hain empty and Nevada Sweeney O D also provide individual treatment for medical and surgical I care appointments that Moscow family high dot com\nYes you can keep thinking about your favorite outdoor activities this pattern of sunny and mild daytime weather along with mostly clear skies overnight will continue right into in through the coming weekend\nThe highest today and tomorrow in the mid to upper sixties loose in the thirties for around forty Pullman sixty six sixty eight and Louis to [noise]\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\nYou are listening to northwest public broadcasting on K. R. FAA Ninety One point seven Afghan Moscow Pullman a listener supported public service at the Edward our morale College of communication at Washington state University in cooperation with the University of Idaho school of journalism and mass media\nThis northwest public broadcasting\nCutting are of a one point seven Moscow to N. W. B. Ninety point five clerks then until you an W O Ninety point one cutting wood also heard on translators K. two Seventy four B. K. one or two point seven coming to ski and K. two Seventy to the old one or two point three or a female for\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\n\n\nLet an from this list a wonderful combination to start our Wednesday afternoon here with northwest public broadcasting interest about Fifteen minutes the academic testable over ... problems\nBut right now a concerto for strings and make sure by one of the leading violinist as well as can posters of the Italian Baroque throw on Tony all look at a lake\nHuron soloist and the ensemble of ... cologne\n[noise]\nExploring music with Bill McLaughlin heard every weekday evening at seven\nI Know a grand ... by Brahms written to help thing the University of ... in Germany for conferring upon him an honorary doctorate Brahms academic festival overture\nIn this year a Bernstein twenty Eighteen Lennie back on the podium just I'm leading the Vienna Phil\n[noise]\nBut to put up with\n[noise]\n\n\n\n[noise]\n\n\n\n\n...\nAnd\n[noise]\n\n\nVery gracious piece of music but George Frederick handle found in his very first published collection pieces that he'd wrote to be played on the flute or ... or in this case the recorder that record to nothing number seven in the with our old Dutch cast\nFrom proven recorder under ... cello and ... I'll just put it on at the heart to court twelve forty four now actually will be joining you and just about sixteen minutes this afternoon\nAt the top of the hour at one sharing more wonderful music with you until four o'clock this afternoon and then at eight this evening immediately following exporting music with Bill McLaughlin a G G going will hold forth from our studios here keeping you will entered\nThe races are on and the daycare high democracy has never been to the mid term depression NPR has the latest news an expert analysis on the Democratic and Republican agenda [noise]\nOur priorities is to make sure\nThat we not only reelected that we expand Republican majorities on Capitol Hill\nCritical election at Central coverage NPR News [noise] essential\nReporting every day here on northwest public broadcasting on MORNING edition all things considered and weekend edition from NPR\nNo a link work by other gender close enough written in Paris in Nineteen thirty four with Deborah rich virus that featured soloist here the saxophone concerto when you flip pitcher\n[noise]\n\nMm\nMm Mm\n\n\n\n[noise]\n[noise]\n\n\n\n", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Moscow", "day": "17"}