{"month": "10", "state": "ID", "station": "KRFA", "content": "\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\nOh you could tell the composed her with a gift for running for the human voice that lyrical qualities wrote that particular piece of instrumental music yes you would be correct Tibet ... and she was on ...\n... doing the owners today here at northwest public broadcasting screaming at N. W. P. B. dot org proudly shipping port Angeles swim at Ninety point one in ... at one or two points southern good morning to you\nAnd welcome to our classical musical proceedings today I'm just five minutes now past eleven\nWell here we have Robert Schumann one of the leading romantic voices as ... as composed arrests critic Anne ...\nDuring the romantic era of the nineteenth century but following in his future wife footsteps well still in her teens Clara feet could written a piano concerto in a minor\nFast forward a decade or no husband Robert does the same casting his contract to win a monitor and having his wife now known as Clara Schumann give the world premiere in Eighteen forty five\nWe have Rudolph Churkin at the piano here a company by the Philadelphia Orchestra under huge enormity is direction the country to win a minor by Robert Schumann\n[noise]\n\n...\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nMm\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nYou just heard the ... the the the team to pieces written by the ...\nForty four the Manhattan chamber orchestra has conducted by Richard olden Clark with a masterful kind of understatement he wants to analyze this collection of pieces as some things slow followed\nBy something fast that's pretty deep and that's the composer himself Henry Cole in the moments just ahead some literature from the French ... for you as we sure this Monday the first of October together here were northwest public broadcasting herded N. W. P. B. dot org\n... a year ago a gunman opened fire on and country music festival in Las Vegas he killed fifty eight people and wounded hundreds more\nPhysically and mentally I could try to sell in private or I could lead by example one survivor helps others confront the aftermath of their near death experiences\nMonday afternoon on all things considered from NPR News\nGetting it for this afternoon running until seven this evening here on the NPR and classical music service of N. W. P. B. music now from the pen of the French ... award named for or shooters the ancient Greeks God of the underworld the afterlife ...\nSixteen friends this is the sweet from the ... from ... with ... directed by Mary Terry Smith\nWell\n\n\nFinancial support from listeners like you and from ... hobby on main street in downtown Moscow the complete pharmacy includes hearing aids services and ... customers can pick up orders from the pharmacy drive through at the back of the store online that Hutchins drug dot com serving the community for over one hundred twenty five years\nThis is northwest public broadcasting\nCutting or if a Ninety One point seven most go to the U. N. W. B. Ninety point five coached and until you until you will not be point one cutting wood also heard on translators two to Seventy four B. K. one or two points up and coming to ski and two to Seventy to the old one or two points three or a female\n[noise]\n\n[noise]\n\n\nFine example of Swedish music immensely popular Swedish music from the early part of the twentieth century the dance of the cow girls sometimes rendered as the ... of the shepherd is\nFrom the incidental music for the mountain king by who go off in a performance there about the stock homeless infant yet to directed by young we love the idea in here at northwest public broadcasting good afternoon to you is Monday the first day of October and right now it's five minutes past twelve\nSymphony orchestras traditionally begin their new seasons in the fall\nThe northwest public broadcasting also has a full tradition of fund drive that lasts for only one day in a single day we raised the money that brings you classical music all year long everyone refers short fund drives but for them to work participation is key your participation\nSo if you've been thinking about donating for the very first time please do show on super Thursday October eleventh\nYou'll be giving the gift of the blind music to yourself\nAnd to your community thank you\nKnow the so called Beethoven the classical guitar\n[noise]\n\n[noise] Mm\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\nMm\n\n\nMm\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\nThe morning\nMid day and the evening in Vienna overtures by\nFrance funds to pay the overture to one of his many very successful folk operas and operatives\nCreated for his the unease public the Academy of St Martin in the fields conducted there by the late ... novel Mariner the Frenchman sounds song she waits in the wings the shop to noon twelve twenty seven on this Monday October first\nAt northwest public broadcasting ... going to join you as usual at the top of the hour at one\nBringing with her a grand expensive concert overture by Eldar ... Ciau like how much your way next hour then and the two o'clock hour this afternoon if you're a fan of Beethoven this is going to be your moment in particular\nI answer these going to share with your performance of Beethoven's fifth symphony in the two o'clock hour today here at N. W. P. B.\nNorthwest public broadcasting BCS program support from listeners like you and the you I wore a symposium welcoming Jane mechanical game designer and inventor of the ... super better her closing keynote the role technology is playing in the modern world is Wednesday October tenth seven PM in the ... center ballroom details at Idaho di di di you slash bar or\nA partly sunny started to your week obviously\nThose from the upper forties to mid fifties a continuing transferring tomorrow especially in the afternoon breezy Tuesdays twice in the mid sixties to low seventies\nHere we find that French romantic cell phones running for his own instrument the piano or French composer who traveled extensively throughout and frequently vacation in and across North Africa\nHe wrote this piece while visiting Darren Eighteen Ninety One ended ends in quite exhilarating fashion with used adaptation of eight folk song from Tunisia did just the Africa fences she ... with ... Colo has the pianist Andre ... is the conductor of the royal philharmonic\n[noise]\n\nWas Africa a fantasy for piano and orchestral by ... songs\nComposed and Eighteen Ninety One and ending there with his adaptation of a Tunisian folk song\n... songs would die Thirty years later Nineteen Twenty one in Algeria a performance there are about ... a company by London royal philharmonic under Andre province direction excellent recording and performance\nOf that music by some songs twelve forty now a Monday afternoon yes indeed the very first day of October so we're starting a brand new weekend a brand new month together and happy to do so\nHere at northwest public broadcasting you know the music you hear every day on this station offers a kind of welcome rushed but from the chaos of politics crisis and catastrophe and well it's good to stay informed sometimes you just need a break from the constant barrage of news\nAnd the music that helps you get that break is made possible by the financial supportive listeners like you show on the next super Thursday fundraiser coming up on October eleventh please join them be one of twenty five hundred members who will help keep the music playing with your guests\nWas public broadcasting one of the Supreme figures hopefully baroque heroes tell your quota Italy a little bit of music comes next today [noise]\nKeeping you company while you do those weeknight dinner dishes if it's just you and so how about some Chopin a little dwarf shot while you check in those leftovers some ... to go with that Spanish rice\nGigi yelling your host for weeknight classical music inviting you to talk some classical music into that apron pocket of yours on your phone download the northwest public broadcasting at\nThe end of the TV dot org and help yourself an after hours company the only good taste [noise]\nA tasty slice of baroque music for you know loose trails to knock the number nine injury you buy quota lick with members of the ensemble known as the English concert\n\n[noise]\nMm\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\nMm\n[noise]\n\n\n\n\n\n\n[noise]\n\nMm\n[noise]\n\n\n[noise]\n\n\n\nYou've just heard the trails to not number nine in she uh taken from the first set of published works by our country local deadly and perform there by members of the English concert\nPaving the trail for coed scouting adulthood coming down the homeless stretch of the great American read you can get more details about both by going to our website did N. W. P. B. dont or get your home Andrew resource for all kinds of things northwest public broadcasting\nWe began this new now or with a weed what ended now with the Norwegian you hunch since and represented here by his third Norwegian rep city ... symphony orchestra as conducted by Carson under some\n[noise]\n\n", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Moscow", "day": "01"}