{"month": "10", "state": "ID", "station": "KRFA", "content": "\nBut ... in the minor by Henry personal\nEdited in the twentieth century by a fellow English when Benjamin Britten we should go on to quote cologne pleaded for you there on historical instruments that was directed by Reinhardt ...\nTo ... northwest public broadcasting well if you're a fan of Beethoven please stay with us because you're going to get a real treat on this day before Halloween next hour we're going to share with you a complete performance of one of Beethoven's piano concerto\nIf your kid has a healthy curiosity you know they ask a lot of questions and it can be tough to explain why the ocean is healthy or how Bones Are formed but they can get answers to their science questions when they ask Dr universe\nSending questions and watch episodes on N. W. P. B. dot org and I'm northwest public television\nUntil you double you will not be point one cotton wood Greenville NPR with classical music community service of the F word or world College of communication at Washington state university\n[noise]\n\n\nIconic march from the score and so the ... the lung for three orange by her game for coffee of\nHe himself conducted the world premiere\nWork actually commissioned by the old Chicago opera company she conducted the prime urine Chicago inner productions shown in French back in Nineteen Twenty one but famous three oranges march ... Lauren most bill conducting the national orchestra friends\nHere at northwest public broadcasting herded N. W. P. B. dot org ... tonight at shoveling bill McLaughlin returns with another Halloween themed edition of his show exploring music and tonight you're going to hear from two giants of the nineteenth century Mendel's southern Brahms both with which has\nIn mind that this Halloween seasonal much tonight at seven Oh yes after dark\n... ... number three in the motor you're recording body can be an artist Erica good\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] ...\n[noise] [noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\nThem\nAnd [noise]\n\nMm [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\nFor a\nIn\nMe\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\nThere's\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\nI\nLive in concert the Japanese British pianist meat school would cheat a conductor courts don't do ... and the members of the oil comes to the ballpark is trope I'm stardom in my performance of the ... number four inch sheet by Beethoven\nOur meet your work here in the late morning hours the northwest public broadcasting your number supported NPR and classical music sherpas thank you so much for joining us today I'm Steve breeder actually do to you\nLots of musical thrills shoals\nMusic associated with this data to end this season that's coming your way tomorrow plus the continuing weeklong series on exploring music also some ... scores courtesy of bill McLaughlin unexplored music tonight\nSome pieces about which is which is ... courtesy of mental stone and Brahms sibling this evening right after all things considered\n\nWe going\nYou are listening to northwest public broadcasting on K are essay Ninety One point seven as than Moscow Pullman a listener supported public service of the Edward our morale College of communication\nAt Washington state University in cooperation with the University of Idaho school of journalism and mass media\nThis northwest public broadcasting cutting our F a Ninety One point seven Moscow cutting and double you'll be Ninety point five clerks than in the end W O Ninety point one cutting wood also heard on translators K. two Seventy four B. K. one or two point seven coming to ski and two to Seventy to the old one or two points three or a female\n[noise]\n\nYou\n\n\n\n\n\n\nOvertures to one of the most important of all Russian approached and one of the earliest\nYogurt shore to Richland and you meet a work introduced to the world in St Petersburg in Eighteen forty two who's the bike link up a great program they're conducting the LA philharmonic fine curtain racial fraud Tuesday Afternoon\nHere at northwest public broadcasting an N. W. P. B. dot org Hi there I'm Steve leader continuing ensure hosted in till one o'clock in the arrival of ... right now it's exactly six minutes into the noon hour well Halloween has inspired some great classical piece as\nMany of which are going to hear it throughout the day in the evening tomorrow but you also have a chance to grow a collection of some of the best and darkest passages from classic film scores\nRanging from night on bald mountain which is\nI can start you have two chances to hear Hollywood Halloween please join us either with three or it eight PM tomorrow Halloween for a musical ride through popular film scores just right for the occasion\nThen right here on the NPR in classical music service of N. W. P. B. a more gentle kind of film for your right know\nDating from the middle part of the nineteenth century going to begin to this is a a very clever little piece of wolves cold the Mozart teach them which is a play on words in German end in English it's known as the Mozart as\nUsual flown or making use of Mozart themes those performance given by the members of on the stump all the other\n\n\n[noise]\n\n\n\nThe screenplay members civil unstoppable so you know ... knew there was music from MIT nineteenth century the you know and that a heady dense period and the Austrian imperial capital use a loner\nIt's our teeth than a play on words invoke German and English combining Mozart with artists the Mozart us for you there goes the lung or\nHelping to a great sure Tuesday Afternoon you're a northwest public broadcasting and W. P. B. dot org that smartphone or tablet of yours thanks to our downloadable app and yes your smart speaker as well\nJust ask it to play northwest public broadcasting however you're listening today and whenever and wherever it thank you so much for doing so and for supporting our full range of programming here I'm Steve leader your host until one o'clock this afternoon on major work this hour is by Edward Greek and that music is coming next\n\nHalloween is coming time to celebrate demons books and other things that go on in the night [noise]\nHi this is bill McLachlan and this week on exploring music we're going to investigate\nThe system will fascination that scary tails and encounters with dancing demons seem to hold for composers and uh a few wild men as well [noise] a whole week of scary sounds on exploring music [noise]\n\nAnd more of those art fully scary films are coming your way this evening including selections about witches and\nLet's explore some ed far Greek right now on during that same the Danish Norwegian playwright lewd to hold back on the occasion of the bicentennial of his birth from Eighteen eighty four this whole ... sweets by Edward Greek your recorded by the ... chamber orchestra of New York\n\n\n[noise]\n\n\n\n\n\n\n\n\nThe whole barrel sweet for ... ... on a ring that famous play right on the occasion of the bicentennial of his birth back in sixteen eighty four and the use of baroque you're Eighteen century dense forms their bike advised creek one of his best known and best loved scores\nHis hold their sweet offered to you today by the conductor list or if he is chamber orchestra of New York\nWell if you've ever studied the piano if you have a particular interest in perhaps a family member who has studied or is working on piano literature right now then you're certainly familiar with the name of ... CEO slim into a performer\nA composer a manufacturer of the arrest someone very closely associated with the piano ... studies will next dollar a very different side of ... and ... going to share with his fourth symphony next door thought o'clock hour today here at northwest public broadcasting\nDr universe about science history geography health I'm just about anything that makes him curious ask Dr universe at N. W. P. B. dot org and on northwest public television\nPartly tools we shouldn't go to new heights helping out on the upper forties to mid fifties Pullman forty nine fifty five in Lewiston\n... bringing overnight especially around Lewis the loose in the upper thirties to lower forties you can expect to wait and breezy Halloween rain throughout the day tomorrow ... ranging from the upper forties to mid fifties\nUh\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n[noise]\n", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Moscow", "day": "30"}