{"month": "10", "state": "ID", "station": "KRFA", "content": "Thank you very much for George ... on the podium they're conducting the London philharmonic orchestra here at northwest public broadcasting\nAre you listening to an W. P. B. on the radio or are you hearing this on your phone or computer maybe a smart speaker this station stays up to date with technology to serve you in whatever way is most convenient for you get the N. W. P. B. app come to an W. P. B. dot org or tell your smart speaker to play northwest public broadcasting\nNorthwest public broadcasting today are of a Ninety One point seven Moscow Pullman trillion W. B. B. point five coached in Lewiston until you double your vote by viewpoint on cutting wood Greenville NPR on classical music or community\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n... numbers Thirteen now by Frederick ... with the pianist eat deal beat it\nFive minutes now past eleven here at northwest public broadcasting well there's another important election coming up no we're not talking here about the midterms\nThose happen next month we're talking about when that happens this week the great American read one hundred famous book titles and your votes for your favorite and yes you may vote more than once if you like at N. W. P. B. dot org now since the voting closes on Thursday\nThe music to Iran and W. P. P. R. classical music service will tickets accused from some of those treatments titles on the list of one hundred best loved books so please be lifting this coming Thursday morning beginning at nine\nI'll start with some musical tales for your music inspired by the great American read and then cast your vote should N. W. P. B. dot org\nSlash and she ate our\nHere are members of Congress profit cologne with their period instruments in the sweet tempered three ...\n\n\nWorry sketch many of the main themes of the work you're about to hear he dedicated this court to the St Petersburg chamber music society back home in Russia after the group it made him an honorary member\nThat's where it began as a string sex tests later it evolved into a full scale quite some shoes workforce string orchestra and that's the version you're going to hear this morning this souvenir Florence ... and this performance given by the conductor list or feels chamber orchestra\n[noise]\n\n[noise]\n\nMm Mm\n[noise] Mm [noise]\nMm [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nKnow\n\nNew York\n\n\nYou are listening to northwest public broadcasting on K R S a Ninety One point seven as than Moscow Pullman a listener supported public service of the Edward our morale College of communication at Washington state University in cooperation with the University of Idaho school of journalism and mass\nMedia this northwest public broadcasting K. or F a Ninety One point seven Moscow K n double you'll be Ninety point five clerks than in K n W O Ninety point one cutting wood\nAlso heard on translators K. two Seventy four B. K. one or two point seven coming to ski and two to Seventy two D O one or two points three or a female\n[noise]\n\nAnd on court today for London royal philharmonic orchestra conducted thereby untold do to see these ... fourteen in B flat matrix my ... for shock twelve over for no one on Monday afternoon\nHere at northwest public broadcasting thank you for joining us today I'm Steve ... will be along it won the afternoon and Dolly will join us at least vicariously speaking in less than Fifteen minutes you're going to your performance of the totally sweet ...\nHe was the CIO Montreal conducted by the group under the ... to ...\n\nMm", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Moscow", "day": "15"}