{"month": "10", "state": "AZ", "station": "KUAZ", "content": "Listen for the b._b._c. World Service fly from London here on NPR eighty nine point one you can also watch your daily reports from the b._b._c. World Service every weekday afternoon at\nFive thirty on our sister station PBS six it is sixty five degrees in midtown Tucson we're expecting mostly cloudy skies overnight tonight with low fifty three there's a Seventy percent chance of scattered showers and thunderstorms in fact\nThere is rain moving through the Tucson metro area right now this is eighty nine point one ... Tucson and eighty eight point nine K. U. S. F. emanates the Sierra Vista broadcast service of the University of Arizona it's seven o'clock [noise]\nFrom American gangs radio [noise]\nScattered showers and storms in fact there is rain moving through the Tucson metro area right now this is eighty nine point one ... Tucson and eighty eight point nine K. U. A. S. F. emanates de Sierra Vista broadcast service of the University of Arizona it's seven o'clock\nSome American Jan's ranked in\nOf it in a way to go\nJohn ...\nThe jobs the jobs\nWelcome to an archive edition of twelfth street jar Public Radio's weekly jazz blues and comedy Jay\nAnd this week to take you back to two thousand\nCelebrate our whole town Kansas city's jazz\nWe find out what gives Kelly blues and\nUpdating great old lever Stoller to go into Kansas City\nIt all happened this hour about twelve ...\nAnd this week take you back to two thousand\nCelebrate our hometown Kansas city's jazz\nWe find out what give Keli blues and\nAll these great old lever stolen to go with the Kansas City when\nIt all happened this hour about twelve\nLosing comedy it's good to have you with us\nYes it is and Dave is right tonight we celebrate the music of blues great Kelly with a special guest Kelly\nWhat gives Kelly the blues and learn some new versus tour towns favorite song but first ebony did you hear about that Ohio State football coach who tackled the fan running onto the field during the game\nYes I did the right after that they offered him the job of Secret Service director\nPresident Obama says he still feels safe in the White House of course you can always hot and the place no one can find them oh you mean next to his birth certificate\nKelly the blues and learn some new versus tour towns favorite song but first ebony did you hear about that Ohio State football coach who tackled the fan running onto the field during the game yes I did the right after that they offered him the job of Secret Service director\nPresident Obama says he still feels safe in the White House of course you can always hiding place no one can find them oh you mean next to his birth certificate\nAll right let's listen to some cats who don't let anybody in the front door unless they have some beer here's David\nBest in the twelfth street jump band with a tune that Frank Sinatra recorded with Kansas city's own Count Basie I've got you under my skin\n...\nAll you read the lord of the\nTried to know\nDid give the\nToo much they'll miss a rare\nGo so well\nDid give the\nMuch still miss a rare\nGo so well\nThe government do reality\nGoes beyond you know\nThem look good when\nGovernment do reality\nGood or bad you know\n[noise]\n[noise]\nCan weigh\nBecause I got\nA new scheme [noise] [noise]\nAbout a factor in the past [noise]\n'cause I got you\nOn the Fox news [noise] [noise]\n[noise]\nBorn right here in Kansas City Kelly channel the rhythms of Kansas\nThe mixture you\nJackson and make\nKelly could easily be a one woman show\nStill see make the minor featuring great instrumentalist on her album\nWas the legendary blue glass musician than Bush to\nBeen featured in the movie to dance with me and bunker hill\nAnd she's a favorite on that other public radio\nKelly could easily be a one woman show\nSee make the minor featuring great instrumentalist on her album\nOr the legendary blue glass musician than Bush or\nBeen featured in the movies and then to me and bumps\nAnd she's a baby on that other public radio music variety show a prairie home companion\nYou represented on the oppressive albums including our most recently released on the ADA records\nShe can a freebie it'd been away into new\nPoetry collection of phones\nSpend the next hour playing the music Kelly\nAnd who better to celebrate that music and the woman herself\nBut honor to have you here with us Joe I'm happy to be here thanks for having me\nAnd back in Kansas City what is Kansas City mean to you and your career\nWell you know what Kansas City means everything to me it's where my family\nSpend the next hour playing them either Kelly\nAnd who better to celebrate that music and the woman herself\nBut I wanted to have you here with us go I'm happy to be here thanks for having me\nAnd back in Kansas City what is Kansas City means to you and your career\nWell you know what Kansas City means everything to me it's where my family's from where I was born and they've music uh Kansas City has influenced me deep and wide and over the years when I first started playing out in the world with Kansas City that got me on my way and I am glad\nDebate on the happy\nWhich is a good day there in New\nIt's a shame you pay their new\nWay back live on five jobs not like radios weekly jak losing comedy jam\nKansas City jak huh but we do to shore worldwide popularity\nOr one of our biggest musical heroes pianist and band leader Williams basing\nBorn in red bank of New Jersey the count\nUp in Harlem sound and the piano lessons his mother gave it to\nJoin the vaudeville acts\nWe're back live on the job or something like radios weekly jazz blues and comedy jam up the whole world knows\nKansas City jak huh that's probably do the story of worldwide popularity\nOr one of our biggest musical heroes the innocent bandleader William basing\nBorn in red bank New Jersey the count\nUp in Harlem sound and the piano lessons his mother David\nToying with involve they'll hack granted in Kansas City in Nineteen twenty five\nBill basically like the rough and tumble lives out here so he's stuck around and made a living playing Oregon movie theater in Nineteen twenty nine he landed a gig playing piano with banking\nWhen many died during a routine tons of letters and he basically was elected to take over and the town basically man was going\nTo the story goes that record producer John Hammond was in Chicago listening to the radio when he heard the Basie band live from the radio club on a show just like this one and drove to Kansas City signed\nCareer exploded\nWe're going to celebrate them basically bad but then some day Joe Williams\nMatt dab in the middle\nThe story goes that record producer John Hammond was in Chicago listening to the radio when he heard the beep you ban live from the rental club on a show just like this one drove the Kansas City signed\nChild's career rich of loaded\nWe're going to celebrate debate the band saw Joe Williams\nMet dab in the middle\nAny clue\nThey say we\nDo they do not\nHave to be legitimate\nAny clue\nThey say a week\nDay to night\nBut at the gym\nGym Cadillac\nJim stoop to close those\nI'm dressed a Q\nA chat room house\nSome barbecue\nIn the streets or\nNatural ...\nIn the street the\nNatural ...\nA wagon low\nAttend ... boulevard to wash it down\nSpecial guest changed the trial but I don't really think Robert\nAlthough it's actually do they have to\nBase either Kelly let's keep the Kansas City music rolling here\nSpecial guest Tracy a trial at least ...\nAll the sex of the coolest tattoos [noise]\nFrom base either Kelly let's keep the Kansas City music rolling here's Kelly ... singer own composition when love is at the wheel\n\nLay all the time then and then the broken down hard dance dry bone\nI'm not out in the field and then\nThe time during then and then I wrote them down on our dance dry\nAll night out in ... and then\nGets then Yahoo both as long as they say\nEighteenth and find jazz festival right here in Kansas City and how about when the Marcellus\nYou all have a lot of fun I Hope it's as much\nFun as it is for us to be a part of it is it is for you to listen don't go anywhere who\nAre small coming up right heroes welders drinks jumping\n\nMore coming up radio swelled St Joe\nBetter\n\nWe losing comedy jam\nThey John and John ...\nJoints always jumping at a jazz club near you in Phoenix stopped by the national or the rhythm rhythm\nIndianapolis westerners can I was talking at the jazz kitchen\nIn Austin, Texas the elephant room in a place to be\nIn Portland, Oregon the music can be found at the secret society ... ... runners alone genetic code a jazz club or the spots in Minneapolis and the brotherly love is found\nHave a drink kick back and let the most\nA jazz club near you in Phoenix stopped by the national or the rhythm real\nIndianapolis listeners can now he was talking at the jazz kitchen\nIn Austin, Texas the elephant grooming place three I'm\nIn Portland, Oregon the music can be found at the secret society ... runners alone genetic code a jazz club or the spot in Minneapolis and the brotherly love is found\nHave a drink and kick back and let the most wash over you at the candlelight lounge in New Jersey\nOr you're closer to Madison price Shanghai jazz every week in Tucson or other John's atomic it right here in Kansas City come down to the green lady lounge for stopping by the blue\nGet out and support your local jazz and blues and that's where it's always jump\nHe's the man of the songs on the Count Basie orchestra second Nineteen thirty seven topsy\nHe's the man with a song from the Count Basie orchestra circa Nineteen thirty seven tops the\nThey put out you lie to\nMe that Martin you're not going to make a change to take me out to the ball game or you\nKnow go to the needs\nTo wait a minute it got by wind and rain\nThan that though I spend most when I\nI yeah I Know but there's so much more sugar\nOkay with you and I don't have the wine and women\nThey put on your wedding\nWe that Martin yeah oh you're not going to make may change to take me up at a ballgame or you\nKnow the city it needs to more than ... wait a minute it got by with wine and he's got three\nAnd that's how I spend most when I\nI yeah I Know but there's so much more\nBut I still have the wine and women\nYou've been listening to twelfth street jump on listener supported NPR eighty nine point one join us tomorrow evening at seven for jazz happening now with Jeff family a weekly preview of new jazz CD releases\nSupport comes from bill in Joanna west cuts supporters of the way confluence Center for creative inquiry the shutter helps advance creative collaborative research and shares it with the community which programs and public engagement events details are confluence ... zone dot EDU\nPort at NPR eighty nine point one join us tomorrow evening at seven for jazz happening now with Jeff handling a weekly preview of new jazz CD releases\nSupport comes from bill and Joanna west cuts supporters of the way confluence Center for creative inquiry the center helps advance creative collaborative research and shares it with the community through its programs and public engagement events details are confluence ... zone dot edu\nWe can expect partly cloudy skies overnight tonight with low around fifty two in the morning is also a twenty percent chance of showers and under storms for Tuesday we can expect mostly sunny skies with an afternoon high up near Seventy a continued twenty percent chance of showers and maybe a thunderstorm also possible after eleven [noise]\nThis is NPR already nine point one K. U. ways the FM HD Tucson at eighty eight point nine K. U. A. S. and HD Sierra Vista a service of the University of Arizona [noise]\nOh one K. U. ways the FM HD Tucson at eighty eight point nine K. U. A. S. S. H. D. Sierra Vista a service of the University of Arizona [noise]\nFrom NPR News in Washington ... President Trump today suffer himself the devastation caused by hurricane Michael in the Florida Panhandle last week after viewing the record you by air he visited in a distribution center in Lynn have an outside Panama City and describe what he saw\nI've seen pictures but it's hard to believe when you're above if they don't play that she's a total devastation\nThey know how to bluff\n... President Trump today suffer himself the devastation caused by hurricane Michael in the Florida Panhandle last week after viewing the wreckage by air he visited in a distribution center in Lynn have an outside Panama City and describe what he saw hard to believe\nI've seen pictures but it's hard to believe when you're above if they don't play and that would be the total devastation\nThey know how he left [noise]\nThe heads up\nHe later visited neighboring Georgia the storm is blamed for at least Seventeen deaths in four states more than a hundred and fifty thousand people are still without power in Florida after the hurricane WFSU Sean little K. he reports on recovery efforts\nCrossroads academy charter school in Quincy, Florida outside Tallahassee remains closed but students and teachers are here distributing hot meals and food to the community you know people just here eating with her son and daughter she says the storm was\nTerrible it was time to watch how the wind was blowing it will make it all the shingle dumped him home and everything and um I was watching all the trees ...\nAre working around the clock but officials say could be anywhere from weeks to months before cleanup efforts are complete\nHe remains closed but students and teachers are here distributing hot meals and food to the community you know people's is here eating with her son and daughter she says the storm\nWas terrible it was terrible [noise] if you have the wind was blowing it would have taken all of a single dumped them home and everything and um [noise] I was watching all the trees to have three and half\nOf define everywhere crews are working around the clock but officials say could be anywhere from weeks to months before cleanup efforts are complete talk with electric hopes to restore power to most Quincy residents by friday but the hardest hit areas could be in the dark for two weeks or longer for NPR News I'm Shawn okay he in Tallahassee\nTens of thousands of homes and businesses lost power in northern California by design Pacific gas and electric ordered a blackout fearing high winds will toppled trees and power lines and spark wildfires the utility already could be liable for billions of dollars in damages caused by wildfires this year\nThe Trump Administration is proposing to export coal and gas from military bases on the west coast John Ryan from member station K O W in Seattle has more\nInterior secretary Ryan Zinke he told the Associated Press he aims to use military bases or other federal sites to ship fossil fuels overseas before\nPower lines and spark wildfires the utility already could be liable for billions of dollars in damages caused by wildfires this year the Trump Administration is proposing to export coal and gas from military bases on the west coast John Ryan from member station ... W in Seattle has more\nInterior secretary Ryan Zinke he told the Associated Press he aims to use military bases or other federal sites to ship fossil fuels overseas for our allies\nHave affordable reliable of bugs in energy\nWest coast states have blocked coal exports Washington governor Jay Inslee says he won't let the Trump Administration kid around environmental laws\nHave to show compliance with state and federal laws we have the right to protect our water in our air\nThe coal industry views exports has a lifeline as domestic use falls for NPR News I'm John Ryan in Seattle\nAllen is dead at the age of sixty five along with Bill gates Allen cofounded Microsoft the world's biggest software company the two at a falling out in Nineteen eighty three and Paul Allen became a philanthropist who also invested in conservation and professional sports is company announced he died today of non Hodgkin's lymphoma\nStocks close lower again today the Dow lost eighty nine points down about a third of ... percent\nThe cues falls for NPR News I'm John Ryan in Seattle Paul Allen is dead at the age of sixty five along with Bill gates Allen cofounded Microsoft the world's biggest software company\nThat too with a falling out in Nineteen eighty three and Paul Allen became of philanthropist to also invested in conservation and professional sports is company announced he died today of non Hodgkin's lymphoma\nStocks close lower again today the Dow lost eighty nine points down about a third of ... percent this is NPR News\nSears is now in chapter eleven bankruptcy filed a record as Asian plan in white plains New York today it proposes to shut down about one hundred forty two of its seven hundred stores by the end of the year and lay off thousands of employees Sears was founded in Eighteen eighty six and published its first male or a catalog two years later\nIt grew to become the biggest retailer in the world\nThe former security director for the Senate intelligence committee has pleaded guilty to lying to the FBI NPR's Carrie Johnson reports\nAuthorities say James will lied about his contacts with reporters when the FBI interviewed him in late twenties Seventeen wolf has pleaded guilty to a single felony charge in federal court in Washington D. C. his lawyers emphasized that will do not share\nHad a lot of two years later if you were to become the biggest retailer in the world the former security director for the Senate intelligence committee has pleaded guilty to lying to the FBI NPR's Carrie Johnson reports\nAuthorities say James Woolsey lied about his contacts with reporters when the FBI interviewed him in late twenties Seventeen\nWolf has pleaded guilty to a single felony charge in a federal court in Washington D. C. his lawyers emphasize the wolf did not share classified information with reporters covering the Senate intelligence committee and at his sentencing hearing shortly before Christmas they're expected distress his nearly Thirty years of service\nThe guidelines call for ... to serve between zero and six months the judges allowing wolf to remain free until he faces punishment Carrie Johnson NPR News Washington\nA federal judge in Los Angeles today throughout a lawsuit by adult film actress Stormy Daniels she had sued President Trump for defamation after he had tweeted that she was lying about being threatened and twenty eleven not to talk about her claim she had had a sexual encounter with Trump\nThe president tweeted it was a total con job the judge said the tweet constitutes rhetorical hyperbole normally associated with politics and that's protected by the first amendment\nIn a federal judge in Los Angeles today throughout a lawsuit by adult film actress Stormy Daniels she had sued President Trump for defamation after he had tweeted that she was lying about being threatened and twenty eleven not to talk about her claim she had had a sexual encounter with Trump\nThe president tweeted it was a total con job the judge said the tweet constitutes rhetorical hyperbole normally associated with politics and that's protected by the first amendment\nI'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent about whether that's on line over the air or in a bottle more Sierra Nevada dot com\nWhen the Greek debt crisis hit many European officials supported letting a Chinese shipping\nCompany takeovers record will now some European observers have regrets\nBonds or if they if they're if they find the same [noise] and give it a\nSign of gaining a foothold in Europe's economy in the next MORNING EDITION\nAM to nine AM here on NPR eighty nine point one\nSierra Nevada dot com\nWhen the Greek debt crisis had many European officials were letting Chinese shipping company takeovers record will now some European observers have regrets\nThey expanded into and they find their economic snakes than going to be safe in Europe\nChina is gaining a foothold in Europe the ... on the next MORNING EDITION\nFive AM to nine AM here on NPR eighty nine Boyd one\n\nAnd\nDa da da\n\n\n\nThen they\nUp\n...\nMiddle\n\nLot of them\n\nThen they\n\nBetter\n[noise]\n[noise]\nDa\n\nMm Mm\n\nNo\n\nIt's my but get assigned soprano saxophone from a drummer list trio project called a recurring dream just before that we heard the drummer Liz trio that was the inspiration for my making it says album the trail of Jimmy Jew free and Paul bland clarinet\n\nThat's Mike but get a sense of parental saxophone from a drummer list trio project called recurring dream just before that we heard the drummer list trio that was the inspiration for Mike McKenna says album\nThe trio of Jimmy drew free and Paul play on Claritin piano respectively and Steve Swallow who you heard playing electric bass on both those out here's the Jason Stein quartet and\nNow we're around on\nHello again during the big band there are some of the most popular tunes of today was derived from Spanish speaking country including especially\nCuba to go [noise]\nMany of them but not all had English lyrics annexed program will be in effect a Spanish lesson to it and why don't you go\nSwinging now with David Thursday evening at seven o'clock here on NPR eighty nine one one\nThis is jazz Neal tester and this is the cat ... featuring pets Navarro on Trump\nTrump Spanish speaking country including especially in Cuba to go [noise] many of them but not all had English lyrics\nAre next program will be in effect Spanish lesson to then why don't you go swimming with David Thursday evening at seven o'clock here on NPR eighty dollars board one\nThis is jazz Neil ... this is the had them around sex featuring Navarro on trumpet\n\nReally believe\nDe la Brea\n[noise] [noise]\nReally believe\nDe la Brea\nAnd they did when it does bring my\nBring it gave me a little bit you know the girls\nBut you had to do it\n\nOn the other day and on\nBut do you do\n\nIt is it a little\n\nAs a baby you know a\nThat he had a little\n\n\n\nThe blown out of the girl looking with Nobel dental\nUp\nUp\nAnd it goes dum\nThat's nice of music from vocalist run the Charleston here's the Alto saxophonist from Canada named PJ Perry\nThat's nice of music from book was wrong the Charleston here's the outer saxophonist from Canada named PJ Perry\nWing the skin the neck the heart you're making chicken meatballs cooking the knee card ledge\nAll things considered from NPR News\nThe heart you're making chicken meatballs cooking the knee cartilage all things considered from NPR News\nStarted again for the um every day here on NPR eighty nine boy one oh\n\nListening to the jazz satellite network on listening supported NPR eighty nine point why\nSupport comes from bill in Joanna west got supporters of the UAE confluence Center for creative inquiry center helps advance creative collaborative research and share that with the community through its programs in public engagement fence details are confluence centered dot Arizona dot\nOur forecast for the overnight hours partly cloudy with a low around fifty two twenty percent chance of showers and thunderstorms for Tuesday we can expect mostly sunny skies and afternoon about Seventy and a twenty percent chance of showers thunderstorms also possible yeah [noise]\nThis is eighty nine point one K. U. A. Z. ... Tucson and eighty eight point nine K. U. A. S. N. H. D. Sierra Vista broadcast service of the University of ...\nOvernight hours partly cloudy with a lower around fifty two twenty percent chance of showers and thunderstorms for Tuesday we can expect mostly sunny skies and afternoon about some of the other twenty percent chance of showers from the storms also possible yeah [noise]\nThis is eighty nine point one to ... FM an HD Tucson and eighty eight point nine K. U. A. S. N. H. D. Sierra Vista broadcast service of the University of ... [noise]\n\nLive from NPR News in Washington I'm nor rom\nSecretary of state Mike Pompeo is on his way to Riyadh Saudi Arabia he's expected to meet with the king to discuss the disappearance of Saudi writer ... who hasn't been seen in public since he entered the Saudi consulate in Istanbul, Turkey nearly two weeks ago\nTurkish authorities say they believe he was killed there is so good Jay has been living in the U.S and wrote for the Washington Post hundreds\nFrom NPR News in Washington I'm nor rom secretary of state Mike Pompeo is on his way to Riyadh Saudi Arabia he's expected to meet with the king to discuss the disappearance of Saudi writer ... who hasn't been seen in public since he entered the Saudi consulate in Istanbul, Turkey nearly two weeks ago\nTurkish authorities say they believe he was killed there because ... has been living in the U.S and wrote for the Washington Post\nHundreds of people are still in shelters days after hurricane Michael's slammed into the Florida Panhandle it came ashore last Wednesday as one of the most powerful storms on record to hit the continental us NPR's Quil Lawrence has more on recovery efforts\nCharts and chainsaws are in high demand as residents clear fallen trees and patch up the holes in the ruse made by hurricane Michael's one hundred fifty five miles per hour winds electric generators or sought after with power companies still tentative about when the lights might come back on\nThere is no cell phone signal and much of the region locals have been getting tips from radio stations about where they might find gas food and water distribution and medical care\nTraffic in and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flew into the pan handle\nHurricane Michael's one hundred fifty five miles per hour winds electric generators or sought after with power companies still tentative about\nWhen the lights might come back on there is no cell phone signal in much of the region locals have been getting tips from radio stations about where they might find gas food and water distribution and medical care\nTraffic in and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flew into the pan handle from all over the state Quil Lawrence NPR News Miramar Beach Florida\nPresident Trump visited Florida and Georgia Monday to view the devastation he said the government is doing all it can to help the survivor's\nNot know phrase evolved it wouldn't even blown off [noise]\nThe thing is to be\nAt least Seventeen deaths in four states have been blamed on the storm\nMicrosoft cofounder Paul Allen has died at the age of sixty five from complications of non Hodgkin's lymphoma as NPR's Martin Kaste reports the tech billionaire help define the early look a personal computers and went on to shape the look of his home town\n\nAt least Seventeen deaths in four states have been blamed on the storm\nMicrosoft cofounder Paul Allen has died at the age of sixty five from complications of non Hodgkin's lymphoma as NPR's Martin Kaste reports the tech billionaire help define the early look a personal computers and went on to shape the look of his hometown\nIn those early photos of Bill Gates and Paul Allen it's the bearded Allen who looks like the grown up starting in the seventies the two childhood friends parlayed their computer hobby into the world's most important software company providing the dust that ran IBM's another PC clones\nIllness forced Allen to seed control of the company to gates but his Microsoft shares made him a billionaire and then the succeeding decades he became a major influence here in Seattle as owner of a local football team and as a real estate Baron\nEllen spent millions on brain research and causes such as Ebola but also on memorabilia of his youthful enthusiasm science fiction and rock and roll\nMartin ... NPR News Seattle\nSears once the largest retailer in the world is now in chapter eleven bankruptcy and plans to close stores and eliminate jobs\nSoft chairs made him a billionaire and then the succeeding decades he became a major influence here in Seattle as owner of the local football team and as a real estate Baron Allen spent millions on brain research and causes such as Ebola but also on memorabilia of his youthful enthusiasm science fiction and rock and roll\nMartin Kaste NPR News Seattle\nSears once the largest retailer in the world is now in chapter eleven bankruptcy and plans to close stores and eliminate jobs to stay in business at least for now this is NPR\nA trial is underway in Boston this week claiming that Harvard University discriminates against Asian American applicants\nAnd an opening statement Monday lawyers said the school deliberately ranked Asian Americans lower on a personal rating use to measure trade such as courage and likeability a lawyer for Harvard denies any discrimination\nThe archdiocese of Washington has published the names of twenty eight clergyman credibly accused of sexually abusing minors as far back as the Nineteen fifties a lotta wise of member station WBUR AMU reports\nOf the twenty eight religious leaders accused in the new report\nSome have multiple accusations of abuse more than half were convicted for their crimes\nSuch as courage and likeability a lawyer for Harvard denies any discrimination the archdiocese of Washington has published the names of twenty eight clergyman credibly accused of sexually abusing minors as far back as the Nineteen fifties a lotta wise of member station WBUR AMU reports\nOf the twenty eight religious leaders accused in the new report\nSome have multiple accusations of abuse more than half were convicted for their crimes and many have already died\nThe news comes just days after Pope Francis accepted the resignation of archbishop of Washington cardinal Donald Wuerl who's been accused of covering up sexual abuse scandals during his time as the bishop of Pittsburgh\nThe survivors network of those abused by priests criticized the timing of the release a group called the move a quote hastily assembled PR stunt men to distract from worlds resignation for NPR News I'm a lot of lives in Washington\nFederal regulators are proposing prescription drug companies to advertise on television they're required to include praises health and Human Services secretary Alex ... says patients deserve to know what a given drug could cost when they're being told about its benefits and risks a trade group says in ...\nThe group called the move a quote hastily assembled PR stunt men to distract from worlds Frederick nation for NPR News I'm a lot of lives in Washington\nFederal regulators are proposing prescription drug companies to advertise on television they're required to include prices\nHealth and Human Services secretary Alex ... says patients deserve to know what a given drug could cost when they're being told about its benefits and risks a trade group says including the prices could discourage people from seeking medical care I'm nowhere from NPR News\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home at ... dot com\nYou're attuned to jazz with Neal tester and this is the latest from Russell Malone his album is called time for the dancers this is the ... and composition and titled little ... [noise]\nAnd book appointments online at home made visor dot com\nYou're attuned to jazz with Neal tester and this is the latest from Russell Malone his album is called time for the dancers this is the ... countries in composition entitled to be on\n\n\n\n\n\n\n\n\n\n[noise]\nThe latest from Sherman or be he's there an out the saxophone a tune that he wrote for the piano player on the date the pianist is Eric read the Tunis called blues for pop or read that also featured Vincent Gardner on trombone with Gerald cannon on base and Willie Jones a third on drums\nThat's from Sherman or bees album entitled to Rudy in Kansas\nAnd just before that we heard from the saxophonist out of Italy whose name is rose at Rio\nI'm In a or B he's there on Alto saxophone a tune that he wrote for the piano player on the date the pianist is Eric read the tune is called blues for pop or read that also featured Vincent Gardner on trombone with Gerald cannon on base and Willie Jones a third on drums\nThat's from Sherman or bees album entitled to rule in Kansas\nAnd just before that we heard from the outer saxophonist out of Italy whose name is rose at Rio Giuliani and an album entitled Mr do do which is\nCertainly belied by the intelligence with which he plays the warning with what she covers various tunes on this album\nIncluding the one written by Ornette Coleman called the blessing and before that we heard from Russell Malone leading his band and it is his band this is the band that he travels with an with which he recorded his most recent album called time for the dancers with Rick germanson on piano looks like the basis really Jones a third on drums\nAnd arrest him alone on guitar on the Bobby Hutchison tune called little bees poem here on jazz with Neil ... where we have music from the group known as S. O. A. R. coming up and just\nA couple of minutes with a little music from sunny still getting us into the movie\nAnd with which he recorded his most recent album called time for the dancers with Rick germanson on piano look Selleck debates as Willie Jones the third on drums\nAnd arrest them alone on guitar on the Bobby Hutchison tune called little bees tone here on jazz with Bill Tancer where we have music from the group known as S. O. A. R. coming up in just a couple of minutes with a little music from sunny step getting us into the\n...\n[noise]\n\nOooh\n\n\n\n\nMm [noise]\n\n\n\nUm\n[noise]\n[noise]\n\n\n\nMm\n\n[noise] Mm\n[noise] sunny said um saxophone with electronics and Don Patterson um Oregon\n\nThey\nYou\nKnow\n\nThey\nYou [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nDa da\nDa da\n\nDa\nDa\nDa\nDa\n[noise]\n\n[laughter] [noise]\n\n[laughter]\n[noise]\n\nFrom the pharaoh which group there was based in Chicago\nIn the Nineteen sixties and seventies and went on to influence a lot of different kinds of music it through the various members of the pharaohs but will tell you about that in just a second we started out in that set of three with a April May Web that is the singer and lyricist name\nAnd her musical partner in partner like Randall Heywood who plays trumpet and Google horn together they call their band sounds of April and Randall or store to a ... a are just a short\nAnd from the album which also is titled store we heard wouldn't sphere that one came out in two thousand Seventeen and the middle of this that we heard\nSet of three with a April May Web that is the singer and lyricist name\nAnd her musical partner and partner in life Randall Heywood who plays trumpet and flew can horn together they call their band sounds of April and Randall or soar to uh S. O. A. R. just to shorten it and from this album which also is entitled sword we heard wouldn't sphere that one came out in two thousand Seventeen\nIn the middle of this that we heard a more recent album released by Bob for real the trombone as he calls his a band is little big man and the album jazz ... dream man on the piece we began with a kiss\nYou heard of ... and then we close out the set with the pharaohs as I mentioned this was a band that was active in the late Nineteen sixties early Nineteen seventies in Chicago\nThat was combining jazz and funk\nAnd soul into something almost on categorize about that later became an important component of house music\nIn the Nineteen nineties this was a band that was that rediscovered some twenty twenty five years after they had made their final recording and all of a sudden was at the ...\nSixties early Nineteen seventies in Chicago that was combining jazz and funk\nAnd soul into something ... almost ... categorize about that later became an important component of house music\nIn the Nineteen nineties this was a band that was rediscovered some twenty twenty five years after they had made their final recording and all of a sudden was at the heart of a lot of other fusion and mash ups that became this dance form called house music so the pharaohs had a fairly\nWide range and a fairly wide reach you could say\nIn addition to that a couple of musicians including the drummer Maurice White who wasn't on this recording but was a part of the pharaohs earlier went on to become known as earth wind and fire\nAnd that brings us around to this latest album by the Canadian saxophone is Corey weeds and features Mike la done on Oregon it's entitled let's groove subtitled the music of earth wind and fire this is ...\n[laughter]\nCome known as earth wind and fire and that brings us around to this latest album by the Canadian saxophonist Corey weeds features Mike la done on Oregon it's entitled let's grooves subtitled the music of earth wind and fire this is ... [laughter]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\nLittle\n\n\nThan\nI don't\n\n\nNeed to\n[noise]\nThink that\n\n\nWere central\nTo extend\nHe goes out to be\nIn the long\n[noise]\nOh\nYou're listening to the jazz satellite network on listener supported NPR eighty nine one one or more music right up news headlines from NPR ... some of the programming broad jazz\n[noise]\nYou're listening to the jazz satellite network on listener supported NPR eighty nine points one\nA lot more music right after news headlines from NPR\nSome of the programming broadcast on K. U. A. V. has made possible by a grant from the corporation for public broadcasting we can expect mostly cloudy skies tonight low around fifty four to six two percent chance of scattered showers under storms that will be a little breezy as well with these southeast early wins of Fifteen twenty miles per hour [noise]\nOr Tuesday partly sunny with a high up sixty eight and a forty percent chance scattered showers with thunderstorms also pops yeah\nThis is NPR denied point one Kay ... Tucson and eighty eight point nine K. U. A. S. H. D. Sierra Vista broadcast service of the University of Arizona\nBut under storms also possible in the afternoon [noise]\nThis is NPR already nine point one K. U. ... Tucson end point nine K. U. A. S. H. D. Sierra Vista broadcast service of the university versus\nLive from NPR News in Washington I'm neuron six days after hurricane Michael head parts of the Florida Panhandle are still without electricity or potable water and NPR's Quil Lawrence reports\nMany are still missing after the storm\nOf people are still living in shelters thousands or starting the painstaking process of trying to file insurance claims were hired contractors or get assistance from FEMA\nWhile the search for survivors is over poor phone and Internet service has made it difficult for people who let their loved ones no they're okay in the devastated town of Mexico beach it's still not clear how many of about two hundred people who stayed through the storm might not have survived\nEleven thousand military personnel and their families evacuated from ten to air force base which took a direct hit they're still waiting for permission to ...\nWe're hire contractors or get assistance from FEMA while the search for survivors is over poor phone and Internet service has made it difficult for people to let their loved ones no they're okay in the devastated town of Mexico beach it's still not clear how many of about two hundred people who stayed through the storm might not have survived\nEleven thousand military personnel and their families evacuated from ten to air force base which took a direct hit they're still waiting for permission to get back to their homes on the base Quil Lawrence NPR News Miramar Beach Florida\nPresident Trump visited some of the devastated areas in Florida and Georgia Monday agriculture secretary Sonny Perdue is also there he said the damage to pecan growers in southwest Georgia will be felt for generations\nPercentages of countries across the country across the state itself was Georgia were tall and those are worth a whole of the nuts go full blown off so that they were looking for a bumper crop and costs tones and the nuts and the devastation that it was heartbreaking\nThe storm struck the Florida Panhandle last Wednesday as a hurricane one of the most powerful storms on record to hit the continental us a joint Turkish and Saudi investigative team search the Saudi consulate in Istanbul, Turkey\nSo you know so we're we're tall hole and those were the whole of the most go full blown off so it'll ruin overall income and because of the nuts and those are breaking\nThe storm struck the Florida Panhandle last Wednesday as a hurricane one of the most powerful storms on a record to hit the continental us\nA joint Turkish and Saudi investigative team search the Saudi consulate in Istanbul, Turkey Monday nearly two weeks after journalist or multiple she\nCautioned gossipy entered the building and apparently never came back out he's feared dead secretary of state Mike Pompeo is on his way to Riyadh Saudi Arabia to meet with the king to discuss the disappearance NPR's Michele Kelemen reports\nPost columnist Jamal because she'll be was last seen entering the Saudi constantly ... earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to ... Trump says he spoke by phone with getting some on and they're sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord ... to the consulate and killed him there the cases draining us relations with Saudi\nThe Saudi constantly ... earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to his Yogi Trump says he spoke by phone with ... on and they're sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord 'cause Yogi to the consulate and killed him there and\nThe case is draining us relations with Saudi Arabia though Trump is made clear he doesn't want to disrupt lucrative arms deals Michele ... NPR News the state department\nAre underway in a village at the border between North Korea and South Korea with military leaders from both sides as well as representatives of the United nations command\nThey're discussing efforts to disarm the demilitarized zone one of the world's most heavily fortified frontiers the two Koreas have also agreed to halt military exercises and remove landmines from the DMZ this is NPR News\nA federal judge in Los Angeles Monday dismissed a lawsuit by Stormy Daniels the adult film star had sued President Trump for defamation after he tweeted that she had to lie about being threatened to be quiet about an alleged affair the judge said the president was for it\nIts own one of the world's most heavily fortified frontiers the two Koreas have also agreed to halt military exercises and remove landmines from the DMZ this is NPR News\nA federal judge in Los Angeles Monday dismissed a lawsuit by Stormy Daniels the adult film star had sued President Trump for defamation after he tweeted that she had lied about being threatened to be quiet about an alleged affair the judge said the president was protected by free speech laws\nAnd the U.S Supreme Court has declined to hear an appeal of a California court decision requiring paint companies to pay for the removal of lead paint in older California homes from member station ... D versus shave reports\nSure wouldn't Williams and no industries and con agra will have to pay four hundred and nine million dollars into a fund addressing lead paint in ten cities and counties across California James Williams is a county council Santa Clara the jurisdiction that brought the case Eighteen years ago\nLead paint manufacturers of filed appeal after appeal they made motion after motion and finally we are now in a position to be able to actually move forward and clean up this toxic what\nPay four hundred and nine million dollars into a fund addressing lead paint in ten cities and counties across California James Williams is a county council Santa Clara the jurisdiction that brought the case Eighteen years ago\nThe lead paint manufacturers of filed appeal after appeal they've made motion after motion and finally we are now in a position to be able to actually move forward and clean up this toxic what paid from thousands of homes\nA statement from ... million and con agra says the company should not be held liable for selling products that were lawful at the time for NPR News I'm ... San Francisco\nPacific gas and electric says it hopes to restore power is soon to amount sixty thousand customers who lost its Sunday the California utility had deliberately cut off power as a precaution\nUtilities are concerned that high winds will topple power lines and ... wildfires I'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the size Sims foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more than ... ...\nPartly cut off power as a precaution utilities are concerned that high winds will topple power lines and for wildfires I'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations\nOther contributors include the size Sims foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size Sims foundation dot org\nYou're tuned to jazz with Neal tester here the organic vibe a trio [noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\nThis had the vibes and as such was known as the organic vibrio we heard them doing the old Harry Warren standard called summer night\nSo if you take that same instrumentation and now you add a guitar to it you end up with the group that Dave striker leads on his most recent album here's the title track it's called striking a head\nAnd as such was known as the organic by trio we heard them doing the old Harry Warren standard called summer night\nSo if you take that same instrumentation and now you add a guitar to it you end up with the group\nThe tape striker leads on his most recent album here's the title track it's called striking a head\nIn certain temperature\n[noise]\n[noise]\n\n\n\n[laughter]\n\n[noise]\nShit\n[noise]\n\n\nThat's the latest from guitarist Dave striker here the classic from Roy Hargrove\n\n\n[noise]\nJust like you know the point where they\nDo would really depend on how the last one was\nThat in New York\n[noise]\nI didn't know what time it was then\nDo a lot of any time it was how the black woman was turn\nThat in no\nUse them\nLife ...\nTo be young to be made to be your number\nThink you'll stay in touch you yell village on the I ...\n\nTime\nThere was a shiny out\nDo you think that your your you\n\n\nAnd there was shot in the house\nThen on it you\nIt was ... to ... you know\nMy hand\nOr like the girl was in those movies\n[noise] it'll be really low\n\nYour favorite really on such hear your voice\nI Know\n\nLike the man who was in love with\nAnd [noise] you know low\n\nYour favorite really own sets hear your voice there are no no\n\nMm Mm that's\n\nAnd then it was and and there's no room for the person could come in St Louis in the\nThings to do but and the bread and\n\nSome some some students going into the ... maybe\nFor me to go to school in the\nTo the mall\nOlder so criminal record\n[noise] the fate and ...\nAnd all\nYou don't speak to the store for family still support\nThe war and we didn't even need to do and what they're going\nThe ... there was a player for ...\nBook for their birthday\nAnd in the field I gave them which is a man from what you do\nStill in the world and what what\nTo do for work in the book for\nYou\nKnow from the ... still go and look\nBorn with a little needed for the\nRunner or to school\nNeed to ...\nYou\nNeed a mix\nYou\nTo be a line to be young\nTo be mad to be\nJust the ... the in the ... the I\n\nDon't I\n\nI wanted to know ...\nIs it to\n'em\nWell I wanted to know from ... I'm\nIt's\nSupposed\nRecorded live at the village\nVanguard here the Chicago's ... they really McGrath\nThat ...\n...\nThat name\n\n... ... ...\n...\nAnd I knew", "year": "2018", "show_name": "Jazz Network", "city": "Tucson", "day": "16"}