{"month": "10", "state": "AL", "station": "WAPR", "content": "Information about the shows broadcast times in school systems are discovering about auto RG classical guitar lived next door in Alabama public radio ... University of Alabama\nMississippi Alabama public radio therapy of the University of Alabama W. H. P. R.\nAnd the ... the I like those shows\nW. H. I. L. O. B. W. A. L. S. in Tuscaloosa\nDevil you teach history the the Tuscaloosa\nEvery case still I mean if we are we are we are we I we are Alabama public radio [noise]\n[noise]\nHello and welcome to classical guitar alive I'm Tony Morris classical guitar alive is broadcast worldwide thanks to the generous supported the ... foundation in Charles in taco Parker elite foundation in ... Oregon and thanks to a gift in loving memories of Adam branch or [noise]\nThanks for joining me for this week's edition of classical guitar alive we'll hear three pieces of bottom by Argentine composer moxie motor vehicle ... also the concert tangle of windows are is by Katrina the route and also a programmatic work for a guitar quintet by Australian composer Philip Houghton title in ...\nWe'll start with ... performing scar lady cinematic Kirkpatrick lifting three twenty two\n[noise]\n[noise]\n[noise]\n[noise]\nGoing\nLose\n\n... and\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\nTo the park open this week's edition of classical guitar along with Scott ... in a major Kirkpatrick listing three twenty two\nThis next piece of music was inspired by a piece of jewelry Australian composer Philip how was given a pin that made up a number which inspired him to compose his piece for guitar and string quartet titled a false hope in ever\nSince then the titles been Jordan a bit we'll hear guitarists Karen show in the lenders quartet performing in amber by Philip how [noise]\n\n\n[noise]\n[noise]\n\n\n\n\nMm [noise]\n\n[noise]\n\nMm [noise]\n[noise]\n\n\n\nBut the\nGoing to do the things that they never goes and da da da\n\n\nNa\n\n\nNa na\n\nAnd\nI don't\n\n\nGuitarists Karen sharp and the lenders quartet performing in neighbor by Australian composer Philip how to make his music for two guitars by Argentine composer moxie Modi I go to a whole big W Don ... St George a mirror to perform ... says they don't you or three pieces the bottom\n...\n\nIn\nThe air\nNo [laughter]\n\n\nNo [noise] [laughter]\n[noise] [noise]\n[noise] [laughter]\n\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\nMm\n\nMm\n\nNo no\n\n\nDa da\nDa da\nDa da da\nDa\nDa da\nDa\n\nDa da\n\nDa\n\n\n\nDa da da da\nDa\n\nDa\nDa da\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUh ...\n[noise]\n\n\n\n\nMm\nMm\n[noise]\n[noise]\n[noise]\n\n\nJust\nFor those\n\n\n[noise]\nUm\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]", "show_name": "Classical Guitar Alive", "year": "2018", "city": "Selma", "day": "05"}