{"month": "10", "state": "AL", "station": "WAPR", "content": "Monday November ninth or Presbyterian Church tickets and more information the DSL online dot ORG\n\nAlabama public radio a therapist at the University of Alabama W. H. P. R. sell more than ... our muscle shells that your age I Am no the W A L F them just a little devil you teach history being the Tuscaloosa there'll be ...\nNo the W. A. L. S. W. three beat the Tuscaloosa W six\nOr eight I may say we are Alabama public radio [noise]\n[noise]\nHello and welcome to classical guitar alive Antoni Morris classical guitar alive is broadcast worldwide thanks to the generous supported the ... foundation in Charleston taco Parker elite foundation in ... Oregon and thanks to a gifted loving memories of Adam ...\nThanks for joining me for this week's edition of classical guitar live this week's program is devoted primarily to one large work the Carmen ... by Peter brainer based on the famous opera Bybee say we'll start with music from Brazil John Williams intimacy can you perform she'll go by public ability [noise]\n\n\n\n\nJohn Williams in Timothy Cain open this week's edition of classical guitar allied with the ... go by Brazilian guitars composer polo Delano T\nThe music of George bee Jay's opera Carmen continues to thrill audiences and inspire other composers Slovak composer Peter brain or rather guitar concerto based on themes from besides Carmen we'll hear the Carmen ... performed by the polish national radio symphony orchestra with guitars Norbert craft\nPeter brain or is the conductor\n\n\n\n\n\nWhat do you think that for a day\n[noise] [noise]\n[noise] too lazy [laughter]\n[noise]\n\nNo\nNo no no\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\nMm\nMm\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n\nMm\n\n[noise]\nMm\nMm\nMm\n\nMm\nMm Mm\nMm\nMhm mhm\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\nNo\n\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n", "show_name": "Classical Guitar Alive", "year": "2018", "city": "Selma", "day": "26"}