{"month": "10", "state": "AL", "station": "WAPR", "content": "[noise] [noise] [noise]\nThis is Alabama public radio service at the University of Alabama W. H. P. ours\n... pie I myself show\nW. H. I. L. Moby W A L F in Tuscaloosa\nDefinitely kick here three beat the Tuscaloosa\nEvery case still I mean if we are we are we are we I we are Alabama public radio [noise]\n[noise]\nHello and welcome to classical guitar alive I'm Tony Morris classical guitar alive is broadcast worldwide thanks to the generous supported the ... foundation in Charles in taco Parker linked foundation in mind can pending Morgan in thanks to a gifted loving memory of Adam branch or [noise]\nThanks for joining me for this week's edition of classical guitar alive with music by ... ... T the new guitar concerto titled keep calm and carry on by Portuguese composer Patrice yo da Silva we'll start with music by remote performed by England's even still guitar duo ...\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n[laughter]\nTo do something\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] okay [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\nWhat can\nBe eaten still guitar duo open this week's edition of classical guitar along with the arrangement of ... promos ... will do will continue with more music from the baroque the Oregon guitar quartet they're performing the arrangement of the ... D major oh\nNa na na\n[noise]\nNa\nNa na na na\nNa na na na\nNo no no no no [noise]\n\n\n\n\n\nKnocking down the hall\nNa na na na na\nNa\nDa da\n\n\nDa da\nDa\n\nDa da\nDa\n\nSo\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n[noise] [laughter]\n\n\n\nMm no\n\n\n\nNo\n\nNo\nIt depends on the same\nThing they're going\n\n\n\n\nNa na na\nNa na\n\n\n\nNa\n\nNa na na na na na na na\nDa da\nDa da da\nDa\nDa\n\nDa\n\nDa da da\nJak marshals essay poor guitar featuring guitars Chris for parking in the studio orchestra\n\nYou're listening to classical guitar alive I'm Toni Morrison cp ... more information about this week's program you can visit our website classical guitar outlined duck or you can also find out about some of the other work we do including our music and medicine program which presents classical music performances\nAt no cost to audiences in hospitals in hospice is you can also find out about our exciting new public television program\nFor PBS stations nationwide that's called American Classic that address again is classical guitar outlined dot org [noise]\n[noise] [noise]\n\nDo ... performs ... number one\n...\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nNah\nKeep calm and carry on the title of a new guitar concerto by Patrice ...\nMichael ... was the guitars with the what's next on solo directed by ... ... ... music for solo guitar by Spanish composer and toned Garcia briel prince ... performs his Mediterranean fantasy well\nI Do\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\nMm [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n", "show_name": "Classical Guitar Alive", "year": "2018", "city": "Selma", "day": "12"}