{"month": "10", "state": "PA", "station": "WVYA", "content": "It was most performing arts centers a notch and say most but a large number of performing arts centers around the country are in fact repurposed movie palaces and that is the case with the FM Kirby center which has been a wonderful fixture of the arts here in northeastern Pennsylvania since Nineteen eighty six\nBut its history actually predates the eighties it open in Nineteen thirty eight has the ... theater it was built by Michael ... who had a chain of theaters based in northeastern Pennsylvania who was at one time one of the largest theater operators in the country\nAnd so it open as the ... theater in Nineteen thirty eight in Nineteen forty nine and changed ownership and it became the paramount theatre which is how most people who are around prior to the eighties remember it\nAnd ah then of course as the feeder business changed in multiplex theater is like the one of Wyoming Valley mall open the theater fell on hard times and fortunately was saved and became the FM Kirby center in the Nineteen eighties but we wanted to celebrate the roots the theatrical\nAnd fortunately was saved and became the FM Kirby center in the Nineteen eighties but we wanted to celebrate the roots the theatrical roots of the from Kirby centered this year in particular because this years the ... anniversary of the opening of the theater as a movie theater\nYou launched it with a classic it was the opening film\nYes Alexander's ragtime band open the Kirby in Nineteen thirty eight so when we were setting schedule for the before the Kirby was the curvy series which is what we call it we naturally had to include Alexander's ragtime band because he was the movie that opened to the ...\nAnd you told us that Michael come effort there were coal mine ties\nWell actually Michael come referred for whom the theater was named who built theater he grew up in large though and he was the son of Irish immigrants and as a little boy worked in the coal mines\nAnd this was in the you know the late Nineteen thoroughly twenty century which is just the time that movies were becoming known as an art form and and a business and he saw the business potential of movies as did a number of of people throughout the country and started building theaters in the area\nAnd as I said became very successful but yes he started out working in coal mines\nThat was about the series evil or very excited about it and finding that people are too\nYes we've had very good attendance with the series and we show a different classic movie each month on a friday of the month or next showing is of a murder by death on friday October twenty six\nAnd a murder by death is I think a kind of a a forgotten jam is a very funny movie that was a written by Neil Simon the playwright unlike most of his movies it's not based on a play it was an original script an idea he had\nFor a movie and it was a very successful comedy back in the Nineteen seventies and so we're pleased to show that it has a mystery element which sort of makes it appropriate for the Halloween season\nAnd we're showing that in October and then we have the wizard of Oz in November and uh it for Christmas we have it's a wonderful life and again these are all movies that played out the theater when it was a movie theater\nJust a footnote we've just lost Neil Simon so it's a wonderful thing and not late to\nWell yes it is and and Neil Simon and although we think are primarily as a playwright he grew up a as a fan or a movie fan which is not surprising but he's specially liked murder mysteries and he was a fan of the Raymond Chandler is Maltese falcon with Humphrey Bogart\nAnd the Agatha Christie movie and then there was non and he loved these movies but by his own admission he was a little frustrated at times with these movies because he saw murder mysteries where they would introduce clues at the eleventh hour characters that hadn't been in the story before and so he wrote this this script\nFor murder by death and it's about an eccentric millionaire\nWho actually has the same frustrations and complains that Neil Simon had as a young man\nThe main character who's named Lionel Twain who's played in the movie by the way by Truman Capote which is a kind of a funny bit of casting Truman Capote or the author of breakfast at Tiffany's and in cold blood is the only time he ever appeared in the movie but he plays this millionaire who invites the world's greatest living detectives to his house for dinner party were murder is going to be committed\nAnd then of course they all become suspects and the characters the detectors are all a spoofs of fictional detectives that Neil Simon enjoyed as a kid so you've got instead of a Sam Spade was played by Humphrey Bogart a Maltese falcon you have Sam diamond who's played by Peter Falk\nAnd instead of Dick Norris Charles who're William Powell and Myrna Loy in the Thin Man series you have David ... and Maggie Smith sin early Maggie Smith fell everybody loves her from Downton Abbey but this was one of her early films and David and evident Maggie Smith play indoor Charleston so it's all a satire on\nIt's kind of movies where everybody comes together and spooky all how to solve a murder\nJohn tell us about your experience of being at the Kirby then for the series what does it feel like to be there with these great movies on the screen with an audience like that\nWell I get goose bumps I I really do to sit in that auditorium\nAnd think of Michael come referred who who built this magnificent art deco palace it really is a tremendous building and Michael cover for live for less than a year after the cedar open\nA it open an August of thirty eight and he passed away in February of thirty not so he got to see it open but he of course never got to see it thrive as first as a movie theater in them as a performing arts there\nAnd sit in that auditorium which has been fully restored to the way it was when Michael Hummer for built a theater and then to watch movies that you know played there\nAnd when we showed godfather that was very exciting to me and and ah these movies that we have coming up I'm really looking forward to seeing too and no matter how many times I've seen them I've been to every one of these movies because I Want to have the experience again\nOf seeing that great movie and seeing it now in this beautiful art deco piles\nBefore we put on the microphones you spoke so poignantly about the experience that people have forming bonds with movies and explaining something about how it is that being together in a theater makes a difference\n... people for a very strong emotional connections to movies\nAnd to the experience of seeing them in theaters and people remember the first time they saw a movie oftentimes a first date took place in a movie theater people remember the movie that their parents took them to see for the first time with her was Snow White and the seven dwarfs or Star Wars and a later generation or maybe the Harry Potter movie\nPeople remember that and they form a strong emotional attachment\nTo that experience and then they want to either eleven or in some cases to give it to their children and I found out this early on when I attended a screening of a of a movie we were showing again at the theater chain I used to run maybe ... and we have this classic series and I went to the theater and there was a family of four to see raiders of the Lost Ark\nAnd his mom and dad and two boys about eight twelve years old and I got to talking to them and I said oh is this your first time to see the movie and the mom said no the boys have seen it a hundred times but they've never seen it in the theater\nAnd mom and dad who remembered the movie from when they were growing up wanted their kids to have this experience and it's amazing to see the looks on people's faces when they come out of the theater\nAnd they've now experienced it on a big screen and no matter how good your home theater experiences\nThere is nothing like seeing a movie on the big screen and and you laugh at the same time the rest of the audience does or you jump if it's if it's a um Alfred Hitchcock movie or murder mystery or something and movies are in my opinion best experienced as a communal experience and that's with theater provide\nWe all know the remarkable work that the ... center does in bringing live performance of all kinds musicians and theater\nAnd dance to the region is way but to go back to the roots and to give us that experience and they have taken great care to make sure that the experience is a primo movie viewing experience\nRightly absolutely and of course the Kirby center cells popcorn for all of their events and so when you come to see a movie you're buying the popcorn and the coach just like you would have won the Kirby was a movie theater and it's a beautiful digital presentation\nAnd uh I always introduced the movies on screen there's a three or four men introductions so we give people the background of the movie and it's a little bit of trivia is what went into the making of the movie and you know there's some great stories about things like raiders lost our casting\nThe making of the movie and you know there's some great stories about things like raiders lost our casting decisions the original casting choice for Indiana Jones was Tom Selleck\nBut he couldn't get out of his contract for magnum PI so became Harrison Ford and every movie had that back story you know we think of the movie just as a standalone piece of art which it is\nBut every movie has lots of stories with people and sometimes it's it's they are calculated decision as a result in a great movie and sometimes they're accidents that just turned out to be happy accidents in terms of casting or script changes and so forth\nWhat do we have to look forward to well as I mentioned we have murder by death Neil Simon comedy which I highly recommend as I said it's kind of an underrated uh but but very funny very good Neil Simon movie and then in November we have uh the\nWizard of Oz and we really want to see that on the big screen ... it\nLooks out and I'll tell you and I've watched wizard of Oz and in this in our flashbacks and reprogram\nI've seen wizard of Oz play at other cedars and and been in an audience where moms and dads are there with children\nAnd these children are in rapt attention you can hear a pin drop because it's such a wonderful story and it's in color and you have this wonderful music in your Judy Garland and these little kids have no idea there watching actors who were alive in the Nineteen thirties\nAnd again I I just like I think about Michael cover for it I think what it would mean to Judy Garland and re Bolger and these others if they could no they're still entertaining family and children\n[noise]\n\n\n\nNah [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n... ... a\n\n\n\n\nThe corn and gold violin concerto in the major with ... home in the London symphony orchestra\nVisitors W. V. I. A. idiot on point not enough at W. V. I. H. D. once quieted Wilkes Barre he's holding in Williamsport W BYA eighty nine point seven have him in Mansfield WTO eighty eight point three I found out at like while in pop back\nW. P. A. U. Ninety One point five FM streaming live a W. B. A. dot org we're in Allentown and not eat on point three and in Bethlehem at one of five point seven member supported public radio W. V. I. S.\nSupport comes from east Strasburg university where do I go to college east Strasburg university for new wonder grass and transfers can lock in the same tuition for all four years he has you were warriors belong learn more were warriors belong dot com\nSupport comes from the times tribute for over a century the times Tribune in Scranton assert northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the times tributes there for you and ... news dot com and\nNext time I asked me another Ethan Slater start ups bench Bob square pants the Broadway musical tells us about the call that led to it all\nAnd they said we have this audition for you can't tell you what it is technically the entitled to no end up project but we think you might be the right shape for it [noise]\nThey're joined me off your eyes and very very NPR's our puzzles where again and trivia [noise]\nSaturday at eleven AM on W. V. I. A. F. out\n[noise] lie from NPR News in Washington I'm Lakshmi Singh federal investigators are examining potential explosive devices that were sent to the homes of former president Brock Obama and his secretary of State Hillary Clinton president Donald Trump's two thousand sixteen rival\nNPR's Brakkton Booker reports the secret service in FBI or on the case\nI'm standing about a block from the DC home of Obama there are barricades and the secret service vehicle blocking the road\nThe secret service announced it intercepted a suspicious package earlier today addressed to Obama it was identified as a potential explosive device and treated at such a similar device was addressed to the chapel called New York home of Hillary Clinton neither Clinton or Obama ever received a package of\nThe Trump Administration has condemned which is calling quote the attempted violent attacks adding these terrorizing acts are despicable and anyone responsible will be held accountable to the fullest extent of the law reporting from outside the Obama private residence Brakkton Booker NPR News Washington\nWell this comes a day after security intercepted a device that was confirmed to be a bomb near the home of billionaire philanthropist George Soros a major supporter of progressive causes\nSource was not home at the time they're still no confirmation on whether that's tied to today's developments which also include suspicious packages center Time Warner Saturn CNN in New York\nCNN is reporting that the package was addressed a former CIA director John Brennan at CNN contribute her\nBut NPR's Joel Rose has seen him was evacuated and everything seems to be calm so far\nI don't sense a lot of panic it seems very orderly people are laughing people are seem a little concerned about the work it's not getting done but again sort of like a fire drill like they're chatting with their their colleagues and their friends and I you know I don't I don't think a lot of real panic I hear\nThat's NPR's Joel Rose reporting and other news Turkish broadcaster ... TV reports that Saudi Arabia is no longer blocking Turkish police from searching all well on the grounds of the ...\nAnd other news Turkish broadcaster ... TV reports that Saudi Arabia is no longer blocking Turkish police from searching all well on the grounds of the Saudi consulate in Istanbul investigators\nAre coming for evidence and the killing of Washington Post columnist or ... Turkish officials suspect the dissident journalists death was premeditated in that crown prince Mohammed bin Salman was behind it NPR's Peter Kenyon reports it constantly building has already been searched\nSaudi officials have acknowledged ... died in the coastal it following more than two weeks of denials they said it was an accident during a rogue operation acclaimed met with skepticism from Turkish president reject a bird or a presidential advisors as good a job killing is quote a disgrace that reaches all the way to crown prince Mohammed bin Salman\nEveryone wants those responsible tried in Turkey rather than Saudi Arabia Peter Kenyon NPR News Istanbul\nUs stocks treating slightly lower this hour the Dow is down to fifty five points at twenty five thousand one hundred thirty six but now that is down Seventy nine points are down more than one percent at Seventy three fifty eight\nYes and peas down more than half a percent this is NPR\nMain reportedly will be the first state to use its system of voting that allows people to rank their congressional candidates from first to last on their ballots on election day\nIf no one candidate picks up a clear majority of first place rankings and the last place candidate\nIs eliminated and votes or reallocate in this keeps happening until there is a clear majority winter supporters hope the new system will catch on in other states and discourage negative campaigning that risks turning off voters [noise]\nThe world series resumes tonight with game too at Fenway Park David Price is coming off its first playoff went as a starter will take the mound is Boston looks too when it's second game and the best of seven series from member station WBUR you are in Boston Shira Springer reports\nPitcher David Price will try to build off the momentum of its first playoff when meanwhile the red Sox hitters wanted to build off their performances in the series opener the top of the line up with the bats Andrew been attendee and JD Martinez helped get Boston off to a strong start in game one and manager Alex Cora wouldn't mind more of that\nResult waiting for those three guys who go hub altogether\nBut also spending time in march and I was saying throw the season [noise] um they haven't been hub of the same time there's a good time for that to happen\nIs that does happen then the Dodgers have to a World Series will become much more difficult for NPR News I'm Shira Springer in Boston\nThe Dow is down a quarter of ... percent of twenty five thousand one hundred twenty nine I'm Lakshmi Singh NPR any\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first\nLearn more at Raymond James dot com\nI on Chris daily host of live from here are sometimes rockets sometimes poignant always excellent variety show\nEach week we fill your public radio tote bags truck full of music and comedy for among time favorites to new discoveries you didn't even know what you're worth looking for I Hope you'll join me this weekend for killer show with comedians talk very good position Diana Gordon and the one the only Jeff Tweedy turn on tune in and drop on\nSaturday Night of six Sunday night at eight on W. V. I. A. F. M. [noise]\n\nIt will be moved the cloudy today with ties in the upper forties wins out of the northwest gusting up to twenty five miles per hour cloudy tonight too low\nThe cloudy today with ... in the upper forties wins out of the northwest gusting up to twenty five miles per hour cloudy tonight to lose in the low thirties and mostly sunny on Thursday I ... in the mid forties\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your orchard information station W. V. like a a family\nYou have long if we go in the wings he'll be in just after the news headlines that one from NPR he has medals on a more till four and when ... joined NPR for all things considered\nWe have Swedish music to gather underway this afternoon bronze bearable\nHe lived from Seventeen Ninety six the very end of the Eighteenth century to the middle of the nineteenth century\nAnd this is his company number two in the major ... symphony as he might tell us they're holding ... symphony orchestra under the direction of ... um W. V. I. A.\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\nNo no no no no no\n\n\n[noise]\n\n\nOh\n\n\n[noise]\n\n\n\n\n\nSymphony number two in the major by from bearable music from Sweden performed by holding symphony orchestra under ... he was subtitled the company ... ... ... ... ... sympathy\nAnd there's lots more classical music to come on WB I ate\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your art should information station W. V. like I have a family\nHe will be most cloudy today with high in the upper forties wins out of the north west gusty\nW. V. like I say\nIt will be mostly cloudy today would hide in the upper forties wins out of the north west gusting up to twenty five miles per hour most cloudy overnight lows in the low thirties and sunny skies tomorrow mostly sunny skies ... in the mid forties [noise]\nSan Francisco ... voice through his comedy on\nThe mind Julie while they tried to lose his nephew to marry for money you typically the lead them vibrate can't teach ... hiding stover\nLawrence friendly we get to meet you\nJoin us ... calling on this station [noise]\nThis Saturday afternoon\nAt one o'clock on W. V. I. hey\nAll familiar with Oscar and feeling the original on\nModern musical couple you Andrew Lloyd Webber I'm Stephen Sondheim [noise]\nMostly opera celebrates the challenge of these giant the musical theater with a performance on Saturday October twenty seven\nThink the open in downtown rather\nThis dinner in show production includes favorites from shows such as Lloyd Weber is Benjamin the opera and Jesus Christ superstar\n... into the woods and a little night music [noise]\nMore information go to mostly opera dot net\nWB I celebrate Congress of regional art and cultural organization or details have many more events check the w._b. I arching calendar I catch up on our team potshots\nAt W. V. I. A. dot org slash aren't [noise] listen for art scene with Erica I'm Keith weekday mornings after the use of the lead on W. V. I. A. up out\nThanks Larry and listen for Larry right after the NPR News headlines that one he has Mendel's on and more till four we have some fun music from the stage now it highlights so the pirates opened that spy Gilbert and Sullivan with members of the Welsh national opera\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise] [laughter] [noise]\n\n[noise]\n[noise]\nBetter talk about the big like static size the plane to go back to vote there are a couple of times at all [noise]\nA waitress or changing vote for him [noise]\nWest called ... but the close up all night she got the\nBall game you got\nAll the I Am not a good thing that\nI did some audio tapes won't be ... you know what I thought of it is it is something called the book the jump or get paid\nFor by\nWay our strategy call first came to my ... I feel like something the royals weights I keep talking about kids get to the Web but more on the phone would do [noise]\nJust about to many of them came up to talk about [noise]\nHe wants\nTo work on his route ... most of us saw out too soon for more\nThan ... than it was a lady who all hyped up by the\nTime\nI did see it is a law he'll be home for a good thing to do what I asked about five miles an hour or something like that it is I'm Lori okay we'll be up by getting paid\nFor all of them [noise]\n\nAll wanting me to reach us last year\nWho\nWas sitting\nOn the most talked to\n\nWho wants to know\nAbout it for\n\nA long\n\n\n\n\n\n[laughter]\n\nBut\n\nYou know it's\n\n\n\nReally\n\n[noise]\n\n\n\n\n\n[noise]", "year": "2018", "show_name": "Classical Music with Erika Funke", "city": "Williamsport", "day": "24"}