{"month": "10", "state": "PA", "station": "WVYA", "content": "And so you know the ... the feather and clean it off and put an insertion in it but by the Eighteen twenties and by the certainly by the fifties the pen steel Penn was around and so I'm Penman weren't using wills professionally but the bird remained about Scott and so they are\nAnd by the certainly by the fifties the pen steel Penn was around and so I'm Penman weren't using wills professionally but the bird remained about Scott and so they often drew bound pictures of birds with feathers of course as kind of the gang the mascot in the field\nI was fortunate enough to take a look at the show and there are some remarkable birds the refinement and the detail are exceptional in terms of a rendering and you think the patient send the steady in his of the hand needed to create an image like that\nIt took a um a tremendous amount of time and them concentration to the point where some people in the field particularly I'm a fellow by the name of Albert in men who had\nRun a business college impossible Pennsylvania and won't regularly for some of the periodicals had a long article about the health toll that penmanship at this level took on its practitioners and mentioned a number of people who had wouldn't necessarily didn't use the words nervous breakdown\nBut it seemed like they had to quit the one guy goes off to become a centrally become a lumberjack\nTo regain his um his health and some other things or other people who had whether they had died with central he refers to one person has a slow suicide but not ... it's not clear that the person actually committed suicide but the health effects had caused his early death\nAnd so that kind of extreme concentration and practice did have some negative effects on the health of some of these individuals\nWhat have you brought out of the collection and for us to see well\nThis exhibited specifically about the work of Charles ... for the simple and sad reason that he died a hundred years ago in Nineteen Eighteen on December first\nAnd he was only fifty four and he was returning from um dinner in Columbus ohio it was night and he was crossing railroad tracks and the train did not signal it's approach\nAnd this has been the day before there were dropping gates and things like that and so his car was hit by a trend\nAnd so it's me a hundred years ago and so we're doing kind of an anniversary of his death and celebration of his work\nThere's a few things in the exhibit there is a little bit that kind of as an introduction to what the world the penmanship was at the time including some of his competitors a little bit amount of material about the founding of the school of examples of the publications and the periodicals that he produced\nA lot of his individual flourishing and pen working ... graphic alphabet 'cause he was also besides doing business penmanship he was also doing the higher level of material because he was teaching it so they're quite a few high level very either medieval or in some cases fanciful alphabet ...\nBut he also um was very interested in how children were taught penmanship particularly in the later part of the career as the business aspect of it the teaching businessmen how to write fades away teaching children becomes more and more important than is getting now the primary focus of the company\nAnd so there are essays by him about how to teach there are examples of\nThe books that were being produced for children there are photographs of him in the classroom reading on a blackboard or you know photographs of children learning how to write and so it provides a little bit more of that um educational context for the right school\nThere's a wonderful example of his prophetic insight\nAbout Eighteen Ninety five you gave a speech in this point again the typewriters taking over\nAnd there is this it gets in a sense final push to make penmanship even more simple and fast so that to retain some hold in the business world but he says that if if penmanship cannot compete than it deserves to I'm kind of lose the place he looks forward to embracing technologically\nTo um kind of lose its place he looks forward to embracing technological innovations he thinks the typewriter is a great thing and he looks forward to the day when the typewriter is so small that it can be carried in your pocket and everybody from children in kindergarten um will be able have access to this and of course\nHe didn't live long enough to see that but we now of course have them on the phones where we can do at least some minimal amount of some typing\nAnd so is his vision came came true not quite a hundred years after his death\nWhat about the color versus black and white ratio in terms of what might be in your collection of what might have been taught then was it in the business world largely lacking\nAll almost exclusively black black ink on paper partly because it was a pen art ... while he um\nTaught the design work which was called engrossing at the time I didn't really practice it professionally much or if he did those examples that he created were given to the person for whom it was intended so almost everything in the exhibit is either ... or brushing ink\nAnd so um there's not a lot of color but there's still a lot of great to design work\nNow you have a specialty in old rare books and you're very aware of papers but about different grades his papers for this work\nA lot of what they were doing was only a lot of ... who was doing was probably on fairly straightforward paper not necessarily very you know specialized her hand made I think they were probably\nInterested in papers that were smooth as possible simply because we are using a very pointed hand and you don't want it to catch on fibers in the paper so they weren't using specially made handmade paper and particularly because they were gearing toward a commercial market\nThey wanted to be able to do this on commercial grade papers the finer artwork was probably done on a on a higher grade art paper at the time or a board of some sort but a lot of it is on what you would think regular correspondence and business paper\nWhat will happen at the reception will there be a presentation\nUm yes I'm going to speak about kind of the the history of penmanship during the nineteenth century with and really emphasis on the period from Spencer until the end of the century there's a number of dominance part of which I mentioned with the health impacts on penmanship\nBut there was this need by or at least perceived need by the Penman\nToo I'm kind of creating national professional profile for themselves\nPartly because there was a long standing tradition in America by tenor and Penman who were essentially Jack of all trades who would go from town to town doing a number of things including teaching short courses on penmanship\nAnd professional stopped that they were essentially frauds and plaques and\nGiving the pre field the penmanship a bad name since as they said you really couldn't learn good penmanship in two weeks of one hour courses\nAnd so I'll be reading some anecdotes about how these itinerant where I'm wandering through the hills teaching courses so we'll talk about that but it's partly going to be how the profession saw itself in the late Nineteen century and then with Zander entering kind of toward the end of this\nPet it professional business field how he responded personally to what was going on in penmanship\nYou mentioned Peter Costello and they are closer to you know if they had personal interchange Ah yes\n... visited Costello at least on one occasion and so they they were personal friends ... I Believe invited Costello to publishing his magazine because ... work with at such a high level although Costello did not study with ... he was kind of self taught\nSo he was somebody who came to the attention of ...\nLevel although Costello did not study with ... he was kind of self taught so he was somebody who came to the attention of ... there was very impressed with his work and so they'll to both a personal and the business professional relationship\nReally if we Google thinner closer and we'll find them\nYes and they're producing both for the grade school market as well also for home schooling partly because ... still maintains an interest in teaching courses\nAnd that's apparently still quite popular in home schooling circles and so they do have products that are geared toward home schooling as well as toward the public school marketing in private school market\nIn addition to course materials did they supply or provide or have a a liberal materials like pens and ... Oh yes\nYeah they they are pretty much everything that you would need both for professional and for the school market including material for the teachers charts degrade by any of the Paris and things the things that you remember on your blackboard with letters at the top so yeah they were providing all that kind of educational sport material which is not in the exhibit\nBecause I'm really concentrating on ... personal work do you own a fountain pen I yes it's not exactly a fountain pen exactly but it is a kind of a penmanship pen that vein or would have used up about\nSeven or eight years ago I took a course and how to do spend Syrian handwriting\nI Am not good at it but I wanted to learn how to do it and how the hand and the movements work so that I can at least try to explain that to anybody who has an interest in it\nThey often talk now about the head hand body connection\nYeah there's been some research showing that writing helps you think in certain ways particularly with learning things there's some evidence that taking notes by hand because you have to\nRethink what you are writing as somebody dictates that you remember better than if you were just typing quickly and recording exactly what the person was saying so there is some evidence that being able to do your notes by hand helps you remember things better\nAs you walk through is there something that catches your eye every time you go through what speaks to you about the output\n[noise]\n\nKathryn Wilson brokered calmly with an arrangement ... on the typewriter Roy ... O W the eye and now a favorite of many W. B. I. listeners really understands concerto for piano and orchestrating sci major Stewart good year in Cincinnati pumps or his\nMhm\n\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\nNo no\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\nMm\n\nW T I O eighty eight point three of them were like well I'm ... one point five of them streaming live a W. V. I. A. dot org we have a translator and Clark summit at ... three of 'em your arts and information station listener supported public radio W. V. I. S.\nI. on Chris daily host of live from here are sometimes raucous sometimes poignant always excellent variety show\nEach week we fill your public radio tote bags truck full of music and comedy from lung time favorites to new discoveries you didn't even know what you're worth looking for I Hope you'll join me this weekend for killer show with comedian Todd Barry ... edition Diana Gordon and the one the only Jeff Tweedy turn on tune in and drop on\nSaturday Night at six Sunday night at eight on W. V. I. A. F. M.\nMissions I eat as a stand up comic with cerebral palsy and that's part of our stick\nTheir non oppression Olympics I Would win the gold medal Palestinian Muslim\nI'm female I'm the same old and I live in New Jersey [noise]\nLaughing through the pain that next time on the Ted radio hour NPR [noise]\nSaturday at noon or W. V. I. F. M.\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. I. A. F. M.\nProgramming on WB I is made possible by our members and by ... ... various on it is an electric toothbrush for people with healthy ... and people were sensitive teeth and go more information available at P. R. O. dash S. Y. S. dot com\nLie from NPR News in Washington I'm Lakshmi saying Sandra Day O'Connor the first woman to serve on the United States Supreme court is publicly acknowledging that she's in the early stages of dementia and probably ... disease NPR's Nina Totenberg says the eighty eight year olds confirmation of the high court in\nNineteen eighty one open doors for women across the judicial system it wasn't just that she was the symbol she was very active about that really pushing pushing pushing to get more women into the legal profession and into other places and she writes\nIn her letter as a young girl from the Arizona desert I could never have imagined that one day I Would become the first woman justice on the U.S Supreme Court I Hope that I have inspired young people about civic engagement\nAnd help pave the pathway for women who may have faced obstacles pursuing their careers\nNPR's Nina Totenberg [noise] the Supreme Court is temporarily shielding commerce secretary Wilbur Ross from having to sit for questioning under oath for the lawsuits over the citizenship question on the twenty twenty cents is\nNPR's Hansi Lo Wang reports dozens of states cities and other groups are suing the Trump Administration to get the controversial question remove a lower court had allowed the plaintiffs\nAttorneys to question commerce secretary Wilbur Ross about his decision to add the citizenship question did the twenty twenty cents is\nFor now the Supreme Court is siding with the administration which has argued that the court should resolve these lawsuits based on internal documents administration is already released the first potential trial or the citizenship question is expected to start in New York City on November fifth\nBut in a separate opinions Supreme Court justice Neil Gorsuch noted that the trial may have to be postponed if the Trump Administration asks the high court to hear these cases the plaintiffs suing the ministry shouldn't worry that using the sent this to ask about citizenship status could harm the accuracy of information collected from the census undo along NPR News New York\nTurkish president wretched type air to wants is evidence strongly points to a plan\nCollected from the centers on the long NPR News New York\nTurkish president wretched type baritone wants is evidence strongly points to a plant Saudi operation to kill a journalist and the Saudi consulate in Istanbul NPR's Peter Kenyon has more on air to one's remarks about ...\nThirty one says members of Saudi teams sent it to an ... an adventure the killing scattered out potential areas to disposable body he also says although the Saudi consulate his diplomatic territory there was a murder committed on Turkish soil\nDo an interpreter he called them the Saudi Government to allow the Eighteen people arrested in connection with the show ... killing to be prosecuted in Turkey\nWe uh every discern hosts there so we will not remain silent against this murder end up we will take any steps required cautious on law\nSaudi officials who claimed to show G A critic of the government suffered an accidental death during a fight that broke out after he entered the consulate October second Peter Kenyon NPR News ...\nBy the way it's ... director Gina Haspel traveling to turkey to review the case this is NPR any\n\nAn estimated one hundred thirty thousand veterans are still waiting for their GI Bill benefits this fall NPR's Quil Lawrence reports veterans groups are pressing Congress to do something about it\nThe department of Veterans Affairs has employees are working mandatory overtime shifts to get through a backlog of GI Bill students but more than a hundred thousand veterans are still waiting to get this tape and checks that help them pay for housing while they study\nPatty Murray with the VFW says the VA has been missing deadlines since August without warning the schools or the students\nThe general processing issues right now that everybody is hyper focused on is making sure that we don't have sooner veterans sleeping in their cars\nMurray says a longer term concern is that students need to enroll now for the spring semester and they can't if the VA check hasn't arrived a spokesperson said the VA has at a two hundred to staff to address the problem quote Lawrence NPR News\nVisitors making their way into the museum of the Bible in Washington DC this morning may notice some once popular items are no longer there the museum had to pull five of its Dead Sea scrolls after learning they were fake\nThe Bible museum notify the public about it yesterday after German scholars who examine the artifacts include if they were forgeries however the authenticity of the collection had been under scrutiny since the museums grand opening nearly a year ago\nThe museum is backed by the green family evangelical Oklahoma billionaires who own the Hobby Lobby craft stores liberal billionaire George Soros is waiting to data here from investigators\nAt the source of the bomb that was found in his mailbox at a suburb\nOf New York property authorities are now reviewing surveillance video on Lakshmi Singh NPR any\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\n[noise]\nThe video is your tickets on music your passport journey of the imagination to myth legend than Mr Deeds and ballads in June from ... I Hope you'll come along with me for the ... [noise]\nSaturday Night at eight to own W. V. I. hey\nOn WB I is made possible by our members and by Bucknell lifelong learning Institute W. V. I. T. V. invites you to vote for your favorite novels in the great American\nBy Bucknell lifelong learning Institute\nW. B. I. T. V. invites you to vote for your favorite novels in the great American read\nOn nationwide celebration of America's Best loved books Tuesday nights at eight pm on W. B. I. T. V. throughout October more information is available at W. V. I. A. dot org slash great American read\nDrum roll please this is it October twenty third please join the great American read tonight on WB I a TV and learn\nThe Denali the winter America's Best love novel a unveiled tonight at eight o'clock on the final chapter of the great American read it will become\nMostly cloudy today with the chance of showers this afternoon highs in the mid fifties and probability of rain from delivering fifty percent\nThen cloudy skies overnight a chance of rain showers mainly this evening moves in the mid thirties and cloudy tomorrow to eyes in the upper forties wins out of the northwest coughing up to twenty five miles per hour much\n\nLonger than the air as the Arcadia corral opens a season when the concert for the romantic and all of us enjoy your program touching many aspects of low long for long around ... ... there are two performances Saturday October twenty seven to seven thirty PM at St Nicholas church Wilkes Barre\nOn Sunday October twenty eight that for the first broke majority in church Clark signed for chicken goes Arcadia corral ... doctors even Thomas conduct your Kenya corral the lump sum [noise]\nWB I celebrate hundreds original art and cultural organization for details of many more than just the w._b. I ate marching talented and catch up on our podcast a W. B. A. dot org slash won't listen for art scene with Erica funky weekday mornings after the news that eleven on W. V. AFL\nThanks Larry and we had William boys to open our our an overture overture number tenant F major with the ensemble counter Lena directed by Adrian shepherd on WB I a [noise]\n\n\n\n\n\n\n\n\n\n\nImmigrant music one of our first immigrant music's during the colonial period and we're doing at the ... to came over from ...\nAnd became a minister and ultimately a bishop in the church but he was also prolific composer were complimenting this with music of al ... who came over from Switzerland\nBecame a prominent teacher in this country started conservatory teaching in Manhattan and also Cincinnati in San Francisco we're doing if he's from his Secret Service\nWe're also doing works by Carlos ... who was one of the most prominent teachers in Mexico and the twentieth century\nBut it was very involved in American culture he had concerts done in New York he was the Charles Eliot Norton lecturer at Harvard He was very much a teacher and integral in kind of cosmopolitan musical culture in our country and what are your piece from his back\nEnter grow and kind of cosmopolitan musical culture in our country and what are your piece from his ballot which is a rarity called a frog menthol which is for speaking chorus and he's kind of evoking\nAztec warriors it's a very exciting to use and we're also doing a piece by winning smile who was at Los Angeles composer she's a graduate of Yale she's an Indian American\nA piece of hers called ... which combines the Italian or to the um the I don't know which is a very fast section at the end of his tiny music\nIt's a real show piece require\nBut it shows this kind of hybrid culture\nHer parents actually met in Disneyland but she never would have existed unless they've gone to Disneyland unsettled and in America so a lot of these stories come into play and we will have people speaking from stage about their stories about what it is to be American you know if they were born here or\nIf they came here and I think all these things come into play\nOn Sunday at our Sunday performance at at for before that there will be a free concert lecture that\nPeople might be interested in at three o'clock being run by our new department chair Tom ... Dr Lee is from Singapore where he actually is a specialist in integrated populations of three populations that are mainly an Indian and Chinese\nHe thinks about those a lot of the integration of identities and he's going to be speaking with who sat on my my uh from our sociology department about how we create national identity and how that plays out in the arts that's an interesting pre concert lecture at three before the Sunday Concert\nAnd then after we're we're going to have a talk back with the audience you about you know issues about people's stories you know how do I feel about Being American and we invite the audience to participate in that pedal talk it's going to be a very interesting time with my students on the panel and also faculty members\nSo it it promises to have a lot of layers there's an art exhibit that is going to be in the lobby before people come in the heart of immigrant portraits and\nThere's also a creative space afterward on a Sunday and for people to process what they listen to we have that opportunity to do some painting so there's a lot a lot of lot of layers of this concert in addition to wonderful music especially on the Sunday Concert [noise] how many people will come and take advantage of this kind of\nAlmost a festival of what it is to be American at this point in our national history where we are so kind of interested in who is seen as American and who we welcome and and how in the arts is so important that we hear so many voices\nWe know that Nineteen sixty eight was very significant year in the history of America including two prominent assassinations Martin Luther king junior and Robert Kennedy and there is a piece that you've created bringing together the memory of both [noise]\nThis is an important anniversary or fiftieth anniversary of the death of Martin Luther king and\nA Robert Kennedy and I have done a setting for men's chorus ah that'll be done on this concert it's it's quite a short setting of words from Robert Kennedy's speech in Indianapolis that he gave a April of Nineteen sixty eight\nAnd people to come to this campaign rally expecting political rhetoric\nAnd what they got was an announcement from Robert Kennedy that Martin Luther king had been shot and people were in shock and what they got they didn't get political rhetoric what they got were words that really\nGot through to our humanity and he talked about let us carry out that dream which I think it's a reference to Martin\nOr words that really got through to our humanity and he talked about but it was carried out that dream which I think it's a reference to Martin Luther King's I have a dream speech and he talked about killing our country and he talked about\nThis to end the bloodshed and coming together and I actually set those words last fourth of July or at this piece\nI thought this would be a kind of comment for me about how this concert comes together that we need healing for all the kinds of voices in the country\nBut maybe more emblematic even a lot of the concert is how we ended we're ending it with a Leonard Bernstein letter make our guard and grow\nWhich is from candy and for those\nWho know candy and story the musical candied goes off on the world he thinks he's going to find the best of all possible worlds and he comes back having gotten kind of shaken up\nIn the world and beaten up a little bit\nAnd the messages we just have to do the best we can kind of bigger bread we drop our word we make our garden grow 'em and I I think\nMaybe maybe an effort at the end of the day the concert we we don't have the answer for all those kinds of strikes that are in the country but we're just going to do our best we are going to make our garden grow and\nYou know maybe we can do something to us by [noise] trying to be do are you the best we can\nAll\nOh\nDr\nStevens comments director of coral activities at Lehigh University in Bethlehem speaking with us about a concert programmed titled I hear Americans' singing to be presented by the two hundred singers or Lehigh University coral arts\nUm that's this Saturday October twenty seventh of eight pm on Sunday October twenty eight at four pm in Baker hall\nOwner art center and that is on the Lehigh University campus in Bethlehem for more information on the Web zone or art center dot org the O E L L any are his owner Arts Center dot org to concerts\nOctober twenty seven this Saturday Night at eight Sunday afternoon for with a lecture\nAnd related arts opportunities\n... Arts Center dot org sooner Arts Center dot org I hear American ... America singing under the direction of Dr Stevens [noise]\n\n\n\nYou're tuned to W. V. I. A. Warner Classics is telling us they're very excited to celebrate the ... anniversary of Sean declare\nThe world's raining male chorus according to the New Yorker with a new recording titled then and there here and now which was just released on October ... house and\nThe group is touring to support the release of the new album around the world fifty two performances across the United States Europe and Russia\nThan and they are here and now was recorded at Skywalker Ranch and features recordings a long time ensemble favorites including works by ... and Victoria from the renaissance and nascent Bates and Steven sham it's Stephen\nBy ... and Victoria from the renaissance\nAnd Mason bait and Steven sound much\nStephen ... was featured on an album that is titled I have had singing by trying to clear and that is the selection they've chosen to include on their fortieth anniversary release a terrific owner for Stevens how much\nAnd we'll hear it's just a short piece but it's the ensemble trying to clear\nWith I have had singing by Steven Simon on W. V. I\n\nSee yeah [noise]\n\n\nMy\nFault\n[noise]\n\n\n[noise]\n\n[noise]\nOh [noise]\nGod [noise]\nOh", "year": "2018", "show_name": "Classical Music with Erika Funke", "city": "Williamsport", "day": "23"}