{"month": "10", "state": "PA", "station": "WVYA", "content": "Work in it and finally was premiered but it was under her [noise]\nAnd and the critics totally destroyed it it's not the first time that are happening it's not the first time and can you believe that just a few years when the oil contracts and all the greatest of vitamins they started playing became one of the top vitamin ensured us from or time\nWith his incredible humanity harder for the artist ration credit from the Haitian between the orchestra bylines says Dan life last new\nSerials lyrical second glorious dreaming second movement so\nThe first time that happened it's not the first time and can you believe that just a few years when the ... and\nAll the greatest of vitamins they started playing became one of the top vitamin ... from over time\nWith his incredible humanity harder for the artist ration\nCredit from the Haitian between the or the strip bylines says Dan light last new\nBurial lyrical second lawyers dreamy second movement so it is the concerto that no matter what when and how many times you your herded or you play that or you\nYou attended a performance would like to hear it again and again and again\nWhy did that and find them is is it a very difficult and he was very unusual at the time I\nThink I think so because it costs ski explore all the\nPossibility that the capabilities of the instrument perhaps people had in mind of the ... that ... you know the ...\nMusic incredibly difficult but\nWith the different that check come schemes self was not available\nLike any walks\nSo as difficult as to how can any music is you know because he was composed by by him and he was a vital anything he could personally played it some of the music you know feel more natural for the hands of a violin [noise] Tchaikovsky do not have any ...\nOn on a on the violence\nOn the news from any sense for them to explore the instrument to the maximum in some things\nRequire extra work\nThat some may not have the patience or\nThe interest in doing a\nDuring that time but of course now it's a piece of the repertoire of any violent it wants to make a career it's not such a thing\nThat you don't know what are the you don't play it and whether or not the most wonderful things about the concern is when you listen to this that and if it's play ... let's put it that way if it's play wherever you don't seem that is that\nTypical or that you know a challenging and play\nA because everything's low you know and it's like any music by ... [noise]\nYou know blows natural\nNow that is passionate part of the program the men that I mean we've got the humor teeny I'm guessing that when you say make sure you're speaking about simply number two problems\nThat's correct and it's sometimes called the pastor a symphony like the Beethoven ... number six the symphony came only a few months after the number one in the minor it's much darker much more intense in full of really in tens traumatic car\nSo Brahms perhaps\nSet I think it's time for something a little lighter and this is simply that was written during the summer was vacationing in Austria [noise]\nVery close to the place where mother will go that's interesting by a lake in a village that was beautiful and small cottage of course will open the window and he would see these beautiful\nScenery beautiful you know nature surrounding the place he was staying in a definitely was inspired by so that's why the symphony sounds\nVery pasture alive the tunes are very ... very you know you can\nHe had peace of mind and really wanted to get away a little bit of the drama and the intensity of uh the first symphony it's an Dickey of the major contrasting the C minor and pretty much all the musical themes are up to be in a much\nFull scenery beautiful you know nature surrounding the place he was staying in a definitely was inspired by so that's why the symphony sounds very pasture ally the tunes are\nVery causes very you know you can see he had peace of mind and really wanted to get away a little bit of the drama\nAnd the intensity of the first symphony\nIt's an Dickey of the major contrasting the C minor and pretty much all the musical themes are up to be in a much lighter a mood being said that he is not that the entire seem funny lack of intensity or it's not for\nFound the ... especially in the in the slow moving\nA where the ... gets to shine there\nIn a very leery cause more intense beautiful mentality but it's all about peace it's all about nature and just imagining the opening the window and watching these beautiful\nVillage with the many corridors in the summer flowery really crystal clear lake in front of you and you know and the peace of mind you know the vacationing so I think that would be the perfect contrast for these program started with a very flashy weedy an overture by\nThe great ... going through the dramatic and passionate a pound of Tchaikovsky\nBarry contrasting music and then with the more table problems\nWith his beautiful melodies lash harmony and intriguing rhythms definitely watching over nature\nWhen are we going to enjoy the\nShow the first concert you do stay October of this week's teams at seven thirty PM of the community are center and you can call for it to catch this number five seven zero three to six two for two for\nVery excited about starting a new season and I hope you can join us\nHead on a Edelstein speaking about the new season for the Williams' point symphony orchestra\nAnd the upcoming season opener passion and nature with gas violinist Caroline building\nAnd the music of her teeny Tchaikovsky and brown [noise]\nThe opening concept is on Tuesday tended to sixteen at the community center in Williamsport [noise]\nCalm to begin at seven tenths UPN\nFor ticket and more information you can go online to see a sea lions dot com\nBoom gave the community center bumped stuff it's a pool at science seven zero\nThree to six\nThank you very much to an auto Edelstein [noise]\nAnd to use W. V. I. A. steel town\nWe'll hear music of you'll have the problems though where that\nWill be on the program this Tuesday at the community arts center in Williamsport performed by the Williams was simply the orchestra under Geraldo Edelstein symphony number two in the major over Seventy three was the Berlin Philharmonic under the direction of Simon Rattle [noise]\n\nHow about ... Stein symphony number two in the major Seventy three which is the Berlin Philharmonic under the direction Simon Rattle [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\nMe [laughter]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\nWilliams symphony dot org programming on WB I is made possible by our members we thank you for your support numbers and by dancing cat productions presenting solo piano George Winston performing the dean center in wealth borough this Tuesday October sixteen more information a ticket to George Winston dot com\nThis was W. V. I. eighty nine point nine of M. W. V. I. H. D. ones granted Wilkes Barre his Wilton we're in Williamsport at W. B. Y. eight eighty nine point seven FM in Mansfield a W T I O eighty eight point three of them were like well I'm ... a United one point five of them\nStreaming live at W. V. I. A. dot org we have a translator and Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I. S.\n[noise]\nThis is George Graham Friday nights on both all that shit and mixed bag we play you a request from seven to eight at all that jazz with the\nBest in straight ahead acoustic jazz than at eight it's a mixed bag starting with the daily new releases segment then from eight thirty two eleven will be playing your requests for the unique stylistic blend of contemporary music\nFor which mixed bag has no phone five seven zero six five five to eight or eight to ...\nAnd that's friday evening starting at seven on WB I often [noise]\nNext time on ask me another actor Diane Guerrero talked about her writing process and immigration activism I I thought maybe my voice could be an asset um I Know what this feels like I Know what family separation it so I decided okay I'll write something the news the needle in any\nWay the joy meal for your iceberg for NPR's our puzzles word games and trivia [noise]\nTo borrow at eleven AM on W. V. I. A. F. M.\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. I. A. F. M.\nY. Center for the performing arts presenting Indian dance company to write your grand dance ensemble on Thursday October Eighteenth that seven thirty PM at the white setter tickets available at Bucknell dot edu slash box office or five seven zero five seven seven one thousand\nLive from NPR News in Washington I'm Laurie London Pope Francis has notified cardinal Donald Wuerl the arch bishop of Washington DC that he has accepted his offer to step down NPR's Tom Gjelten says\nWorld has been accused of helping to cover up the sex crimes of priests under his supervision\nCardinal Wuerl has not himself been accused of sexual abuse unlike his predecessor in Washington Theodore mechanic who had to step down as a cardinal in July\nBut as bishop of Pittsburgh world do sympathetically with several priests against whom serious complaints have been made sending them for psychological evaluation but allowing them to remain in the priesthood or approving payments to them\nIn accepting the arch bishops resignation Pope Francis noted that world could have defended themselves by distinguishing between covering up crimes and committing mistakes but the world had not tried to do so he has to world to remain in charge of the Washington archdiocese until a successor is named Tom Gjelten NPR News\nIt's all about right response and recovery now in the aftermath of hurricane Michael that storm has caused massive damage particularly on the coast of Florida\nSupplies of food and water are being brought in some by helicopter in cases where roads are still impassable FEMA administrator Brock Long is asking residents who evacuated to wait a bit longer to return\nQuite honestly it's a dangerous area to go back into a you know when you have this type of destruction there's gas\nUntil a successor is named Tom Gjelten NPR News\nIt's all about right response and recovery now in the aftermath of hurricane Michael the storm has caused massive damage particularly on the coast of Florida\nSupplies of food and water are being brought in some by helicopter in cases where roads are still impassable FEMA administrator Brock Long is asking residents who evacuated to wait a bit longer to return\nQuite honestly it's a dangerous area to go back into a you know when you have this type of destruction there's gas lines that are there there's power lines that are down a and doing so you're putting your life in danger and we ask you to be patient\nSome areas saw several feet of storm surge which smashed through windows ripped off roofs flu outbreak walls Michael is now being blamed for eleven fates holidays and the Florida Senate debate between democratic Senator Bill Nelson and Republican Rick Scott has been postponed\nAnd American pastor has been released from house arrest in Turkey NPR's Scott Horsley reports President Trump had lobbied for pastor Andrew Brunson is freedom\nPresident Trump tweeted this morning that his thoughts and prayers are with the Andrew Brunson\nHopes to have the pastor safely back home soon in the United states Brunson who's from North Carolina was imprisoned in Turkey for two years it was part of a round up following the failed coup against president ... or to what\nThe Trump Administration had champion Brunson cause telling her to one his release would improve us Turkish relations Rosen was transferred to house arrest earlier this summer\nToday's order but he'd be freed entirely was warmly welcomed by evangelical Christians in this country Scott Horsley NPR News the White House\nStocks are recovering to some degree from the law says this week but still on track for their biggest one week last since late march the Gallup hundred and sixty two this is NPR\nRussia's space agency is clarifying that chain of events in\nYesterday's dramatic emergency landing of the ... capsule as Matthew Bodner reports from Moscow to man crew survived\nRussian space agency executive and cosmonauts Sergei ... told reporters today that one of the rockets foresight boosters did not properly jettison and struck the body of the solar use rocket\nHe described a chain of events that correspond with what could be seen from video footage of the rocket industry from within the cabin the rocket was damaged and knocked off course\nThe Russian accident investigation team has begun work in critical that said that they should have result later this month the syndicate confidence that the problem can be identified end result quickly meanwhile the head of the Russian space agency said today that the crew of yesterday's launch will be given another chance\nTo fly sometime early next year for NPR News I'm Matthew Bodner in Moscow\nThe U.S relationship with Saudi Arabia is being tested following the mysterious disappearance of Washington Post columnist Jim ... it's also creating friction between the Trump Administration and members of Congress who are demanding to know what happens\nLawmakers are calling for the U.S to halt arms sales to the kingdom until further evidence that's been revealed Turkish authorities say 'cause she'll be was killed by members of an elite Saudi assassination squad\nAn allegation the Saudis deny meanwhile the leaders of France and Germany say they're deeply concerned and also want answers\nI'm Laurie London NPR News in Washington\nSupport for NPR comes from NPR stations\nOther contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane\nTurkish authorities say 'cause she'll get was killed by members of an elite Saudi assassination squad an allegation the Saudis deny meanwhile the leaders of France and Germany say they're deeply concerned and also want answers\nI'm Laurie London NPR News in Washington\nSupport for NPR comes from NPR's Beijing\nOther contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nI on Christmas really from lives here with Chris viewing [noise] we're proud to be the highest rated to our life musical comedy variety show on public radio in this time slot\nTune in this weekend for our show at college leader in Saint Paul Minnesota with the ... brothers miss Madison Cunningham\nAnd dirty projectors [noise] fly from here we make great radio\nTomorrow evening at six Sunday night at eight O W v I D I F out [noise]\nAnd learn a void go will be here after the NPR News headlines at one o'clock he has an afternoon filled with classical music and then it for will join NPR once again for all things considered\nIt will be partly sunny today highs in the mid fifties wins out of the northwest gardening up to thirty miles per hour mostly cloudy tonight showers likely after midnight moves around forty\nComedy tomorrow showers likely in the morning becoming partly sunny through the day I saw in the low fifties trying to bring Seventy percent\nMostly county are mostly clip partly cloudy and the evening on Saturday as guys will clear and that means is a chance of patchy frost on Saturday Night lose overnight on Saturday in the mid thirties on Sunday mostly\nSunny and cool high in the mid fifties\nProgramming on WB I is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nJohan homo gets things under way for us on a friday afternoon this is a clarinet court tacked with Charles ...\nUm the ensemble lucky ... on W. V. I. A.\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\nMm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\nGo\nTo\n\n\nA\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nAnd then you'll have a chance to attend to three of seven workshops offered on Saturday and that includes the necessity of talking and joking about the taboo which will be presented by Zach Hammond\nAnd we had a chance to speak by phone with Zach about his experience kings\nAnd as a comic\nI went to kings from two thousand six to two thousand ten I started off as an accounting major and then when I realized that that would cause me to harden myself I went in to English\nAnd stuff you are a comic aren't you [laughter] so you were exploring not just storytelling but also language itself as part of your English studies right\nStorytelling mostly because that's what I pretty much do now I'm In my act but also how to just pop early form ideas and convey them to buy the general public because whatever's on your head\nIsn't always going to come out in a way that everybody can understand and appreciate so being an English major helped me fortified those ideas and we knew we bring them together and concentrate them so that everybody can really understand where I was coming from\nWith creative writing part of that program\nOh absolutely that also helped me I'm an argumentative writing as well because with creative writing they also had writing arguments as well so that you knew what you were saying you weren't kind of like talking in circles and not arguing from a false sense of authority you were able to create arguments and stabbed which what you were trying to help people\nHow 'bout see it or did you try any of that\nYeah I did the theater as well I was just taking classes when we were doing and take any here in English are all connected in some way and that\nThey both involve either a performance on the page or performance outside of that into the general public like with writing you are going more for\nCreating an atmosphere in that writing and creating a setting that everybody can put themselves in whereas with theater you're creating the setting so everybody can see it and then it's up to the actors and actresses to\nBring what's on the page to life in front of everybody and\nJust see that he brings that to them\nAnd so in the work you've been doing in comedy you have to do some of each you have to write don't you have to write\nI I ride almost every single day among stage at least five times a week when I'm not even doing just regular shows just working out material that I'm writing down to make sure that whatever I'm coming up with is being taken and properly by an audience as well so there's a lot of writing and rewriting and\nTrial and error people probably don't realize how much writing is involved\nNo they don't even realize how much work is involved the the best compliment and the worst compliment that you can receive as a comic is somebody thinking that they can do it as well\nBut you make it look that effort lists on stage that everybody thinks that they can do it themselves and then it's only when you see the work that goes into building a special or building an act that you really realize how difficult stand up comedy of\nAnd timing is so critical for what you do you probably can't learn that I Would say that on\nNo they don't even realize how much work is involved the the best compliment and the worst complement that you can receive as a comic is somebody thinking that they can do it as well\nThat you make it look that effort lists on stage that everybody thinks that they can do it themselves and then it's only when you see the work that goes into building a special or building an act that you really realize how difficult stand up comedy give\nAnd timing is so critical for what you do you probably can't learn that\nI Would say that on some level there there's a comedic talents that you have to recognize comedy and recognize how to make things funny but at the same time talent will only get you so far you also have to kind of build the skill of it and timing\nIs exceptionally important in comedy but timing is also something that is based off of the individual as well\nThe jokes that I'm going to have are different than say the jokes that George Carlin would have are different than Lily Tomlin would have severe timing is going to be completely different from mine because of the way that I carry myself as opposed to the way that they carry themselves\nHave you done workshops like the one you'll be offering as part of this event before\nThis is I think the third year in a row that they're doing the conference so I've since it and doing my own workshops for it to this will be my third time doing workshops for kings with the conference before that though\nI didn't know of any workshops that were really available I mean there's tons for writing absolutely at different universities and campuses and then there's also just different authors that offer workshops and the like but for comedy there's really\nNot a lot of workshops for that because as we said you can't really\nTeach somebody how to be funny you can recognize things that are humorous and tell somebody that might have some merit to it but other than that it's really hard to teach people\nHow to find their own humor and expressed that everybody else writing on the other hand it's a it's a definite skill you it's another thing that you have to have talent for absolutely but you can teach somebody that's you know kind of mediocre to be better just by the tools and the skills that come with writing\nSo what will you be doing in this workshop what's its title in ... will be your focus\nOf my focus will be the the need to talk about in joke about taboo subjects um especially in the climate that we're in um\nIt's for me it's necessary I think it's necessary in general for society to be able to look at dark disturbing things that exist whether you want to acknowledge them or not\nAwful things exist in our society and our world\nAnd I think that it's better to talk about them and joke about them and I think it's healthy to talk about some of the joke about them as opposed to ignoring them because if you ignore the problem it's only going to get worse whereas if you can shed light on it and find humorous musing about those kinds of things\nYou're better off I think you're better rounded person you are less stressed person you are less worried person because you're able to look at something that's\nAwful and you know deal with it and smile at it and go okay it's not that bad\nLuck kinds of things might you suggest that the people in your workshop do look kind of an exercise do you have an example\nA lot of the things that we're going to look at her one why people find things to be if something is offensive or you feel that you shouldn't talk about it and why do you feel that people shouldn't talk about certain subjects 'cause that that's a very important thing to\nFigure out as to why you don't want to talk about something because a lot of the time it's just a matter of it being uncomfortable\nAwful and you know deal with it and smile and go okay it's not that bad\nLuck kinds of things might you suggest that the people in your workshop do look kind of an exercise do you have an example\nA lot of the things that we're going to look at her one why people find things to be if something is offensive or you feel that you shouldn't talk about it and why do you feel that people shouldn't talk about certain subjects because that that's a very important thing to\nFigure out as to why you don't want to talk about something because a lot of the time it's just a matter of it being uncomfortable\nAnd that also ties in with the idea of why philosophy is dangerous because philosophy forces you to examine your life and your beliefs and your you know your own place in the world and sometimes\nYou won't like the answers that you get when you questioned those things and when you really look into them because they could see a lot of your deep rooted values and beliefs and that's dangerous because we are what we believe from the time that were born\nYour instructed and things are kinda put into your head that are necessary for society from you know one Fifteen to function properly\nBut then when you become an adult and you have your own mind and you have your own way of living a lot of things that you may have believed at the beginning of your life aren't necessarily true anymore or necessary for you to live your life and it just depends on who you are\nSo that's one of the initial things is why do you feel something shouldn't be talked about were joked about or is considered to be offensive and what does that mean to be offensive and do you have a right not to be offended you have a right to\nNot hear things that you don't want to hear and then also we would look at different clips from comics who do talk about taboo subjects of George Carlin or Doug Stanhope help build bird Lewis Black all comics that don't just say things that are inherently funny but they also talk about things\nThat are dark disturbing parts of society and they make them really really funny\nYou'd welcome participants to come in and explore those things and maybe even write a little bit try their hand at coming to terms with a subject that might be uncomfortable and writing something about it\nWith exercise is like that one thing I've always tried to get people to do is say or write the worst thing that they can think of that they're comfortable with because that also kind of gauges\nWho that person is and where they're you know their thought pattern lives if you can get somebody to write something that's disturbing\nDepending on the subject depending on what they do with that subject it gives you an idea of exactly who those people are but also how their mind functions how they see society\nSo that's a lot of fun to do and it's also in a quote unquote safe space so you can say these things and we know that you don't necessarily\nBelieve these things or you don't want\nAnything to come about them you're just saying\nThat I mean that's another important distinction that just because you say something doesn't necessarily mean that you think it's true like if you're quoting something from Mark Twain you don't actually believe any of the things that the characters and Mark Twain piece believe you're just repeating those things and it's the same way with writers that\nA writer and another themselves is just that the writer\nThe character that the writer chooses to portray in a story or an act or any of those things\nDoes not represent the writer themselves and that's another thing that you can also do with comedy that a comic doesn't necessarily have to be that person on stage can be an entirely different person like Larry the cable guy for example that the character that he's planning on staying\nActually believe any of that faith that the characters and Mark Twain piece believe you're just repeating those things and at the same way with writers bad a writer and another themselves is just that the writer the character that the writer chooses to portray in a story or an actor any of those things\nDoes not represent the writer themselves and that's another thing you can also do with comedy that a comic doesn't necessarily have to be that person on stage can be an entirely different person like Larry the cable guy for example that the character that he's playing on stage\nWe don't know exactly what the man behind Larry the cable guy believes if you ask them I'm sure it'll tell you what that character is just back\nA character anybody have any reaction to what you did in the past workshops you've offered", "year": "2018", "show_name": "Classical Music with Erika Funke", "city": "Williamsport", "day": "12"}