{"month": "10", "state": "PA", "station": "WVYA", "content": "And then in the various translations I've\nRead along the way I think that that's what's said to me\nWe get moving from story and the stories we tell aim us at what we want to become what what we believe how we believe in the universe is configured in in what what we think it's possible for us yeah I think\nI think the the Bible is the first and then of course I you know I grabbed guns literature I was an introvert child of a happily wildly extrovert mother\nIn an extrovert culture and I found books very ... I loved that kind of company\nThat one has three books sometimes I think about it like or or describe it as a squeezed machine such as Temple Grandin\nMade for herself that amazing autistic writer who did animal husbandry and made all these design it and she created a squeeze machine\nAs she called it because she saw how much other people love getting hug and realized it was it was too much for her but she's a lot that the pressure like the pressure of the shoot that cattle go through\nMight actually be pleasurable and she used that to sort of commerce out that on our comfort yourself I think books were like that for me it was often human company was just overwhelming and too much\nSo on the one hand the story was meaning as in ultimate meaning worship and religious\nFaith the other thing was that it was very comforting to be able to understand people without having to sort of get to ... to over stimulated by\nThem and we come to that extraordinary memoir that you created black eyes when you describe yourself as an inch a bird it doesn't mean that you don't want to tell people about what's going on in your world or in your heart\nBut it sounds like in creating something as powerful as not\nThat it takes a lot of courage for someone who is by nature an introvert did you find that you were reaching deep down for the strength to do it or was it just something you needed to do when down in that way for your own sake\nWell I mean this this is why you send kids to warm right because they don't know what they're getting into\nI [laughter] it wasn't so courageous [laughter] because I didn't think anybody would like to read it [laughter] I wouldn't have been Paul uphold the thing that I'd be here on the other end of adulthood we'll talk more about it but I think it does take some commitment\nTakes discipline and commitment really to mine one's own memories\nAnd look for true\nThat maybe you had suspected but\nHave an all the waste set yourself yet and I think that for me that's the challenge of the memoir is is well what is what is the story that is true that you haven't quite laid out here\nAnd you have an ability that is just exceptional and that's one of the reasons you're going to be\nI lay down so yeah\nAnd you have an ability that\nIs just exceptional and that's one of the reasons you're going to be given this award because you are able to create characters who are memorable they are their own people within the bounds of the stories that you're telling again the stories are compelling\nBut we do get a sense of their presence\nSome writers say that the characters told them about what they're going to want or what they're going to do how about your relationship with forming these unique individuals\nWell I'll tell you until I was in my forties I used to when I was home I kind of make the big news snort whenever I heard that kind of conversation with the writer\n[noise] I have had that experience I don't like to describe it that way 'cause sometimes it sounds to pressure but but I think you have to you have to have\nAn imagination where those those\nPeople seem almost like ... like real [noise] you have to know them that well in order to be able to write about sometimes I Would read to my grandmother I've just finished actually writing my second memoir hoped it that it's my last [laughter] but\nGo back to fiction after this or just reporting but it's about taking care of my grandmother at the end of her life and that and how they're used to say I I have to talk to her\nAt some point she said when I mean are these are these real people that's when I knew that they had come to life when I started talking about them to her\nAs rock about say members of your family that come into Israel the whole thing about your character and whether they talk to you can't tell you we used to get a hope he and then of course it happens to be myself never say never\nWhen we bring our cells together with your novels\nWe find the world's you create are filled with a sense of living breathing characters as we just discussed\nBut of social forces and cultural dynamics drawn with subtlety and new once again the sense of reality and it would seem especially important for us today in twenty Eighteen to enter these worlds to experience something that might open our eyes\nI think the answer to that is that I I started writing for time magazine for that reason you know based in fact\nI Love writing novels I Love writing fiction but I I ... sack I Need I Need facts to put in that context what's happening in my individual life and to sort of make that come alive for readers I Am really grateful for what she said about\nThat fiction because I spend\nA a big chunk of my life doing civic engagement project may which are really just kind of my way of learning the delicious luxury\nOf writing fiction so I Know friends I Know writers who write fiction and said this this was sort of what I give to the world and\nThis is helping people understand stuff frankly I I think the greatest most delicious luxury of of freedom of the wealth of being twenty first century America like in sitting in a room by myself without lipstick\nAnd just write about people don't exist\nMy God look at the luxury of that but that much peace and how much wealth you have to have to\nBe able to let people do that so in fact what I I Hope I bring to it is ...\nThat wasn't that much peace and how much wealth you have to have\nBe able to let people do that so in fact what I I Hope I bring to it is the experience of a life writing and reporting and researching and then figure out how to put lives into it in in a way that is\nBeautiful because we need beauty as you can be and I I really do feel like you know the the project to try to get the ten year old voting or being in school board here do doing other stuff like that running arts organization because\nLike my way of of earning it or paying for it in kind I guess\nWe can think of the great Russian writers and do story of skiing is thought the beauty will see the world I don't know about that but it seems like people are hungry for duty not cheap beauty but the real thing\nYes yes and I think we're we're hungry for the real thing which goes right back to your question about story and it goes back to what the story that we\n... the story that we choose\nYou remember when they first started those shows like American Idol and the voicemail and and off and the judges would talk to the young people who got up and saying they talked at length about their choice of song and I remember thinking why why are you bragging on these kids about what songs they choose\nWhat was that the choice of the story the choice of the form\nHas everything to do with the content that you're going to pour into selling a scientist who is a ... mistress of the form the haiku for him says things in a haiku that are just say for the phone\nShe's got one which he wrote when she was in China on behalf of her twin boys who were in the United states and it's something like\nLet me where the day well so it'll be good when it gets to you\nBut it was just that that was a fleeting moment I'm using up part of the day that you're going to get later and let me let me do well with it that idea that that's the right form that's the right content and the to meet to match\nIt would've been ridiculous had she'd taken that idea that that very long\nBut fleeting\nTemporal idea and try to work at work at work it into a sonnet and give it lots of written lots of texture lots of lines\nRight so similarly I think I think that whole idea of of beauty absolutely has to do is merging the ... the form the content which is why I always loved different genres of writing to kind of novels last year I did a um it was amazing residency with the American their theater learning ... libretto\nFor opera because there are some stories that need to be so I'm working very hard to learn how to write a decent clay novelist usually right very bad place\nAt the same time marine have a lovely essay titled growing season in medium about the experience of becoming a nine or herself not for the first time but of her granddaughter and\nThe trip to Vermont and the celebration and the arrival of the deer baby and at the same time the parallel planting of the garden in Vermont\nFor the season and so family and heritage as we heard her speak of the ancestors so important to bring Cary we have a song from a set of pieces of William grant still\nThe pieces are taught him from the hearts of women will hear one of those pieces and then we'll follow that with stills mother and child Manhattan chamber orchestra Margaret ... is the soprano and Richard olden Clark conducts um W. V. I.\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nWe decided that last minute to shift to joy sorrow and Britain's ... oh and they can Daniel was the conductor on WB I say it was a matter of timing on your art and information station\nSupport comes from Kent elite owner of good neighbor walls specializing in design restoration and construction of field stone wall since Nineteen Ninety six he's proud to participate in show his work at the twenty Eighteen artist open house weekend in ... county\nThis was W. V. I. A. idiot on point not enough at W. V. I. H. D. ones granted Wilkes Barre he's holding in Williamsport W BYA eighty nine points out of him in Mansfield WTO eighty eight point three of them out at like while in pop back\nW. P. A. U. Ninety One point five FM streaming live at W. B. I. I. dot org we're in Allentown an audit on point three and in Bethlehem at what a five point seven member supported public radio W. V. I. A.\n[noise]\nOne is for a mixed bag starting at eight following the gubernatorial debate will begin at eight with a collection of blue grass music originally scheduled for yesterday than at eight thirty it's to be sampling of new releases ended nine it's our hand grow music so\nBefore the next time on ask me another we've got comedian Tom Arnold star of the new show the hunt for the ... plus singer songwriter Jill so below performed with their very own Jonathan Gold in music parity game about artists who go by one name so joined me\nOver the euro for NPR's our puzzles where it gains Andrea via [noise]\nSaturday at all that but I Am on W. V. I. A. F. N. [noise]\nProgramming on W. V. I. is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nSupport comes from east Strasburg university where do I go to college east Strasburg university for new wonder grass and transfers can lock in the same tuition for all four years he has you were warriors belong learn more at where warriors belong dot com\nLive from NPR News in Washington I'm Laurie London a number of people have now been interviewed as part of the FBI's reopened background investigation of Supreme Court nominee Brett Kavanaugh and parents camera Keith reports\nSenate majority leader Mitch McConnell plans to move forward with a confirmation vote this week\nFBI investigators have spoken with mark judge the Kavanaugh friend from high school who Christine Blasey Ford said was in the room when she alleges Kavanaugh sexually assaulted her Leyland Kaiser who was friends with Ford in high school\nHas been interviewed as well and Deborah Ramirez who says cabinet exposed himself to her at a drunken party at Yale\nHas also spoken to the FBI\nThat source familiar with the matter told NPR's Ryan Lucas that she gave investigators more than a dozen names of people she says where either I witnesses or who heard about it at the time\n... strenuously denies all these allegations camera Keith NPR News\nSenator Bernie Sanders a longtime critic of Amazon over its pay packets is is praying that company for announcing it will raise wages for hundreds of thousands of workers Amazon announcing today that it will increase the minimum wage for all employees to Fifteen dollars an hour starting November first\nAmazon's senior vice president Dave Clark says he hopes others will follow their lead\nCertainly hope that we're able to influence\nForward with an increase in the federal minimum wage\nWill throw hopeful other large employers to follow up and increase\nCritic of Amazon over its pay practices is praising the company for announcing it will raise wages for hundreds of thousands of workers Amazon announcing today that it will increase the minimum wage for all employees to Fifteen dollars an hour starting November first\nAmazon's senior vice president Dave Clark says he hopes others will follow their lead\nWe certainly hope that we're able to employ\nForward with an increase in the federal minimum wage\nWill throw hopeful other large employers to fall off and increase their minimum wages as well\nThey made the move because they think the national minimum wage of seven twenty five is too low and Clark says this increase will have a significant impact on Amazon employees and their families Amazon is one of NPR's financial supporters\nIn Germany chancellor ongoing Merkel's government says agreed on the details of a proposed new immigration law that's modeled on the Canadian system as may Nicholson reports the law intends to make it easier for skilled workers to get visas while preventing immigration for those who are unskilled\nThe proposed legislation renewed titled the highly qualified ... citizens with\nGerman language skills the bill is a response to Gemini skilled labor shortage and the potential problems it poses to the public pension systems\nCompanies will no don't go to be with clients to give preference to Jim and citizens when recruiting and Gen speaking foreign graduates will be entitled to six months the TSA to look for what if they can prove that they have the financial means to support the job such\nThe government says the noodle aims to regulate economic immigration and has no bearing on his side of the\nCats as may Nicholson reporting on Wall street stocks rally for a second day the Gallup a hundred and twenty three points this is NPR\nAstronomers have discovered a dwarf planet and the furthest reaches of our solar system NPR's Joe Palca reports the new objects seems to confirm the existence of even as yet undiscovered giant planet\nAstronomers from the Carnegie Institution for science first spotted the mini climate nickname goblin twenty Fifteen it's only about two hundred miles across it took three years of observations to determine its orbit and a strange or but it is it's highly elongated and somewhat tilted out of the plane and the rest of the planets and asteroids\nIt's also way way out there at its closest approach the garbled is still six billion miles from the sun and it takes forty thousand years to complete a single orbit\nMany astronomers think the gravitational tug of a giant undiscovered planet is the best explanation for the unusual orbit of the goblins and similar objects that have been found Joe Palca NPR News\nThe Nobel Prize in physics has been awarded to three people for quote groundbreaking invent inventions in the field of laser physics\nHalf of the prize goes to Ninety six year old American Arthur Ashe Ken who invented the optical tweezers a laser that allow physical material to be moved using light the other half of the prize is being awarded jointly\nTo Canadian Donna strict land and France's ... more role\nFor ... whole amplification that's a technique that has allowed researchers to boost the power of lasers I'm Laurie London\nNPR News in Washington\nFor NPR comes from ... am committed to a changing lives through math by building map achievement problem solving and critical thinking skills for thousands of students every day\nIt's being awarded jointly to Canadian Donna strict land and France's ... more role\nFor sharp whole amplification that's a technique that has allowed researchers to boost the power of lasers I'm Laurie London NPR News in Washington\nSupport for NPR comes from ... am committed to a changing lives ... by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations ... dot com slash NPR\n[noise]\nTonight at seven PM WB I a famine TV will will cast a debate between the nominees for Pennsylvania\nGovernor incumbent Democrat Tom Wolfe challenger Republican Scott Wagner\nThe moderator this debate will be Alex drawbacks the longtime host of a TV quiz show jeopardy too and you were the only gubernatorial debate before election day on WB on a\nNight of seven PM\n[laughter] it's October and live from here with great feeling is that even hardly strictly bluegrass\nIn San Francisco this weekend [noise] you know the one with the Golden Gate bridge tune in for that so gas and Lindsay Buckingham and rape and the ...\n... years will be there with our new music director Mike Elizondo and our new team with are now in America correspondent Tom Papa don't midnight\nSaturday Night in London today on all the V. A. F.\nThanks Larry and Larry's would go will be in a zero host right after the NPR News headlines at one o'clock he'll have chamber music and more till four that's when we were doing all things considered NPR's award winning news magazine\nThere will be rain with a chance to undo storms this afternoon and some of the thunderstorms and they produce heavy rain fool and gusty winds highest in the low seventies today trying to bring Ninety percent\nIt will be mostly cloudy tonight with a chance who's going to storms and rain this evening and some of his under storms may produce some gusty winds and\nHeavy rain and maybe some showers a later on with some ... developing after midnight lows overnight in the upper sixties and trying to re Ninety percent but it will be mostly sunny on Wednesday with high in the upper sixties\nSupport comes from the artist so open house weekend I'm supposed to be ... county twenty four artist exhibiting a variety of unique or treasures of twenty locations studios are open ten AM to six PM October ... through the eight five seven oh two Seventy two or three three to four artist tour dot com\nMusic of ... to get the afternoon underway this is a sweet from ... do the golden cocker ... it's a performance here we named me all the leading the orchestra on W. V. I. A.\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nMm\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\nMm [noise]\n\n\n[noise]\n[noise]\n\nMhm\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\nMm\n[noise] Mm [noise]\nMm [noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\nMm\n\n\n\n[noise]\n\nMm\n\n[noise]\n\n\n[noise]\n[noise]\n", "year": "2018", "show_name": "Classical Music with Erika Funke", "city": "Williamsport", "day": "02"}