{"month": "10", "state": "PA", "station": "WVYA", "content": "As wonderful actually I'm just I just looked down at the grocery store in the bottom left hand corner those numbers ten\nKelly Finn and and she was my student for many years and schools and at arts alive and now she is on the tour herself would cut illustrations choose a very talented girl she's won ... wonderful so really happy that she's on the tour of this year\nThe thought introduced us to Linda and then we'll take a tour of the other eyes you know Linda and her work very well\nWell I Do and it's been interesting Erica through the years especially when someone was unfamiliar with lenses work and I would explain to them and I would say she's really very very good Linda is extremely humble she does not like\nShe doesn't like the praise\nBut when I Would tell someone she was really talented they would kind of look at me and say well yeah your husband but then when they saw her items her work they would say boy you weren't kitten\nAnd it's kinda it's always made me chuckle a little bit but she just retired three years ago she was a special ed teacher for thirty six years\nAnd she did artwork that maybe it will take some down into the studio that she did when she was a teenager and it's phenomenal it's it's a natural gift her her high school art teacher she said was her greatest influence\nAnd that's really the only formal training she's had well\nYou know are all mentioned on that that shows the importance of what we give it to others\nWith teaching them and showing them and ... at leading them by example but hurt her stuff is it's it's ... it's water color in pastel she likes to do big pieces which makes it harder to Matt and framed but you need to come and see your stuff\nWhat would we see image why they're typically the birds is huge that birds she has done I I don't know hundreds if not thousands of birds\nAre just installed one of her paintings that the gathering place the other day and it's so of three tiny birds in a nest but the painting is like three by three ... approximately really nice beautiful painting actually what it is is across the\nRoad from our house there used to be draft horses and they hung up all of attack\nAnd Robin build its Nast in the ... we ... we take thousands of pictures reference pictures thousands not so nice now with digital\nAnd then she uses all these pictures for reference spot it's typically nature uh an application of nature we just we both loved nature\nYou've done a great job with Linda now do the honors for some of your comics\nWell speaking of a landscape and the love for it and the different ah rendition of making landscapes take the ... they have a very interesting eyes as photographers and come up with a look into the two pieces in the short and they're both stunning\nThey have a very interesting eyes as photographers and come up with a look into the two pieces in the short and they're both stunning very interesting takes on nature and Eric vents hassle a he's a photographer as well and he comes up with some fantastic images also\nAnd we have Maureen vanostran a landscape paint or as well all she does a lot of things including the wine and cheese festival imagery is usually comes up with something for that too\nBut I've been interested to observe her process over the years change and expand and then Betty broad and of course\nThose a lot of collages and um her take on nature is very very unique and her delightful husband Tom he he doesn't do landscapes that he's he's making some really fantastic carvings and would block prints this year\nWe really don't want to leave anybody out but it's hard to to cover everyone\nThe images on the brochure are pretty accurate rendition of what people are doing and you could go to everybody's studio if you have three days probably or you can pick and choose and go to the ones that strike your fancy at the moment\nI always intrigued by the fact that can easily works in this beautiful stone that comes from the county and you can actually watch him in his art of making stone walls\nYes that's a something that's\nFairly new to the door but if you look around the county and look at days gone by and see all the old stone walls that are kind of crumbling and going back to nature\nIt's a it's a nice application that that can has got\nInto to try and rebuild and to preserve what has been here for a long long time and thank goodness\nFor a while there a lot of the walls and ... county were disappearing because farmers didn't have that much money and people were going around and offering money to buy the walls so I remember myself watching the walls disappear one stretch of the time and it was very painful to me I Would never sell a stone\nAnd the cat is known for it still in the blue stone right right for sure and of course ceramic artist and so much more\nAnd you have always done and artistic rendering that is the brochure that we've been referring to and there is hard copy and you're on the line as well there's a wonderful map on one side we can say oh I'd like to go to this one this one this will all of them and then you can flip over and make an itinerary for yourself right\nYes through effect I think this brochure is that the workings of Betty and Linda yes yeah the ... them those to do a great job every single year the brochures always wonderful and also this year again we tried it last year a Eric van hassle and his wife came up with this idea for a game\nSo we all have stamps now and all of our studios have numbers and right on the brochure this year people can come around and have a chance at winning a two hundred and\nFifty dollar gift certificate or a hundred dollar or fifty at the end of the tour and um it's a good impetus for tourists to perhaps acquire work of art that I don't quite have enough money for that they can take that money back\nTo a studio of their choice and apply it towards a peace day would like we think it's a great idea how about the particulars\nNow again remind people of the dates and it's free right\nYes yes free for the taking or the the looking or driving [noise] anyway it's October sixth seventh and eighth from ten o'clock in the morning until six in the evening Saturday Sunday and Monday right everybody will be warmly anticipating or level at our studios\nEight from Penn o'clock in the morning at six in the evening Saturday Sunday and Monday right everybody will be warmly anticipating you're liable at our students and typically Erica most most have so many freshmen typically a lot of different homemade\nCookies pastries coffee or something else to drink [noise] we certainly appreciate your your help with this annual event\nAnd we appreciate everything that you do in this radio station thank you so it is it's a wonderful wonderful plus for for the area and for the country [noise] and\nSo is this to\nArtists well the Truman and relieving speaking with us about the twenty second annual artists open house weekend in South Carolina county this weekend Columbus Day weekend Saturday Sunday and Monday I took her six seven and eight from ten AM to six pm each day\nThere is no admission fee\nFor more information on the Web artists to wars dot com\nThat's artists to dot com\nFor the twenty second annual artist open house weekend in Sacramento County over Columbus Day weekend Saturday Sunday and Monday October sixth seventh and eighth\nFrom ten AM to fix each day no admissions the on line artist Stewart dot com artist to dot com [noise]\nHe would tend to art scene on that but you see I ain't we have music out whether she'll mine now as I said I Know it was eighty two forest scenes including movements titled entry\nHunter on the lookout ... flowers friendly landscape shelter bird as profit hunting song farewell\nBeyond me to cope with she performs now on W. V. I.\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n\n[noise] [noise] [noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] Mm\n\n[laughter] [noise]\n[laughter] [noise]\n[noise]\n[noise] [laughter] [noise] [laughter] [noise]\n[laughter]\n\n\n[laughter]\n[noise]\n[laughter]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[laughter]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\nUm [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] ...\nThing\nIn in ...\n[laughter]\n\n\n\n\nIn the\nSame thing\n[noise]\n\n\n[noise]\n\n\n[noise]\nThis was W. V. I. eighty nine point nine F. M. W. V. I. H. D. ones granted Wilkes Barre ... and we're in Williamsport in ... eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were like well I'm hot packet W. P. A. U. Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator in Clark summit at Ninety point three of them you're arts any information station listener supported public radio W. V. I. S.\n[noise]\nThis evening at seven on WB I have all that jazz will be featuring an hour or contemporary jazz vocal\nThan mixed bag start today with the day sampling of new releases at eight thirty is the set of recent retro soul recordings ended nine it's our weekly Alvin review this time Madeleine Peru and her new album called and\nThis is George Graham joined us tonight starting at seven and WBAI [noise]\nHuman beings I made up of just four letters a C. G. T. it's the same for letters that every species in the playoffs has billions of letters of code if you had every page filled with ... g's and T's you'd have eight hundred dictionaries worth of genetic code\nAnd that code decides who we are a guy rise that story next time on the head radio hour from NPR\nSaturday afternoon or W. V. on a FM\nSupport for NPR come from Pennsylvania was October SPA why month celebrating Pennsylvania's locally grown and crafted wind with special things to do taste and discover all across the state more information can be found P. A. Y. months dot com\nSupport for WBAI comes from ... dental headquartered pitched in Pennsylvania\nA full service dental distributor with strong local roots and national reach Ben co dental deliver success smile after smile more information at ... dot com or one eight hundred go back go\nFly from NPR News in Washington I'm Patrick Johnston President Trump is taking could social media to push back against a scathing report published in the New York times NPR's Scott Horsley says the article reports that Trump and his family you dubious game to evade taxes on hundreds of millions of dollars in inherited wealth\nThe New York times fourteen thousand words story was the product of more than a year of investigation it shows that despite his claim to be a self made billionaire President Trump was the beneficiary of a vast inherited fortune much of which was shielded from taxes through a variety of questionable schemes\nNew York taxing authorities say they're reviewing the articles findings\nIn his tweet the president does not dispute any of the facts and the article but describes it as quote a very old boring and often told hippies Trump complains the vast majority of the newspapers coverage of his administration has been negative echoing the charge leveled by the White House press secretary Scott Horsley NPR News Washington\nIt's still unclear whether that Senate although it is the way to confirm Supreme Court nominee Brett Kavanaugh has been delayed pending the results of an ongoing FBI investigation into allegations of sexual misconduct against Kavanaugh who can night the claims the agency is expected to release its findings by the end of the week\nThis year's Nobel Prize in chemistry has been awarded to Americans and a researcher in the United kingdom NPR's Nell Greenfieldboyce reports they won for using evolution to design new enzymes and medicines\nIt's still unclear whether that Senate will vote this way to confirm Supreme Court nominee Brett Kavanaugh the vote has been delayed pending the results of an ongoing FBI investigation into allegations of sexual misconduct against Kavanaugh who denied the claims the agency is expected to release its findings by the end of the week\nThis year's Nobel Prize in chemistry has been awarded to to Americans and a researcher and the United kingdom NPR's Nell Greenfieldboyce reports they won for using evolution to design new enzymes and medicines\nFrancis Arnold works at Cal Tech but early this morning she was in a hotel room in Dallas texas sound asleep\nAnd the phone rang and I ... I thought it was one of my sons with a\nProblem nope it was the royals Swedish Academy of Sciences she'd been awarded half of the Nobel Prize in chemistry for pioneering the idea of using random changes to produce all kinds of new chemicals are enzymes so researchers can pick the best one for you and say an industrial process or a pharmaceutical\nShe shares the award with George Smith of the University of Missouri in Colombia and Gregory Winter at the ... the laboratory of molecular biology in the United kingdom Nell Greenfieldboyce NPR News\nIslamic state is claiming responsibility for suicide bombing that targeted an election rally in Afghanistan NPR's ... date reports the attack killed at least Thirteen people and wounded more than two dozen\nIt was the first attack on an election rally since campaigning kicked off last week for parliamentary elections there widespread fear that this sort of violence could derail the process they seen as a dry run for the more important presidential elections next year and the tests that the government's ability to provide\nSecurity NPR's ... date reporting from Islamabad on Wall street the Dallas up one hundred forty eight points and that stuck up thirty eight this is NPR News\nDoesn't bumpy and government has launched an oral vaccine campaign to contain a cholera outbreak the outbreak is centered in the capital Harare were issued a sequel reports\nHundreds of people received the ... of ... to ... within six months of ... to one against ... ... ... to build an aids\nClaimed more than four thousand lives to to do in water systems are blamed for both old breaks the new government won't unions a timber just days after the lead to ... begin\nSees it was to ensure nobody dies of color a game ... minutes to open the more you\nReverse started in ... and ...\nThe United nations is funding divert the nation's for NPR News I'm ...\nFirst lady Melania Trump is continuing her multi nation African tour she visited a former slave holding facility on the coast of gun at today\nTo Salt Lake city\n\nMrs Trump will also visit Kenya Malawi in Egypt with a focus on promoting health and education she's also set to promote her the best initiative which aims to tackle issues such as cyber bullying and boost healthy living she tweeted the campaign what's going international\nOn Wall street the Dallas up one hundred forty eight points this is NPR News\nSupport for NPR comes from NPR stations other contributors include ISI MC foundation working to improve postsecondary educational outcomes\nTrump will also visit Kenya Malawi in Egypt with a focus on promoting health and education she's also set to promote her be best initiative which aims to tackle issues such as cyber bullying and boost healthy living she tweeted the campaign what's going\nInternational on Wall street down with a one hundred forty eight points this is NPR News\nSupport for NPR comes from the NPR stations other contributors include ISI MC foundation working to improve postsecondary educational outcomes for underserved students the evidence based innovation learn more at ease the empty foundation dot org\nIt's October and live from here with her family is kicking off that's even hardly strictly bluegrass\nIn San Francisco this weekend [noise] you know the one with the Golden Gate bridge\nTune in for a special guest with Lindsay Buckingham answer rate for the riff raff\nPoll radio players will be there with our new music director Mike Elizondo and our news team with our allies in America correspondent Tom Papa don't midnight Saturday Sunday night at eight on WB I Am\nIt will be mostly sunny today with high in the upper sixties some clouds tonight actually fall developing after midnight lose in the low fifties partly sunny tomorrow to get things underway on Thursday becoming mostly cloudy through the day with likely showers showers likely\nHad a chance of thunderstorms in the afternoon and some of those under storms may produce the heavy rainfall\nHighest tomorrow in the low seventies wins out of the south west gusting up to twenty miles per hour and try to rein Seventy percent\nSupport comes from ... owner of good neighbor walls specializing in design restoration and construction of field stone wall since Nineteen Ninety six he's proud to participate in show his work at the twenty Eighteen artist open house weekend in ... county\nWe have music by a violin virtuoso now we heard a cellist at the end of the hour who created music composed music well this is the case with this violinist Francesco money of energy needs\nA concerto windy major for violin and orchestra I'll bet they'll martini is the violinist with\nA ... ... ... um W. V. I.\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\nMusic by from she's going to be very Jeannie we heard that the month teeny as the violinist with and director of the academia you lower Modi gee I'm W meat I a\nSupport comes from the artist open house weekend in ... county twenty four artist examining a variety of unique our treasures of twenty location studios are open ten AM to six PM October ... through the eight five seven oh two Seventy two or three three two were artists to or dot com\nSavor the sounds of recent Oregon projects from the shops are normally Dobson Reuters parking churches a concert halls at home and abroad with children was Jonathan Brian\n... Peterson dean bill Myron Patrick Scott find out what's news this week on pipe dream from American public media Michael Barone I Hope you'll be listening [noise]\nSunday Morning six on WB I\nOwe sonata by Domenico Scott ... D for keyboard transcribed for two guitars and performed by the Assads on your arts and the information station\n\n\n[noise]\n[noise]\n[noise]\nBut they don't\n\nWhat [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\nMaking a special trip PM booking other shows around that they've been on the post office but the\nReason they're coming again\nIf you'd like will music this will appeal to you sounds like if you like spoke this will appeal to you if you like Tom ... she likes Spanish\nMusic maybe yeah ... yes all of that again covers a huge and age range of people and not of the day November the ... pm I Know you've had tremendous success\nWith big bond era music again people of all ages loved that\nThere's something about it is and I definitely agree and every time we've\nBig band count safety\nAnd Glenn Miller we get tons and tons of people coming to buy tickets and and just loving the show\nThat time we decided to take it a step further because his show is not just being banned it's an actual musical review it's a two hour long\nShow maybe even over two hours there's gonna be a third team peace [noise]\nBig band string of pearls orchestra\nFive or six swing dancers and singers all doing costume changes and choreography though it's a whole review spectacular musical\nYear touring successfully\nSo this is a big things it'll be jazzy rap the romantic this down ticket will just be a great experience and veterans will love it because there's a part of that sort of special for them\nPeople come out they actually have to turn people away a lot of the venue for tickets there's a Broadway world says quote seeing in the mood isn't an option and it's a month just a really really\nTough lifting spirit moving show that I think it'd be hard\nFor anyone not to enjoy if people are listening and they\nShould they for why not I mean it's all part of the fun and I'm going to have the like how many houses jazz ensemble which is really a good big band group and another cell that I'm there'll be playing before the show\nOn this show is called in the mood and it really isn't an immersive experience do you see all over [laughter] well congratulations on an amazing season then may only be three come to their own free concert [noise] everybody's going to want to see people want to get season to what should\nThey do season tickets are definitely a saving for season ticket you have to go to the box office or call the box office\nSeven three to six two for two for that season tickets for single tickets you can go on line and pick your own seats and purchase them at any time where a great group of ... people and we could use some more young blood on our board we just got one new board member it's a fun thing\nThree comes to but they require [noise] everybody's going to want to see people want to get season to what should they do season tickets\nAre definitely a saving for season ticket you have to go to the box office or call the box office [noise]\nFive seven three to six two for two for that season tickets for single tickets you can go online and pick your own seats and purchase them at any time\nWhere I great group of ... people and we could use some more young blood on our board we just got one new board member it's a fun thing it's fun to bring GOOD Music and it's fun for\nAll of us to get the exposure new generations of people\nAnd to work this all out this is all volunteer and so it's a lot of work behind the scenes so if you're interested\nYou can go on our website Williamsport community concerts with an ad\nDot org click on contact us and you can let us know where you can call five seven oh five oh five to four eight five that's our phone number we'd be happy to hear from you\nSince ... president of the Williamsport community concert association speaking about a new season\nFor the Williamsport community constitute association\nWhich begins on Wednesday October the son with the eagles tribute band the seven bridges the phone and we'll begin at ... pm in the capital lounge with a separate beer tasting event which will end at seven twenty five in time for the seven thirty concept [noise]\nFor more information on the season on how to obtain season tickets to Williamsport community conflict association website\nWilliam for New Year's eve concert [noise]\nWhat do you get to any of the conflict [noise]\nCommunity ... censor books off the five seven zero\nThree\nTickets can be obtained on line\nAt the AC lives dot com\nThank you very much to Cynthia same involved [noise]\nThanks to you W. V. I. a feeling of power\nAs we heard it's the ultimate eagles experience seven bridges band and that this evening at seven thirty a committee ... to ... west ... street in Williamsport [noise]\nIn San Diego on Thursday November eighth and you may have heard a concert here live on WB I Am in San Diego visiting the region a few years ago and they actually came in and the noon hour\nAnd we hosted them with an audience of WB I listeners and their energy and enthusiasm and their talents were\nUh on on great display we were very excited to host in San Diego and you can hear them Thursday November aids\nAs part of the Williamsport community concert association season and then the season will conclude with in the mood the Nineteen forties musical review on Thursday march twenty eight twenty nine teen\nFor more information on line Williamsport community concerts dot org I don't know whether you remember when the Glenn Miller orchestra uh did what we would know as the end will chorus it sounded like this [noise]\nAs part of the Williamsport community concert association season and then the season will conclude with in the mood the Nineteen forties musical review on Thursday march twenty eight twenty Nineteen\nFor more information on line Williamsport community concerts dart board I don't know whether you remember when the Glenn Miller orchestra uh did what we would know as the Advil chorus it sounded like this [noise]\n\nIn the mood to Nineteen forties musical reviews Thursday march twenty eight twenty nine teams bringing them to a close the Williamsport community concert association twenty Eighteen twenty Nineteen season for information on all the performances Williamsport community concerts dot org\nWe're about to hear the ambulance corps in a four ... we're ... we're used to hearing on WB I at this time of day [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise] mhm\n\n[noise]", "year": "2018", "show_name": "Classical Music with Erika Funke", "city": "Williamsport", "day": "03"}