{"month": "10", "state": "PA", "station": "WVYA", "content": "But then you'll make changes that's not like the first state has become worthless is just so it was an earlier stage and so that could have two three four five states recalls states in this show at the main street gallery\nTheir frame prints they're about forty one I think there are a prince drawings and collage\nAnd there are a lot of on framed things and this show it's called Iraq perspective of works on paper that runs through October and the first week of November even after the show ends\nThat will still be some of the the work so that will be retained there and certainly the works on frame will be certainly retain by the mainstream gallery\nAnd how this collage figure in\nI have five of them and they show these are some things that I did in New York back in the sixties they were selling reproductions of old master perhaps right on the sidewalk or something\nThat might be you know rent and law a Picasso Rembrandt and they were there was telling you know they were fairly large\nAnd in color and so I Would maybe by three\nAnd they were there was telling you know they were fairly large\nAnd in color and so I Would maybe by three of that same say like the the Gilbert Stuart George Washington I got four press then a collage slim I cut them up and assembled them\nWith scotch tape on the back and then eventually I had them stand out when I came out here I have them stand by Bob Lisa in punk panic and so they're on archival paper and they are the two of them that are read when I called her brand while revisited\nAnd too because it shows and then one called forward Georgia's where the four Gilbert Stuart pieces a collage digital prints what about the papers themselves then I use a very good paper are usually it's either arches or polish as they would say in French\nOr Reeves RFK Reeves and these are papers that a hundred years from now should look good whereas newspaper after a few weeks after a month it's already beginning to get yellow because of the wood pulp and in that cheap type a paper\nSo this is a very good French travel Italian paper which I Hope will be around for a long long time\nIt's like to explore an image that you've done as a drawing say you come across something that you did earlier in New York yeah and you'd like to explore it some or what is it that determines your choices of medium when you're trying to interpret it in that she likes that\nMost recently I've been doing a series of none of these er an end the show because they have things that I've been doing in the last month but I call them top of graphical fantasies\nAnd they're they're working with geometry I'm with impossible three dimensional situations like this the surface of the star wars crevices on it or a thing where the line where everything is is done in line and you can get a very three dimensional\nSense of of line just by a by the way you employ yet\nBut frequently in the past if I was walking from some subject was local like a break or I Would take up I Would photograph it and then I Would use that photographic as the basis but I Would do a lot of editing of of the photograph I'm not trying to make the print looked like a like a photograph I wanted to look like an action\nBut the photography is something that frequently is the first stage\nBecause sometimes you you see something and it's not you can't set up and sit there and draw your you're in a situation where it's just impossible to do\nWhereas with your digital camera you can do it\nIt sounds like you are interested in exploring forum and her all across the Sean is right yeah whether it be sculptural or the drawing or the top of graphical ... just explored\nI guess so I guess form has been a a a more important aspect of my work than say color but of course the form the thing that that I like about two dimensional work is is basically that illusion that she can get a ... of space with prospective or with with sides differences and everything\nAnd that's of course it's been around for thousands of years but it's still something that I find a very interesting and and something that I like to achieve\nDid you use drawings and a lot to prepare your sculptural where\nI Would do frequently would start with a drawing you can't really improvised too much risk if you're working with pieces of metal you order up a piece of UBS square to being from blooms ... metal\nAnd you just can't decide oh I don't I don't think I Want this so you have to sort of knowing if a ... at the expense of the material is is a big consideration so you're sort of have to know in advance what you're going to do with it\nTo know in advance what you're going to do with it it's not like you could throw it away\nWhat is your studio situation now that you are working primarily this way have you scaled back in terms of what\nI've done is I I sold all of the sculpture equipment\nThe tick welder the other equipment that I needed a sander and various things and a lot of a welding tools and things of that sort and then I bought a very good press\nConway it's ... it's Conway it's a it's a press made in white hall Michigan which is on the eastern shore of Michigan\nAnd they are the sand dunes apparently along the lake that are moving towards the east\nBut this is it's a ... in my front or is the maximum with an object that would be twenty four inches when I began when I was doing ... relief France and New York\nAnd I didn't have any idea to have a I was living in a a walk up on the fourth floor I didn't have any press or anything I use the wooden spoon I've made a rubbing basically I put the the print down I put the play down that was and kind of put a piece of\nRice paper on it and rubbed it it's called the robbing and I have all of those low your block say print beautifully even though I did I was working with him in the sixties it's ancient history\nSo I got beautiful prince from the same things which are which I made originally with a wooden spoon [laughter] but anyway I've sort of still have some fairly large structures in my studio or out of course I have a lot of work in my house that Raj on even rented space\nBut the studio nowadays is all for print\nMaking when an artist has a shows it's titled retrospective I would imagine it must be an eye opener some times you're pulling work together to make part of the shows like that or did you have any insights this\nGiant anyway and in a sense when I was thinking of the frame pieces that I wanted to put in I was looking looking at some at some drawings that I'd done back in in the late fifties early for shots completely forgotten about\nAnd it was only one I uncovered them under a lot of lot of the quite a lot of these are all these pieces and they show up never been exhibited before\nAnd when you saw and rediscovered those pieces you recognize and respect the exploration that you were engaged in at that time and say well that was an interesting time for me\nI don't know it's it's sort of brings back the past but I did some drawings in a in a bar on second I was living in the East Village and I did a one day I stopped in this it was she cranium ball or there was so used to be in the neighborhood used to be their Slavic it's no longer that way but\nI did some drawings in a bar on Second Avenue and then I made a ... they're all in line and it really brings back a period you know of the years that I Lived in New York and then coming out of here and everything\nWhen you were little and in grade school where you draw\nI didn't do that much I took piano for years\nBut I I uh I wasn't really serious about music as a career then I began reading a lot\nThere was a period when I thought maybe I should you should do something was writing but when I was in the navy I was stationed in Boston and all on an aircraft carrier there was being decommissioned did it come around from California to the Panama Canal up to Boston and I was you know on the whole trip and everything\nAnd I started going to museums in Boston and then later when they said\nI was in on the whole trip and everything and I started going to museums in Boston and then later when they sent me to do a destroyer escort and the and the Brooklyn maybe yard\nUm then it was one I started making drawing especially of a harbinger of New York and none of these are on the show but that was sort of the beginning so it really brings Barker of when I look at these things it's almost like a ...\n\n\nArtist herb Simon who is retired from the art faculty at Wilkes University in Wilkes Barre speaking with us about his drawings friends and collage pieces featured in the current exhibition titled\nA retrospective of works on paper at the main street galleries three Seventy pure street in Kingston just across the river from Wilkes Barre\nThe show we'll runs through Wednesday November seventh\nFor more information on the Web main street gee dot com main street gee dot com [noise] that an exhibition titled a retrospective of works on paper featuring the work of artist herb Simon\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\nMm [noise]\nThe audio eighty eight point three of them aren't at like ... W. P. A. U. Ninety One point five FM streaming live a W. V. I. dot org we're in Allentown and not eat on point three and in Bethlehem at what a five point seven member supported public radio W. V. I. S. T.\n\nV. I asked him and NPR or like nothing else balanced fact based journalism and intelligent enjoyable entertainment and it's all made possible\nBy listeners like you your contribution pays for programs like MORNING EDITION\nAll things considered and the Ted radio hour community outreach like kids in the classroom and the great American read nothing comes close to a public radio for double the IRA with a generous given the W. V. ... for the call one eight seven seven seven hundred nine eight for two\nAnd next time I asked me another Emmy Award winning actor Michael C hauled tells us how he got into character for his role as a serial killer on the television series Dexter I um I killed ...\nPeople no I didn't I didn't tell anybody joined me off your iceberg for NPR's our puzzle word games and trivia [noise]\nSaturday at eleven I Am on W. V. I. A. F. out\nSupport for comes from the Lackawanna county library system present in ... and why it goes surprised when the author of the underground railroad Thursday November fifty seven PM at this current and cultural center open to the public tickets available at any Lackawanna county library or online at L. C. L. S. home dot org programming\nOn WB I is made possible by our members we thank you for your support numbers and by indeed there is more business hiring information at ... dot com slash higher because W. V. A. F. them\nLive from NPR News in Washington I'm Lakshmi Singh\nIt's now sprint to them in terms and as NPR's Tamara Keith tells US President Trump will be attending a series of rallies on behalf of Republican candidates\nIncluding near Fort Myers Florida Today with less than a week to election day President Trump has eleven campaign stops on a schedule all aimed at boosting Republicans and competitive Senate and governor's races take Florida a state Trump will visit twice this week\nThere are hotly contested house races but he isn't going to those districts instead focusing on heavily Republican areas where a boost in turnout would help the Republicans running statewide\nTrump will also be making to stop the each in Missouri and Indiana states he won in twenty sixteen both have Democratic senators in tough reelection fights camera Keith NPR News\nEchoing Trump's politics on immigration Austria's right wing government says it will not sign onto a new United Nations packed on immigration carry scarring has that story\nFor global ... migration safe and older we had help those countries dealing with large influx of refugees but Austrians anti immigration coalition claims at my blur the line between legal and illegal immigration and impacts over into opposition parties described the decision was a low point about wherever you're recovering to be president\nCarries guy ring reporting aid groups are welcoming us call for a ceasefire in Yemen where officials have been warning as a manmade famine the west has been backing one side and the complicated civil war Saudi led coalition that is fighting Iranian backed rebels as NPR's Michele ... report\nOf state Mike Pompeo would call for a cease fire was carefully worded calling on the Iranian back to the rebels in Yemen just dump launching strikes into Saudi Arabia and the United Arab Emirates\nSubsequently he adds coalition airstrikes much seats in a populated areas in Yemen us lawmakers have been urging the Trump Administration gets dumped providing\nThe coalition airstrikes much seats in populated areas in Yemen us lawmakers have been urging the Trump Administration gets dumped providing logistical support for the Saudi led coalition because of the height civilian death toll in the air campaign\nBump a oh what's going on all scientists aboard un mediated talks Sweden's lord ministers did her country could hope that you're meeting Michele ... NPR News the state department\nSaudi journalist your mouth ... G reportedly with strangled as soon as he entered the Saudi conflict and assemble on October second\nThe statement today by prosecutors ... is the first public confirmation by Turkish official about the nature of how could show she was killed\nThe prosecutor says ... killing and dismembered met were premeditated by Danny issued a statement as Saudi Arabia is chief prosecutor soda ... ended his three day visit to assemble the talks reportedly did not result in anything concrete and there's still no word on where could show Gees remains\nAre from Washington this is NPR News\n\nLawmakers in Canada and the u._k. want to hear from Facebook CEO Mark Zuckerberg on what's been done so far to combat the spread of misinformation and protect users' accounts from being compromised again parliamentary committees in both countries are urging him to testify before what they call\nAn international grand committee involving British and Canadian members of parliament\nThe joint session is scheduled November twenty seventh\nThe Census Bureau estimates more than forty million children will be trick or treating across the U.S tonight on this Halloween NPR's hunting all along has more\nThe Census Bureau is defining trick or treating youngsters as those between the ages of five and fourteen so sure you can be lovers in your late teens are still young at heart\nThe kids do have a lot of ground to cover around the country based on the latest population estimates there are one hundred twenty million homes that maybe handing out Halloween treats likely include chocolate produced by around forty thousand people who work in cocoa factories and other facilities in the U.S\nNot to mention the other types of candy so by more than three thousand confectionery and nuts stores\nAccording to an Associated Press analysis of census numbers the state with the largest share of trick or treaters about one in six residents news Utah ... along NPR News New York\nHiring appears to remain strong at U.S companies the payroll processor ATP released the results of a private survey that found employers added two hundred twenty seven thousand jobs this month that would make October's job showing the strongest an eight months retail and manufacturing were among the sectors that showed robust employment growth\nIn October [noise] this is NPR any\nSupport for NPR comes from the financial services firm of Raymond James offering personal lives wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first learned more ed Raymond James dot com\n... daily hopes of live from Georgia Public radio variety show joined us as we get from them show winery in Washington state with my guest Ben full you know\nI've spent some time when [noise]\nSaturday Night at six Sunday night at eight on W. V. I. A. F. [noise]\n\nProgramming on WB all young is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology with one hundred plus\nWhat's your technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degree it's an exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that\nWork good afternoon it will be partly sunny today highest in the low sixties wins this sounds gusting up to twenty miles per hour\nMostly cloudy overnight with a fifty percent chance of showers ... in the fifties and brain likely tomorrow high in the mid fifties chance of rain Seventy percent\nGood afternoon I'm Erika funky we have lots of classical music and it is Halloween so you'll be hearing some spirited sounds learning what go has lots in store following the NPR News headlines at one o'clock he'll take us through till four and that's when we'll joined NPR for all things considered\nThat some of the blessing spirits now look with the Philadelphia Orchestra under the direction of Eugene ... [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nMm\n\n[noise]\n\nReserve W. V. I. I. dot org or call one eight seven seven seven hundred Ninety four to\n[noise]\n\nNine of his novels ... opens with this exchange this has given us a lot of ideas for hours said a smiling Ronald Reagan to an an smiling Roseland Carter as the incumbent president concluded a quick tour of his predecessors new library\nReagan to un un smiling Roseland Carter as the incumbent president concluded a quick tour of his predecessors new library yes agreed not see who is thinking ideas for what not to do\nAll these catch displaced the peanut brigade banner from Seventy six the kid's letters please stop people from killing the whales and worse Carter's replies to them signed Jimmy good said Roseland without adding any words or warm\nThe two presidential couples filed out into the sunshine toward the speakers platform as the fortunate fears an army band played hail to the chief [noise]\nNancy looked over the forest circular pavilions that had just been constructed on this hillside and thought they look like a monotonous world's fair still as much as she tried it was hard for her to dislike the Carter's themselves no matter how perdition pickle pushed the two of them might be\nThere was no getting away from how much they had done for her and Ronnie\nFirst by defeating the forward to she had no trouble at all disliking\nAnd then once in the White House by screwing up so badly they seem to have spent their whole four years rolling out a red carpet for the Reagan's someone on my ... used to refer to the thirty not president of the mastermind\nInsisting that Jimmy Carter was the greatest Republican strategist of all times [noise]\nThose words from the novel feeding on like a novel of the rage of Reagan years by Thomas melon\nIssued by penguin Random House\nYes the situation and concerns presidential business presidential libraries and all that\nBut it's a scene that says so much about Nancy Reagan and roses and Carter to and by extension Ronnie and Jimmy Jimmy it's that combination of the public and personal that characterizes the work of award winning writer Thomas melon [noise]\nThomas melon is a novelist and essayist and teacher who has written ten books of fiction including the forthcoming landfall a novel on the George W. Bush administration from two thousand one through two thousand nine\nIs ten bucks it's fiction include Watergate a finalist for the pen Faulkner award and he has also written volumes of non fiction about plagiarism diaries letters\nAnd the Kennedy assassination his work also appears in the New Yorker the New York Times Book review and other publications he received his doctorate in English and American literature from Harvard University\nAnd he talked for a number of years at Vassar College is owners include Guggenheim Ann Rockefeller fellowships the national book critics circle citation for reviewing\nThe Herald Deaver cell\nMemorial lord of the American Academy of arts and letters for distinguished pros style [noise] a professor of narratives of English at George Washington university Dr ... has been literary editor of the gentleman's quarterly\nAnd deputy chairperson of the national endowment for the humanities in sweaty twelve he was elected to the American Academy of arts and sciences\nUniversity honors program under soy to fund for humanities at ms record e a University in Dallas, Pennsylvania\nOf arts and sciences\nUniversity honors program and the ... fund for humanity's ms recording a University in Dallas, Pennsylvania will sponsor an event titled novelists Washington Thomas mowing on politics and the novel tomorrow evening at seven o'clock in the Catherine Evans ma gallon room\nOn the ... library for more information\nOn line misery accordion dot E. D. U. misery record he uh dot E. D. U. [noise]\nWe had a chance to speak by phone with Thomas ... about his work and about his writing um historical fiction\n[noise]\n\n\n\nBooks I've written about politics I mean their historical fiction this new one is scarcely historical fiction because it's only about a dozen years ago but you know I said books in the fifties upset\nDuring the Nixon years the Reagan years\nAnd these were times that we're well past or by the time I was writing about them and I've even gone way further back to the Eighteenth seventies and the civil war\nAnd historical fiction when it involves politics either I think a number of different kinds of it one person who did as much to make political historical fiction prominent in our time was Gore Vidal's\nAnd Gore Vidal's novels like Burr Lincoln Eighteen Seventy six\nUh they reached a very wide popular audience and they were very entertaining but gorgeous books and I I call them ... because I knew him a bit I was wondering if editors when I work at GQ his books were I think somewhat different from what I'm trying to do in that Gore was a highly politicized person\nAnd he is books all had a sort of these is that the United states was a kind of way word blundering empire that we were a republic that had lost our way by becoming\nA kind of imperial force in the larger world which was not what the founders and their immediate\nDescendants wanted for the United states I Would not say that my books work any particular political thesis I'm interested in the comedy of politics I'm interested in the terrible things that does to people the compromises it's a terrible life I think for a lot of the people who wind up losing it\nMostly interested in telling a story and mostly interested in showing what I'd call for lack of a better term the human side of politics\nThere's a term a or a phrase that kind of a slogan that I never liked much at all nor did my late Washington friend Christopher Hitchens and that's that slogan the personal as political which you know tries to convince you that every action you take during the day has political ramifications\nI Would say that this book or these books of mine more than anything they try to demonstrate the opposite that the political as personal that people's personal foibles their psychological compulsions their needs are and so forth\nAll of those private things about their personality often wind up dominating their public conduct often wind up making them make certain decisions to do things ah\nOften wind up dominating their public conduct often wind up making them make certain decisions to do things a politically and you know I I don't write all alternative history which is you know those books that actually reverse\nThe outcome of events you know those novels where the south wins the civil war or something like that in my book stick\nSurprisingly a much to the facts but what I Try to do is insert in between what might have been private goings on private conversations things that could have happened plausibly that we don't know about and those\nEvents are almost always the personal lives of actual political figures and then\nIn addition to that I throw into the mix some invented characters as you would have in any novel made up character ...\nYou're going to be reading they tell us or the very first time allowed in public from landfall tell us what goes on their\nLand fall is the last volume in a trilogy I didn't know I was writing a trilogy and told my editor told me so when I was writing this third novel on it but it's a trilogy now I guess and the first volume was Watergate which was of course that during the Nixon scandals\nThe second volume was called finale which was set during the Reagan years it's a little odd to be having a trilogy with the middle of audio school finale but that's how it turned out\nAnd then this last volume is called landfall and it's set during the middle of George W Bush's presidency it's set between two thousand five and two thousand seven\nAt the very beginning of the book he's starting his second term in two thousand five\nAnd then quickly getting mired down in the Iraqi insurgency\nWhich reaches its worst points in many ways uh you know five and six just as the administration is trying to get elections going into Iraq and trying to get a democracy up on its feet in Iraq the country there's falling into a kind of civil war and the other disaster of course uh from that period as Hurricane Katrina", "year": "2018", "show_name": "Classical Music with Erika Funke", "city": "Williamsport", "day": "31"}