{"month": "10", "state": "PA", "station": "WVYA", "content": "But nonetheless we been on stage together in another play that uses the McCarthyism seem\nUnder courting the whole process of this play and I find that particularly fascinating really\nAbsolutely the play was first produced in Nineteen fifty five and we said that there is no villain in terms of the characterization and his play but there is\nParallels John and I were both judges I junior to his character in the crucible but but nonetheless we been on stage together in another play that uses the McCarthyism seem\nUnder courting the whole process of this play and I find that particularly fascinating really\nAbsolutely the play was first produced in Nineteen fifty five and we said that there is no villain in terms of the characterization and display but there is there's a very potent idealism in the play and although there's not a character that might in body something villain is the idea that to\nHold back inquiry and to not allow people to question and to not allow people to explore what may or may not be real what may or may not be right or wrong what is truth\nThese are these are questions that are explicitly brought up in the tax and the idea that you can you or a government can attempt to censor inquiry into censor truth or the pursuit of truth is very much what the villain is in the show and\nWhile the actors portraying these parts bring so much gravity cost to the characterizations and the character that they play are so multi layered\nWhile they're sympathy for all sides the real question is when do you stop allowing people to think and I think that John has you know one of the the colonel lines of the show when he says that you know I'm not defending birch um case being right I'm defending his rights to be wrong\nAnd I think that's a theme that really comes through and you see echoes in the cars to give them you would see echoes in the Nineteen twenties you'd see echoes in today there are reasons why these sorts of\nIssues in this tension between free thought\nAnd tradition our president you know for now but they have echo throughout history from ancient times you see that as the Greeks societies you saw that as one of the major tensions of society\nJohn in building the cat to drum and then what kinds of considerations have you\nBeen drawing on a drone those basic nature is freedom of expression\nAnd his conflict and also because probably one of his best friends is the exact opposite than him he's a fundamentalist and it does not believe in that freedom of expression outside of certain bound or a certain limit [noise]\nSo I have to tread on find grown between fighting him and expressing myself and saying no you can't do this your room and I can't hate him because he is a friend about it in the end I have to rush to the point where I have to destroy him\nAnd that is a very very difficult thing to a very fine line to walk\nAnd when talking about Matthew Harrison Brady the part that's based on William Jennings Bryan here's another case where you see the you know the shades and the layers of character Brian was a religious fundamentalist um but at the same time he was also a progressive before the term progressive ism even was coined\nHe was in many ways when he first ran for president in Eighteen Ninety six though he was the first populist candidate for president since Andrew Jackson where he was kind of taking on the wheel of the people and the fight of the people to the national government he was the outsider\nAnd he fought for things like women's suffrage and he fought for things like workers' rights and farmers rights against railroads and banks and so it's very easy to kind of look at this without contact than pigeonhole him as a moral conservative and\nWas coined he was in many ways when he first ran for president in Eighteen Ninety six though he was the first populist candidate for president since Andrew Jackson where he was kind of taking on the wheel of the people and the fight of the people to the national government he was the outsider\nAnd he fought for things like women's suffrage and he fought for things like workers' rights and farmers rights against railroads and banks and so it's very easy to kind of look at this without contact than pigeonhole him as a moral conservative in in more modern ideas of what conservatism is\nBut William Jennings Bryan and by extension Matthew Harrison Brady represents you know an older idea of progressive as in which is grounded in Christian belief\nThat the idea of the social gospel movement that humanity gets closer to perfection by providing for the least fortunate in society and that's what God and Jesus wanted people to do\nThat is something that William Jennings Bryan truly believe that fought for his whole life and there was where Brian and Darrow found their commonality the idea of fighting for the common man the idea of fighting for what they both believe that the time was right\nIt just so happened that over time their ideas of rights turned out to not be as compatible as they originally thought because of where they grounded their ideas of right and where they grounded their ideas of\nTruth [laughter] so when John is walking that fine line you are ...\nAnd find at all I lines absolutely direct I Can't deviate from that focus that I've had all my life that deep inherent believe\nIn the holy scriptures many of which I have memorized and I have a cult like following\nAnd I think to a degree my character enjoys that limelight historically Brian was the one who actually got the Turing debates going and the oratory within the should talk with tent series\nThat was actually William Jennings Bryan and there are times within this play\nWhere that background is referred to by my learned counsel for the defense and he actually accuses me at one point in the trial of actually giving a speech while that was that was my natural tendency whenever I could possibly do it\nEither as William Jennings Bryan or as my character in this play it's a my natural inclination to give a speech with borderline bombastic oratory because that seemed\nEverywhere I went to gather the people together into that cult like following and they were ... open it up out there for me and as long as that continued then I saw no reason not only to greet them in Hillsboro when I arrived with that kind of delivery\nBut also whenever I got an opportunity in the in the trial\nI went right back to that same personality so I don't think there's a fine line for Matthew Harrison Brady here at all I think he's just absolutely right on specific to wear his ministry and mission has been lifelong\nWe've talked about this that Brian actually came to Pennsylvania and spoke at Cal in long hand at the older Roosevelt schoolhouse in them and they said it was Nineteen Twenty one I Believe\nHe was invited to come down and he actually did you did make a speech at the Roosevelt school which I'm sure many people know if these days I was just just as surprised as everyone else I found it in an old newspaper\nClippings Darryl actually was on deck for\nAll I think he's just absolutely right on specific to wear his ministry and mission has been lifelong\nWe've talked about this that Brian actually came to Pennsylvania and spoke at Cal in long hand at the older Roosevelt schoolhouse in them and they said it was Nineteen Twenty one I Believe\nHe was invited to come down and he actually did you did make a speech at the Roosevelt school which I'm sure many people know if these days I was just a surprise as everyone else I found it in an old newspaper\nClippings Darrow actually was on deck for rule the\nMiners' strike and a nine to ... to ... he came here and spoke I Believe it was in Scranton courthouse a he was very much involved in that was one of the great strengths of the twentieth century\nAnd with the article that John share with me because he's a he's a local activist and historian himself Brian\nSpeech he gave that speech and then a a young man wanted his autograph and he said okay\nI'll give you my autograph but you have to take the Temperance pledge with me and so they're actually a copy of the Temperance pledge at the end of that article I'm so that tells you\nWhat you need to know about I'm Brian right there and going back to ... points about Bryan being an animal of of speeches and of crowds here's a guy who came to the public eye out of nowhere in giving a speech in the Democratic presidential conference um heat nobody knew who he was he was a\nA junior congressman from Nebraska and he gets up there and give the cross of gold speech engine in raptors the younger part of the Democratic party and so\nThat's something that bright would come back to again and again that was in many ways the defining moment of his life and\nThe idea of having your voice and having your personality be something that is so driven by the crowd is something that wealth or really brings to the forefront but it also exposes some of the the insecurities of\nMatthew Harrison Brady or William Jennings Bryan what happens when the crowd turns on you what happens when they laugh at you\nAnd that's something that Drummond certainly seizes onto when John talked about having to realize that in order to win this case or win\nPopular support he needs to destroy Brady he does so by making Brady feel like a fool and that's something that he cannot abide when people turn on him he's defined his entire identity by being demand of the people\nAnd other people are behind you and the people have moved on in society has moved on what am I\nAnd that's what he has to grapple with their reflection\nAfter that demeaning process where drumming just beats me to a pulp and to actually sort of a\n... throwing out all the different names of all the different books or the Bible and then just collapsing on the witness stand later on and a discussion with my wife a very poignant moment in the play\nI have to let them understand I have to make them understand where's my speech I Will tell them they have to understand and then all of a sudden he says\nI hate it\nWhen they laugh at [noise] I Can't stand it when they laugh at me\nAnd I and ... from that that that wasn't the first time that people laughed at him it was the first time he admitted it but he wouldn't say I hate it when they laugh at me if it hadn't happened before\nDot org or P. T. P. A. shows dont or P. P. A. shows down or [noise]\nPennsylvania theater performing arts is ending inherit the wind\nOrg F. E. R. R. A. R. A. for our\nCenter dot org more P. T. P. A. shows dot org [noise] P. T. P. A. shows dog for\nThe Pennsylvania theater performing arts resenting inherit the wind\nDirected by Adam ... featuring John sheriff\nThat will be\nTwelve Thirteen fourteen to Nineteen twenty twenty first\nFridays and Saturdays a seven Sundays at\nThree for more information on line Ferraro centered dot org F. E.\nR. R. A. R. S.\nFerraris underdog\nOr P. T. P. A. shows\n\n\n[noise]\nYou tuned to art scene or W. B. I. A. item round is has told us that\nThe incidental music will be hymns traditional hymns we have music by the early music group\nAnonymous food but recently they have released album in the American tradition this one titled American angels\nStory of presenting the story of rural America and sacred music as part of this recording we have a sense that there's subtitles films of hope redemption in glory also embrace New England\nAnd we'll hear just a couple of selections from this album opening was wondrous love on W. V. I.\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nNa na\nNa\nNa\nNa\nNa I did\nMy oh my\nYeah\nNa na na\nNa na\n\nNa na\nNa\n\n\nFrom that when we\n\nDad and we didn't see it on the on\n\n\nPhone\nWas\nOh yeah it's sad\nYou know\n\nWe\nDidn't you know my mom\nI draw\n\n\n\nA\n\nLine is that\nThe yeah and\n\nKnow maybe\n\n\n\nShe didn't change\n\n\n\n\n\n\nMy time to\n\nTime\nOn a Sunday\nIs\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise] wondrous love unwavering stranger music from American angels featuring the early music ensemble\nAnonymous for only ... Monday label on W. V. I. hey [noise]\nAdopted ... with the instruments to which the minister them as if the search these would be regarded as national treasuries but they are and we share them with special cartridge from two girls Longview in Shreveport\nTo preview the upcoming east Texas organ festival this week on ice cream from American public radio Michael Barone I Hope you'll be listening [noise]\nSunday mornings I fix on WB I and if you love music of the Oregon you were invited to a concert this Sunday evening at the University of Scranton it is a program change there was an Australian\nOrganist on ... Peter ... who was scheduled to perform but in his dad is ... who is the principal organist of the Madison symphony orchestra\nOrchestra and the curator of the overture concert organ series there and he will perform at seven thirty on the university's remarkable Oregon and he has been a guest\nSo Lewis around the country and around the world he's a graduate of the Juilliard School students of the day or noun teacher poll Jacobs there and he actually became the music director and organist of Corpus Christi Catholic Church in Miami the age of Fifteen\nSo he's been a distinguished a right from the start in the world of Oregon performance and you can hear him it's a free concert this Friday at seven thirty October twelfth\nThe who had McLean center at the University of Scranton on for more information Scranton\nDot edu Scranton dot E. D. U.\nSupport for WBAI comes from ... to ... and pitched in Pennsylvania a full service dental distributor was strong local reached a national reach ankle gentle deliver successful smile smile more information to co dot com or one eight hundred go but go the following is a test of the emergency alert system\n[noise] [noise] [noise]\nIt will be a full service dental distributor with strong local roots a national reach that goal gentle deliver success ... more from ... dot com or one eight hundred go but go the following is a test of the emergency alert system\n[noise] [noise] [noise] [noise]\nAnd at ... W. P. A. U. Ninety One point five FM streaming live a W. B. A. dot org we're in Allentown to not eat on point three and in Bethlehem at one of five point seven member supportive public radio W. V. I. A.\n\nTonight at seven and all that she has its recent piano trio record than mixed bag store today with today's new releases at eight thirty to set of new music\nBy longtime veteran artist ended nine it's our weekly album review this time the Scottish do all the judgments daughter and they're recording called did recognize\n\nThis is George Graham joined us tonight starting at seven on WB I [noise]\nOn the next fresh air I Believe this nation should committed [noise] cheating the goal of landing a man on the moon\nWe ... who directed the new movie the first man that Neil Armstrong the first man to walk on the ... ... also wrote and directed la la la land join us [noise]\nThis evening at six after all things considered on WB I Am [noise]\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. like I ...\nThe ... Center for the performing arts presenting Indian dance company ... dance ensemble on Thursday October Eighteenth at seven thirty PM at the Y. center tickets available at Bucknell dot edu slash box office or five seven zero five seven seven one thousand\nLive from NPR News in Washington I'm Laurie London [noise]\nHurricane Michael is now an extremely dangerous category for storm and continues to grow forecasters say it will make landfall around mid day to day posing a threat of catastrophic searches of the water and roof shredding wins\nFEMA says it has nearly three thousand people in the field ready to sit\nAnd as NPR's Rebecca Hersher reports Michael is predicted to be the worst hurricane ever recorded on the Florida Panhandle\nMichael's maximum sustained wind speeds or near one hundred forty five miles per hour that's strong enough to rip off ribs downed trees and to overturn mobile homes hurricane warning in effect for hundreds of miles of coastline along the Florida Panhandle storm surge of at least nine vertical feet is forecast near Panama City Florida\nUp to twelve inches of rain could cause flash floods in some areas and tornados are also possible according to the national Hurricane Center Michael could get slightly stronger before it's powerful core makes landfall in Florida this afternoon\nThe storm is expected to turn northeast as it hits land moving across Georgia and South Carolina on Thursday before busting out into the Atlantic on friday Rebecca Hersher NPR News\nThe U.S Supreme Court is weighing in on lawsuits over a citizenship question the Trump Administration wants to add to the twenty twenty cents is NPR's Hansi Lo Wang reports the administration is asking the court to stop lawyers from questioning administration officials under oath about the citizenship question\nCourts had ordered to key officials behind the citizenship question to testify out of court they include commerce secretary Wilbur Ross who approved adding the question to the twenty twenty centers and John Gore you acting director of the Justice Department division that the administration says it needs the question to better and forced to voting rights act\nSupreme Court Justice Ruth Bader Ginsburg has put boosted their depositions on hold\nJustice Department division that the administration says it needs the question to better and for the voting rights act\nSupreme Court Justice Ruth Bader Ginsburg has put both of their depositions on hold temporarily until the high court decides whether to block them permanently dozens of states cities and other groups are suing for the removal of the citizenship question\nIf you will discourage households with non citizens from participating in the census and harm the accuracy of the information collected on the long NPR News New York\nPresident Trump is repeating unsupported assertion that California Democratic Senator Dianne Feinstein leaked a letter written by the woman accusing Supreme Court justice Brett Kavanaugh of sexual assault\nTrump's comments at a rally in Iowa last night prompted the crowd chanted lock her up Feinstein is the ranking democratic member of the Senate Judiciary committee she denies leaking the letter that led to the firestorm over Kavanaugh's confirmation\nOn Wall street tech stocks are leading a major downward slide the Dow is down three hundred and Seventy nine points this is NPR News\n\nOne person is under a raft in Germany as part of an investigation into the slaying of an investigative journalist in Bulgaria as Joanna Kakissis reports it's the third killing of a reporter in the end you this here\nVictoria Medina was found on Saturday she'd been raped beaten and murdered she hosted investigative reporting program at a private station run by her ex husband Filin moxie month\nHe spoke at a makeshift memorial for her but she was a fighter she would not be satisfied just investigated you want to treat each of us killing has shocked the use\nWhich considers itself a safe haven for journalists under threat the anti graft watchdog Transparency International ranks Bulgaria is the most corrupt in the European Union and the least open to press freedom for NPR News I'm Joanna Kakissis in\nRousseff Bulgaria\nMeanwhile Turkish media is airing surveillance video of missing writer Jamal ... walking into the Saudi consulate in Istanbul but doesn't show ... leaving\nThe footage purports to show a team of Saudis arriving in Istanbul the day he went missing it also shows a black Mercedes Benz leaving the Saudi consulate after he entered and the team checking out\nAnd partying the country later that night Saudi Arabia remain silent as the images plate across the television networks in Turkey and around the world Saudi kingdom is under pressure amid\nGrowing international concern for the writer I'm Laurie London NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nBy on Christmas really from live from here with Chris do and\nProud to be the highest rated to our live musical comedy variety show on public radio in this time slot\nDo it in this weekend for our show U.S policy leader in Saint Paul Minnesota with the school our brothers this Madison Cunningham\nAnd dirty projector live from here we make great radio\nSaturday Night at six Sunday night at eight on W. V. I. A. F. N. [noise]\nLaurie and Laurie will be in as your host right after the NPR News headlines at one o'clock he has an afternoon filled with these it from the baroque and more till four and that's when we were joined NPR News for all things considered\nYeah it's an afternoon feel deeply music from the baroque and more till four and that's when we joined NPR News for all things considered\nIt will be mostly cloudy today with a chance of showers this afternoon lines in the upper seventies cloudy tonight to a chance of showers this evening\nAnd some rain and even a slight chance of thunderstorms after midnight loose in the mid sixties I'm trying to rain overnight Ninety percent on Thursday rain in the morning we showers and the chance of thunderstorms in the afternoon\nHigh in a low seventies I'm trying to bring Ninety percent\nSupport for WBAI comes from the citizens voice providing loser in county with breaking news every day for the past forty years citizens voice thanks their readers should receive news at home or on the go citizens voice here to stay more information as citizens voice dot com\nVirtuoso fiddling coming up next it's tied in any when we often hear that's raised the virtuoso violinist it is a concerto the first in the major and it is ... who's featured with the London philharmonic orchestra\nOn WB I hey [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\nViolin concerto number one in the major open six by ... by getting the money that was ... who was featured with the London philharmonic orchestra on W. V. I. A.\nAnd we know how can the knees musical talent says a violinist where a renowned were remarkable\nAnd it was often said he was in league with the devil his talents were so uh uh other worldly so remarkable well we'll hear a fable of the ... himself next on WB on a with lots more classical music to come\nAnd before we leave the subject of violin concerto does\nVirtual ... performance ers performers as well the violin concerto indie made jokes thirty five by Tchaikovsky will be the centerpiece of the ... next concert by the Williamsport symphony orchestra under the direction of her rival Amazon\nAnd that is Tuesday evening at seven thirty at the community arts center in Williamsport\nAnd Carolyn Golding will be so Lewis she just performed a solo titled this past weekend in Milford and she'll now a performance orchestrate in\nWilliamsport for more information he's Williamsport symphony dot org Williamsport symphony dot org\nProgramming on WB I just made possible by our members and by Lindy corporation to pitch the Marcellus natural gas is clean abundant and domestic Lindy is proud to be part of the solution to our growing energy me\nLet me go in at one o'clock with classical music right after the news headlines and as promised it's Mr waltz number one down in the village in at the village in\nClassical music right after the news headlines and as promised it's still well number one down in the village in the village in its music by another remarkable virtuoso pianist and composer Franz Liszt George Bush performs W. V. I.\n[laughter]\n\n\nNo\n\n[noise]\n\n[noise]", "show_name": "Classical Music with Erika Funke", "year": "2018", "city": "Williamsport", "day": "10"}