{"month": "10", "state": "PA", "station": "WVYA", "content": "Get involved in it and even after he doubled checks and make sure that that's indeed what they want to do so it's a it's a very friendly atmosphere that's there but it's also fun learning atmosphere to\nMichael is really great he was actually in our office not long ago and even my coworkers were going wow he's really good like I wouldn't mind seeing him actually Michael yes look I'm going to the action so so she's really amazing and then we have a few other items\nThat will be no carts available of Austin's meaning of the morning a library and we are having a few other items operate items as well if people are interested that poster little and the ... is\nA sign by the artist ... great poster of the Albright memorial library\nTell us a student about when you did the ... of the library and how you approached it did take photographs yes I Do take\nGood like I wouldn't mind seems you imagine Michael yes look I'm going to the action so so she's really anything and there was a few other items\nThey will be no cards available of Athens meaning of the library and we are having a few other items operate items as well if people are interested that poster will tend to follow orders are signed by the artist is\nA great poster of the Albright memorial library\nTalents Austin about when you did the banking on the library and how you approached it did take photographs\nYes I Do take photographs but I I go out and and I expect the properties during all periods of the day because the sunlight as it shines on it creates different effects\nAnd when I was first do in the library considering the library I was dismayed its orientation was a there was no direct sunlight on the interest of the library except for the middle of summer or later and when I say the middle of like eight o'clock in the evening\nSo that wasn't working out for me\nAnd so what I did I was going by it nice and the stained glass windows were lit up from the inside and I turned the whole thing around and I did a night image of it and I think it came out very very beautiful well there's yeah there's a a copy of it right there\nIt really has a European field doesn't it\nIt certainly does we just came back from Poland on Sunday\nHad a great trip but so all of these great old buildings wonderful architecture but nothing was nicer than this All right memorial memory and I hope I think I ... in the in the painting and uh\nWhen I originally started doing it if you look up as the buildings you see the wonderful architecture towards the tough so I did a series and I called it's granted looking up\nI mean that's the chamber of commerce thing obviously but it worked\nUh one other thing that I did you're talking about how you go about doing as a a friend of mine Phil ... of a conference media he was doing the public relations as they re did the ... feet wrote in Scranton\nAnd he had a drone picture that looked at the cathedral and I looked at that\nBut right next to it is the cathedral prayer garden\nWhich is a wonderful facility it's just magnificent but when you're down on the ground you can't get the impact of this drone shot you're up above you look down you see that it's actually the ... that you say is you a circuit them navigate the or the center of it and back\nAnd ah the buildings around it or a lovely so I took the drone shot and did a painting of that and we'll have a a well if a print a an inexpensive print the kind of start the auction where people can get in there\nYou mentioned ... remind us about the process\nIt's it's wonderful I get the ... made up at ... studios up into Cannick and Bob when you go into a studio\nHe has a painting right there of the holy mother and it was done for the Vatican the original was done for the Vatican so the Vatican wanted to get\nCopies made they went to the German company that did you gee clays that uh\nHad the whole system for doing it\nAnd the company says oh we manufacture these things we don't take it but if you want to go to ... Pennsylvania and you'll find the highest quality guy to make copies of so now when I Do a painting I take it up Bob laser scans is\nOn a scanner that's literally as big as your studio here so you can do a wonderfully size things and then\nTo get copies made they went to the German company that did you gee clays that uh\nHad the whole system for doing it\nAnd the company says oh we manufacture these things we don't take it but if you want to go to ... Pennsylvania and you'll find the highest quality guy to make copies of it so now when I Do a painting I take it up Bob leaves a scans is\nOn a scanner that's literally as big as your studio here so you can do a wonderfully size things and then they print them with archival ink that doesn't fade in sunlight or\nIt just holds up a ... thing that the Vatican and museums was museum quality or work\nAnd so we have those available and\nWhat I like to do sometimes in my own studio is I'll have the original and I'll have the ... next to it and I'll say you tell me which one's the G clay and usually people can't so we'll see what we're [laughter] we're not going to Seventy ... as an original you'll be all set\nAs far as your medium you talked about working with water colors when you were there with a little ones in Florida where did he experimented with since that\nWell uh again back to Keystone College and their glory as art department there I started with the water colors and you love the feel of it or the water colors flow in the works nicely it's almost a tactile experience but\nIf you make a mistake with water colors you're in trouble a very demanding\nSo I moved to acrylics in acrylics have their place they're very nice but they'd try pretty quickly their little difficult to work with\nAnd finally the gold standard is oils and I've been working with the oil I Love them they're forgiving\nAnd now that I'm doing the oils I'm a little stiff and how a a paint some of them people say oh that looks just like a a photograph of this because I'm not taking any liberties with it I'm doing it that close\nSo I'm working with\nMy professor a professor Judy Keats and she's tried to get to be a little more spontaneous so now I'm into multimedia and some other things not not that far along with it yet but I'm as a goal it's a goal but it's out there do you have a studio\nOh yes um I have an office that I rented Scranton in the ... Scranton enterprise center\nBut at home I paint watercolors up in the bedroom where the boys moved out\nAnd I paid boils down in the furthest wrote my uh\nWife has may relegated to the furthest from\nJessica what attracts you about Austin's image all they all bright library\nFor me I'm have always said that the operate more elaborate minds me a little Hogwarts a millennial I'll say it right there um I was working there so when I saw Athens painting really reminded me of course I think it's a better building an awkward but it really reminds me of it it it should quiet\nAnd and you know we we always say oh the libraries and quite anymore but as soon as you step outside those stories will just get to see the building there's a bit of calm peacefulness like you're just looking at this building and you're going\nThis is really unique to Scranton it was the first library ever built for Scranton and I think it'll mean for many more years ... first library\nAnd it it's just been amazing to see what what he has captured in what I see myself as exactly like he has painted well there's no witches or wizards no there's no our\n[laughter] in your ten year with the chamber Austin you must have been\nThose doors will just get to see the building there is a bit of calm peacefulness like you're just looking at the building and you're going\nThis is really unique to Scranton it was the first ... library ever built for Scranton and I think it all mean for many more years ... first library\nAnd it it's just been amazing to see what what he has captured and when I see myself is exactly what he has painted well there's no witches or wizards no there's no or [laughter]\nIn your tenure with the chamber Austin you must have visited many cities Scranton has its own distinctive architectural character\nIs granted as wonderful as architecture and people we get companies to come and look and they're always flabbergasted by the iconic buildings that we have\nA lot of people don't realize that northeastern Pennsylvania was so wealthy at the end of the uh nineteenth and the beginning of the twentieth century would call revenues and so those people invest that money in a some great architecture and it was at\nThe time when American architects were coming into their own\nThe sprint and cultural center was built at the time they had a national uh search for the architect to do it they put up a prize and I think three different architects got money to submit Rinder rings this is for the most sonic temple these are ... that that did that\nAnd the fellow who won he was the architect who did the Radio City Music Hall and this was done at the same time that uh that was done that he did or the Chicago Tribune building it was a world recognized architect came to Scranton and build that\nAnd if you look at the other major buildings or to the courthouse a city hall Scranton times a building of course in library one station Oh yes life all want a station that ah\nThat's a wonderful a facility as a as well but when you look at those things you realize that that wealth that was here in the community was put to good use and building these uh buildings was kinda like that visit to your ... to a poll and\nAll of the iconic buildings all of the really wonderful buildings if they were destroyed during the war they rebuilt to look like the original ones and so you were absolutely right a Scranton has unique architectural richness that you would not find other cities of our size\nYou have an image of this credit and cultural center on your Web site and do capture it at an angle that shows it's monumental comedy but also in that gorgeous light\nNotice I took it to the evening or son the live up the a lit up the exterior so it's a very warm picture people coming and going in front of it made it while him\n\n\n\n\nWell\n\nWell\n\n\n[noise]\n\n\n[noise]\n\n\n\nWashington Bridge impression for Ben I Will be William Schumann it was the Cincinnati college conservatory music when symphony directed by Eugene Cooper on on W. V. I. N. E.\nY. Center for the performing arts for any Cristina Pato master of the glacier bagpipes on Thursday\n\nGeorge Washington bridge impression for bad I Will be William Schumann it was the Cincinnati college conservatory of music when symphony directed by energy corporation on W. V. I. N. E.\nY. Center for the performing arts presenting Cristina Pato master of the leash and back pipes on Thursday October eleventh at seven thirty PM at the white center tickets available at Bucknell dot edu slash box office for five seven zero five seven seven one thousand\nJoined us for a celebration of the one hundredth anniversary of the birth of Leonard Bernstein's\nOctober fourteenth a three day you get reimbursed for gold with Richard don't\nResent a program that includes excerpts from mistakes works kept the west Side Story as well as an early summer and winter WB I Am the district feel like you do with like a concert pianist I don't eat the make reservations or touch and\nFeel like they weren't what by phone five seven zero six by by two\nIt's easy to get here would just off interstate eighty one in the Pennsylvania Turnpike and it's all on the line at W. V. I. dot org\nAround cacciatore I Know what trio for clarinet violin and piano with members of the middle of ensemble I'm telling you the high a\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise] nah nah\n\nNah\n\n\n\n[laughter]\n[noise]\n\n\nTrue for climate that my piano oh I don't go to Tony on it was huh\nLouis ensemble um W. V. I. A. NPR News is mixed visitors W.\nV. I. eighty nine point nine FM W. V. I. H. D. once quieted we'll ... and in Williamsport W BYA eighty nine points out of them in Mansfield WTO eighty eight point three of them and add like while I'm pop back\nW. P. A. U. Ninety One point five FM streaming live at W. B. A. dot org [noise] we're in Allentown and Ninety nine point three any Bethlehem at one of five point seven member supported public radio W. V. I. okay\n\nThis is George Graham Friday nights on both all that shit and mixed bag we call you request from seven to eight at all that jazz with the best in straight ahead acoustic\nJazz then at age it's a mixed bag starting with the daily new releases segment then from eight thirty two eleven will be playing you've worked for NPR\nCome from Pennsylvania was October SPA wind month celebrating Pennsylvania's locally grown and crafted wines with special things to do it tasted discover all across the state more information can be found P. A. Y. months dot com\nProgramming on WB I is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nSupport comes from east Strasburg university where do I go to college east Strasburg university for a new one regret it transfers can lock in the same tuition for all four years eating us you were warriors belong learned more at where warriors belong dot com\n\nLife an NPR News in Washington I'm reading skills on the nomination of Brett Kavanaugh to the Supreme Court is now on track for a final Senate vote probably sometime this weekend on this or the age of fifty one\nThat knows are forty nine the motion is agreed to the voices senator Shelley Moore Capito within the Joe ... vote on the procedural questioned the Senate will now continue to a final confirmation decision within thirty hours NPR's Scott Detrow has more\nIt was a party line vote with two exceptions Alaska Republican Lisa Murkowski voted no in West Virginia Democrat Joe Manchin voted yes\nSenators can still change their mind to head of the final up or down vote in fact Maine Senator Susan Collins a Republican says ... may not be fine and she'll announcer ultimate decision later today in a speech on the Senate floor\nThe final vote will likely be a help Saturday but it could be pushed to Sunday is calling is a no Montana Republican Steve Gaines won't be available to vote tomorrow because his daughter is getting married Dana says he won't skip the wedding for a vote Scott Detrow NPR News Washington\nNPR's Brakkton Booker is watching the scene outside the U.S Supreme Court across from the U.S Capitol Grounds\nThe crowds outside the U.S Supreme Court in the Senate for future of voters would allow me to comment on the crowds were not as big as they were yesterday protesters here still held signs that read or having a\nNPR's Brakkton Booker at the Supreme Court here in Washington that\nNature and the unemployment rate fell to its lowest level in almost fifty years in September according to a government jobs data released today but as NPR's John Ydstie reports the job creation cool good at last month\nThe three point seven percent unemployment rate in September is the lowest since December of Nineteen sixty nine that was during the Vietnam War when many potential workers were out of the workforce fighting in Southeast Asia today's labor market\nNineteen sixty nine that was during the Vietnam War when many potential workers were out of the workforce fighting in Southeast Asia\nToday's labor market is tied for other reasons a very strong economy has boosted demand for workers and the retirement of the baby boom it's slowing growth in the workforce employers added only a hundred and thirty four thousand new jobs in September that's the smallest monthly gain any year\nIt may be an indication of the scarcity of potential workers it's also possible Hurricane Florence reduced employment temporarily in some industries John Ydstie NPR News Washington\nThe Commerce Department is reporting the U.S trade deficit increased six point four percent in August hitting fifty three point two billion dollars exports dropped in the declining soybean ship mentioned imports hit a record high\nThe politically sensitive goods trade deficit with China surged four point seven percent to a record high of thirty eight point six billion Wall Street at this hour the gal down two hundred sixty five the NASDAQ off one hundred Nineteen this is NPR\nAfghan officials have rejected a proposal by the founder of the private security firms Blackwater to privatize the war in Afghanistan Jennifer glass has more details from Kabul\nI reprint to founder the private security firm Blackwater was recently in Kabul lobbying for his plan to outsource some military operations to contractors and mercenaries\nAfghan president Ashraf Ghani issued a statement saying under no circumstances would Afghanistan allow the counter terrorism fight to become a private for profit business both of us defense secretary Jim Mattis and General Joseph motel the head of U.S Central command have called the plant a bad idea\nThe Taliban and Islamic state have launched build attacks in Afghanistan controlling or contesting more than half the country Afghan military casualties are on the rise and many here are concerned that the violence will escalate at a parliamentary elections later this month for NPR News I'm Jennifer glass in Kabul\nTesla shares have slipped in trading today the downward slide followed a tweak by chief executive Iran must\nMocking the securities and Exchange Commission to muck tweet calling the SEC the quote short seller enrichment connection came just hours after a federal judge ordered mosque and the FCC to write a letter justifying settlement which allows him to remain in charge at Tesla\nThe SEC is charge that much posted false and misleading tweets this summer about taking the electric carmaker private a settlement of the case has Tesla and mosque each paying twenty million dollar fine to the S. E. C. ... mosque would step down as chairman but continue as CEO\nI'm Louise give ... NPR News Washington\nSupport for NPR comes from the alliance for a lifetime income a nonprofit composed the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nIt's averaged over and live from here with great feeling is kicking off that's even hardly strictly bluegrass in San Francisco this weekend [noise] you know the one with the Golden Gate bridge\nTune in for investment and Lindsay Buckingham answer ran for the riff raff\nRadio players will be there with our new music director Mike Elizondo and our new team with are now in America correspondent Tom Papa don't\nTomorrow evening of six Sunday night a thing [noise]\nSupport comes from Bloomberg children's museum where you and your children can meet your favorite superhero somebody heroes alliances Saturday costumes are encouraged with games crap some more this Saturday October six from time to to what the ... children's museum more five seven\nThe superhero so many heroes alliance this Saturday costumes are encouraged would gain scraps and more this Saturday October six from tend to to what the blues for children's museum more botched up an oath reignite nine to ...\nIt will be mostly sunny today was highest in the upper sixties cloudy tonight with a chance of showers after midnight lose in the fifties mostly sunny skies mostly these guys on Saturday high in the mid sixties and partly sunny with a chance of showers on Sunday\nTimes in the mid seventies and chance of rain forty percent on Monday the holiday partly sunny with a chance of showers and thunderstorms eyes in the upper seventies and try to rein forty percent\nSupport comes from the artist open house weekend in ... county twenty four artist exhibiting a variety of unique our treasures of twenty locations studios are open China youngest six PM October sixth through the eight five seven oh two Seventy two or three three to four artist tour dot com\nFor Castro sweet number three in the major ... sixty eight is a favorite oh I Love Lucy Love box particularly because of the air the second ... will recognize it when we hear it\nA a lovely lovely I'm moving piece and it's the Academy of St Martin in the fields performing here under the direction of level Mariner on W. V. I. N. E.\n\n\n\n\nMusic oh Caroline grueling she is a virtuoso violinist\nAnd she'll perform her red violin ... tomorrow evening at seven thirty Milford theater one fourteen east Catherine street in Milford, Pennsylvania and for more information on the Web kindred spirits arch dot org kindred spirits are dot org\nWe heard that she performs with an instrument from the sixteenth eighties and\nShe will offer a tip of the hot in the program tomorrow evening to the award winning movie the red violin we have some music from the soundtrack for the red violin now on WB I oh\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n... um the red violin the original motion pictures soundtrack food the red violin\nWe heard violinist Joshua Bell and the book list was elected weren't performing with this still harmonious orchestra under the direction of ... and on W. the I ... a speaking of film [noise]\nIndependent films are given the red carpet treatment at the nineteenth annual block their film festival in Milford October nineties through twenty first\nGene Alexander award winning actress and former director of the national endowment of the art is just huge bill I call and gets enjoy engaging dialogue ... sessions with cinematographer is about the fine art of independent filmmaking\nAnd sample a weekend of unique feature ensure filter mission for detailed the tickets in what black bear film dot com WB I celebrate hundreds of regional arts and cultural organizations\nWere details I'm anymore Ben check the W. B. I. art scene calendar and catch up on our ... cat the W. B. I. dot org slash are listening for art scene with Erica monkey weekday mornings after they use that eleven on W. vi yep and\nYou're listening for art scene with Erica funky weekday mornings after they use it a little bit on W. vi yep and\nThanks least so we've been talking about film today and we're about to hear more music for violin by someone who's known for he's still work on W. B. I. F. this is a slow will lead to Kentucky like\nFrom the violin concerto ... Bush twenty four of meat loaf Rosa I'm W ... I think Robert Duffy he's ... with the London symphony orchestra under the direction of your well let me [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n", "year": "2018", "show_name": "Classical Music with Erika Funke", "city": "Williamsport", "day": "05"}