{"month": "10", "state": "NY", "station": "WAMC", "content": "Tricked her who still a registered Democrat needed special permission to run on the Republican ticket polls show him thirty points behind an athlete but he says he's undeterred\nI'm going to put the best ideas forward to my qualifications forward and remind voters that I'm a lifelong Democrat who happens to be running on the Republican line because of fiscal physical pragmatist with the requisite skill sets of perfectly suited for a job that shouldn't be political and then I'll have to let the chips fall where they may\nNapoli says tricked her is using selective data when he criticizes the costs and performance of the pension fund he said tricked or looked at a ten year period that includes the great recession when every fun experience to steep drop and he says well some of the investments may include fees the variety of investments is a plus\nOur strength is our diversification and our long term perspective and patients\nThe Green Party candidate mark ... says he does not expect to win but he's focused on the issue of combating climate change he says he wants the controller to divest the state from all investments in fossil fuel companies\nLeaders in Paris said that there are fossil fuels is over with now with us going to be five years Fifteen Years or Thirty years it's not a long term business plan if the world is said we're not using your product any long\nThe Napoli says he can do more to change the behavior of fossil fuel companies by remaining a major investor love Republican tricked her says he would de politicized defined and not use it for any social or political purposes there's also a libertarian candidate and the rights Krueger Gallaudet\nHe's a former auditor for General Electric he says he'd bring a fresh pair of eyes to the office in Albany I'm hearing too wet\nNew York state's drinking water quality council met this week to discuss recommending PSA maximum contaminants levels were three emerging contaminants including ... away and the Upper West council members are set tuition some recommendations out there next meeting before the end of the year\nAnd council members have been reviewing scientific studies as well as the actions of other states that affected residents and environmentalists say setting the levels now is long overdue Hudson Valley bureau chief for hours and done with more a number of groups and individuals\nStreaming support for WAMC come from virtually Center for weight loss surgery with a focus on life skills and support for a long term success would weave district to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nSubstance says it's a class that includes PSI way in P. F. O. S. chemicals that have affected drinking water in places such as to the phones and Newburgh respectively\nAnd then there's one for dioxane Liz Moran water and natural resources director for environmental advocates of New York spoke during the public comment period at the end of the October seventeenth meeting\nThe action that has been witness today it's a tremendous disappointment for all New Yorkers [noise] it was over two years ago that Governor Cuomo in the department of health problem\nIt's actually on the very chemicals and testing if the federal government did not act as a temperate twenty sixteen the sentiment has been reiterated several times since how long you have to say it until you actually get with\nMoran is among those who have criticized the council for not having come up with leveled by an October second deadline Steve risotto however is urging the council to take their time he's senior director of the Washington DC based American chemistry council\nWhat we recognize the state's interest in moving quickly to the development of standards for ... away ATC urges the council and the health department [noise] take a particle clients approach to step in the in the overall from Asian prior to propose a warm [noise]\nGet state health department deputy commissioner for the office of public health proud hot and wants to get moving at the outset of the October seventeenth meeting he says the next council meeting to be held in November or December is to recommend them CL's\nAnd it's our intention that we were scheduled to next meeting\nOnce again to a shorter special meaning to get your\nRecommendation to the commissioner on an MTO for one for the auction for your ... year for us the thinking it was a [noise] there's some new information that we really want to focus on today to put you on the best position to make that recommendation but we are going to be moving quickly to get your availability and get that meeting on the counter and give them their show\nIt's a recommendation that would then be issued for public comment again hot and\nWell we've asked you to remain laser focused on here for a year for us and one for dioxane we've been having all along a discussion about the fact that there's this broader and growing group of ... per and policy for NATO alcohol substance or chemicals\nThat we need to really conceive of a broader approach for them as opposed to one of the time\nIt's an approach and there's just went to an advocate she is northeast senior organizer for food and water watch\nWe've ever really disappointed that they kicked the can down the road to the next meeting in December November on but we definitely a class that ... that great\nP. S. S. I. says uh chemicals as a car or we also want them to establish a combined maximum contaminants rubber ... parts per Italian and then immediately adopts regulations to require a statewide testing for these and then other emerging emerging from candidate\nRisotto says the American chemistry council does not see it scientific reason to assigning them see all for the entire ...\nThe U.S environmental protection agency has a health advisory at Seventy parts per trillion for PSI way in P. F. O. S. in drinking water in June the federal agency for toxic substances and disease registry or ATF DR released more than eight hundred fifty page draft report\nRecommending an emcee olive seven parts per trillion and there was talk during the council meeting about this report\nFrightened to tally is business agent for United Association of plumbers ... local seven which\nIncludes nine county surrounding Albany, Indiana\nStreaming support for WAMC comes from my dog harness dot com no joke no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\nOr created that twelve member council and September twenty Seventeen and earlier in October Colombo announce two hundred million dollars in grant funding to help communities have dropped federally unregulated contaminants in their drinking water saying that state is about to take the step upsetting enforceable drinking water standards\nFor the emerging contaminants P. F. L. A. P. F. O. S. and one for dioxane\nReporting from WAMC it's Hudson Valley barrel on the campus of Vassar College I'm Hudson Valley bureau chief Allison done\nWall Street that I was up Ninety six twenty five thousand for Seventy six as in ... by three uh two thousand seven hundred Seventy two and a stack down twenty three seven thousand four sixty one support for WAMC comes from ... smart New York's toga springs\nOffering individualized outpatient counseling and Suboxone treatment for opioid use disorder and medical treatment for alcohol problems\nAct smart New York dot com\nUniversity at Albany theater program presenting the musical God's spell exploring kindness tolerance and love performances through Sunday Albany dot edu slash appear\nAt around at oral surgery serving the capital region and beyond accepting most commercial and managed care insurance plans offering a range of oral immaculate facial surgery at around at oral surgery dot com meteorologist Garrett origins it was a cold\nMorning across eastern New York in western New England temperatures were largely below freezing early this morning resulting in a killing freeze in our area so the growing season has come to an end and that means that the national weather service will no longer issue\nFrost advisories or freeze warnings at least to no longer this year of course her next growing season will begin during the springtime\nBut one of the chili started but are pretty comfortable finish this afternoon temperatures have climbed into the fifties to near sixty degrees this afternoon with the ... south when we've had some clouds that come in during the afternoon\nAnd those clouds or a sign of some weather changes as another frontal system is set to come through so we've had some\nUps and downs on the thermometer over the past couple of days\nWill have some ups and downs on with her mom that are coming up over the weekend into early next week and at least a couple of rain chances as well\nSo is that front draws closer tonight the clouds will increase across the area it looks to stay largely dry this evening so if you have evening plans I don't think the weather is really going to be a major concern but later on tonight there is going to be the chance for at least some showers\nAnd our temperatures tonight will not be as cold as they were last night and those will be generally in the forties will keep the wind um the breezy aside as the night moves along and then for tomorrow\nWith that front nearby in passing through will see plenty of clouds in some scattered showers at times it doesn't look like it's going to rain the entire day but\nYou may need that umbrella every so often it is going to be a windy day in fact the winds will pick up tomorrow afternoon as that front passes by temperature should make it up into the fifties and then we'll see the cooler air rushed back in tomorrow night so by Sunday highs are only in the thirties to low forties across most of our area\nThere is the chance for at least a scattering of some rain and snow showers and the higher terrain and temperatures will remain on the chilly side as we start next work and school week on Monday and now here's my latest regional forecast\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks or health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero falls\nTonight increasing clouds at the chance of spotty showers mainly after midnight breezy and warmer with Lowes in the forties tomorrow mostly cloudy with some scattered showers turning Wendy with high in the fifties", "year": "2018", "show_name": "Northeast Report", "city": "Albany", "day": "19"}