{"month": "10", "state": "NY", "station": "WAMC", "content": "The Governor Cuomo has so far not said yes\nYou want him to eat there but we can't force them to be there we're going to do everything we can to get in there but if he doesn't call and we're going to honor those four candidates that did show up and that are putting themselves out there for the voters\nWilson says having just one debate between the two major party candidates is unacceptable\nThere's five candidates that are going to appear on the ballot not two candidates and we really need to hear from all five candidates at the same time that voters can make an informed decision on election day\nThe November one debate will be live streamed on Facebook Twitter and YouTube as well as on the leagues and college's Web sites in Albany I'm hearing too wet\nAnd you can hear the Cuomo mowing narrowed to base which was taped earlier today and New York city's going here tonight at seven o'clock on WAMC downtown great Barrington was officially designated a Massachusetts cultural district on Tuesday ... bureau chief Joshua Landis was their\nState and local leaders gathered at the ... performing arts center to celebrate as great buildings downtown became misdeeds forty fifth cultural district\nIt's not just the built environment it's what's happening and how people feel when they come and experience your cultural district\nI Need a Walker is the executive director of the mass cultural council to state agency uses grants initiatives an advocacy to quote promote excellence inclusion education and diversity in the arts humanities and sciences to foster a rich cultural life for all Massachusetts residents\nWere all about the economic impact of the arts and culture has the way that communities are activated and people are brought together about how we invest in the next generation of young people who are going to be nurturing their creative minds in great participants and citizens\nThe mass cultural council have sixteen regions in the state matching and sixteen regional tourism councils just Dina Crawford will serve at the council program officer for great Barrington\nState senator Adam Heinz of the Berkshire Hampshire Franklin and Hamdan District co chairs the joint committee on tourism art and cultural development heap praise the council's attention to the Berkshires institution and organization\nStreaming support for WAMC comes from my dog harness dot com and no ... no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\nStreet in the commonwealth of Massachusetts in the hope I get my numbers right a native of for every dollar invested in the creative economy we get ten dollars in return that's one heck of an investment\nFellow Democrats state representatives many picking a tally who represents the fourth birthday her district spent Thirteen Years on that same committee he praised the development of great Barrington downtown and said the cultural district designation would put the town quote on the map\nThis is the north Hampton of the Berkshires I've been saying that for a number of years now this is validation that this vision is correct\nThat the southern end of his own is the same church um which is now performance space and the northern end of his own is the soon to be magnificently restored Clinton search\nAnd Abrams of great Barrington select aboard also says I'm a cultural district steering committee\nIt was a goal of our master plan our two thousand and Thirteen award winning master plan to create a ... and left mark if elected said this isn't our priority and then here we are\nGreat ... culture is not just the arts and the most traditional sense of theaters like this one are museums but also food and farmers workers local artists and crafts people and their studios and our shops and gallery\nBeautiful landscapes and outdoor recreation health and wellness and the rich history of this town\nTearing Watkins director of finance and administrator ... is one of the cultural district steering the Mid East coach years\nWe look forward to partnering with the other ... county cultural districts William Penn north Adams and up straight in Pittsfield and maybe the next coming at\nThe ... regional planning commission and the great Barrington town planner Christopher rambled also receive praise for their involvement with the designation reporting from WAMC news Bergstrom bureau at the beacon cinema I'm Josh land these\nWall Street after falling more than four hundred points earlier today the Dow is recovering somewhat it's known only Seventy eight at this point twenty five thousand two thirty nine the s abused down ten two thousand seven hundred and forty five the NASDAQ off my Nineteen points seven thousand four hundred and forty nine\nSupport for WAMC comes from Dr Lucy ... from New York a plastic surgeon dedicated to withstand a cosmetic surgery cool sculpting treatment and laser and skin care since Nineteen Ninety six\nC. A. P. E. K. plastic surgery dot com goes musical presenting the music of Spanish influenced guitarist Morrow Lee bart with ... this Thursday eight PM ... music home dot org\nFulton County tourism and the southern Adirondacks park ... leaks forty four choices camping fishing hiking in more\nFall events through October calendar at forty four legs dot com\nMany relatives Garrett on Jan is with the regional whether somebody\nIt has been a changeable weather day across eastern New York in western New England at times it has been bright and sunny at other points it's been rather gray and then we've had some rain showers come through from time to time\nWe're going to keep that chance for Iran shower in the forecast moving ahead over the next few hours as a cold front comes through their leaving the chance that a couple of us will hear a rumble or two of thunder as that front comes by then that France will push off to the east tonight and that will open the door to some cool\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... Doug harness invented to make it easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to Todd walk your dog with love thousands of reviews at my dog harness dot com\nThose raindrops will change over to snowflakes a scattering of rain and snow showers will be possible especially north and west of the Albany area later tonight into the day tomorrow temperatures tonight will\nBe generally in the thirties to around forty degrees and the wind will begin to kick up a little bit more as the night moves along\nAnd then for the day tomorrow that front and storm system will be off to our east will be in a rather cool air flow tomorrow when the out of the north northwest will help to push that that chillier Erin temperatures tomorrow will be largely in the forties will have some thirties across the higher terrain across the north\nAnd a few spots and make it up into the fifties south of the capital region look for a blend of clouds and some sunshine tomorrow and\nThere is going to still be the chance for some rain and snow showers primarily north and west of the capital region the most favorite areas will\nBe in the mountains but even in the valleys might see a couple of rain showers as we go through the day tomorrow and across the higher elevations\nThere's going to be the chance for some accumulating snow especially cross the high peaks of the green mountains in the Adirondack so for most of us accumulation is not going to be a concern again temperatures are on the ... tomorrow it's even colder on Thursday with high only in the thirties to near forty\nWind will make it feel colder than that\nAnd temperatures will remain below average in the forties coming up on friday there is a potential for some stormy weather coming up over the weekend as a storm a hug the east coast that'll bring us the chance for some precipitation and maybe some when we'll keep you posted on that as we get a bit closer\nNow here's my latest regional forecast\nFirst for the north country the Adirondacks all a Vermont the southern sham playing valley including Plattsburgh in Burlington and leisure Saratoga region including lens falls mostly cloudy with some scattered rain and snow showers lows in the thirties to around forty\nTomorrow mostly cloudy with some rain and snow showers breezy high thirty eight to forty six\nFor the northern Catskills mohawk valley in southern Adirondacks including you to ... and ... it's a night mostly cloudy with scattered rain and snow showers lows in the thirties to around forty and for tomorrow mostly cloudy with some rain and snow showers breezy and cool high thirty eight to forty six\nFor the southeastern Catskills knit and lower Hudson Valley and interior southern New England including Middletown they kept the Westchester Hartford and Springfield tonight partly cloudy a chance of evening showers low forty to forty five and four tomorrow a mix of southern clouds windy with high and the low to mid fifties\nFor the capital district including Albany Schenectady in Troy end the Berkshires tonight mostly cloudy with some scattered showers thirty five to forty and for tomorrow mostly cloudy\nSome scattered mountain rain or snow showers breezy was hides in the forties region wide on Thursday partly sunny windy and colder high in the thirties to near forty and then friday partly sunny with high in the forties for W. A. M. C. a meteorologist Garrett ...\nSupport for WAMC comes from identity I where I'm In New York specializing a distinct divide where including zinc from Paris and cocoa song from Italy and prescription and non prescription sunglasses I exams\nBy appointment he Y. E. D. E. M. T. I. T. Y. I. we're all money dot com\nStraightening support for WAMC comes from my dog harness dot com and no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to Todd walk your dog would love thousands of reviews at my dog harness dot com", "year": "2018", "show_name": "Northeast Report", "city": "Albany", "day": "23"}