{"month": "10", "state": "PA", "station": "WVYA", "content": "This was W. V. I. A. eighty nine point nine up at W. V. I. H. D. once credited Wilkes Barre have building in Williamsport WTY eighty nine point seven have him in Mansfield WTO eighty eight point three I found out at like while in pop back\nW. P. A. U. Ninety One point five FM streamed live at W. V. I. I. dot org we're in Allentown and not eat on point three and in Bethlehem at what a five point seven member supportive public radio W. V. I. S.\nSupport for WBAI it comes from white combing college\nThe annual brand new leaf pseudo auction honor the memory of brandy lease pseudo lost her battle with Hodgkin's lymphoma\nJoined the like common college campus for a basket raffle to support scholarships for young scholars who aspire to follow in her footsteps with a career in biology and the health sciences October twenty nine AM in east talk on the like common college campus like all my college is a proud supporter of W. V. I. A. F. out\nFrom WHYY in Philadelphia I'm Terry Gross with fresh air Brett Kavanaugh is now justice Kavanaugh but Americans are still divided over who to believe how do we proceed when a woman's\nAccusation is sexual assault is countered by unmanned denial this is an issue universities have been grappling\nToday we talk with Vanessa ... is author of blurred lines we thinking that power and consent on campus when she was in college in the nineties women were told to protect themselves by carrying mace and learning self defense today many women on campus are saying no it's not\nIf you are probably going to have to change it\nStill divided over who to believe how do we proceed when a woman's accusation is sexual assault is counted ... this is an issue universities have been grappling\nToday we talk with the ... author of blurred lines rethinking sat power and consent on campus when she was in college in the nineties women are like how to protect themselves by carrying Mason learning self defense today many women on campus are saying no it's\nIf you aren't going to have to change its feet into tuitions which\nAlso ... reviews and early recording by hazel Dickens and Alice Gerard wrote a feminist perspective to bluegrass and Justin ... first man\nFirst news\nLive from NPR News in Washington I'm jak sphere thousands of National Guard troops along with law enforcement and other rescuers are making their way into areas along the Florida Panhandle devastated by hurricane Michael NPR's Debbie Elliott is in Panama City and describes the scene there today\nIn Panama City there is just utter destruction groups have been written from buildings windows are blown out\nPower pole light post twisted like they were something like a paper straw\nTrees are snapped down everywhere every time you turn around and go down the street you can't because of things in the road mostly trees but on to power line pieces of billboard the front facade of the church had completely come off\nThere is devastation on every street to just about every structure that I've seen in Panama City\nNPR's Debbie Elliott Michael's now a tropical storm moving through the Carolinas at least a half a dozen deaths are being blamed on the powerful weather system\nTo man crew aboard a Russian Soyuz spacecraft bound for the international space station as safely back on the ground after on Nick Kagan rushing cause ... venture and made an emergency landing after their capsules separated from a malfunctioning rocket and brought them back to earth we'd wise men as NASA deputy chief astronaut and explains what happened\nFor the ... motives the safest mode and all that really means is it's like a shooting and blow it out of a rifle barrel it starts slowly spinning the dissent mazel so that has ... and I'm a stability as it comes back through the thick or parts of the atmosphere and the ... comes out and they laugh\nMoscow's immediately suspended all manned space launches pending an investigation\nTens of millions of Social Security recipients are getting a boost in their benefits next year following a stretch of low inflation government reports the annual cost of living adjustment or cola rise by two point eight percent in two thousand Nineteen raised miles through about an additional thirty nine dollars a month for the average retired worker\nUs stocks fell sharply again the day with the ... five hundred and forty five points on top of yesterday's eight hundred and thirty point loss NPR's John Ydstie has more on today's trading\nThe Dow fell about a hundred and thirty points at the opening bell but a positive report on us consumer inflation help support the market which bounce back and forth between losses in gains in early trading\nThan some negative news from the White House on trade tensions with China pushed ducks lower\nThe Dow was down almost seven hundred points at a low for the day before it regain some of the lost ground\nInvestors remain worried about trade issues and rising interest rates which are negative for stocks President Trump again criticized the fed for raising rates saying the fed is out of control and making a mistake John Ydstie NPR News\nWashington looking at some of the other numbers the NASDAQ closed down Ninety two points today the U.S and the five hundred fifty seven points this is NPR\nTensions with China pushed docks lower\nThe Dow was down almost seven hundred points at a low for the day before it regain some of the lost ground\nInvestors remain worried about trade issues and rising interest rates which are negative for stocks President Trump again criticized the fed for raising rates saying the fed is out of control and making a mistake John Ydstie NPR News Washington\nLooking at some of the other numbers the NASDAQ closed down Ninety two points today the U.S and the five hundred fifty seven points this is NPR New York City police investigators say they are taking a look at allegations of detective improperly coached a witness during the Harvey Weinstein investigation\nProsecutors are dropping part of a sexual assault case against the film mobile after a witness says she was coached by detective to stay silent about evidence partially contradicting the account of one of Wednesday's accusers\nInternal probe of the detective conduct began about a week ago\nToday the food and Drug Administration posted a warning that certain bed trying to heart devices have a security guard and could be vulnerable to a cyber attack more from NPR's Richard Harris\nThe problem lies with two models of a device called a programmer\nUsed to communicate with implanted pacemakers indefensible leaders doctors can use these devices over the Internet and mid chronic an update the devices software remotely\nBut it turns out this communication channel wasn't entirely secure and could potentially be hacked\nAs a result of that product has blocked anyone from reprogramming the communication devices remotely while the company improve that security the FDA it there are no known reports of patient harm from this vulnerability and implanted devices do not need to be adjusted Richard Harris NPR News\nOrange a new study upwards of sixty percent of the U.S population with European heritage may be identifiable through their DNA hold on consumer Web sites that even if they have never made their own genetic information available as because there's more and more people upload the DNA profiles to websites used genetic analysis it's easier to find matches\nThe study was published today in the journal science I'm jak spear NPR News in Washington\nSupport for NPR comes from NPR station other contributors include that Jayanti and Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information are Mac found dot org and the listeners who support this NPR station\nTaking a look now the forecast it'll be mostly cloudy this evening along with the chance of rain with Lowes on the upper forties our chance of rain is fifty percent and we'll also see wind gusts up to thirty miles an hour\nFriday looks partly sunny with highs and the upper fifties it'll be mostly cloudy on friday night along with the fifty percent chance of rain was lows in the lower forties and Saturday looks mostly cloudy again with the fifty percent chance of showers ties in the lower fifties this is your arts and information station W. V. I asked them\n\nThis is fresh air and Terry Gross the Kavanaugh hearings and confirmation raise the question again how do we decide who to believe we're in a woman's say she was sexually assaulted by someone she knows behind a closed door and the man denies that that's an issue of universities have been grappling with\nMy guest unethical glory on us is the author of blurred lines sex power and consent on campus over the course of three years she interviewed a hundred twenty students from twenty universities spoke with nearly eighty administrators and experts\nAnd read dozens of case reports she says that while writing the book she witnessed a historic moment when survivors move from the shadows to the spotlight first on campus\nSalted by someone she knows behind a closed door and the men denies it\nThat's an issue of universities have been grappling with\nMy guest man that's a ... is the author of blurred lines sex power and consent on campus over the course of three years she interviewed a hundred twenty students from twenty universities spoke with nearly eighty administrators and experts\nAnd read dozens of case reports she says that while writing the book she witnessed a historic moment when survivors move from the shadows to the spotlight first on campus and then nationwide with me too movement\nGoogle Riyadh as as a contributing editor at the New York times magazine in Vanity Fair and has won a national magazine award\nMonastic regarding artist welcome to fresh air you know you write in your book that there's a new understanding of what rape and sexual assault means that started on college campuses but with me too movement it's spread beyond campuses\nWhat do the Kavanaugh hearings and confirmation tell you about how far that new understanding has spread\nI guess what I'm asking you is this if if the Republican senators and the Judiciary Committee had gone to college campuses what'd you think some of the things are they would have been told about ... what to take into consideration before voting\nThings that they might not have thought of in part by the Republicans on judiciary were men a lot of them are older men if you know their college days were very different in terms of thinking about sexual assault\nYeah it's so senators had um ban on college campuses as presidents or administrators are title nine officers they would have had a completely different set of questions right because they would have already known what college campuses no about sexual assault which is\nVery few women make it up very few women are excited to get there and report and feel like this is their moment in the limelight\nWhen he was afraid she'd be smothered to death\nShe was afraid that she was going to be killed unintentionally unintentionally mother to yeah\nAnd she was prevented from leaving [noise] um so it's been devised trying to say title nine which mandate against gender discrimination on campus needs to be applied to discrimination against men because so many men are being wrongfully accused as that her case that is exactly what you're saying yeah\nShe's interested in this idea of gender discrimination claims both ways\nSo um have her guidelines taken effect yet\nNo they haven't they were leaked to the New York times on there will be a notice and comment period a you know we have to see also if she's going to put these out these were a draft that the times got their hands on\nMy guest is Vanessa ... is author of the new book blurred lines sex power and consent on campus we'll talk more after a break this is fresh air\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com which was your orchard information station W. V. I. off him\nEvery hour of every day the programming you've come to expect on WB I he was paid for through the financial support or listeners like you find so much for your membership learn more about membership and sign up today\nAt W. V. I. A. dot org\nThis is fresh air let's get back to my interview with the ... is author of the new book blurred lines sex power and consent on campus\nOur home improvement information at the Home Depot dot com which was your orchard information station W. V. I. off him\nEvery hour of every day the programming you've come to expect on WB I just paid for through the financial support or listeners like you thanks so much for your membership learn more about membership and sign up today I told you ... a dot org\nThis is fresh air let's get back to my interview with the ... author of the new book blurred lines sex power and consent on campus\nSo let's talk about the definition of sexual assault and how that is maybe changing what what was the kind of common understanding of the definition of sexual assault in the three years you were talking to people on college campuses\nThere was a huge shift in the definition of sexual assault from like two thousand and fourteen to Seventeen while I was there and I watched as it happened um many students said to me that they weren't sure if groping\nCounted as sexual assault maybe it had to be penetration 'em\nBy the end of the three years that I deal with completely blown up the water 'em and I even had students say to me\nYou know sexual assault is maybe even the way you speak to people the way you a grass on people in speech and make them feel like justice uh like dirty like a sexual objects I mean they were thinking through this idea how far can we actually take this [noise]\nSo um it is there no commonly held understanding of what the definition of sexual assault is now\nI don't think that there's a national understanding of what the definition of sexual assault is I think that um people who are in line and about this issue understand that it doesn't have to include penetration um but I think that\nPart of why good part of the country is in line with Trump on this issue is that we don't have a national definition [noise] so\nUm you also say that the definition of consent is being redefined and the slogan used to be no means no but now at the yes means yes what's the difference between no means no and yes means yes\nWell there's a huge difference something like asked me yes is okay until you get some sort of yes you don't really have permission to touch somebody now [noise]\nAh yes you know in the college definition could be verbal or it could be um they like to call it acts unmistakable and their meaning which I suppose means I'm mon are grown or pulling off clothes et cetera\nAnd from looking at this and researching it I didn't agree with this at the outset but I came convinced that this is a\nReally good standard for young people and perhaps for older people as well certainly anybody who's\nIn a workplace you might have a crush on somebody else you know you got to ask a question 'cause you could be misinterpreting signals people do that all the time so why\nWere you resistance to this yes means yes standard and why did you change your mind\nWell I'm an adult you know I'm In my forties and I know that that's not the way sex usually happens mean sexes something ... folk and that's kind of energy between people and more exciting in some ways one\nIn a workplace you might have a crush on somebody else you know you got to ask a question 'cause you could be misinterpreting signals people do that all the time so why were you resistance\nTo this yes means yes standard and why did you change your mind\nWell I'm an adult you know I'm In my forties and I know that that's not the way sex usually happens mean sexes something ... folk and that's kind of energy between people and more exciting in some ways when it's like that\nYou know we see a lot of young people who are having sex with people that they met on dating apps they barely know these people home that's part of the\n... part of the charge but and I I'm not so doctrinaire that I think that you should have to say yes to each escalating base or sexual act which is the way a lot of people think of yes means yes but I Do think that the question is not that big a deal\nI'm In Gen x we had the question you know should I get a condom which was always\nKind of a a question about protection but it was really a permission question I'm there really has to be an extra question\n... you read that the strongest argument for affirmative consent for yes means yes it frees girls from the cage of socialized politeness twenty me\nWell one of the complexities of sexual assault is that girls don't always saying no um they certainly don't say it that way no get away from me I'm pushing you away right they say well maybe another time\nUh I don't think I Want to do this tonight until they ended up\nGiving up um you know some of the most interesting work that's being done now in terms of trying to fix this problem is about\nGirls understanding the signals from people who might in Trenton them harm and removing themselves from the room before anything actually happens because people understand once you're in the room it's really hard to get out\nWell you know the thing about yes means yes there's a lot of people say oh that's so awkward to kind of have these like rules like almost like a questionnaire like I authorized huge too like you know take off my shirt or whatever\nUm but it's equally awkward I think for the woman to be in a place where the man is making all these advances and you have to say no no no stop no I really mean stop no okay I'll leave no it just put the responsibility on her and it makes it like really awkward\nAnd it's not a shared awkwardness it's like one person having the full burden of the awkwardness\nExactly so this is a little dorky okay ... ... it definitely changes things I mean I went to a dance party I like to go out and dance and I\nRecently you know got to come up and downs with you and you try to get away and this guy came up and he was about to put his arm around me and then he said is it okay if I put my arm around here and I said no\n[laughter] no I didn't want his arm around me and he'd say oh yeah I get it consent I'm I totally get it I understand I'm Glad I asked was that the first time that happened here\nThat was definitely the first time in fact it up for it to me\nI mean I ... yeah I I didn't\nThink that that men intended me harm but I didn't want his arm around me I had no interest in him I married um I was just there with my girlfriends having a good night and dancing so\nAnd I said no [laughter] no I didn't want his arm around me and say oh yeah I get it consent and I totally get it I understand I'm Glad I asked was that the first time that happened here\nThat was definitely the first time in fact it up for it to me\nI mean I ... yeah I I didn't\nThink that that men intended me harm but I didn't want his arm around me I had no interest in him and Mary and I'm I was just there with my girlfriends having a good night and dancing so\nI think that's a great thing to have that happen and to have young girls who truly a you know are in night clubs or at dance parties a lot understand like this is my buddy I own at people have to ask permission to touch it\n[noise] my guest is Vanessa group gory artist author of blurred lines sex power and consent on campus we'll talk more after a break\nCan Tucker will review and early recording by hazel Dickens analogy Gerard who wrote a feminist perspective to blue grass and just in China will review first men during Ryan Gosling as astronaut Neil Armstrong the first human to walk on the ...\nI'm Terry Gross and this is fresh air [noise]\nThe new by our family foundation supports WHYY fresh air and its commitment to sharing ideas and encouraging meaningful conversation [noise]\nSupport for NPR comes from the station and from workman publisher of one thousand books to read before you die a life changing list [noise] uh readers compendium for inspiring hours of browsing the joy of discovery and an answer to the question what to read\n... and again you're going to do that as empowerment or you could see that as objective vacation and I'm just wondering\nIf you have any thoughts about that or if that's an issue that came up a lot when talking to young women on campuses\nWell it's certainly not an issue that came up when I spoke with the young women 'cause they completely believe it's empowering but it's an issue that came up a lot for me because I found myself really torn between those two ideas is empowering or is this\nDenigrating 'em and you know being somebody who comes from second wave feminism item my knee jerk reaction is like you guys were calling the self objective vacation isn't that just a\nA ruse isn't that just somewhere justifying on this kind of\nWay that you're you're presenting yourself but after speaking to so many of these students I truly change my mind about that because I realized like this is how they grew up you know these kids that I interviewed in college just graduating now\nYou know Brittany spears was just like they were they were just tiny when Brittany spears without\nThis self object vacation isn't that just a\nA ruse isn't that the somewhere justifying on this kind of\nWay that you're you're presenting yourself but after speaking to so many of these students I truly change my mind about that because I realized like this is how they grew up you know these kids I interviewed in college just graduating now\nYou know Brittany spears was just like\nThey were they were just tiny when Brittany spears without the culture has been so saturated with sex the entire time that they've been growing up they've been growing up around pornography around fashion that is much much ... than anything that I grew up with so\nThey don't have the same ideas about oh if I trust this way it makes me look like a slut because this is the way people dress now there's such a casual way and you're right and a lot of concerts as a beyond say or\nKaty Perry ... you know it's it's crossing a line way from scanty to something makes release actual but this is what they believe is empowering to them now we have all sorts of data also saying that they have\nA huge amount of nervousness about it and they feel I'm anxious and depressed disguise them like their social media posts six cetera so there's there's a flipside to that but they were adamant with me that this was only to the good that they were presenting themselves\nSee reading her book we're in the process of developing new power dynamics in the bedroom an\nArea where feminism has previously not been able to reach so attached to explain what you mean by that\nI think that is raising of dean and that has been going on with me to era is allowing women not only to say these are the things that happened to me in the past that I might call sexual assault or I might call things I was extremely uncomfortable with\nAnd now going into the future I Want to be treated differently in the bedroom I Want to be asked what I Want I Want to be able to say no tonight and have that actually be heard\nI think that behavior always kind of live behind attitude shift\nWe're definitely in the attitude shifts now but I truly believe that that kind of most private ah is beginning to shift\nBut ... says thank you so much for talking with us\nThank you so much Terry Vanessa ... is the author of blurred lines sex power and consent on campus after a break can Tucker will review a new album by hazel Dickens and Alice Gerard who brought a feminist perspective to bluegrass this is fresh air\n[noise] taking a look now the forecast it'll be mostly cloudy this evening along the chance of rain with low was on the upper forties or chance of rain as fifty percent and we'll also see wind gusts up to thirty miles an hour\nFriday looks partly sunny with hides in the upper fifties it'll be mostly cloudy on friday night along with the fifty percent chance of rain was lows are lower forties and Saturday looks mostly cloudy again with a fifty percent chance of showers with ... and the lower fifties\nCars as your arts and information station WBHM ...\nSupport for NPR cut off from this station and from home advisor watching homeowners with home improvement professionals for a variety of home project\nFrom minor repairs major remodel owners can read reviews of local pros and book appointments on line at home and adviser dot com [noise] and from Amazon crime video with\nThe Romanoff a new series from the creator of Mad Men start\nA chance of showers with ... this is your arch and information station WVU like a a ...\nSupport for NPR come from this station and from home advisor watching homeowners with home improvement professionals for a variety of home project\nFrom minor repairs to major remodeled owners can read reviews of local pros and book appointments on line at home at ... dot com and from Amazon Prime video with\nThe Romanoff new series from the creator of Mad Men\nStarring Diane Lane Aaron Eckhart Christina Hendricks and Isabelle you pair premiering October twelfth on prime video\nThis is fresh air hazel Dickens and Alice Gerard each had a successful folk music career before they started recording together the country and bluegrass music they loved him a little Harris Roseanne cash and the only ...\nHave lost sight of Dickens and Gerard as inspirational performers and now we can hear the birth of their musical partnership and send me back home the D.C tapes Nineteen sixty five to Nineteen sixty nine rock critic Kentucky has this review\n\nWe don't\nKnow I saw a young\nMan I Know you lose your name me a while you are really they\nDraw boy lifts and rises bottomless barrel of are you all alone and hazel Dickens vocal joins or in the\nChorus to affirm a unity through loneliness\nThe song was written and recorded by the loop and brothers in the Nineteen fifties unlike Charlie and are losing connected by blood ... and Gerard we're a bit of an odd couple\nDickens rate poor in the coal mining territory of West Virginia and Gerard a classically trained singer approaching music from a rather more academic angle were separated by a decade in age when they began running into each other in the lively folk scene a Baltimore and Washington DC in the sixties they found that their voices\nMashed well and that they shared an eclectic approach to the music that they enjoy doing [noise]\nThat's why I ... a big pop hit for the Everly Brothers in Nineteen fifty seven [noise]\nGet to just the range of music to be found in seeing me back home the D.C tapes Nineteen sixty five to Nineteen sixty\nNine previously and released recordings of ... and Gerard the two of them sitting in a studio working out the harmonies and playing at various times guitar auto harp and banjo\nNo\nGod I'm\nA\nRunner God\n\nThank God for that\nGuitar auto harp and banjo\nOn\nGod and\nYou know\n\n\nI got back from her\nThat no hard times written by Jimmy Rogers frequently called the father of country music\nSong Gerard refers to as being lead gender ride by her and ...\nBoth were highly aware of being women making music in a predominantly male music scene and their close study of the songs they admired also required that they think about what it meant to interpret first person male points of view in Nineteen eighty seven fresh air interview with Dickens who died in two thousand eleven\nShe told Terry that she was quote the only woman writing songs for women to saying that she was aware of one of the high points of this album is their interpretation of a song written by another musical feminist Dolly Parton on\nIn the good old days when times were bad I\nMean\nI'm\nIn\n\nReading\nGame and\nI think\nOne of the accomplishments of the music here in the way ... and Gerard appropriated the tradition of do a thing\nUntil this point primarily the province of brother acts like the losing brothers Stanley Brothers Jim and Jesse and bill and Charlie Monroe listen to the title song\nMerle Haggard than current hit me back home\nHere ... voices but she's a really weak piercing harmony that echoes Gerard ...\nNa\nNa na na na na na\nVe", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Williamsport", "day": "11"}