{"month": "10", "state": "PA", "station": "WVYA", "content": "And from T Rowe price offering a strategic investing approach that examines investments opportunities first hand institutions advisors employers and individuals choose T Rowe price T Rowe price and best with confidence\nThis was W ... nine point nine F. M. W. V. I. H. D. once granted Wilkes Barre ... and we're in Williamsport it WTY eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were like well I'm pop back a W. P. A. U. Ninety One point five of them\nStreaming live a W. V. I. A. dot org we have a translator and Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I. S.\nProgramming on WB I is made possible by our members and by auto bookstore\nAuto bookstore in Williamsport and W. V. I. A. T. V. invite you to vote for your favorite novels in the great American read\nA nationwide celebration of America's Best loved books Tuesday nights at eight pm on WB I ATV throughout October more information is available at W. V. I. A. dot org slash great American or ... or ... auto bookstore\nSome WHYY in Philadelphia I'm Terry Gross with fresh air today Michael\nLewis out there with the best sellers money ball and the big short talks about his new book the fifth risk and examines the federal government under President Trump by focusing on three department energy agriculture and commerce\nWhich together are responsible for controlling risk you wouldn't associate with those department I predict hurricanes and overseeing our stockpile of nuclear weapons\nLouis that half of the top seven hundred jobs in the Trump Administration are still unfilled and some of the people who have been appointed have conflicts of interest or unqualified making them unprepared to deal with\nMany of them potentially catastrophic the risks of a pandemic or the risk of a nuclear accident [noise] risk with terrorists [noise]\nOne after another and many of these are not risk than most people are saying\nFirst news live from NPR News in Washington I'm ... beer President Trump holds a campaign rally in Mississippi tonight\nField and some of the people who have been appointed have conflicts of interest or unqualified making them unprepared to deal with\nMany of them potentially catastrophic the risks of a pandemic or the risk of a nuclear accident [noise] risk of a terrorist attack\nOne after another and many of these are not risk than most people think\nFirst news\nLive from NPR News in Washington I'm ... President Trump holds a campaign rally in Mississippi tonight his second political event and as many days NPR's Scott Horsley reports Trump says he's seeing strong support among fellow Republicans for Supreme Court nominee Brett Kavanaugh\nTrump says Kavanaugh's nomination has become a rallying cry for the geo Pete and expressed confidence as a closely divided Senate will confirm his nominee by the end of this week\nKevin up has strongly denied allegations that he sexually assaulted women decades ago Trump says he's not concerned by stories of Kevin O's drinking during that period even though the president himself does not drink\nI remember my college days everybody was thinking it was like normal I was abnormal it was totally normal everybody was thinking if\nTrump defended Kevin O's performance during a congressional hearing which some critics have called overly partisan but the president caution lying to Congress would not be acceptable Scott Horsley NPR News the White House\nSecretary of state Mike Pompeo is heading back to North Korea this weekend to try and push ahead talks on denuclearization NPR's Michele Kelemen reports he'll also visit Japan South Korea and China\nThis would be Palmdale is fourth trip to North Korea in less than a year and State Department spokesperson Heather Nauert says he hopes to meet the north Korean leader Kim Jong un who has exchanged letters with President Trump\nI haven't been privy to all the latter communications are that have gone back and forth but obviously these conversations are going in the right direction and we feel confident enough to hop on a plane or to had there to continue the conversation\nNow where it says the U.S wants to other countries to maintain sanctions and pressure on North Korea in the meantime though China and Russia are calling for an easing of sanctions to deport diplomacy Michele ... NPR News the state department\nTime is running out for authorities to find any more survivors from the massive earthquake in resolving the nominee wave that struck Indonesia five days ago the official death toll from the earthquake that struck the western part of the country friday now tops twelve hundred and it's still climbing beers Julie McCarthy made her way to a devastated area with an army eight insecurity convoy\nWe are are there is a high on that because as we move north\nTo follow the roads are in decent condition it started to rain which sort of added to the misery here there's not a lot of traffic coming out um what you would have expected because a lot of people are trying to leave however there is no gasoline\nTo do that and so people really that sense of feeling trapped\nNPR's Julie McCarthy online retail giant Amazon is taking a major step today now school raised its minimum wage for all us workers to Fifteen dollars an hour starting next month company says that move could ultimately benefit more than three hundred and fifty thousand workers\nMexico's on Wall street today the Dallas up a hundred and twenty two points the NASDAQ fell thirty seven points this is NPR\nFirst lady ammonia Trump is in Africa the first lady today meeting over tea with or guardian counterpart after arriving in that West African nation\nA spokeswoman for Mrs Trump says the two first ladies exchange gifts this was her first visit to Africa a five day tour with plant stops and Balawi Kenya and Egypt earlier today she visited a baby clinic and you've gone as part of her campaign for child welfare [noise]\nI Know when I was just by the American cancer\nBe thousand workers and mix clothes on Wall street today the dials up a hundred and twenty two points the NASDAQ both thirty seven points this is NPR\nFirst lady of Vilonia Trump is in Africa the first lady today meeting over tea with a guardian counterpart after arriving in West African nation\nSpokeswoman for Mrs Trump says the two first ladies exchange gifts this was her first visit to Africa a five day tour with plans Thompson Balawi Kenya and Egypt earlier today she visited a baby clinic and gone as part of her campaign for child welfare [noise]\nA new analysis by the American Cancer Society is finding many teams are not up to date on H. B. B. vaccine NPR's Allison Aubrey reports the vaccination could prevent several types of cancers\nNearly fourteen million pre teens will need to be vaccinated to reach the target of an eighty percent vaccination right by twenty twenty six the new analysis finds a disproportionate percentage of teen boys ... families have private insurance\nHave not gotten the vaccine the vaccination rate is higher among medicate insurance teens the others point to initiatives such as a federally funded vaccines for children\n[noise] [noise] [noise]\nThe national weather service has issued a tornado\nCounty in northeastern Pennsylvania until six thirty PM it's ... pm a severe thunderstorm capable of producing a tornado\nWas located near a global when you're scraping movies they're twenty five miles per hour\nHazard tornado source weight or indicated rotation impact flying debris will be dangerous to those gone without shelter mobile homes will be damaged or destroyed or damaged windows\nAnd vehicles will occur treat image is likely this dangerous storm will be here almost around six PM Moscow around six twenty PM way I Am good girl\nAbout six thirty PM takeover now to a basement or the jury room\nFloor of a sturdy building a void\nIf you were outdoors in a mobile home board vehicle moved to the substantial shelter and protect yourself from flowing to be\n\nIn the upper fifties Thursday looks partly Saudi and nice with eyes in the upper seventies and Thursday night looks mostly cloudy with low was in the lower fifties the W ...\nThis is fresh air I'm Terry Gross the federal government under President Trump is the subject of the new book the fifth risk by my guest journalist Michael Lewis who's also the author of the best sellers Moneyball and the big short which were adopted into films and the undoing project\nLewis looks at Trump's government by focusing on three departments energy commerce an agriculture\nIf you're thinking that this is about boring bureaucracy consider that as Lewis points out the government manages a portfolio of risks that no private person or a corporation was ever able to manage ranging from forecasting and warning about hurricanes the national weather service as part of the Commerce Department\nTo preventing the accidental explosions have our own nuclear weapons one of the energy department's many responsibilities\nMany essential positions and the Trump Administration remain unfilled\nAnd some of the key positions Lewis says uh filled by people who are uninformed about what areas they're supposed to be overseeing well others have conflicts of interest our political views that make them antagonistic toward the department or agency they're leading Lewis started writing about this\nBeing from forecasting and warning about hurricanes the national weather service part of the Commerce Department to preventing the accidental explosions have our own nuclear weapons one of the energy department's many responsibilities\nMany essential positions ... ministry nation remain unfilled and some of the key positions Louis s a fellow by people who are uninformed about what areas they're supposed to be overseeing well others have conflicts of interest that political views that make them antagonistic toward the department are agency they're leading\nLewis started writing about this in articles published in Vanity Fair Michael Lewis welcome back to ... explain my fifth risk is\nShort answer is the risk that you failed to imagine it's is while you're worried about what you're worried about is the thing is actually going to come and kill you and the longer answer is when I'm working on this book\nAbout the federal government under Trump\nI come to see the federal government as really a portfolio of risks that are being managed\nAnd as I'm wandering around the federal government trying to figure out what these risks are over and over again I what am I asking people in the Energy Department or the agriculture part or even the White House to name kind of the top risks on the tip of their minds\nAre they all come up with kind of three or four and then they can't think of the fifth so I thought that's the moment where the mind failed to imagine what it needs to imagine\n[noise] since your book is about the federal government under Trump focusing on the energy agriculture and commerce departments why did you name it to rest now that you've explained what the fifth risk means\nWhich then apparently caused Trump to take a lot less of him but he you know he is an odd choice if you're very odd choice because with that department really if someone who's really comfortable with technology\n[noise] well if you're just joining us my guess is Michael Lewis and his new book is called the fist risk and the book is about the federal government under President Trump and the book looks at the energy agriculture and Commerce Department\nWe're going to take a short break and we'll be right back this is fresh air\nSupport for WBAI comes from wise markets presenting the wise healthy bites tip of the week every Friday afternoon at four on WB I asked them it's pumpkins season this week strictures waste ahead seasonal canned pumpkin meals and snacks\nProgramming on W. V. I. is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nThis is fresh air and if you're just joining us my guest is Michael Lewis he's best known for his books like money ball the big short and the undoing project all of which have been bestsellers his new book the fifth risk is about the federal government under Trump and it examines the energy agriculture and commerce departments [noise]\nYou know I'm Wondering there's so much attention being paid to what's happening in the White House and to the Mueller investigation and now to um the Kavanaugh confirmations story\nAnd not as much attention is being paid to what's happening on the cabinet level on a department level and I'm Wondering if there's a lot of action happening in the department level like the three departments you write about no agriculture commerce energy that most of us aren't paying that much\nTo what's happening in the White House and to the mother investigation and now to um the Kavanaugh confirmations story\nAnd not as much attention being paid to what's happening on the cabinet level on a department level and I'm Wondering if there's a lot of action happening\nIn the department level like the three departments you write about you know agriculture commerce energy that most of us aren't paying that much attention to even though it's it's being reported on\nBut it's not it never seems to be like the sexiest story\nIt never will be and that's the problem I mean it's like where society of distracted drivers we're not paying attention to the thing that matters most\nThere is this enterprise that is not a trivial enterprise the society we ... doesn't function without the government government is is it's been subjected to decades and decades of\nOf abuse and scorn in his collected rust and this guy has come in with a sledgehammer and is is having at it and nobody's paying much to you know he's paying much attention because of slow moving story and this to me you know\nOne aspect of the fifth risk is the go a lot of the risk that the government manages are very long\nTerm slow moving risk climate change would be one of them income inequality ... would be another ah cleaning up or you know horrible toxic waste sites that can pollute rivers and\nRuin lives and another they're all kinds of examples of very slow moving problems that are dealt with in a slow way but they require a long\nTerm approach and on top of this enterprise has been it's been thrust is very short term\nAttitude I mean the ... the Trump Administration has incredible kind of living from news cycle the news cycle and the public is go along with it and that's the that's that's the frightening thing to me\nAnd you see a lot of action happening at the department level that kind of level of government where things are being done where physicians aren't being replaced where people\nAre being appointed who aren't really um appropriate for the position\nAnd people and they're people who have the ability to dismantle critical functions of the government who also have a financial incentive to do so because they have some conflict\nSo let's get back to the Commerce Department which you write about in the fifth risk atomic bomb includes the national oceanic and Atmospheric Administration in L. A. Noah and you say sixty percent of the Commerce Department Israeli Noah first of all what they're doing in the Commerce Department [laughter]\nIt's a really good question so it's even more than sixty percent it's sixty five percent or so of the budget it goes to this one thing I Know it eats the Commerce Department and they simply do National Weather service by the national weather service is a bit and now there was there which is the biggest part of no ... and how do they get their back in the seventies\nOr Nixon was contemplating reorganization of government and um he was going to put the no ... in the department of interior and the secretary of interior at the time came out against the Vietnam War next Nixon got ticked off\nAnd just shoved into the Commerce Department as an actor vengeance so it's there it doesn't much matter that it's there except that people don't know it's there\nAnd it is it's the single most important institution within the Commerce Department are and it does it eats most of the resources and it and what it does um is absolutely critical and er into this\nHe was going to put the no ... in the department of interior secretary of interior of the time came out against the Vietnam War next Nixon got ticked off and just shoved into the Commerce Department as an act of vengeance so it's there it doesn't much matter that it's there except that people don't know it's there\nAnd it is it's the single most important institution within the Commerce Department\nAre and it does it eats most of the resources and it and what it does um is absolutely critical and er into this place Trump is put the most really about the worst person you could possibly put to run it\nAnd you're talking about Barry Myers who is the C. E. O. N. accuweather I that sounds actually like a good thing he runs a weather Prediction Center okay well\nI'm so here's the problem are typically the person who runs NOAA has has a science background and Barry Myers is a lawyer but let's leave that to one side it's a ... no one of the giant science operation um\nThe problem is that the national weather service uh which has been a fabulous a fabulously successful operation I mean people don't pay much attention to it but but the weather prediction has gotten generally\nDramatically better over the last few decades we we can predict the paths of hurricanes and we can give tornado warnings a faster than we used to be able to give them an image and just the you know the daily forecast has gotten better\nOr all of that saves lives and property a ... that's the mission of the national weather service to save lives and property to do it it has to communicate with the public\nUh it it has to let them has to do that and it has to be good at communicating with the public and Barry Myers a has been on a two decade mission to prevent the national weather service from communicating with the public so that accuweather\nCan do it instead and that's how accuweather gets paid and so he has had bills introduced in Congress just actually forbid the national weather service from\nFrom doing anything but warning in ... right in advance of a of a weather event that might kill you and the problem with is is that well in the first place\nIs that the the the the data that that is required to generate weather prediction\nIs all paid for by the taxpayer I mean that these billion dollar satellites that are hovering over us the uh the ... the ... the network of radar stations across the country that the national weather service spends the bulk of its money accumulating the data that and then makes it available for free\nTo companies like accuweather so that they can go and you know\nAdvertise the whether there's no real reason why the taxpayer should have to pay for this twice having paid for the day to the national weather service really should be able to give people forecasts but what he has been trying to do is organized is actually a kind of exclusive rights\nTo use that data and make money from it and his argument is that I shouldn't have to compete with the government but it's a very strange argument because the government gives him basically all he needs to do is business for free\nYeah you're saying that the weather satellites weather radar weather balloons all the high tech stuff that I'm\nNo private company that no private company on its own would have the wherewithal to to pay for that it is a naturally or a government operation and so and it's naturally a governor operation to deliver weather forecast for the public [noise] so\nI shouldn't have to compete with the government but it's a very strange argument because the government gives him basically all he needs to do is business for free\nYeah you're talking about the weather satellites weather radar weather balloons oh the high tech stuff that I'm\nAt no private company that no private company on its own would have the wherewithal to to pay for that it is naturally or a government operation and so and it's naturally a governor operation to deliver a weather forecast for the public\nSo Barry Myers or had been like one vote away from Senate confirmation where does that stand now\nHis nomination is stalled so he's not in the job yet\nMy guest is Michael Lewis his new book is called the fist risk we'll talk more after a break I'm Terry Gross and this is fresh air\nSupport for NPR comes from the station and from cancer treatment centers of America working to outsmart cancers for use of genomic testing to profile each individual's cancer and revealed possible treatment option\nLearned more about precision cancer treatment that Cancer Center dot com and from ... Iraq\nThat basically represents their point of view so what was the landing team and what was piled tasked with doing\nSo landing team is a grand phrase for what arrived at the department of energy because it was really just pile and he didn't show up until a month after the election\nAnd he would have been in theory tasked with receiving you know hundreds of hours of briefings from people in the department of energy who would prepare them but he what he did instead was met met for about an hour with a couple of people in the secretary's office and listen politely and didn't take notes\nAnd the people who were\nRunning the department of jihad the impression that he had no interest in what they had to say\nOne of the things he did um is part of the quote landing team will send a list of Seventy four questions he wanted answers to Seventy four questions to the department of energy what were some of the question\nWanted lists of uh names of anybody in the department who attended meetings that were associated with climate change\nHe was trying to identify people who might be hostile to the fossil fuels industry I think so the department didn't actually respond by giving him the list of names but he ... the bigger point was\nHe came in in what were they interpreted as a hostile spirit I'm signaling that the new administration was not did not approve of various attempts the department of energy was making to wean us from fossil fuels\nIn the department who attended meetings that were associated with climate change\nHe was trying to identify people who might be hostile to the fossil fuels industry I think so the department didn't actually respond by giving him the list of names but he ... the bigger point was\nHe came in in what were they interpret it as a hostile spirit I'm signaling that the new administration was not did not approve of various attempts the department of energy was making to wean us from fossil fuels and it is you know part of the department of energy's mission to\nEngage in and fund basic research in alternative energy\nSo you know your previous book about the science of of risk and about trying to kind of clout to find a way how the human mind works when it's assessing risk that book was called the undoing project do you feel in a way that your new book could have been called the undoing ... because in some ways\nDepartments and you know I and the Trump Administration are getting on ... ... there aren't a lot of people to replace the people from the Obama administration yet and some of the people who have been put in positions to run those department are antagonistic toward those departments\nSo yes there's actually there's actually direct connection between the undoing project my last book in this one is what got me into this book in the first place [noise]\nOne of the insights that drops out of the work of the psychologist day an economist and Amos diversity who are studying the way people judge risk\nIs that when you changed the ... people don't sets it especially with catastrophic risk you take something that ... there's a one in a million chance of it happening and change it to one in ten thousand people don't feel that\nAnd I was thinking of that when Trump came in and approached the federal government the way he did because\nOne way of thinking of the federal government is is this vast portfolio of risks many of them potentially catastrophic risk the risks of a pandemic or a the risk of a a nuclear accident or the risk of a terrorist attack or the the one after another and many of these\nAre not risk that most people are thinking about the risk that the nuclear waste site in half or Washington leeches plutonium into the Columbia River and poison the whole Pacific Northwest\nAnd I thought Trump's approach\nIs effectively taking lots of you know one in a million or one of the ... hundred thousand risks and making them more likely making them all more likely\nBecause he's putting people in charge of the risk you don't know anything about it and I thought this society doesn't feel it the column and diversity showed you that people don't really feel this and that inside is what got me going in the first place [noise]\nSo you used to work on Wall street way back in the day and you wrote about that experience in your first book liars poker last month mark the tenth anniversary of the financial collapse of two thousand eight the market has more than recovered over that time\nBut some people are starting to say this might be another bubble um\nHow are you interpreting having written a book recently about risk and having you know been having written about the financial crisis what you've done um I'm actually in what your thoughts are about whether we are now in terms of financial stability and\nAnd world markets [noise] well a method to question\nThe question you're asking me to predict the bad things going to happen next\nWell I I Know that's not really your job but\nBut some people are starting to say this might be another bubble um\nHow are you interpreting having written a book recently about risk and having you know been having written about the financial crisis what you've done um I'm actually in what your thoughts are about whether we are now in terms of financial stability and\nAnd world markets [noise] well I'm a big question\nWhat is it a question I mean you're asking me to predict the bad things going to happen next well I I Know that's not really our job but no it's not my job but you know if I ...\nI Would love to have one ... outlandish prediction on the record not that I think it's going to happen but like it's a sort of thing that if it does happen I think a lot of people will go oh my God that's exactly where we were headed all\nAssuming Donald Trump remains president for a while\nI think there's at least the possibility of the risk that he will try to default on the American debt selectively like he'll say a Chinese are trying to sell their treasury bonds is causing disruption and the treasury bond market they stole money in the first place from is we're not going to pay the Chinese back\nThis is a a larger way of saying that\nI think the risk now in the financial system is political risk\nI at the banks are much better capitalized and better regulated and they were ten years ago I don't think there's going to be a directly a banking crisis but I think there could be a crisis in faith in the dollar and in us credit worthiness our deficits are exploding we have a president who has a history of defaulting on debt\nHe's riled up lots of emotions hospital emotions to foreigners who hold the debt I'm a ... that wouldn't shocked me and that would trigger a financial crisis a so why\nWould a figure trigger a financial crisis\nWell because the dollar is the world's reserve currency lots and lots of people hold it assuming it's going to be more or less stable\nThey'd be a flight out of the dollar a U.S treasury bonds or the benchmark for a ... of risk a risk was asset in the world would everybody kind of measures themselves off of it's assumed to be\nYou know better than gold ... if that if that is called into question and then treasury bonds are going to collapse in the interest rate which the U.S government can borrow was going to skyrocket\nUm this is the doomsday scenario and I'm just kind of playing with it here but if you asked me to like\nFor predict what might trigger or the next financial crisis I think it's I think I Would predict it's some sort of political event and it would be that sort of thing and if that happened you know it's fun when you predict things funding sort of predict things where where ...\nWhen they happen they make sense of a lot of things that have happened leading up to it\nAh I think a lot of people would say oh my God we should have seen that coming [noise]\nMy guess is Michael Lewis and his new book it's called the fist risk and the book is about the federal government under President Trump and the book looks at the energy agriculture and commerce departments [noise] we're gonna take a short break and we'll be right back this is fresh air\nSupport comes from the Senate art museum the Santa Clara museum invites you to explore art from an evil manuscripts to surrealism with two locations to serve one on the Bucknell campus in another in downtown St Louis bird all events are open to the public more museum dot ... dot edu\nTonight at seven PM W. V. I. F. M. T. V. will sign will cast a debate between the nominees for Pennsylvania governor incumbent Democrat Tom Wolfe and his challenger Republican Scott Wagner\nThe moderator this debate will be\nWe're going to take a short break and we'll be right back this is fresh air\nSupport comes from the semi art museum the Democrat museum invites you to explore art from an evil manuscripts to surrealism with two locations to serve one on the Bucknell campus and another in downtown St Louis bird all events are open to the public more museum dot ... dot edu [noise]\nTonight at seven PM W. V. I. F. M. T. V. will sign will cast a debate between the nominees for Pennsylvania governor incumbent Democrat Tom Wolfe and his challenger Republican Scott Wagner\nThe moderator this debate will be Alex ... the longtime\nHost of the TV quiz show jeopardy ... were the only gubernatorial debate before election day on WB I have\nSeven PM [noise]\nSupport comes from crashing or more treatment center providing alcohol and chemical dependency support for addicted individuals on their families more information on Kashmir more with is available at one eight hundred for four to seven seven to two at ... dot org slash more worth\nThis is fresh air and if you're just joining us my guest is Michael Lewis his new book the fifth risk is about the federal government under Trump\nA lot of the government as a often dismissed as being a bureaucracy that slows down anything\nSupposed down enough and prevent anything from getting done and that it's just like layers and layers of of bureaucrats have like managers and I'm too lazy stupid people has your has your understanding of like our bureaucracy changed to writing these stories\nOh my God I so I didn't know what I was going to find when I start knocking on the door of the Energy Department or the agriculture department of Commerce Department\nAnd I turned to having exactly the same experience the political people have when they were appointed to these jobs running these places and have these some preconception but vague preconception of what the bureaucrats are like\nUm this happens over and over again that that a new administration comes in\nIf they have kind of contempt vague contempt for the people who were there and four years later they walk out and say those are the most amazing people I've ever worked with", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Williamsport", "day": "02"}