{"month": "10", "state": "CO", "station": "KRCC", "content": "You can figure out the bad guys man [noise]\n\nGame yeah\nAmerican public media [noise]\nKnow me and then\nYou can figure out the bad guys man [noise]\n\n\nAmerican public media [noise]\nYes you can have great music seven nights a week from seven to midnight and Ninety One point five can be seen [noise]\n\nNPR on Ninety One point five K. R. C. C. is supported locally by Colorado Ballet presenting the beloved classic Sleeping Beauty October fifth through the fourteenth that the L E Caulkins opera house with live music by the Colorado Ballet orchestra Colorado Ballet dot org this is southern Colorado's NPR\nStation to your C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. law hunter key CCS dark for all and K W CCF them woodland\nComing up on this week's Thomas Jefferson our we speak when president ... percent about one of his favorite pastimes reading talking about taking calls to Newcastle ... nothing more than to talk about reading books and he made a list of them for anyone ever asked for a reading list Jefferson just drop everything\nAnd wrote down selections we talk a bit about his formative years the ... the professors\nThe teachers that sort of inspired him to this\nLifelong habit of reading his two great mentors Williams small up the College of William and Mary in Georgia with the greatest classical scholar and legal is in the United states and then some talking about the great literary hopes will be Eighteen century option a series of a Scottish ancient poems translated by a mixed fierce and\nDrink first and discovered in air quotes the bench and bar to a lays and Jefferson like almost everyone else was taken in by the so join us for all that and this week's Thomas Jefferson\nDay citizens\nTo great mentors William Small of the College of William and Mary in Georgia with the greatest classical scholar legal is in the United states and then some talking about the great literary hopes of Eighteen century option\nA series of a Scottish ancient homes translated by a fierce and James McPherson\nDiscovered in air quotes the ranch in ... LA's and Jefferson like almost everyone else was taken in by the rules so join us for all that and this week's Thomas Jefferson\nCitizens and went to one would Jefferson\nOur weekly opportunity to discuss current American events with President Thomas Jefferson who is senior to process where they now a good day to you Mr President\nGood day to use this as Mr jeopardy should we have a question from one of your listeners Shawn Johnson he asked state you discuss the thoughts between articles to section one laws why he thinks it's outdated\nYou familiar with that sure I did not write the constitution and in fact was not at the constitutional convention but I think you're talking about the requirement that the president be native born in thirty five years old Yes sir I well I grew up in the British Empire I was born in the colony\nOf Virginia and the British Empire and we became the United states in Seventeen Seventy six and our constitution was ratified in Seventeen eighty eight are second constitutions and that's the one with this a clause in it\nI think it's important that the president be an American born here\nI understand immigration than I Am we wanted immigrants in our time much more than you seem to want them in yours we had an empty confident that we wanted to fill with people who love liberty is arguably as we do but I Do think that the president is the one official elected by all of the people\nThat's not true of governor it's not true of a senator or congressman\nThe president needs to have a deep connection to the heritage of this country I think that person needs to have been born here um to qualify for that office\nWell it alone due to become president but there are those are in memory who could not have been president Mr Hamilton comes to mind I don't think he would've qualified\nI don't know if that has ever been fully resolved do you know he was born in the Caribbean you came to this\nThat's not true of governor it's not true of a senator or congressman the president needs to have a deep connection to the heritage of this country I think that person needs to have been born here um to qualify for that office\nWell it it alone due to become president but there are those are in memory who could not have been president Mr Hamilton comes to mind I don't think he would have qualified\nI don't know if that has ever been fully resolved you know he was born in the Caribbean\nYou came to this country when he was fourteen or so sponsored by his well wishers back ah in the Caribbean\nHe came to New York and he distinguished himself and he became one of the most important American see was the de facto leader of the federalist party including in in a certain sense the shadow president during the the administration of my friend John Adams\nI I think that if Hamilton hadn't hadn't stood for the presidency and one which he could never have won by the way but but assuming that he won\nI think we would have installed him I Do not think there would have been a constitutional test because he was born before the United states he would be grandfathered in probably as somebody who became an American instantaneously in the fall of sense of the term on July second\nI'm Seventeen Seventy six when we resolved independence from Great Britain I I Know people talk about his eligibility but I don't think that was the issue not let me say\nThank goodness Hamilton was never a president\nHamilton as a monarch host he's a militaristic corruption is he believes in the industry in banking and stock markets and so on this is not a man that that really understands are Americans scene he admitted so himself and in the last letter\nThat he ever wrote before his famous dual so I'm Glad that he'd never stood for the presidency if he had stood for it I don't think he could possibly have one he was too high tone and\nA federal is to really have any popular support but I Do believe from a constitutional point of view\nOr he his election could not have been prohibited\n... what about during my time sure do you think it's still applies I mean we have such a connected world now as compared to during your time or we may be missing out on some very qualified people\nMay be but I think that America is unique those who come here don't always understand us in in in the entirety of our of our dream our system our exceptionalism I don't think there's anything wrong\nA federal is to really have any popular support but I Do believe from a constitutional point of view he his election could not have been prohibited\n... what about during my time sure do you think it's still applies I mean we have such a connected world now as compared to during your time today we may be missing out on some very qualified people\nMay be but I think that America is unique those who come here don't always understand us in in in the entirety of our of our dream our system our exceptionalism\nI don't think there's anything wrong with insisting upon a native born American to serve\nAs the president of the United states I just remember from a just a few years ago in your time how much difficulty you had thinking but the sitting president might possibly have been born\nIn some other country and and how that now de legitimize them in the minds of millions of people I I I think that this is an important principle to to embrace\nAnd you know there are plenty of other\nRoles for more recent immigrants they can be in the U.S Senate they can be in the house of representatives they can be governors\nThey can do all sorts of things in this country but the presidency in my view\nBelongs to a native born Americans to keep only American born citizens in the White House is what you're saying\nI Am saying that you make it sounded a liberal but I Believe that it's a very heart and soul of what it means to be an American thank you very much Mr Jefferson's\nSupport for Ninety One point five K. are the kind of our listeners and from local organization winery ... concerning audience that values quality [noise]\nMarketing on Ninety One point five carry the ... people most likely to shop in their business for non profit and by taking there has to learn more about corporate white cocky now seven one nine four seven\nEight or oh why oh\nGood day citizens in well they use it Thomas Jefferson your weekly conversations with President Thomas Jefferson Mr Jefferson is portrayed by the award winning humanities scholars author and create the Thomas Jefferson our history play Jenkins host David Swenson unseated across from me\nI Am pleased to say is president Thomas Jefferson dating is a good day to use Mr Jefferson either in anticipating\nOur conversation this week I had a subject that I think\n... oh\nGood day citizens in well they do think Thomas Jefferson your weekly conversation with President Thomas Jefferson Mr Jefferson is more trade via the award winning humanities scholars author and the eight of us the Thomas Jefferson Iowa Mr fleece jackets on your host David Swenson exceeded across from me\nI Am pleased to say is president Thomas Jefferson dating this could be used as Mr Jefferson either in anticipating\nOur conversation this week I had a subject that I think you will find places to talk about what is its or reading your reading habits your thoughts on books uh your list and in in just in use or as a reader who could you start that conversation\nI don't remember learning to read but I always was able to read so I must have been three or four maybe five years old\nMy father Peter Jefferson was an extraordinary man the second or third person than in our part of Virginia he was a frontier has been in a way that I never was he was a cart hog rougher and a diplomat\nAnd he had a small he was self educated he had never had the joy of being formerly tutored\nBut he had a small but important library of about forty volumes and the family tradition is that I had read all of them\nAt a very young age and I got a passion for reading in fact my father's um his determination that the end of his life he died suddenly when I was just fourteen or his wish was that I'd be classically educated that I get the best possible education than an American\nIn our colonial circumstances could get ... at that time that could mean going off to Harvard or Yale or Columbia than known as kings college or Princeton than known as the College of New Jersey that could mean going off to Oxford or Cambridge reading borough\nBut for most of us given our circumstances it meant the College of William and Mary I'm In the lower Chesapeake and it is indeed a to William and Mary that I went as a young man than about just about Seventeen years old and\n\nBut for most of us given our circumstances it meant the College of William and Mary I'm In the lower Chesapeake and this is indeed a to William and Mary that I went as a young man than about just about Seventeen years old and\nAnd I would like to talk about that as well Mr Jefferson's Neal right of course right now they're going to take a short break\nWe'll be back in just a moment in your life\n\nWe'll be back in just a moment and you're listening to Thomas [noise]\n\n[noise] a variety of free legal resources will be available at the El Paso county combined courthouse on legal resource day over twenty six more information on this end of the public service announcements on the community counter ...\nNinety One point five K. I. C. C. is dedicated to covering southern Colorado and the Rocky Mountain west un membership to directly find our journalism thanks very disappointing Ninety One point five K. I. C. C.\nProgramming on Ninety One point five K. R. C. C. is supported by Colorado College a national liberal arts college where together students and professors explore the depth and breadth of each subject one course at a time more about Colorado colleges block plan at Colorado College dot edu\nBy Ninety One point five K. R. C. C. members who continue to fund the news music and other quality programming that Ninety One point five K. R. C. C. brings to southern Colorado and beyond at K. R. C. C. dot org thank you\nAnd then the Thomas Jefferson how are you on the conversation with President Thomas Jefferson this week we're speaking with President in jeopardy about him as a leader on those really right now talking about your intellectual development we talked about\nSome of your teachers are\nGoing back to when you and nine years old and then up to your time William and Mary Lou\nWilliams small you've run 'em your next great mentor Mr George with\nWith was a self taught Greek scholar and he was the greatest legal mind in Virginia he may have been the greatest legal mind\nIn America at the time I was so fortunate to read law with him for a number of years we had no law schools in my time one red for the law by working with the season practitioner like George with\nAlthough he was better than everybody else and he took me seriously as a young intellectual and it is his his message was was very straightforward he said\nEnter Mr George with George with was a self taught Greek scholar he was the greatest legal mind and Virginia he may have been the greatest legal mind\nIn America at the time\nI was so fortunate to read law with him for a number of years we had no law schools in my time one red for the law by working with the seasons practitioner like George with although he was better than everybody else and he\nTook me seriously as a young intellectual and it is his his message was was very straightforward he said Mr Jefferson you cannot be a complete lawyer unless you are a complete human being\nSo you must read and read deeply in the history of liberty and the history of constitutions and in the history of of the human aspiration for for freedom and happiness you should read as\nMany hours per day as you possibly can and who did you read ... at his direction a ... a month to skew\nAnd Dole Bach and or so and vault terror and Dr Johnson and David Hume and a Adam Ferguson and ... and\nIt goes on and on and on he said you will learn the law you'll be practicing the law so that will come with practice with the actual engagement with clients and in court spot\nBut now's the time for you to become a complete human beings so that you bring a full\nMaturity to everything that that follows in your life I don't think any gift could have been a greater one than that and so I read ... heart or maybe during my time\nWith George with then I had even a as a student at the at the college\nAnd with or was it it's hard to say how great a Greek scholar he was you know most people in my world could puzzle through some French and some lap and I won't say they mastered those languages but they knew enough that they could puzzle through them\nGreek is a whole different thing you have to really wants to know Greek it's a discipline\nProbably nobody in America in North or South America knew classical Greek as well as George with did\nAnd he agreed to help me master that language which I did that\nIs four or five or six years of of working every single day\nExtraordinary devotion\nThat they could puzzle through them Greek is a whole different thing you have to really wants to know Greek it's a discipline probably nobody in America in North or South America knew classical Greek as well as George with\nDid and he agreed to help me master that language which I did that\nIs four or five or six years of of working every single day with extraordinary devotion memorizing\nA learning the congregations that clinicians the different voices in moods of the Greek language it's a different alphabet so you have to overcome that first but uh it's it's not Latin Latin helped create\nModern languages including English which has an enormous number of Latin loan words Greek is is another world entirely but it's worth it let me tell you it's worth mastering ancient Greek if only to read Homer\nIn the original Greek but that's just the beginning of it and and this could never have happened to\nMe if I had gone to a law school of your sort or if I had um red law apprentice for the law with a a typical Virginia attorney of some sort\nYou are credited with a several times in your life providing lists of suggested reading for particularly for young gentleman\nYes this was from the ... gave me great pleasure and then people would write to me and say\nWhat'd you I'm a man of moderate fortunes I have a following budget to spend on books would you would just sort of be willing to recommend the course of reading and and and and the additions and translations and so on the books and I would drop everything to do this this was one of the happiest things\nThat I ever got to do and if you read those lists they're very daunting because they essentially say read everything of and hear the additions and ... you should purchase a four passes and Cicero into cities in Bolivia and Caesar and ... and ... and\nOn but I enjoyed this very much I always broke the budget of of the person who who who who asks these things but but you know I I guess I Want them to just to pause here to to say something that I think people in your time need to know which is that\nThanks to Gutenberg\nThe best thoughts of humankind can be routine\nHere the additions and ... you should purchase a four passes and Cicero into cities in Bolivia and Caesar and solace and\nAnd ... and so on but\nI enjoyed this very much I always broke the budget of the person who who who who asked these things but [noise] but you know I I guess I Want them to just to pause here to to say something that I think people in your time need to know which is that thanks to Gutenberg\nThe best thoughts of humankind can be routinely and relatively inexpensively disseminated if you go to Britain college Oxford the oldest library in\nThe city of Oxford the the giant Foley ills are literally chained to the wall because books were so rare so expensive that they that they could not allow students to smuggle them out so they changed them to the wall all along comes\nGutenberg\nAnd tedious manuscript copying by hand is replaced by movable type by the time I was a young Virginian we hadn't cheapen the costs of printing enormously and and really it was the first time that something like a mass market\nOf them could be said to exist and so we have access to books\nI mean most people before the reformation had never held a Bible in their hands had never read the Bible in a vernacular had never read the Bible in Latin this came through\nPriests most people and tell the seventeenth century could never afford a book\nOr get one if they could afford it and if they got one that would be some tedious biblical commentary or or or something of a very\nLittle actual human utility\nThe book is the most revolutionary tool that the world has ever seen you can sit in a coffee house and there can be ten people there and each one reading a different book each one therefore\nWith a different argument with a different vocabulary with a different style a different author a different point of view a different sensibility up by reading books we can expand\nThe size of our mind um exponentially and we can expand\nOur horizons and see things that could never be understood if you just live your life for a moment to moment in the ...\nIn a coffee house and there can be ten people there and each one reading a different book each one therefore\nWith a different argument with a different vocabulary with a different style a different author a different point of view a different sensibility of by reading books we can expand\nThe size of our mind um exponentially and we can expand our horizons and and see things that could never be understood if you just live your life for a moment to moment and the president\nAnd so I think in your time people have begun to think less of books for some reason I Would urge you all to reconsider that because of the book\nI said the book is the most revolutionary tool of all because now that it's cheaply produced it can be smuggled into despotic regimes\nAnd once the bill of rights or the universal declaration of rights and France or the constitution of the United states or John Locke or Isaac Newton once these volumes maybe ... decimal maybe an October\nCertainly in court shows these are small enough to be placed quietly and one's luggage and they get into some\nTyrannical culture and when people have a chance to read the truth the truth as exhibited in lock second treatise on government or bowling Brooks and criticism of of received Christianity they will never rest once people have access to the truth\nThey will never arrest and those cultures are going to be reformed and liberalized\nI Do have a list in front of me I'm not sure it's completely accurate but some of these lists have survived\nAnd I noticed that they they are neatly categorized in ancient history philosophy literature or a politics religion science um and there are a number of titles that a dive recognize there are many\nThat I Do not recognize that I did recognize that you have a on this list to looks by Benjamin Franklin Franklin was our greatest scientist one of the titles is on electricity the other is a historical review Pennsylvania\nI recognize there are many that I Do not recognize that I did recognize that you have a on this list to looks by Benjamin Franklin Franklin was our greatest scientist one of the titles is on electricity the other is a historical review Pennsylvania\nAt the storm thank you very much Mr Jefferson that cannot be a fraud sir\nWe're going to take a short break we'll be back in just a moment\nAnd listening to Thomas Jefferson\n\nThe storm thank you very much Mr Jefferson's that cannot be a fraud so\nWe're going to take a short break we'll be back in just a moment\nYou're listening to Thomas Jefferson [noise]\n\nOn behalf of all of us here in Ninety One point five tier cc thank you for your support during our fall membership drive your financial contributions will ensure that Ninety One point five here cc provides accurate news and analysis music entertainment today tomorrow and the day after we could not do this without you thanks\n[noise]\nMm\nMm I Am ... king and you're listening to Ninety One point fine K. R. movie\nProgramming on Ninety One point five K. R. C. C. is supported by the Colorado Springs fine arts center at Colorado College presenting Virgil or tease revolution rise against the invasion reimagining the sixteen eighty ... five hundred years later on you know Colorado College dot edu slash SAC\nWelcome back to the Thomas Jefferson our weekly conversation\nWith President Thomas Jefferson end [noise] your weekly conversation [noise]\nWhat's your creator of the Thomas Jefferson strictly Jacobson hands you're going for\nMe now David I have to say Jefferson was taken in by the the literary hoax the law should we now know that it was all fraud let's\nBegin at the beginning which was he is a young man how he began to become famous reader that he was\nHe was this brilliant young man hungry his father died when he was fourteen his father's last which was the Jefferson be educated to the fullest extent of\nWhat the colony of Virginia cut off for a job or something that took that very seriously worshipped his late father and he had a natural capacity for learning and he did it in in in a way that makes you almost shake your head to think of how deep he was into it\nI couldn't help but wonder how much different he might have been had\nMan how he began to become famous reader that he was\nHe was this brilliant young man hungry his father died when he was fourteen his father's last wish was that Jefferson be educated to the fullest extent of\nWhat the colony of Virginia could offer Jefferson that took that very seriously worshipped his late father and he had a natural capacity for learning and he did it in a in a in a way that makes you almost shake your head to think of of how deep he was into it\nI couldn't help but wonder how much different he might have been had he not met William Small or\nGeorge with I think that he would have still been extraordinary because he had really good training you know his father's last wish essentially\nAnd then the the Scots I'm angry and professors that he had these teachers that Mr Douglas and and the Reverend Mari were were excellent\nJefferson's able to be a little critical of them because he's Jefferson but he he was getting a good education he almost certainly would have gone to William and Mary and even if William Small hadn't been there he probably would have had a a good education there but\nHe was a man who was who I think this is really important he was open to the idea of a mentor\nYou could say he was even looking for a father substitutes but he was open to the idea of a mentor and he was it it was impressionable you know when he would say he was a thing of wax and that these great men with them and William Small shaped him they stretch this wax into a young genius approve\nOf that is how much he put into becoming a mentor later in life\nHe took that role as you as you rightly pointed out on the program and he took that very very serious people that have\nRelished it was like you know an escape almost the way he talks about it the greatest funny could as\nWell he's a lucky and so he believes that man a human being as born with a blank slate the ... of the ... we don't have any preconceived ideas there is nothing platonic rolling around in our heads we can be anything that you and it's like this idea of giving me this young mind and I'll turn it into anything you want\nSo Jefferson thought give me young minds and I will create ideal American agrarian intellectual libertarian Republicans out of them and he just he just so thrived on being the\nTeacher the mentor to others he let people that he trusted like James Monroe\nActually go into his library into his private suite of rooms at Mount a cello and and have um freedom of his library which he was very I'm skeptical about doing with pure strangers\nWhat we eat and we didn't talk about that but\nAnd I'll turn it and then anything you want so Jefferson thought give me young minds and I will create ideal American agrarian intellectual libertarian Republicans out of them and he just he just so thrived on being the\nTeacher the mentor to others he let people that he trusted like James Monroe\nActually go into his library into his private suite of rooms that model cello and and have um freedom of his library which he was very I'm skeptical about doing with pure strangers\nWhat were you know we didn't talk about that but you know it said that he owns somewhere between nine and ten thousand books during his lifetime that's even given you a run for your money I\nThink well you know but his books mattered minor just\nThrow but he also lost libraries\nHis first one burned with the the shed wildfire in Seventeen Seventy on his second one the great library he sold the Congress and part of the deal was\nAt the center every book he couldn't you know to like pick out eight hundred that he wanted to keep you had to sell all of it and so\nHe did keep a couple of it but if you in referencing\nThis you know he sold his sixty five hundred volume library to Congress and\nWrite a teen fourteen but when he died he he ... the year before he died he drew up a catalog of all his books for the library of university lumped into that and at that point he had\nSixty eight hundred and sixty volumes so he had more than when he sold any but\nDavid thing of it this way if you said to me I have about twenty thousand bucks now if you said just take your iPhone\nAnd go down and take a picture of the spine of each one I wouldn't do it Jefferson wrote catalog after catalog after catalogue of his books that's all ... graphical material\nYou have a I I don't believe for one moment that was worked for Jeffrey\n... say he loved it but he must have been type a on steroids to think that's interesting because\nI mean just think of it he has a let's just say that he has his second library of about sixty four hundred volumes\nThat's each book is entitled to a long biblical graphical notation\nAndy's cataloguing them so he's saying this one belongs in history and that one's mathematics and that one is a religion so yeah this bay Coney ... apartheid system of classification reason memory and imagination and he he just love doing this sort of work if you said to me I'll give you\nFive hundred thousand dollars of you catalogue your library by Christmas I'd say and what is my second prize you know what if I catalogue ten bucks\nThat's each book is entitled to a long biblical graphical notation\nAndy's cataloguing them so he's saying this one belongs in history and that one's mathematics on that one is a religion so he had this big Tony ... apartheid system of classification reason memory and imagination and he he just love doing this sort of work if you said to me I'll give you\nFive hundred thousand dollars if you catalogue your library by Christmas I'd say\nAnd what is my second prize you know what if I catalogue ten bucks by Christmas\nOkay she'll be four we go to this week's essay which is coming up and it's just a few minutes let's go back to the beginning in your ear almost I felt like you were on the verge of apologizing for this episode of uh the Scottish poet did you learn to pick that up there and\nYou know so there have been a lot of really interesting hoaxes hoaxes are really an extraordinary thing because some humans go way way way out of their way to convince others of something that's not true and here's McPherson James McPherson\nWho we now know invented\nCaution and he did it so well that a lot of the world was taken in by it and it took it took some very powerful skeptics like Dr Samuel Johnson one of my heroes\nTo see through this and to denounce McPherson but Jefferson was just the exact sort of person who would be swept up in this because he loved the idea of a new discovery\n... it really didn't matter to them it whether it was authentic or not at some point it may be ... dead\nThere's a great book on this subject by Andrew bursting about Jefferson sentimental ... and how um susceptible he was too harsh in now\nHe never as you said on the program on earlier part of the program he never got the materials he he wrote McPherson his brother and said I'll pay any price bearing the burden right in the blank check borrow money you name it I just want everything you can put in my hands relating to\n[laughter] make for some couldn't couldn't supply Jefferson with the apparatus that he wanted but imagine if he'd gotten that Germans and would have gone to what it's about a year doing everything we didn't talk about is how\n... popular all of this was you know today we live in a time when what when's the last book that that rock the world I Can't think of one you know the ... that doesn't happen anymore but\n... brother and said I'll pay any price bearing the burden right in the blank check to borrow money you name it I just want everything you can put in my hands relating to\n... [laughter] ... couldn't couldn't supply Jefferson with the apparatus that he wanted but imagine if he'd gotten that generous and would have gone to what it's about a year doing everything we didn't talk about is how\n... popular all of this was you know today we live in a time what's when's the last book that that rocked the world I Can't think of one you know there that doesn't happen anymore but there but at this time at a book could rock to the world\nAnd so it did and there was just enormous excitement about this the closest thing I can think of David is is when\nAbout Twenty years ago I'm I'm a German magazine published the last diaries oh sure that they turned out it was a fraud but the world was taken in for a time and then there was this it was breathtaking everyone wanted access to this\nAnd they were going to read this and this was going to be your show us the inner life of about off Hitler and and it was going to somehow explain everything that happened and then we find a ups\nIt's a literary fraud and it it produce just gigantic embarrassment in historic graphical circles\nIt's always fun to bring up books with Mr Jefferson it's kind of like a sucker punch she he you know you're going to have an interesting conversation with and we need to bring this conversation to a close um because it is time for this week's Jefferson watch but before we do I just thought you might want to\nTo things W. R. I. R.\nAnd independent public radio station in Ninety seven points ... than I was there giving a talk and they contacted me and said what I come down I was thrilled inside that they picked me up at my hotel we went to the station that's in this is this funky ... old building\nI'm On this and the interesting part of of Richmond and we went I did a couple of programs with a\nReal sunny Gardner a who is a an on air personality we had lunch and I just it's so much what I admire it's in a truly independent public radio they're all they said that I'm the than we are the second most popular\nNational program on their station out democracy now has gotten ahead of us I said well we'll deal with them but it was fantastic and and let me say apropos books the two humanities retreats at Locke saw lodge in January one is uh\nAnd the interesting part of of Richmond and we went I did a couple of programs with a\nWell Sonny Gardner a who is a an on air personality we have lunch and I just it's so much what I admire it's in a truly independent public radio they're all they said that I'm that than we are the second most popular\nNational program on their ... democracy now has gotten ahead of us I said we'll we'll deal with them but", "show_name": "Thomas Jefferson Hour", "year": "2018", "city": "Colorado Springs", "day": "07"}