{"month": "10", "state": "CO", "station": "KRCC", "content": "\nProgramming on Ninety One point five K. R. C. C. is supported\nBy Colorado College offering an experiential education from cc classrooms studios in laboratories at the base of pikes peak to access to the nearby mountains in urban centers Colorado College dot edu\nThis is southern Colorado's NPR station to your C. C. K. R. C. C. H. D. Colorado Springs the ISI see law hunter key CCS dark for all and K W CCF them would\nComing up this week on the Thomas Jefferson our we speak to the author Joseph Ellis about his new book American dialogue the founders and ... you know his story in the early national period of American Life has done\nTell us about his new book American dialogue the founders and us no historian\nOf early national period of American Life has done more than just enough to get us a sense of what it was like that and what were the challenges what were the opportunities the different types of personality that went into the mix was not a monolith and Alice is maybe the most spirited prose stylist of all the historians of that period\nAnd we get painted in his introduction he writes indeed if I read the founders right their greatest legacy is the recognition that argument itself is the answer Alice is interested in four of our national figures from that Arab particularly Thomas Jefferson\nJohn Adams James Madison and the first president of the United\nStates George Washington and he uses them as a springboard\nTo wrestle with the internal problems of American Life so join us for all that and more\nOn this week's Thomas Jefferson our\nCitizens and welcome to what Jefferson do\nOur weekly opportunity to discuss current American events with President Thomas Jefferson who is seated costs for me now\nThe gates you Mr President your day to use citizen Mr President we got a letter from Dan grown of Richmond, Virginia right in your neighborhood and he is asking about\nThe founders who read the histories of ancient Rome and how they use that knowledge when deciding how the American government should be structured could you answer that sure\nYes it's a rich topic and the more we talk about it the more we can understand my generation the founding fathers what we intended what we what we feared so all of us were well educated in the ancient world it was the center of any curriculum them\nAnd this involved the Roman republic from its beginnings and five oh nine B. C. to its end or during the reign of Julius Caesar the civil wars that ended the republic and then the coming of the Roman empire and all that that meant and then the collapse and fall of the Roman empire you know given his book the decline and fall of the Roman empire was one of the most important books\nOf the Eighteenth century he was my exact contemporary in the first volume of that book appeared in Seventeen Seventy six so this was our obsession and what you can learn from it as a couple of things first of all\nIt takes character to lead a great nation ... lives there about character and people like solar\nThe great nation if you read Pluto marks lives\nThere about character\nAnd people like soul in in Greece or Kato and Cicero in Rome\nBut the the notion is that it takes a a person of extraordinary virtue and a commonwealth vision and moral courage\nAnd a deep understanding of what's at stake to lead the nation and so all of us all of the founding fathers were kind of pattern themselves in one way or another after characters\nOut of ... so there's there's one element to it and another is that\nThe Roman republic was the was in a democracy and anything like a modern sense of the term but it was the only culture of the angels world that really tried to understand that the people had sovereign rights and that the people matter that the people's will somehow\nBe enacted and the Roman republic collapsed and so when we were building our own republic\nBack in Seventeen Seventy six or Seventy and eighty seven\nWe understood what could go wrong because we'd seen it in the pages of Cicero we've seen it in the life of Julius Caesar we saw it on the rise of Augustus the first of the autocrats\nOf the Roman empire and so we had this kind of mirror as ancient mirror that was held up to us and it said\nIf you study this you'll know what can go wrong and maybe you'll be able to prevent it\nBy building and more checks and balances and about our constitutional system for yourselves and so so for us dangerous world wasn't just something that's interesting that happened a long long long time ago it was the most important lens through which we could look at our own experiment\nHe asks if you perhaps looked at it through rosy colored glasses or did you understand the Roman problems of poverty and brutality that that we do today of\nWe understood this because that part of ancient history has written about brilliantly by a range of different authors live ie the greatest of the Roman historians\nAs I say ... lives are about good leaders and bad leaders corrupt leaders and virtuous leaders people for whom power becomes too intoxicating people that are war mongers people that ... that have great ideas but don't have the intellectual courage and the moral courage to see them through\nA so it's not just a a kind of a um a rosy ... view of of of a world that was um that never existed we understood the strengths and weaknesses of the Roman republic\nOf a world that was um that never existed we understood the strengths and weaknesses of the Roman republic very we're very well indeed and we understood mob rule and the lack of true representation and the economic problems of distribution that just rocked\nA the Roman world so we were not in any way naive about this I think you could say this we were naive perhaps in believing that there was a one to one parallel between what happened back then and what was happening to us after all Rome was a a city state on a peninsula in the Mediterranean\nWe are America with the west that goes on and on and on to the Rocky Mountains and probably to the\nPacific coast so you would encourage Americans of my time to study Roman history\nYes and uh the way to start is to read the lives of the Roman leaders in to target they're short\nThey're highly entertaining and they are tremendous window on the nature and problems of leadership\nThank you very much to do when you are welcome\n\nIn this critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR in the Ninety One point five ... newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidate\nBut quality costs money at the nonprofit media organization we looked directly to you to help pay the cost of our survey have\nBecome a part of the team contribute at K. R. C. C. dot org today thank you\nDay citizens hand welcome to the Thomas Jefferson our your weekly conversation with or allowed president Thomas Jefferson host David Swenson unseated across for me is the creator of Thomas Jefferson our Mr clay jak it's good to see\nThe see my friend I bring you readings from our friends with my cello and today I don't want to spend very long history as we want to get to an interview with my favorite historian and I know yours to Joseph\nJay Ellis formerly of Mount Holyoke author of many books the winner of the Pulitzer Prize winner the national Book Award and now the author of a new book just out called American dialogue of the founding fathers and I said it's a rich\nAnd wonderful conversation we don't want to get in its way we do need to hear about a month to cello I Know you were just there and uh I I Would I Would like a report sir I've been to ... maybe fifty\nTimes in my life uh this time I was invited to come do two things I gave a\nA a long talk although I was moved indoors because\nBe fifty times in my life ah this time I was invited to come do two things I gave a a a long talk although it was moved indoors because of climate weather and then I gave a I'm a desert\nTalk at a meal for special patrons of of the foundation in the entrance lobbying the entrance hall I'd ... cello and let me just say\nMy dream through my whole adult life has been to go to dinner Marcelo very I now have [laughter] I went to dinner at my cello and you're in the entrance hall and its low light and you just feel like you are in a magical precinct\nTo kind of sacred space and frankly I never thought that this would happen to me because I'm a guy who dresses up in tights and\nAnd so on and so forth but it was great and and I I got a chance to talk about the objects in the entrance of all it's what in the enlightenment was known as a cabinet of curiosity is a kind of private museum and Jefferson was greatly fond of of displaying do all visitors\nThe things he cared about and then my living room as you know in my house is a kind of a cabinet of curiosity I boss to people and paintings and microscopes and so on and so forth\nUm that's what Jefferson was doing and after Lewis and Clark came back he called it as Indian hall\nAnd there is one and only one Lewis and Clark artifact I had my cello and that is a set of el ... the rest as men dispersed and and lost a because there was no National Museum and so it was just thanks for that Mr Jeffrey ... he was a strict construction is instead of until we pay off the national debt we cannot have\nA National Museum of the United states and so for me to go there was just such pure joy David and I wish you could have been there to see it because it is you know it is a uniquely\nWe can be with you wherever you go how you need is your phone getting Ninety One point five carried the mobile free at Google land in the ice storm\nOn Ninety One point five or CC's supported locally by the Colorado Springs school hosting a pre K. through twelfth grade open house and school showcase\nDeported locally by the Colorado Springs school hosting a pre K. through twelfth grade open house and school showcase featuring the arts sciences and family entertainment Saturday November tenth one to four pm more at the S. S. dot org\nBy Ninety One point five ... summit club members who have dedicated twelve hundred dollars or more and supportive are award winning coverage of life in southern Colorado information about joining the summit club at K. R. C. C. dot or\nWalking by Thomas Jefferson are we're having a conversation with Dr Joseph Ellis author of many extraordinary books on the founding generation including the award winning founding brothers this time about his latest book published in October of twenty Eighteen American by law\nThe founding fathers and less than we have a bunch of questions to ask about one let's let's return to the conversation [noise] so here's the great jokes about\nWhat I'm saying it was a sad and pathetic spectacle and then you go on to say that Jefferson wanted so much for us to be a Republican\nOr a unique experimental government in which the people were actually solve room and to an extent unprecedented in human history govern themselves and the the greatest architect of that vision\nAnd the second half of his life and particularly in the last two decades actually gave his mighty energies to the self destruction of that very concept because he was so paralyzed\nBy his racism unbiased complicity in slavery that is such a powerful argument\nIn Jefferson envisioned the civil war in his mind as a possibility but he believed that it was the north that was causing that potentially occur by insisting on slavery as an as an institution that had to be\nRemoved and um and Jefferson said\nThis is a threat to the chapter I guess that I too expected slavery and and I believe it is incompatible with the values of the American revolution\nHowever it has to happen in a certain way if for it to work and one of the ways that it has to have it as each state needs to decide this on its own\nBut secondly we need to have a plan to remove all the freed slaves from the continent of North America or from the United states um before we implement any ...\nAll the freed slaves from the continent of North America or from the United states um before we implement any kind of emancipation plan\nYou've been at this for a long time and when I first met you or we were up the American around the corner in society and then we were income burn shop in New Hampshire\nAnd at that time you were I think it's I Hope I'm not miss characterizing you were you were less severe about Jefferson than you have since become so can you tell us a little bit about the trajectory of your historical thinking on this subject\nSevere is probably not a wrong word I don't like it but I I I understand why you use it\nThat I'm at the time I wrote a\nAmericans things when you and I got to know each other and weed coke consulted with Ken Burns on his documentary I keep things have changed one is that I've become more aware that I was the end\nOf the\nExistence and pervasive influence of race in America I thought we were on a path after the civil rights movement that would gradually and inevitably carry us to some form of bi racial justice\nMy ironically that\nThe civil rights movement and the legislation of the early sixties civil rights is access sixty four and ... merely said we're going to actually implement the decisions we made after the civil war and the fourteenth fifteenth I met\nAnd we just waited a hundred years to do it um but that in that sense I thought that Martin Luther king was right when he said that the arc of a moral universe or moves towards justice and I still think that's true and some long term sense\nBut I think that the real pattern in America is backlash and we're in a ... black lashed moment\nStart this book Joe are you in your introduction it's almost as if you're\nA I don't want to say making an excuse or apologizing but ... you're using history then and now which is kind of different for you yes and the introduction ends with given the current condition is a deeply divided people my hope is that the founding era can become\nA safe place to gather together\nNot so much to find the answers to those questions as to argue them indeed if I read the founders right\nSafe place to gather together not so much to find the answers to those questions as to argue them indeed if I read the founders right their greatest legacy is the recognition that argument itself is the answer it sets the book up quite well sir well\nThat's what I really believe and um I think the first ... the ... process or whatever we call it in the book I'm Talking to the reader and saying that I'm going to do something here that I haven't done before and that professional historians aren't supposed to say that they're doing\nProfessional story than I Am a professional historians car yeah you are [laughter] um that were trained to to say and believe that the past as a foreign country\nAnd we're like anthropologist moving through time you don't want to go to some mow and say how come you guys aren't practicing the child rearing uh procedures of doctor Spock okay [noise]\nUm and similarly historians are not supposed to bring their convictions and values and the president to\nBear on the past we want to go back and recovery in its own terms [noise]\nWe're not capable of objectivity because we're not mathematicians or physicists but were perhaps capable and detachment and at least that's the goal we have to get as close to as possible and therefore we\nShould resist writing from the president to stick and the word present to stick his bed term in American history and history you know like your present to stick means you're just imposing so I got to go back and look at ... percent and find out whether or not he's an evangelical Christian let's say and um\nAnd you cherry pick the evidence to find that [noise] but my view is that in that\nEven detachment is a delusion namely that we are\nOnly capable and looking back at than from now and it is inevitable\nWe either consciously or unconsciously bring our own values and convictions and troubles to that particular endeavor so that Charles beard looks back from the high point of the progressive movement in Nineteen Thirteen at the founders and what does he discover Pluto talk or see on the robber barons\nArthur Schlesinger looks back at Nineteen Nineteen thirty seven at Jackson and the Jacksonian America and what does he discover FDR and the new deal\nNineteenth in Nineteen thirty seven at Jackson and the Jacksonian America and what does he discover\nFDR and the new deal\nNo those are two great books by the way that it's their emblematic of the way in which it is virtually impossible for any historian to be completely detached and instead of saying okay that that I'm saying\nLet's make a virtue of that and self consciously identify the problems of our president and use that as a prism through which to look at the past and be honest about an open about it\nHonest you are sure I mean I I look at the book and I go back to that ... this this positive constructive statements that a recognition that argument itself is the answer and you using a this historical period you know best not a book\nYou we have chapters on a Jefferson Adams Madison and Washington\nAnd you put some pretty difficult truth about all of them and then you sort of analyze it at the end of each chapter by going to now I was left feeling very positive I thought it was very constructive\nVegetarian Jeffersonian of you I'm Glad you did that\nI think that that there are other books that have come out recently there's one by John reach him the other another from I'm Doris Kearns Goodwin that are attempting to look back to pay us from our world here in Donald Trump's uh America and what ... both of them do is is a\nIt may do quite well and I recommend books um\nThey find that optimistic story to tell the ... in a sense they say that we face great crises before\nWe get through men and and we've always gotten through and and and the the phrase that ... calls on this the better angels of our nature\nUm and I know John and I really he's not a sentimental is that I Would say to him if he were product you know that John remember he gave that speech and first inaugural march Eighteenth sixty one and the next day South Carolina seceded from union\nAnd we had the bloody civil war the last word American history hardly the better angels of our nature prevailed and that so that in some sense my cake\nIn the end is to say I'm not here to say that if you just hang around long enough to liberal conditions come save us\nI'm saying you got to know what we're really up against\nAnd injured workers and count the medical care that they need to get back to work I Believe they are cc's helped us quite a bit and we are able to obtain a lot of access to individual we normally wouldn't have access to through other means of advertising\nIf you would like to become an underwriter like me please call genetic seven when nine four seven three for eight zero one\nYour Ninety One point five care see the membership is vital we thank you for your financial support which directly funds are news music an online services at K. R. C. C. dot org programming\nOn Ninety One point five K. R. C. C. is supported by Roscoe pasta since two thousand nine serving Caribbean style pasta while striving for zero landfill waste like composting recycling and using biodegradable and compost double paper more at rock the pasta C. S. dot com\nAnd loving about Thomas Jefferson now we're talking with Joseph Ellis one of our nearest friends back by popular demand and now I'm about to begin a book tour of this country with his new volume American dialogue the founding fathers and us\nI must say too I I I was I watched er during a your extensive discussions with the festival is about the Jefferson chapter [noise] there was a bit of pain I Do feel pain you know\nBecause there's a disillusionment as I've said many times everyone who knows ... eventually becomes an Adam's light including you and to me [noise] and\nIf you want to look at Jefferson as a racist an apartheid system and that with an intellectual voluptuous area in an unrealistic guy was dreaming about America that never existed\nThat's easy to do and it's true\nIn some sense Jefferson is a nuisance because he tried to pitch our our national experiment in this in the light in the world that doesn't exist in Adams kept saying\nCome on high end nuts around lately that's how people are greedy selfish that rapacious there say actually it was a little bit more eloquent than about you know what I'm side do and this and so and so if you want to look at\nThrough that lens he's the easiest mark of all of the founding fathers because he just sets himself\nDo and this and so and so if you want to look at ... through that lens he's the easiest mark of all of the founding fathers because he just sets himself up pieces that all men are created equal these um you know given the choice between newspapers in government\nAnd all that stuff he all he sets himself up as in our time our time of profound disillusionment as a kind of many\nBut we know that's not true we know the Jefferson is the is the is the architect of the very essence of what it is to be an American that sense of freedom\nAnd optimism and possibility and that we're we're going to set the tone for the whole human project in the world and that if we get it wrong and more on the road to getting it right and education is the answer and people have their hands in the soil people will flourish in the world\nAnd we need to subdivided men subdivided again or or units of government so that we have citizen participation\nAnd citizens are up to the challenge was Jefferson's view but ultimately the people are up to the challenge and I think that\nEither one or two things I really what it boils down to his Jefferson believed people were up to the challenge Adams said I\nLooked around yeah but but they both have a point either Jefferson is right and I think he is right and we need more education and so on and so forth to make it happen or Jefferson is wrong but we still need to believe that to be America we still have to have that hope and optimism in that sense of what we can master life one of the questions\nI still enjoy that us as you said if we could bring any of these founders\nBack who would help America will save that for he and he'll say they gave us the rise of did\nBut let's go back to the question you ask before our break who is a lengthy question about the differences between Adams and Jefferson\nAt everything you just said is what I think and what I say and and my application of it is that they are having an argument about whether or not freedom and equality are compatible\nAnd whether or not the traditional distinction between the few and the many the address the way and\nGoes popularly that has dominated most of European history is going to be replicated in the United states ... percent believes that once you do away with prime agenda ... entail\nAnd once you have a ... that that's it's not an occupied by the way but it's an extraordinarily fertile ... we'll call it empty we begin with a trust fund that no other new nation ever begins in terms of the available land and the fertility of the land and the irrigation patterns of the ...\nTrust fund that northern new nation ever begins with in terms of the available land and the fertility of the land and the irrigation patterns of the rivers that cetera et cetera I mean nobody knew that but the middle west of the United states is most fertile ground of fertile land of that size in the world\nUm and no other nation has the river system in the United states does um they didn't even know that you know drivers and thought that might be dinosaurs out there but I'm master that yeah ... but that I'm\nA ... Adams is now that's all going to and then when it does I mean when we become more urban and uh one of the population increases\nUm we're going to say that the freedom and equality or not compatible and then our terms in terms of our president I mean that if you believe the market should be given complete freedom to function and you can quote pursue your happiness there without restrain\nThe net result will be oligarchy include taco see\n'cause that's what always happens in Europe and that's what's gonna happen here and he turns out to be right in the first gilded age which starts in the late Nineteen century and ends officially Nineteen twenty eight I'm\n... and ... and we're now in a second gilded age which started in Nineteen eighty and and we now have in Nineteen excuse me in two thousand H. A. we surpassed the high point of inequality that we had reached before and the first gilded age in Nineteen twenty eight\nAnd this is it's incredible to demean somebody needs to talk about this more with it\nThe nation that invented the middle class society\nNo longer and now is has the highest level of economic inequality of any advanced society in the world we are no longer a middle class society\nUm now because everybody in America is somehow part of the middle class because we're such and such a big term but that the what was the diamond has become a triangle\nAnd the top ten percent and much further up you go especially the one percent and then beyond that to the point one percent I mean the top ten hedge fund makers make five times as much money than all the kindergarten teachers in the United states\nUm and that Adams is saying the Adams does not have an answer to that problem what Adams is saying is that there isn't negotiation\nAnd that Adams is saying ... Adams does not have an answer to that problem what Adams is saying is that there isn't negotiation that has to occur between what we would now call capitalism and now called democracy\nIn in this book tour you're gonna do you're going to be on lots of media now [noise] ah ... one of the questions you really want to be asked about this book what what do you want to be liberated in your own discourse within the next three months\nI'm not just being complementary that nobody will be as good a question or as you've just spent\nBut surely you have this idea that ask me about this America because I'm ready to say this and grounded the tree\nYeah you'd asked me the the racial questions are very important and I expect to be asked them and I hope I am the income inequality too\nI'm In the current debate over the Supreme Court I expect some questions about constitutional a theory and the originalist position which has Kavanaugh's position and I'm prepared to talk about that in ways that will be provocative\nThat I think the origin list are preposterous lay wrong you Tom\nAnd um and and foreign policy which we haven't talked much about um uh it's the key figure is Washington and the ... the ... not the question I wanted to ask me is what is what did American exceptionalism means then and what does it mean now it's exactly the opposite now by American exceptionalism we mean\nThe world is ready for us to sort of decided that rule into in America has a privileged position and an obligation to expand its liberal values throughout the world\nThe founders thought that they didn't use they say we're a unique but precisely because we were a unique Washington didn't think that the model of society we had was going to be transported to the rest of the world\nAnd didn't take it was going to work in France for example and the French Revolution but the notion that we're going to sound is set up a Jeffersonian democracy in the middle of Iraq\nThat is out of the question that's never going to work and that's the view of exceptionalism they had\nAnd so let me ask you this um kinda last question about this goes to Madison because um you know in some ways Madison was the greatest of the founders he's the least entertaining maybe of the founders but a profound\nHe was Jefferson's Aristotle keeping drivers and grounded in some sense in the real world I agree with that so you're projecting forward from James Madison and these other founders take a look at us now with our paralyzed Congress or politicized courts\nWord from dreams amount of some of these other founders taking a look at us now\nWith our paralyzed Congress or politicized courts are tribalism so the idea of Newtonian checks and balances and the kind of wonderful machine that would go on itself the amount of some help to craft vacuum some of these [noise] if you looked around this thing to say\nHey what what he's saying be what's the remedy\nWell of course he's dead and be busy being dead so he can come out and talk to us but if you read him and try to figure out I mean he in Eighteen twenty nine he said I expect this document that I helped to create to last for at most a hundred years", "year": "2018", "show_name": "Thomas Jefferson Hour", "city": "Colorado Springs", "day": "21"}