{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from my dog harness dot com and no ... no poll dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to Todd walk your dog would love thousands of reviews at my dog harness dot com\nOctober Ninety eight PM hassle into W. A. M. C. performing arts studio for tickets and information visit the Linda\nDot org this is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W are you an HD Ninety point three rounds in Utica W am cage de Ninety point nine Kingston W. O. S. R. H. D. Ninety One set of Middletown WC yell HD Ninety One nine Plattsburgh WC a an HD Ninety three three ... W. A. N. C. H. D. one oh three night talk on the road got W. A. M. ...\nFive one great Barrington W W E S H da da na na ... W. A. N. D. H. D. Ninety point one Stanford W ANR eighty eight five Brewster WAMC am fourteen hundred Albany\nUn secretary general Anders voice of the concerns being expressed over the disappearance of the Saudi journalist ... ... we need to have a [noise]\nOn the west for the ... we didn't know exactly what what's happened is we need to know exactly who's responsible\nI think we need to find ways to come to ... ... is also the amount of\nAn American pastor who's driving in Turkey soured ties between Washington and Ankara is on his way back to the U.S\nThere has been building pressure from the white sauce on sucking throughout this there have been sanctions put in place but they insist that there is no secret deal but it does also leave open the possibility of trying to improve relationships\nAnd let them fine jewelry zeroes necklaces and burrows belonging to Marie Antoinette go under the armor\nI think she probably was the original if girl honestly in terms of her style and her relationship to fashion and jewelry that's all coming up after the news\nThis is the b._b._c. news with Nick Kelly the United nations secretary general has told the BBC that the truth must established about the disappearance of a dissident Saudi Jenna this does his country's comes to that in the city of stumble Antonio ...\nSaid incidents of this kind of becoming more common and the international community would not tolerate them\nI'm feeling what it does\nBecause this kind of seasons I multiply\nAnd a half so central to make sure that it's safe clearly that sees is not something that's going to have\nTo his sources say they have documentary evidence that the Saudis security team mud at ... the sound interior minister said allegations that his country was responsible what lies\nThe secretary of state Mike Pompeo has called on that encourage a quickie free other Americans in prison in Turkey after the release on friday of the Avengers nickel pasta Andrew Brunson\nJust around soon as expected in Washington based on Saturday well he'll be met by President Trump Mr Brunson friend William Devon was in court when the decision to release him was made\nThe court came back they read the sentence you're guilty but you can go\nIt wasn't until we were exit from the prison courtroom out in the parking lot of the prison we're asking our translators what happened is he going to jail let's see and they said no he's free to go so we're rejoicing we shouted hallelujah\nThe former Malaysian deputy prime minister and opposition data on ... minutes facing the first test of his return to political life ... who is ... ... this year after being jailed for alleged ... to me and twenty Fifteen\nAnd contesting a parliamentary by election today Roger Walker reports on why it bring him is expected to win\nThe by addiction in politics\nStraightening support for WAMC comes from my dog harness dot com and no ... no poll dog harness indebted to make it easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tag walk your dog would love that has ever eat eat it at my dog Curtis dot com\nBubble matching them a hundred to ... general election victory over the ... commission which should govern ... sixty years that you made a pact with the Ninety three hold up to my hot here promising to ... David the premier shipped in his ... and ... in two years\nThe Venezuelan government says it has released a political prisoner her being held for four years mostly in the country's intelligence services building in Caracas the statements that the rent Saleh who was a student leader had been freed and what's being censored Spain for treatment officials that had been released because of concerns you might take his life\nThere and saw his mother has not yet confirmed that he has left the prison announcement follows come the nation from the U.S and the UN to Venezuela after general opposition lawmaker died in onto second stances on Sunday well news from the BBC\nSearch and rescue teams in the state of Florida the market in Mexico beach the town hardest hit by American Michael\nThe storm devastated communities across the region hundreds of paper on accounted for that type of sixteen people are being confirmed dead across the southeast of the U.S as a result of the storm brought along the head of the federal emergency management agency FEMA said he expected more fatalities to be recorded\nThe Republican candidate for governor of Pennsylvania in next month's us elections Scott whack now has taken down a video from social media in which he threatened his Democratic opponent Mr Right and that was heavily criticized for a mosque he made in the video in which he threatened to stump all over his opponents face\nFor governor ... let me tell you between now and November sex you better put a catcher's mask on your face because I'm going to stop all over your face with golf spikes because I'm going to win this for the state of Pennsylvania and we're throwing you out of office\nAs to why now is well behind the incoming Tom Wolfe and opinion polls ahead of the November the ... election\nPersonal days for about thousands of workers at the U.S Defense Department has reportedly being compromised off for a cyber attack a Pentagon spokesman said that investigation launched into the hack which came off the air which came to the attention of the U.S military on the fourth of October\nAnd counter is accused of severe rights abuses are among the Eighteen ... members of the un human rights council activists have criticized the selection of the Philippines Eritrea Bahrain and Cameroon have accused the Philippines of extrajudicial killings and its war on drugs\nThat are trying to help some critics of its precedent incommunicado for Seventeen years Nikki Haley the ... the un said the uncontested election of countries with Paul records show that Washington was right to withdraw from the council\nIn June [noise] BBC News\nHello you're listening to the newsroom from the b._b._c. World Service with me I mean your competitor\nSaudi Arabia is facing growing isolation and considerable international pressure over the disappearance and alleged murder of the Saudi journalist and dissident ... the country's interior minister has dismissed accusations that Mr ... was killed inside the Saudi consulate in Istanbul\nAs baseless live now the un secretary general ... told the BBC the truth of what happened must be established\nWe need to know exactly what what's happened is\nStraightening support for WAMC comes from my dog harness dot com and no joke no poll dog hornets indebted to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to jog walk your dog would love that has ever eat it at my dog Curtis dot com\nAs happens or a\nCountry in\nAnd of course I I Believe the legal system should be able to operate\nIn order to get into the forms of it comes to believe that and that's a Saturday or a ...\n... meanwhile Turkish sources in the documentary evidence that Mr ... was murdered and dismembered into Saudi consulate in Istanbul master correspondent in Istanbul ... ... what the Turkish pressure was designed to achieve\nI think that what is happening here is that a key is leaking incriminating evidence that are on the case on the small casualty case\nThrough the text media to win western backing for the ... case as before it confront Saudi Arabia within countries ethical proof that I'm as they put into a Jamal casualty was was ... had to come to listen to sample the sex unprotected governments at the moment is still being slightly cautious officially\nFor example techies welcome to in a Saudi\nSaudi officials his techie today upon them into joins your salary in a commission of inquiry\nThoughts on this incriminating evidence that they ... they say allegations of audio and video recordings proving his nut or a all designed really got the Americans and other western governments on board to ah to give it pretty ... picking a pretty tough response to Saudi Arabia\nBut I Do know how turkey obtained or recorded this alleged the evidence\nWe ... we think it was it the most like the explanation is a techie followed the Saudi ... so that is actually found embarrassing to keep the idea that it'd be ... it would be recording ...\nCome to a diplomatic missions on its soil either way um what is far more embarrassing it won't be a a video and videos and ... a set to show which is the democracy was interrogated tortured and\nUm and then killed inside the ... the Saudis are still flatly denying all the allegations as as it at that level of against the Saudi authorities\nAnd this kind of help but Turkey's relationship with Saudi Arabia which has already been on a downward spiral\nYeah I mean it seems strange over a number of regional issues the fact that he has supported the Muslim Brotherhood that his classified as a terrorist organization Saudi Arabia the fact that I Am a techie has supported Qatar I've written blockade by Saudi Arabia and all the Arab states a techie has had a rapprochement with Iran which is the\nThis collection has been in the family\nSince she owned them there are records of her wrapping the jewels the night before she went to prison her last night of freedom was spent sort of caring for these chores and sending them back to first I think Belgium in Austria where she was from\nThe passage of time Alston reduces complex historical figures to caricatures she probably didn't say let them eat cake but these precious stones in pearls prove Marie Antoinette was plenty familiar with carrots\nJohnson Savage and a reminder of our main news the United nations secretary general has told the BBC the truth must be stabbed us about the disappearance of the Saudi journalist at the country's consulate in Istanbul\nUs secretary of state desserts turkey to free more detained Americans after an evangelical pastor was released on the former Malaysian deputy prime minister and opposition leader on where you bring up is running in the ... election the first draft of his return to political life\n\nAbout NATO still run high in Serbia almost Twenty years after the bombing campaign which severely damaged the capital Belgrade\nThe airstrikes successfully for service president at the time Slobodan Milosevic to withdraw troops from Kosovo and allow international peacekeepers and\nBut this week Serbia hosted an exercise organized by NATO's disaster response coordination center and the country's president Alexander ... says it's time for a more rational approach towards the alliance or Balkans correspondent God the law and he spoke to him and they drove secretary general Jens Stoltenberg\n... anything they did\nThat in on the other night I mean you're not in it and say that\nA lot of people like to describe Serbia it's a traditional ally of Russia well they'd be surprised by the ... and ... about an hour outside valid right\nBehind me there are rows and rows of disaster relief personnel from all over the world I can see balls and yet Croatia Finland Greece Italy Hungary Pakistan as a stage set up with the flag of NATO\nAnd the twenty nine member states of the alliance and the low guy that with the flags of Serbia and they type and the slogan Soviet twenty Eighteen disaster response exercise\n\nStraightening support for WAMC comes from my dog hurt is dot com no joke no poll dog harness that did to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tag walk your dog would love that says that reviews at my dog Curtis dot com bubble\nYou ever heard of fries with our corporation and I think it's all about emotional issues mainly because of nine to nine to nine and because of course we sure this is something that we need to work on the really do improve our corporation and that's what you're going to do in the future [noise]\nBoth sides are pains to emphasize the no military nature the exercise NATO secretary general Jens Stoltenberg insists that he respects is longstanding policy of military neutrality\nBut there's been much turbulence in the western Balkans recently from allegations of Russian interference in Macedonia in Montenegro to the election of a subset protest to the presidency of Bosnia\nMr Stoltenberg says that means that makes sense for NATO to strengthen its cooperation with sub yet\nThe partnership with sugar has become more important is the fact that we have seen some tendons is towards are turning to the vet is Jerome nationalistic rhetoric of the ... and we have to avoid that and to avoid going back into will do so on and then on to not just with wars killing of civilians suffering\nOn really really a dangerous situation into also what's the Balkans [noise]\nTake a walk around unveiled right out of the the the the people here and find it hard to change the views of NATO I'm standing in front of the mural which to take that stealth fighter and blaming Belgrade skyline underneath the slogan Serbian never in nature\nAround eight and ten savvy and say that opposed to joining the alliance and difficult to see that shifting [noise]\n\nCalls the disaster response exercise could also be taken at face value rather than a sign of any shift in allegiances the but the twentieth anniversary of the NATO bombing approaching it does seem that relevant recriminations reconciliation maybe in the ...\nGuide to Loni police in Berlin expect up to forty thousand people to take part in a demonstration later today against the shift to the right driven politics and society the rally is taking place at a time of increasing unrest over migration policy in Germany as our Berlin Correspondent Jenny Gold reports\nThree years so I'm going to knock on welcomed refugees to Johnny subjects migration still bring citizens onto the streets in protest violent alright demonstrations in the city of cabinet made headlines around the wild this summer\nToday tens of thousands of people are expected to gather in central talent to demand an end to what they describe as the politics of hate and discrimination and it's one of several recent mass protests against the infants at the far right on John in politics and society\nJenny let's return now to the story of the missing Saudi journalist and government critic Jamal ... it was very much thrown into the spotlight how difficult it can be when ideologically disparate nations do business the close relationship some western countries have with Saudi Arabia\nFor example is being criticized but conditions of forward to put moral judgments before politics\nSimon Henderson is a fellow at the American think tank the Washington Institute I asked him if there is such a thing as an ethical foreign policy\nMy goodness that's a big question depending on the country ... that will and should be\nStraightening support for WAMC comes from my dog harness dot com I no ... no poll doubt harness invented to make a lot easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tag walk your dog would love that is every idiots at my dog hunt S. dot com\nBoom because you're having to define what is ethical me and also because the whole nature of foreign policy is often compromises\nTrade is an important part of a relationship\nTrade means jobs and it's not just the smog satisfaction of knowing that your rights and discovered somebody to be wrong\nIt might mean somebody living fifty miles away from you lose his job because a trade deal is in peril do cancelled so it's natural that they should be the source of concern\nBut I Believe the ... case is more than just your average sort of diplomatic crisis this is a huge diplomatic\nCrisis in\nTerms of the U.S Saudi relationship it may be as big as the nine eleven crisis now on the level of ... seats those new equipment whatsoever but in terms of the crisis is to present to the bilateral relationship I think this is great\nLooking at it from the other side of for Saudi Arabia this all comes at a very\nCritical time as well because Trump prince Mohammed bin Salman has been trying to portray himself as a modern others reaching out to the rest of the world who was in many ways complimented by President Trump at the U.N General assembly in his speech there how does this affair affect his reputation\nWas I think might have had been sound mind trick creation as in the balance he has been a minute for trying to change social\nRestrictions in Saudi Arabia applauded for his efforts to modernize the economy of Saudi Arabia and shifted away from its overly dependent physician in relation to oil\nBut he doesn't want any\nWider political participation and he wants to make sure all the credit for these initiatives comes to him\nNow we don't know what's going on or what do you go on and we're still trying to work that out we think or fear that ... has died in this in ... and\nThe idea that along with these good points to a hundred percent and sell them on their sense of social progress\nIf as a sideline he ordered his his security forces or is it intelligence services to capture a critic and it wasn't even a huge critical feature aging but to capture him to torture him to tell him to this man but em\nThis I think is causing and deemed\nCos should cause a time at least for reflection if no and huge re examination of who the hell is in the U.S wants to see about\nAnd can we support to him on some issues which is seen as being progressive while total racing or to appear to be some of the gossip the crimes which puts him in the same league as outside in Syria Saddam in Iraq or Gadhafi in Libya\nSimon Henderson subtlety Americans think tank the Washington Institute speaking to be there and the United nations secretary general have told the BBC the truth must be established about the disappearance of the Saudi journalist ... of the country\nStraightening support for WAMC comes from my dog harness dot com no joke no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to Todd walk your dog would love thousands of reviews at my dog Curtis dot com\nSo one of the things that they were ... or ... and\nDuring nine or ... retelling tries to post tightened details to take a picture for some of the things that have no chance he's talking about individual\nBut also ... as well so it's a north shore fishing for gave information Donald doesn't depletion targets in many ways\nPull told us about the group successes and recovering bikes\nFind by people start Web hosting a bike I Know and also intelligence coming in one of them led to I'm a recovering by trying to sell for ... I'm a member of clean told us that I've seen her bike in a particular area I turned up tropical area\nTo ...\nAnd News St Louis is around in there and spent to inform and\nJust happened to her to bike in the background for all\nCan read out she was going I didn't quite ...\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com [noise]\nThe next morning we went to meet another couple of preschool Facebook activists who've taken quite a different approach to ... these ... like ... the day before a motorbike fanatics but that's a can direct action against the seas\nWhen I'm sleeping assistant who are both work in a way to go [noise]\nI said why she likes it lost my boys are [noise]\n[noise]\nThis is Martin along with his ... he runs a Facebook group called ... motorcycle recovery preschool they hunted down stolen motorbikes and get them back to the onus free of charge\nDominic ... telling us why he's created what he calls them ...\nAbout my boat stowed a lot inside his bike stolen and we know exactly why it's so it's like it's not like getting your car stolen it's nothing like losing a limb\nMartin and Dominic say they've invested as a one child in three hundred dollars in the running of land that they use for scouting and returning stone in motorbikes\nSo you'll lose such the local area ... with these could potentially put most of the night we jump into the ... it's like stop my mission\nWhich I'm not into a whole side of northwest so\nTo treat to die in the end of his ... birthday is feeling like a farm scenario big green area where they can just right through to get over from the police or anything like that and I said ... died on the way you know that's all the way and then when the um and\nYeah there's a law bikes are dumped by herself as has been nothing report ed\nWe're going to go to the usual ... see what we can find Diana [noise]\nThat is where where they get into the ground said start at\nThe end the tree on the left on site near misses where I'm going by [noise]\nWe arrive on a dusty ... you just signed by a growing brambles unnatural Bush is going to ... stop proof vests just in case they encounter any actual sleeves and tensions rise\nAnd it's like ... I'm Still do them\nWill be the remains of an old bike become diner before\nAnd the way you cut his little bike is because there are some are lonely at our site for an ignition\nFor free or the back of a sea some are so yeah you could literally see in Iran you know it's just everywhere\nLike there's always sold by part same with it and and yeah they they just literally bought both left to people's bikes publicity engine that gets taken away and destroyed by\nThe rest of the ducks the rest of us just woke up is left of your bike thousands and thousands of pounds of investment exactly for the oldest [noise] sinks into the floor\nIt's really sad to see him once magnificent machine reduced to a black puddle of plastic on a dirt track but even when many can Mountain Dew managed to find a stolen bike walking and in good condition sometimes the unique relationship between the owner and the bike has already been damaged\nThrough a biker spices like dismisses someone's pinched it and Stoller wrote it rise you don't want to go there again this is a fish cheated on his or her fingers\nKnow [laughter] you just\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nLease the ... most of my community the bike stolen oh it's like ...\nIt could go a couple of ways where they are I mean some of the ... the search for the fight ... fight in the ...\nOf it and not someone one of the five members may just spoke bike that looks don't you you know post on there for a week or riding ... we've been doing this ... or by parents we know it's something that started like we we know that we wouldn't apply that\nDon't make as much and I came to stress that\nThey operate within the law and wish peace Corp just said that if they are recovering the metabolic from a low risk place they call the police tracked down and ... just to keep her using their insurance details\nAnd then take it back to the owners address if it's a high risk area they removed a bike fast and then followed the same procedure\nAs we keep walking down the track we spoke more more black patches on the ground motorbikes had been melted rock the way down to a small plastic pub [noise]\nMoments ago while Romney by two of her [noise]\nAnd you said oh well we saw\nTerm and his wife is\nThe smallest by how many you know I mean there's been several parts them at least ten probably more like twenty different by [noise]\nWe keep walking around the track\nGrumbled Bush's stretch as far as the eye can see occasionally we hit patches of graffiti on the side of small wars but despite walking and walking walking we don't see anyone else it feels like this is the setting for film\nAbout and and the cat in the white ... humanity this is real and if they stuff\nAnd then surely would decide to walk back out of the white sand and try something new\nAlthough we haven't found an intact stolen motorbike yet I'm curious how Martin and Dominic identify up like there's been next\nGemini ... off with the voice of intended never knew one of our service\nIs what I was terminal so Germany the first thing that we just drove\nThat it would be looking for the ignition there's ignition inside this really great and you're falling through and then you see if there's anything ... ... ... ... I Know joined the water's together to yeah start for\nTrial [noise]\n... [noise]\nUm [noise] it was his insurance numbers case yesterday about them all number play on the north insult anybody from Robin in another place from a different story is legal\nOne of the biggest issues they highlight where the current formal recovery process is that the victim has to pay a fee to the police to get their bike back which can cost of a two hundred and twenty dollars they say that own collection system means of victims don't have to pay a penny\nA one putting all ... they bring a folder full of pictures of bikes to help to recover for free they probably explain that these images of most monks that they've cut down I'm recovered and it doesn't seem to be a threat to any of the ... some of the bike she knew some are old some of the expensive\nStraightening support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com interesting hundreds of pounds\nOf one income\nMicah white ...\nYeah well you need the frame and an engineer or what\nOf their cars you of that\nWe spend the afternoon driving around from ... to ... investigation punks Bush's homes [noise]\nWith little success\nBut these volunteer groups are having a big impact on motorbikes left in Bristol police say they've contributed to around four hundred fewer bikes being stolen for twelve month period compared to the previous year\nThe hunter don't even know to buy is drawing to a close we make our way down from the side of a hill covered in ... and had back to the van\nIt depends on for ... has been unsuccessful\nSo as we ... we just know if there was a a bike there is very ... very by the ... the number plates been covered up if there is a number play on there by a you know across the night doesn't look like it would be a normal person's by like no one would leave there by cannot condition they certainly will spread like\nIf we go there and then it causes problems and then they come by and then we end up\nYou know I'm going to defend ourselves and not that could be seen as soft provoking for technically will consider appropriate so we traffic come back a bit late you're about to cry out you know right away and I do it like to sit and they rushed to a ... to anyone else either they they give us guard dogs we stick to them yeah this is our cares\nThis was Northeast Public radio WAMC F. M. H. D. Ninety put Albany\nW arguing HD Ninety point three rooms in Utica W. A. M. K. ... tiny point nine Kingston W. O. R. H. D. Ninety One southern Middletown WC el ... Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry W. N. C. H. D. won all three point nine ... W ... five one great parents in\nW. W. E. S. H. D. idiot point nine mount Kisco W. A. N. G. H. D. Ninety point one Stanford W a an eighty eight point by Brewster and WAMC am fourteen hundred Albany [noise]\n\n[noise] hello I'm real recapturing Jones' hat on today's tech tent Facebook reveal the video chat camera it once you to put in your home\nBut how many people will be prepared to trust it given the company's recent privacy and security scandals of the very beginning of this product we knew that introducing a new product category into someone's home you have to put privacy first you have to put security first\nAt Facebook executive Andrew Balls were defending the device in the show\nPlus really be the time and lucky for Google's high end pickled smartphones puff they failed to make an impact but we'll hear how the company has high hopes for each pixel free range and they'll be sweet [noise]\nWe'll find out how Chinese John ten cents [noise] putting money into machine learning technology to help diagnose\nAmong each of Parkinson's disease\nBy special guest is shown to go into Business Insider website joined us off to the news [noise]\n\nHello I'm Gary Smith who the b._b._c. news the United nations secretary general Antonio ... Terry she's joined growing international cools to know the truth about the disappearance of the Saudi Jen this chip now could show gee eleven days ago\nAnd it's a good time and she told the BBC that such incidents where increasing and the international community would not tolerate them\nI'm feeling flooded with these\nBecause this kind of each student's on multiplying\nAnd a half so central to make sure that the federal government say clearly sees is not something that's going to have\nTo ... ... they have audio and video evidence mistake could choked with mud inside the Saudi conflict in Istanbul Saudi Arabia has don't need to know I did was involved cooling the allegations lies [noise]\nThe un secretary of state Mike Pompeo has coat on on credit to quickly three other Americans in putting into the ... off to the release on friday or the evangelical pasta Andrew Brunson Mr Brunson is expected in Washington Later on Saturday where he'll be matched by President Trump among other Americans\nStraightening support for WAMC comes from my dog harness dot com I choke no poll dog harness invented to make it easier for both dogs and humans crafted in the ... century that six\nNo need to pull no need to Todd walk your dog would love thousands ever eat eat it at my dog harness dot com\nRefrain from competitive county devaluation trade dispute continue to threaten the graves\nAt the meeting on the Indonesian island of Bali the IMF said that they would discuss ways of improving the world Trade Organization so that they could better handle trade disputes that pledge comes amid a weakening of the Chinese you on to the lowest level in a decade and they trade tensions between China and the U.S [noise]\nVoting is drawing to a close in a key bond action in Malaysia that is expected to see the return of a former deputy prime minister and opposition leader to an active role in Malaysia in politics the pole it's being seen as the first test for among Abraham as Roger won't ... reports\nOn why Abraham is expected to wind up ... fiction but analysts say he needs to win convincingly to maintain his momentum and fulfill his ambition to becoming ... prime minister\nIn ... and wild joined forces with his film a bitch a political rifle matching them homage to win a ... general election victory for the ... commission which should govern ... years\nThat you made a pact with the Ninety three or hold up to my hot here promising to ... David the premier ship diminished and walk in two years\nAt least Eighteen people have been killed by flooding and landslides in Indonesia is known to monitor province rescue official said twenty four small villages in the region were affected by heavy rain local media report said that an Islamic boys boarding school was buried by a landslide and ten more people are missing at the time\nNews from the BBC\nAustralia's prime minister says he will change the law to ball independent religious schools from expanding students based on their sexuality\n... statements that the attorney general withdrawing for legal amendments within the next two weeks earlier this week and it's American the pitch to defend elites government proposal that would have guaranteed the right to religious schools in Australia to turn away gay students and teachers [noise]\nOfficials in the polls say eight climates five South Koreans and three and a poorly guides have died off the storm hit that come from the Himalayan peak in the west of the country another is missing amber a ton of erosion has more details that South\nKorea and an apology climbing team are camped at the foot up ... good job waiting for a window of good weather so they could attempt to reach the summit and their police police spokesman told the BBC that the violence Tom hit the region completely destroying the camp is that the body of the climbers were spotted among the wreckage of the camp by your rescue team\nA helicopter managed to reach the fight but was unable to land near the camp due to Sylvia weather conditions the yeah the ice about two hundred kilometers not rest of the capital cost undo officials are hoping to send an undercover team on Sunday and they'd rather improved\nPolice in the U.S city of Detroit's have opened an investigation of the badly decompose ... eleven infants were found in a full feeling at a former funeral home\nA touch of the building was voted off the police received an anonymous tip off giving them they cannot whereabouts the boat is police say they will be contacting the parents of the babies they have the names for\nSearch and rescue teams in the usa to Florida have begun work in Mexico beach the town hall dictates by hurricane Michael hundreds of people on accounted for uttered with sixteen people\nStraightening support for WAMC comes from my dog harness dot com I no ... no poll dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to Todd walk your dog with love thousands of reviews at my dog harness dot com [noise]\nHello and welcome to tech ... guide to the news and trends in the technology business\nI'm Rory Kennedy and Johnson this way we look at Facebook and Google is attempts to sell new devices and also by the consumers will trust or like they're like these gadgets\nWe find out how Chinese tech John ... use to diagnose Parkinson's disease\nAnd we joined a celebration of women in tech on ate a lot like state joining me baby technology desk editor Kelly and how they live a very good to have you back at my special gas is shown to go ... senior tech reporter from the business inside the news sites\nWelcome to LA she's going to have a lot to say I can tell you here's a little taste of what's coming out parking sense\nIs a wide enough uh according to a recent report is one of the it's a chronic condition in China about all those many patients as so we're looking for using our technology to help the doctor and patient\n[laughter]\n[noise]\nThey're they're both software companies that have built a huge empires offering free services to people supported by advertising but Facebook and Google have both on ... unveiled costly new hardware devices this week Facebook launched a video chat screen cold pool through Google shut it off its latest pixel smartphone\nWell luckily I'm Leo Kelly and has been covering both launches a layer let's start with Facebook pull through my first reaction to this was really\nGiven the recent privilege these scandals or you can stick a catch it in my kitchen you know my living room and habits balmy tell us more about it\nI'm so these are two different screens a woman bigger than the other uh the idea is that you put them in your living room or your kitchen and it allows you to video chat with all those who are on a Facebook Messenger in high quality now there's some really play an ale I involved to follow you around the room as you move takes account\nOf more people coming into the room let the person or the other end zoom in on one person can know creepy to know and that some kind of kind of a graphics you can do storytelling at your kids read the book faces popping up on you but yet as you mentioned this about a week off the face looks latest a purpose he scandal Bissett\nAnd involving about fifty million of its accounts are being made vulnerable to hackers said the timing looking great um [noise]\nWell Facebook executive Andrew Balls with told me his phone had taken a previous the first ... first conceived of pool full two years ago a still lives in ... is it could be\nFrom the very beginning of this product we knew that introducing a new product category into someone's home you have to put privacy first you have to put security first and so that's been from the ground in this device from the point of you know when you have the button to enable privacy modem and came to the microphone that actually\nFor ... ... ... what do you think of this I assume they agree I think it's going to be a nice visual story had to get out and buy a new path of looking really kids got big eyes it's this kind of small white pasta ... says right keep looking so I think it's going to make some nice pictures stories ... ... if I have to\nSay I tweeted about this rather mainly and one of the empty who's come on and on Twitter and saying the whole point of inquiries about the ... revolution and skills and the students have program the right but it's not just about the ... not just on\nA I think that may not convince people when this river pictures up in front of the MPs next week and a gives instead of performance [noise]\nYou're listening to check in on the b._b._c. world services Rory kissing giants you know maybe it's a celebration of women's technology achievements [noise]\nNow in the race to find the applications to off the official intelligence healthcare is seen as one of the most promising areas Chinese and American firms are investing heavily to develop medical advances using any eye\nThis week China's ten cent unveiled a partnership with the ... London medical tech for medical pet to use a guy in the diagnosis of Parkinson's disease\nThey develop the technique which rose video patients hand movements to work out how far the condition has progressed\nBut what does it say about the Chinese firms ambitions to be a global leader in a guy I spoke to Dr way fan who runs the ten cent health a lap the medical lab\nStraightening support for WAMC comes from my dog harness dot com I no ... no ... dog harness indebted to make it easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to Todd walk your dog with love thousands of reviews at my dog harness dot com\nAnd so we're looking for to using our technology to help the doctor on the patients and improving quality of care\nNow lots of people are doing this kind of thing where they are I ... around the world where is ten cent in this race because it is a race\nOr we are comparing with other company we want to solve a problem in the entire problem ended and\nAnd uh we are only interested in a very clear your clinical problems and by working with doctors and the from the very beginning and the value dated in a clinical setting and globally and uh hopefully you know a catching approved by the authorities that we can apply those in the real world\nDo you have the sense that this research is further ahead in China than in say the United states which is obviously the other place where vast amounts of time and money is being spent all\nIn this particular problem we are the I Will say we're pretty much a devout in St you are you many aspects by the hour the talents everywhere and we are happy to work you know talent in boats I and the medical field\nNow oil companies involved in this kind of research or are essentially looking for a pay back but it does ten cent give you plenty of time to achieve a tight back\nOf for the moment I think of the information is we want to make sure we can help people while you can help people helping Dr helping society will be paid back eventually\nSo it won't formula payback ... come\nOr other moment I don't have information to disclose\nBut it's fair to say the ten cent these aims to be a leader in this whole field is ... a very ambitious program\nYes we are very ambitious and uh we are very interested in helping patients and doctors and using our platform our talents to help as much as we can\nDo to weigh fan from the ten cent medical lab but shouldn't go to a painting a picture of collaboration around the world to to to to find out what's going on are you there in in health but actually there's a big sort of bashful isn't that between American showing the head\nOf state they have fake companies on on the line you know any of the country\nI'm putting ... billions in the ... I think some of the difficulties as a ... on that you need that kind of research takes yes excellent decades\nOr to sort of ... significant dating we going to see and I significantly adults now have anytime soon and I you know these companies can have to commit to spending like cutting money from a very long time to achieve anything useful\nCertainly a lot of hype around that whole area now the Victorian mathematician aid to Lovelace is now regarded as the woman who pioneered the idea of computer programming through ... with Charles package on his analytical engine\nBut lately ate a lovely day has become an annual celebration of women who've beating the odds to thrive in the technology industry dominated by men\nThere now sorts of events debates and policies a colleague Zoe climate went along to one of them in London\nIn the [noise]\n[laughter]\n\nHey\nI'm ... from that changing without the films buying\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nTechnology engineering and math I caught up with some of the performance backstage before ... he's still to see the maintenance curator of the dinosaurs in London's natural history museum\nTell me a bit about your ... on the hook for dinosaurs I think like ... and ... and I look at\nHow they evolved who's most closely related to ... and it was a little bit about how they will say um how often they run them if I should try that we have a lovely day which is a celebration of women in statton what's been your experience or being a woman working in science\nRelative to the cost that probably less\nConscious bias against women than that and that has seen I think that's still a lot of unconscious bias and well I see in my field the leaky pipeline it very very obvious so that will probably half of the PHD's doing such a pain pill that gee maybe like eat at a woman\nBy the time we get up to professors that very very few\nUm my name is Steven aim on and I'm a research fellow at the natural history museum I work on deep sea biology\nI'm well see you planning to perform had this even\nBefore him I mean that's quite a quite a verb I'm no I'm just going to be talking about my work essentially so you know providing a bit of contacts what the deep ocean and why should we care about that and then because it's a love of the state and we're celebrating women in science technology engineering and math\nI wanted to put a bit of a female focus on things so I'm looking at the or talking about the my three favorite deep sea female animals\nWhich are also ... I'm and\nI'm a fish especially the female ones and finally the octopus ... Pacifica which has the longest brooding period of any\nAnimal in the world how did you get into this um so I grew up in the Caribbean on an island ... and they you know I spend a lot of time in the ocean and it was during my underground hand England that the lecture aside that nine Ninety nine percent of the deep ocean would never been explored\nAnd I think one with small kids all of us want to be like an Indiana Jones we all want to be an explorer and to be a deeply biologist all scientists is to be a real life explorer\nDid you face any boundaries do you think because see where a woman\nSo not just women but also um women of color an old so from a developing country you know still to this day I've been on about sixteen expeditions out into the deep ocean and on nearly every single one I was usually the only\nPerson of color woman of color on person from a developing country and that says that you know deep the science isn't as inclusive as it should be do you think things are getting better\nAbsolutely definitely definitely definitely I'm ... now that's focused on getting more women in science technology engineering and math\nUm as well as especially deep sea science um it's been very isolating 'cause it's very expensive and so in order to developing countries can't afford to do it but that's changing now because of low cost technology in this general interest in the ocean things I'll definitely looking up\nAs the ... very Clemens reports or sugar goes from a Business Insider you spend your time visiting technology companies or do you think things are getting better from the point of view of women being info running them and so\nSlowly yeah so I think you can see an increase of you know female leadership pool you know female engineer\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\nOf men that are providing the money that goes to for example textile tops a you know the the money comic I used to ask community so you need to I bust him not fight as well but having said that I think ... you know create these\nUm I take my teeth device safe spaces that creates these communities women feel a bit more welcome so I think very slowly they're as part of our\nExcellent well we've run out of time as about it for this week thanks to my special guest showing that goes from business inside of the BBC technology desk editor Leo Korea and having a BBC dot com slash technology if you want to see what he does a and joined us again in the tech tense at the same time next week [noise]\n[noise]", "show_name": "BBC World Service", "year": "2018", "city": "Albany", "day": "13"}