{"month": "10", "state": "GA", "station": "WABE", "content": "Which Mr Austin personally for argues going to visit the kings and queens [noise]\nHe was very kind to take so much trouble to duplicate in London City water\nAnd pick the right to lessen such generous punches and I want you to know how much a seven is a free skate it very sincerely or Eleanor Roosevelt\n[noise]\nWe do know how much the royals enjoyed the tea itself or if they notice all of this effort but we do like to think that science with a key ingredient in supporting diplomacy [noise]\n\n\nStarted out this episode studying food labels with chemists Katie hunt and she says for sugar to milk to method sulfate everything around us is chemicals and she says rather than getting freaked out by their long and sometimes complicates\nNames we should get to know them I sometimes think of\nOf chemicals as\nPeople because they're all kinds of people and most people are really wonderful\nAnd some you really have to struggle to get to know and I think that's really how it is with chemicals and this effort could really pay off when you when you ask me about reading these these labels I started thinking yeah there's so much we don't get about what's in our food\nAnd and\nWhat it does to our bodies and how we can be really good to ourselves by really reading labels and understanding what they mean and how we can use that to our better health\n[noise]\nThat show for this week the pulses a production of WHYY in Philadelphia and our health and science reporters are Allen you endless Todd Julian Harris is our inter Charlie ... is our engineer Alex ... is our associate producer Tanya English our editorial director\nI might ... thank you for that thing [noise]\nBehavioral health reporting on the phone is supported by the time is scattered good behavioral health down ... an organization that is committed to thinking doing and supporting innovative approaches to an integrated health care [noise]\nWHYY health and science reporting is supported by a generous grant from public health management corporations public health fund ph MC gladly supports WHYY and its commitment to the production of services that improve our quality of life\n\nIs not a point on W. A. B. E. and landed the pulse returns next Sunday and that's at four o'clock\nComing up next though is that this afternoon tradition of all things considered a very swing with you today thank you for joining us we hope that you appreciate the pulse and and now that you know all things considered is coming up we hope that you can stay with us you know for all the day's news\nYou get it not just during the weekdays but the weekends as well your financial support is important to make it all happened you can give the basic level the five dollars a month those people give ten or Fifteen dollars a month with the amount as you please do your part\nAt W. A. being done work thank you\nSupport for WABC comes from ... Atlanta and the twenty eighth annual age walk Atlanta and five gay run October twenty first in Piedmont Park you can ... for Georgia's largest HIV aids fundraiser and help raise much needed bunch aids walk Atlanta dot com\nAnd from Karen in Atlanta and assessment is the first step to figuring out if the problem is addiction or something else Karen Atlanta real about recovery C. A. R. O. N.\nDot org slash Atlanta [noise]\n\nSaudi Arabia is making threats of its own as international pressure mounts over the disappearance of journalists Jim ...\nWe're going to get to the bottom of it and they will be severe punishment\nFor Sunday October fourteenth this is all things considered from NPR News\nI'm sure in ... will get the latest in that investigation and on the clean up from hurricane Michael plus a new investigation shined a light on the treatment of women in prison\nI Would say as a whole we discipline based on emotion rather than on safety and security\nAnd for our series American Anthem the first song in Spanish ... number one in the U.S\n\nFirst\n\nIn Culver City California I'm Janine hurts Saudi Arabia is vowing to hit back hard at the U.S last it with economic sanctions as NPR's talent wire reports the thread mark the new chapter in a diplomatic crisis over the disappearance and suspected murder of a Saudi journalist\nPresident Trump has warned that Saudi Arabia will face consequences if it has to hide from all showed the suspected murder this is Trump on CBS is sixty minutes\nWe're going to have to say we're going to get to the bottom of it and then we'll be severe punishment\nBut Saudi authorities didn't take long to answer with a warning of their own a government official told the kingdom state run news agency that they totally reject any diplomatic threats according to official quote if Saudi Arabia received any action it will respond with greater action\nAt a Saturday said the widespread allegations of murder are nothing more than faucets still they have yet to offer any official information about the whereabouts of the missing journalist college wire NPR News\nAnd Egypt Today called for a transparent investigation into ... disappearance and does the people in the Florida Panhandle are still without power for days after hurricane Michael made landfall at the same time NPR's Joel Rose reports relief workers are busy delivering badly needed aid too hard hit communities\nUrgency officials set up food and water distribution points in and around Panama City in regular people from the surrounding towns volunteer to deliver aid as well Lionel James brought a truck full of supplies from Destin, Florida\nWater diapers dog food all that stuff I Know how long it takes for people to give stuff and I know the dangers of this of what's going on\nThere were long lines for food water and gas not only near the coast but also in rural inland areas that were hard hit by the storm and they may be more difficult for relief workers to reach Joel Rose NPR News Panama City Florida\nIn Sweden the opposition leader tasked with forming a new coalition is giving up leaving the country without a government as a result reports it's been more than a month since elections left the traditional parties on the right and left evenly split at a far right nationalist party F kingmaker Sweden's\nModerate party leader ... says he's done everything he can to try to put together a center right government but his failed\nLast month's elections made coalition building extremely tricky sixty two to three hundred and fifty nine parliamentary seats went to the far right anti immigrant Sweden Democrats party two of the opposition parties partnered with Chris ... center and liberal parties refused to work with is the Democrats\nChristmas as moderates reject teaming up with the former ruling Social Democrats so the process is stuck\nAs speaker of parliament will now offer another politician the chance to try that is likely to be outgoing social democratic prime ministers death and listen who stayed on as a caretaker prime minister for NPR News I'm Teri Schultz\nAnd you're listening to NPR News from Culver City California\n... one W. A. B. E. Atlanta we are taking just Ninety seconds to tell you of one thing\nWe know that we can programs mean a lot to you our numbers show that we have a lot of tune in over the weekend because we have a lot of great programs throughout the afternoon and we wanted to appeal to you to help us out with a contribution because you've value these programs\nWhy not supported at six seven eight five five three Ninety Ninety or W. A. B. E. dot org and it's not just the weekend programs in the weekday programs it's other things we do inside the community\nOr you might know of some of our community engagement events you might remember the journalists notebook event we held back in September um we're also having an affordable housing um community event\nThat's coming up with reporter Stephanie stokes that's in mid November a lot of things we do for the community which is to say\nA lot of things we do for you why not help us out you'll to further costs with your contribution at any amount you feel comfortable with\nA lot of people do pledge it ten and Fifteen dollars a month sustaining membership is best for us it really is the best way to give\nBecause then we know we can count on a reliable stream of income because those donations continue to come in a month to month or until you decide to stop or change it so if you make a donation at W. A. B. eat out or police joined us as a sustaining member that's at six seven eight five five three\nNinety Ninety or you can pledge W. A. B. E. dot org that is W. A. B. dot org and thank you\nAll people are suffering right now under ... what we're finding however that women are stepping very unique and act\nBenedict says that's because women in prison often have a history of trauma\nAccording to the Illinois audit Ninety seven percent of female inmates have been the victims of sexual or physical abuse they show signs of post traumatic stress disorder more than any other study demographic including combat vets that's according to a twenty ten study by the Illinois criminal justice information authority\nAnd the ways that women are controlled and punished in prison with things like isolation strip searches or loss of phone privileges Benedict says these responses exacerbate that past trauma\nWe're leaning on very outdated school and an instrument of discipline that have no rounding psychological research and I actually into ethical head of research and Charlotte recovery\nAnd the isolation doesn't only affect inmates Monica Cosby the woman who went to solitary for taking on a kitchen shift had three young daughters when she was arrested and a common punishment while in prison was losing bone privileges obviously hurt me but it was so harmful\nSo my children I couldn't see them because they were out of state so I didn't get visits but\nI was able to talk on the phone you know and then I wasn't because I was inside and my daughter's needed me\nSince the release and twenty Fifteen she's been working on rebuilding those connections with her now adult children for NPR News I'm Jessica ...\n\nIn this story was reported in collaboration with NPR middle school of journalism at Northwestern university and the Chicago reporter\n\n\n[noise]\n\n\nYou're listening to NPR News ...\nWith your new sustaining donation of Fifteen dollars a month or a single contribution of one hundred eighty dollars you can choose a one year digital subscription to the New York times this gift as our way of saying thank you edit includes access to all of their digital content it's yours as a new monthly sustaining member at Fifteen dollars a month\nSo please make your tax deductible donation loaded WABC daughter worked with a call to six Seventy five five three Ninety Ninety six\nReceived Ninety point one and we're in the midst of our fall fundraiser but we've only got thirty seconds to tell you\nWhy you should make a contribution if you find yourself listening and enjoying the weekends or appreciating the news you get from all things considered please remember we still need your support we cannot do it without you the community is our largest source of funding that his listeners just like you\nPlease sure your support at W. A. B. E. downward thank you\n\nI'm Janine hurts with these headlines President Trump says he plans to visit parts of Florida and Georgia early this week hit hard by hurricane Michael\nThat that's all from the storm has climbed to at least Fifteen and officials fear that number Will Wright says rescuers go door to door\nLet's years have yet to reach some of the hardest hit areas and remnants of hurricane Leslie cause problems in Portugal strong winds and heavy rain from the storm uprooted trees snatch store windows and caused widespread power outages\nAnd thousands were on hand at the Vatican today as Pope Francis proclaimed the slain Salvadoran archbishop Oscar Romero a saint nearly forty years after he was murdered his canonize alongside pope hall the sex and several others I'm Janine hurts NPR News [noise]\n\n\nSupport for NPR comes from this station and from progressive insurance with the name your price tool offering a range of coverage in price options to choose from now that's progressive more progressive dot com or one eight hundred progressive\nFrom the NPR wine club everyone comes with a story including NPR inspired bottles like weekend edition cabernet available to adults Twenty one years or older [noise] learn more at NPR wine club dot org and from the listeners who support this NPR station\n\n\nThis is all things considered from NPR News I'm sure in ... [noise]\nThe twenty Eighteen McArthur genius grants were awarded last week and we've been spending some time on the program with a few of the recipients\nToday we'll hear from poet Natalie B. S.\nRaised on the Fort Mojave Indian reservation in California and her work draws on her Mojave and let the next heritage\nThe U.S has also been doing work to preserve the Mojave language first of all congratulations ... are in order yeah it's been pretty lucky [laughter] not only the U.S is not one to brag she told me that when she picked up the phone and heard the news that she was one of the twenty five people given as six hundred and twenty five thousand dollar genius grant\nHer brain refused to believe it\nI don't know I I'm kind of a pessimist so I started thinking like how did I earned this what did I deserve this\nWell she published a critically acclaimed poetry collection and twenty twelve called when my brother was an Aztec the poems are intimate and personal an address problems indigenous communities face in this country poverty addiction and deep family trauma did you bring any pollens with you\nYou on the spot but now I Do one okay I'll just read this form this it's appalling called ah these hands if not caught so a lot of my Newark is love points um these hands if not gods\nHaven't they moved like rivers like glory like light over the seven days of your body and wasn't that good them at your hips isn't this what God felt when he pressed to gather the first beloved\nEverything fever vapor up men pulses finite\nI I don't think we're America expects brown women queer women you know to speak about desire to to consider the autonomy of desire um you know in God for God Forbid a word like pleasure\nAnd so for me these poems feel really important um to to give myself a voice in a place where I'm I'm more possible and one of the ways I more possible is that I allow myself\nYou know these types of tenderness as an love these hands\nIf not God then why when you have come to me and I have returned to to that from what you came bright mud mineral salt why then do you whisper oh my ... my send the money my hundred tended one\n... in that poem you've managed to incorporate all of who you are I feel like I heard all of that and not on your indigenous your ... your career is all your work like that are you able to bring all of\nThose cells into your work or do you feel some times where you have to choose one or the other\nIs lucky I have this freedom it's a freedom or I don't have to worry about my audience a lot of the way I've come to poetry as has been the way that I existed and basketball\nAnd we didn't say that you were a former professional basketball\nPlayer yeah there was like my first job\nAnd so for me it's you know like I don't know that there's a place where I've been more possible then on a basketball court mhm I could be everything I was and\nAnd there was also a place beyond what I was you know basketball's a game of future to use one of the ways I think about it you're always two steps ahead you're always you know moving with this kind of momentum are\nAre pushing back against the momentum and and poetry to me feels a lot like that I feel tension and I feel pressure and I feel excitement and you know it's ... luckily I'm I'm able to\nTo find this new space of the page where I can question and wonder about all of the things that I'm Wondering in regard to language\nYour work is in English and where does that fit for you in thinking about language and where you fit and how you belong\nIn a way it's the language I Know best and I trust least\nYou can't hide from language in every word the violence that that language has carried or the violence that language has enacted has carried and that word that is one of the powers of poetry is that\nI can use Spanish when that's the word I feel in my in my body I can use Mojave language here when I feel it you know to be able to call myself\nWho I Am in Mojave is for me to call myself into existence in a way whereas for me to say Native American you know which we all say for clarity sake but for me to say Native American in a way I'm I'm already racing myself you know because what I Am as something that is\nYes part of this America but also something else something more on something that America hasn't quite been able to consume fully\nHow does this show expose issues in the criminal justice system\nWell first I got to say I've been reviewing TV for a long time I was crying by the end of this I mean it the sentences the surprisingly emotional story about a couple of things\nMandatory minimum sentencing and prosecuting people for crimes committed by their romantic partners so they'll do the sister Cindy was in this relationship with this guy who was involved in drug dealing and he got killed and six years\nThere after she's married and she's had three kids federal authorities arrest prosecute and convict or on conspiracy charges so and the mandatory minimum sentences for that was Fifteen Years now we've got a clip of Cindy describing what it was like to face that sentence let's check it out\n[noise] [noise] [noise]\n[noise] [noise]\n\n\nSo her brother Rudy Valdez a documented the struggle for the family to cope and so we see her kids grow up over nearly a decade we see Cindy move to a prison far away from her family and then there's this emotional twisted and that just drives home how much she's lost over all this time\nIn that clip we just heard she says she's guilty\nShe's guilty of knowing about the crimes that um her boyfriend was committing and not calling the cops are you know doing something to try and stop it having knowledge of a crime or can mean that you're part of the conspiracy to commit that car\nAnd this Friday the second season of making a murderer is debuting the first season with such ahead tell us about the second season\n[noise] so the first season a exposed a nation to the story is Steven Avery who's this guy in Wisconsin and he was exonerated in two thousand and three by DNA evidence after serving almost Twenty years for sexual assault and attempted murder\nThen he gets arrested and convicted of committing a different murder a few years later along with his nephew who's named uh Brendan passing so the first season raises some doubts about the evidence that they collected against Avery and expose allegations that the nephews confession was unfairly coerced this season is about every ... appeal of his conviction and\nEfforts by ... to have his confession thrown\nIt sounds very like getting into debt nitty gritty as the legal process\nWell I think that's one reason why the show might be less impact will because it's a more mundane story about how tough it is to appeal these kinds of convictions\nDid you find a link between the two documentaries\nYeah I I think they both trying to humanize people who've been convicted of crimes and show the really brutal impact of these really long prison sentences I mean we are incarcerating a tremendous amount of people in this country for long stretches of time sometimes for non violent crimes\nAnd it's valuable to have a high profile TV project that just kind of reminds us of the consequences\nNPR TV critic Eric Deggans thank you so much for being with us thinking [noise]\nThis is NPR News in\nFive thirty nine you're listening to all things considered on Ninety point wasn't W. A. B. E.\nWho's coming up in the top of the hour it's live from here we hope you can stay with us for that and we hope you can stay with us you know for the rest of all things considered as well if that is a program that you know you appreciate and you've been meaning to um support it with a financial contribution please do we are in our full fundraising campaign\nAnd we just cannot do this without your support\nPlease make a contribution in the amount you know you can afford\nMost people give five or ten dollars a month maybe up to Fifteen but you can give whenever you know you can afford at six seven eight\nFive three\nNinety Ninety or W. A. B. E. dot org thank you\nSupport for WABC comes from France or Atlanta twenty Eighteen or French American ... series and culture science humanitarian affairs and business presented by the French Consulate general and Georgia Tech October Fifteen three twenty fifth more at France Daschle Atlanta dot org\n\nJanine hurts with these headlines days after hurricane Michael slammed into the Florida Panhandle killing at least Fifteen people search and rescue crews are still coming through the rubble hoping to find survivors tens of thousands are still without power\nAs tensions between the U.S in Saudi Arabia rise the kingdom stock exchange fell it by as much as seven percent of the first day at the trading lake is after President Trump warned of severe punished\nOver the disappearance of Washington Post contributor to ... and ... is that it would respond to any threats and in the hall rescuers have retrieved nine bodies I've climbers in four guys who were killed in the Himalaya Mountains with a powerful storm swept through their Base Camp friday night I'm Janine hurts NPR News Culver City California [noise]\n\n\nSupport for NPR comes from this station and from the Jack kente cook foundation providing scholarships throughout the nation to exceptionally high achieving students with financial need from middle school to college application for high school seniors is open more it Jake K. C. F. dot org [noise]\nFrom cancer treatment centers of America offering immunotherapy and other personalized treatment options to address patients individual needs more about precision cancer treatment of Cancer Center dot com and from Americans for the ...\nThis is all things considered from NPR News I'm Shereen Marisol Meraji journalist RJ young came of age in Oklahoma but kept his distance from guns and gun culture there so it was a surreal turn of events when years later he became an end our race certified pistol instructor\nThese days are Jay young guns are locked up and he wants to have nothing to do with them he writes about this journey and his upcoming book let it bang young says he first got into guns because he was hoping to bond with his girlfriend's dad Charles\nI was dating a woman whose father was the only guy or seem to be the only guy in Oklahoma who could give a damn about football especially Oklahoma football wow and I had no way\nTo get in other than Lizzie that was the thing we had income but if this was going to work uh\nI needed to be able to talk with Charles about something that wasn't losing the first thing he did for me\nEnded up being one of the coolest things that he's ever done for me but at the time it felt very threatening because I Am a black man in his house\nSo he shake my hand after living introduce me to her father and her mother and he just bolts you know he leaves the room goes down the hallway he comes back and he's got the biggest\nDamn revolver I've ever seen in my life it's a it's like a flaming similar to me [laughter] and he hands it to me ... and I'm looking at Lizzie I'm looking at her mother Nancy and I'm going to anybody else does does resonate with anybody else\nAnd ... you know give it back to him and I don't make a big deal out of it I was like what was that oh he's very proud of it and he wants you to know that uh and putting together did that was one of the first things that he had done\nAs an act of friendship as an act of Hi nice to meet you I Want to get to know the man and if this is the way to get to know them and let's get started\nAnd and then you realize oh my God it in order to actually have this conversation I Need to know more about the subject and you ended up buying now I'm trying to remember you ended up buying your glock first rate and then you went to shoot it is that how it worked\nThe you've got the timeframe correct but what I actually tried to do first was just learn everything I could to know about guns without actually picking up a gun now which is how I came to understand and know that I wanted or needed a glock right as opposed to any other sort of pistol and that is how we ended up going to the gun show\nTalked today about the gun show tell me the story of U. R. J. young being at the gun show with Charles Stafford\nI grew up around baseball card she was my dad so baseball cards I collect baseball cards [noise]\nAh so I came to find out that go into a gun shows a lot like going to a trade show but it was different for me because I have very very hard time finding someone who was not white at the world\nLargest gun show which is in Tulsa, Oklahoma put on by one makers and we've actually find a a gun that I like um and I'm willing to pay for it but he he's insisted he wants to buy me my first gun\nYou're taking the gun that your father in law are seem to be fought and I bought for you which was a clock twenty six right and you are at the gun range and you're shooting at for the first time I just want to know your feelings [laughter] okay\nWe get all of our pistols out he'd said yeah just stick it in their wrecked a slut ...\nAim and you know it started so I'd fire and I miss almost everything and he walks over to me they got out of my hand", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Atlanta", "day": "14"}