{"month": "10", "state": "GA", "station": "WABE", "content": "... ... ... just left it open about ... [noise] when I went into the kitchen [noise] it was from ... ... [noise] it just became [noise]\nYeah [noise] my phone [noise] racy junior came over that night we buried her one week\nBefore birthday she was very number\n... there are a lot of people who are just hearing your story for the first time just hearing about Cynthia for the first time what would what would you want them to know what what what message would you want to leave them with people that you'll never meet they'll never meet you in person but what would you want them to know\n[noise] [noise] well she loved her husband loved her grandkids love their children [noise]\nShe was a little a lot of people in general\nShe was when you know the one you read about it never gets praise\nShould [noise] [noise] oh Mr ... and your friends are in Michigan [noise]\n\nGetting she's getting some praise from you today\nW. artists Dale a husband and Cynthia to build a substitute teacher who was killed in a in the shooting at Santa Fe high school on may ...\nTeens and our thoughts are with you and your family and and thank you so much for joining us in and remembering Cynthia with us in\nA sure appreciate the opportunity\nTo say that but [noise] ...\nI'm sure it's very very very difficult and I'm I but it sounds like you're at least remembering all the good things about ... and that's going to be in\nA way of doing that yeah yeah and he's not involving in\nThat conversation from Maine W artists del died last week when I'm Jeremy ...\nFunding for here and now comes from the listeners have W. B. U. R. Boston and college fine and wearing consulting work with high school students to identify and achieve their goals in high school and complete the college admissions process and negotiate merit scholarship awards more at college fine dot com\nSupport for WABC eat comes from Comcast Business providing a gig speed network that helps business get done Comcast Business beyond fast learn more at Comcast Business dot com\nAnd NPR investigation finds prison discipline across the country comes down harder on women and nearly a week after hurricane Michael devastated parts of the Florida Panhandle residents are still trying to patch together their lives without electricity or potable water\nAll things considered is coming up next on member supported Ninety point one W. A. B. E. Atlanta I'm Jim Burress glad to have you a long time now is four o'clock\nBack in March Chris Arnold and I investigated a story affecting teachers all over the country\nHow good planning and to class and I was getting at my desk bombing\nBecause for the first time in on the two years I felt like I wasn't allowed\nI'm Cory Turner and that's Caitlin ... the government offered her tuition help in exchange for teaching in a low income area\nIt seems like a fair deal until the paperwork if she turned her grants into twenty two thousand dollars in loans thousands of teachers are now facing that's they never signed on for after we broke this story the department of education launched an internal review\nAnd a ton of whole fight but I've actually had how help\nUs do more by becoming a new member today our investigative reporting starts we can you please support it now [noise]\nSupport journalism that matters with a gift right now it's six Seventy five five three Ninety Ninety or online at W.\nThe dog word in just a moment we'll check in with NPR News in Washington for the latest headlines and also the w._b. newsroom for an update on local news [noise]\nCommunity contributions are the single largest source of revenue for Ninety point one WNBA Atlanta [noise]\nWe can't do it without you which is why we're asking for your pledge of support right now six seven eight five five three Ninety Ninety WKBD job at work and do it during all things considered and whatever you pledge\nWill be matching dollar for dollar wells can you make one dollar become too We're one hundred two hundred except right now it's six Seventy five five three Ninety Ninety or W. B. B. dot org [noise]\nLive from NPR News in Washington I'm Lakshmi saying President Trump is getting a bird's eye view of the hurricane wreckage in Florida in Georgia\nThe one hundred fifty five miles per hour winds floods and tornados spawned by hurricane Michael days ago claimed at least Seventeen lines from Florida to Virginia NPR's Mara Liasson begins with one city where the president and first lady headed out bottles of water today in\nLynn haven Florida President Trump surveyed the wreckage left by hurricane Michael he said quote to see this personally is very very tough although this isn't official trip the president did meet with and praise Republican governor Rick Scott who was running for Senate in Florida this fall\nPresident Trump also plans to visit Georgia which was hard hit by the storm before\nHe left Washington he did an interview with sixty minutes where he reiterated his doubts that climate change was exacerbated by human activity\nHe said the climate was changing but that people may not be the cause as for the consensus of Ninety nine percent of scientists that global warming is caused by human activity the president said quote scientists have a very big political agenda Mara\nLiasson NPR News the White House\nA joint Turkish Saudi team searching the Saudi constant listen is stumbled two weeks after Saudi dissident journalist who's been living in the U.S was seen entering the building to get a marriage document his fiance says he never came out\nThe mystery surrounding ... is sending diplomatic shockwaves around the globe and NPR's Jackie Northam says it inside Saudi Arabia the reactions\nDifferent in Saudi Arabia I mean you get in a completely different picture than you are really in the rest of the world is very much that the world is against Saudi Arabia that basically wrote killers were involved with that but you know as the rest of the world is looking at this as an international crisis and the disappearance and perhaps murder of democracy\nHas really touched a nerve worldwide\nThat's NPR's Jackie Northam the former security director of the Senate intelligence committees pleading guilty to lying to the FBI the James Woolsey maintains he did not share classified information with reporters today the judge allowed will remain free until he a sentence just before Christmas he pleaded guilty to one count\nAfter another disappointing random Brexit talks NPR's Frank Langfitt says British prime minister Theresa May still holding out hope for a deal with the European Union\nThey wanted to deal in time for this week's summit in Brussels which told Britain's house of commons the two sides still couldn't agree on how to prevent the need for customs checks between Northern Ireland and the republic of Ireland\nI continue to flee the negotiated deal is the ... the u._k. and the European Union I continue to believe that such a deal is achievable\nJeremy Cortland Meader the opposition Labour Party criticized for inability to close a deal\nThis really is beginning to feel my grandpa or nothing strange moment from the shovels all government telling\nHis running al UK scheduled to leave the at the end of march Frank Langfitt NPR News London this is NPR support\nFor NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com and the ... e Casey foundation\nWABC news in Atlanta good afternoon I'm Martha Dalton it's for a for Atlanta mayor Kesha Lance bottoms is proposing a new way to finance a redevelopment deal for part in downtown Atlanta known as the ... the mayor says she won't ask for a ten year extension\nThe west side tax allocation distract which was part of the original financing Dale Atlanta city councilmember Amir ... says that's a step in the right direction\nJust at the time that tax revenue would be read or to dock into the project so that tax dollars would come back to the city quicker that out of the greatest\nFor al ... says he's concerned about whether the project guarantees enough affordable housing\nSouth Georgia residents severely hit by hurricane Michael are having trouble getting to polling locations early voting started today but one pulling site indicator county was already forced to close due to low turnout Carol heard is the chief election official for the south Georgia county\nCertainly are in large as far as mail in ballot but as far as actual people come in like now they're not coming right at this time because you know still people without power still walking around\nHe noted that during the Obama administration the Saudis bought about a hundred and twelve billion dollars worth of us weapons so they that was in that ballpark\nBut those contracts are mostly come completed by now and here's what right Elle said when I asked him about the state of sales with the current administration\nSense a Donald Trump has been president United States and Saudi Arabia have concluded less than four billion dollars worth of arms agreements\nLess than four billion dollars so that is a big gap do we know how much the Saudis actually do spend are currently spending on weapons from the U.S well they\nDo spend a lot and they really ramped up their defense spending in recent years particularly because of this a protracted war they're fighting in Yemen in fact their defense budget is now considered to be the third largest in the world trailing only the United states and China\nAnd last year we've seen reports they bought three point four billion dollars of weapons from the U.S far more than any other country so as a general principle the Saudis are the biggest weapons fire from the United states not on the scale that the president has suggested\nOkay so that hundred and ten billion may be aspirational\nAre kind of wish list but ... what kind of weapons have they bought\nSo the fighter planes and the F. Fifteen or really the most significant single purchase right now because they're using that daily in Yemen and the bombing campaign has now been going on for more than three years\nBut the Saudis don't have a lot of big contract at the moment as as we just heard and it's really the United states that that has the leverage because the in this relationship right now because of the way it supports in supplies the Saudi air force here's ... again\nTonight President Trump told the king he was cutting off spare parts to the Saudi air force Saudi air force would be grounded tomorrow morning\nThe president has said that if the U.S doesn't sell weapons to the Saudis in Russia or China would step in and do it but it's it's really not that simple of red tailed noted that\nYou can't simply strap a Chinese bomb on an American F. fifteens at all of the systems have to talk to one another so the Saudis really would be in a tough spot if the United states were\nWalker at the head of the line she's lived here sixty three years and last week she watched hurricane Michael ripped the roof right off\nOr has our community have went out with all people off the ground that have lived there for three and four hours\nAnd we couldn't get a rescue\nNeighbors are helping one another she says after nearly a week it's clear that her patients is wearing than\nFifteen minutes later a convoy of power line trucks rolled into town six days after the storm Quil Lawrence NPR News Youngstown, Florida [noise]\n\nYou're listening to all things considered from NPR News\nThe time now for twenty two and you're listening to all things considered on member supported Ninety point one W. A. B. C. where a T o meets NPR voting rights have become a central political issue here in this state\nIn the gubernatorial election which is next month the Democratic and Republican candidates have long sparred over how easy it should be to registered to vote here in the peach state\nWABC zone Emma heard reports for all things considered coming up later in the hour I'm Jim Burress it is our full pledge drive I'm joined by MORNING EDITION host of marriages Dennis O'Hare and Dennis it's so nice to welcome you\nBack and have you here with us hey I'm it's great to be back on all things considered it's\nBeen a minutes and sorrows with everybody in the afternoon but it's nice to be back\nExcellent and we're doing some business today so to speak and you have an important thing dimension most important I have here is in my hand\nThe latest fundraising match and this is important because if you make a gift of support to all things considered and all of the other programs that you love here at W. H. B. E. then your gift is matched but\nIt has your gift has to come first that's how matches work and this one is up to Fifteen thousand dollars and if he's put up on the table by some of our most generous W. A. B. E. members so help us out and a lot of folks do wait for these matching campaigns because then they know\nMy gift will be matched it'll go farther well if you have waited until now\nThis is the time because this is the final fundraising matched during all things considered you're listening now you want your gift to go farther now so make it now six seven eight five five three Ninety Ninety or online at W. A. B. E. dot org [noise]\nWe have a goal for this hour in order to try to meet that goal to trigger the match thirty nine pledges to go this hour and we've got twenty five minutes gone already\nWe started with I Believe forty force of thirty nine that's a little slow on the momentum but we know what's going to pick up because we know we know that this matching opportunity this grand is is too good to pass up what else can you turn ten dollars into twenty twenty to forty forty into eighty I could do this type of math all afternoon\nBut we need to run out of fingers [laughter]\nWe need to hear from you right now at whatever level works for six seven eight five five three Ninety Ninety or W. H. B. E. Don and work\nWith a new sustaining donation of seven fifty a month or a single gift of Ninety dollars you can choose to wait wait don't tell me twentieth anniversary digital download this collectors edition contains highlights from white waits for two decades and features appearances by well known I guess some analysts like ...\nWhen Wendy O'Connell marched into her dark and the motel six row in Columbus ohio tripped over the debt Sharon broke her wrist or first thought was I'm going to sue tomboy that for not leaving the light on wait wait don't tell me twentieth\nThings considered from NPR News I'm Audie Cornish and I'm Mary Louise Kelly Senator Elizabeth Warren has released the results of a DNA test that says there is quote\nStrong evidence she has Native American ancestry dating back six to ten generations this is an attempt to quiet a controversy a controversy that has dogged Warren for years\nAnd it comes as the Massachusetts Democrat moles a run for president in twenty twenty NPR's Asma Khalid is on the story and she is in the studio now either pay [noise]\nStart with exactly what did Elizabeth Warren released today\nShould she released the results of a DNA Analysis conducted by the Stanford University researcher his name is Carlos was to Monday and he found that a vast majority of warns lineage is of European ancestry\nBut he also wrote that her results strongly support the existence of a Native American ancestry\n... you know in addition to this DNA Analysis warning also released a campaign style video clips of President Trump mocking her mocking her claims of Native American ancestry and some vignettes from her family history she had this one scene in particular where she calls ... their DNA researcher and puts him on the line\n... Native American ancestry with very high confidence where we believe the error rate is less than one of them now president wants to call my mom a liar what are the facts and we have an interview interest or your editor\nSo you you know you can hear that she's also again pressing the point that this is part of her family's history is at the history that she says has been passed down for generations can also\nHere at least who one of the members of the intended audience of that video is the president himself a lady responded to although he\nHas and no one really made it kind of a point that he had to respond to she tweeted at him about a promise that he made a sort of daycare at a rally this summer he suggested that if he were debate to debate her in twenty twenty he would give her one of these take home DNA kits and then he said this I Want\nTo ours fear favorite charity\nFor trouble if you take the test of the shows your if\nYour [noise]\n[noise]\nSo merely this morning we're in the ass that he pay up all night with a million dollars he or she wants this money to go she says to the national indigenous women's resource center that's at charity ever choice\nYou know Trump was asked by reporters about this challenge he denied making that promise even though as you all heard we just heard or the late ... and the war with after him again on Twitter saying you know asking him if he had memory problems and if they should all call for a doctor and and really you know she's kind of been poking him all day on Twitter\nAnd my cynical to ask about the timing of this does it have anything to do with a B aspirations we mention the cheese eyeing a run for president herself in twenty twenty I think that's a really realistic\nGod's at this point I mean you know this isn't a campaign ad for the midterms Warren is expected to easily win a second term as a senator this November this is really about what's next right and she has talked about potentially taking a hard look at what's next after the midterms\nAnd she really does want to kind of quiet these these questions they had been trailing her ever since she first ran for the Senate in Massachusetts in twenty twelve\nAt that time her Republican opponent accused her of being dishonest about her her past and you know President Trump of course had his taken to calling her Pocahontas so\nIt's really an attempt to to try to kind of quiet all of this because the twenty twenty race is going to kick off pretty much just in his mid term so very briefly has quieted all of this ... ... no not at all I mean I can tell you real quick the Republican National committee said that the test revealed only a miniscule percentage of Native American ancestry\nThat still leaves a lot of unanswered questions All right so that is NPR's political correspondent Asma Khalid thanks very much You're welcome\nVoting rights are on the ballot this year and nowhere is that more clear than in Georgia Republican Brian Kemp hopes to be the state's next governor right now though he's in charge of running its elections as a reporter and a herd of member station WBUR ABE reports Kemp and his Democratic opponent Stacey Abrams has a history of disagreement over voting rights\nAbout a hundred and fifty people gathered at the Georgia State Capitol last week to demand the resignation of Brian Kemp or just secretary of state [laughter]\n\nWhat has rallied people together [noise] news at fifty three thousand Georgians who have applied to register to vote are on the quote pending list their applications did not exactly match information on file with other government data bases down to punctuation errors the Associated Press reports that nearly Seventy percent of those on the list are African American\nThese pending voters can still vote in this election with a state id at the polls in a similar policy has been upheld in federal court in Florida\nBut that doesn't make up for the conflict of interest according to Lydia Meredith an Atlanta who was at the rally\nA travesty that the secretary of state\nHad not read it was designed to because he can date and that ... that he had this let's say\n... campaign spokesman Ryan Mahoney says the registration issue has been blown out of proportion\nThis is a manufactured crisis bar Stacey Abrams forced to shoot rooms so calls for resignation or calls for anything from lower it completely ignored because they're completely dishonest and they're just trying to say and outrage to try to turn out there to support\nExact match has been a policy of comes office since ... ten several civil rights groups challenged in court in twenty sixteen and parts of the policy were suspended but in twenty Seventeen to Republican controlled state legislature made it a law so some of the same groups sued Kemp again last week arguing the law violates the voting rights act\nDanielle laying with the campaign Legal Center is one of their lawyers\nThis policy doesn't flag the right people and leads to an extraordinarily high error rate where tens of thousands of eligible voters are flagged for potential removal based on you know a hyphen here in space there or transpose DeGette\nBrian Kemp campaign blamed quote sloppy work by a voter registration group called the New Georgia project that democratic candidate Stacey Abrams founded that group is focused on minority and young voters kept office actually investigated the New Georgia project for fraud back in twenty fourteen investigation was later dropped\nAbrams told W. A. B. E. earlier this month that as a state legislator she has been fighting comes office for removing inactive voters from the rolls and allowing counties to close polling places\nFor me the question of voting is about expanding the right unfortunately my opponent has made his mission a secretary of state restricting that right and eliminating access in ways that have really harm the body politic\nCan't maintain his policies are protecting the integrity of Georgia's elections he points to recent comments from Abrams who said quote documented an undocumented people will be part of Georgia is quote blue wave Kemp appeared on Fox News this morning\nAnd ... early voting starts in Georgia the hard work in Georgia so should decide who they're governor is not people here illegally live ...\nAbrams says Kemp is taking her issues out of context but this issue is shorter fire up voters from both parties are recent NPR Marist Poll found that fifty six percent of Republicans consider voter fraud the biggest threat to this fall's elections that's compared to twelve percent of Democrats\nEarly voting in Georgia started today for NPR News I'm Emma hurt in Atlanta [noise]\nOn MORNING edition the Republican led Congress has largely gone along with the Trump Administration as it rolls back environmental\nTexans Democrats say it won't have as easy a time if they get control of the house but what could Congress do I can hear that story tomorrow by asking your smart speaker to play NPR or your local station by name [noise]\n\n\nThis is NPR News for a national audience on NPR it's the type of reporting that matters\nIt's the type of constant contacts that is necessary and it's what you get every afternoon when you tune into all things considered I'm Jim Burress going to have you a longer time for forty four Dennis O'Hare\nName you certainly recognized here with me today to encourage you to make a pledge of support for this quality journalism six seven eight five five three Ninety Ninety and W. E. B. E. ...\nEncourage yes but hey we're we're not above ... and pleading to so right now we need to hear from you as a gift of support at any amount that is right for you we know you've been meaning to do it because of all things considered means something to you every day or however often you listened\nAnd when you do your from twenty nine more folks right now with gifts of supporting any amount in order to stay on track\nOn track toward what you might ask you just joined us this is an important day because\nWe're in a fund raising match this afternoon we have to meet a goal in order to trigger that match but it's really simple your gift in any amount if we meet the Gulf or numbers of pledges\nWill be matched up to Fifteen thousand dollars in matching from some of the most generous W. H. B. E. members there doing their part right now\nWe need to do hours six seven eight five five three Ninety nine years the number to call it so easy takes just a couple of minutes on a busy afternoon or you can do it justice quickly and securely on line at W. H. B. E. dot org twenty nine pledges to go by the next Fifteen minutes and that'll keep us on track\nShe said the only one of my stuff\nReally solving another producer heard with Diane and said [noise]\nAnd then she admitted I too have never pledged and have you considered it you\nKnow it's never crossed my mind like I said it just I heard the pledge drive but it never occurred to me that they're talking to me because I [noise] I don't know why that makes no sense at all [noise]\nWhat that means is that when Willie here's the pledge drive listen it'll be like rooting for Elving rooting for everyone and like I really hope they get what they need [noise]\nWait you'll save your call but it doesn't occur to your your one of the listeners\nSo on on the same side I'm like\nYes [noise] you're going to get this just hoping people would donate [noise]\nPeople not her\nI say this is not unusual if your hand it sounded my voice right now we know that you probably the sound a lot to this radio station\nWe know that most of you last I heard the number was nine out of ten of you [noise] do not donate [noise]\nAnd when we do surveys asking you why [noise]\nThe answer you give most often is the same thing Diana will you were saying during the ...\nYou think we're talking to somebody else\nTold me that she figures were talking to her parents than say we are talking to like or not\n[laughter] [noise] how old are you at well now I'm twenty nine\nI didn't know what I mean you know what the world needs [noise]\nI mean growing up means understanding reality I mean the understanding whether you are a real listeners this radio station [noise]\nKind of listen to it might help out and as you're trying to figure that out I Would ask you to look at your behavior right now what are you doing you're listening to the radio station [noise]\nPlease please please please please please we really are talking to you you are our\nListener that's the truth here's had a pledge six\nSeven eight five five three Ninety Ninety or W. A. B. E. dot org as we close out the four o'clock hour we really are talking to you so please make a pledge right now and we all made the first pledge at some point right it it's a step you have to make\nThat is why if you had not made a pledge before we are talking to you we need your support right now six Seventy five five three Ninety Ninety W. E. B. E. dot org I'm Jim Burress with dinner so hair\nAnd it is great to be back in the afternoon it's been a while since I was part of all things considered it's an hour to get back with you but thank you better the mornings right for the schedule now I Love the mornings too I really enjoyed that\nI'm Sorry and I'll be I'll be returning for some mornings sometime this week great so we'll be doing both there's somebody happy to hear you I guess I don't know [laughter]\nBut we need to hear from you absolutely right now at six seven eight five five three Ninety Ninety or online at W. H. B. dot org why because not only will you be supporting the wonderful programming at WAMC either programming it you depend on what your gift to support\nYour gift will be matched if you do it now like this afternoon it'll be matched by some of the generous most generous members of W. A. B. E.\nAnd all you have to do is make that match possible it starts with you six seven eight five five three Ninety Ninety or W. A. B. E. dot org\nAnd then as we just hit four fifty nine and that means we are at the wire right now we do have a goal for this hour we need to hear from Twenty one more people really in this next minute\nNow we know that there are tens of thousands of people at least listening at any point and even if you factor in that it's only ten percent of the listeners who give as we just heard from Ira that's many many many more people than ... than the Eighteen we now need to hear from a ... one W. H. B. E. Atlanta\nIt was interesting to hear Irish staff say you know oh well I work on the show and I haven't players are\nNot not bragging here but I was a member long before ever came to work here so once I got here\nI couldn't do it Irish staff to and say you know I ... I can stop pledging of absolutely nothing to do and that's because I Believe so much in what everyone here W. H. B. E. does and we know you believe in it too because you're listening during the pledge drive for heaven's sake [noise]\nSix seven eight five three Ninety Ninety WABC dot org Fifteen pledges to go now this is the final fundraising match for all things considered so if you've been waiting to do this to get that extra muscle on your gift congratulations you've waited to the right time but you got to do it now\nAnd we need to hear from you six seven eight five five three Ninety Ninety and W. A. B. E. dot org\nIt's five o'clock\nSupport for WABC comes from Kaiser Permanente were members can see a doctor get a lab test and pick up medication all in one connected system delivering healthy outcomes and consistent care more at ... dot org Kaiser Permanente thrive\nAnd from community foundation for greater Atlanta serving our region for almost Seventy years powering your philanthropy with assets like appreciated stock and business interests for tax efficient giving learned more at sea of greater Atlanta dot org\nLive from NPR News in Washington I'm ...\nIn a closely watched business case the U.S Supreme Court today refused to hear what appeal brought by three paint manufacturers that were challenging the lower court ruling that found them liable for promoting and selling lead based pain for decades when they knew it was dangerous Here's NPR's Nina Totenberg\nIn Nineteen Seventy eight lead based paint was banned in homes nationwide because it had been shown to cause brain damage especially in children\nThe California courts found that paint manufactures knew about this danger as early as the Nineteen twenties\nAnd in twenty Seventeen ordered three paint manufacturers to remove the paint in all homes built before Nineteen fifty one in ten California jurisdictions including Los Angeles and San Francisco the costs was estimated at over four hundred million dollars\nTo paint companies with broad support from the business community then appeal to the Supreme Court\nBut today the high court left the lower court order in place you know talking bird NPR News Washington\nPresident Donald Trump and first lady Milan ... surveying hurricane damage in Florida and Georgia today left in the wake of hurricane Michael\nTrump's landed Elgin air force base and flew over some of the most heavily damaged areas in a helicopter for the panhandle took a direct hit from the hurricane with maximum sustained winds around a hundred and fifty five miles per hour\nHundreds of thousands of homes and businesses in Florida and George are still without power at least Seventeen people died in the storm\nSecretary of state Mike or sleep on the pay was on his way to Saudi Arabia and meet the country's king the Trump Administration trying to find out what happened to a Saudi journalist who disappeared there earlier this month more from NPR's Michel ... Washington\nPost columnist Jim ... show was last seen entering the Saudi conflict in ... earlier this month President Trump says on Twitter that the Saudi king denies any knowledge of what happened to show the Trump says he spoke by phone with gangs all non and they're sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord ... to the consulate and killed him there and\nThat case is draining us relations with Saudi Arabia and the Trump is made clear he doesn't want to disrupt lucrative arms deals Michele ... NPR News the state department\nSpreading by consumers was up slightly in September despite rebounding auto sales the Commerce Department says the scan gain voting equally bigger one tenths of ... percent rise in August was the weakest two months growth performance since the start of the year was ... below Congress projections solved six tenths of a percent rise in sales\nRetail sales are closely watched by congressman or major driver of the economy spending by consumers is responsible for roughly two thirds of overall us economic activity\nSocks close lower today the Dow down eighty nine points ... sixty six points this and the five hundred was down sixteen points you're listening to NPR\nSupport for NPR comes from NPR stations other contributors include CIA CIA is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more at CIA dot org\nW. A. B. news in Atlanta good afternoon I'm Martha Dalton it's five oh four and as we just heard from NPR president Donald Trump and first lady millennia are in Georgia today surveying damage from Hurricane Matthew\nAirforce one landed in Warner robins earlier this afternoon the president and first lady will tour areas hit hardest by this storm\nAnd excuse us as we said Hurricane Matthew that will be hurricane Michael and Trump also granted governor Nathan Deal to requests for federal assistance and the aftermath of Michael Steele made their class last week after Michael Savage must much of southern and middle Georgia the federal money will help cover the cost of preparing for this storm as well as clean up\nIt will provide public aid for thirty one county as an individual assistance for sex individual assistance makes funding available to people and households for things like temporary housing and home repairs public assistance includes funds for emergency work and debris removal\nAtlanta mayor Keith I'm Lance bottoms is proposing a new way to finance a redevelopment deal for part of downtown Atlanta known as the goats the amended proposal no longer calls for a ten year extension of the ...\nSide tax allocation distract which was part of the original financing Dale city councilman Michael Julian Bond created a tax allocation district in Nineteen Ninety two and says and the short term\nHad I not made that speech we would not have one I was just saying she didn't seem to know anything you know and you're trying to destroy a life of a man who has been extraordinary\nBen Sasse Republican senator from Nebraska doesn't except that it's divisive and it was a mistake ... as a member of the Judiciary Committee and frequent Trump critic in fact on the Senate floor the day after that rally ... took issue with the president's behavior while explaining his own concerns about the debate over the nominee\nI spoke with Ben Sasse earlier today about political divisiveness it's the subject of his new book them we started with what happened with the Kavanaugh hearings and his take on the me too movement\nThe me too movement is a very important movement it's messy and it's complicated and there are places where it's going to overreach and we haven't fought throughout a process all of the due process issues but fundamentally I think we have a culture of\nSexual assault in this country for decades we don't have a shared sexual aspect and the me too movement is very very important and we need to handle it with a lot more delicacy than something you can handle well at a campaign rally so that was an unfortunate move\nBut what's your response to many conservative and Republican women out there who have talked about this idea of him to movement that they're worried about their sons that\nYou know they've kind of move from one part of the conversation to apart that says men are at a disadvantage here that there are radical feminist women who were coming after men in your life with false allegations [noise]\nWell I mean it's clearly the case that we need to figure out how in an American tradition that's always had writes for the accused as well how we navigate things that are regularly going to be tried in the media\nSo I I think that that is a false choice to divide the world and to whether or not we want to love and protect our sons and whether or not we want to protect and trust our daughters um this is a cultural movement and moment that it's much bigger than politics the me too movement doesn't belong\nTo Republicans are the Democrats the me too movement belongs to women\nWho are having the courage to come forward and say this is wrong people should be protected we want that for all of our daughters and all of our sisters um we also want there to be writes for the accused and right now we haven't yet navigated to a place that will hopefully be a lot healthier than where we are now\nIn the meantime we've heard Mitch McConnell mothers call me to activists an angry mob is that what you see is that what you saw in the hallway and that is that how you feel about that activism [noise]\nI didn't hear a later McConnell's comments about the me too movement as a mob I heard leader McConnell speaking to the fact that there are a politicians in American Life today who are saying to people if you'd differ on a policy issues you should be handed out of a restaurant\nThat's actually happening right now where your politicians going to cameras saying don't let people eat dinner with her kids that's wrong\nTo forge family and Brett Kavanaugh's family both suffered repeated death threats over the course of the one month circus that the Senate conducted on a politician who has to for a time of serve in public life and I get death threats and it is what it is because\nYou put yourself out there in the public square but if you're going to serve on the judiciary or if you're going to raise allegations about sexual violence in the past the fact that we don't just have those people suffering death threats having to move out of their homes\nOn but we also have other politicians calling on people who might differ with on policy to be handed out of restaurants that is ... like behavior\nWhat is your response to the activists who says if you are paid by me the taxpayer in ICU in public it's perfectly fine for me to tell you what I think and it's perfectly fine for you to be held accountable for policies that are harmful\n... this is why I wrote them most fundamentally because political tribalism is ramping in our time\nThere are all sorts of important debates that need to be had inside politics but the idea that politics should swallowed the whole public square\nThe idea that there is no civil society that there are no cultural debates that there are no economic debates there are no religious institutions are there are no recreational places where our kids play wrecked sports and youth league that will not sustain a republic\nThat's Nebraska Republican Senator Ben Sasse we'll hear more about his book elsewhere in the program [noise]\nTo Nicaragua now where it has been nearly six months since political turmoil erupted protests against proposed changes to Social Security pensions morphed into a full scale revolt against the government of president Daniel Ortega\nThe government recently declared protest illegal and how it is clamping down hard on anti government activity Maria Martin reports [noise]\nOn Sunday a new opposition coalition called the ... the blue and white national unity\nGathered on the amino already in the in Managua for a march demand government reforms calling for the government to return to the national dialogue [noise] the group was relatively small at the repression against protests as we say\n\nTo a hundred heavily armed sweat courses showed up and tracked protestors on the ground and shut them to all these ... as a video taken at the event show reports say at least four dozen were arrested many were well known activists and civil society leaders [noise]\nMeanwhile at the Tucson\nAirport two well known he got one human rights leaders I ... and ... Cunningham were pulled off their planes entertained by immigration authorities\nThen you've got to win Center for human rights report it because the it was taken to the prison known as said she thought they were many political prisoners are held and were there have been reports of torture after being interrogated Cunningham what's allowed back on her flight\nThe political turmoil in the last six months has left the population and terror and its economy in shambles wanting to get out when that small business owner is too scared to go to the protests and would only identify herself us cocoa for fear of retribution\nYou know what is happening now in anybody Ebola just by war it's just that they disagree with the government they can be read and put in jail there are nice neighborhoods and people around me talk now\nThe head of the organization of American states release on medical condemned the repression human rights groups say at least three hundred and they got ones have been killed and many more injured the majority by government forces since this country's political turbulence began on the Eighteenth of April for NPR News I'm Martin you're\nListening to all things considered\nAnd you're listening to it on member supported Ninety point one WABC were HBO meets NPR or John five twenty two I'm Jim Burress glad to have you along and glad to have a long dinner so here are a name that many will find familiar it's good to see you back\nGreat to be back and um it's fun to be back in the afternoons it's been a while since I've found a mature where you're sitting three years four years oh gosh twenty Fifteen\nThank you know there's the last time that I was host of all things considered and um you and I ended up working with not at the same time with Rose Scott on closer look and then I eventually Margaret it to MORNING EDITION so maybe I'm just following you did [laughter]\nBut it's great to be here and and uh I listen to you during the term terrific job\nWith like you I appreciate that and if you're listening to me right now please take note that we need to hear from forty five people to keep on track this hour\nWe're having better momentum that we did in the last minute do our we can do this but we need you right now it's six seven eight five five three nine zero nine zero or W. B. B. E. dot org and Dennis it is a really important that folks do it during all things considered today\nToday because we have a fundraising match on the table some very generous members of W ab ... have put up money to match your donations up to a total of Fifteen thousand dollars\nWell we haven't had Fifteen thousand dollars yet so we need to hear from you right now and your gift will be match\nDollar for dollar a one hundred percent return double your money whatever phrase you want to put on it\nIt is really easy to do takes just a couple of minutes and all you have to do is make your gift of support any amount that that is right for you at six seven eight five five three Ninety Ninety or online at WABC dot org and your gift will be matched it'll go twice as far what a deal\nAbsolutely and Katherina then sent and Karen gross Sandra courting or Rob McKenna in all making a pledge this afternoon having their amounts doubled and chipping away at this school right now thirty nine folks in this the five o'clock hour we need to hear from\nAnd did is I hear so often people say well I don't give because I really don't have much to them and we understand right there actually people who cannot give\nIf you're someone who can can you give think about this\nNot only does your gift go to keep the station on the air but it goes to keep your the station on the air for those who absolutely cannot afford to contribute but still benefit from listening\nAnd if you've been a long time listener I Will bet you that there was a time in your life\nWhere you probably couldn't either afford to give it all or give very much well there is someone else out there now in the same position and it's up to the rest of us to say hey we want to make this resource strong vibrant and thriving for this community and\nThings considered from NPR News I'm Mary Louise Kelly and Audie Cornish we're spending a few days looking at a striking disparity in prisons across the United states women are disciplined more frequently and often more harshly than men that's the finding of an investigation by NPR Amman Adele school of journalism at Northwestern university\nNPR's Joseph Shapiro and reporter Jessica papa that found that women are punished disproportionately for minor infractions knows violations\nMajor repercussions like the last good contact credits or solitary confinement he was do\nWe collected data on prison discipline from Fifteen states it all but two women get this when the higher rates than men what's most striking is that women get punished far more for minor violations of prison rules at rates we estimated often two to three times higher for what prisons classify\nAs smaller infractions petty stuff\nYou can get written up for a not closing endorsed get written up for jumping on the phone without permission or if you just want to just pick your room up nice in just takes until late in your case you get written up for that\nThat Victoria Williams and it made up the central California women's facility and show show a California\nGet written up for going out of bounds in somebody else's room\nAre out of bounds in the hallway [noise] it's just basically everything you get written up for\nOur numbers showed that in California women compared to men get twice the disciplinary tickets for disobeying an order and more than twice as many for what's called disrespect\nIn Vermont we found women are more than three times as likely to get in trouble for making what's called derogatory comments in Rhode Island they get more than three times the tickets for disobedience\nThose tickets have consequences women lose good conduct credits that could have time to their stay in prison or lose phoning visitation privileges or go to solitary confinement in Rhode Island women were more than three times as likely as men to end up in solitary confinement for disobedience [noise]\nPrisons were built for men and the rules for discipline were set up to control those math DMV ... says those rules don't\nWork very well with women you walk through a women's prison and it's a profoundly different experience we\nMet some of the day she was visiting Logan Correctional Center a women's prison Illinois several years ago ... was a top official in the Illinois department of corrections now she works with President as a consultant she helps them address that problem of why women in prison get discipline more\nWomen are more can you ... when you walk to pretend they're more emotional they want to talk to you they want to talk about their children they want to talk about their experiences\nTwo years ago they notice helped conduct an audit of that women's prison in Illinois and found that women prisoners were disciplined almost twice as often as men for all offenses big and small but almost five times more likely to get in trouble for a lesser offense called minor insolence\nAnd they also really if they seen injustice with another woman in a prison or something that happened they want to fix it like they want to be the mom that's going to come in and mediate between people and fix the problem\nBayliss told us she likes it that women prisoners are this way but she said many corrections officers and often even in a women's prison most of them are men say they hate it\nThe first thing that they'll tell you is these women are so difficult gosh they're a pain I Would rather work anywhere but here they always want to talk to you they won't take no for an answer\nCorrections officers are trained to keep control they expect women to be compliant if the women push back that's where those disciplinary tickets for influence come in to women and we met in Illinois told us they've been written up some years ago for an infraction called reckless I bowling\nWhile women get more tickets than men certain women get the most tickets of all women with mental illness those who are lesbian bisexual or transgender African American women especially for those lesser non violent offenses\n... ... a guy out 'cause they say it's not that to me that I light or yeah stuff like that\nWilliams was Nineteen when she went to prison in Illinois after repeated we missing her court ordered nine pm curfew at our foster care facility\nIn prison after a fight with an inmate Williams was charged with hitting an officer who tried to stop it or sentence was doubled from two years before but most of her tickets were for cursing and talking back to officers and\nThose kept her in prison for extra days and she lost privileges one time she says she got in trouble for cursing out the guard when her soul mate who had diabetes passed out Williams felt the officer was too slow to help\nWilliams says the hardest thing was when she lost her phone privileges and she couldn't call her son he was a baby when she went to prison and he was growing up without her\nIt was sad because I'm Still here I'm sure there are in fact\nHe's nine now but Titanic Williams says that time separated often not even able to talk to him on the phone makes it hard to be a parent now\nEven if they are the consequences are less out here it is hard right ... 'cause they don't stay on this day and my family all backed off and my family our heavy like curvy current you're gone\nMore than half of women in prison or the mothers of children under the age of Eighteen one common punishment up at Illinois prison was that women last good conduct credits in one year alone twenty Fifteen women most Ninety three years of those credits that's twenty extra days or prison time for each woman\nThat's an average many women had no days added but some ended up with months even a year or more of extra time [noise]\nA small number of states including Illinois or trying to change this\nThey're praying was called gender response of corrections practices it's built around the idea that women are in prison for different reasons than men that they respond differently in prison and that prison rules need to recognize those differences in the last ...\nFound out that he had to have that\nPrison in Illinois a trainer at the front of a classroom tells the corrections officers to think through the different pressures in a woman's life\nAnd she needs to see what's going on when they're signing she asked\nMe how to deal with this\nWith phone privileges revoked all she can do is write a letter home or tour some school\nIt's reminder to the corrections officers that tickets even once for a lesser offenses can have significant consequences reporter Jessica papa back meant officers that training they didn't want to give their names they said the gender response of approach makes sense to them but that many of their co workers are much more skeptical\nI was wanting to hurt a lot of things but\nWhich has been worthless we're gonna we're hugging anything\nHas a thug metsa derogatory way of saying\nTo letting the inmates from prison we wrote letters to some of the women at that Illinois prison\nOne woman who wrote back said that says the training started she's not seen much difference\nShe said corrections officers both men and the women are disrespectful and cruel and this is a quote there on a power trip they cause bitches hose they try to provoke you if you say anything back they send you the segregation ... threats and intimidation\nThe number of women in prison is rising but still they're only about seven percent of the prison population nationwide so it's hard to get prison officials to make their problems are priority like the heavy punishment of women for those ... violations of prison rules\nJoseph Shapiro NPR News I'm [noise]\n\nTomorrow we had to Iowa State that's made a real commitment changing discipline for winning prisoners this is NPR News\nYou're listening to all things considered on member supported Ninety point one W. A. B. E. to ATM meets NPR I'm Jim Burress so nice to have you along in two thousand eight San Francisco begin selling taxi medallions to make up for a budget deficit they sold hundreds of them to mostly immigrant immigrant drivers\nWell then comes over and lifts and now the immigrant families are stuck with debt and are clamoring for relief more on that story\nWhen all things considered returns in just a few minutes and as I mentioned I'm Jim Burress within his O'Hare and it is our full pledge drive where we're asking members Twenty one right now to keep us on track in this hour to call six seven eight five five three Ninety Ninety or make a pledge of support for the programming that you've come to depend on at W. H. B. E.\nWork editors are Seventy is anniversary so for Seventy years folks in this city have and the surrounding area have depended on W. ab as a community resource and\nWe're not in it for advertising dollars were Internet as a service to this community and all of this community and its many diverse forms and so we need to hear from everybody right now\nAt six seven eight five five three Ninety Ninety where you can pledge on line at W. H. E. dot org and either way it takes just a couple of minutes and there's a really special reason to day to make that pledge right now\nSome of W eighties most generous members will match your donation right now during all things considered now this is up to Fifteen thousand dollars so please help us out\nDuring all things considered so please make that pledge of support and what ever amount is good for you it's good for us and it will be doubled so what's even subtly good six seven eight five five three Ninety Ninety W. H. B. E. dot org\nAnd if you really liked the idea of doubling your money and you wait for these matching days to come up\nThis is the final chance to do it during all things considered so if you're a fan of all things considered and who isn't then you should make that gift of support right now because if you wait for another time your money won't go quite as far\nTo support the program that you love that you're listening to right now six seven eight five five three Ninety Ninety or online at W. ab dot org seven pledges to go make that investment see it doubled instantly and we thank you [noise]\nW. H. B. E. gives you the information that you need to make your own informed opinion it's so imperative that that is a neutral source and we know that there are other places you can you know tune into on the radio dial and may present a different\nKind of approach but we know that you value the neutrality and thought behind the reporting on Ninety One so please make a contribution to support it to keep it on the air we need to hear from a\nTelling them down so I think for a couple um and you know we have three more minutes so we can do it you can do it at six seven eight five five three Ninety Ninety W ab ... and have that and get the support matched dollar for dollar\nYou know one thing Jim mentioned neutrality and is that neutrality that impartiality that so important for what one thing that the folks in the W. ab a newsroom and closer look and city lights one thing that they're not neutral about is the commitment to getting the story right\nTo bringing in different perspectives to reaching out to all parts of this community\nAnd to challenge folks who take a position no matter who they are no matter what part of the spectrum there from so that we can all make better decisions and to take the time to listen in the process not neutral about that we are committed to that impartial\nTo that you you and it's a deep and passionate commitment and so it all starts with your commitment six seven eight five five three Ninety Ninety or W. H. B. E. dot org\nIt takes just a minute to make that call or to go on line and pleasure support but do it right now is we close in on the six o'clock hour here on Ninety point one W. H. B. E. Atlanta have we heard from you we need to we know things can get busy\nWe know that the hectic Monday that you know coming off a great weekend Monday is like a a you know pump the brakes type moment right it it stops it in ... on the prairie and we get that right family kids so make the time right now because it could get away from you but you don't want this opportunity to three more people\nIn this hour to stay on track at six Seventy five five three Ninety Ninety were W. H. B. E. dot org and we're seeing names come in and want to thank everybody who made it get to support it took me aback for a moment though Dennis because I saw Jane ...\nA ... who made a pledge disco and Jane ... mother Jane although this is not my mother this is someone else and it does it threw me for a second thank you Jennifer ... yeah absolutely\nSix seven eight five five three Ninety nine used a number to call for you can pledge securely on line at W. A. B. E. dot org they're all kinds of other incentives I mean as if doubling your money during this matching gift day we're not enough\nThere's all sorts of material goodies that you can receive as a thank you gift and all you have to do to find out about those is to go to W. H. B. E. dot org slash thank you gifts mugs and T shirts and all kinds of swag\nAnd ... tote bag it ain't right of the pledge drives of the past although you can get a a um to baggage ... absolutely but take a look at them W. H. B. E. dot org\nSix seven eight five five three Ninety Ninety or W eighty eat out or\nWith your new sustaining donation of Fifteen dollars a month or a single\nContribution of one hundred and eighty dollars we'd like to send you to think you get the limited edition WABC short sleeved T shirt and WABC besides the shirt and socks both feature multi colored vintage radios are navy blue and have a fresh designed for a Seventy eighth anniversary\nThis limited edition T shirt and ... is yours as amused sustain or at Fifteen dollars per month [noise] please make your tax deductible gift online at W. ab eat out or core called six Seventy five five three Ninety Ninety and things [noise]\n\nAnd we're just about thirty seconds away from an update on today's news from NPR News in Washington and the WABC newsroom including a report from our own image hurt who's willing to talk about the controversy here in the ... that type of reporting we need you to support\nOver ... votes that are folks might have to be provisional because of problems with matching on the application six seven eight five five three Ninety Ninety WHAT eat out or live\nFrom NPR News in Washington I'm ...\nPresident Trump and first lady Maloney a Trump today are surveying damage in Florida and Georgia as a result of hurricane Michael Michael came ashore last week causing near total devastation to some areas of the Florida Panhandle one community Lynn haven outside Panama City Trump's that he's never seen this kind of damage up close hard to believe\nI've seen pictures but it's hard to believe when you're out of it they don't play the total devastation\nDamage to some other areas like the town of Mexico beach was even worse than the homes they were reduced to shards hundreds of thousands of homes or businesses in Florida and Georgia are still without power the hangers at ... air force base near Panama City Florida or ruin from hurricane Michael but\nHis wind daily of member station WFSU reports democratic Senator Bill Nelson says fears the base might have to shut down our unfounded\nSenator Nelson says the basis eleven thousand personnel and most of its aircraft were evacuated prior to hurricane Michael's landfall but hangar sustain heavy damage and some aircraft that remain during the storm are still being evaluated still Nelson says the base won't be\nClosing down as a senior member of the Senate Armed Services Committee [noise] I can say that to him do will be rebuilt and it will be an example of a modern us air force was\nNelson says ten dull is critically located next to the Air Force's eastern Gulf testing and training range in the Gulf of Mexico the U.S military largest he calls the training range quote one of our greatest national assets for NPR News I'm Ryan daily in Tallahassee\nThe former security director for the Senate intelligence committees pleaded guilty to lying to the FBI NPR's Carrie Johnson reports she'll be sentenced um December authorities\nSay James Woolsey lied about his contacts with reporters won the FBI interviewed him in late twenties Seventeen\nWolf has pleaded guilty to a single felony charge in a federal court in Washington D. C. his lawyers emphasize the wolf did not share classified information with reporters covering the Senate intelligence committee and at his sentencing hearing shortly before Christmas they're expected to stress his nearly Thirty years of service\nThe guidelines call for ... to serve between zero and six months the judges allowing wolf to remain free until he faces punishment Carrie Johnson NPR News\nWashington the federal government says it closed or just completed two thousand Eighteen fiscal year seven hundred and Seventy nine billion dollars in the red this tax cuts eroded revenues the room was also forced to pay more to servers to bridging national debt Treasury Department says deficit for the fiscal year running to the end of September was the largest since two thousand twelve\nSachs lost ground today the Dow was down eighty nine points to twenty five thousand two fifty the NASDAQ closed down sixty six points yesterday dropped sixteen points this is NPR\nSupport for NPR comes from NPR stations other contributors include that Jayanti and Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information or Mac found dot org and the listeners who support this NPR station\nFrom WABC news in Atlanta good evening I'm Martha Dalton it's six so for Georgia's voter registration deadline has been extended and four counties by executive order from governor Nathan Deal today that's after hurricane Michael for some elections offices to close on October night the original registration deadline\nPeople living in clay Grady Randolph and turned our counties have until tomorrow to register to vote in the upcoming November election\nEarly voting for that elections started today and some polling locations in Fulton County have already experienced technical issues for the first hour voters were turned away at Fulton County libraries credit Bolton tried to cast her ballot at the College Park library\nThey're saying that the system is down the very first day\nComing back later today hopefully they'll have it out\nA statement from Fulton County says residents are now able to vote that poll workers are checking in voters manually Republican secretary of state Brian Kemp is claiming Democrat Stacey Abrams is encouraging quote non citizens to vote cap was on Fox News this morning\nAnd ... early voting starts in Georgia today I think hardworking Georgians or should decide who they're governor is not people here illegally light my opponent walls\nA week ago today and the Florida Panhandle warnings about a category ... hurricane were suddenly urgently updated the storm would hit closer to category five but for thousands of people it was too late to leave and the town of Mexico beach for example more than two hundred people told police\nThey intended to stay many are still missing [noise]\nDemolition crews in Mexico beach have been clearing the way what we're houses and now look like heaps of matchsticks Brian Joseph settled down here with his wife and two kids after twenty two years in the air force they evacuated when he got back he hung a sheet on the front of his wrecked home\nThat says Mexico beach United\nBut he's not sure he will do not\nServe\nEven starting center\nOf your own two\nTwenty miles west along the coast much of Panama City is still without power cell service or Internet residents are depending on their car radios to get important information the local I heart radio station has switched to a call and format really\nReally desperate news that needs to get out of out of missing person yes there's a Jonathan ... is trying to locate\nDisaster officials also turned to the local radio station to share what they know where listeners can get gas food water and the addresses of the Eighteen shelter is currently housing nearly two thousand people\nMembers of a volunteer chainsaw army calling asking where they should go to help clear trees there are also calls from areas that feel forgotten rural poor communities like\nYoungstown and found this Youngstown okay not one person from the counting for the anywhere has been to the fountain area for helping any of\nLinda Robinson is standing in line outside wall or elementary school in Youngstown in front of about a hundred people waiting for food and water no one here as electricity and they haven't seen a line through yet next to her Tammy calmly so she's been in line here for hours\nOn ... just let you know where we are there's about two hundred others possibly altogether laugh thank God all the trees is in it now has gone for sleeping in the ...\nAll around Youngstown towering pine trees or snap that the middle the wind twisted the tops\nRight off live oak trees Roberta found new sitting on her Walker at the head of the line she's lived here sixty three years and last week she watched hurricane Michael rip the roof right off or a house\nIn our community have went out with all and pick people up off the ground that have lived there for three and four hours\nAnd we couldn't get a rescue service\nNeighbors are helping one another she says after nearly a week it's clear that her patients is wearing thin [noise]\nFifteen minutes later a convoy of power line trucks rolled into town six days after the storm Quil Lawrence NPR News Youngstown, Florida [noise]\nVoting rights are on the ballot this year and nowhere is that more clear than in Georgia Republican Brian Kemp hopes to be the state's next governor right now though he's in charge of running its elections as a reporter and the heart of member station WBUR ABE reports camp and his Democratic opponent Stacey Abrams how the history of disagreement over voting rights\nAbout a hundred and fifty people gathered at the Georgia State Capitol last week to demand the resignation of Brian Kemp Georgia secretary of state\n\nWhat has rallied people together [noise] news at fifty three thousand Georgians who have applied to register to vote are on the quote pending list their applications did not exactly match information on file with other government data bases down to punctuation errors\nThe Associated Press reports that nearly Seventy percent of those on the list are African American these pending voters can still vote in this election with a state id at the polls in a similar policy has been upheld in federal court in Florida but that doesn't make up for the conflict of interest according to Lydia Meredith and Atlanta and who is at the rally\nA travesty that the second\nHadn't already resigned because he can date ... that he had done this how old was\nKemp campaign spokesman Ryan Mahoney says the registration issue has been blown out of proportion\nThis is a manufactured crisis by Stacey Abrams for Stacey Abrams so calls for as a nation or calls for anything from the less it completely ignored because they're completely dishonest and they're just trying to feign outrage to try to turn out there to support\nExact match has been a policy of ... office since ... ten several civil rights groups challenged in court in twenty sixteen and parts of the policy were suspended but in twenty Seventeen to Republican controlled state legislature made it a law so some of the same groups sued camp again last week arguing the law violates the voting rights act\nDanielle laying with the campaign Legal Center is one of their lawyers\nThis policy doesn't flag the right people and leads to an extraordinarily high error rate where tens of thousands of eligible voters are flagged for potential removal based on you know a higher than here in space there or transpose dead yet\nBrian Kemp campaign blamed quote sloppy work by a voter registration group called the New Georgia project that democratic candidates Stacey Abrams founded that group is focused on minority and young voters ... office actually investigated the New Georgia project for fraud back in twenty fourteen investigation was later dropped\nAbrams told W. A. B. E. earlier this month that as a state legislator she has been fighting comes office for removing inactive voters from the rolls and allowing counties to close polling places\nFor me the question of voting is about expanding the right unfortunately my opponent has made his mission as secretary of state restricting that right and eliminating access and ways that have really harm the body politic\nCan't maintain his policies are protecting the integrity of Georgia's elections he points to recent comments from Abrams who said quote documented an undocumented people will be part of Georgia is quote blue wave kept appeared on Fox News this morning\nAnd look early voting starts in Georgia today I think hard work and Georgia and so you should decide who they're governor is not people here illegally like my opponent won't\nAbrams says campus taking her issues out of context but this issue is shore to fire up voters from both parties are recent NPR Marist Poll found that fifty six percent of Republicans considered voter fraud the biggest threat to this fall's elections that's compared to twelve percent of Democrats\nEarly voting in Georgia started today for NPR News I'm Emma hurt in Atlanta [noise]\nOn MORNING edition the Republican led Congress has largely gone along with the Trump Administration as it rolls back environmental protections\nDemocrats say it won't have an easier time if they gained control of the house but what could Congress do I can hear that story tomorrow by asking your smart speaker to play NPR or your local station by name [noise]\nBalance without the bias and in a time where the politics can be so heated you come to depend on Ninety point one W. E. B. E. to give you the facts just as they are as we heard from him or hurt a reporting there on an important race of national prominence\nI'm Jim Burress alone with dinner so we're glad to have you long for all things considered and we did is we need to hear from Seventy three more folks in this hour to stay on track six Seventy five five three Ninety Ninety WABC dot with\nAnd you may well ask stay on track for what\nAnd so will tell you the idea here and it's a great deal for you the idea is that if we\nContinue to stick to our goals your gifts will be matched up to a total of Fifteen thousand dollars by some of the most generous members of WABC they are willing to put their money on the table if we are willing to port hours and ... you see all of us together\nSo you're gifted we matched dollar for dollar at whatever level is right for you so for instance if you give one time gift of a hundred dollars some folks like to do an annual sort of thing all at once that becomes two hundred\nOr maybe you'd like to be a sustained her at ten dollars a month for instance\nIt'll be matched for the first year so your ten dollars a month becomes twenty and what a return that is how much more will that help bring you the programs that you depend on like all things considered\nWith the help of the folks in the WABC newsroom you just heard one of them ... hurt\nAnd that is just one of the amazingly talented journalists we have here at W. A. B.\nYou depend on them NPR depends on them to become part of the national broadcast and it all starts with you and your gift right now will be matched so helpless stay on track six seven eight five five three Ninety nine use the way to do it\nOr you can pledge on line that WABC dot org so easy to do it takes just a couple of minutes and you will feel great we promise\nAbsolutely and give a little give a lot it doesn't matter because the crazy thing about due to pledge drive and this public radio model is it takes all kinds of folks all kinds of listeners all kinds of supporters but we know because the research tells us\nThat only ten percent of our audience actually participate in funding the station now this is a big deal that means that nine out of ten people who call themselves WABC listeners WABC fans say on a regular basis you know I was listening to NPR and I heard mhm\nThey don't pay for it and that's why we have pledge drive like this because it does take a community of listeners", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Atlanta", "day": "15"}