{"month": "10", "state": "GA", "station": "WABE", "content": "Doorstep gone to their door steps to try to get them to respond well yes\nIn fact ah Mr Bush the boss to the uh the foreign minister so she ... she was stopped\nJournalists as she was leaving a confidence and generally just ducked as a microphone in her face asking how to respond and also appealing to the sense that she's a woman and she should take a stand on and of course the missing what she did not say anything and she's gone off\nA look we know that at least one newspaper as promised an investigation after journalists accused their senior editor but you tell us that you know this has been sort of whispered um this this notion that senior editors were harassing and assaulting reporters younger women who worked beneath them well yes\nSo there will be split all along in the newspapers across India that I mean you know uh I've been a gymnast for pointing to the U.S\nAnd uh I have only a day and um you know we spoke about\nMisconduct by senior editor auto colleagues so oh who use their positions of power to 'em to proposition and had a young guy a women in fact we've also a mud in the last few days we've heard some really big names or who have also\nBeen accused of some form of harassment one of them is a very popular act to Bollywood act out from the eighties\nUh called ... not so there are lots of big names that are now a set of starting to come out\nWe've talked about it I'm In private meetings a photo of a long time but this is the first time I can see that you know we we have actually something like this that's being that sustained for the last few days for\nMe to see where it goes from here the BBC's ... in Delhi on their me to moment in India ... thank you thank you very much [noise] and Jeremy ... you are now getting ready to depart Southern California\nRight we have ah been here we've been in a Texas in Illinois and Indiana as part of our election road trip and you're heading to Florida a very soon\nJust in time [laughter] you know I actually I'm Glad it was supposed to be a a mid term election trip but we obviously will be a following up on the devastation from this storm so we go now to get home here now in your hair knows production of NPR and WVU aren't association with the b._b._c. World Service I'm Robyn yeah\nI'm Jeremy ... and this is here in their\nFunding for here and now comes from the listeners have W. B. U. R. Boston from home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews Vulcan frozen book appointments online at home advisor dot com\nSupport for WABC comes from Emory jurors master degree legal training for non lawyers concentrations to include healthcare business and employment law on line at four part time options available more at Emory law J. Prem dot org\n\n[noise]\nWhich I'm not one minute before or and you're listening to members supportive Ninety point one W. A. B. E. Atlanta I'm Jim Burress glad to have your long on Thursday Afternoon\nHave an update on hurricane Michael from Panama City just ahead\nIf he is our fault pledge campaign and that's when we come to you and ask for your pledge of support cheapest programming on the air I'm joined by are you sure ... she's the director of individual given and we have a great our head or you should [noise] and\nI Am so excited gym to be here with you thank you so much for inviting me to come and talk with your listeners about how they can support W. A. B.\nIt's really easy to do do it before the hour gets away from your six Seventy five five three Ninety Ninety is the number to call or you can make that pledge of support online I W baby eats dot org it is the first day so we understand that haven't made that pledge jets it's okay but get it out of the way\nAnd you'll feel better about it how many pledges are we looking for\nLooking for twenty nine calls twenty nine contributions right now why not be among the first so you can brag about it you can catch up on the back and know that you've done your part and then you can tell your friends you know when you get on board do what you're supposed to do make that call to W. A. B. E. we would definitely\nAppreciate that and how often do you say to someone you know I heard on NPR or I heard on WABC today\nWhen you see that you can just throw in and I help support the station and keep it on the air is so easy to do six seven eight to five five three Ninety Ninety or securely on line to W. A. B. E. dot word\nCheck of news from the w._b. newsroom coming up as well as NPR News headlines this is member supported Ninety point one WABC Atlanta it's for one\n[noise]\n[noise] [noise]\nLive from NPR News in Washington I'm nowhere rom hundreds of thousands of homes and businesses are without power in the southeast us after a tropical storm Michael and battered the Florida Panhandle yesterday coming ashore as a category for hurricane before weakening\nNPR's Greg Allen phoned in from the road just south of Marron our ... our and our Florida he says trees and power lines are down everywhere\nEven in areas are because the place that Michael ... everywhere you're in for pine trees forces toppled over just like matchsticks office the houses are questioning these large trees and all that during the store there's no power little cell phone signal at least nearly everyone cut off here\nGreg Allen in Mariana Florida Michael has been drenched in North Carolina which is still recovering from Hurricane Florence last month the storm is expected to move into southeastern Virginia by tonight\nThe future of the international space station is uncertain after the failure of a Russian rocket that was hosted bring up to new crew members the pair returned to earth on harmed but as NPR's Nell Greenfieldboyce reports the Russian rocket is the only way to get people to the station and now it's under investigation\nKenny Todd as a manager at NASA\nFor the international space station he says it's three current residents are fine they've got plenty of supplies they were scheduled to remain up there it until mid December\nThat'll give our Russian colleagues are certainly reported two to three months to to try to diagnose this problem and understand what they need to do\nThe existing crew does have to return in early January because they're ride back home is a capsule with a limited lifespan\nIf the Russian rocket isn't flying by then the station may have to do without a crew for a while a big change for an outpost that's been continuously occupied for about Eighteen years now Greenfieldboyce NPR News\nUs stocks closed sharply lower again today today's sell off follows around yesterday that pushed the Dow Jones industrial average down more than eight hundred and thirty points NPR's John Ydstie has more on today's trading\nThe Dow fell about a hundred and thirty points with the opening bell but a positive report on us consumer inflation help support the market which bounce back and forth between losses in games in early trading than some negative news from the White House on trade tensions with China pushed ducks lower\nThe Dow was down almost seven hundred points at a low for the day before it regain some of the lost ground investors remain worried about trade issues and rising interest rates which are negative for stocks President Trump again criticized the fed for raising rates\nSaying the fed is out of control and making a mistake John Ydstie NPR News Washington\nRight before the clothes the Dow had fallen more than one and a half percent the S. and he lost more than two percent and the NASDAQ was down one percent this is NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of madman starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nFrom W. A. B. c.'s in Atlanta good afternoon I'm Martha Dalton it's for ... for governor Nathan Deal is assessing the damage from hurricane Michael at a news conference this morning deal said that dictator county in South Georgia was one of the hardest hit areas in the state right now\nAgain focus is going to be on the ... so that power line trucks and repair crews can access the areas that are without\nPower there have been hundreds of thousands of power outages reported statewide one hundred twenty seven state routes have closed due to fallen trees\nAnd an update on those power outages Georgia EMs he puts the current number and nearly two hundred thousand most of those in southwest middle Georgia, Georgia power says about one hundred and forty thousand of its customers are without power nearly four thousand utility employees are working to restore service\nAnd Georgia Tech is inviting football fans displaced by hurricane Michael to take in its game against Duke on Saturday for free tickets are on a first come first served basis starting at nine thirty Saturday morning\nThe only thing needed to claim a ticket is a valid state issued id showing an address in a county under a state of emergency\nThat many times headed to an energized debates do you worry that that had come to quickly is that is that something sustainable Republicans now that they have Kavanaugh in this state well they standardize and shut the well\nActually it comes right on the eve of the election I mean we're only three three weeks out the timing for a surge early couldn't have been better not that this was all planned you understand but I mean it was a great a break for us in terms of energizing our own people\nNow that part of it that you talked about as he's called Democrats an angry mob is actually emitting carbon mob\nA declared the mall but angry mob that was not what I said about our Democrat colleagues I\nDo think that they encourage a what went on and the Congress but you were here in the halls while we were literally under assault ourselves trailing members for their homes getting in their faces here in the capital I'm ever to clearly try to intimidate us in one of the reasons I was so proud of\nThe result last Saturday on judge Kavanaugh's that we stood up for it or to science has stood up to the mob and we are also stood up for the presumption of innocence\nOne major campaign promise that you were not able to fulfill that on health care and I'd like to know would you were a schedule vote to repeal the Affordable CARE Act if you do to keep them into our next year\nI usually don't announce what I'm going to do this far in advance um that was a disappointment of is the single biggest disappointment this Congress\nAnd really the only major disappointment we we were able to move on so many different from uh in fact if you're an American who prefers to country right of center I've said before and I would say again today this has been the best Congress and the time I've been in the Senate\nYou acknowledge that your party had to get a contender capital of talked about quite a bit in the past couple of days and they're also behind with minorities in some other great what does it mean for the long term viability of the ... if the party increasingly appeals mostly to heighten that\nWell you know we've done pretty well with Hispanics in the past and uh even the current president did better than a lot of people thought it was [noise]\nFor ... for Republicans and acknowledge that is going to be a challenge\nYeah absolutely and he said that he is going to make an effort to get more women on the Senate Judiciary committee next year he says he's asked in the past and he's going to ask again All right NPR congressional\nReporter Kelsey Snell talking about her interview today with Mitch McConnell are there on Capitol Hill Kelsey thanks so much Frank here [noise]\n\n\n\nYou're listening to all things considered from NPR News\nAnd this is all things considered on member supported Ninety point one W. A. B. E. where each yellow meets NPR and in that segment we heard an interview with Senator McConnell Mitch McConnell of Kentucky where he talked about his view of the Affordable CARE Act immigration women in the Republican Party\nAnd then Mary Louise Kelly talking about the back story with the reporter if that type of in depth reporting and personal\nKind of take on the interview to the back story the indebtedness that you come to depend on when you tune in to Ninety point one and that's what we're depending on you right now I'm Jim Burress it is our full pledge drive\nAnd we're asking for your support at six seven eight five five three Ninety Ninety or W. H. B. E. dot org and I am joined by public broadcasting in Atlanta is director of individual given given Ayesha Hyman ice it's good to have you with me\nJim you had me at back story\nBack story that's one of my favorite things about listening to NPR report says that you get all of that great\nContext you don't just get the headline you find out the Y. behind the ... behind the why isn't it great that we have this wonderful a platform for us to all learned so much about what's happening now and where it came from and potentially where things are doing with our country with our world but that comes with the cost right\nAnd so this is why we take these brief intermissions during our programming to invite you to become a supporter of W. A. B. E. and you can do that right now six seven eight five five three Ninety Ninety is the number to call\nAnd if you've been thinking about making a pledge but you haven't yet it is the first day of the drive so you know we'll forgive you we understand but it's a great time to do it now because\nSome of our most generous members of the station have given us money to match your donation right now during all things considered dollar for dollar up to ten thousand dollars where else can you turn five dollars into ten ten dollars into twenty or a hundred into two hundred it makes such a difference\nAnd it's very easy to do six seven eight five five three Ninety Ninety or W. B. B. E. dot org\nAnd Jim I've got another important number to share so we have a goal for this hour we started out with a little bit higher number now we've we did was knocked down a bit so now looking for a Twenty one calls\nAnd when you think about it that's not a whole lot\nYou can help us get to that goal when this hour simply by picking up the phone right now\nEither clicking making a couple of quick clicks dial that number six seven eight five five three Ninety Ninety and take advantage of that match stretcher gets I loved one of the points that you made about you know sometimes we think oh well my fifty dollars make a difference or a hundred dollars or a thousand dollars will it make a difference in station well it can make double the difference\nWhen you call right now six seven eight five five three Ninety Ninety\nYou're new to public radio and you don't know how this model works well see with me for a minute while explain that the biggest amount of the money that we used to pay our bills to pay to keep the lights on\nFrom NPR News this is all things considered I'm Mary Louise Kelly and I melted Chang in Florida it is the day after the day after hurricane Michael's land and to the states panhandle region search and rescue teams are going door to door through the area today\nFlorida governor Rick Scott said the storm has dealt a devastating blow to several communities\nSo many lives have been changed forever so many families have lost everything homes are gone businesses are gone roads and infrastructure along the stores past had been destroyed\nAll right NPR's Debbie Elliott joins us now from Panama City one of the places hardest hit by the storm communications are still difficult there but we think we have the right Debbie hey their pride I'm here to tell us why does it like there now [noise]\nWell it utter destruction and you know I've covered a lot of hurricanes and this is probably one of a you know the ones I have\nI Would say are in the top ranked in terms of just every where you look\nThere is something wrong nothing is right um you know people here talk a little bit about losing their bearings in some places because things are gone trees are snapped into their down everywhere they're on top and through all kinds of structures\nThat huge metal light posts are just twisted like there are a crumpled papers straw ribs have been ripped from buildings windows have been blown out and when you try to go down any street um they're covered by felt trees or power poles\nThey're also all kinds of debris on the roadways their power lines down just random stuff like street signs or glass or a chunk of a billboard it's a it's very difficult terrain\nWow what a picture you just paint it what about rescue efforts how are they going so far\nWell uh it's been difficult to get to people but there were underway I'm right now ... the the the the\nThose fought lift things I'm the word I'm losing it but they're trying to clear the roads of all the stuff so that emergency vehicles can get through there lots of power trucks here but the power trucks can't get to work of course until um the the the things are back\nOut of the way for them to get to where they can put the power lines back up so right now it's just a matter of trying to get everything out of the way so that that the work for recovery can began but the bigger issue is getting to people who need help\nAnd have you been able to talk to a lot of people affected by hurricane I mean how are they holding up\nYou know I think right now people are just trying to figure out what's next for them um I went to this apartment complex and Lynn haven which is just north of Panama City um and it's a mess you know you can see the top rooms open to the sunlight because of the roof being gone and treat them\nI talked with Tonya Robin ... who stays there with her family um she says she's homeless and it's been living with them and she can't believe what she thinks she's a native of Panama City\nWith the station out here it's horrific that is I mean I'm ... and this is so much shop because I'm never seen this happen in Panama City before\nNow than it is that we keep seeing here are of complete destruction but can you can you give us a more accurate scale of the damage right now\nYou know there is no count or anything but the kinds of things they're facing there's a water boil notice so you can't but you can't really blew\nYour water if you don't have power um unless you have a way to set up a fire so those kinds of problems\nWhat are facing people All right That's NPR's Debbie Elliott in Panama City Florida thank you daddy You're welcome\nTo another story now millions of Americans post our ancestry information online new research is showing just how easy it is for law enforcement to use this data to zero in on relatives who may have committed a crime NPR health correspondent Rob Stein has the details\nPolice made headlines last spring when they finally nabbed a suspect first series of brutal rapes and murders and California from the Nineteen seventies and eighties\nAs the golden think Heller finally been captured California investigators jak match dot com to name judge has changed the Angelo as a setback to genealogy west side to try to identify the notorious home state killer\nAnd that was just the beginning police around the country of started doing the same sort of thing to solve other cold cases so young ... Ehrlich kept the company my heritage wandered just how easy is it to use databases like his to find people\nWe wanted to quantify how powerful the technique to identify individual\nSo Ehrlich and his colleagues analyzed the DNA for more than one point two million people in this company's database and discovered something startling for more than six percent of people of European descent they could identify or relative as distant as a third cousin most of the people in this database or white\nEach person in the debate as it because that illuminate hundreds of ... so it's enough to live with your third cousins or your second cousins once removed in the debate as to actually identify you\nThe same way that a GPS than you the multiples because I like to find a location\nAnd when the researchers combined their data with other information like where a person probably lives and how old they are they could quickly zoom in on a suspect\nOf course you need the geological records you need to do the war but you have enough power to to get very close\nAnd early use the same techniques to identify it supposedly anonymous woman whose DNA was stored on the national institutes of health research database raising questions about how would not miss these supposedly anonymous databases really are\nThese picnic doesn't only can get you ... you can catch criminals with these technique but you can also use this technique for other purposes maybe purposes that could be either due to it\nSo early says the findings raised questions about how genetic information could be misused\nThe police to cover the using these techniques to find these really like you know ... and\n... people but uh we okay we've using these techniques to identify people that I don't know in the political demonstration that leftover DNA behind a wheel K with if foreign governments are going to exploited the technique\nTo identify us to do this for their own purposes so that there are many scenarios that you can think about me you\nKnow many people defending use of these techniques to help solve serious crimes\nExcited to see this demonstration that genetic genealogy is so powerful\nEllen great tack works at ... banana labs which helps police solve crimes is way\nWe're working on these changes that you haven't been able to be solved for decades they're all either homicide or sexual assault and and some of these are just I mean they're her effect you know murders or children things like that it just [noise] things that need to be solved\nAnd grey tech says it's not nearly as easy as this new research may make it sound but others argue that the findings underscore the need to make sure people know what they're getting into when they agree to give up their genetic information Erin Murphy is a New York university law professor\nIf it comes out tomorrow and that they can use genetic information for something that feels a little unsavory it's going to be virtually impossible to claw back the information that you've put out into the world and more importantly you've made a decision not just for yourself but for your siblings figure getting cut inspire people you don't even know you're related to for your children for your children's children\nSo Murphy and others think better ways are needed to protect people's DNA to make sure it isn't misused\nRob Stein NPR News [noise]\nRussian archbishop Oscar Romero was fascinated in El Salvador in Nineteen eighty Romero was a dedicated champion of the poor and marginalized tomorrow the Catholic Church will make him things you can hear that story tomorrow by asking your smart speaker to play NPR or your local station by name [noise]\nYou're listening to all things considered\nFrom NPR News and you're listening to it on member supported Ninety point one W. B. B. E.\nA. T. L. meets NPR I'm Jim Burress good to have you along and whether it is a story about a privacy question in your genetic makeup or mid term elections or a natural disaster and the aftermath of those\nWho are coming back from it our neighbors all around it's the type of in depth news you get every day on all things considered and it's called all things considered either us go Ayesha Rascoe a new a namesake yeah absolutely we're talking about her in the\nIn the last breaking new a political reporter to NPR Ayesha Hyman or director of individual giving is with me and all things considered is just that\nIt certainly is and you know I Love listening to W. A. B. at this time of day and I get stuck in my car what we call those driveway moments where I don't want to get out and I know you have those moments to\nMake more of those moments happened there's so much going on right now and we don't want to miss any of it we don't wanna miss out on the inside\nUnderstanding more about what's really going on in our community and in our world you make that happen by being an active participant so we know you listen and we appreciate that but we love it even more when you pick up the phone and call during the pledge drive right now is your time to do it so you can be a part of this match\nIt is so easy for six seven eight five five three Ninety Ninety or W. H. B. E. dot org and when you do that right now what ever you pledge will be doubled yes amazing thanks to the members of those who support this station at a special level we call it the cornerstone level that's right\nWe want to continue to be here for you in that way but it takes your support so that's the reason the palm six seven eight five five three Ninety\nNinety and there's an extra reason right now to make that call the six seven eight to five five three Ninety Ninety\nOr make the pledge on line to W. H. B. E. dot org and that is because right now during all things considered your gift will actually be doubled so if you make a one hundred dollar pledge becomes two hundred dollars two hundred becomes for\nAnd it's through this collective given that this radio station has been able to stay on the air now for Seventy years and why the future is bright so we say um and it's only bright because of listeners support sure we have underwriters and sure there is a small sliver of\nOf funding we get from the corporation for public broadcasting about ten percent among many yeah if you got any relatives or paycheck right right you'd be hurt and\nI just I wanted to underscore that Jim how important it is I think for all of us to to know that we do this together it's us regular folks right when we're not counting on someone to someone\nHuge corporate entity or government entity it's individuals who act as a collective to make public radio happened you're the engine as as the contributor as the donor so right now is your opportunity to to keep us going feel less make sure that we have what we need to bring you the next local story the next international\nReport six seven eight five five three Ninety nine to\n... and when you say local too I think that's an important point to make that it doesn't matter if it's news from across the globe across the street or across the perimeter W. H. B. E. keeps you connected to the folks around you and to the greater a kind of humanity and it is reporting with humanity in mind\nWhere individual voices matter and were stories are beyond just headlines and we know you value that why because you're listening right now and because you are listening right now we're asking for your support\nIt is very easy to do maybe you've done it before maybe you have it and if you haven't let me tell you how to do it right now six seven eight five five three Ninety Ninety or W. E. B. E. dot org\nAnd then after you call pick up the phone or tax ten of your friends because we are looking for eleven cause that's what we need right now to make our goal the counting on you and ten of your friends so six seven eight five five three Ninety Ninety or online at W. A. B. E. dot org\nIt's so easy to do so won't you do it right now six seven eight five five three Ninety Ninety W. H. B. E. dot org you're listening to members supported Ninety point one W ab ... Atlanta\nSupport for NPR comes from the station and from universal pictures presenting the new film first man from Damien says out director of la la land and whiplash and starring Ryan Gosling and Claire foie in theaters and IMAX tomorrow\nFrom the main office of tourism offering travelers an opportunity to explore and discover their very own Maynes thing to be inspired the original and be yourself at visit main dot com\nAnd from little passports a monthly subscription service for kids each package includes games souvenirs and activities from a new country designed to spark curiosity and cultures around the globe at little passports dot com slash radio\nDo have cold feet about joining Ninety point one will warm you up with a pair of WABC sucks\nWith your new pledge at ten dollars a month or one time gift of one hundred and twenty dollars we'd like to offer you a pair of our limited edition WABC socks and a brand new designed to celebrate our seventieth anniversary with a fresh look featuring goals green and red radios through the ages also commemorate WABC Seventy of anniversary\nThese limited edition socks or a fun way to personalize your feet while standing and supportive WABC please make your donation WABC dot org or called six Seventy five five three Ninety nine\nThan you and we're back to all things considered and just a moment the Sox are actually pretty impressive I've got to say\nI got yes and the weather's breaking right it's getting a little cooler outside a great way to brag without really stay in too much is just wearing ...\nYou can wear it and listen to wherever you are because WABC is available across the globe twenty four seven at W. H. B. E. dot org it's full of local news stories national news and features that you can only get on that website\nAnd when you make a pledge of support you're supporting the entire public broadcasting in Atlanta kind of offering so our election coverage that special on WB\nThe programs you here right now all things considered\nCity lights with Lewis writes is closer look with with the throw Scott I mean it goes on and on and on and you get these really cool way for us to say thank you the facts the T shirt the bumper stickers that match do it right now six seven eight five five three Ninety Ninety\nAnd we can't do it without you that is why we're asking you to call right now six Seventy five five three Ninety Ninety W. H. B. E. dot org do it now and have your gift to match dollar for dollar it's five oh one\nLive from NPR News in Washington I'm jak beer\nForecasters say what is now tropical storm Michael is moving quickly over the Carolinas before it starts to head out to sea\nThey say the storm's winds about falling from a hundred and fifty five miles an hour to fifty miles an hour but the storm is still dropping up to seven inches of rain causing flash flooding across parts of North Carolina and southern Virginia North Carolina governor Roy Cooper says problems from the storm but developing his state's\nAlready several water rescues are occurring in the west this morning at least sixteen roads have already been closed due to Michael and this dorms rain and wind or now spreading these\nMichael came ashore yesterday along the Florida Panhandle as a powerful category for storm devastation left and Michael's wake was readily apparent this morning at least five people were killed in Florida and Georgia by the storm\nThe Supreme Court of Washington state is striking down that state's death penalty law as unconstitutional from K. U. O. W. in Seattle page browning has more\nWashington Supreme Court ruled unanimously that the state's death penalty law is administered in a racially biased manner the court is immediately converting all eight capital punishment sentences in the state to life imprisonment without parole\nGovernor Jay Inslee has been forced a moratorium on executions since two thousand fourteen\nNow Washington is the twenty state to abolish capital punishment joining Delaware and other states that outlawed it in recent years\nThe ruling leaves open the possibility for the legislature to reinstate the death penalty if it can craft a system that quote does not offend constitutional rights for NPR News I'm Paige browning in Seattle\nMaybe with rapper Kanye West of the White House today President Trump says he is open minded about what is known as the stop and frisk policy Trump's comments come after remarks he made in favor of the idea earlier this week to deal with crime in the city of Chicago\nPresident is blaming the Federal Reserve and rising interest rates for this week's stomach turning moves in the stock market is NPR's Scott Horsley explains the White House insists the president is not trying to interfere with the feds independence\nFor the second day in a row President Trump PIN responsibility for the stock market's gyrations on monetary policy from the Federal Reserve even though the fed has carefully telegraphed it's gradual move to boost interest rates Trump claims those rates are rising faster than he and others expected\nI think the fed is out of control I think what they're doing is wrong\nTrump complained that said get interest rates low during much of the Obama administration during the early days the recovery he was equally critical of the Fed's easy money policies despite his concerns about interest rates Trump says he has no plans to remove fed chairman Jerome Powell Scott Horsley NPR News Washington\nTracking the numbers the Dow dropped five hundred and forty five points today you're listening to NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and it was about who pair premiering October twelve on prime video\nFrom Delhi UAB in is in Atlanta good afternoon I'm Martha Dalton it's five or fifty three thousand voter registration applications are pending the Georgia secretary of state's office\nThe government says these voters are able to vote at the polls with a valid id the hiccup comes from George is quote exact match policy Danielle ... is an attorney who's been working to stop the practice\nThis policy doesn't fly to the right people and leads to an extraordinarily high error rate where tens of thousands of eligible voters our flag for potential removal based on a higher than here in the face their\nExact match requires registration exactly line up with the information from drivers services or the Social Security administration\nGovernor Nathan Deal is telling people in southwest Georgia to be patient as crews that removing debris left in the wake of hurricane Michael more than one hundred twenty state roads are closed and debris removal is key to get power trucks and to the area the governor's urging the public to stay out of their way past\nExperience tells us that one of the greatest impediments to restoring power\nThere's people who get in the way all the power trucks and the crews working to make that happen\nThis trailer has been down to ... Texas has been to um\nFlorida a few times it's been to new\nJersey has been some George Clinton Boykins is coordinating the effort to our mission is to be the hands of the of Jesus we want to be able to help as many people\nAnd be able to just show our love and are here for the community everywhere we go\nBut this effort has a twist the lumber to city manager knowing his populations needs reached out to the mayor of San Juan Puerto Rico Carmen ... Cruz asking whether she could send some people to assist the operation blessing crew\nPuerto Ricans were hit last year at this time by Hurricane Maria\nMayor cruise asked for volunteers and there is a five person crew from San Juan here today serving food issues Florence who works for mayor coups led the group to ...\nThe only right thing to do was to to to say if if you have to recruit them\nAnd we said when he volunteered they separate they step in and we've been here since the second was we plan to stay till the Seventeen hundreds where NATO we will make you arrange needs to be back\nThe the ... ...\nSays mayor cruise reminded us that people from the U.S mainland had come to Puerto Rico after the hurricane to help we want to return that helped ... says with much love them\nDavid Adams is the cook here today\nWe made a faded chicken fajitas with ... with white rice and of\nThe recon team\nHelps me with a range and all the menus and everything and and they do a lot of the cooking\nPeople here in Lumberton there'd been nervous all this week worried that hurricane Michael would come their way accounting government opened an emergency management center stories from government offices are closed today\nPeople were encouraged to stay home as it turned out there wasn't much of a storm here today which is good because the city is still far from normal as soon as Flora says his delegation of Puerto Rican volunteers knows well how long hurricane recovery can take\nFour sympathetic with the people of Florida getting hit by a purity Michael any they needed there we will do whatever is possible to go there we know what it's like\nThe Puerto Rican side of this relief ever goes by the name pay it forward Tom Gjelten NPR News lumber to North Carolina\nOkay let's go back to that moment when two women confronted Senator Jeff flake and an elevator on Capitol Hill out the sexual assault allegations against Brett Kavanaugh\nFor your time\nAfter that confrontation flick insisted on an FBI investigation prompting some to praise the moment as evidence that protest works how protests continued here's this past Saturday [noise]\nPeople rushing the doors at the Supreme Court as Kavanaugh was sworn in but what some see as constructive protest\nOthers including the president called a mob\nYou don't hand matches doing our citizens and you don't give our do an angry left wing mob and that's what they'd be\nLooking at a rally in Kansas shortly after Kavanaugh was confirmed while he is not the only Republican talking about mobs using that word\nPrompting us to wonder whether a new Republican strategy might be taking shape right before the midterms while Whit Ayres is a pollster who has advised Republicans for years welcome back to the program Mr airs good to be here\nSo we just heard the president they're talking about a left wing mob a Senate majority leader Mitch McConnell has called the protesters a mob Senator Marco Rubio has been tweeting he tweeted over the weekend saying imagine what the cable news coverage would have looked like if an angry mob of conservatives had stormed the steps of the Supreme Court so\nWhat do we think is going on here the Kavanaugh a confirmation\nBattle United the center right coalition unlike any event during the Trump presidency other than the Gorsuch nomination and part of the reason for that or the loud protests so the tactics or the left ultimately undermine their cause\nJust take a step back with me for a minute we all talk about the lack of civility in Washington these days or a direct question but does calling ones political opponents a mob\nHelp\nI think it is symptomatic of the politics of our age\nIs it\nThe president's responsibility leading the entire country to try to rise above the politics of our age even for weeks out from the mid term is to find some way to try to bring Americans together and not divide\nMary Louise there is no way I can answer that question why died without getting myself\nIn trouble [laughter] so we put into this way there are practical consequences of hardening battle lines and wild no party has blameless in Washington these days it makes it harder and harder to cross party lines and actually get anything done\nYes it does and\nIn order to actually get something done we're gonna have to have people like our clients in the Senate Marco Rubio and Lindsey Graham and Lamar Alexander and John Kennedy who will\nReach across the aisle and form bipartisan coalitions these are all class of ours is our clients have done repeatedly and will continue to do\nYou mentioned Lindsey Graham is one of your clients yes he had quite the turning the Kavanaugh hearing where he came out that ... I've ever seen him know me too yeah how do we square that with the politics of getting reelected the politics of doing the right thing in terms of the country\nI don't think it's any more complicated than the Kavanaugh hearings bringing out in Tempe emotions\nOn whole sucks [noise] and I guess the circles us back to my original question of have the Kavanaugh hearings coalesced into a different strategy is Republicans look at these last four weeks for Americans go to vote\nNo adult tickets coalesced into a different strategy what it is done ears unite the various parts of the Republican center right coalition in a way they were not United\nBefore what airs thank you so much it's my pleasure being with you that's Republican strategist and pollster Whit Ayres he's president of North Star opinion research\n[noise] Mm\nYou're listening to all things considered from NPR News\nSupport for NPR comes from the station and from logged me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com\nFrom exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at\nThe guard test dot com [noise] and from the listeners to support this NPR station\nInside an inquiry that you have come to depend on and that makes a difference\nNot just for news value not just for conversation value but it can influence the vote that you make at the election booth when you go in you cast your ballot and that is imperative to our democracy so you're doing your part by keeping informed with Ninety point one WABC\nAnd we're going to ask you right now to do your part to\nHelp fund the programming that that um you've come to depend on how six seven eight five five three Ninety Ninety or W. H. B. E. dot org and I am joined by ... director of individual giving for WABC and you're flushing the number at me I should say\nYes because I'm so excited about the progress we're making we started out with a goal of eighty two pledges we're now down to we made the practice of down to sixty three sixty three as our new goal so we are cooking\nWe are cooking but we want to add a little oil on that we need it for you right now and and make even more progress because we we we've got to make that goal in order to continue to\nDo Jim said be influential you know these stories as as you mentioned gym they influence our decision making right\nAnd guess what you as a listener you have the ability to be influential as well\nYou have a huge amount of influence an impact on your community through your support of your public radio station that W. A. B. E. so right now use that influence do something good with what you have make that contribution to the station right now six seven eight five five three Ninety Ninety\nAnd why do it right now well not only does it keep us on track to um to meet our our lead benchmarks for this drive but some of our most generous members have given us money to match your donation right now during all things considered\nThis is up to ten thousand dollars you're gift is just waiting to match oh you have to do is pick up the phone call six seven eight five five three Ninety Ninety or pledge on line at W. H. B. E. dot org and joined those who believe in the station's mission\nFolks like Derek Townsend and Leon Wilson also Jeffrey Barnes ... a cat insurers ... Khan thank you so much for being part of this matching fund we couldn't do it without you and every dollar matters every pledge matters at six seven eight five five three Ninety Ninety or W. H. B. E. dot org\nAnd another number for you so this matches up to ten thousand dollars so think about that if you make a gift right now when you make your gift right out of a thousand dollars it becomes two thousand [noise]\nThis is all things considered ... Chang and I'm Mary Louise Kelly President Trump and rapper Kanye West met for lunch today one topic on their agenda was gun violence in Chicago and what to do about it the president's ideas on this are very different from what reformers and local leaders are trying to do\nA difference that was on full display this week as NPR's Martin Kaste reports Chicago's had a rough few years\nIn twenty sixteen murders just\nTo the highest rates in two decades something Trump talked about a lot during his campaign since then the murder rate there has fallen some but gun crime remains a stubborn problem and this week the president said he wants to help\nMy of director the attorney general's office to immediately go to the great city of Chicago to help straighten out the terrible shooting wave to straighten it out on a straighten it out fest is no reason for what's going on there [noise]\nBut what that means it turns out the opposition\nThe administration is filing a brief with a federal court saying it opposes a package of police reforms in Chicago that's known as a consent decree the decree aims to improve police training and rebuild trust between cops and the public Trump does not like consent decrees he says the real cure for Chicago is more intense of policing\nStop and frisk it works and it was meant for problems\nLike Chicago [noise] it was meant for stop and frisk Trump says the widespread\nStopping and for skiing and potential criminals reduce crime that conclusion is contentious though and stop and frisk can also turned into racial profiling under twenty Fifteen court settlement Chicago police have had to fill out extensive forms justifying their stopped which has led to fewer stops\nThe administration believes this sort of court ordered limitation on policing can make crime words and that this new consent decree is more of the same\nBut Lisa Madigan says it's a little late for them to be weighing in we really\nHaven't had any keep from them and count now\nMadigan as the Illinois attorney general last year in an unusual move she sued the city for a consent decree doing the job that the Trump Administration would not\nOr if they wanted to have a role or they had that opportunity they decided that they uh get knocked and therefore chose kicking nothing\nShe regards the consent decree as unnecessary reform but that word is not reassuring to former cop Peter Moskos\nYou know reform as a word is just his money and lives those stop and frisk\nHe's a professor at the John Jay College of criminal justice in New York and host of a podcast called quality policing\nIt calls him to agree with the Trump Administration on something but he says the evidence from places such as Baltimore is that federal consent decrees can sometimes make crime worse by limiting the intensity of policing in the places where young men carry guns and shoot each other\nIf we're going to reduce murders we have to go to places where murders happen there's going to be racial disparity but that is separate from racial bias and racial bias has to be attacked but certain neighborhoods need more policing\nMany policing experts these days lament what they see as a false choice between the strictures of Obama era consent decrees and Trump's unquestioning support for intense of policing\nIn Chicago's city leaders are digging in against Trump's rhetoric asked about it yesterday Mayor Rahm Emanuel lashed out at reporters for taking the administration's opposition seriously\nYou guys even in the stories acknowledge it has only symbolic value you guys got to stop acting like ab loving little mice chasing every time Donald Trump said something it doesn't have any value\nTrump's opposition to Chicago's consent decree probably is symbolic the administration's brief is not likely to stop its approval in court but on Monday when Trump called for stop and frisk the applause from the police audience was very real highlighting the ongoing tension between them and the reformers\nMartin ... NPR News\nThank God the crew it'll lives those were the words from it soaks men for Russian President Vladimir ... after a Russian Soyuz rocket carrying two astronauts to the international space station failed during then today\nThat lift off had proceeded smoothly for about two minutes then came in real life drama\n[noise] [noise] [noise]\nAnd I have five sons have it on my family out of there was that\nCrew American the tank and Russian Alexei of children are safe and after an emergency landing in context on three other astronauts are currently on board the PlayStation ...\nReturn home might be delayed for more on on us and we are joined by Canadian astronaut Chris Hadfield he served as commander of the international space station in twenty Thirteen and flew up there and back any Russian Soyuz capsule welcome\nThank you nice to be talking with you also\nStill this was going to the American Nick hates the first time into space ... seconds for like ... ... what kind of training with they had had to handle a situation like that\nBoth of them and training for decades Alexei as a cause but not for quite a while as you say with space flight experience Nick prior to being an astronaut\nWas a test pilot in the U.S air force so that's an extremely risky complex job so they've been getting ready for this for many many years and then specifically for this launched working together for a couple of years we wring out every last thing that could possibly go wrong\nAnd the way that crew behave there were so Chris and professional right on top of their game you would never know that the vehicle was behaving so badly if you listen to all Alexei ... which dealing with things bringing them both safely actor\nWhen would be the next chance you could go on a mission like that again I mean I Can't imagine the psychological blow\nYeah you're you're right you know the crew at first will be super focused in professional and doing their job but afterwards they're just going to be kind of mad because they didn't get to go to isn't based today you know kind of\nLike gosh all that preparation that you're into that but neither of them got hurt and there are back on the game and they'll have a chance to fly again by and I don't know who will fly next it's way too soon to tell it's going to be a long time to figure out what went wrong\nAnd then we'll have to start thinking about who should fly next what skill sets should we need one is that going to be all of the repercussions that come from an event like today\nTell me what it will take what kind of conversations are going to have to happen to figure out how to move forward the\nFirst thing we need to do is find out what went wrong what failed in this rocket there's a lot of information people be able to sift through video of it but also the sensors on board then we need to see how can we fix it was it a design problem manufacturing problem who knows\nThat and once you know that you can fix it then you can set a timeline if that in three months from now than no big deal but if it's going to take a year or two years\nThen we need other plants bowling is building a rocket that can take people to the space station or ... or a spaceship SpaceX is building a ship that can take people to the space station maybe they could be accelerated maybe they could fly before the Russians are going to be ready to fly again and window we bring the crew back from the space station all of those questions need to be analyzed\nThe way I understand they were expecting to return home and now that return could be delayed correct\nThey flew up and the different ... to the space station it's sort of like a lifeboat or their their their ride home if they're they can come home anytime they want to buy\nIf they ... to come home and they are basically abandoning ship the space station would be empty and it's a big enough and complicated enough chef that after a little wild things start to go wrong and there'd be nobody there to fix them so it really causes a lot of risk for the space station to leave it on man\nSo people will be looking really hard at all of the limits and have to decide what the right trade offs are we don't know the answers yet but it's going to be a really complicated decision making process coming up\nChris Hadfield went the first Canadian commander at the international\nSpace station thank you very much for joining us today\nNice to talk they also affect you [noise]\nThat is NPR News\nBy growing human retinas in a dish scientists have shown how the eyes of a fetus acquire the ability to see color\nThe discovery hints at new ways to treat the leading causes of blindness in adults more on that later in the hour here on all things considered from NPR in Ninety point one W. A. B. E.\nGood afternoon I'm Jim Burress with ... is our first day on the ... of the full pledge drive and stories like that I I used to I had a grandfather who um went blind later in life and\nYou know when you hear a story that resonates with you and and those stories happen all the time on all things considered MORNING EDITION closer look it doesn't matter the program um it it is the type of news and information and content that speaks to you\nRight and you know in the in the quality of the reporting the quality of the story telling you if you will it's at such a high level because of how we're funded because of how we support it we don't have to\nBoil everything down to a quick little sound bite we have time to expand to get into the context of getting into the history of of why things are the way they are\nThat's because of the support of individual listeners like you are listening right now so six seven eight five five three Ninety Ninety as the number that we are inviting you to call become a supporter is a stain or and participate in the match\nOn this first day of our pledge drive and the match the ice was talking about is courtesy of our matching funds us from our cornerstone members and some of our most generous members in the cornerstone program have given us money to match your donation\nThat really meant something to me um although I have no personal connection I disliked hearing about what happened to these human beings a year ago when the storms hit Puerto Rico and hurricanes we were so devastating they're totally appreciated the fact that NPR\nA year later did a follow it because you wonder those are human beings they're they're affected by something very similar to what we're experiencing in our own region and appreciate the fact that NPR does that that level of outlet\nAnd seeking the truth you know there was a lot of question over how many people actually died unfortunately during that disaster and there were different numbers coming out from Washington and officials and then what people citizens in Puerto Rico we're seeing and so to go back and hear those stories and a year\nOr you know we often forget about what happens you're going to be reminded is essential um and and that is what you get every day on all things considered and W. H. B. E.\nAnd that's why it's essential that you support the station right now with the gift to six seven eight five five three Ninety Ninety or do it on line to W. H. B. E. dot org and we are kind of in the home stretch now to use the sports metaphor\nYes we are we're we're looking for a forty seven we started out at eighty two for this hour forty seven we've been doing pretty good\nYeah that's a heavy lift though as we go into the six o'clock hour forty seven listeners to all things considered to keep us on track to meet our overall goal for this hour so we've got a lot to chip away in these last few minutes but here's the good news if you hadn't made a call and you have major pledge if you start\nRight now if you're on the phone at six o'clock it's still counts for this hour and you can keep us on gold but even better than that\nNo matter what your pledges up to ten thousand dollars\nIt will be doubled its right during all things considered today\nWhatever amount you get is going to be doubled due to the general support of members of W. H. B. E. like Nancy ... hall Rosemary muggy and David ... thank you so much for your support let us thank you with a gift when you get a gift to double\nHe at six Seventy five five three Ninety Ninety or W. E. B. E. dot or\nYou know what ... often happens here when we're doing I pledge drives is how we start the campaign totally impacts are morale and how we finish right so when we start strong\nIt just makes it so much easier for us to kind of get through and get accomplished what we need to get accomplished so we want to start strong especially today this first day of the pledge drive and so that means your participation your call right now especially while we have this ten thousand dollar match\nOn the table we don't want to give back any of that money we want it all to go to the next story all of the reports that we want to bring to you in the coming season next year we want to be able to bring that to you but we can only do it when we have the support of our listeners and that means you six seven eight five five three Ninety nineties\nAnd it is easy to do it just takes a moment and overall our goal for this Dr seven thousand Seventy people now on any given week we understand something more than a half million tuned into the station that's what the numbers tell us that's what the ratings say\nImagined that about half a million we need to hear from seven thousand now we want to take a moment to think our sustain ers because our ... don't give during regular drives to give once and then every month that gift is broken up and continues\nIt is easy you can do it said it forget it and the money goes to work with right away to keep this programming on the air to keep a service on the year that you've come to value six Seventy five five three Ninety Ninety or W. H. B. E. dot org we need to hear from forty three\nHere right now to keep us on track thank you\nSupport for NPR comes from this station and from Amazon Prime video presenting the return of the man and the high castle were America's history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nFrom the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics ... solutions learn more see three I O T dot a guy\nFrom the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verified dot Gov slash go and from the listeners who support this NPR station\nEvery weeknight you tune into W. A. B. E. for all things considered you're getting two and a half\nHours of live up to the moment news this happens because we're listener supported and that means that your donation\nMakes it all possible you can make W. A. B. E. even stronger in the coming year with your contribution right now costs six seven eight five five three Ninety Ninety or go to our website and make your donation there at W. A. B. E. dot org and while you're there take a look at some of the ways we like to say thank you six seven eight five five three Ninety Ninety\n... Ninety four one WABC Atlanta live\nFrom NPR News in Washington I'm ... beer thousands of National Guard troops along with law enforcement and other rescuers are making their way into areas along the Florida Panhandle devastated by hurricane Michael NPR's Debbie Elliott in Panama City and describes the scene there today\nIn Panama City there is just utter destruction groups have been ripped from buildings windows are blown out power pole light post twisted like they were something like a paper straw trees are snapped down everywhere every time you turn around and go down the street you can't\nBecause of things in the road mostly trees but also power lines pieces of billboard the front facade of the church had completely come off there is devastation on every street to just about every structure that I've seen in Panama City\nDebbie Elliott Michael's now a tropical storm moving through the Carolinas at least a half a dozen deaths are being blamed on the powerful weather system\nOr to amend crew aboard a Russian Soyuz spacecraft bound for the international space station as safely back on the ground a strong Nick Kagan Russian cause ... made an emergency landing after their capital separatists\nMalfunctioning rocket and brought them back to earth we'd wise men as NASA deputy chief astronaut and explains what happened\nFor the Sawyers of ballistic motives the safest mode and all that really means is it's like a shooting and blow it out of a rifle barrel it starts slowly spinning the dissent mazel so that has occurred in mixed ability as it comes back through the thick or parts of the atmosphere and then the ... comes out and they laugh\nMoscow's immediately suspended all manned space launches pending an investigation\nTens of millions of Social Security recipients are getting a boost in their benefits next year following a stretch of low inflation government reports the annual cost of living adjustment or cola wise by two point eight percent in two thousand Nineteen raised miles through about an additional thirty nine dollars a month for the average retired worker\nUs stocks fell sharply again the day with a ... and five hundred and forty five points on top of yesterday's eight hundred and thirty point loss NPR's John Ydstie has more on today's trading\nThe Dow fell about a hundred and thirty points at the opening bell but a positive report on us consumer inflation help support the market which bounced back and forth between losses in gains in early trading then some negative news from the White House on trade tensions with China pushed ducks lower\nThe Dow was down almost seven hundred points at a low for the day before it regained some of the lost ground\nInvestors remain worried about trade issues and rising interest rates which are negative for stocks President Trump again criticized the fed for raising rates saying the fed is out of control and making a mistake John Ydstie NPR News Washington\nLooking at some of the other numbers the NASDAQ closed down Ninety two points today the U.S will be five hundred fifty seven points\nThis is NPR support for NPR comes from NPR stations other contributors include that Jayanti and Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information or Mac found dot org\nAnd the listeners who support this NPR station\nFrom WABC news in Atlanta good evening I'm Martha Dalton at six so for president Donald Trump has declared a state of emergency for your dad do to damage from hurricane Michael\nThat's after a call from governor deal and sixteen members of Georgia's congressional delegation to expedite emergency resources the federal government will provide funding to supplement local cleanup efforts\nAnd speaking of governor deal he's been assessing the damage from the hurricane at a news conference this morning deals that dictator county and south Georgia with one of the hardest hit areas in the state\nRight now the main focus is going to be on the ... removal so that power line trucks and repair crews can access the areas that are without power\nThere had been hundreds of thousands of power outages report in statewide one hundred twenty seven state routes have closed due to fallen trees\nAnd an update on those power outages Georgia E. M. C. puts the current number at about one hundred sixty eight thousand most of those in southwest and middle Georgia\nGeorgia powers says about one hundred Seventeen thousand of its customers are still without power nearly five thousand utility employees are working to restore service\nThat many times headed to an energized say they do you worry that that had come to quickly is that is that something sustainable Republicans now that they have Kavanaugh said well they standardize and shut up\nActually it comes right on the eve of the election I mean we're only three three weeks out the timing for a surge really couldn't have been better not that this was all planned you understand but I mean it was a great a break for us in terms of energizing our own people\nNow they're part of it that you talked about as you've called Democrats and ... actually even to use current mob\nOr declared the mall but angry mob is not what I said about our Democrat colleagues\nI Do think that they encouraged a what went on and the Congress but you were here in ... we were literally under assault ourselves trailing members for their homes getting in their faces here in the capital\nI'm ever to clearly try to intimidate us in one of the reasons I was so proud of of the result last Saturday on judge Kavanaugh's that we stood up for it or to science has set up to the mob and we are also set up for the presumption of innocence\nOne major campaign promise that you were not able to sell it on health care and I'd like to know would you were scheduled to repeal the Affordable CARE Act if you do to keep them into our next year\nI I usually don't announce but I'm going to do this far in advance um that\nWas a disappointment on is the single biggest disappointment this Congress\nAnd really the only major disappointment we we were able to move on so many different from uh in fact if you're an American who prefers the country right of center I've said before and I would say again today this had been the best Congress and the time I've been in the Senate\nYou acknowledge that your party had a significant ... talked about quite a bit in the past couple of days for housing and they're also behind with minorities in some other credit or does it mean for the long term viability of the ... if the party increasingly appeal it's mostly to light that\nWell you know we've done pretty well with Hispanics in the past\nAnd uh even the current president did better than a lot of people thought he would\nI think it's also important to remember that President Trump got nine out of town Republican votes and twenty six day not that every one of those nine out of ten who voted for him was thrilled with every aspect of what he was saying\nOh I think we're in a pretty good position going into these uh mid term elections I'm I'm pretty optimistic will be able to hold our majority\nThere is a talk at one point in time about no dissecting where the officer happening for Republicans particularly in the Hispanic community is it time for that to happen again\nWell I don't think there's any question that we would like to be doing better than we are with a Hispanic American although some of the most prominent Hispanic politicians in America I happened to be Republicans with regard to women voters we've always had something of a gender gap\nIt's never been as wide as it is now we have two great women running for the Senate this year Marsha Blackburn in Tennessee and Martha Mexicali in Arizona I think we can improve our position with women voters and it was as fan of voters are for sure\nWith African Americans we haven't been able to make much although I think it is noteworthy that a temp Scott is a member of our conference and he used the arguably the most popular politician in South Carolina so\nThere is hope with African American voters as well but I'm a more optimistic about closing the gender gap and by improving our position with Hispanics\nAnd looking ahead we'd we'd have to take three and a half weeks away from this election how many Republicans will be in the Senate next year now you know I'm not going to ask [laughter] I'd\nSay out of their production business\nSometimes to non answers are telling that was Senate majority leader Mitch McConnell speaking with our Kelsey Snell on Capitol Hill today and Kelsey was there anything else he just wouldn't answer\nYeah I think it's important to note that this is a little longer interview that we kind of ... that it down for a time and he they talked about a lot and one of the things he did that really struck me\nBut he voted criticizing President Trump at ... and most issues particularly on the economy and on President Trump's comments from last night that the fed is crazy for raising interest rates McConnell just wouldn't go there\nAnd in that section about health care when we heard him say it was a major failure he didn't say it's a fight he wants to repeat and that's not what a lot of conservatives want to hear they wanted to hear that and Republicans are going to go back if they still have control and try again to repeal the Affordable CARE Act\nAnd on that same issue we got into an extended conversation about Republicans protections for people with preexisting condition okay\nTwo Senate candidates are involved in lawsuits to weaken those protections and he told me that Republicans are campaigning on keeping those protections and gave a contradictory response about how they can support those lawsuits but still want protections in place one\nThing that looked out at me listening they're back to your health care point he described a failure to pass health care overhaul is the only major disappointment and I was thinking I I can think of others but what about comprehensive immigration reform they wanted to get that done it's not done\nThat really wasn't on his list and you know I haven't been on the list for a lot of Republicans that I've talked to a who worked on immigration many of them said that they still hold out hope that immigration could be part of a broader conversation later in the air potentially or I'm spending\nI'm speaking of spending and speaking of immigration did you ask about the border wall which people are talking about again funding for Trump's border wall with Mexico\nYeah I asked him if he thought there was going to be a shutdown fight in December over the border wall with Mexico he said he wants to try to get funding for the wall\nBut he's talking about a lot less money than House Republicans he said about you know money for about one year roughly the amount that they've been spending on border security altogether and now that's not the down payment or major investment that some in the house are talking about and that is what sets up the possibility of an immigration conversation other big spending fight\nOther thing that you that you raised with him was women where women are left post Kavanaugh's confirmation battle um he acknowledge that there's always been something of a gender gap in terms of voters for ... for Republicans and acknowledge that is going to be a challenge\nYeah absolutely and he said that he is going to make an effort to get more women on the Senate Judiciary committee next year he says he's asked in the past and he's going to ask again [noise]\nAll right NPR congressional reporter Kelsey Snell talking about her interview today with Mitch McConnell are there on Capitol Hill Kelsey thanks so much ... [noise]\n\n[noise]\nYou're listening to all things considered from NPR News and you're listening to all things considered on member supported ... won W ... meets NPR\nWith Asia Hyman I'm Jim Burress glad to have you along and ... I'll tell you that I'm interviewing Mitch McConnell and I know this because I started my career in Kentucky\nWhere I'm from ... many years ago and I've interviewed Mitch McConnell and he's\nDifficult it's difficult interview used very straight to the point and does not want to give a lot of information so the arch of kind of getting\nSenator McConnell to open up and talk to you um it is an artist it's a skill and I I my hat's off to the reporters who are able to do that and NPR and W. E. B. E.\nFull of reporters and talented journalist who bring you news end up every day and right now we're asking for you to support that with a gift to six Seventy five five three Ninety Ninety or W. E. B. E. dot org\nAnd I love those moments when I'm listening to a story and I think to myself I'm so glad you asked that question that's the question that I really wanted to hear more about\nWe are so fortunate that we have a station like W. A. B. here in our city\nWe don't ever want to imagine a time without it\nWe want to ensure that it stays here for the next generation I think about my children you know I think about the fact that it's been here for Seventy years because my mom and dad my parents' generation a four to fight it through their past support and so now it's our turn now it's out are turned to support it makes sure that it lasted it's the ...\nInto the future you can do that that'd be coming a sustained there right now with your gift of ten or twenty or fifty dollars on a monthly basis whatever works for you and know that it's actually going to have double the impact here at the station\nWhy will have double the impact because right now during all things considered\nWe are having a generous matching gift and what this means that you're one hundred dollar contribution becomes two hundred dollars you're twenty dollar a month\nContribution for the first year becomes forty dollars a month and that goes to work immediately it makes such a difference we want to make sure that we think Jeffrey Barnes Lauren and Anthony ... and Peggy and Kevin Gallagher for helping make this happen\nBut have you\nHelped make it happen and we started this hour needing to hear from a hundred and what are some change hundred nine ... nine folks at last check still need to hear from eighty eight so that is either you did the math and that was about one minute we need to hear from two folks\nAnd yeah we got a double it up so double your contribution right now by participating in that match\nAnd we've got about thirty minutes a little less than thirty minutes or so to do that so we can do that we don't want to leave any of that money behind when seven o'clock hour hits that's when we got to finish the match so we got to hear from you right now don't delay six seven eight five five three Ninety Ninety", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Atlanta", "day": "11"}