{"month": "10", "state": "GA", "station": "WABE", "content": "Some it had been portrayed last\nMonth by Donald to ... a ... in Salzburg they were having a form of some of the this summit this week here in Brussels was the make or break of a deal for breaks it and then this week it's like okay we don't have an agreement it's not as critical as we thought we\nHave time all the things that were they were saying last month was it or not the case and so\nShe waiting that was the fact that\nThis dinner meeting at which the twenty seven members that will member states that will be remaining in the ... their leaders had a dinner meaning and then right afterwards a four of the members and this would be Germany locks and Bert Belgium in France their leaders\nWent out for French fries and beer here in Brussels to really accentuate the fact that no one seems to be that alarmed about the fact that there isn't a deal\nNow look you're based in Berlin Chancellor Angela Merkel just suffered another election set back last weekend what is her position on Brexit and how is this affecting her political strength is kind of the ripple effect of it\nShe's toned down her harshness I mean she still is adamant that there has to be a deal because the latest estimates show uh that Germany could lose upwards of a hundred and ten billion dollars if brags that goes through without some sort of deal so there's a lot riding on this for\nFor Germany but she's also toned down I mean she doesn't want to make this I guess look like yet another thing that she hasn't been able to handle a so she talked instead at this uh at the summit and she did not make many public statements but the one she made was that I have a a skill at or I always look at\nA creating a consensus and finding an agreement and that's what I'm going to focus on because I still think that we can do this one thing I should mention there really is a sense among the remaining twenty seven members of the other I should say twenty seven members of the a block\nThat the u._k. is basically on purpose delaying this in order to force concessions to put put the pressure to a point where there is no time left\nAnd he will have to have of course the u._k. sees it the opposite way as well\nYeah [noise] That's NPR's Berlin correspondence riots hardy Nelson in Brussels after Brexit summit today sir I thanks as always [noise]\nYou're welcome Robin Lloyd\nPaul era now production of NPR WNPR and association with the ... the young I'm Jeremy hops and this is here now lo\nO lo o lo o lo o lo o lo o\nFunding for here and now comes from W. B. or Boston and Geico offering car insurance as well as services for homeowners and renters insurance\nThrough the Geico insurance agency additional information can be found at Geico dot com horse one eight hundred nine four seven auto\nMexico is ramping up security along its southern border to keep Hondurans from making it to the U.S and Sears bankruptcy highlights what happens to suburban malls when a major retailers shuts down\nJoins all things considered which is coming your way next for those stories here on numbers supported Ninety point one W. A. B. E. Atlanta I'm Jim Burress nice to have you on\nSupport for W. H. B. E. comes from Kaiser Permanente wearing the integrated system of primary care doctors and specialist worked together as a team to deliver healthy outcomes and consistent care more at K. P. dot org Kaiser Permanente thrive\nThis fall WABC is turning to our ... for help\nYou've no doubt noticed are increased coverage of the environment urban affairs and politics\nYou know have an investigative desk and WABC recently started offering podcast like Barry truth and political breakfast this all comes at a cost so if you're sustain or we'd like to ask for your help with an increase of your monthly sustaining gift an additional seven five or even three dollars a month will really help\nWe understand how much more WABC is offering Atlanta an increase your monthly donation online uh WABC dot org slash thinner that's WABC dot org slash ... thanks [noise]\nAnd in fact we will choose one sustain her and one new member who joined us today it's six Seventy five five three Ninety Ninety four WKBD jot work to win one or two at us an electric bikes this is courtesy of Edison bikes\nWhich is based right here in Atlanta fees are electric bikes that you can ride in different ways with power only like ...\nShooter or which pedal assist somewhere in between and they have a retail price of about two thousand dollars [noise]\nWant to get in on that today with a donation of six Seventy five five three Ninety Ninety or WABC dot for again and you will be registered to win one or two Edison bikes\nAll things considered is coming up next on Ninety point one W ... as well as a check of news from NPR in Washington ... [noise]\n\nLive from NPR News in Washington I'm Lakshmi Singh pressure is building on the Trump Administration to respond more forcefully to the disappearance and suspected murder of Washington Post columnist or ... a U.S resident\nHe was last seen alive walking into a shouting consulate in Istanbul weeks ago secretary of state Mike Pompeo says the Saudis need time to explain Here's NPR's Mara Liasson\n... met with the president at the White House and told him about his meetings with Turkish and Saudi officials ... said the U.S takes this very seriously and expects the Saudis investigation of themselves to be completed in quote a timely fashion\nBut ... also stressed that Saudi Arabia was an important ally and suggested that there might be no consequences at all\nWe ought to give him a few more days to complete back so that we do have ... understanding of the facts surrounding which one we can make decisions about how for the United states should respond\nTo show jeeze family is calling for an independent investigation and there is mounting evidence that the men involved in ... alleged murder and dismembered meant we're close to the Saudi crown prince Mara Liasson NPR News the White House\nTreasury secretary Steven Mnuchin is the latest high profile guest about out of Saudi Arabia is upcoming investment conference that much more unsettling for an already shaky us market or major indices are down one point two percent to over two percent but economist Mark Zandi says there are other factors in this confluence\nOf things and bothering investors thought as a couple of weeks the higher interest rates prospects but the Federal Reserve will continue to push retire [noise] overvalued stocks the people are nervous that the stock market has come too far too fast and of course there's a trade war or the skull eating with China and that's not good news\nThat's mark Sandy of Moody's Analytics President Trump is threatening to direct the military to close the southern us border with Mexico as tens of thousands of Central American migrants have been attempting to cross to Mexico and then the U.S in his tweet today Trump urged Mexico to do something large number of incoming Hondurans Salvadorans Guatemalans\nFlorida officials are adjusting election rules because of hurricane Michael NPR's Debbie Elliott has details\nWith entire towns devastated and still without power less than three weeks from the mid term election Florida is relaxing rules to allow for extended early voting and easier vote by mail options\nRepublican governor Rick Scott who was running for US Senate approved the changes with an executive order it allows locally elected supervisor of elections to add more early voting locations\nAnd keep early voting open until election day arrives on November six\nNormally early voting closes the weekend before the election the order also directs local officials to make sure that emergency responders and people who evacuated have a way to cast a ballot the panhandle typically boats heavily Republican that's Debbie Elliott this is NPR\nSupport for NPR comes from ... to do with the investments taking a personalized approach to helping clients grow preserved and manage their wealth learn more at ... dot com slash wealth ... brokered services L L C and Americans for the arts at Americans for the arts dot org\nFrom WABC news in Atlanta good afternoon I'm Molly Samuel it's four oh for the Centers for Disease Control and prevention says to people in Georgia has been sickened by ... linked to a multi state outbreak Sam Whitehead has details\nThe CDC says Ninety two cases of salmonella\nHave been reported across twenty nine states as if this week all linked raw chicken products almost one quarter of the people infected have been hospitalized none have died\nThe agency has yet to link the outbreak to a single comments supplier and says it's found the salmonella strain in raw chicken products raw chicken pet food and and live chickens [noise] the CDC says consumers shouldn't stop buying raw chicken but should make sure it's cooks thoroughly before eating Sam Whitehead WABC news\nRepublican Brian Kemp hopes to fire up support in Cobb County next Monday when US Senator Marco Rubio of Florida campaigns forum cop is one of the few counties that Rubio carried in his twenties sixteen presidential bed Rubio will also campaign for the GOP nominee for lieutenant governor Jeff Duncan according to the Atlanta Journal constitution\nCommercial developers in Atlanta now have more than two million square feet of office space under construction the Atlanta business chronicle reports most of the projects will be open some time in twenty Nineteen there's more local news on line at WABC dot org this is Ninety point one it's for a sex\nYou see alternative explanations in social media that he's really in Qatar which is a country is seen as an enemy of the kingdom are maybe his fiance killed him um you see these conspiracy theories to explain the disappearance\nOf course Saudis can search the Web for coverage say in the U.S media but the dissonance is striking this unprecedented golden coverage of the new Saudi Arabia has been replaced by these dark stories of hit squads and brutal torture\n[laughter] you know it's interesting listening to you and I'm thinking of the parallels to what ... himself wrote in his final call him the Washington Post just published and he was writing about how in the Arab world they are so subjective false narratives and these conspiracy theories\nYeah he did talk about that it's really telling he described the effect of the state run narratives and he calls you know people victims of the majority of the population believe it but I think there's something bigger going on here there's this is about the way Saudis especially young Saudis see the crown prince Mohammed bin someone\nWill stay with that for a second to you that we've been talking about how the press is covering most is it possible to gauge how ordinary Sal to use a are following this\nYou can see some reactions social media is where you see it shock disbelief fear you know when the crown prince he's known as NBS and the kingdom first came to power he built this cult of personality was young he was dynamic\nAnd young Saudis it and that's a huge part of the population\nThey saw him as one of them they based would say we love him he got them and he said he would transferred the country and in some ways he did his rained in the religious police he's permitted women to drive into work he's reopen movie theaters all of that is a really big deal\nThe new Saudi Arabia got all this great coverage it was suddenly cool to be a Saturday\nBut now the country is getting this relentless narrative across the globe so you find Saudis they're angry about it\nFor WABC comes from the Atlanta symphony orchestra Donald radicals leads the Atlanta symphony orchestra and chorus and Benjamin Britten War Requiem Thursday on Saturday the twenty fifth and twenty seven details at a U.S oh dot org classical series presented by Delta Airlines\nThey say much depends on the weather over the next few days and rain is in the forecast for NPR News I'm Mose Buchele in Austin [noise]\nYou're listening to all things considered from NPR News\nI'm Susanna Capelouto as senior editor at W. A. B. E. I Am often the first audience member of a lot of the stories so when I hear a story and I don't understand it or I don't get it\nI have to make sure that it changes so that at the end the product that goes on the air is the best possible story we can deliver\n[noise] it's a commitment that everyone in the WABC newsroom shares for great reporting for a a\nYou know a real focus on the Fox news spin and Susanna is kind of the the gateway to to make that happen and I tell ya if if you're not clear if if there is something that is unclear Suzanne has gotta catch it and she's going to let you know and we work through it together it's a wonderful process and it takes\nResources it takes people a takes time but all of those are made possible because of support from from you from our members\nWhat you're not a member well why not become one right now six seven eight five five three Ninety Ninety W. H. B. E. dot org and you can help make this amazing resource happen every day\nUm and there's another way to another incentive rather to call right now to six Seventy five five three Ninety Ninety or W. E. B. E. dot org I'm Jim Burress alongside Ayesha Hyman director of individual giving here at public broadcasting in Atlanta and what is that instead of I'll be glad\nTo talk about it you know everyone's got a different reason for listening\nAnd sometimes it it requires a special incentives for converting that listening to supporting W. A. B. E. every one who donates on this second to last day of this pledge drive will automatically be entered into a drawing to win went up to Edison electric bikes\nAll you have to do is donating out to six seven eight five five three Ninety Ninety or donate online at W. A. B. E. dot org and why are you there on the website you can take take a look at the picture of them but these cool Edison electric bikes are made by a company that's based right here in our neck of the woods in ... in Atlanta\nAnd they're awesome they have an LA D. display it they take only about twenty minutes to charge up they have let them lithium ion battery pack\nThey are really incredible you can use them as a scooter you can use them power only you can these pedal assessed you\nHave a really awesome opportunity right down to support the station possibly when something really cool and you can even kick in thinking if if he thought she was if you choose to give it to Fifteen dollar level we've got lots of think you get three to choose from six seven eight five five three Ninety Ninety or W. A. B. eat out or\nAre pretty pretty cool bikes and two thousand dollars each the value\nUm so do you do not a small price six Seventy five five three Ninety Ninety W. H. B. E. dot org we will pick one sustain her and one new members so if you have never pledged now is the time to do it and we know there are many sources of news out there twenty four hours a day seven days a week in this media environment\nFrom NPR News this is all things considered I'm Mary Louise Kelly in TV commercials and on debate stooges across America the attacks are now blistering as candidates the election day coming up fast the kind of policies congressman O'Rourke Iraq supports high taxes high\nRegulations open borders they just voted five times to cut Social Security and Medicare benefits it was disgusting way of seeing the mob rule in Washington DC\nEvery single one of us is in this together this is one of the most important election of our lifetime and we all\nNational political correspondent Mara Liasson is with us to talk about what both parties are doing to gain an edge in this final stretch before the midterm tomorrow Hi there Hi so start with the issues there's all kinds of things that could be weighing on voters' minds these last three weeks of the the Kavanaugh hearings the\nPresident's a campaign rallies constant campaign rallies developments at the border of crisis with Saudi Arabia [noise]\nCan we say whether any of those seem to be shifting the playing field\nThey are not there might have been a kind of cabinet bump but the most important thing to remember about these last two weeks in the election is that the fundamentals haven't changed much at all the house still looks pretty good for Democrats not sure if it's good enough for them to get the net twenty three pick up seats that they need which they don't they need Senate\nMap looks excellent for Republicans that always has that's because there are a lot of Senate Democratic incumbents in very red states where Donald Trump is very popular\nWe know the Democrats are more energized this year Republicans are becoming more energized as they always do in October we're also seeing signs that they we might have a very high turnout mid term election which is pretty rare\nUh people are self reporting a lot of enthusiasm about voting we've seen record turnouts in primaries and special election and what's the\nClosing argument that both parties are settling on\nWell the closing argument from Republicans who began thinking that the tax cut bill and the booming economy would boost them but as the tax cuts got less popular they're closing argument is now warning voters\nThat Democrats will take away the tax cuts\nPut regulations back on the economy wrecked the economy there kind of reverting to the Trump culture war issues which do energize their base\nTalking about hordes of criminal illegal aliens coming to kill people and I'm looking at a fundraising pitch from Mimi Walters Republican congresswoman from California who says we just learned that my socialist pro tax opponent out raised us\nWe can't let the Democrat mob take over Congress how Democrats on the other hand have stuck to health care\nWhich is the number one issue for voters this year except for their refining a little bit they're now saying Republicans gave tax cuts to the rich created a huge deficit and to close that whole they are going to come and cut your Medicare and Social Security\n[noise] may I ask you the flip side of a closing argument question which is what's the biggest challenge for each party at this point what's what's keeping Republicans up at night what's keeping Democrats up at night as election day closer than\nAre worried about the mid west this is the the area of the country where Trump really one Michigan Wisconsin Pennsylvania\nThey thought those states would turn red they thought oh Iowa and Ohio would no longer be swing states they'd be solidly red but they are really struggling in the mid west the next two weeks will tell us whether that's true so they're worried about exciting their base\nIn the industrial heartland a Trump and another problem for Republicans as the Trump kept telling his supporters there is a red wave and borders believed him and got a little complacent and we\nThat anger is the best motivator and we don't know who's going to be angry or white working class voters especially men that the Trump base or college educated white women who are very angry but both sides are worried about history Republicans no the party and the White House usually lose his big when the president is under fifty percent\nDemocrats know that the groups of voters Republicans depend on tend to turn out more reliably in midterms they're worried about motivating low propensity voters like Hispanics and young people\nOh All right NPR national political correspondent Mara Liasson thanks Mara thank you [laughter]\nNow for all the focus on how the Democratic party shifting to the left nationally\nIf Democrats take control of the house it may be because of moderate Democrats winning in Republican districts take Utah's fourth congressional district\nIt is in deep red and according to a recent poll Republican congresswoman Mia Love and Democrat Ben McAdams or in a dead heat NPR's Scott Detrow reports\nIn this year of deep partisan splits it's almost jarring to hear Democrat Ben McAdams answer this question about President Trump how do you view of the Trump Administration is doing right now [noise]\nYou know I think mixed reviews the mayor of Salt Lake county Utah criticizes Trump for sure on immigration policy health care and other friends but he is a lot more measured and cautious about it and most Democrats running for Congress this year\nNear where many in the party are talking about impeachment and single payer health care he likes to talk about burdensome regulations\nI Will work with the Trump Administration when I think it's good for the country and when it's good for you time I'll be there you know I think we do need an infrastructure package to invest in in local roads and bridges and I'm going to be part of that\nThat's all no accident the county official and former state senator knows that well other Democrats debate the tactics of exciting the party base versus appealing to Republican voters to switch sides he's got no choice Republicans have a Thirteen point advantage in this district\nThe votes I Need to win this election I've gotten twice before to see to reassure those people that are that you know I'm not going to change I'm going to be the same person or as a member of Congress that I've been as mayor\nHe's also got to convince them to dump me a love for two term congresswoman who got immediate national attention by being the first ever black woman elected to Congress as a Republican\nLove is conservative but running in a tight race she repeatedly frames herself as a pragmatist going into Washington I Know exactly one morning when I build\nA relationship on both sides of the aisle love is aggressive about defending the Republican tax overhaul and the ultimately failed push to repeal the Affordable CARE Act\nShe was also quick to point out that in several high profile moments she's criticized Trump most notably on immigration where she helped force a floor vote on a fix for the deferred action for childhood arrivals program\nAnd when she publicly scolded him for using a slur to describe predominantly black countries during the White House meeting on immigration as a matter of fact I'm the only one in this delegation that stood up to the president when he has done something wrong\nAnd worked with him when he has done something right Republicans occasionally chiding Trump's statements than backing him on policy has been a major theme of the past two years\nThat something McAdams keeps pointing out seeing that voters should look at loves votes and actions not her occasional statements\nDon't get credit for what I Try to do or what I say I want to do I'm judge based on what I accomplished and we need to hold the same standard to our representatives in Congress\nAs the race has tightened love has done what many other Republicans are doing framing a boat from McAdams as a vote for Nancy Pelosi that's despite the fact macadam says he would not vote for ... to be speaker\nNow my opponent maybe not even say he's not going to vote for Nancy Pelosi but if you watch what's going on there if she if this turns over and they win the house Nancy Pelosi will be speaker of the house\nMcAdams insists he keeps his independence in Washington\nWhen I see is if the Democrats do take back the houses because a lot of people like me when their elections and these are people from party does not come first or the solutions comes first\nAs Democrats last election after election in recent years the main casualties were moderates like McAdams that many of the candidates in swing districts the party is trying to flip this year don't fit in with Democrats national leftward shift they aren't calling for single payer health care\nHe meant so if election night goes well for the party the next big question is how the return of more moderate ships party dynamics especially if they're the ones responsible for Democrats winning back power got Detrow NPR News Salt Lake city [noise]\nAnd you're listening to all things considered from NPR News\n[noise] hey this is David Draine here and I want to tell you that there is a big difference between quality reporting\nAnd news but just skim the surface let's compare it to cleaning running a damp paper towel over a countertop doesn't operate and neither does skimming social media for the headlines you really want to be informed and that's why you turn to us we go deep\nWe get behind the furniture into the corners and we find the angles no one else does cover for example\nNPR's David Folkenflik broke that story even prior to it what we reported yesterday it was like ... and her husband haven't had electricity did she reports as part of our frequent look at the rise of the freelance ... the NPR\nMaris pulled out good vacuum always clean better than one of those wet takeout napkins right the difference is worth the investment so invest in us here's how to do it [noise]\nIt only takes a moment to call six Seventy five five three Ninety Ninety or pledge on line to W. E. D. E. dot or good afternoon I'm Jim Burress local host of all things considered and I'm here with I shall Hyman public broadcasting in Atlanta is director of individual giving\nAnd Ayesha every afternoon it's true you get two and a half hours of live up to the minute news coverage with all things considered and it's not always the hard bad uh intense news although you do get that when it's important but all things considered but I Love about it\nGet to let your hair down I don't have any here but if I did I Would let it down on that you really do get a variety of stories\nFive five three Ninety Ninety or online at W. A. B. eat out or\nKnow that you listen to W. maybe eat for a reason and that reason is absolutely not to have your own opinions confirmed\nYou listen because you value thought provoking conversations from people on all sides of the issue now plenty of other media outlets on the radio dial will feed kind of a partisan echo chamber\nThat's not what we do here at W. H. B. E. ah and and that's why it sounds different we know it sounds different we know this pledge drive sounds different for folks who may be new to public radio and not understand that this is the model we don't yell at you with car commercials and all kinds of other commercially advertisements\nCommercial advertisements rather\nInstead we do have brief underwriting but we rely on you to make up the balance of the stations funding listener supported counts for more than half of our overall budget should twice a year we've come to you with a pledge drive like this and we remind you that it is your part right now to help them\nDisagree programming on the air six seven eight five five three Ninety Ninety W. H. B. E. dot org at whatever level works for you to make that happen\nWell I Want to go back to something that Howard often mentioned in his comments is that when he and his wife Colleen donate to the station they're investing in democracy\nFor you it might be the arts and then the cultural programming or you might want to amplify diverse voices or just simply you love the troops and you want to hear it when you turn on the radio whatever it is that you value whatever it is that's turning you on when you turn on W. A. V. E. let that be a reason to call us right now\nSix seven eight five five three Ninety Ninety or W. A. B. E. dot org and any contribution at any amount will make a big difference for us\n\nSupport for WABC incomes from city winery the urban winery music venue restaurant bar and private event space singer songwriter John Hi it performs October twenty first and second ... tickets available at city one ... dot com slash Atlanta\nAnd from then desk its customer service and engagement platform connects companies with customers through email live chat and phone support all from one interface we the company or customers want you to be learned more as an desk dot com\nAnd we're back to all things considered in just a few minutes\nBut it is the next to last day in W. baby is full pledge campaign and that's when we come to you and ask for your support to keep programming like all things considered on the air and\nUh again no matter what level you pledge it's just important that we do hear from you our goal overall seven thousand Seventy donations during this campaign and when we reached that number\nThe pledge drive is over so we could wrap this up pretty soon from my understanding we are about two thirds there and you're thinking two thirds with a day to go\nWe are all procrastinators when it comes to supporting public radio and I include myself I ... in that because when I before I was a sustain her my pleasure always came on the very last day\nThe pledges just come in and you like to be the hero elected come in at the end and save the day will be are you are right now because we could absolutely in this early\nWe want to we want to and you know every kind of contribution count so you can donate a car stock of planned gift become a sustained or some folks donate time some people donate items from their business\nTen dollars one hundred dollars whatever you're able to do we are thrilled to receive it we most importantly we mostly want to hear from you right now six seven eight five five three Ninety Ninety or W. A. B. E. dot org\nAnd I used to you mentioned a business and there was there is a local business\nOr who's a big fan of the station and said hey we're going to donate our product yes to this drive and I'm Talking about Edison bikes which is based here in Atlanta and so if you make a call today to six seven eight five five three Ninety Ninety or make your pledge on line to W. E. B. E. dot org\nYou will be entertained when one of two Edison electric bikes\nAnd other cool thing about this is that where we set aside one of these Edison electric bikes for an existing sustain her so if you're already a sustain or anyone to double check and make sure you're up to date six seven eight five five three Ninety Ninety or W. A. B. eat out or\nAgain that number to call six seven eight five five three Ninety Ninety W. H. B. E. dot org at any amount that is right for you it works for us\nAnd we're back with NPR programming in just a moment and I I used to I I don't know about you but I think when it gets to be the next to last tasty gosh Penn this the penultimate day um and that's kind of live since\n... there's an excitement in the air and we all went to wrap this up we want to be successful and it's really easy to do\nBut you know as much as we might want to wrap it up I think that you want to be counted I think folks want to be counted in this campaign is silly now\nWe're right just up against the midterm elections right and so you want to know that you've done your part to make sure the entire community has the information that we all need to make our decisions right six seven eight five five three Ninety Ninety ...\nNinety point one WABC Atlanta live from NPR News in Washington I'm ... presidents\nTrump isn't sounding very hopeful about journalist ... ... Turkish authorities or maintain the show was killed inside the Saudi consulate in Istanbul amid reports there is audio or video evidence of what happened\nSecretary of state my palm pale met with Trump at the White House today leaving for a campaign event in Montana the president was asked about whether he too believes the Washington Post columnist was killed\nIt certainly looks that way for them a very sad certainly\nSaudis have denied involvement but during a meeting with the secretary of state promised a complete thorough investigation into what happened at the consulate\nJust days before a parliamentary elections in Afghanistan the Taliban are claiming responsibility for an attack in southern Kandahar that killed three Afghan officials it took place during a meeting with the top American commander general Scott Miller he was on harmed but three others including two Americans were wounded Here's NPR's Tom Bowman\nThose killed included the provincial governor and the police chief who was the most brazen Taliban attack in memory the Taliban including the target was general Miller the Miller spokesman said the targets were Afghan officials\nAt least one of the governors doors open fire according to local media reports\nThe wounded including an American soldier in contractor along with the coalition contractor their injuries were not life threatening\nKandahar has been mostly stable in recent years mostly due to the police chief general Abdul ... a brutal enforcer who survived many Taliban assassination attempts but has been accused of human rights abuses Tom Bowman NPR News Washington\nJustice Department officials have opened an investigation into allegations of child sex abuse inside the Roman Catholic Church in Pennsylvania\nProsecutors serving subpoenas on dioceses across the state seeking sensitive files and testimony investigation comes on the heels of the state grand jury report detailing hundreds of allegations of child sex abuse by priests\nWall Street showed that in a span of three days it can go from the biggest single day for the markets in six months to being back down in the dumps after the record run up earlier in the week\nMajor U.S stock market indices all in in the day down one percent or more key stock split on concerns about earnings and mounting tensions with Saudi Arabia kind of his Mark Zandi says the whitening us trade battle with China's also weighing on investors these are the\nTwo largest economies on the planet and it's not a good thing that we're bickering and raising tariffs on each other and making life difficult for each other that's just not good for business in the long run\nTwo countries of slap hundreds of billions of dollars in trade tariffs on one another's goods industrial and basic materials have been taking big losses amid worries the dispute will increase costs and hurt sales\nChecking the numbers on Wall street today the Dow was down three hundred and twenty seven points to twenty five thousand three Seventy nine the NASDAQ dropped a hundred and fifty seven points the standard and Poor's five hundred last forty points today you're listening to NPR\nSupport for NPR comes from NPR stations other contributors include exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information at color guard tested dot com\nFrom ... in Atlanta and good afternoon I'm Molly Sandy on its side that far today Georgia legislator black caucus members called for more training of election staff in ... county his name Sean reports\nClinton County rejected more than five hundred absentee ballots and then nearly twenty thousand that have been nailed and so far that's more than a third of all absentee ballots rejected statewide state representative ... Kendrick whose name and Clinton apostrophe says the county's diversity is the issue\nA lot of that is that people will not understanding that that is how name as opposed to fail to maybe is a nickname I really do you think a lot of it has to do because of the diversity England that county and you're just going to have different types and named\nBlack legislators also blame the state's new exact match policy and new state laws calling for signatures on mail in ballots to exactly match with others have on file this name ...\nGeorgia's unemployment rate ... three point seven percent this month it hasn't been that lessons may two thousand one Georgia labor commissioner mock butler says that's because the number of jobs available is higher than it's ever been we did see the state\nActually a show of creation of about Fifteen thousand jobs which is very good job growth over the ...\nThat legally what powers to see you have to try to block the border\nWell let's go back quite a few years to president Woodrow Wilson ... active\nDuty troops to the border during the Mexican revolution just stop raiders from coming across into border states but today we're talking about families with small children seeking asylum their longstanding federal laws that give protection to immigrants who qualify as refugees they have the right to cross at legal ports of entry and ask for asylum\nWhether troops could be said to the international bridges to block them as an interesting question the policy come Titus act prevents the military from being used for civilian law enforcement\nIt's interesting that the the most relevant precedent to eh you're saying that you have to go back a hundred years took to Woodrow Wilson right let me let me ask you this the Trump Administration frames all of this in terms of crisis that the situation at the border as a crisis and sell appropriate measures are required\nIs the situation at the border right now a crisis\nWell a homeland security spokesperson told me that they're compiling the urine figures right now and she says the numbers of immigrant families arriving in order will likely break records on a monthly basis and now it's important to keep this in context Mary Louise because back in two thousand they were arresting one and a half\nMillion undocumented immigrants a year so far this year it's been under four hundred thousand but still the Trump Administration is upset and frustrated they continued to blame everything on Congress for allowing what they called catch and release loopholes in the law\nThe d._a. just spokesman told me that the agency is examining all options to secure the border\nAnd when that spokesperson talks about all options family separation is back on the table this policy that was so controversial that the president had to walk back and and reverse it when they tried that earlier this year\nAnd so now homeland security is considering a new sort of watered down form of family separation but also to act as a deterrent to families thinking about crossing up such as those in the caravan uh right now here's the president on the south lawn of the weekend\nIf they fail this separation in many cases they don't set\nOf course as the case that the administration made when they rolled out the family separation policy right earlier this year or so what what a watered down version look\nLike well they're talking about something called a binary choice detained families with their children would have two options one they could give their kids up to a government use shelter where the kids would eventually be sponsored by a relative or a foster family who are already here in the U.S\nAn option to they could keep their kids with them in detention indefinitely\nUntil their asylum cases resolved currently of court rulings says the kids can't be locked up with their parents for more than three weeks right as this would extend vat and immigrant advocates are appalled here's Michelle brane a of the women's refugee commission on a call with reporters yesterday\nCleared it ... it's a binary choice\nPolicy that the administration is considering punish and a church family is from taking protect this\nRound of the administration's handling separation policy\nJohn Burnett round two or watered down whatever we want to call this revisiting a family separation the same challenges are there right I mean for example if they want to ramp up the tension of immigrant families the question of where they would put all these families\nRight and of course the binary choice is still being considered it's not policy yet but if they put it into practice the question is where would they detain all these families currently there are a little over three thousand spots for family members and what are called special family residential centers\nBut you're talking about thousands of these immigrant families that are arrested every week at the southwest border these days um the government doesn't have enough detention beds so for the foreseeable future you'll see the continuation of families\nBeing arrested their process for a few days and then most are released with ankle monitors with their kids to show up for immigration court and that's what's been the doubling the Trump Administration\nAll along NPR's John Burnett reporting thank you John you bet Mary Louise\nInterior secretary Ryan Zinke has been one of the most controversial members of President Trump's cabinet there are numerous investigations into his conduct a secretary when the day began there were reports that he was planning to replace the independent watchdog leading some of those investigations\nThat department now says that's not happening and parents ... reports\nIt all started with an email from housing secretary Ben Carson telling her the employees that Suzanne Israel tops HUD assistant secretary for administration was leaving that agency to become acting inspector general at the department of interior\nThis came as a surprise to many in Washington perhaps even to the current acting inspector general Mary candle\nFor one thing inspectors general are appointed by the president and the White House hadn't announced anything and lose Hempel which of the project on government oversight to Tufts didn't have the experience that would qualify her to be an inspector general\nIndividual that really should be non political issues that oversight experience they should have an investigative background that kind of crime them for that kind of watched outlaw\nTops is a former Trump campaign aide who was brought to hug by Carson to replace the staffer who blew the whistle on Carson's plans to use taxpayer dollars to buy a thirty one thousand dollar dining set\n... ethics have also been questioned the inspector general's office has been looking at among other things his redrawing of the boundaries of the grand staircase Escalante national monument in Utah the benefit of Trump ally\nThere are other investigations says crusader director of the western values project Montana based conservation watchdog group\nThere's another that involved a real estate deal that secretary Zinke heat Family Foundation with actually involved with in his home town that would've been finance in part by the church Halliburton which of course has a lot of it before the department of interior\nBut today in a statement to NPR Interior Department spokeswoman Heather swift said Carson's email had false information in it that no decision was ever made to move tops to interior that while she was referred to the department by the White House as a potential candidate for a job and the inspector general's office quote\nAt the end of the day she was not offered a job and interior Brian Naylor NPR News Washington\n\nIt's all things considered from NPR News\nHi my name is Becky charges and a kindergarten teacher at ... elementary that went from being a lot of listeners daily listener and listen constantly and I wanted to make a pledge just that kind of think my husband or bring that gift\nIs you know always kind of talk about how we should say and then it just doesn't happen inside decided to do with that kind of a tribute had thank you Becky in and thanks to you\nHusband and things to everyone who has you know made that decision and it is a decision that you have to make it to become a listener go from kind of listening on a regular basis or even an irregular basis to being a member and knowing that you're doing your part to keep Ninety point one WABC\nOn the air it takes a community and that's why we're coming to you during this our next to last day of the fall membership campaign and saying hey it's really easy and it's really important six Seventy five five three Ninety Ninety W. A. B. E. dot org I'm Jim Burress alongside ... and you can do\nJust what Becky did if you thought you you can choose to donate in honor of someone who\nPerhaps as a fan of WABC like you are or perhaps there's someone in your life who maybe can't make that donation of their own financial means but you can do it for them and you can give us their name when you make that donation so we welcome all contributions six seven eight five five three\nNinety Ninety or W. A. B. E. dot org and those are two ways that you can contact us and make your gift\nIn a special shoutout to Becky my sister is a kindergarten teacher my grandmother was a kindergarten teacher kindergarten teachers are special people I Would agree with you there teachers actual general absolutely do they do the work that\nA must be done [laughter] all the respect in the world and and it's great to know that afterwards and intense day in the classroom that they find what they need when the given the car and listen to W. H. B. E. if that describes you please support it right now it's six Seventy five five three Ninety Ninety or W. E. B. E. dot word\nWell when you do call we have a bone is we have an extra special incentive for you today everyone who calls has an opportunity to win a really cool electric bike from Edison bikes based right here in Atlanta in ... at all it takes is your contribution\nSix seven eight five five three Ninety Ninety or your call there and your donation visit to our website W. A. B. E. dot org we're going to choose one sustain her\nAnd one new member so that we can give away too at us an electric bike so you can be one of those winners perhaps six seven eight five five three Ninety Ninety or W. A. B. either that or and\nYou can go to W. H. B. E. dot org slash contest rules for full details also thank you territory wa for providing dinner for our staff and volunteers tonight territory ... Brookhaven features and open air patio garden bar with more than five hundred ... open six days a week\nAll things considered from NPR News I'm Mary Louise Kelly\nNews this week that Sears is bankrupt has prompted much ringing of hands over the bleak future of the American mall but well some malls are emptying out others are bustling according to the international council of shopping centers\nOver the last five years more malls have opened and closed mark Cohen as a former CEO of Sears Canada he now teaches at Columbia Business school\nMe some malls will actually benefit from all those Sears stores shutting down\nThere are triple lays or super regionals as they refer to who are booming who are receiving\nThe news of Sears demise or near demise with glee because if Sears is still doing business in in their facility they're happy to take the space back\nThese are malls with four five six acres in some cases that are fully talented and there were only a limitation is available parking\nSo they're losing one anchor star but they've got others American what would they do it to share space\nWell they're likely to break it up and turn it into other specialty retail or add to their experiential opportunity in the form of added food offerings things of that sort of okay and then there are\nB and C malls and these are smaller these tend to be older in many cases they've already lost his ears and the prognosis for these bees and sees is grim\nWhy can't they do the same thing as the ... I Can't they re imagine the space and out of food court or something\nThey can do it on paper but they can't manage it financially because the malls volume has declined to the extent that there is no financial viability left\nWhen you talk about the triple a malls that are striving or those congregated in a certain part of the country is there a certain type store type layout that is working for them to pay me a little bit more of a picture of what those look like\nThey're dispersed throughout the United states and they straddle urban population center and heavily populated affluent suburban community\nSo they're typically the biggest shiny is penny in the marketplace it virtually every major population centers throughout the United states there is one and in some cases two of these AAA centers that are doing fine they're fully tended to they've got lots of footsteps\nThey're still sought out as destinations by customers\nIt sounds as though you're describing a landscape in which some malls are disappearing some malls are thriving but all of them are being re imagined in what ways where if you will an anchor store be as important as it was a generation ago people rethinking outdoor versus indoor spaces what trends are you seeing\nWill the egg restore was typically a department store in the department stores genre is for the most part on its way out but now several things have happened first of all the apparel an accessory trends have declined uh customers are spending an enormous amount of disposable income on\nTech and on experiential opportunities rather than on amassing wardrobe sort of clothes\nAnd the whole idea that an over large box will act as the draw for a mall\nIs probably outmoded as well and many of the triple a malls or so to speak the anchor tenant as someone like the apple store my which doesn't occupy a traditional acres space but draws an enormous amount of traffic into the center [noise]\nDo you go shopping malls regularly\nNo fly when I was a gainfully employed in the business I did that two and three times a week everywhere in the United states and Canada\nBut frankly um they're they're less and less attractive they offer less and less appeal and I've gravitated like millions and millions of other folks to the Internet which is I'm much more convenient obviously and much more likely to be successful\nThat's mark ... at Columbia Business school he was former C. E. O. of Sears Canada has to call and thanks very much but I think you more than a week has passed\nSince hurricane Michael tore a path of destruction through coastal and inland communities tens of thousands of people are still without power curfews are still in effect and lots of places and many of the people who call Florida's panhandle home\nCan't get home several hundred of them are living in schools serving as emergency shelters and that is where NPR's Hansi Lo Wang has been spending some time here's his report\nRows and rows of cots top with blankets and pillows are spread out\nYet as dean ...\nAre people that we want to be very different\nAmanda ... the American Red Cross leads toward the shelter in northern county it's one of ... around Florida's panhandle or than two hundred people from a few months old to almost Ninety years older hungry in this shelter bottled water diapers and canned food are piled by the entrance next the trailers equipped with showers\nAdding say I'm just saying to me\nSo I kind of get the ... actually it's a wash the clothes\nMany here didn't much to where when they fled their homes including Heather ... and a Thirteen year old daughter Alexis\nTwo pairs of clothes and dirty work uniforms because\nI didn't anticipate not being able to work in the in here this long\nStory for hurricane either\nOr they're in a Lexis live in Mexico beach that's where hurricane Michael hit hardest they don't know when they'll be allowed to see what's left to their house or\nFEMA stuff all day and\nPeople whose houses are unlivable can apply for vouchers from female to pay for a temporary stays in hotel rooms and condos before applicants find out if they qualify inspector has to go out and see the damage to their homes\nThey may take a while before FEMA can reach every house down to ... do need to not just a new roof over her head but also a reliable source of electricity for her oxygen machine\nPeople have been happening around and get a bump\nIn Maine outlets like ... ... ...\nHayes is staying at another shelter at breakfast point academy in Panama City beach Jesus and using her oxygen machine center second open heart surgery a few months ago\nThis is my fourth shelters\nFirst ... Laymon connect to my they didn't have back at the chance to and they had a pack and that then the next two at the hats\nAnd buy a new a male and Kennedy ... here\nFor take one matching the journey to the shelter at those in high school started with a helicopter his family were rescued after the roof caved in at the house where they had gathered for the storm\nAfter they were checked out at a hospital they were bussed over to the shelter\nI wouldn't my cameras were my mom and my two\nThat she's Eighteen and the oldest siblings and cousins I Know of our oh there\n...\nAfter more than a week of sleeping in a school gym kids have been asking when they can be in their own\nYou know you all know yourself so you can't really tell them anything but that you're working on it and that to try to get your house you know you know all that stuff\nHe was telling me you know they're working on it and\nThat she's grandfather is planning to pick them up to and from the shelter so they can stay with him in Orlando and as he says he isn't sure when or if they will be back\nOnto along NPR News the County Florida\nAnd that story was produced by NPR's TV stone\nThis is NPR News did you hear about the recent boom in paleontologist inspired by a famous film\nThe drastic generation is one hundred percent of thing\nOr what about the couple that propose to each other simultaneously\nI'm Ari Shapiro the world is full of all kinds of news and when you support NPR you help us report the good the sad a strange and the joy\nOf all kinds of news on all things considered it's what you get every day when you tune into Ninety point one W. H. B. E. it's we're ... we're in the next to last day and we need to cover some ground\nUm we had a goal overall starting yeah we're sixty five pledges in any amount of six Seventy five five three Ninety Ninety or W. E. B. E. dot org\nAnd that number right now is about\nTwenty so we have about Fifteen minutes left in this hour Ayesha Hyman and we need to get two thirds of our our legal and ... and why because we're staying on track to end this Dr early\nAnd we can do it but we can only do that when we hear from you right now that you\nYou and your friends six seven eight five five three Ninety Ninety or W. A. B. E. dot org we've we've made some progress but we really are counting on a hearing for more I view from across the city and so we want to say thank you to Claire in Atlanta Alexandra in Atlanta Jennifer and Roswell\nMy mood in Alpharetta Lara on the east side in Decatur thank you very much\nI Hope that now that you feel so good about making your contribution that those folks I just called out call a friend call a family member help us get those phones ringing six seven eight five five three Ninety Ninety or W. A. B. eat out of work\nStories and so that means you're part of that equation were really counting on you right now to help us to wrap up this drive as soon as we can uh with your caller support your donation of support six seven eight five five three Ninety Ninety or W. A. B. E. dot\nOrg talking about the pleasure that you get from doing something good and the pleasure for making a pledge and it it almost sounds trite to say that you will feel good about supporting WABC\nBut it is the truth when you make that donation it's six Seventy five five three Ninety Ninety or W. B. B. E. dot org at any amount that works for you\nEvery time you tune in and if you were sustain or you can think about it\nFor all year every time you turn on the radio you get in the car you can think that you made it possible for the amazing programming for the ... you know ... of news coverage and for the connection that you have to this region because you supported Ninety point one\nFeel good oh you're it's it's our permission given to use six Seventy five five three Ninety Ninety or W. E. B. E. dot\nOrg and this kind of news coverage this kind of connection that we're able to create through conversations it's so rare I mean if you you know take taking notice of that flip through your radio dollar even through through television\nWe don't see a whole lot of this kind of reporting are available to us anymore and that's because it's just not\nProfitable for commercial media to do that and so we hope that that might be a reason that appeals to you for why public media a public radio is still necessary instill\nIn need of your support right we are thrilled that you listen we're thrilled that your fans of W. A. B. but we certainly want you to know that it requires your donation of support in order for us to continue to do this work six seven eight five five three Ninety Ninety or W. A. B. E. dot org is where we're looking for your donation right now\nHave some volunteers or answering phones let's keep them busy six seven eight five five three Ninety Ninety were WABC dot org\nYou're listening to members supported Ninety One WABC Atlanta\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learn more Raymond James dot com\nFrom the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verify dot Gov slash go and from zoom zoom offers cloud video conferencing\nOn line meetings and video conference room solution in one platform featuring digital video and audio with screen sharing account registration and more at zoom dot us\nSupport for W. H. B. E. comes from city winery the urban winery music venue restaurant bar in private event space singer songwriter John Hi it performs October twenty first and second that city wind ready tickets available at city one re dot com slash Atlanta\nAnd forums in desk its customer service and engagement platform connects companies with customers through email live chat and phone support all from one interface to be the company or customers want you to be learned more at ... dot com [noise]\nAnd we're back with NPR programming in just a moment that we need to hear from you it's six Seventy five five three Ninety Ninety W. H. B. E. N. dot org ten more calls as we wrap up this five o'clock hour or two when that Edison electric bike would give any way to [noise] one to sustain or one to a brand new member\nYou don't want to miss it be a one of the fence and joined Suzanne ... Vincent and Lynn and becoming a contributor here at W. eighty six seven eight five five three Ninety Ninety [noise] or time now six o'clock [noise]\nWith a new sustaining donation of forty dollars per month you're going to guess will be invited to a behind the sounds lunch in here at the station\nYou'll meet some of the W. H. B. host producers and reporters to her at the station\nLearn how we make great radio and lunches on us your donation to W. ab ... the programs you listen to every day so please join us behind the sounds as a sustained her at forty dollars a month or with a single gift of four hundred eighty dollars\nDonations to Ninety One or tax deductible so make your own mind uh WABC dot org or with a call the six Seventy five five three Ninety Ninety thank you\nTo buy these guys Seventy three degrees [noise]\nSix one six Seventy five five three Ninety Ninety WKBD dot the number to call to support [noise] to [noise]\nLive from NPR News in Washington I'm jak sphere the Mexican government is beefing up security at its own southern border as a migrant caravan from Honduras plans to cross the border in coming days as James Frederick reports from Mexico southern border the country's government is also requesting United Nations support\nMexico's interior minister is asking the un refugee agency to help process the hundreds or thousands of asylum requests Mexico expects the receive from the Central American migrants\nViewing already operates in the area but such a large number of request it once was unprecedented here\nCaravan organizers estimate about four hundred migrants are already in the Guatemalan border town ... waiting for thousands ... joined them in coming days before attempting to enter Mexico meanwhile Mexican police with riot gear or already stationed on the border bridge but the caravan planes to cross\nFor NPR News I'm James Frederick in top of Chula Mexico\nRecovery efforts are underway after hurricane Michael devastated parts of Florida's panhandle the federal emergency management agency is working to deliver relief supplies to residents affected by the storm NPR's Jake Harper reports from Gulf county where some residents continue to face uncertainty Sean purging heights\nHot sun behind a box bring you propped up by his house\nI'm waiting for the female lady actually right now she's supposed to be here forty five minutes ago say making as much as I can stay in a dirty house\nThinks is how can be repaired but the storm surge hit the shops he worked at these jobless and says that relief from FEMA is crucial\nSince I don't have a job I don't have insurance on the home I mean it's a real big deal I'm I'm just hoping to get what I can to get my house back up and livable that would just be a blessing\nBritain hopes to find work cleaning up after the storm but if you can't you might move out of town at least temporarily Jake Harper NPR News gold County Florida\nSecretary of state Mike Pompeo was weighing into day on the mystery of missing journalist or ... or send us takes very seriously reports about what happened to the Washington Post columnist\nThe show was last week more than ... more than two weeks ago wandering the Saudi consulate in Istanbul Turkish authorities have maintained he was killed inside post editorial page editor Fred Hi it spoke to NPR's all things considered today and says if Turkish reports are accurate it paints a grim picture for the safety of journalists from certain countries the\nBasic bottom line is that this can't be a world where our government can lure a journalist to their own diplomatic compound in a foreign country and then if the worst is true dismembered him and have him disappeared\nThe Saudis have denied any involvement socks after posting one of the biggest one day rallies in six months earlier this week gave a lot of it back with a big decline today the Dow dropping three hundred and twenty seven points to the NASDAQ fell a hundred and fifty seven points this is NPR\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station\nFrom WAMC and using that land I'm good evening I'm Molly Sam it sticks out for\nCivil rights groups are suing when that county for rejecting so many mail in ballots the county has rejected most ballads because they're missing information on the oh sits on the back of the male an envelope\nCounty spokesman Joe Sorenson says that's because ... is different than the rest of the state because it's bilingual for the county's large Spanish speaking population\nAnd the only difference between that and to stay as far as what the ... we have Spanish language hours that's the only difference is you're going to find the the state of Georgia\nSore and said would not comment on the pending lawsuits or why so many mail in ballots had problems with the U.S hurricane Michael is projected to cost Georgia's agriculture industry billions of dollars Sam Whitehead reports\nSouth Georgia's timber industry took the hardest hit Michael destroyed some one million acres of timberland valued at about one billion dollars Georgia pecan growers suffered hundreds of millions of dollars in losses the exact figure won't be known until after harvest is complete\nPecan farmers also suffered hundreds of millions and losses and downed trees that will take years to replace it's the third year in a road that industry has been disrupted by hurricane\nThe government controlled media has stuck to this narrative that was offered by the crown prince in an interview he gave to Bloomberg News and bad is the journalist came to pick up his papers to get married and then he left\nYou see alternative explanations in social media that he's really in Qatar which is a country is seen as an enemy of the kingdom are maybe his fiance killed him um you see these conspiracy theories to explain the disappearance\nOf course Saudis can search the Web for coverage say in the U.S media but the dissonance is striking this unprecedented golden coverage of the news Saudi Arabia has been replaced by these dark stories of hit squads and brutal torture\n... it's interesting listening to you and I'm thinking of the parallels to what ... himself wrote in his final call him the Washington Post just published and he was writing about how in the Arab world they are so subjective false narratives and these conspiracy theories\nYeah he did talk about that it's really telling he described the effect of the state run narratives and he calls you know people victims of the majority of the population believe it but I think there's something bigger going on here there's this is about the way Saudis especially young Saudis see the crown prince Mohammed bin Salman\nWill stay with that for a second to the we've been talking about how the press is covering this is it possible to gauge how ordinary salad to use a are following this\nYou can see some reactions social media is where you see it shock disbelief fear you know when the crown prince he's known as NBS in the kingdom first came to power he built this cult of personality was young he was dynamic\nAnd young Saudis and that's a huge part of the population\nThey saw him as one of them they based would say we love him he got them and he said he was transferred the country and in some ways he did his rained in the religious police he's permitted women to drive into work he's reopen movie theaters all of that is a really big deal\nThe new Saudi Arabia got all this great coverage it was suddenly cool to be a Saturday\nBut now the country is getting this relentless narrative across the globe so you find Saudis they're angry about it they're afraid you hear you need our oil you need our money why are you attacking us there is no hard evidence they say there's\nNo official proof world so does that translate into the Saudi public uh buying official government narrative of what happened\nI think yes and no I've been covering Saudi Arabia for decades and people I've known for years are now afraid to talk to me um there's fear of getting caught as a dissident getting caught talking to a western journalist there appears to be fear of the unknown when the crown prince came to power he created this tornado of ultra nationalism\nHis face is everywhere in the kingdom so for some they have rallied behind him some of them are changing their Twitter pictures to his\nOh wow is there any room for descent or for free pressure alternative narrative inside Saudi Arabia because there used to be before the crown prince that is true but this crackdown from the crown\nPrince has been unprecedented and the methods include travel bans house arrest detention without charge even force divorce in in one case there is a bought army you can be attacked on social media you'd get swarmed on line\nThe other thing is the palace his criminalized dissent with a law that punishes spreading fake news and rumors with a five year jail term and a hefty fine even if that information is just stored on a computer\nAnd just briefly where those measures in place before the ... case\nThey were article six of the anti cyber law was introduced because of Yemen but it was pointed liberty published on October thirteenth apparently to quell any speculation over the disappearance of a prominent journalist\n... just five days ago NPR's Deborah Amos thanks very much thank you and to another story now\nTexas where near record floodwaters are pushing through the central part of the state the governor has declared a state of emergency in Eighteen counties in Austin officials say they may need to open more floodgates than they have ever open before which could protect the city\nCould also send more water downstream most ... of member station ... reports\nCentral Texas has been getting a lot of rain for weeks now this flood actually started days ago was storms in the hill country northwest of Austin that water fed creeks and rolled into the Leno river by the time it got to the small community of kings on taxes Tuesday it turned into a surge of water strong enough to take out the main bridge\nInto town hall died this tape from Austin K. I. T. V. for the pieces of the bridge here flipping\nBut they didn't get decided that the pieces of the branches flipping over the river rose fast\nIt flooded homes and ... joined the Colorado River and got bigger and marble falls Jonathan Hammond watch it rush by from the\nBanks this is just\nCrazy absolutely crazy uh we went and looked at the damn this morning I've never seen any water like that ever\nThreat a Higgins said she was rescued by her son who carried her and her dog to safety through waist\nHigh water I was in my little trailer the next thing I Know the water rushed up to it it was that the windows in my car and my trailer and just when\nThe reservoir above often called lake Travis has captured more floodwater and a week and then the city uses in four years it's running out of room if it gets much higher it could over top and flood hundreds of homes so the group that manages the reservoir say they may need to open more floodgates than ever before in the coming days\nPhil Wilson is general manager of the lower Colorado River authority\nPeople need to take every precaution protect their safety and their property\nThis flooding comes just weeks after the national oceanic and Atmospheric Administration updated its data on Texas and warned that severe flooding is much more likely in this area than previously thought climate change has a part in that says victim Murphy with the national weather service\nDoes the atmosphere warms it can hold more water and when it gets wrong out it was more and more shuttering out there for a heavy rain can fall\nIf officials in Austin do open more floodgates they hope to limit flooding in the city to mostly streets and Parkland but communities downstream could see more severe impacts they say much depends on the weather over the next few days and rain is in the forecast for NPR News I'm ... in Austin\nYou're listening to all things considered from NPR News support for WABC comes from Kaiser Permanente were members come get flexible care whether in person by phone or on line members can visit with a doctor and get care on their schedule more at KP dot org Kaiser Permanente thrive\nHi I'm Susanna Capelouto and senior editor at W. A. B. E. I Am often the first audience member of a lot of the stories so when I hear a story and I don't understand it or I don't get it\nI have to make sure that it changes so that at the end the product that goes on the air is the best possible story we can deliver\nAnd that is the commitment that we make here locally at W. baby in the news room to always do that to the best of our ability as story might start with a a pitch from a reporter be approved by a news director the critical final step is that we're of our senior editor here at Ninety point one Susanna Capelouto\nBut uh the work really begins right now and that's when you were talking to you\nBecause you listeners are what keeps the station on the six Seventy five five three Ninety Ninety W. H. B. E. dot org the way to do that now in the last break\nWe had a goal of Eighteen and we met that goal right now in this break sixteen all things considered listeners to six Seventy five five three Ninety Ninety or W. E. B. E. dot org\nAnd Ayesha Hyman that will keep us on track it'll keep us on tracking it also you'll be entered automatically into our drawing for it today it ends", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Atlanta", "day": "18"}