{"month": "10", "state": "NY", "station": "WAMC", "content": "Film at Columbia dot org for tickets and the daily grind Detroit New York sort of brush all day long on Sunday is with a jazz brunch from noon until two PM betray capital district jazz artist now offering and while\nThe daily grind dot com [noise]\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany\nW arguing HD Ninety point three rooms and Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry W. N. C. H. D. one oh three point nine ... W ... five one great Barrington\nW. W. E. S. H. D. idiot point nine mount Kisco W. A. N. D. H. D. Ninety point one Stanford W a an eighty eight point five rooster and WAMC am fourteen hundred Albany\nSupport for WAMC comes suddenly ... debt council taking action to preserve the Adirondacks and secure its legacy for future generations Adirondack council dot org the Waldorf school of Saratoga Springs given children the education and tools for the challenges of an ever changing world Waldorf Saratoga dot org\nGrapes and grains wind and spirits east rebuffed York offering wise and crap spirits from around the globe and from local artisans handpicked selection of winds single multiple small batch ribbons grapes and grains wind dot com\nThe Empire State plus a performing arts center presenting are low Guthrie performing Allison's restaurant and bar with his band and special guests Sara Lee ... three October twenty six at seven thirty PM the egg dot org\nAny Eric ... museum of picture books are Amherst, Massachusetts celebrating the golden anniversary of the very hungry caterpillar with\nA new exhibition and activities Carl museum dot org\n\nLive from NPR News in Washington I'm jak sphere\nSaudi Arabia is acknowledging the death of journalists ... the Saudi ... according to report in the Saudi state news agency NPR's Peter Kenyon reports Eighteen people are now under arrest including to advisors to the Saudi crown prince\nOfficial confirmation of ... death came from a report in the U.S\nStreaming support for WAMC comes from my dog harness dot com and no ... no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nSeveral officers were fired including senior intelligence officer major general Ahmed Asiri and another advisor to crown prince Mohammed bin Salman subtle Tony\nTurkish investigators have said 'cause show was killed in his body dismembered until now Riyadh and maintain could show you left the consulate freely and it didn't know his whereabouts Peter Kenyon NPR News ...\nSpeaking in Arizona tonight President Trump called the Saudi announcement a good first step the president also said he would prefer any sanctions not involve canceling arms sales\nDrop administration wants to deliver more water to farmers and his ordering a fast track review of environmental restrictions in California and other western states Here's NPR's Kirk Siegler memorandum takes aim at California's complex delivery system of publicly built and federally subsidized water canals\nFarmers in the states Central Valley have long decried environmental restrictions that limit the amount of water pumps south from snow fed reservoirs due to endangered fish in the Sacramento delta\nThat's the largest freshwater estuary on the west coast it's not clear how much teeth this memo has and if an environmental roll back were to happen it would almost certainly be litigated\nTrump signed the memo in Arizona State that gets most of its water from the Colorado which is not part of this review but he was joined by California Republican Jeff Denham who's in a tight reelection race\nKirk Siegler NPR News Los Angeles US law enforcement intelligence agencies say they are still worried about possible efforts by Russia China or Iran and other foreign countries to meddle in the upcoming us midterm elections\nAs the latest assessment from the office of the director of national intelligence the Justice Department the FBI and the department of homeland security homeland security under secretary Chris crabs says there's no evidence the tax compromise actual voting systems\nWe haven't seen certainly any compromises or any sort of access to a lecture to whip meant across the United states at this point\nAll the agencies are concerned about efforts to sway public opinion do some state and local governments withdrawn polling sites have reported would appear to be attempts to block their networks though officials say they were able to prevent access stocks have up or rally early in the day to end the session mix the Dow Jones industrial average was up sixty four points to twenty five thousand for forty for\nThe NASDAQ fell thirty six points today you're listening to NPR\nA caravan of Central American migrants who arrived at the border between Guatemala and Mexico clashed with Mexican police today about fifty people were apparently able to push their way through a Guatemalan border fence defined both Mexican authorities calls for an orderly migration and US President Trump's threats of retaliation\nPlease then closed the gates the migrants from Honduras have said they intend to make their way to the U.S\nPresident says he has no regrets about his rally remarks praising a Republican congressman for quote body slamming a reporter NPR's Tamara Keith reports the Montana congressman pleaded guilty to a misdemeanor assault in two thousand Seventeen\nTaking heat for his comments praising congressman Greg gene forte Montana asked if he regrets there were a marked in light of what happened to Saudi journalist your mouth to show the Trump said no not at all\nTremendous versus these [noise] stay with\n[noise] the\nWhite House correspondents association president Olivier not set in a statement that the president's praise for the assault amounts to this\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nTo be renamed says the prize was not risen to a billion dollars that no one pick the six winning numbers Tuesday nights multi state drawing will be the second largest lottery prize in us history five other top ten drawings of all come in the last\nThree years\nI'm jak spear NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include the joys foundation\nCommitted to advancing racial equity and economic mobility for the next generation and the great lakes region learn more at Joyce SBN dot org and the ... foundation\nSupport for WAMC ... Clarkson University capital region kept his union graduate college is now Clarkson University offering graduate programs in business healthcare management data analytics engineering education bioethics defy convention Clarkson dot edu slash graduate\nMass mocha north Adams, Massachusetts presenting ... Sharif keys in the groove in concert October twenty plus indie pop powerhouse tune yards with us girls October thirtieth\n\nFrom WAMC in Albany this is the legislative does that a weekly magazine about New York state government and politics your host is David Guest Dina political commentary by Dr Allen shark talk political scientist and professor emeritus at the university at Albany\nState wide distribution for the legislative is that is made possible by New York state United teacher representing professionals in education and healthcare online at N. Y. S. U. T. dot org [noise]\nComing up this week after a violent incident that the ... metropolitan club they Democrats and Republicans are blaming each other our political observer Allen shark cultures his thoughts on Larry sharp the libertarian candidate for governor in New York state and local officials mark the completion of the first phase of frontier town\nThose stories and more on the legislative is that [noise]\nState Democrats and Republicans are accusing each other of condoning violence after a weekend incident that left the geo peas metropolitan club in New York City vandalized and protestors from far right and far left groups under arrest we get more from the legislative ...\nThe trouble began when the leader of Proud Boys Gavin again it's scheduled to speak at New York city's metropolitan Republican club on topics including deep state socialists and western values such according to the club's website\nProud Boys is the far right men's organization it's listed as a hate group by the Southern Poverty Law Center\nHours before the speech the GOP club was vandalized by far less antifa groups that short for anti fascist who broke a window and scrawled graffiti on the front door\nThey also left the threatening note saying this is only the beginning both Proud Boys and the antifa groups condone violence as a means of getting their message across\nAfter McGinnis spoke and proudly members left the club\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nCount as north Hudson supervisor run more expects a number of jobs to result from the states work and from a new brewery being built adjacent to the site\n[noise]\n\nRegional office of sustainable tourism precedent James McKenna believes the state's work will significantly benefit to read\nStreaming support for WAMC comes from my dog ... dot com a no ... no ... Doug harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nNumber two it's identifying from areas where we've seen some real need for advancement certainly camping certainly or back riding and and other things but\nThe fact that it will have such access to a large number of people I eighty seven or the ironic north way is the main feeder or you know the New York metropolitan area that capital region and beyond\nAnd this should serve as a good location to help diversify where or hikers or growing criticism\nFades two of the project will include creation of recreational vehicle and tent camp sites according to the governor's office in twenty Seventeen more than twelve million people visited the Adirondacks\nAn increase of nearly twenty percent sense twenty eleven I'm pap rapidly WAMC news\nEarlier this month New York governor Andrew Cuomo unveiled animation of a bicycle and put ... on the Mario Cuomo bridge the sheer use path as a work in progress mayors of the villages at each end of the Tappan Zee replacements say while they look forward to the pass opening next year they still have some concerns\nBut legislative visits are wasn't done picks up the story\nAlmost sense a three point six mile bicycle and pedestrian path will be one of the longest in the U.S and we'll be the first advocate of crossing for such a user spanning the Hudson River between Rockland in Westchester counties Bonnie Christian it's mayor of south Nyack on the Rockland County side\nShe says after controversy early on years of partnership have yielded and agreeable plan\nHowever we have um we have concerns and they threw away and the state has been listening to our concerns you know one thing I'm Will be a shared yourself\nSeals and twenty four seven I'm you know the state will be patrolling it and you know we are residential area so one of our concerns is way of life that Olson some dawn to dusk I Know the Lakers won it twenty four seven I'm you know maybe somewhere on the middle or\nWe can um compromise I don't know\nOn the west Chester side Terry town marriage or effect solitaire is concerned about the hours\nYou know having an open at two o'clock in the morning just doesn't seem to be a particularly great idea\nHe adds what will be interesting and and you\nKnow could be ... plus Kobe Bryant is is is how much is it truly going to be used by people commuting on bicycles and if that will be a suit you know if there'll be a significant number I mean there are some people some bikers who have said well what if we bike to the you know we bike across we got on the train we go to the [noise]\nWe go to the city and then we come home late from work I'm it's closed [noise]\nNo the I Believe the answer to that is that they have put 'em bike racks on the new buses that are going to be traveling across the bridge so I think that concern um is pretty much alleviated or should be a bit I'm sure the bikers well you know they won't feel that it's you know satisfactory\nCommuter bus as well have bike racks meantime it through a authority spokesman says the state has not made any final decisions regarding ours and that it is working with the village mayors bicycling and others south ... Christian has another concern\nParking is a concern for us because you know no one knows if fifty for parking spaces that they're they are\nStreaming support for WAMC comes from my dog ... dot com no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nBubble um we need help to see what\nThree and south Nyack\nYou know where we would see the most parking and I'm sure that would be you know around a shared use path as and you know where where we can charge a where we can see her as a combination of trying to do her um parking but also if there\nWill be parking you know it's a chance for our village to um make some money off of it or make a make a profit\nParking on both sides on state land in Westchester the parking will be shared with a lot for the three ways new maintenance facility that says the thruway authority spokesman would yield more than one hundred twenty spots on weekends counting use of the maintenance spots\nAnd what not using the maintenance box there will be thirty basis for the shared ... on the Rockland side there are about fifty five spots on state land\nIn addition to parking lot each landing point will feature bicycle repair stations restrooms and other amenities Terry towns picks out\nI mean it's not in a residential area directly but you know it's it's some distance away and there's a fair amount of parking provided um especially on the weekends but\nIf you know if if it's you know seemingly popular if it does\nThere is a potential for the parking could be used up and then there'd be spillover um and then then the question is what you know what happens with you know with those cars when they come now the the the state authority has they've sort of committed to dealing with it if that happens in finding solutions\nTo charities pockets later for completion and twenty Nineteen with a twelve foot wide path on the northern side of the west bound fan of the bridge New York state thruway authority acting executive director Matthew driskell offered a first look at the animation earlier in October at the twenty Eighteen New York bike summit in Saratoga Springs\nFor the legislative get that I'm Alison die\n\n\n\n\n\n[noise]\n\n\nYou are listening to the legislative you set a program about New York state government politics I'm due to just you know next\nYear the state capital Albany will host the ... international sporting competition and entertainment festival the legislative ... Dave Lucas explains\nAthletes from the United states and all around the world will gather in Albany for the ... games\nStreaming support for WAMC comes from my dog harness dot com no joke no poll Doug hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nYou want to do is have a festival\nThat is going to extend from the streets out there through the arena up until the convention center and we're going to celebrate Women's Sports like it's never been celebrated before so with that I'm happy to announce that we're going to break be bringing the Aurora games August twentieth of the twenty fifth two thousand uh Nineteen right here to Albany Times union center\nAlongside the competition movie festivals celebrating women in entertainment the arch business and culture Aurora games advisory board member Donald ... is a former Olympic swimming gold medalist and ABC Sports journalist\nWe found out that Ninety four percent of women that make it in the higher echelons the sweetest CEOs CFOs Philo had had a sports background and\nFifty pretend that competed in college so what does that say about the sport experience there is a direct correlation it's about leadership and taking our place as business women and ... and functioning in our culture and you know what were the end of the world\nSo it's it's it's important that we are the first to do the Aurora games next August to welcome the world to come here and see after\nForty some years of work a breaking down doors and prejudice what sport can do on the field of play because you never know what sports can take you\nSome of them and says the games conducted the nation wide search finally settling on the tea youth center", "show_name": "Legislative Gazette", "year": "2018", "city": "Albany", "day": "20"}