{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\nMm Mm\n\n\n\n\n\n\nMm\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\nMm\n[noise]\n\n\n\n[noise]\n\n\n\nRight\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] ... her horn cello is performing with the ... in the orchestra this morning when concerto number one ... [noise]\nDid you hear that interesting news story on NPR isn't that auto correct a great way to get advice about your car I heard Karen\nBrown saying it's gonna rain today if you listen to Mississippi Public broadcasting you probably can say yes to that statement cliche your support an MP by making a contribution to go to empty beat online dot org or call one eight eight eight\n... ... we need you to do your part to support Bebe\nStations have been ... be music radio R. W. M. A. H. Biloxi W MA bimbo W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G. [noise]\nCelebrating the power of music in the hands of America\n[noise]\nThank you and welcome were back in our home town in Boston, Massachusetts but this time in a venue new to us the media Arts Center at rocks very community college\nA big thank you to the college for opening their doors to us and for opening their doors to an audience made up entirely of students from to Boston schools the conservatory lab charter school and the bridge Boston charter school are you guys ready for a great show out there\n\nThese kids no GOOD Music when they hear it because music in the central part of their school lives both schools have visionary music curricula inspired by el ... the famous Venezuelan approached music as a mechanism for improving the wellbeing of young people\nWill hear from a couple of kids from these schools later on in the show but first a young performer who comes to us from Greenville South Carolina please welcome Eighteen year old violinist Sam ...\n[noise]\nWelcome Sam tell everyone what you've brought to open the show we will be playing the second ... in a major by ... looking forward to it\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[laughter] [noise] [noise]\n[laughter]\n[noise]\n\n[noise] [noise]\n\nMm\n\nMm\n\nMm Mm\n\n[noise]\n[noise]\nAnd then you know [noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise] I\nWas young [noise]\nAnd has been studying at the junior college program was cleric him nicely done hon thank you for that don't often get to play that on the program beautiful piece a con lakes Sam you're one of our jak can cook young artist what are you planning to do with the award money\nUm for the past five years have been the United states I haven't had the chance of owning my own cello and\nLuckily my teacher back in Japan has allow me to use a cello and the United states but currently I'm using a telephone the Juilliard School but I'm very thankful for everyone who's um loan me there ... and gave me the opportunity to use\nIt would be very nice to have your own instrument so important to you in the country on your own living with a host family so you can attend Juilliard pre college so being here without your own family I imagine you've been especially close to your teacher at Juilliard cleric him\nYes ms Kim has been like my mother in several different ways especially through her constant ... me and telling me how to do something and yeah um [noise]\nAlong with all the musical things she taught me she taught me how to become a better person in many ways and she's like my mother\nAnd so great but hon I think we have to point out that you've been keeping something hidden from your teacher something big really big and frankly some things you should know about\nHere on national radio it's time for you to tailor your true confession\nLet's narrow the field is this about how much you do or don't practice not really are you playing rock and roll cello inside nope [noise] are you learning a piece that ms Kim doesn't approve a snow OK spill the beans on what's your true confession\nWhile crazed I've been playing on the volleyball team at my school in the great [noise]\nYes that's true my my whole thing has all been asleep it [noise]\nI haven't told me teacher because she'd worry too much about my hands getting hurt\nI'm worried about getting your hands for it oh my gosh they so feel better getting that off your chest yeah great well don't jam any fingers playing volleyball because your cello playing is too precious to miss the thank you honey best of luck [noise]\n... years old\nYork [noise]\nNext up a trombone quartet from the merits school music in Chicago we have ... plus helping you do and curl Kirkpatrick both Eighteen years old Jonah Blake sixteen years old and Raphael Noriega Fifteen they call themselves the bone rangers and they're coached by Timothy Reardon\nThe bone rangers are going to perform two very different pieces music one from the early seventeenth century the ... and one from the late twentieth century the ... from ... runs his trombone quartet\n\n\n\nThat's what\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nI learned from this\nAs I mentioned at the beginning of the program or a live audience today is made up entirely of students from two different charter schools in Boston both of these schools are special in that music is central to the curriculum Robert I'm going to have one of our students president start your interview who's out there what's your name and what school do you go to\nMy name is ... and I'm In fourth grade and what school do you go to rich by greed or and what's your question no question for you today is why did you pick up on\nWell that's a good question um I think I Would all really started is that I fell in love with the sound I really liked the sound of the boats a nice warm tone\nAnd I remember eyeing it you know in fourth grade you would see in the music classes those would win posters you have your flu you're clarinet and then you just see the oboe and now it's just so curious about it and then in like eighth grade I decided to pursue oboe while I was playing flute\nAnd officially in tenth grade is when I actually just started to go full time on the oboe and quitting the flute unfortunately but yeah I think\nGoing to concerts and seeing and hearing the oboe and looking up online and hearing the oval I really appreciate like the sound\nAnd this is a study of music performance was sort of turned around real world style or by your next door neighbor who performs in public a lot\nSo yeah my neighbor ah Jeff Davis um I was best friends with his son and he gigs around your Clearwater with this with just jump in and best friend's phase violin and it shows you that you can do music\nUm that it's worth you can live with music for the rest of your life and that inspired me and I remember him giving me a flute and trying to for me to make a sound out of it and I was always just drawn to music\nYou know and it's nice to be able to know that yeah there's all kinds of ways people are willing and just hopeful for you to share their music with you in any kind of venue on the streets where you want\nWill you certainly have the drive to succeed you were telling me that you record yourself a lot as you work on a piece that's that's pretty tough criticism\nYeah so my teacher Mr Philips and he really taught me to record myself and I had to think of Freud even though I hate or listening to myself I'm you know on the recordings it's good for me because self teaching is a very good quality to have\nBecause your teachers not always there with you so I record myself every day when I practice and when I'm preparing for things so I can improve with my own ears\nWell that's great discipline in as as you say it's very very hard to listen to yourself and want to go on another day yeah well the proof is in the performance and Robert that was quite beautiful length thanks for being with us Robert de as Eighteen years old\nThe [noise]\nI'm from the top featuring bonus content not hurt on the radio broadcast are available every we get from the top dot org prince\nLike the boon rangers are trombone quartet from earlier in the program or next young performer is going to ... to pieces back to back that were composed centuries apart from one another please welcome from Hanover New Hampshire Thirteen year old piano Maxine park [noise]\n\nWelcome Maxine what are these two contrasting works so\nI'll be playing the six minute about second party that they could reach ... bringing about the Eighteen century and then I'll be playing ... six contract ... pastor all written in Nineteen eighty four stages yours\n\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n", "year": "2018", "show_name": "Best of Car Talk", "city": "Jackson", "day": "27"}