{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n\n\n[noise]\n\n\n[noise]\n\nYeah but you're also called in London town known to and the cocaine overture by Edward Eldar that was the London philharmonic orchestra led by surge George ... T Edward Eldar celebrating his invitation to attend and participate in an all Eldar evening I'm Lynn waffle hope you're enjoying your we can't\n\nGet your MBP car tank anytime it doesn't even have to be up for renewal simply go to your county Amish sign up when you get in the car tags portion of the helps NPD continue to educate informed and entertain\nMe on line or flash cards [noise]\n\nRestrictions would be be music radio R. W. M. A. your age but luxury W imagery Google W. M. A. U. Butte\nThere'll be him beat him direction W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. green word check out what's happening on MTV music radio and listen online at him be be online dot org gee [noise]\nCelebrating the power in the hands of American\nHere's our host concert pianist Christopher O'Reilly will come to a special from the top today we're going to visit one of the great competitions were teenage classical musicians in the U.S the stole bird international string competition [noise]\nYou've heard plenty of ... middle is on from the top over the years because as we search the country for talented young string players were drawn to this competition and be incredibly gifted batch violinist violist chose and bassist who show up every year in Kalamazoo the home of the stole Burke\nUh shut down for a brief conversation was Margaret Hamilton the executive director of the competition after the semi final round to help set the scene\nMargaret tell me briefly the history of this job or competition and why it's ... years it's really an honor of much below ... teacher yes\nYou are so right it's in honor of Julius stole Burke who was a long time resident of Kalamazoo\nMusic faculty member here at western Michigan University School of music directed the Kennedys who juniors symphony for decades and died unexpectedly or too soon in Nineteen Seventy four\nAnd it was his family and friends and community members who literally gathered around after Spellberg kitchen table saying how do we commemorate the life of this man\nSo they came up with the notion of competition and\nThey hoped at that point in time that it might last for five years but Julius had extraordinary ties to the greater string community and of course his work with strings students he was the violin professor at was legendary here so we're just so lucky that that legend that done much beyond five years\nIt's just an amazing thing so described the process to me you know how many kids apply every year\nThis year we had an all time record broken we received over two hundred applications so each year it's been growing and I believe that there are a number of reasons word of mouth happy contestants happy parents extraordinary performances that come out of this\nPlus the supported the audiences here in the Kalamazoo community\nA young person will apply anywhere between the middle of October to our February first deadline and then those applications go through two rounds of screening here in Kalamazoo it's an anonymous process\nSo if we take this year's numbers as an example those two hundred applicants were whittled down to the twelve semi finalists that we heard today how is\nThat even possible I mean I Know it just you know the proof is in the putting of course the ... that I heard today we're more artist when competitors I think uh so what does that process like a Jew or do you have a a hair splitting moments you know getting them down from two hundred or is it fairly obvious I mean the the level must be astronomical\nI I think the level is astronomical and I'm always grateful that I Am not the person making those decisions are screeners who do remain anonymous stairwells versed in the literature and the profession or in the field is like\nOh my gosh well I was really scared that I was going to drop it or something so it was really nerve wracking but um I mean the second I played it I was like this is amazing I have never made that sound for in my life and he was a really um a memorable\nMoment for sure and you not only played you know on this beautiful instrument but you played the most beautiful violin concerto ever written as far as I'm concerned the Koran goal is just an surpassed\nI think this was an unfair advantage I think I agree really put you in the in the top category on in this competition\nAnd are you and you played it so beautifully and and enthusiastically and and it's I Can't believe we've known each other now for about five years and I owe you a coffee you know we ran out of the judge I mean literally ran into each other in Boston she was at the midtown and I was coming from the ... or something\nAnd we you know would you get started and I made her drop her very expensive ... street\nY O U coffee yeah and we've got runs for you here at stole Bergen and I can't tell you how proud we are from the top of being able to follow you and work with you and and I'm just stay stay with the family\nValues I don't think you probably don't you think you thank you so much check at our online video series featuring music videos with our young musicians performing with artists from across the musical spectrum subscribe to our YouTube page at YouTube slashed from the top\nOver the last Thirteen Years from the top of the ... foundation ... awarded over two and a half million dollars in scholarships to talented young musicians who have financial need we still have more to give credit from the top that or to learn more\nMixed up the silver medalist at this year's stole bird international string competition Fifteen year old lovely who studies at the Juilliard pre college division she'll perform the opening to movements\nOf the old guard ... concerto the pianist again is Elizabeth meal [noise]\n\nNah\nNah [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\nMm\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\nMm\n\n\nAnd to be honest I don't know because I was just so focusing on myself and becoming a better chosen to better artist that you go out and play and it's an incredible education tool for for every contestant whether they make the semi finals or not\nI was going to ask you about that because you know my experience with competitions Cliburn et cetera [noise] my impression was that I learned more and listened harder and worked harder at competitions than I ever did in school was that your experience\nExactly and I remember when my teacher to Indiana fruit smog said in my sophomore year it's time for you to do competitions and\nI was like oh yeah baby I'm going to practice are now and to and I certainly do certainly was a a tool um I did play this contest when I was sixteen years old three years earlier\nAnd didn't make a I'd made the finals but didn't get any awards and\nThe funny story with that is that of course I wasn't you know a local here\nAnd I know we we have at least that here you are a prize winner at this little bird competition a Kalamazoo native\nAnd now coming back as a judge set right and the first time out as we age sixteen tell me right and the first time I didn't\nGet a prize and one of the judges with Fritz smog who was going to be my teacher in college which I didn't know yet\nBut he was also the teacher of my teachers here and so as the contest ended we had little party at my teachers host and Fritz ... was there and my parents were invited and he told me to bring my cello 'cause he was going to show me\nWhat my problems were but before he did that he sat us down and the first thing he said to my parents is no let's discuss the lunacy of the judges [laughter]\n[laughter] I like that [laughter]\nAnd you know it wasn't lunacy at all in fact I wasn't set at all I mean it was I I had no idea\nWhat the true level was and I was sure that it was higher than what I had played in that I had work to do so\nThere are three judges this year in addition to Tony there's violinist Scott St John an errand working founder of the sinks competition [noise] so what are you looking for what are you listening for and what what sorts of things pop out\nThe first thing for me is is I Want to be moved\nI I Wanna I Wanna feel their emotion that they understand the motion of the peace in that that if a if the peace\nCalls for me to cry and feel like I Need to cry um I went to fuel I Want to hear their voice as\nAs a great human voice so they freeze in seeing a those are probably my top two things you know and and the point of this is to reach people performing onstage there's no other point to it unless you reach out to your audience and make them feel something special and so that's what I'm looking for\n[noise] and as a ... you must pay special attention to the winner of the box surprise is that something that you will vote on or is that something that you kind of hold on dearly too and in terms of your turf being there for\nThe cello sweets well not really 'cause the violence and others are pretty good rate ... rates really [laughter] yeah that that's true and it is they're really just\nYou know the public is also took him twelve years of practice before he would put one in public and I feel that way I mean I barely feel my boy you know after forty years of practice you know so um [noise]\nUm I don't feel no I mean I Love the violence and not as important as equally I think they're just a different choice of Mr book [noise]\nAnd so much so much is going on even know continuously with Bob and technique and wealth into cities or a glistening\nPockets of just a bunch of notes on the page there's very few directions right you know if you go to Peter was talking a lot of details you gotta really where your book book there's nothing there you have to really make an interpretation is compiling some sense of style\nAnd that's that's a wide range where people think style is anyway so so Baucus always very telling about you know what's going on inside the performers mind [noise]\nTwenty ... speaking with you thanks for being with us and congratulations on job well done much to talk to you and it's great to be things\nAs you learn from the conversation was Tony Ross the stove ... international string competition presents a fourth metal beyond the bronze silver and gold to the best performance of ball during the semi final round\nThis year's winner playing the gruff movement of the small number two and a minor was sixteen year old violinist from Seattle Charlotte marks [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nSixteen years old for the ... movement of the\nBox and all the number two in a minor here's an interview I had with Charlotte about her box playing and about her going on to win the gold medal here at the ... international\nString competition", "year": "2018", "show_name": "Best of Car Talk", "city": "Jackson", "day": "06"}