{"month": "10", "state": "NY", "station": "WRUR", "content": "[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] who\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\nMe me\n\nToo\n\n\nDo believe that [noise]\n\n\n[noise]\n\nI king check me after dark from the from the digital each ... Mm twenty Fifteen Years to find a theater in LA the Rolling Stones can't you hear me knocked him\nFrom Sticky Fingers allied with the ... theater and it was Mike doty you should be satisfied you know my main job commercial\nChapman happy man my duty\nYou got wraps up this hour thank you so much for listening and of course we love it when you're in touch drop it snowed undercurrents radio dj e mail ... and you can check you're pretty much had under current radio dot man\nSure number forty seven eighty one researcher named for special where Governor Palin I co host and also take the microphone out of the interview interesting people\nAnd make sure the new music because we can check your listings or listen to the stream at ... dot net\nThanks to cover your cost a lot of trust you know I understand the jury ... wrecker and support comes from the corporation for public broadcasting from the fringe of under your supporters were monthly annual contributions\nAnd envy what stations like WTO guarding brightened arrest warrant it W. M. O. T. in Murfreesboro, Tennessee and this is made him boy swan\nAmerican radio network\nYou're listening to members supportive public radio W. R. U. R. S. M. an HD Rochester you're listening to W. I. T. H. F. famine HD one at the W. R. U. R. FM an HD Rochester different radio\nThis is your weight as any inviting you to come inside of the world of gospel Sunday mornings from eight to ten here on eighty eight point five W. O. U. R. S. O. H. D. Rochester different radio\nBook that was wrong Rob in the ... ... ... ... ... who who\nWe'll cocky joins us on the next mountain stage along with being K O Josh Ralph Ari Hasse and Johnny Iran\nBy this and we'll go out and joined me this week and live performance on ...\n\nThis afternoon it to end up where you are you are ... Rochester\nLive from NPR News in Washington non Giles Snyder President Trump says he will pull the United states out of a landmark arms control agreement reached with the former Soviet Union saying Russia has been violating it for years\nWe're not going to let them violate a nuclear agreement I go out and weapons were not allowed to wear the ones that have stayed in the agreement and we bonded agreement but Russia is not on your time today so we're going to terminate a brave and we're going to pull out in\nThe Nineteen eighty seven agreement requires the elimination of short and intermediate range nuclear missiles U.S officials said previously allege that Russia deliberately deployed to land based cruise missile in order to pose a threat to NATO Russia denies that it has been violating the deal\nAfghans casting ballots and parliamentary elections for a second day after voting was extended to accommodate people whose polling stations did not open on Saturday and pure ... deep reports from Islamabad\nHundreds of polling stations opened Sunday says or does he missed that chance because like total self simply didn't turn up likely because the Taliban and ISIS have threatened to talk of the elections and throughout set a date that well dozens of attacks including a suicide bombing in all the I pay counted ... people killed\nThe ... elections will also not by chaos biometric systems what confusing to use and some stations didn't get ballots despite that over three million voters did turn up\nIt will still take weeks for official to tally the fights these elections will be closely watched as a dry run for a presidential race next yeah do you date NPR News Islamabad\nAre are reports of more violence today the a P reporting that a roadside bomb has killed at least eleven civilians in the eastern ... what a mile around Fifteen hundred mostly Honduran migrants sleeping under a bridge that separates a country from Mexico Emily Green reports on the caravan of Central American migrants trying to reach the United states\nTen or ... ... ... ... ...\nThis Utah was given to me by a man Tom Green was not too much to look\nAt but at least every day ...\nReally well this country you know five ... ... ... men\nAre in a much better than\nThey are saying well you know ... ... ... about\nA man\nWould it take to know\nA show you know that much\nAs you might see ... and\n... ... ... ...\n... ... ...\nThat's just about ... ... oh no\nKidding yeah\nThis this pair of boots maybe in a funny any of the ... then\nThat love the Jack Lemmon bag net and hanging on well\nNot so much as they see you in ...\nThen the other thing you know ... ...\n... yeah\nI wouldn't take too long to\nShow the thing that I might you might be more than ten dollars ...\n... ... ... ...\n... a\n\nSong called step inside this house a guy Clark song as done by Lyle Lovett live\nIn our studios at least a cafe we're presenting words and music program this week since that's the guy Clark song and we're a little guy Clark story from my love it we thought we'd go even deeper into our archives to Nineteen Ninety five for an original story from the late great guy Clark my wife\nSusanna was had an appointment to write with key sites in Memphis we live in Nashville she had an airplane ticket but\nIt was going to call a cab to the airport and she started thinking man I hate this kept these guys are sloppy you learn their own time the cabs smell bad and she said well not treat myself I think I'll get a lemme so she got to move\nOn to weigh the airport and she's sitting back there and it's got a phone in a bar in a TV set you know and it's just lap of luxury and she was knocked on the glass and so I mean take me to Memphis\n[laughter] I'm averaging like you're crazy [laughter]\nYeah the listeners who aren't aware ... what what kind of distance are we talking about\nTwo hundred miles from Roche [laughter] usually that okay so that that\nGoes down the road and the about halfway there she was starting to feel weird about the expense and the the guy was looking in the rearview mirror and he said you're Susanna Clark she said yeah you're ... yeah yeah I ran into him the other night said I beat him out to hundreds\n... recorders [laughter] she has no problem driver [laughter] and actually it wasn't that much more expensive than a plane ticket where it was a great story\nWas she did not warm and dry she did not want to fly and she did not along the way\nThat she did not want to you know he did not want to hurt you know she did not want to know whether it's ... don't learn [noise] man a\nI Want men on the minds of St in [noise] [noise] ... na\nNa na men she did\nIt last year while they're learning how she was not there'll be plenty but she was looking good and ... and then I got to know which one you know\nHow to get it you know ... they dont regret van them out and then\nYou lose Eli dined in the ... the man at the\nOh man did pass yeah well that's right\n[noise] [noise] [noise] and then there are ... and ... [noise]\n[noise] [noise] we can\nShow them but we didn't Jan was right man though when when you know\nAnd\nWhy she's grown men I let you know no one has branches\nBut then you know and don't let us know about is the ... she knows was bad you know one of the ... man into\nOlder men ... [noise] I'm reminded blind to the ... the\nOut of men usually did gosh yeah wow ... ... ... ... ...\n... ... ... ... ... ...\nAbout a man and he did\n... well ... ...\n... ... Mm Mm Mm Mm Mm Mm Mm Mm\nMm Mm and ... and you know ... ... ... ... ... ... ...\n... ...\n... last you know the Philadelphia producers singer and songwriter son little as we continue our words and music Joanna ... you\nCan really understand the last ... music a lot for two months and months one and write anything not because I wasn't trying I mean I read anything at all and and I I was kind of felt like\nI might never write anything ever again you know I mean I had some moments like that\nAnd then in months to Iraq or Lebanon so you know and then here I Am to two and a half weeks and and I wrote write songs in one day she had no right there was NO PLAN to do anything me I'm\nMatt ... own deal man on the young men\nFrom the Internet boom boom deal man [noise]\nView that that the\nPhone rang yeah petrified oh\nDang\nAin't no way to make you say you want to run and make the brand new sun\nUm do you like that\nYou go around the globe another terror way\nYes\nAnd no matter what you do all the pain in the mid ... days\nOh not on the young men\nMm [noise] on your own my own\nYom ... road training well Neil ...\nDoo doo doo\nDoo doo doo doo doo doo Mm\nMm Mm Mm\nMm do from time to do when I'm a veteran noise that can throw them my mind\n[noise]\nIn the ... thing but that that do you\nKnow I feel like that everywhere\nYou go well into but not the way yeah\nAnd no matter what you say oh Jane and everything they owe me I'm not\nThe only real mad in the ...\nI was done addicting showing up book and I was out in the brain they're learning how to kick some may\nKnow Dick Cheney and use and my mom is the head\nIt was all on me and they was all along the he's the one\nAnd three one oh uh do you\nDo not blame you yeah I'm paid ... an hour show to listen on the first day of written critical\nYeah yeah how about you and\nUp is key the chance that came\nMy lack of good work in may and I've seen I've ... my right to choose and you\nDon't get into play God man I don't know\nIf you don't like a man by then you get\nReally where in ... that show\nMuch much really John\nDu da di di\n\nDi di di di di di ... ha ha\nWell he he he he\nO ... O O one\nThing the the the the a ha yes the the\nOne that he in\nFact there's one man a man needs to be true they didn't they didn't see the ... and then one thing is my name\nTo say that oh well ... they control them over the ... um daddy\nThings up prices on those vets\nEach one of them each month a wreck good name and each that\n... and that there you can\nMe no you can't tell me you\nKnow is not let that stand\nGet my life so that the street can grow\nAnd\nCreate a nation like I Know you\nCan tell me no you can't tell me the bank you can tell me you know you can't tell me\nThat in young so\nMuch much not\nReally\nThe key\n\nDid he do the ... the\n... oh oh oh well they\nDidn't think that in a row one day to the the the uh\nFor me this one to hang\nOut there and\nHe is very chance OK\nNot\nThat good work in may\nFeel I've ... my right to choose things you\nDon't get to play God man I hate them\nYou don't play by by it go\nYou don't get to play God may die and\nAnita Franco and Sancho play God from her last album binary\nThis year we spoke with Bonnie mostly about her forthcoming memoir that she is currently working on we're doing something a little different this week we are doing a words and music show on the program\nEarly in the year we talked with Dan ... dancing ... has spent decades with Allison crouch in Union Station but now has a new album under the name to ski which allows them to do some different so I get\nTo stretch out more with this than a lot of what I get to do I mean you know I've I've seen with Allison and Union Station oh it's twenty five years now and I really do cover a lot of the the harder higher stuff but it's it's a few clicks down from what we're getting to do here I mean it's a\nIt's funny because typically you know for the most part in my everyday life I'm a pretty quiet guy but I Love being around Lawrence um\nDraw the line from razor blade\nFrom looks exactly should be [noise]\n[noise] no wage only in my bed\nStrong ... every breath because your fate ribs and one more kids could be there but here we\nGo again [noise]\nMind so everything a\nGave me snow\nKid rock bottom and start to fall a little ... you know Perfect Paul is um\n[noise] I'm from a poisoned\n\nAir reign of ... the\nYou keep running through my ...\n... you know\nYou never had a drug ... and\n... every breath who's your favorite scene one Markey is good be mom did but we go again\n[noise]\n... and every thing a home and have\nIn the stone\n\n\nMom vague poise [noise]\nMm\nI Try to eat and then the rest of\nFavorite scene one more\nYeah [noise] Mm\n[noise] yeah\n\n... so\nSome key me stone\nIn star despite looking in\nMom ...\nAll my family\n\nIt's a words music show this weekend acoustic cafe looking back into our archives then going back five years when we talked with Aaron apple we've ever thought that we could saying we've all had this moment in the school bathroom oh a little what do I ... I went to a lot of these places it was it was a Nineteen thirties school and it had big high ceilings\nAnd I had no idea was this just a you alone that you discovered this ... was it like impromptu draw\nA did in junior high end in a school you know at the bar is bad but you know it I mean you know the lead for mangoes if it was the way it goes I had another place to Italy and this big old church called the door I mean it made you feel that used\nTo be told you know I mean you have like a different method guard or they work that\nThey lasted lots but let's say a bit Maria should have been recorded that you know get\nBack out on Monday we had ...\nNot to go well but the big ... um\n[noise] would you ... ...\n... ... ... that were\nLike ...\nWho wants his ball but\nThat that ... ... ... ... and ... ... ... ... well\nThat space that we were in when we actually physically started getting down to write songs was was one that was very relaxed in very clear I think we were just rushing to make a new record we put out alive record in the DVD\nAnd sort of was using that as a a book and like I have a chapter ender for for that first decade of our career and so I tried this is truly I think the rest are friends that I didn't\nKnow what\nTo\nDo that I Would do is doing and I guess never done at the neck down at the NIH\nHanging on you may know\nDo do do do you know did you make nice nah [noise]\nSometimes feel that they want to remind me then that to me\nThat he really does me\nNeeds then I met\nYard dash me when I'm wanting the\n... ... ... ... and\nThe na na na na huh\n\nHow do you read in the shadow saw the damage to try\nAnd\nLearn and all that you know\n\n[noise]\nKnow the yeah that guy Dan diving head\nSometimes the blood I ...\nThink you'll be ... to me\n\nBut that doesn't mean\nKnow Donny Don neither did I was never\nAny cereal match me when I'm Lonnie\nSometimes I feel like that then they the come visit me had mostly young kids and then sometimes feel that gumbo the big guys getting hot you know\nI'm not ... not the only time it out loud and they'd been been changed the ban and down the ... the baby gets so hot zone you know I'm ...\nThe real back\nThen I have\nLot of the body doesn't mean man I Know I'm\nReal but that doesn't mean we bought in\nI'm doing fine in mind that\nDig into Syria started the pop chapter of your career which is no two albums strong you're listening to words and music program this week on a cruise to cafe you must have brand new music just out this fall want to go back to the very first release and the first time we talked with him in two thousand\nFive my stepfather headed a John Prine double CD you had a bunch of his CDs actually and that was the first time I ever really hurt him I heard him growing up too but I wasn't really feeling it until I got a little older\nThen I started to really understand what the songs are about ... ...\n... ... ... ...\nCame on July ...\nI ain't gonna\nIn bad down at the bottom of the barrel yep no back no\nWon bang bang\nPainting and\nGet back down and bottom out you know back no\nAlways me\n[noise] no money to me when ya and\nIt would rain in the movie now down in the rain and snow and\nBad down then bottom barrel but I'll\nGet back down to bottom audit Barrow\nYou know back on\nScale [noise]\nIt's our words music show this week on acoustic cafe and that one goes back to two thousand and five this young singer songwriter working out of Philadelphia was making his national debut his name was Amos Lee\nHe is now about eight albums in just had a brand new one release in late summer but that's when he was doing his best John Prine type of song writing and performing the song bottom of the barrel live in our studios at acoustic cafe\nAnd a reminder that a lot of the stuff that you're hearing on this week's programs just a teaser you can hear a lot of the recent gas in our archives section at a cafe dot com or official website a C. A. F. E. dot com and there you will find lots of in Studio performances and archived interviews\nFrom guests over the last four or five years and some of the older material will be getting that up there uh eventually into our Web ARChive\nWe have another hour of our words and music show on the way you will hear stuff from Norah Jones and Robert glass for also country song writer\nLaurie McKenna can't move before all the awards concern fall out on a bus Frank Turner the legendary rod Stewart and so much more here on a cruise to cafe in other words and music show [noise]\nTo cafes may possibly part by newest records and the clip sessions from John [noise]\nCreator of classics bring the family and loved hurting John and hire new at the UCLA obsessions screaming\nAnd available everywhere now more information at John highest dot com\nYou are listening to acoustic cafe on top of the are you are FM an HD one Rochester different radio acoustic cafe continues after the latest news from NPR\nLive from NPR News in Washington on trial Snyder President Trump says he will accept the landmark arms control agreement because Russia is violating the deal and it's preventing us from developing new weapons\nRussia has not had here didn't agree meant so we go to germinate different than we are going to develop their weapons if they get smart and if others get smart and they say let's not developed these horrible nuclear weapons I Would be extremely happy with that\nTrump spoke to reporters after a campaign rally in El Paso Nevada's as national security advisor prepares to meet with Russian leaders in Moscow this week\nThe agreement reached in Nineteen eighty seven requires the elimination of short and intermediate range nuclear missiles a top Russian diplomat being quoted today saying the U.S withdraw with the dangerous move\nHundreds of Central American migrants have taken to wrap some votes across the river on the border between Guatemala Mexico in ... to continue their journey to the United states the BBC's ...\nBull reports from the border having left Honduras more than a week ago tried to cross Guatemala an overwhelmed local security forces that up to four thousand people were\nStuck on a bridge with the Mexican border gate firmly shut some remain on the bridge having made makeshift places to sleep and being supported by aid agencies but hundreds decided they could no longer wait taking rafts in boats to cross the river into Mexico illegally\nPresident Trump promised America's southern border will be close to the migrants but the problem is it about the economic future for themselves and that families is proving a strong driving forces\nLatest migrant caravan has reignited border security is an issue ahead of the mid term elections speaking of that campaign rally in Nevada this weekend President Trump claim Democrats are backing what he called an extremist immigration agenda and you also warned that he would use the military to seal the border\nHundreds of thousands of people marched in London this week in asking for A People's votes on Brexit the nickname for Britain leaving the European Union but Larry Miller reports of demonstrators demands seem unlikely to be met [noise]\n[noise]\nGoing\nContinue to\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\nThe\nThe [noise]\n\n[noise]\n\n\nMm\n\n\n\n\nRubber glass were experiments as they were as a trio at twenty fourteen live in our studios at ... cafe it was an interesting session by the way a because we did a session with Robert ... experiment and then let us see also dropped dead and sang a couple of numbers if you would like to hear that whole thing we broke it up into two parts the rubber glass part am illiteracy part\nYou'll find the both in our archives at a cafe dot com our archive sort of what's on feature here on this week's program\nAs we're going back into our archives for a words and music show\nWe're going to do a father and daughter combo in a way where to start with the late great Chris Whitley passed away back in two thousand and five we had done many visits with Chris\nI the last being in two thousand and three for his last album during his lifetime an album called hotel vast horizon that he did with a group of German musicians that he met while living in dress that this is what I imagine dressed in his like in December is that true that's\nTrue I have this image to even now I Know I've spent time there and it's a lot more gloomy unlike Belgium or England um yeah it's not great there it's like New York whether it's ... cold in the winter and and warm in the summer it's up a lot of Western Europe is like great Glen me but it still has a\nBecause of that age and stuff has a melancholy not all like dark negative it's kind of beautiful I mean I Wonder if this thing in a in a weird way to be kind of a romantic sounding even stripped down our kind of in the early\n... edgy way I'm just definitely about you know my life and then um\nBut that was also some inspiration of being in that place and its history which is pretty crazy and yeah [laughter] oh man you choose the when the bees memorize\n[noise] well\nLeukemia and not just [noise] divorce\nIs too [noise] she knew gypsy is gone\nBounces news is\nThat the whole\nTown [noise]\nAll day long for a change to\nNotice [noise] we much chatter\nIs odd to me it's just a way it was a kid [noise]\n\nJust should\nBe good for us this past fall there has been [noise]\nUm [noise] yeah\nAt the whole\nTour of a a machine\n\nI'm sure you\nLose [noise] true motives that is in\nBad big ... man\nBeen asked to see a [noise]\nA tease\nThe witness day has gone on and [noise]\n... you\nKnow the whole\nA right to put in a\nBad day whole\nRight as a [noise] [noise]\nAs the ...\nFirst you know then\nYou\nKnow ... ...\n... ... oh mhm\nMhm well you\nKnow the answer to that she made then\n\nAdd ... ...\n... na\nNa na na na\nNa na\nNa\n... ... ... ... ... ...\n... Mm\nMhm\n... that's what I mean man and just last week I see and\nNo like drugs and they they pass\nBy you know was in ... I'm saying you can't handle that\nAnd a [noise]\nMess crushing Jamie\n... that ... ... you know mhm\nMhm Mm\nMhm\nMm Mm no\n\nI was in ... the ... ...\n...\n... ...\nYeah oh yeah\nOh\nYeah\nOf our favorites on the show that his junior going along with bassist leave school are doing a cover live in our studios as part of our words and music program the song written by Joni Mitchell and a song that she did in Nineteen eighty two was ladies' man do the villains album in twenty Eighteen rediscovered was nothing but covers\nSpeaking of coverage there is a woman from the northeast who joined us in Studio just this fall her name is Laurie mechanic\nShe doesn't do covers but she gets covered an awful lot by artist in Nashville humbling kind the huge hit for Tim McGraw\nThat was written by Lorrie mechanic girl crush a big hit for little big town that was written by Lorrie McKenna and those are just two of dozens of songs that Laurie McKenna his pen so she is from the northeast but she spent a lot of time writing in Nashville and has learned how to be a great co writer as well\nI had written by myself for so long when I did start you know when I was introduced to Nashville and I did start trying to work on the co writing process people warned me like it's probably going to mess you up I grew up in the Boston you know singer songwriter local music community\nAnd in that community there's people like these guys that I have sitting here with me that I can sort of jump in and be be part of their friends\n... at any given moment I'm not good at any of that stuff but I learned to co writing but that that's really where I can find my deepest connection is sort of like I Can't help you play your song probably but I can maybe help you ride it here's was no\n... in ...\n...\nThe way that is ...\nNot a very\nDumb then she didn't do mhm\nYoani Sanchez I'm In the ...\n\n... ... well don't you\nKnow when you\nBuy the yeah\nMm\nShe works in\nAgain after a ring lie\nSam and Sam's desert and this guy to them\nAnd man made for how he sees you\nKnow ...\nOr they could\nHave had yeah\nMy mom\nI feel and\n\nAh the they had\nAgain\n... Mm\n\nI'm a\nMother never rats Marie McKenna with Jamie Edwards playing keys and mark really sing harmonies and guitar live in our studios decrease the cafe everything you're hearing on the program this week is live in our studios at accused the cafe in other words and music show\nGoing way back to Nineteen Ninety five and kept most first appearance on our program\nOh worry about leaving labels on something that other people think about you know what I feel about ... years um and I just say that look better that way for people to buy a big deal about it you know what I Try not to pick on\nThe label that other people what are you going to try to criticize dog that's bad that's true I I kinda like labels\nI like to know about like what are like a lot of legal or your movement ... okay okay do you All right with that [laughter]\nI remember when we look may ... try to just to get\n... ... ... ...\nI was just in the middle ... ...\n... loan to issue you ... ... a\nLittle little bunny ... really no joke among the ... one of the blue moms or they never were that ...\n...\n... ... ... ... ...\n... ...\n... ... ...\nMm\nLet me just the way you were in power ahead to ... to ...\nDo you ... ... ... ... do you want a man to walk over to you and that was that can go dancing or\nThe other little children but I had committed ... do you love you and ... moved a\n... you know no ... no ... ... ... ... and there's no no\nNo ... ...\nYou're the one in all day long\nMm [noise] [noise] [noise] Mm\nMm Mm Mm Mm Mm Mm Mm Mm Mm\nThen they gun ball\nAnd\nThese men and women\n\n\n\nAnd\nKids\n\n[noise]\nHe needs he\nTo be the enemy\nInteresting\nTo\nOne do we need\nTo do in\nYour Albert lea a guitar and vocals its own country born when many no for Ricky Skaggs version Albert lea modest Bella who largely reinvented and raise the bar country rock\nIn the Nineteen seventies on still rock and with the way it is Seventy four [noise]\n\nAmerican roots is produced in New Orleans at the school of liberal arts of Tulane University are resenting station is W. W. F. him at the University of New Orleans special thanks to a gym cow\nAnd and the national folk festival Salzburg Maryland for hooking up with Albert only American roots is supported by major grants from the national down for the managing and the national damage to the ... of America's roots music magazine at our offbeat dot com [noise]\nAmerican roots rocking production team includes Olivia ... medley shepherd cared Lauren Callahan can mill regular blow Lydia Willie in April going [noise]\nYou could find out more about American boots on Facebook\nInstagram and Twitter\nAmerican roots dot O. R. G. that's we're all twenty\nYears of our programs in interviews dream you can also support those archives\nThe contribution on the site\nYou do it feels good I'm next bits until that time for American root\nFor the Iraq bubbling radio exchange\nMm\nWow ...\nTwo and a half weeks before election day survey after survey shows healthcare is the issue voters care about most and Missouri Senate race has boiled down to a debate over covering preexisting conditions I Would never dreamed of the answer there is taking away some of the most\nPopular things that the Affordable CARE Act did as saying let's start over all the next MORNING EDITION from NPR News [noise]\n\nTomorrow morning at five on different radio across\nThe country colleges are beginning to offer students nor can in case they need to reverse an opioid overdose\nWe felt that he was on the university to provide these because it's a life saving drugs and we're in the midst of an epidemic affects everybody\nOthers question if it could encourage drug use that story plus\nThe fallout from Jamal ... this afternoon on all things considered from NPR News tomorrow afternoon at foreign double your your ... Rochester\nLine for NPR News in Washington ... ... a caravan of thousands of Central American migrants is back on the move toward the U.S despite Mexico's efforts to stop them at the border with Guatemala they resume their march at first flight this morning reporter James Frederick is Al Pacino\nI'm hearing the central square and thousands of people from the migrant caravan arrived here today but it was not easy to do here they walked twenty three miles from the Mexican border to get to the city of Chula\nTemperatures got above Ninety degrees today it's very humid here there are a lot of women children lots of vulnerable people here there is Red Cross treating some people here and others are just trying to get some rest some water and food before they continue north as soon as possible\nJames Frederick reporting from ... Mexico\nSaudi Arabia's explanation for the death of journalists ... has drawn condemnation from congressional leaders who are proposing sanctions on Saudi Arabia adage crown prince Mohammed bin Salman\nThe expulsion of the Saudi ambassador and the cutting of arms sales for longtime us ally NPR Shannon ... can't has more\nSaudi Arabia says Eighteenth suspects are in custody after ... she died in an accidental fistfight and that the crown prince was unaware of the operation Republican and democratic lawmakers in Washington are not buying it democratic Senator Dick Durbin of Illinois spoke on meet the press\nFive of his top personal bodyguards or those among those currently accused in the Eighteen his personal bodyguards and one of them is said publicly a year ago I don't move with I don't think order from the executive\nThe crown prince says his fingerprints all over this and the fact that he is heading up the investigation makes it totally incredible\nSaudi Arabia's foreign minister says an investigation continues into ... D staff sentiment tent NPR News\nI'm sure you know that much as you might see me more than\nTen or ... ... ...\n... ...\nThis good so I was given me a little man Tom Green\n... was not too much to look at but at the ... ...\nWell this country you know five\n... between me and\nThe men are it's a much better than\n\n... that means that the other thing though you know ... ...\n... ... about a man\nWould it take to ... ...\nI'll show you know as much as you might see ... you\nKnow there's the ... ...\n...\nThat's just about ... ... oh no care to a\nVIP despair boots maybe isn't that funny ... will\nNot leather jacket leather bag net and hang on well\nNot much they could see you in ...\nThen the\nOther thing you know\nI tell you about a man\nWould it take too long I\nMean they're not as much as you might see or to be more than ten\nDollars with the ... ... ...\n... ... ... ... ... ... ...\n\n... something called step inside this house a guy Clark song has done by Lyle Lovett live in our studios\nAcoustic cafe we're presenting words and music program this week it since that's the guy Clark song and we're a little guy Clark story from my love it we thought we'd go even deeper into our guys to Nineteen Ninety five for an original story from the late great guy Clark\nMy wife Susanna was had an appointment to write with key sites in Memphis we live in Nashville she had an airplane ticket but\nIt's going to call a cab to the airport when she started thinking man I hate to skip these guys are sloppy you learn never own time the cabs smell bad and she said we're not treat myself I think I'll get a limo socio limos\nOn whether the airport and she's sitting back there and it's got a phone in a bar in a TV set you know and it's just lap of luxury and she was knocked on the glasses so I mean take me to Memphis\n[laughter] every June you crazy [laughter]\nYeah the listeners who aren't aware how ... what kind of distance are we talking about\nTwo hundred miles from Roche [laughter] usually that okay so that\nGoes down the road and the about halfway there she was starting to feel a little bit weird about the expense and the\nThe guy was looking in the rearview mirror and he said you're Susanna court she said yeah you're ... yeah yeah I read in the middle not set up meeting about two hundred ... recorders [laughter] she was\nNo problem driver [laughter] [noise] no actually it wasn't that much more expensive than a plane to where it was a great story\nWas she does not warm and dry she did not want to fly she did not a long way from ...\nI'm a ... didn't know what I did not want to hurt you know she did not want to know whether the ... were ... a\nOur men and the minds of dying in the bank in the\nMen who did it last year while they're\nLearning as you were just not looking better but she was looking good and ... percent you know what you want to know\nHow to get it you know ... things are good um Mm lame at the them\nOut and then the ... the the new man at the\nAnd old man ... ... she did it say about it then that's\nTheir ... and ... and ... ... ... ... and then and then\nWe can\nShow to do that you would drain Jan dry man when when I Do\n\nKnow that was you know I mean I let you know known as\nRanges come and that is you know don't let us know about is the [noise] she knows was bad yeah and you know one of the ... manager\nAll the men who [noise] see my the Diane do they know about\nOut of men usually there goes your while they're in a band manager than men\n[noise] ... ... ... ... ... a\nI own a man that he did\nSay wow ... ...\n... ... ... ... ... ... ... ...\n... and ... and you know Mm Mm Mm Mm Mm Mm Mm\n\nMm Mm [noise] ... ... you know the Philadelphia producers singer and songwriter son little as we continue our words and music show in ... you\nCan really come to understand the elasticity of kind of like really ... I was offered two months and months one atom write anything not because I was trying I mean I Would write anything at all and and I I was kind of felt like\nI might never write anything ever again you know I mean I had some moments like that and then in months to Ira eleven so you know and then here I Am to two and a half weeks and and I wrote write songs in one day Kevin up right there was NO PLAN ever do anything\nTo me I'm Matt [noise] on the young men and the young man\nFrom the Internet boom boom deal man\n\nStill that that the ... well now you're petrified oh\nDang dang\nAin't no way to make you say you well know urine and make the brand new sun\nUm things like\nYou go around the globe another terror way\nYes\nAnd no matter what you came in all of the pain in the days of rain\nThis oh I'm not\nOn the young man [noise] but I'm the I'm mad [noise]\n... well Neil ...\nDoo doo\nDoo doo doo doo doo doo doo\nDoo\nDoo I'm tired of it go when the paranoia snake in terms of my mind\n[noise] [noise]\n... how much the same time that they\nFeel like everywhere\nElse well into the not the way\nI done did he show in a book that I was out in the brain and learning how to kick them out of the main news and my mom she has\nIt was all on me and it was all alone me you know and three right and one no ah well you know\nPolling not blame\nYeah they must isn't an option to live on the players they were really\nYou have that you know and I'm not brought\nUp is key the chance that chain and\nMust say that I\nWork in may or may not be a non right to choose and you don't get to play\nGod man I had done and\nYou don't get to play ... may I Wonder you\nWere in ... that show\nAnd he said you know\nMuch much not any really major key\nWhy\nDoesn't he he did he do that oh\nWell I'm dating guinea he ... he he\n... ... one\nThing he ... he he ... ha ha ha yeah the the one that he\nIn\nFact there's one man a man needs to be true faith in the same thing he he\n... the ... and then one thing men's Monday Night\nTo day I don't you well know knees and controlling the old ... and ... I'm ... and\nHe saved up right on top bulls and rats\nEach one up yeah each month the wreck good name and each and that\nLed cry and that and\nYou can\nMe no you can't tell me that\nIs not a lot that the man I ... I don't think these street can go\n... like I Know and you can tell me no you\nYou can't have them they know you and me\nIn young\n\nMy smile much\nReally\nBother me I\n\nTo be the ... the well oh oh oh well they didn't think he and a well one thing to do the ...\nOh oh oh they then one day\nAnd the whole\nKey in ... chance that\nNot ...\nWork in may and I feel I Move my right to bring you don't get to play God made by your own\nYou don't play that many by so\nYou don't get to play guy name by\nJohnny Depp Franco and Sancho play God from her last album binary\nThis year we spoke with Bonnie mostly about her forthcoming memoir that she is currently working on we're doing something a little different this week we are doing a words and music shark program\nEarly in the year we talked with Dan ... dancing ... has spent decades with Allison crouch in Union Station but now has a new album under the name to ski\nWhich allows them to do some different so I get to stretch\nOut more with this than a lot of what I get to do I mean you know I've I've seen with Allison and Union Station oh it's twenty five years now and I really do cover a lot of the the harder higher stuff but it's it's a few clicks down from what we're getting to do here I mean it's a\n... and it's funny because typically you know for the most part in my everyday life I'm a pretty quiet guy but I Love being around more than ... do\nLike a razor blade\nAnd from books he was not good deed day\n[noise] no wage only in my bed\nStrong ... every breath because your mom the ribs and one more Jews could be by do but here we go\nAgain [noise] any\nMind so everything a\nKnow the nice not\nRock bottom and start to bomb the lagoon perfect\nPaul is [noise] ... ...\n... the\nNew jeep running through my vein a\nBlob fried degree and it's no\nHuge not then had a drug lying you know\nWe read bread because your mom they receive and one more Jews could be by their vision but\nAny\nBombs on everything a\nIn the snow\nAgain Murphy toys\n\nTry it in the red\nThe red sea monkeys\n\n\n\nMom so\nSome nice stone\nIn start by looking in\nHer very far as\nLong\nUm\nIt's a words and music show this weekend acoustic cafe looking back into our archives then going back five years when we talked with Aaron apple\nWe've ever thought that we could sing we've all had this moment in the school bathroom\nOh no I ... I went to one of these places it was it was a Nineteen\nThirties school and it had big high ceilings and I had no idea was\nThis just a you alone that you discovered this ... was it like impromptu\nYou uh did in junior high and high school you know the bar is bad but you know it ... it was way cool I had another place for the Italy and this big old church called ... ... I mean it made you feel like you\nKnow ... to ... you know I mean you could have like a different method guard or they weren't that\nThey are being Maria should have been recalled and then you know impact cat on a minute\nYou cannot believe that you\nKnow not to go well but this cat and my father\nWould you ...\nHow the\nAnd sort of was using that as a book and like a chapter ender for for that first decade of our career and so I Try this is truly I think the rest are standing\nIn the\nDay that they\nDo\nThey do in that gap never done it down at the end is nigh hanging on you know ...\nTo ... you know do to make nice nice\nSometimes feel that they ... this is Don and then na na\nDa da da da da\nDa da da da da\nDa da da\nDa da na na na na huh do you do\nDo do that in the shadow ... each time\nAnd\nThere are no no no no\nThen\n\nMet a young black I don't know if I had\nSome other people's blood I ... I\nThink in the bill and I'm\nA\nAround but that doesn't mean\nNo Donny Don my bed I managed\nTo stay around that\nTime when I'm Bonnie\nYou know and then they tell me had mostly young kids and then some of the some of the banking dining how'd you\nKnow when they found the only nine men the men and the dog in the van and down the law and then they just don't know I'm not [noise]\n\nNa na na na na na na\nNa na na na Bonnie [noise]\nMine is mine\n... started the pop chapter of their career which is now two albums strong you're listening to words and music program this week on acoustic cafe Amos Lee has brand new music just out this fall want to go back to the very first release and the first time we talked with him in two thousand\nFive my stepfather had a a John Prime double CD you had a bunch of his city's actually and that was the first time I ever really hurt him I heard him growing up too but I wasn't really feeling it until I got a little older then I started to really understand what the songs are about ... ... bone\nTo the man who came\nCame on trial\nI ain't gonna die\nGet back down to the bottom of the barrel roll back oh\nOne bank ...\nPainting gone out and\nGet back down to the bottom of the barrel you know back no\nAll the way we\nNo one you may know when you're ... and\nGood ... good been raining down day no rain\nSnow then I can try\nGet back down the bottom of the barrel on ...\nYou're right down the bottom audit Barrow\nYou know back on\nElse\nThese are words music show this week on a cruise to cafe and that one goes back to two thousand and five this young singer songwriter working out of Philadelphia was making his national they view his name was Amos Lee\nHe is now about eight albums in just had a brand new one release in late summer but that's when he was doing his best John Prine type of song writing and performing a song bottom of the barrel live in our studios at acoustic cafe\nAnd a reminder that a lot of the stuff that you're hearing on this week's programs just a teaser you can hear a lot of the recent gas in our archives section at a cafe dot com or official website a C. A. F. E. dot com and there you will find lots of in Studio ... performances and archived interviews\nFrom guests over the last four or five years\nAnd some of the older material will be getting that up there uh eventually into our Web ARChive\nWe have another hour of our words and music show um the way you will hear stuff from Norah Jones in Robert ... also a country song writer Laurie\nMcKenna kept ... before all the awards during the fall out on a bus Frank Turner the legendary rod Stewart and so much more here on a cruise to cafe in other words and music channel [noise]\nTo cafes may possibly the card by newest records and the eclipse actions from John ... classics bring the family and loved hurting John hire new at the UCLA obsession screaming\nAt every little everywhere now more information cat John Hyatt dot com\nYou are listening to acoustic cafe I doubled you are you are FM an HD one Rochester different radio acoustic cafe continues after the latest news from NPR\nLight from NPR News in Washington I'm Louise skills on\nA caravan of about five thousand Central American migrants is making its way through southern Mexico their destination today it's ... to go from there they will continue north to the U.S border reporter Emily Green has been traveling with them\nCare that took off that by the end from the southern Mexican border many of the migrants had been walking over the last week from Honduras although others were already in Mexico the goal was to get twenty miles north to ... ... it was sweltering hot\nStill that thousands of migrants continued forward moms breast that their babies as they walked dads push strollers three year olds put one foot in front of the other despite at are exhausted\nLabor pool I was walking with our five year old daughter she and her family had been traveling for three days from all dressed could I mean yeah I Do not\nThat that old she says she wants to reach the United states God willing but it's not she will stay in Mexico and work for NPR News I'm Emily Green in ... Mexico\nEuropean leaders are calling the killing of Jim ... shocking at a violation of international law Teri Schultz reports the government of Britain France and Germany warned that efforts to clarify the debt so far are not\nCredible European Union foreign policy chief ... he calls the circumstances of ... death deeply troubling and a violation of the Vienna Convention on constantly relations which requires obeying the laws of the host country\n... he says he insists on the need for a thorough credible and transparent investigation and accountability for those responsible\nIn a joint statement Britain France and Germany say the explanations given by the Saudi Government would need to be backed up by facts to be credible\nThey also suggest their future relationship with Riyadh is on the line saying decisions will be made based on the explanations they receive about the killing and quote our confidence that such a shameful event cannot and will not ever be repeated for NPR News I'm Teri Schultz in Brussels\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n\n\n\nRubber gloves for experiments as they were as a trio at twenty fourteen live in our studios at ... cafe it was an interesting session by the way\nI because we did a session with Robert ... experiment and then let us see also dropped dead and sang a couple of numbers if you would like to hear that whole thing we broke it up into two parts Robert West part am illiteracy part you'll find a boat in our archives at a cafe dot com our archive sort of what John feature here on this week's program\nAs we're going back into our archives for words and music show\nWe're going to do a father and daughter combo in a way where to start with the late great Chris Whitley passed away back in two thousand and five we had done many visits with Chris\nOr the last being in two thousand and three for his last album during his lifetime an album called hotel vast horizon that he did with a group of German musicians that he met while living in dress that this is what I imagine dressed in his like in December is that true that's true\nI have this image to even know you know I've spent time there and it's a lot more gloomy unlike Belgium or England um yeah it's not great there it's like New York whether it's like sunny ally cold in the winter and and warm in the summer it's a lot of Western Europe it's like great Glen me but it still has\nBecause of their age and stuff has a melancholy not all like dark negative it's kind of beautiful I mean I wanted to stay in a in a weird way to be kind of a romantic sounding even stripped down our kind of know early\nThat'd be a cheap way I'm just definitely about you know my life\nBut that was also sing the inspiration of being in a place and its history which is pretty crazy and yeah [laughter] oh me too and the way on the eve maybe right\nNow we\nShe she batted leukemia and not just the voice of them\nIs to town and she knew a gypsy is gone [noise]\n...\nThat the whole\n\nAll the ... [noise] we must Chad\nIs a two man jeeze [noise] do you still waiting with kids [noise]\n\nJust shows\nYou what are the half full and [noise]\nUm [noise]\nAt the whole ship 'em\nTo a\n[noise]\nNo true\nLose true motives that can\nBe a big ... man\nWe asked you to see a\nFew years down the weirdness the is gone on\n... you\nHad the whole\nTo write\nA\nBad to hold\nBest to rise up\nAnd\nI just ...\n[noise]\n\n[noise] [noise]\nNa na na na\nNa\nHey hey\n... ... ... ... ... ...\nNa\nNa\nNa I Swear to you know I mean that's just that's the that's the\nWhole you know they just they met in ...\nI was in ... I'm the one who can handle\nA great shame on me\nThat ... that's ... ... ...\n... ... ...\n... ... ... oh\nNo no\n\nOh oh\nOh yeah he ... the ... ... ... ...\n... ... ...\nYeah oh oh oh oh\nOh oh\nYeah he's\nOne of our favorites on the show that it's going along with bassist leave school are doing a cover live in our studios is part of our words and music program the song written by Joni Mitchell and a song that she did in Nineteen eighty two was ladies' man do that no one's album in twenty UT rediscovered was nothing but covers\nSpeaking of coverage there is a woman from the northeast who joined us in Studio just this fall her name is Laurie McKenna\nShe doesn't do covers but she gets covered an awful lot by artists in Nashville humbling kind the huge hit for Tim McGraw that was written by Lorrie mechanic girl crush a big hit for little big town that was written by Lorrie McKenna\nAnd those are just two of dozens of songs that Laurie McKenna his pen so she is from the northeast but she spent a lot of time writing in Nashville and has learned how to be a great co writer as well\nI had written by myself for so long when I did start you know when I was introduced to Nashville and I did start trying to work on the co writing process people warned me like it's probably going to miss you up I grew up in the Boston you know singer songwriter local music community\nAnd in that community there's people like these guys that I have sitting here with me that I can sort of jump in and be be part of their friends\nSongs at any given moment I'm not good at any of that stuff but I learned to co writing but that that's really where I can find my deepest connection is sort of like I Can't help you play your song probably but I can maybe help you write it like here's was no\n... Mm\n...\nThe way that a ...\nNot a very\nDumb then she didn't do\nY'all need 'em then she ...\nShe just fell in ... well no\nNo no no no for you\nBy the M.\nThe ...\nAgain as a ringing lie\nYeah hello\n... says her name is ...\nThe man made for how he sees you\nKnow ...\nOr they could have\nHad yeah\nDo my mom\nAs you said and\nAh the day or what have\n... Mm\nMhm\nUm well\nMy mother never s Marie McKenna with dreamy Edwards Twinkies and market really sing or monies and guitar live in our studios decrease the cafe everything you're hearing on the program this week is alive in our studios at least a cafe in other words and music show\nGoing way back to Nineteen Ninety five and kept most first appearance on our program\nA worry about leaving labels on something that other people say about you know what I feel about the use 'em and I just say that look better to wait for people to define how they feel about it you know what I Try not to take on\nThe labels that other people waiting on me and I tried to criticize dog that's bad that's true I I kinda like labels\nI like to know like like what I like I don't know when they go oh your movement OK okay if you are with that [laughter] I\nRemember when may ... try to just to get ... ... ...\nI was just the middle ... ...\n... ... ... ... ...\n... a little ... really no joke among the Mona debris mom ...\n...\n... ... ...\n... ... ...\n... ...\n...\nI Love your debt the way you were and how I had to find a new loan and do you ... ... ... you'd want a man was do we walked over to you and I wasn't going to go dancing\nOr the other little guilty about a hand committed no crime on the do you love you and love you know ... and all\nThe action which means that no the actors are being allowed\nTo go for care way even though there's no doubt in your own ... in ... you're the one in the movie of all let me\n[noise] [noise] [noise] Mm Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm Mm Mm\nMm no now you know ... ... you don't want to own them when I'm\nOn the mean ... [noise] [noise] [noise] well I'm In the long run Mm Mm Mm Mm Mm Mm no no no no\nYeah yeah yeah yeah yeah when I was\nTalking about ... ... ... a little you'll do losing committed no crime a moment to love you love on new\nCars he ... he louder than ... ... ... ...", "show_name": "Acoustic Cafe", "year": "2018", "city": "Rochester", "day": "21"}