{"month": "10", "state": "GA", "station": "WNGH", "content": "I'm Fred Child victims performance today from eight PM American public media\nDoes has members supported TPP where an Eighteen station radio network you can listen online at ... dot org\nThis is member\nSupported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nWhen a life hangs in the balance what does beyond a reasonable doubt really mean\nAnything and then on showing them on my mind that\nGPA be present the radio play beyond reasonable doubt Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis\nJoined us at ten am on Sunday October twenty first started G. P. B. radio [noise]\nThis was Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\nTV to take for granted when friends go as planned until they don't [noise]\nIn South Georgia the Albany and he had to postpone it's October concert after hurricane Michael roared through\nThese offices are closed to further notice according to\nThe entire area struggling to recover\nThe ... in the entire community\n... it's my cap on June ...\nLikely or to go on and\nOn our the Atlantic symphony French ... program this week [noise]\nConcept called eternal city from the Rome symphony\nTennis ... string quite\nLive from NPR News in Washington I'm jak sphere\nResearchers have issued the first report on hurricane Michael's impact in Florida last week NPR's Greg Allen says will be used to revise building codes along the panhandle in a preliminary report a team of civil engineers funded by the national Science Foundation\nSays the high winds and storm surge tested coding construction practices in the panhandle with devastating results\nTo hospitals in Panama City took significant damage to ...\nBecause the high winds and storm surge tested code and construction practices in the panhandle with devastating results to hospitals in Panama City took significant damage to the air force base had damaged the roofs and aircraft hangers and there's currently uninhabitable\nMany metal frame commercial buildings failed in the storm losing their exterior glass and siding leaving their interior exposed\nResidential damage wasn't confined older homes built before current building codes were adopted the reports that some newer structures with elevated living spaces and concrete peers were destroyed by the record setting storm surge Greg Allen NPR News\nI'm at Turkey's claims that as evidence that missing Saudi journalist ... was killed inside the Saudi consulate in Istanbul President Trump says he is now asking turkey to provide that audio or video to the U.S if it exists similar requests to the Saudis came from democratic Senator Mark Warner vice chair of the Senate intelligence committee\n... if the Turks do have these tapes audio or video or that they release them in an appropriate way and then there needs to be consequences\nU.S officials say they're taking the disappearance seriously though Trump says he has not sent the FBI since the journalist while working in parts of the Washington Post is not a U.S citizen and the president also again called Saudi Arabia important ally\nThe Trump Administration is threatening to withdraw from another international treaty as NPR's Yuki Noguchi explains the latest involves a postal agreement Trump asserts gives Chinese companies unfair advantage when they should go to the U.S\nFor forty four years the U.S has been part of the universal postal union which sets shipping rates for international deliveries poor developing countries including China pay lower rates well rates in the U.S and Europe are higher\nNowadays because so many products are shipped into the U.S from China they ministry she argues this amounts to a subsidy this new escalation of trade tensions between Washington and Beijing could mean higher prices for American consumers\nThe administration says it will start the year long process of withdrawing from the treaty unless it is renegotiated ... NPR News Washington\nCommerce secretary Wilbur Ross is warning that the European Union is moving too slowly and trade talks with the U.S and he says patients on the part of the administration is running out\n... ... commission president John Claude Juncker greed in July to start talks intended to achieve zero tariffs and zero subsidies or not or motive industrial goods and that sort of try to avert a trade war on Wall street today that out\nIn July to start talks intended to achieve zero tariffs and zero subsidies on not automotive industrial goods in an effort to try to avert a trade war on Wall street today the Dow dropped Ninety One points the NASDAQ was down to points this is NPR\nBased on early sales numbers in Canada there appears to be strong demand for cannabis products their today's the first day of legal marijuana in Canada and the farm shop all five which is power and many of the online stores there says it was at one point recording more than a hundred of cannabis orders a minute today\nIt was department of agriculture is approved a new kind of cotton one with seeds people can eat as NPR's Dan Charles reports the seeds could become a source of proteins for animals or people cotton plants\nProduce a lot of seeds globally forty million tons of them each year they're rich in oil and protein but people and most animals can't eat them because they contain a toxin called gossip all scientists at Texas a and M. university have created a genetically modified cotton plant that doesn't make gossip all and it feeds\nPeople can eat this cotton seed meal so can chicken and fish the inventor say the seeds tastes like chicken ... the USDA now says farmers are free to grow the new cotton plants but it will be years before they're widely available and the FDA still has to give its approval before the seats can be sold for use in food Dan Charles NPR News\nIn Arizona man who purchased an abandoned storage unit of Phoenix suburbs appears to have hit the jackpot stumbling upon a treasure trove of historical documents quaint report in the Arizona Republic Don Smith found about two hundred letters longing to Henry Ellsworth Barbara Republican congressman from California from Nineteen Nineteen in Nineteen thirty three\nIncludes letter signed by president Herbert Hoover and a gamble that in Nineteen thirty three letter says was made from wood used at the U.S Capitol after it was partially destroyed when the British set it on fire and Eighteen fourteen\nI'm jak sphere NPR News\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home and ...\nAnd there has asked a need a lot from long live France\nAnd I thought the Atlanta thing funny cause they're all French program this week with music for sale and Vietnam and this overture by barely as his energy to ... on G. P. D. right now let's hear accordingly to yell out of town\nThe music of rebel and via tone and this overture by barely at his overture to bend the venue to cheer leading a G. P. D. right now let's hear a recording with ... tell me conducting the San Diego sim city\nSo\nAnd\n\n...\nTwo\n\nAnd\n\n\n\nUh\n\n[noise]\n\n\n\n\n\nBoom\n\n\nBoom\n...\n\n\n\nWho\nRemember\n\n\n\n\n\n\n\n\nWho who\n\n\n...\n\n\n\n\n[noise]\n\n\n\n... ...\n\nUh\n\n\n\n\n\n\n\n\n\nWho\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n...\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\nWho's\n\n\n\n\nOr a\n\nIn a way around\nOr a little\n\n\n\n\nA\n\nA new\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\nThe pines of Rome by auto Reno risky [noise]\nThat was the Berlin Philharmonic was Herbert von ... this weekend Saturday in Rome, Georgia you can hear the room symphony perform network about Rome Italy\nTheir own symphony orchestra has a new music director and conductor Jeffrey ... and I live here with the orchestra at their own city auditorium this Saturday at seven thirty\nI'm Sarah that's a news from NPR's next and then we'll hear baroque music for plucked instruments and then seeing how do they with his boat instrument in the violin concerto by John severely s that's all the head next our\nSupport for G. P. B. programs comes from our listeners your support allows ... to bring you end up stories from across the state our reporters take the time to look at what is happening why it is happening and how it will affect you we have bureaus in Atlanta Augusta\nMaking and savannah we take the time to look at the whole picture gp brings you stories that you won't hear anywhere else and you can listen online\nCheck us out at gp be news dot org and stand with the facts\n[noise]\nNinety seven point seven FM W. B. B. and W. GBH leave room for the Georgia Public broadcasting radio network [noise]\n\nLive from NPR News in Washington I'm sure mark President Trump says the U.S is asking turkey for audio and video relating to a missing Saudi journalist Trump confirmed it during a brief cue and I and with reporters\nWe have this war doesn't exist where are we going to be best for if it exists\nThe president on Wednesday repeated that Saudi Arabia is a major ally noting there's also an important customer for US military ...\nAs for if it exists the president on Wednesday repeated that Saudi Arabia is a major ally noting that is also important customer for US military exports\nIn an interview with the Associated Press on Tuesday Trump warned against a rush to judgment comparing condemnation of Saudi Arabia to the allegations of sexual misconduct against Supreme Court justice Brett Kavanaugh\nResidents in parts of Florida's panhandle are still waiting for power and cell phone service to return after hurricane Michael tour through the state's northern coast a week ago NPR's Hansi Lo Wang reports some rural communities are just starting to receive relief services\nFEMA has been sending teams of search and rescue specialist like Adam sheets of Virginia task force one in Jackson County sheets multiple trailers damage from the storm on the same property where a brick house still stands\nFor small family thrown at home or a third of all of them are okay in order to get assistance from medically they have some medical issues\nHundreds of families are still sheltering in school buildings around the region on along NPR News Jackson County Florida\nMy ... drownings in the Mediterranean Sea have reached an all time high this year and as Joanna Kakissis reports from Athens the United nations warns against a rising tide of hostility\nThe un says the anti migrant rhetoric that's rising in Europe is toxic and divisive in a statement the un high commissioner for refugees Philippa Grande said the anti immigrant rhetoric is out of touch with reality falsely painting Europe as a place under siege by foreigners\nGrande called this scapegoating these are human lives he said\nMore than Seventeen hundred migrants have drowned so far this year mostly in the central Mediterranean they're trying to reach Italy or an anti refugee government has tried to ban all private humanitarian vessels rescuing migrants whose flimsy boats sink in this long in perilous stretches seat\nFor NPR News I'm Joanna Kakissis in Athens\nEuropean Union leaders are giving themselves several more weeks potentially until the end of the year to clinch a friendly divorce with Britain before their separation brags that summit on Wednesday avoided any friction but also produced no tangible results\nOn Wall street stocks ended slightly lower on Wednesday trading remain choppy the Dow Jones industrial average gave up Ninety One points after being down as much as three hundred Nineteen earlier and that was that composite slip two points yes and the five hundred index\nIndustrial average gave up Ninety One points after being down as much as three hundred Nineteen earlier than as that composite slip two points yes and the five hundred index fell less than one point this is NPR News\nABC's the\nConnors a spin off of its recent revival of the sitcom Roseanne drew ten point five million viewers and its debut Tuesday NPR TV critic Eric Deggans says the ratings were still strong even without the original shows starring\nViewers are the Connors learned pretty quickly how star Roseanne Barr had been written off her own show a character Roseanne Connor died off camera after an opioid overdose the controversy didn't bring blockbuster viewership on Tuesday but the counters ratings ranked as the most watch new show the fall TV season so far\nWith audience members close to the ten point three million people who watched the last episode of Roseanne in may\nABC developed Connors as a version of its Rosanna revival without Roseanne Barr after this star center racist wheat in may the ... to the network to cancel the sitcom bar issued a statement criticizing the decision to kill off our character as quote grim and morbid Eric Deggans NPR News\nCanada became the world's largest legal marijuana marketplace on Wednesday and some retail jobs had to turn away customers after selling all they had Canada's national approach allows unfettered banking for the pot industry\nEnter Providence shipments of cannabis and billions of dollars in investments a sharp contrast with prohibitions in the United states where nine states have legalized recreational sales of pot and more than thirty have approved medical marijuana\nCanadians can also order of marijuana products through websites run by provinces are private retailers and have it delivered\nTo their home by mail I'm Huck NPR News in Washington\nSupport for NPR comes from NPR stations other contributors to include the public welfare foundation committed to advancing justice and opportunity for people in need more information at public welfare dot org and that John ... and Catherine the MacArthur Foundation at ... dot org\nThe evening I said that's not here to pluck instruments together here a bearded ... moved and Daniel ... mandolin with ... number twenty indie minor heaviest man on the\nIt's not a number twenty in the minor by Sylvia Old Spice\n\nDa\n\n\n\n[noise]\n\nMm\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\nPlaying ... to ... get Schwab and playing mandolin Daniel alert that was the ... D minor by Sylvia Leopold vice\nAnd you're listening tonight cap on gp I'm Sarah das la\nLa tied to finish music now ... is not only an incredible violinist he also writes good notes and this is what he says about civilians violin concerto which we'll hear him play\nHe writes when ... violin concerto in Nineteen oh for he was perhaps to live out vicariously an unfulfilled dream of his use the dream of being a violin soloist perhaps it is some sort of subconscious revenge that he wrote violin pieces that are so awkward and difficult to play\nIn any case how do they writes civilians succeeded in writing one of the greatest country doesn't the violin repertory he achieved a richness and color texture and character that was quite unprecedented\nYou did in writing one of the greatest country in the violin repertory he achieved a richness and color texture and character that was quite unprecedented\nOut of the ads that the writing is also inspired by the rich finished folklore tradition quote you can feel the cold mountain surfaces see the ethic landscapes here the raging battle he says the opening violin line is the passionate romantic human protectionist\nFloating and soaring above the foggy orchestral texture the first movement is full of jagged cliff misty woods and superhuman struggles\nHe says the slow movement is much more intimate we have moved indoors and are protected from nature of violent wins and then the last movement is full of ... pyrotechnics but it also has a dark primal thread in it\nSo says I was seeing how do they and here's how Augustine hardly plays it with the royal Liverpool philharmonic conductor hunting into an G. P. B. the violin concerto indie minor by sit down here [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nMan\n\n\n\n[noise] [noise]\nWho knows maybe they don't have\nNine year old and\nI think [noise]\nI think\n\nIn any kind of\nYour\n[noise]\n\n[noise]\n...\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\nNa\nNa\nNa\n\n\n...\n", "year": "2018", "show_name": "Nightcap", "city": "Chatsworth", "day": "18"}