{"month": "10", "state": "GA", "station": "WNGH", "content": "I'm Fred Child this is performance today from a PM American public media\nJust as members supported G. P. P. we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and\n... where an Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nMORNING EDITION and on second thoughts totally fickle rewind all things considered split their support makes everything you\nHear a beep off if we didn't hear from your during our fault fungi your contribution now still make a difference [noise] please take just a couple of minutes to support the programs you rely on them enjoy on ... and do your part now at whatever level is right for you good at\n... dot org and click donate and thanks so much for your support of Georgia Public broadcasting [noise]\n[noise]\nNinety seven point seven FM W. A. G. P. B. S. W. GBH leave room for the Georgia Public broadcasting radio network [noise]\n\nOh\nI'm Sorry I was asked last night cap on gp laid\nIt occurred to me that I could've need to show that night cap classics\nAnd let me pretend just for a moment here [noise] I'm Sarah has asked a\nWelcome to classics and chill listener supported G. P. B. nice cats by any other name sounds as me hey do night this hypnotic piece I are repaired Estonia mirror mirror with violinist and ...\n\nAlso between now and midnight from the great second piano concerto and right after the news that they can for them funny by Englishman Charles Stanford\nThanks for being here for classics and show I mean for an eye on the TV\nLive from NPR News in Washington I'm jak sphere President Trump is announcing a big departure from his foreign policy change today bathroom to the U.N Nikki Haley is leaving at the end of the year more from NPR's Michel Taliban\nAppearing with Trump in the oval office in Pasadena Nikki Haley was making clear she has no plans to challenge him in twenty twenty she says she's proud of her record in promoting Trump's America First agenda at the un\nAmerica First agenda at the un now\nIf we say we're going to do something we follow through and\nIn her resignation letter she town to the administration success in passing top un sanctions on North Korea and an arms embargo in South Sudan she says she also push back at what she calls the relentless biased against Israel at the un Michele ... NPR News the state department\nAre you on human rights expert says the case of a missing Saudi journalist is what the Turkish government in a difficult position\nThe UN's David Cay says that's because ... was last seen entering the Saudi consulate in Istanbul and puts turkey in the position of having to may have diplomatic relations why also conducting a high profile investigation US state department spokeswoman Heather Nauert is among those calling a Riyadh to provide answers\nUnited States is certainly concerned about his whereabouts a senior officials that the state department have spoken with Saudi officials through diplomatic channels about the matter we call and the government of Saudi Arabia to conduct a thorough tramp and transparent investigation turkey\nToday says it will search the consulate worker show he was last seen some Turkish sources of said they believed to show gay critic of Saudi policy was killed while inside the mission Saudi Arabia is called those allegations baseless\nAfter hurricane her mean destroyed the northern coast of Florida two years ago hurricane Michael appears about to wreak havoc in the same area as a category three storm W. F. tease Tesla Benton ... spoke with a local business and the town of esteem happy to see how they're preparing\nEmployees that good times motel in marina are busting down all the tables chairs and everything else that's mobile and the bar area there trucking as much as they can to higher ground to protected from flooding manager Kenny McCauley says she's been through this kind of thing before\nNot heard about it for myself but for that\nAnd the hair\nShe's hopeful that with the precautions they're taking damage won't be as bad as it was two years ago even if the storm is worse for NPR News I'm ... and ... Florida\nAppointed Supreme Court justice Brett Kavanaugh seems to be wasting little time jumping into his new job do they have to ask questions in the first arguments of the day a case dealing with increased prison sentences on Wall street the Dow closed down fifty six points you're listening to NPR\nThere's an census on Wall street the Dow closed down fifty six points you're listening to NPR\nA major us coal producer is filing for bankruptcy Westmoreland coal operates seven minds across the U.S would you employ more than Fifteen hundred people in the mountain west news bureau Nate hedge has more\nWestmoreland coal company says it isn't laying off anyone or closing any minds right now shortly after announcing the bankruptcy the company stock plummeted by more than forty percent Peter Morgan is senior attorney with the Sierra Club he says the company might try to sell its coal mines\nBut I question whether Westmoreland couldn't it be able to find anyone willing to buy these mines given that their economic model is just inherently flood\nThat model involves owning coal mines that directly supply power plants Westmoreland has struggled as the nation transitions towards cheaper and more abundant renewable and natural gas for NPR News I'm ...\nAlphabet Inc Google is unveiling three new devices as this continues to push its Android operating system as an alternative to others on the market that addition to the one who pixel smartphone in the company's first tablet computer Google homeless making available new smart speaker with a display\nPixel phones have faced a tough road garnering less than one percent of the global market during the company's first two years\nTrying to break into the market Google much like libel apple is trying to branch into the hardware market in order to have full control of its applications and the revenues they generate critical futures prices regain some lost ground oil and the discussion up nine tenths of a percent at Seventy four Ninety four a barrel in New York\nI'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors to include the public welfare foundation committed to advancing justice an opportunity for people in need\nMore information at public welfare dot org and that John ... and Catherine the MacArthur Foundation at max bound dot org [noise]\nSpecies ... back and forth in the mirror seemed to repeat after infinity nearer nearer\n\nThan I thought they'd evening glad to have you made the Florida near a mere well here's the thing\nToward Mir Mir well here's some French music and the first\nHalf of this hour belongs to Charles Stanford\nHe was an English composer writing at the beginning of the twentieth century and he was a bit of a funny daddy his taste ran to Nineteen century Germany\nAnd so as we listen to Charles Stanford spinal symphonies symphony number seven from Nike ... you'll hear echoes from the likes of mental thing and even she worked at the beginning David Lloyd Jones conduct the burden a symphony orchestra\nAnd the beautifully retro symphony number seven by Stanford\n\n\n\n[noise]\n\n[noise]\n\n[laughter]\n\nNa\n\n\n\n\n\n\nNa\nNa we're ever a\n\nWho\n\n\n\nThe other one\nNew Orleans\n... na\n\n\n\n\n\n\n\n\n\n\n\n...\nOr\nOh\nOh\nOh [noise]\n\nIs a room and they will know\n\n[noise]\n\n\n\nOh\nScientist and ... and ...\nSteaming those mesmerizing phrases and gradual evolution to that piece from Nineteen Seventy eight by Estonia and born out of a parent ... Peter ... is what he called it in Germany in English she didn't say never in the mirror\nThat winds us down to eleven o'clock news is next listener supported CPB and in the design far ranging B flat piano concerto by on his ... please stay in\nThis fall we're counting on the participation of everyone who listens to cover the rising costs of the programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life\nPlease take a moment now to make an on line contribution good a G. P. B. dot org and click donate at the top of the page your contribution at whatever level is right\nFor you cover the cost of the programs you love on cheap ... thank you so much for your support of Georgia Public broadcasting [noise]\nI'd be seven point seven FM double your G. P. B. and ... GBH room portable Georgia Public broadcasting radio network [noise]\n\nLive from NPR News in Washington on Giles Snyder hurricane Michael is strengthening in the Gulf of Mexico and NPR's Debbie Elliott reports on the path to make landfall in the Florida Panhandle tomorrow as a major hurricane\nFlorida governor Rick Scott says the biggest threat from hurricane Michael is a storm surge that's predicted to be eight to twelve feet high along the wide stretch of Florida's coast east of the storm's path\nThinking about this way the storm hits near Panama City the Tampa area was still see it a life threatening storm surge you cannot hide from storm surge so get prepared and get out it's an evacuation as ordered\nCoastal evacuations are under way from the Alabama Florida State line to Florida's Big Bend area National Guard troops have been deployed to help with the response and the coast guard has closed all of the ports and the path\nMine too Florida's Big Bend area National Guard troops have been deployed to help with the response and the coast guard has closed all of the port in the path of hurricane Michael Debbie Elliott NPR News forecasters\nAt the national Hurricane Center in Miami expect Michael to being near category for strengths when it makes landfall latest word from the hurricane center puts a storm about two hundred miles southeast southwest of Appalachia cola Florida\nIs currently packing top winds of one hundred twenty five miles per hour President Trump has declared an emergency for the entire state\nA surprise announcement from the White House today about the United nations ambassador Nikki Haley she's planning to resign NPR's Scott Horsley reports and Haley relief or posed as one of the nation's top diplomat at the end of the year\nHaley offered no explanation for the timing of her departure which caught many observers off guard the former South Carolina Governor suggested she simply worn out by the often combative diplomacy at the un joking that she wears body armor on the job President Trump praised Haley as an effective advocate for his America First agenda we've\nOf focus is so many on the front so and I think the world is Nikki said the world is really respecting the United states again much more so they haven't they haven't many many decades in\nFact international surveys but if you Research Center showed that attitudes towards the U.S and its president is sharply declined in most countries since Trump took office Scott Horsley NPR News the White House\nSecretary of state Mike Pompeo was praising ambassador Haley\nReporter mine for that now\nFive months that she and I had been working together\nAnd I want to wish her very well whatever comes back\nPresident Trump says he will name a successor and the next two or three weeks he told reporters on his way to Iowa\nThere are five people in his short list including former White House advisor Dina pow\nOn Twitter today even though Trump shot down the possibility of replacing Haley after her father suggested that he would consider her but acknowledge that he would be accused of nepotism federal law prohibits hiring relatives to head is an executive agency\nFrom Washington this is NPR News\nPresident Trump is celebrating the swearing in of Supreme Court justice Brett Kavanaugh\nHas star\nAnd\nYou know what I'm Talking about\nAnd\nYou know what I'm Talking about why we the newest member of\nPresident Trump speaking earlier tonight at his campaign rally in Council Bluffs Iowa again calling Democrats attempt to block Brett Kavanaugh a national embarrassment to did not mention the sexual assault allegations capital joined the eight other bad justices on the bench for the first time today following a bruising confirmation fight\nThe national trust for historic preservation is named John Coltrane Long Island home a national treasure\nNPR's Andrew Limbong reports the group hopes to preserve in revitalize the house\nJohn Coltrane and there was one of his greatest Supreme indie upstairs bedroom [noise]\nHis wife Alice Coltrane recorded her own jazz records and the base [noise]\nThat has is currently bacon to end in disrepair but\nLegs the director of the action fund at the national express for historic preservation says do work with the local neighborhood to raise money to restore the house\nAnd to use it to inspire the next generation of artists to follow in the footsteps of the ... fault\nGoes according to plan leg says the house will be open to the public in two years into Limbong NPR News and on trial Snyder in Washington\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and resilient cities at rocks pounded dot org and Americans for the arts\n\nAnd you can run around with ... times you\nCan ask for being here and thank you for putting up [noise]\n[noise] ... music that's well written\nA piano to pray for being with things than the normal configuration the getting their hands around around second piano concerto if any of them were written to and when you're in the audience who don't really know what can portion can attest to go\nAnd brown second piano concerto in front of a work to listen to and when you're in the audience who don't necessarily know what can or should I can attest to go through to create that beautiful music even though ... was a pianist himself he not fight particularly\nFifty years after he wrote it in long after his death the great pianist championed the peace I'm Glad it will be able to hear a new recording it tonight here on gp be\nThe first movement opens with fellow French horn and has a lot of serenity during the second movement is much stormy are gorgeous do ... between the piano when cello sets up the third movement and the finale is a good natured finale\nNorman Krieger and the London symphony with problems be flat concerto on GAPP\n\n...\n\n\n\n\n[noise]\nA\n\n\n\n\n\n\n\nOn the Internet you\n\nGo\n\n\n\n\nNa\n\n[laughter]\n\n\n\nNa\n\n\n\n\n... or\n...\n...\n\nI'm\n\n\nUm\n\n\n...\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n...\n\n\n\n[noise]\n\n\n", "show_name": "Nightcap", "year": "2018", "city": "Chatsworth", "day": "10"}