{"month": "10", "state": "GA", "station": "WNGH", "content": "I'm Fred Child this is performance today from a PM American public media\nJust as members supported gp beat we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nCPB dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nOn there that are my favorite is an interview moments when the wind techie chaired a person is definitely like I Believe [noise]\nExciting and it's welcoming so I thought he might be good for that\nYour support the exciting\nTo G. P. B. dot org and could donate\n[noise]\nNinety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\n[noise]\nThe story setting around [noise]\nThey need help and was indicating a metronome newfangled ... no matter in this movement of his aides symphony\nOriginated with Beethoven trend and ...\nWe don't know for sure that Beethoven had a metronome in mind Schindler isn't accurate about everything and Schindler himself didn't mention the idea when you've already detail program note for Beethoven's a decade or two later [noise]\nBack in Eighteen fourteen when the pieces knew the audience might have been more likely to associate the sound of the ticket talking\nDo something that keeps time anyway\nHere this and the entire piece coming up this hour on ... and I kept\nMine Sarah that's the thing with me after the news [noise]\nLive from NPR News in Washington I'm ...\nThe three Republican senators who've been wavering on the choice of Supreme Court nominee Brett Kavanaugh today works brushing varying degrees of on happiness over remarks made by President Trump last night\nAt a rally in Mississippi Trump mocking the Senate testimony given by Christine Blasey Ford the first woman to publicly accused capital of sexual misconduct for being unclear about certain details of an assault she claims happened when the two were in high school today White House press secretary Sarah Sanders had this response to questions from reporters\nPresident's very confident in his nominee at the state of time and time\nToday White House press secretary Sarah Sanders had this response to questions from reporters\nPresidents very confident in his nominee as he said it can and time again and we expect the Senate to vote and Lee has said I said\nDemocrats have blasted the president's remarks and so have Republican Senator Lisa Murkowski Susan Collins and Jeff Flake FBI report on cabinet is expected soon clearing the way for a Senate vote on his nomination this week\nWith November's midterm is getting closer a new NPR PBS NewsHour Marist Poll is showing more Republicans are becoming enthusiastic about election day NPR's Brian Naylor reports survey also shows Republicans have narrowed the gap with Democrats over which party voters want a seat control Congress\nThe poll shows a two percentage point difference between the numbers of Democrats and Republicans who are calling next month's election very important in July the number was ten points in favor of Democrats and the Democrats advantage on which party Americans want having control of Congress has fallen in half\nFrom twelve points in mid September to six points now the latest poll numbers come during a heated partisan battle over President Trump's nomination of judge Brett Kavanaugh to the Supreme Court\nMultiple women have accused him of sexual misconduct which Kavanaugh has denied the controversy appears to have fired up Republican voters Brian Naylor NPR News Washington when officers\nDead six others have been injured following a shooting in Florence South Carolina it happened as authorities tried to serve a search warrant South Carolina Public Radio's Victoria Hansen as more\nInvestigators say this aspect open fire the officers as they try to serve that war and\nThey say he was barricaded in a home with children and for\nThe kids have been taken to safety this aspect is in custody standoff lasted two hours some of the officers injured are said to be in serious condition now board and the reason the war it was ... for NPR News I'm Victoria\nHas promised electronic devices across the U.S sounded off to date around to Eighteen pm eastern time mobile devices admitting a tone and sending a message with the subject line presidential alert\nReading this is a test of the national wireless emergency alert system no action is needed famous hoping around two hundred and twenty five million electronic devices or Seventy five percent of mobile devices nationwide received the test alert [noise]\nSocks closed higher today the Dow was fifty four points to the NASDAQ rose twenty five points this is NPR\nOh Philadelphia non profit is planning to open what maybe the\nDavid hours up fifty four points the NASDAQ rose twenty five points this is NPR\nOf Philadelphia non profit is planning to open what may be the country's first supervised injection site for illegal drug use is with the help of the state's former governor as Bobby Allyn of member station WHYY reports the Trump Administration has threatened to shut down the side if it opens\nAdvocates call it an overdose prevention site where users inject illegal drugs under the watchful eye of medical staff\nSupporters say it will save lives and move more people into treatment deputy attorney general Rod Rosenstein says if the site opens the response will be swift and aggressive because it violates federal drug laws former Pennsylvania Governor Ed Rendell is a board member of safe house the nonprofit trying to open the site he isn't worried\nA message from his Rosenstein incorporate or of the safe injection site non profit and they can come and arrest me first\nResearchers say the opioid crisis claims a hundred lives nationwide every day for NPR News I'm Bobby Allyn in Philadelphia\nAstronomers say they may have found the first move outside our solar system to researchers at Columbia University was ending tantalizing evidence the moon could be considerably larger than earth about the size of Neptune arenas\nThey say they believe the planet it orbits is roughly the size of Jupiter based on the evidence the parents say they estimate the moon to some eight thousand light years away and they hope to be able to validate the discovery as early as next year with more views from the giant Hubble Space telescope plenty of planets exist beyond our solar system but a moon around any of them is yet to be confirmed\nOil closed higher today rise at one point six percent to end the session at Seventy six forty one barrel in New York I'm jak spear NPR News in Washington\nSupport for NPR comes from the Charles Stuart my foundation supporting efforts to promote adjust equitable and sustainable society and it's home town of Flint, Michigan and communities around the world more at ... dot org and that listeners who support this NPR station\n\nYou can have a play within a play or I dance within a dance you can also have onstage music within an outcry\nIf you're not ... ... and we begin on stage at the beginning of the finer opera ... when when the first things you hear and see is that string sex ed playing this music\nOne of the first thing you hear and see is a string sex playing this music\n\nYou're\n\n\n\n\n\nRoger Norton conducted the London classical players and that's partly performance up the symphony number eight an F major by the big fun Beethoven\nThe playlist for this edition of night cap is up on line I'm a gp the website if you'd like to the\nGo to ... news dot org slash programs slash and I can't even though it's not news you can find it at ... dot org slash programs slash Mike I'm Sarah ... God for your company and hope you're enjoying what you hear\nAnd what we hear next is guitarists chew fate young thing a series of short works poetic waltzes by Enrique Grenada\n\n\n\nGirl\n\n\n\n... well ... ... ... not as chief a um play guitar almost time for the eleven o'clock news from NPR will be back with more music including a concert fantasia for piano in orchestra by Tchaikovsky\nTime for the eleven o'clock news from NPR and you know the back with more music including a concert fantasia for piano in orchestra by Tchaikovsky\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\nOne recent highlights conduct you're describing the stresses of thinking\nReally tricky music and you've got to get to the end of it such that that final Tam Tam crash and the big explosion of the Death Star happened up the right moment [noise]\nYour support keeps the inside the music you love I'm here for you\nPlease go to ... dot org and click\n[noise]\nIt was Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\n\nLive from NPR News in Washington state and the FBI is wrapping up its supplemental background check on Supreme Court nominee Brett Kavanaugh\nMajority leader Mitch McConnell says the Senate will get the report tonight and that a procedural vote on the nomination instead for friday and NPR's Scott Detrow explains the FBI's findings are not being made public\nSenator is being given the chance to read the FBI's findings but the report will be held very closely only one copy is being made available and will be held in the secure room to Senate uses for sensitive topics senators limited amount of age with security clearances will be allowed to read the report\nThe Judiciary Committee asked the FBI to conduct a one week investigation of cleans cabinet salted Christine Blasey Ford in ...\nClearances will be allowed to read the report\nThe Judiciary Committee asked the FBI to conduct a one week investigation of claims cabinet salted Christine Blasey Ford and other women\nAre though to Senator Jeff flake yes vote was contingent on that demand but the report scope is already coming under fire from Democrats Ford says the FBI never tried to interview her Scott Detrow NPR News the Capitol\nA federal judge in San Francisco is temporarily blocking the Trump administration's plan to end temporary protected status for immigrants from Sudan Haiti Nicaragua and El Salvador us district court judge Edward Chan's granted requests for preliminary injunction pending a lawsuit\nChances there's evidence that President Trump is hostile toward immigrants who do not come from Europe\nTemporary protected status has granted to people from countries devastated by natural disasters or conflict until conditions prove it home\nThe murder trial of Chicago police officer Jason Van Dyke will soon be in the hands of the jury W. B. easy is Patrick Smith reports\nThe defense called twenty witnesses over the span of more than a week much of the testimony was aimed at trying to undercut a dash cam video showing Van Dyke shooting Seventeen year old the one that Donald sixteen times\nThat video at the centerpiece of the prosecution's case it shows McDonald walking away from police and Van Dyke keep shooting until he's gone is empty even while McDonald is laying on the ground\nProsecutors called the former FBI agent and use of force expert who testified that the shooting was unjustified on Tuesday Van Dyke took the stand in his own defense he choked up describing the shooting and he testified that he was in fear for his life when he shot closing arguments are scheduled for Thursday for NPR News I'm Patrick Smith in Chicago\nAt least one South Carolina law enforcement officers dead and six others were wounded after a gunman opened fire on them in the city of Florence Allen Hitler is the city's police chief they were responding\nThe sheriff's officer brothers and sisters from the sheriff's office we're the sinuses\nTerrorists were trying to deliver a search warrant when a man barricaded inside a home open fire on them and police responding to the shooting he says that the suspect is now in custody you're listening\nTo NPR News [noise]\nAuthorities and Utah arrested a man in connection with suspicious letters mailed to President Trump officials at the Pentagon spokesman for the state prosecutor's office has thirty nine year old navy veteran William\nShe was at the Pentagon spokesman for the state prosecutor's office as thirty nine year old navy veteran William Allen the third was arrested in the city of Logan two of the letters contained traces of what turned out to be cast her seat\nThey were thought to contain traces of the poison rice and which is made from a byproduct of castor oil production all of the ... were intercepted it mail screening facilities\nThe occupational health and Safety Administration has fallen superior refining company more than eighty three thousand dollars for eighty worker safety violations\nAs Wisconsin Public Radio's Daniel ... reports the violation stemmed from an explosion earlier this year that injured thirty six people OSHA found the\nCompany which is owned and operated by husky energy failed to inspect and test equipment to make sure it was fit for service the agency said those measures could've prevented the explosion that constant evacuation for much of the city of superior in April ginger Joel with the activist group twin ports action alliance says the fine is a slap on the wrist\nThis wasn't the first time this company the superior refining company has been cited for some of the serious issues bio shot um so how does he really wants to be a good neighbor charging unity they'll make a commitment that they will not continue operations like a\nHusky energy's spokesman says in a statement that the company has continuously improving safety programs for NPR News I'm Danielle ... in superior Wisconsin\nOn Wall street stalls closed a bit hotter Asian markets are mixed entree Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the symbol Family Foundation supporting the national Center for learning disabilities which works to improve the lives of the one in five individuals with learning and attention this year's learn more at mc L. D. dot org\nThe music on GB continues at eleven a sex\nNight Kathy I'm Sarah that saw how you doing in a few minutes Tchaikovsky for piano in orchestra that isn't Tchaikovsky is famous piano concerto number one it's not even his less famous piano concerto is number two or three\nBut if he's called concert fantasia\nRelatively obscure Tchaikovsky with Stephen half as soloist coming up\nRight now though back to the first half of the seventeenth century piece published in sixteen forty one Johan ... comes on a in a minor with the group ... ichi\n\nForty one Johan paradox comes on that you need minor the group Parnell seamless ichi [noise]\n[noise]\n\n\n\n[noise]\n[noise]\nYou\n\n\nKnow\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[laughter]\n[noise]\n[laughter]\n\n\n\n\n\n\nOoh\nOoh\nOoh\nOoh\n\n\nThat was ... concert fantasia in G. major\nWhich even half a soloist with the Minnesota Orchestra in concert ... got what's conducting Tchaikovsky wrote one blockbuster famous piano concerto that we hear all the time today and the second full length piano concerto that we hear less and one movement third piano concerto that we hear even less\nPieces even lower down the spectrum of fame in concert fantasia in G. major and this work gave some context\nI'm Sarah ... you're listening tonight cap or weekday evening program here a listener supported G. P. B. the Georgia Public broadcasting radio network\nI'm Sarah ... you're listening tonight cats are we the evening program here a listener supported G. P. B. the Georgia Public broadcasting radio network and thank you for your support don't eat any time ... ... ... or\nGo out with some more Russian piano music piano alone this time and from a later generation Marc Andre handling with the piano sonata in G. minor open twenty to buy new ... yeah\n\n\n\n\n\n\n[noise]\n\n\n\n\n\nMm\n\nI'm\n\n\nIn love and\n\n...\n\n\n\n\n\n\n\n\n[noise] ...\nTo\n", "year": "2018", "show_name": "Nightcap", "city": "Chatsworth", "day": "04"}