{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events bases from board room to ballroom with Avi equipment and inhouse catering hotel north Hampton dot com New England public radio where wait wait\nDon't tell me is funded by U. N. D. S. B. shows in association with any PR presenting metal in pay ruin the Academy of music theater in Northampton Tuesday October nights tickets at D. S. B. shows dot com\nBy webs yarn store featuring yarns tools books and classes for knitting weaving and spinning for over forty four years in Northampton am dead yarn dot com\nAnd by the atlas farm store and south Deerfield certified organic produce plants and food products from pioneer valley farmers and artisans atlas farm dot com\nAnd this is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and it and eat the R. dot net which says you is next it's twelve o'clock [noise]\nThis week says you take a look back over the years\nMakes a gesture and I'd like that I think they did cold is on the original sin [laughter]\nWe re assemble the original panel to revisit our very first episode pilots spelled P. I. L. M. T. I'm Sorry I Can't give you points for that but certainly [laughter] we've discovered that in twenty plus years some things haven't changed at all\nWe won't even try\nOne without even\nIt's a retrospective says you coming right up\n\nLive from NPR News in Washington I'm Barbara fine\nProtesters are amassed on Capitol Hill in Washington DC in the hours before the Senate is expected to confirm Brett Kavanaugh as Supreme Court justice among them is twenty five year old Matty laugh every who traveled from Scranton, Pennsylvania it's just hard in this country\nFor more than eleven hundred listeners joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\nAnd I feel like that's what I got from everyone voting have an eye and\nMeanwhile on the Senate floor this hour lawmakers are delivering speeches supporting end opposing Kavanaugh though is NPRs Amy held reports it's all about a foregone conclusion that Kavanaugh will take a seat on the high court as early as next week\nThirty hours have been taking down to today's final confirmation vote after the Senate advanced Kavanaugh's nomination on friday Joe Manchin of West Virginia is the only Democrat who was indicated he will vote for him\nMentioned was one of four undecided senators who signaled their support for Kavanaugh yesterday mentioned was explaining that he waited for Republican Susan Collins to do at first I knew when I was told she was going to do that I have tried to\nWatch [noise] uh then I [noise]\nWhen he was interrupted by protesters shouted ... Democrats are hoping to marshal the national protests over how the allegations were handled into votes in next month's midterm elections any health NPR News Washington\nSecretary of state Mike Pompeo has met with Japanese prime minister Shinzo Abe's in Tokyo today he says he wants to ensure the two allies around the same page before he heads to young young to meet with North Korean leader Kim Jong un\n[noise] or drugs or our view which was a rare\nPompeo will also try to make progress arranging a second summit between President Trump and Kim political tensions are rising in Brazil ahead of tomorrow's general election NPR's Philip Reeves reports\nOver three decades after the end of military dictatorship Brazil could be about to take a turn to the far Raj polls show a surge of support for ... without a a congressman and retired army captain posted\nNATO has strong backing within the military his opponents portrayed him as authoritarian yet many Brazilians approve of his tough talk about crime and corruption overlook his record of offensive remarks about gender of sexuality and race ...\nDollars spent much of his campaign in hospital after being stopped at a rally to win out ... and fifty percent of the votes\nMore than eleven hundred listeners joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\nChief rival for them to a ... from the leftist workers' party raised NPR News Rio de Janeiro\nThis is NPR Spanish opera singer month ... one of the world's greatest Sopranos has died in her home city of Barcelona she was eighty five\nSpain's king Felipe is expressing condolences calling ... a legend of universal culture with an unequal voice the BBC's Danny everhart report\nMumps or a couple of years voice was paying for your power [noise] I'd heard here in which he needs Madame ... [noise]\nShe rose from humble background to come to the world's greats opera houses ... made a key international breakthrough at New York's Carnegie Hall in Nineteen sixty five [noise] once you have to replace the college in the title role of don't exist you know create their own\n[noise]\nStanding ovation last minute but she reached out beyond the will to ... ... most famously singing the direct Barcelona with the lead singer of\nQueen Freddie met for appeal to her home city and the and some of the Ninety nine [laughter]\n[noise]\n\nQueen guitarists Brian May has posted a message on Instagram saying ... was an inspiration to the group and Spanish tenor Jose Herrera says ... had a voice of great range and a flaw this technique I'm Barbara ... NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with she got through pointed direction and sixteen program to massages including warning night and stretch sessions retailers nationwide more dream wave chair dot com Andy any case the foundation\n\nWelcome to says you are game of bluff and bluster words\n... more than ... eleven hundred listeners joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime they making a contribution at our website any P. R. dot net thank you very much\nNow joined our panelists and your host this week Dave do [noise]\nMartha's Vineyard Hebrew center in vineyard haven Massachusetts Welcome just says you a simple game with words played by two teams the first of which sits stereo left the first thing you ever heard her say on says you in season one episode one round one was\nA\nMix Carolyn Faye Fox is in season one episode one round one he can be heard saying first of all your questions wrong\nAnd you know losing one episode one round one she can't be heard saying anything because her husband keeps interrupting her alliance [noise]\nCouldn't today by how 'bout Arnie yeah mixture aggressor history ... west\nHow to respond\nTo the right team to in season one episode one round one he can be heard and using there's an enormous number of calls in here Mr Tony car on\nSeason one episode one round one is the first time we ever hear her say no more sports questions misprint enact bar and in season one episode one round one he's heard making the on refusal offer Francine I took the last one I think this is yours Mr ... [noise]\nProvided by\n... we had stayed in character I must say that is going to lead our team\nBarry will be the captain and all of that really is true guys are game is played in five rounds correct answers are worth ten points or any ... in their own deemed appropriate we always advise new listeners to grab a pen and paper that we've always done it\nBefore we begin it's worth noting as soon as you landmark today this is the first time in over four years that all six of our original panelists subsets\nStreaming of New England public radio was funded by you and killed riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n[noise]\nEmail email oh eight I ... I don't\nTurn your time Dan sometime I Am\n[noise]\nYou\nDon't always for that they can all take a vowel is a pretty fix Barry Toni T. O. N. G. U. E. finger\nI don't know Roswell very bad deli [laughter]\nThink [laughter] that fresh who knuckle\nHam a gym and tomato oh of course sandwich\n[noise] that's it I asked the sandwich fingers and when I get one of his\nVoice ... sandwich ham sandwich tomato sandwich with a score thirty to twenty nine Arnie steamed just\nBarely in the lead we'd go on to round to the contribution of WC AI listener ... foster of ... in Massachusetts it's the first of the says you bluffing rounds played with the little musical help from our friends Zoe in John Zemin Arnie each person on your team will receive a card\nOne of those cards gives the actual definition of a real but unfamiliar word the poor souls who received the other two cards will have but a few seconds to make up a definition on the spot good enough to fool berries team ten points are up for grabs to bury if he can spot the truth teller or do you Arnie if he kept\nA few moments musical enhanced to come up with a definition for the word to\nMoscow bunker M. O. S. S. B. U. N. K. E. R. mosques bunker so we in John\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\n... new season begins for all of us here at says you\nAnd this November as the ... center migrating and the bears are hibernating\nSanta lumber Bozeman ... yes to live shows tickets for Montana will be released this week get yours before the snow begins to fall check online for tickets an old the grisly details as always had says you dot net that's essay while yes while you know [noise]\nSays you pause it for a few interested shall announcements [noise]\nEat every day in New England Public radio jak safari travels on a journey through the jazz world and beyond sampling the music of legendary and emerging artists from across the pond African ...\nFrom ... to him on my cell is too much came on my sheet do to my second\n... joined me on a jazz\nSafari Saturday Night starting at an age on N. E. P. O.\nAnd this is New England public radio where says you can send use funded by view hand WFCR as partners Amherst capture Mount Holyoke and Smith colleges and the University of Massachusetts Amherst\nAnd by Devon lane power equipment and Belcher town offering the husk of earn a robotic auto um our more at ... dot com or husky Verna dot com [noise]\nComing up a week from today next Saturday the best of valley voices story slammed join any PR at the Academy of music on Saturday October thirteenth twelve of the best sellers from our stories lambs series we'll share their troop sales\nYou can help crowned the winter it's the biggest slam of the year and we are expecting a sellout so get your tickets now don't delay\nAnd you can find your tickets at N. E. P. R. dot net [noise]\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology hey I see ... D you Mm\n\nSeem it on base Jiang Zemin on guitar Samara Oregon keyboards and rubbing salt on percussion and drums thank you so much guys for giving us a few moments with the word mosque bunker MOSSAD B. U. N. K. E. R. let's go first to Carolyn most bunker\nIt is a maintenance man slang for a stalled elevator filled with cubicle workers end an awkward silence\n[laughter] it's Archie brother\nGot to go fix the mosque bunker gets pretty right than there\nAre right it's a stalled elevator or\nIt's like if you're given lemons make lemonade it's it's a it's a\nA fish in North America that I really couldn't sell because it really stinks to high heaven so it's been used for many years to make fertilizer and sometimes more oil's\nOils ten mile oil you know make them away\nA stinky fish I sticky fish\nOr ... what's the word leftover from the early days of ... you know cave exploration meaning a shoe caked with algae from exploring in the dark and damp Mm algae cake\n[laughter]\nWell there you have a very it's either a shoe caked with algae stinky fish or a stalled elevator which one is it they all smell to me a for instance when\nYou've been often a installed elevators you have any idea\nHow Tony and I are inclined to the stinking fish\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall genes C. V. S. dot org\nCould be used for fertilizer yes it's it's also more that is the only one which seems to have\nKind of relationship to the real world if you know what I mean it's all the others are shaped so specifically attuned to a problem that I don't think\nYou'd find him and he takes generic I mean imagine lying around Baghdad yelling that when we're not by her and the algae coverage you again I just think certain\nCertain objects never get words because they're just not as significant enough you know they don't get to make it as a book just about big book June ... you're\nWe will go with armies definition that mosque bunker is a fish that smells bad but makes good fertilizer Arnie ...\nThey think that most bunkers a stinky fish would have thought that I just reporting what does your guard say it says\nI notice Americans fish [laughter] not very tasty kind of shed like mostly use for oil and fertilize\nThere's an interesting footnote on my\nAs soon as this origin is Dutch most likely this was the fish the Native Americans taught the pilgrims to plant with their crops not too far from here\nThat are score now is thirty nine to thirty with berries team surging into the lead and please help me thank our hardworking scorekeeper today that's Terry's oh bell William\n[noise]\nEr let's continue our around by round reconstruction of the very first episode of says you with a reprise of its third round which was a round up says who\nAre ten points simply named the author of each of the following lesser known lines and you're not you should be able to work out the authorship from the style and substance\nCarolyn who wrote this your wig fits very well the wasp murdered looking at her with an expression of admiration it's the shape of your head as does it well well right\nThat sounds a British shape of your head as that\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a I see ... D you who\nWrote it as the quest Lewis Carol Carol [noise]\n\nThat is from through the looking glass and actually it's from a chapter was deleted nobody wanted to read about a wasp in a way to get it [laughter]\n\nTony who said this your vote your ... vote your ignorant vote your wasted vote put in an administration in Washington DC that has seen fit to pass every kind of legislation imaginable saving you until last then filibustering on top of that\nCould be Sinclair Lewis [noise] uh no it's nothing Claire Lewis could guess is is is it from Mr Smith goes to Washington no is this a novel it's not a novel it's a speech oh\nDo you think yeah\nSure sure I liked that one but I'm not sure if you should you know it is either\nA term of abused for an uneducated or unsophisticated hasn't a short beak to South American bird or the offspring of a ... and then they'll pack Arnie it's definitely one of those three up to you to choose you know this is ... this is now one of those situations where\nAs we've been doing the show for years and years and years and then Tony gives us a definition and we all go what the what\nManaged to get their ... through bad no [laughter]\nI mean you know here a lot of talk I allow my pocket it could be you know a an aunt merging with a muscle or I don't know [laughter] I Know it can get in your marriage or a lion and a lamb sort of bank or a lion\n\nUh so I agree with\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene CVS dot org\nOf mixed heritage parent\nEjections we're going to go with them I run a\nTony they say that worry so is the offspring of a male alma and a female alpaca shortly these chest\n[laughter] what's your card say\nHe says the offspring or a male or female out\n\n'cause that Tony is that in fact ... where it is a catch ... and it's the only catch her word I can claim to know\nWeek our listeners write in hoping to hear newly last but not gotten rounds from our earlier shows\nComedy with a spotlight\nFor a chance to spend a little time Richard creator writer\nAnd longtime hoped\nFor seven points pleased to fund the following theatrical idioms an additional three points if by some miracle you can divine the derivation Carolyn ... ... ... he asked a stripper\nYes well do I get comes from a I think it's the Greek for the shedding of skin by a snake well tend bar was just [noise]\n\nFor for an additional point you know who came up with it do I know you wrote a she was the instigator but who actually coined the word ...\nThat's exactly right and there's a show Megan\nYou're toning break a leg\nThey wish a that is bestowed upon every person before performance meaning hope you have a great show it's exactly hum break a leg\nI think comes from a performance of mud bath every weird thing in the theater seems to come from some bad performance of Macbeth or things went wrong including whistling not whistling before a performance\nAnd uh I think uh probably um it was a way of certainly away warding off a danger by you know\nThat's the superstition that is what the ... black have anything to do with the ...\nStreaming of New England public radio was funded by Ewan Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene CVS dot org\nOne would come out for a curtain call and take such a low bending down that the leg would literally break Ernie that's our any locally\nOkay she was a sharp shooter and the buffalo bill days and the\nDoesn't need to hit you target hit your mark yeah\nNo that's not it anyhow any audio well it's a free ticket\nAnd uh resembling a which is punched resembling that uh resembling any oak leaf marksman ship trick of throwing a card in the air and having a ... call shot through it\nLenora Richard top banana well the top banana is\nThe star of the show is it not use the head of the second he was laughing at it was the the funniest ... the main line comedian\nYesterday in a vaudeville that seven points and how we get and the derivation uh this is in dispute so you'll get points for almost any\n[laughter] who is in in ... yeah well\nScholars a dollars in this very well studied this route scholars uh [laughter]\nThe vaudeville players bananas because they were inexpensive backstage and a guy that was the funniest was able to take the first one or ... points\nFor that sure I'd say I have never heard that but uh that's worth a look for that he was doled out the highest price\nThat's another\nPoint for that 'cause that may represent corporate funding\n[noise]\nAny other guess uh before I had great appeal the full ten points yeah it's [noise]\nIt's [noise]\nIt's origin is disputed but some sources say it comes from the old slipped on the banana peel routine which always got the biggest last Paula Markey\nMarkey is is the ah is delighted sign outside for the person that that that ... the players and then\nTen more germs [laughter]\nDemocracy refers to the to the starring cats or the new kids on the block Markey mark [laughter]\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org or otherwise\nAlright it was considered noble to have your name in life yeah right oh give them their ten points as they marched yes\nActually it's a large tent or canopy in front of a theater with advertising lights indoor billing but it was originally a large field ten used by an officer of high rank or noble stature such as any more questions\nAnd finally burying deus ex mocking\nGod from a machine\nIs the ... now that means a sort of unexpected and somewhat mechanical resolution to the problems facing the characters in the play\nAnd it comes from and the ancient Greek practice up sometimes what they would do is they would actually lower ed God like figures from a crane like device onto the stage that's exactly right [noise]\n[noise]\nNow back to the game at hand let's close our celebration of the says you origin story by revisiting the same game that closed our very first episode what's the difference contributions come from John sorrow Seattle and hall of famer bill Spencer of copies bill Maryland\nCarolyn what's the difference between unexplainable an inexplicable\nUnexplainable means that there is no explanation for it inexplicable means gosh that's amazing\nConflict and complicated\nYou are split company exactly\nBackwards back were the other way\nAround I don't know [laughter] we did we'd we'd be zero one that we're not right [laughter]\nThey both implied difficult to explain but unexplainable implies that the difficulty lies in the explaining not necessarily in the understanding inexplicable implies not likely ever to admit of any explanation for example the thought processes of politicians are generally unexplainable\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall genes CVS dot org\nRelations rules are the basic you could call it the backbone of the structure of an organization regulations are the individual a specific um strictures on some specific kind of activity\nThat is what I thought as well and it turns out to have nothing whatsoever to do with the\nRules are can be stated just general warm regulations require numbers [laughter]\nThink like Roberts rules of orders and versus regulations about how you have to uh put in a\nFire extinguisher stuff okay I'll think about it\nVery along the way they're so think I'll do a a rule can be a an agreement about how something will proceed or how something will be like the rules of the game like the rules of baseball robbers rules of order\nSomething that this is what we all play by a regulation is a set of requirements to\nImpose on people that are doing some activity a for instance in ... installing sprinklers to suppress fires you have to you have to obey\nThese regulations and meet these standards ... measurements maybe regulations\nOne ... one is an agreement the other is an imposition by the government to thank you [noise]\n\nBoth are set of instructions but only regulations are legally binding regulations are authorized by legislatures set by governments and enforceable by law rules are just rules", "year": "2018", "show_name": "Says You", "city": "Amherst", "day": "06"}