{"month": "10", "state": "NY", "station": "WNBM", "content": "[noise] we become a nation obsessed with losing weight overnight instead of staying healthy overtime\nAt our W J Barnabas help we take a different approach with the focus on reducing your risk of diabetes and sleep apnea and hypertension\nAnd for those who is best option is Barry after surgery will stay with us from the time you commit a right through recovery visit our W. J. D. H. dot org slash weight loss Newark Beth Israel medical center\nMight be happy together\nI was just\nCage and being used to be\nA range they know\nRadio one oh three nine [noise]\n\n\nMy\nThat we know how but\nWhen when we when time but um no no no this is wrong or\nWill we go do it in the video and you\n... been known\nKnow maybe you know we\nDon't do\nAfter they love to do\nThat they think the bottom\nThe league at home\nAnd then you just don't\n\n\nBe above\nWhatever you want to do a\nBe what it is\n\nA\nKnow\nWhat they\nKnow in the town\nMan named ...\nWho didn't\nKnow him and then\n\nNo\nNo no\nYou know over\nWhen\nJob ... what do you get\nDid I go there\nWomen on radio won all three that\n\nYou in mind though she\n[noise] we become a nation obsessed with losing weight overnight instead of staying healthy overtime\nAt our W J Barnabas help we take a different approach with the focus on reducing your risk of diabetes and sleep apnea and hypertension\nAnd for those who is best option is Barry after surgery will stay with us from the time you commit a right through recovery visit our W. J. D. H. dot org slash weight loss Newark Beth Israel medical center\nMight be happy together\nI was just\nCage and being used to be\nA range they know\nRadio one oh three nine [noise]\n\n\nMy\nThat we know how but\nWhen when we when time but um no no no this is wrong or\nWill we go do it in the video and you\n... been known\nKnow maybe you know we\nDon't do\nAfter they love to do\nThat they think the bottom\nThe league at home\nAnd then you just don't\n\n\nBe above\nWhatever you want to do a\nBe what it is\n\nA\nKnow\nWhat they\nKnow in the town\nMan named ...\nWho didn't\nKnow him and then\n\nNo\nNo no\nYou know over\nWhen\nJob ... what do you get\nDid I go there\nWomen on radio won all three that\n\nYou in mind though she\nTo be in that\nTime doesn't buy\nThen when it then they tell you\n\n\nThe\nDamage case shot you know I Love you know when I got a thousand dollars to somebody live in New York and the hard rock hotel and casino letting city studios ... were you a chance to pick up a thousand dollars is W and the Bronx yeah\nAll right near ... mix the Barbie jak this national key word right now he owns ... H U G E he would jump to not be one night that he would you ate huge eats\nAnd I but I mean when they will take you back ... injury data messenger rate may apply it's a thousand dollar keyword media went up three now I Do not like Dr phil ... can drive do treat in your eyes like back in the day oh my God you remember that\n'cause we've got the new right now so if you're you're a off his lunch in and you need is now jak right now during this up real charge could ... I think the lighthouse fish market that seafood I Do food spot in Harlem and Dr burger look better real butter what a body by burger let's get it golly\n\nThen\nThey go down for\nNot be read in a\nVery\nTo Jane and people\nAnd\nThere\n[laughter]\n...\n... ...\nNot\nThat\nThem and gone beware\nAnd how we\nAll\n\nKnow that they\nCan\nTo get started\nTeams the jelly on the\nRadio one Oday na na\n\n\n\nDa\nDa da\n\nDa da\nDa da\nDa da\n\nIn town\n\n\nThen\nThey go down for\nNot be read in a\nVery\nTo Jane and people\nAnd\nThere\n[laughter]\n...\n... ...\nNot\nThat\nThem and gone beware\nAnd how we\nAll\n\nKnow that they\nCan\nTo get started\nTeams the jelly on the\nRadio one Oday na na\n\n\n\nDa\nDa da\n\nDa da\nDa da\nDa da\n\nIn town\n\n\nReally\n\nKnew what he\n\nDidn't know what you mean you\n\nDidn't let me know what this will be will be in the village you know my\nIn the way to go back\nMe by\nThe way\nUsually\n\nOnly see now we have to be in and they'll be\nAnd that can be\nCan be like well then you know just all three of them you know what to\n\n\n\nYou know gotten me for me\n\n\nA what a lot for [noise]\nYou know it was founded on what could go\nA joke\nOr whatever you want to\nKnow them all over\nThe other\nHand there why\nGo after all the\nTo go down there and got she told me to be and why do\nPeople sign la\n\nLa land on\nAll day\nYou know\nThose who were\nMake the bottom line\nIs better than no\nWoman was\nWay you don't remember the smell that doesn't do the right thing by\nBob Bob we're da da\n\n\nDa\nDa da da\nDa da da da da da da da da da da da\nAnd while it's bop it got to go out there do you get that dog at work\nBlock\n[noise] came during the during the boom\nWere\nSaying was that it was badly damaged it in a rush to get the real DJ good live radio when it's\nReally now\nThey do\nLives are being turned in\nThe\nRegion Indian or to do in its cage and do it [noise] didn't\nChange\n[noise]\n\n[noise] [noise]\n[noise] they got to\nDone to\nGet\nHer out of it\n\n\nAnd [noise] she knows that she should be a dream donors may get a search engine and judge Judy then change their skills to do and she gave me just\nIn the\n\nChurch\n[noise]\n[noise]\n[noise] [noise]\nTo the family really I'm coming with Jeffrey but the difference was on the cruise I can be as wild as I Want to give you the babysitter it can be freaky with the babysitting them coming oh no no no we\nHad during the holiday comes down to the front um union also Joshua when I'm leaving\n\n\nOur old is your water heater if it's been around for more than ten years and it's been around too long the Home Depot is here to help with Rene about the number one water heater branded America\nGet ten percent off of ... water your when you have it installed by the Home Depot local licensed in short prose\nItaly saying goodbye easy call one eight hundred Home Depot to get started ringing only available at the Home Depot or saving for doing Belgium over twenty first ... models are the restrictions apply for licensing ... warrior install\nAnd you know an ad from um\n... home in auto with progressive and have on your car insurance ... excuse me maybe we should add in the word money so they know that they're saving money\nAnd just kind of have that in there okay hello just not and yummy okay well he's\nGot enough funds to pushing their progressive city from becoming your parents but we can save your money when you want all of a novel risk actually insurance companies really us and other insurers just coming off a little stricter situations\nFor limited mission work you can get into complete pairs of glasses brains lenses that works for just forty nine dollars on single making ... an eighty nine dollars on progressive\nThat's a good deal on but we all for that pricing on over five hundred rain which makes it a great deal a great deal better than the other guy right now by you complete single they can glasses for forty nine dollars are two pairs of progress as for only eighty nine dollars can work where here to help you some answers more by the north of detailed offered by November ten\n[noise] oh\nAll right\nHave on your ... when you were purchased by boards of pens oil high mileage motor oil as a micro guard filtered for the price of oil conventional now twenty six Ninety nine extend the life of your vehicle and save big what Ben's oil and filters specials at O'Reilly auto parts better barge better prices everyday limits to fly sees door for the two\nOur\nAuto parts\nHose and I know start with low because at Lowes proceeding big on the supplies they use ... right now seem even more I thought concrete fix\nNo thirty percent off when you buy in bulk for say ... percent on eligible purchases every day when you use your Los business credit account and stop by our visit most for ... dot com for details so pro now that you know start with low\nMinimum purchase require selection varies by location predator off the subject because of the ruble Catholic mind with other credit offers exclusions while us on like\nI don't drink I don't smoke\nAnd her run three miles a day\nI just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAnd our W J Barnabas hell\nWe offered the very latest in Congress and breast health services\nIncluding mammograms ... grams genetic testing and breast surgery\nNot to mention peace of mind\nAnd with breast health centers located throughout New Jersey\nFinding is simple\nTo me the most of breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash mammal\nMaking excuses is easy\nOur W J burn it was hell\nLet's be breast cancer together\nThe healthy together\nWorldwide really use a ... you know the war\nWas the end you'll imogene formerly of the legendary lady this guy who would you lose your heart halted betrayed him first choice reliable is the author of our military veterans Saturday Night live a third of the insurance and we moved into the performing arts in the Bronx but more able to get contracts\nFor the ... not to be wrong eighty eight thirty three point lead me to dot org\nExotic uh America's largest adult expo return this Friday through Sunday at the New Jersey those veteran edited at exotic are presented by Mike revamp humor George ... one hundred fifty better but the educational seminars sponsored by what's your chest and talk about your payment on the ... hip hop legit Coolio performing live Saturday Night\nGo beyond the ... century to wild after party ladies are real product roll into but then exotic uh expo dot com ethic ... expo dot com\nToday Rudnick likely not talked to Dr ... ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and basketball you'll remember what you've learned\nI always thought I was the added languages but after using the apple I can tell you I was just taught the wrong way\nUsing battle ten to Fifteen minute lesson you can be speaking confident linger new language within a week\nI was amazed that I could start having real life conversation right away it was so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning gap in Europe tried for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battled for free download the app or text book job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. talk for eight for aid for eight\nHi Jamie progress is number one number two employee and I said\nHey Jamie Jamie ... this is your daily pep talk I Know it's been rough going ever since people found out about your archipelago ... Matt harmony but you will bounce back I mean you're the guy always helping people find coverage options with an enterprise tool it should be you giving me the path to now get out there that high note and take\nOur money all the way international this\nReverse a casual the insurance company enough at least partially coverage match limited by state law\n[noise] oh\nOh oh right on the\nLabel on your next oil change when you were purchased by boards of pens oil high mileage motor oil adult microbes are built there for the price of oil conventional about twenty six Ninety nine extend the life of your vehicle and save big what pens oil and filter specials at O'Reilly auto parts better barge better prices everyday limits supplies see store for the two oh\nOh oh right\nAuto parts\nAnd brace wars members only see participating source or details\nIndiana broadcasting live from New York\nThe hard rock hotel and casino Atlantic City studios you or me\nOr Asian on radio one ... ... we are Margaret Thatcher it's called ...\nAnd\nMy knee extreme\nTools [noise] my victory I'm Charlie Hill and ... we I mean the movie I must be close to what you\nMaybe don't let me go\nTo my new extremely close to ... I never go near blow ... problems and to me\nI just really went on to\nBe [noise]\n[noise]\nThe one that was Linda I Love fast\nMoney gee we're already yeah one of the three done\nFor limited haven't mission work you can get to complete pairs of glasses brains when does the work for just forty nine dollars on single vacant lots of an eighty nine dollars on progressive\nThat's a good deal on but we all for that pricing on over five hundred grand which makes it a great deal a great deal better than the other guy right now by to complete ... single vision glasses purchased forty nine dollars or two pairs of progressive for only eighty nine dollars can work where here to help you summer by the door for detailed offered by November ten\nHose and I know start with low because the lowest proceed big on the supplies they use smokes right now seem even more on what concrete mix\nNo thirty percent off when you buy in bulk ... said ... percent on eligible purchases every day when you use your Los business credit account to stop by our visit most proposed dot com or detail so pro now that you know start with a lot of\nMinimum purchased required watching varies by location credit offer subject credit approval Kathy combined with other credit offers explosions while us on me\nI don't drink I don't smoke\nAnd her run three miles a day\nI just had a complete physical my family has no history of breast cancer\nCurious how healthy habits and good family history\nTo excuses\nAnd yet we still need mammoth\nAnd our W J Barnabas hell\nWe offered the very latest in Congress to breast health services\nIncluding mammogram ... genetic testing and breast surgery\nNot to mention peace of mind\nAnd with breast health centers located throughout New Jersey\nFinding is simple\nTo me the most the breast cancer awareness month\nBy visiting our W. J. P. H. dot org slash mammal\nMaking excuses is easy\nAre W tape aren't this how\nThe brain cancer together\nAnd help each together\n... worldwide review the legends of disco featuring Melba Moore\nNo books movies and Norma Jean formerly of the\nLegendary lady the guy the exposure Hong Kong and\nBetrayed him first choice for more reliable let's say in honor of our military veterans Saturday Night live or third ... be insured women suited for the arts in the Bronx or more able to get contact with a booming are they not to be wrong eighty eight thirty three point lead me do that or\nHow old is your water heater if it's been around for more than ten years it's been around to the Home Depot was here to help with ... about the number one more year Brendan America\nGet ten percent off of ... water your when you have it installed by the Home Depot local licensed in short prose\nItaly saying goodbye easy call one eight hundred people to get started ringing only available at the Home Depot or saving for doing Belgium over twenty first ... most of the restrictions apply for watching the ... are so\nHigh it's Jamie progressive employee of the month to month in a row\nHi Jamie kick me Jamy I just had a new idea on what the name the right tool so when it like\nTell us what you want to pay ... trombone was what you say well before garbage option to pick your budget then we just all these fingers now worldwide goes statements coming out have come back you know maybe anyway for your practice and I like I knew there so the\nProgress of casual the insurance company in a fairly expression coverage match limited by state law\n[noise] oh\nOh oh right\nOn your next door or trade when you were purchased by boards up pens oil high mileage motor oil adult microbes are built there for the price of oil conventional about twenty six buddy died extend the life of your vehicle and say big what Ben's oil and built her special ed O'Reilly auto parts better barge better prices every day labor supply see store for the two\nOur\nAuto bar\nScene called casting calls in St Paul\nS n G ... recording group renewed in price would like to invite you to be a part of their music video she would put their singled out be made holding enjoy them on Saturday November did what he obstructed mount ... Baptist church Eighteen eighty three Adam Clayton Powell junior boulevard in Harlem that Saturday November to that one I'm sure\nThey invites you and your congregation to come dressed and you're the best way to do the ... for the seat they will need fifty choir member is just an all black attire it'd be digging and digging best dressed in black and white attire and one of us are just in uniform or special the memorial or call nine one seven six two thirty five\nSeventy six nine one seven Ninety two three five seven six again nine one seven six two three five seven six or email Mr released ever ate a Gmail dot com R. L. E. L. I. E. seven eight and Gmail dot com\nSunday only a brace wars members only see participating source or details\nOn the ... ... what he needs to be a man on the radio weekday afternoon three to seven PM simply our radio one oh three nine\n[noise] this is\nLou\nThe girls up\nNamed to the bench\n\nDay when she was like ... but\n\n\nUsed to be a\n\nDo\nCan't be\nAnd Tom\nAnd not tell you\nThe\nDay I\n\nLot [noise]\n[noise]\n\nThe girl I'm planning\nHaving me ...\nAnd now\n\n\n\nDo\n\nLive your\n\n[noise]\n[noise]\nCompensation and allies really yeah we do it all on Facebook at radio one oh three nine and why\nYou are you doing today\n\nMean you know the way I knew\nThey\nLonger a\nLow ... thing not\nBeen away\nFrom\nThey try\n\nNo no no no no\n\nMaybe say you\nKnow maybe ... you know the\nMovie\nBut they're\nNot you\nKnow very rarely on your word your children when\n\nThey go oh no\nOh\n\nNo no\n\n\nNo\nNo no no no\n\nNo\nRadio one oh three nine [noise] and\n\nUm when she didn't\nKnow that you\nReally can\nNot sure what you do you do\n\nShe knew you\n\n\n\n[noise]\n\n\nMaybe but [noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\nOr near the larvae radio what else may not be arguably taken over Caroline November a\nSecond what do we get you on a pair of tickets like actually right now eight by by several when he went up three nine ... luggage cart could've read ...\nIn the ... ... ... ...\n... so the military\nWas in the ... I don't know how ...\n\nOnly thing about you know on\nNamed ... and I know\nReally could open it and it was right over in ... when a kid in the dream of outdoor angle we could do and we're all in it and not know ... was\nThe cause of the week in week\nNumber of other than that and with me\nYeah it's coming to jobs around the ... [noise]\nThey get much you live now and then get much done well because you do find is that it takes to do it ... and and I think a shoe and you know\nOnly ... you know and that's why I\nA ...\nA winning the train them to\nPlea na na na no ... well a\nReally good in the league and the ... [noise]\n\n... [noise]\nNo ooh\nNo yes God\nMean he was five one body if the data ... inches of rain all of a point on I in China Korea nobody ...\nMan I don't know a\nIt is and maybe I couldn't talk to him on a ranch dressing one plant but Megan ... one of the shuttle Venice should ... blood have man I\nWould have man [noise]\n\n[noise]\n\nI don't\nMean to\n\nMe I can you make of our a bb Elissa Williams Alito Williams so gradually just you're going to the deal he ugly November second act Caroline okay thanks yeah You're welcome hold up okay Matt demar chances radio three nights and why dot com\nTalk to you know\nWhen you do in pain [noise]\nNot sure\nDon't\nAny de\n\n\n\nUm what do\nYou still ...\n[noise]\nWell one would you\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\nThe message gets no radio one audri nine love\nThe ... election radio\n[noise] gee\n\nSoldiers you know [noise] [noise] [noise]\n\n\n[noise] what about you know but child\nLittle ... on that one of my life because my wife I Wish him don't don't ship out I'll be you love your way and why [noise]\n[noise] [laughter]\n\nAs usual I go clean cook dangerous about racial walking would not know why don't you won't be one of your back they never back the\nDirection although the wire and I'm like OK I logged on offshore at about eating and rub your day and what you've been able to Jim ... by like pushing the bomb on on how well I don't know the way but I don't get your degree you're\nWondering okay hello ma'am well I don't know the way it was like mom you know they never get caught up in a number okay and I believe the question is your daughter before the game\nWhere they stand\nFor\n[laughter]\nYeah but you know read on the [noise] do you know but I have to do you want to be on the news [noise] but um\nSince we both know when we went to jail butterfly was shopping for the protection of children back while we try to be when you when you start to melt lead champs de ... you're going\nTo live the role of black gay or should make it a shot of rich but I'm\nA been out with a big role of Jewish love you're really looked like they want you know while you're doing all the way up to break the shell shocked when they have the big bang\nBang bang bang [laughter]\n\n[laughter]\n\n[laughter] [laughter] [laughter]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\nYes ma'am afterwards yeah where radio one of three night\n\nIt's a\nName\nSingle mom\nKnow that\nNot we're right\n\nThe line\nA blind\n\n\nNo\n\nNo\n\n\n\nNo no no my room\n\n[noise]\nOh\nMom\n[noise]\n\n\nOh\nAnd he\n[noise] you\nWe should read each year\nTo the mall\nThe um [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\nLook\n\nMatter of you\n\nI'm\n[noise]\n[noise]\n\n\nGod I Can't even\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\nRadio what a ... mix of our and be happy to have low now\nGo at all\nIt's all good it's a good in the\nLoop and I do need to say that I Am all the way we're right now you will when my book bag Bruno Mars making out in an elevator like yo girls\nCarol sure there are some people uh uh you know are meant to do things in the world and that you do you live vicariously through them\nI'm definitely living vicariously through Yale and I'm about one thing I Am loving ... is that you'll be helping the L O L comedy honored along with Jamie Robert\nI got the whole November first you got let me see things on this list because it's so damn all mechanic Tracy Morgan chicken wings ... Cheryl Underwood Chris Rock earthquake get Whitley well good I Am who I\nAm Dave Chappelle Dave Chappelle will come on if you're an addict or the bad boy and call ... ... oh wow wow cool girl as you but how do you have to many\nMore people can we be on his mechanic said that right yeah like this is the\nWell you know there is no comedy show that pays homage to me then there's I mean no award show you know you should be easy to do once er comic view kept them all over the years but\nAlas they do a lot of them ever did a level you know why we would like to get a little pat on the back every now and then to you know we really commend the cold macho for putting together last year was the first one that we had a great time\nI was ... so the\nBottom lately like is the honor last year which will be going to charge under would share that it does a great odds are going to be able to come out the whole bunch of their favorite author or in one study so you do get chicken now I think if you go to\nL. O. L. calmer the honor dot com I Believe you still get chicken fought\nAnd um you know I'm really excited the Rio oh\nAnd we I Know especially myself even though I'm hating with uber to Mars and excited to see you hope along with Jamie Robert Dallek well comedy honored got the whole November first which is tomorrow ... get your ticket she told you bet thank you for calling up I got out you know al ... coming up\nTony Eighteen radio when I met the ... but not for a guy all the fun and kept it on our Facebook page that they couldn't be ... burger medic and reconstruct clashes\nWith the body bud burger and ... and ... and our special guest Jessie Molly Estelle banned the legendary courage Washington but most of all we can only use it came out to a party would at your mistakes were added Ken what holiday\nMark Thursday December Thirteen shower radio during holiday party stay tuned for details make sure you follow what they radio want us to be not and why or laws on the radio one has to be not and why that down and\nFor a limited haven't mission work you can get to complete pairs of glasses brain when does the work for just forty nine dollars on single visualize an eighty nine dollars on progressive\nThat's a good deal on but we all for that I think on over five hundred grand which makes it a great deal a great deal better than the other guy\nRight now by to complete a single vision glasses purchased forty nine dollars or two pairs of progressive for only eighty nine dollars can work we're here to help you fight the daughter detailed offered by Democrat\nHose and I know start with low because it lowers proceed big on the supplies they use smokes right now she's even more on what concrete mix\nNo certain percent off when you buy in bulk ... said ... percent on eligible purchases everyday when usual Los deserve credit account stop by our visit most for ... dot com or detail so pro now that you know start with low\nMinimum purchased required ... by location predator offer subject critic ruble Catholic bond with other credit offers versions while us all my\nFamily's immunity with sample call black elder bury the only one I Try and\nGood luck I Want it to my mind you about Dr burger you're ... you're not there getting used to wait a minute on the list forever on the hit that that does not to be for real because the burger yup my plastic surgeon who did my life ... ... a year and a half\nAgo and I've been loving my body I get complements each and every day you guys told me I don't like Jessica Rabbit at the ... that is true that is why I decided to drop like\nOur problem we follow us on the ground but you can take a look\nWe're going to be selective about Dr Manhattan the Bronx and watches it by better living magazine he knew your own aboard the optics surgeon available to convenient location in Riverdale don't you want to get not like me and when I mentioned\nTaking all that we I Do you remember you do have to do the work after Dr burger does his job right yeah 'cause it doesn't work like that\nHe does what you do the rats so if you want to get why will adopt a bird that Gabby ... burg and beat I found that have yet to be our jeep\nRan but at the end of the time there was a kid and I\n\nWatch the change in a so hard\nYou know we can\nShare the bombing at the human married\nIrish spare time\nShe is I Know\nIran you\n\nShe\nWas\nThink it's been so\n\n\nThe homeland oh\nDear\n...\n[noise]\n[noise]\n[noise] [noise]\nI never even though they didn't Don\n... what\nGoing to be you\nKnow\nYou you know\nShe won last\nI don't know what\nSee I\nAnd that's the\nThe\n... the repeated on the news to you to\nDo the same\nThing I Know it's good to be the ... ... [noise] [noise] so\nDo you\nYou know\nMail let us\n\n\n[noise]\n\n\n\n\nRadio a lot of ... are the one girl in the artery watching\nA\nWay to me those are just so that everything he's a man\nDiamond and I live but I can ... and all this and I thought it was just the the way and that just anybody judged by body and penny ... pleasure like I Know\nI mean he in la\nDi\nDi di di\nDown in me I didn't know they even men are\nJust a little gas price you would never do that ... I'm ... but I Do want go hiking you will be All right Alabama oh\nShe was a gift is equally and weak\nIf she's a brave exit you're lugging back of\nThe the actually in la\nLa di di di\nDi di di\nDown man those\nTouch me you know I mean do they use the man show\nI ended up with demand has been known to blown Janine didn't touch me into I Would then say oh I just I get to them about even think oh I\n\nEvery other man next to Jim ... de ...\n... ... he's like a human brain any up so I Do you have an\nFor me\nNa\nWere more you can try battled for free download the upper tax to both job to forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for aid for aid for eight\nOr has no co pay trauma diary of law do diary\nBrush off again I don't get it is there something wrong with the way I waive elbow rent elbow rent that little Basset\nGet everyone peace of mind when I protect their homes or progressive jumping for joy when I walked by\nSaving up Richard Seventy percent or ... what do you go to home in order for me\nKnow Tim gradually insurance company and affiliates just got to be a little stricter situations\nFor a limited time at the gym or you can get to complete pairs of glasses brains lenses the works for just forty nine dollars on single vision glasses and eighty nine dollars on progressive\nThat's a good deal on but we all for that pricing on over five hundred grand which makes it a great deal a great deal better than the other guy right now by you complete ... single vision glasses purchased forty nine dollars or two pairs of progress as for only eighty nine dollars can work we're here to help you ... by the door detailed offered by November ten\nThousand a no star with low because it loews proceed big on the supplies they use smokes right now she's even more thought concrete mix\nNo certain percent off when you buy in bulk for say ... percent on eligible purchases every day when you use your Los business credit account to stop by or visit most for ... for detail so pro now that you know start with low\nMinimum purchase required selection varies by location credit offers up their credit brutal Kathy combined with other credit offers exclusions while us on like\nI don't drink I don't smoke\nAnd her run three miles a day\nI just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAt our W J Barnabas hell\nWe offered the very latest in comprehensive breast health services\nIncluding mammograms greedy mammograms genetic testing and breast surgery\nNot to mention peace of mind\nAnd with breast health centers located throughout New Jersey finding us is simple\nTo me the most of breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash mammal\nMaking excuses is easy\nOur WG burn it was hell\nLet's be breast cancer together\nLet's be healthy together\nCooling fingers again they need your voice where the delta boys ...\nEmmy Award winning director Curtis borough invites you to join the boy once in a larger we'd been owned veterans'\nDay November ... but the new left on Veterans Memorial coliseum joy Grammy\nAward winning artist as a kind of water in London adult thing as a member of the five thousand boys ... daughter started require dot com or call nicer to three for three to six people information it's a sign of\nThey will be providing Roger transportation to view this as well as providing most for our choir members for more information about rehearsal location more\nGoing he starts we require\nDot com or call nine seven three for three fifty to sixty two promoter formation as a sign up if you can sing they want you to join a gym live a little boy just to give up all these sorts of she starts to require dot\nCom or called most of the three sports arena sixty sixty two\nWe're making the sign up\nThursday November versus wouldn't royalty comedy in L O L comedy on earth that the\nSpecial mellow well comedy out of black high up\nThere at the party and the get again nobody was thirty six three and watch the arteries that go Chris Rock Tracy Morgan Nick Cannon Cheryl Underwood Jim wit lead the article and more celebrities all in one night the formal Atari vent with music by ... while it might be using a DJ gilly bought tickets to rebuild bright dot\nCom or called them if I Won six nine six seven thirty twenty three\nFive or six nine six seven thirty twenty three\nIf you have really big gaps in cracks to fill the Home Depot was really big news introducing do lock type type phone big gaps insulating foam seal it with four times the density of conventional spray for it'll still gaps up to three inches in laws and around pipes in one path so big gaps are no longer a big problem I\nSee what would you address moisture and pass with rock type type phobic gaps exclusively the Home Depot or saving or doing your only store for details\nAnd you know an ad from to save money on car insurance when you bundle home an auto with\nProgressive in other words if money don't buy those expensive coffees every morning you know and then you can save up for a I don't know really nice dress shirt just saying it's great that you feel comfortable here at work but you know an adult walking\nProgressive city from becoming your parents but we can save your money when you go home and all of course actually insurance companies really as other insurers just come knocking on a bottle stricter situations\nNeed higher stores on sale JC penny style of value for all\nBracing is the first ... any fire you Sunday Morning starting at seven thirty AM radio and oh three nine\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] oh\nShe lumps don't like the way she told her she turns me off with the ... regarding you know don't compare to the next to her and I'm playing or not you're\nTo protect children the burger in the world series or not\nBut what the ... and that's not going to\nSomewhere\nSisters from ... to do\nTo see my role in\nThe way she went\nTo\nWas\nGoing to want to lose it to see about being a visible main drag and when you come to making her during the Greeks she'll be waiting for the ... like a cold enough to what you're you're right or it's not meant to be reached endemic on her I said you're the guy she plans to expenses where she\n[noise]\n[noise]\nJust do it live from New York and the higher rock hotel casino Atlantic City\nWhere they put you to pick up one thousand\nEnvy Enron bill new joy Nick from our\n... five eight one now that I Can't believe I N nine five one now what's actually back to you and your data and messaging ha it's no one thousand dollar fast money key word on W. Andy yeah\nWas one oh three in the papers [noise]\nHe ... he\nSays on\nOne thing if you got to say my name was on there and you're not going to show them\nKnow that then they get paid a ... day window that gave me\nIn and give back you know not\nOnly will never\nIn my unit\nIn July matter and yeah I Know I got a\n\n\nLot of things you\nKnow no not at the end you know and\nI'm I'm the same time\nYou know and\nThen painted games\nThat in a in a manner you know yeah\n\nI Know that as well I don't ask me why\nMe why\n\nMe let's say the medicine in jazz\nMan a man and it was the ... was trying to figure out does Donald Trump have the right to chat or I had the power to change the constitution aged now what he's trying to do basically is Tom birthright citizenship in other words if you were born in this country but your your parents were not\nDue to not get to stay in all those people who are now calling themselves American citizen ... by the parents they they take that back I can dig dug in all of them there and drunk yeah dad my line is\nWhat I Am bigger best Donald himself whatever they are too yeah but people are really nervous about it you know because of course he's really touting the fact that he does have the ability not\nHad the idea of how he did a nine to teach at executive signed the constitution and what your nominee rather than would have done that by now I get an edge here but he thinks that you know he was on the right path done the right thing\nTo try and get not just China but also for the midterm China yeah literally is in\nTheir purse or anyway are also trying to I Would not really aware of this but apparently there's a huge controversy over a pool on the tenth of the guys watching the Indian yeah the ... guy so they were saying you've written out of the show because I thought it was I guess it was way too much controversy and very stereotypical of you know in the and people\nAre so I guess there was a huge fierce debate back\nAnd forth and now you have a original writer of the Simpson thing that that's not actually happening we are going to keep them\nIn but then you have some other writers and saying we're actually trying to write a manuscript why would they write a manuscript is dope and everybody just ... it's\nFantasy every well what they say is if you are a show about cultural commentary and you are too afraid to comment on the culture especially when it's a component of the culture that you have a hand in creative than you are show about how it is that's right after the writers that some of the right of innocent that's right I\nAgree which I actually agree I mean so hopefully I Will stay around\nAnyway of Bit.ly trending a this was good news able to do that it's working out for a documentary much why I Am so here right kidding and the families actually given her you know full access to all of his long games and all of this yes live in a music that he's had a ball and everything that we had our budget is\nShe has the ability to have to look through it be chat wow I think that's often we'll go to but that's\nAll right you got to know from the G D second that'll be about Fifteen minutes in the Daily Show and we haven't that\nWould think that he didn't even\n\nHear any bark off for a limited time cannot Lancome holiday beauty vox worth four hundred and twenty two dollars for only sixty five dollars and ... he's with any thirty five dollar long comfort you enjoy canned food I did essential for the perfect holiday clout flexing you use activating Jennifer ... ice cream and endorsing\nShould not far at all in a luxury travel case\nTo leave and the ones you're getting\nIs at my company the gift definition\nIs your job trucking in life you wake up you can do something from ancient technology I Know what you think you were done none of metrics aren't guy or gal no problem no excuses\nNot rocket science it's my computer career if you don't absolutely love what you're doing go to mark computer career dot edu and take the free valuation today you could start your new life as an IT pro in his little was four months my computer career dot edu my computer career\nFor a limited time at work you can get to complete pairs of glasses brains lenses that works for just forty nine dollars on single making ... an eighty nine dollars on progressive\nThat's a good deal on but we all for that I think on over five hundred grand which makes it a great deal a great deal better than the other guy right now by to complete path to think of and glasses forty nine dollars or two pairs of progress as for only eighty nine dollars can work where here to help you that much ... by the daughter detailed offered by November ten\nDay right to make like please not talk to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they use double the number one selling language learning up and Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was bad at languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within a week\nI was amazed that I could start having real life conversation right away it was so fast now I'm speaking Spanish\nNo wonder battle is the number one selling language learning up in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battled for free download the app or text book job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for aid for aid for eight\nHigh it's Jamie progressive employee of the month to month\nHi Jamie Jamie Jamie I just had a new idea first on what the name your prices will so when it's like\nTell us what you want to pay ... trombone was bought by ... and you say well before garbage option to pick your budget then we just all these fingers now require those statements coming out have it's coming at you know maybe anyway for your practice tonight I knew the precursor casualty\nInsurance company and if it like expression coverage much limited by state law\n... know start with low because Los pro save on tools they rely on the job done snow\nGet up to thirty five percent all sorts of all Howard Rosen accessories including this all ten to twenty vote Portland combo cat now five hundred and twenty nine dollars that's three hundred and twenty dollars off plus say five percent on eligible purchases every day when you use your Los business credit account\nSo profound that you know start with low Walter fell through a lot more widespread it off the subject credit approval can be fined credit offers exclusions while us on the\nRadio three night is home to heck and secular really unhealthy seventies it's New York city's premier venue to catch breathtaking performances exclusive interviews and lots of cats for music and entertain the\nBiggest stars slick H H stage Seventeen and watch the doctor for the past performances side and follow at age eight states Seventy on Facebook Instagram and Twitter to when you're waiting to our next exclusively to join the conversation by using hashtags\nH H stage Seventeen\nExcitement worldwide reviews or let them know the war\nWas loosely and Norma Jean formerly a legendary lady this guy and the whole exposure harp halted\nBetrayed him first choice for love or stage in honor of our military veterans Saturday Night live a third Seventy ensures ... for the performing arts in the Bronx but more able to get contracts for the performing arts center where they now have to be wrong eighty eight thirty three or leaving food diet or\nHow old is your water heater if it's been around for more than ten years it's been around too long the Home Depot is here to help with Rene about the number one water heater branded America\nGet ten percent off of ... water your when you have it installed by the Home Depot local license to short prose Italy saying goodbye easy call one eight hundred Home Depot to get started the green only available at the Home Depot or saving for doing delta or the twenty first ... months are the restrictions apply for license and worse\nOh people that are complex warrior which do\nA better life with Dr Sanjay Gupta if you want to be rich\nOn Dr subject to being in the medical correspond\nYou want to make a good yes as to how much money someone make the most important thing to know other occupation their education their ZIP Code and their gender in that order after that according to a new study at a Temple University there is one personality traits they can\nAccurately predict a person's income the ability to delayed gratification the study's lead authors that if you want your child to grow up to earn a good salary considering stealing and then the importance of passing on smaller immediate reward paper larger ones that they have to wait for\n[noise]\n[noise]\nShe just standing\n\nIn\nLine up\nWe we all around [noise]\n\n\n[noise]\n\n[noise] [noise] [noise] [noise]\n\n[noise]\n\n[noise]\nWe can [noise] [noise] [noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\nNever done\nMary J blind reminiscent Kanye West of the mouth again how come every time I hear from going to let you know with these days I find myself holding my breath because I don't know what you're trying to what's going to show up is it the one who said this lady was a joy is it the one who said he wanted to buy the thirty the ... the one to talk about a ... blanket out in the superhero\nIs the one who now says that he wants to distance himself a policy that back except that he made sure to to the gel DMV then it wasn't about Donald Trump it was about a candidate Owens and the elected in ...\n... uh uh I understand the Kanye West may be mentally ill like any may believe the things that he saying I just want to know what Kanye is going to stand up what's ... what's going to show up 'cause one peel can't deal with all the person that\nI get that he's mentally ill I get that he's having a nurse ... break down and I may understand he may be calling up a hill but that help is taking on the toys don't right now\nIn America people are dying because of the things they are hearing now I Can't say that somebody's calling them to action I Can't say some of the things that they're hearing are activating them in some way\nYou had a president who said that he was a natural if he talked about global it what what did the man was shot up a that's in a guy said he was a ... and he referred to the Jews and go but\nWhat does science do the guy who made all those bombs you specifically targeted people who believe will globally and people who believe what that may have enemy and that's where you support\nYou you took pains to make sure that you just as yourself from the ... not out of the ... but not Donald Trump and he's the one who was doing that\nIs driving this country that way even right now he's got people believe with what what what are the man who shot to the to the guy he think that the Jewish people are now bringing in illegal immigrants\nThat are going to replace white people when they were talking about Charlottesville you will not replace those who do you think they were talking to people are dying well you mentioned around\nPeople that die or what your normalizing hatred and racism and I don't give a damn how crazy you are\nI don't care how ... I Can't I Can't forgive you let's say some of the things you say but when you make crazy look normal when you make hatred look normal I've got no use for you and I don't care what anybody you can give them chair 'cause if you want to do what he's complicit in the way people are seeing this as normal\nIt is not normal for people to hear these things listen I understand what it's like to be great to live by my great uncle he he he thought he was a superhero now the fire truck\nMiddle ear illness explains you it does not excuse you\nKanye West is normalizing hatred and bigotry oh on the scale that it's on ... I've never seen it people\nWhether he's right or wrong or ... or not he is having a hay and\nThe people looking at this uh certain\nPeople feeling a certain way about\nThat you could be as crazy as you want\nYou can be as mentally ill as you walk and I understand what it's like and I understand all those things going on in your mind when you\nActivate knocking religion in this level of hatred and but I don't care what your problem [noise] now it's a\nLittle over ... and we got the ... report come every Fifteen minutes to be on your\nA mystery from time to be the pan and all mumble added to the long run a stay at home\nTalking contradict you on a little crazy little evidence that oh around it and oh I don't know in Santa Ana trial out right now I don't know and a mine and how old you are here and they just\nMe me\nMe me\nMe me and\nI don't\n[noise] [noise]\n\n\n[noise]\n[noise]\nI remember when you call me where what would they are all out and buy you\n... new J. lo lo resources low level doll I knew\nI remember when I when I got a lot more often you rated me going\nBut even back travel to divide all I was [noise]\n[noise]\n[noise] I\nThe jazz dance we report on the DL you can\nGo instead of doing my job to report it is Halloween work that we've got some great musical parity they're opening rather play those and said how about that [noise]\nOh the onus on how you know we may be Jesus how\nCan you back on that but I Know I don't know I really don't know why I Know and I'm like oh no no no no no no\nJohn Randall bridge or a doctor to get a little complicated you know what I have a brick toppled would you not really\nReady you know what I Want to bring you 'cause you're kind of you know was mad about that one of your wall ball mobile will be worth remembering I Know that we're\nPeople's just tired of each family ... [laughter]\n\n[noise] [noise]\n[noise] [noise]\nSo\nWhat do you think G L now eight seven seven to two twenty ... twenty six that one eight seven seven two for two to four which is\nUsually\n\n\n\n\nAnd then you should never do and I'm John\n\nDonvan will be with you but I'm a gym\nIn because they would have been an avid fan\n\nI Am\nKind of turned\nMe\nOn 'em they\nBelieve in\nThem I\n\nMean my mom and the\nCampaign\nMom I'm I'll be done I don't know\nMan told me\nKnow men and citizens to leave China springs and then\nI read and\nRead in China I don't know China\nTown and the dynamic\nIn me\nOn\nAnd\nThey may\n\nNot\nBe the main [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\nJerry we belong together so Kanye West and saying that he's out of the policy now he did not denounces\nRelationship with ... with the with the Donald Trump me just kinda like Ryan is only the ...\nAnd he went to great lengths to actually reach out to ... to make sure that people knew\nThat he was not mentioning Trump at All right and he did that would make America great out here and tell us of course came through his aid and said you know I Want to correct this this is a lie she said they were completely\nRight to feel use in that regard add as I have done personally I Would like to publicly apologized to him for any undue stress so hang\nHe wasn't talking about him he was talking about her about her he wasn't he didn't feel like Donald Trump to use them right you feel like a felt like Canada Owens used them but he is still a favor Donald Trump ... do you believe that there was a truly at a change of heart because it doesn't seem like it is\nTo me and by the way his tweet was my eyes are now wide open and now ... I've been used it spread messages I don't believe like what are distancing myself from politics and completely ... and ... that's what I don't want to\nHe wants to what what what he wants he does the same thing that Trump to where they dance between the drought right I'm not saying that I didn't save it do you think the ... the year I Try and have it both ways you think he's really sincere or the drawn out above where'd you go to our social media black on did they lose yes\nMegan from Kansas City said I think he's trying to how to\nDo both what makes it for doing that many personality well All right we're waiting for your call All right so do you think the ... here about one at a distance cells but positive or is he trying to add it both ways eight seven seven two for two to four to six ... more of your calls at about five minutes on the show\nYou how long after listening to the G L E leash yeah\nHey Jasmine here so glad we can have the girl child got something to ask you\nThis ever happened to you you're laughing with a girlfriend and the next thing you know you pay well just a little\nYou're Patti ladder might work but I can tell you right now it won't work as well as always disagree liners and I bet you didn't even know you had a better option but you do because always a tree to have this super observant cord that turn liquid and older to jail so in a lot more to keep you feeling pressure and dryer so\nI mean you could try to start laughing or you could\nYou know an ad from um\n[noise] save money on your car insurance by bundling home in auto with progressive [noise] hey is this call in here that it doesn't bother me doesn't bother me advantage is just kinda curious because um if it's the equipment or something that that's fine it's just what kind of chilly\nProgressive city from becoming your parents but we can't save your money when you want all across the country controls companies other insurers just could not be able to little stricter situations\nFor limited mission work you can get to complete pairs of glasses brains lenses that works for just forty nine dollars on single they can ... an eighty nine dollars on progressive\nThat's a good deal but we all for that I think on over five hundred grand which makes it a great deal a great deal better than the other guy\nRight now by to complete path to think of and glasses forty nine dollars or two pairs of progressive for only eighty nine dollars can work where here to help you some answers why didn't order detailed offered by November ten\n... know start with low because Los pro save on tools they rely on the job done\nNow get up a thirty five percent all sorts of all Howard tools and accessories including the walk ten to twenty vote Portland combo care now five hundred and twenty nine dollars that's three hundred and twenty dollars off say five percent on eligible purchases every day when you use your Los business credit account\nSo profound or you know start with will also fell through a lot more widespread it off the subject credit approval can be fined credit offers exclusions while us on\nI don't drink I don't smoke\nHer run three miles a day\nI just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAt our W J Barnabas hell\nWe offered the very latest in comprehensive breast health services\nIncluding mammograms reading mammograms genetic testing and breast surgery\nNot to mention peace of mind\nAnd with breast health centers located throughout New Jersey\nFinding is is simple\nTo me the most of breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash mammal\nMaking excuses is easy\nOur W tape aren't at his house\nSeat breast cancer together\nHealthy together\nThursday November ... royalty comedy and Ella will comedy honors lithium mellow will comedy out as black high\nUp there at the party and the getting is Seventy ... sixty and watch the arteries that go Chris Rock Tracy Morgan beginning Cheryl into a gym Whitley do totally more celebrities all in one night due to the formal Atari then with music by ... might need to be a DJ ... bright dot\nCom or caused them if I Won six nine six seven thirty twenty three to\nFive or six six seven thirty twenty three\nThree thirty thirty eight hundred by two three thirty thirty Saturday radio one of the reason last Saturday Saturday every last Saturday and I'm a ... ad\nDean Kelly change the party town in Honolulu is opening a tennis three\nLadies free till eleven last Saturday the Harlem aids in every last Saturday in the month starting Saturday September twenty nine what chop it up a little bit alone have oh school good time\nIn my local radio one oh three nine last Saturday at missed in Harlem is on the way I look at how am I going to Tampa last Saturday leave\nFrom the station and what that New York by radio one oh three now you know my\nThe prior to my job and John\nOn\nMy bed with me started to get me from Iowa when all the time when\nIt was a whole New York or\nI wasn't scared of him anyway until I noticed those runs the machine and that was posted there had been a nightmare on my street\n[noise]\n\n[noise]\n[noise] whatever [noise]\nThat was badly Jeff in the fresh prince nightmare on my street [noise] um\nSo the question they were happy Halloween everybody\nThough is it all the way it is a tale buy a new insane everybody and\nDo you think that he's being sincere you'd think that he's tried that before where\nI think that really you know he'd he'd he needs help but basically is what you got is the same thing when you saw on Django in that character that a little jak some way of the house the euro do that ... he needs help\n[noise] he's ... he's a damn boat real digging get worn a war if you don't get no more risk is like you won the most down food that well known in my life even even the witness and everything going along with all this stuff about proper and everything I mean it it completely gutless\nHeartless but they keep doing it but kitchen if you want to get to eat it give you just be yourself [noise]\nLow you know\nCall you a merry little bit crazy man you can't believe it was very a shirt you know um people that boy crazy you know you all were you know to you got to only pay you so what you were to go into about what can you say\nShow me a black reasonable a boat or do they support those up in a a\nYou know they may be a cart that when they say in ... the ... he said like show me just a regular too that you were actually respect that as a reasonable argument because there is a great\nIdea what kind of require I'm really I'm I'm pissed off that you know anybody in any political position would even take a meeting with this guy as if he speaks for me or anybody else of color and the fact that he says oh let me think\nDo you remember when he was talking about uh when he was trying to clarify himself when he was talking about uh how the thirteenth amendment should be you know a stripped away and he said well wait a second let me go do some research why don't you think ... what would it be did he wouldn't be acceptable and then after all of this that the ... and he said I support\nThose who risked their lives and serve and protect us and I support holding\nPeople who misused their power accountable\nHe's ... he's the same he pointed that he speaks for either that or or his personality that David ... are going to the bone [noise] we're we're taking another phone call [noise] so do you think\nThat Kanye West is being a fussy or they try to have it\nBoth ways [laughter] I don't it doesn't matter to me I'm I'm done yeah however there but I'm downtown you could you ... and and you could keep supportive don't explain him to me don't explain it to me don't tell me how I should do tell me what to do I'm watching people dying\nAnd get caged up and called all kinds of may\nExplain it to ... ... I just want to know what kind of showing up that's all\nThe genius was against the third day of the ... the one needs to read the one of the superhero [noise]\nWant us to talk about how to play [noise] All right this guy and\nSo we're asking ah do you think he visits ear or is he gets a day or if they're there but boy the AIDS epidemic\nTwo for two to four to six ... little do little more of your calls in about two minutes to get to the ...\nSo what do you think G L now eight seven seven two for two twenty four twenty six nice we find\nGreat deals at Walgreens like buy one get\nOne free on hundreds of vitamins and supplements the healthy stay healthy get ready for them big game wouldn't see now to diamond omen regularly nine Ninety nine now just by Ninety nine card living for a sweet deal select Hershey candy bars just two for one dollar with card and you get great deals on the essential you need right here at your neighborhood Walgreen\nWalgreens trusted since Nineteen oh one multiplied land restrictions that I listen to ... seats are for details\nYou're washing machine died a puddle forms on the floor sending you run into the home improvement store and where you see the thing was steal machine of your dreams permitted you're glad you're old washer died and Jill Price of the new one\nAnd now you die a little don't let those big box retailers leak on your dreams swing by rent or go to rent under dot com and gets a big brands you want for small payment you can afford mall without present renaissance big brands\nToday with my life is not talked to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they use babble the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was the added languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within a week\nI was amazed that I could start having real life conversation right away because it's so fast now I'm speaking Spanish\nNo wonder battle is the number one selling language learning up in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try babble for free download the app or tax vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. till for aid for aid for eight\nAnd you know an ad from to save money on car insurance when you bundle home an auto with progressive\nGotcha because of what is a good wow where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] so that's not the nearest solid stuff\nProgressive view from becoming your parents but we can save your money when you go home and of course actually insurance company fill your other insurers just coming off a little stricter situations\nFor limited haven't mentioned where you can get to complete pairs of glasses brains lenses that works for just forty nine dollars on single making a lot and and eighty nine dollars on progressive\nThat's a good deal on but we all for that I think on over five hundred grand which makes it a great deal a great deal better than the other guy\nRight now by to complete package single they can glasses for forty nine dollars are two pairs of progress as for only eighty nine dollars can work where here to help you stomach so by the north of detailed offered by November ten\n... know start with low because at Los pro save on tools they rely on a job jobs\nNow get up to thirty five percent off so I said Well Howard tools and accessories including the dogs tend to twenty vote Portland combo cat now five hundred and twenty nine dollars that's three hundred and twenty dollars off plus save five percent of eligible purchases every day when you use your lows business credit account\nSo profound or you know start with low walled off ... off the widespread it off or something credit approval can't be fine without a credit offers explosions while us on [noise]\nI don't drink I don't smoke\nHer run three miles a day\nI just had a complete physical my family has no history of breast cancer\nCurious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAt our W J Barnabas hell\nWe offered the very latest and comprehensive breast health services\nIncluding mammograms ... grams genetic testing and breast surgery [noise]\nNot to mention peace of mind\nAnd with breast health centers located throughout New Jersey [noise]\nFinding is simple\nTo me the most of breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash mammal\nMaking excuses is easy [noise]\nAre W J Barnabas hell\nLet's be breast cancer together\nLet's be together\nHey honey take a look at this resorts world casino in Queens is offering rewards members a chance to earn a free that many they package where members right oh yeah yeah we joined last year we can fly right from islip airport's it's been a long weekend in the Bahamas oh let's go we can use a getaway\nOr in a free beer many bombers vacation package not a rewards member signed up today and start packing resorts casino and wipe the slate and get away\nAnd you don't have to go home brought home cooking visit read read Dr three six he said well what what has three up yeah we're talking on a bed the soul and Caribbean ... golden fried chicken North Carolina barbecue with jerk chicken short red catfish\nNew York times that pool bread GOP wedding downhill boat Mac and cheese collar Yan homemade desert like chocolate cake and New York number one wait at each cobbler you'll have to go home for home cooking Red Bull read what's one tenth street uptown\nTo you on the on the wrong\nTime\nAnd they um you know\nI'm like my lead like a game with a friend not smoke and let the mundane manufacturing before that was what I make my whole\nOr you know and then\nThey found any like at least not yet but that ... which is if you're going to be the lead me by the heat the wind you know oddly needed the malls you know what your microbes\nMatty on a ... year round town you can go\nAnd hang in na\nNa na na ve hey maybe not\n\nMaybe a name yet ha ha\nRadio not rent or buy a non la la\nMama vulnerable now before she don't love you draw the line\nFrom la where mommy will not run for one number on the border like I'm Josh just\nLay on you know\nDrawing them\nHang\nOn young you know a lot of\nBang you live on that\nKnow what I'm saying and now All right\nDown to the to the radio or not so the question we're asking today um\nOr do you think that you made a statement where he says he's stepping away about did you feel like he was being used at the same time uh making sure that the in the city when talking about Donald Trump\nRight making sure that he call teams and yet they didn't want to talk about the other\nDay that they were all kind of what it was just trying to uh speaking of its fan base now he knows a lot of explaining to the supporting Trump and you can start an extra there's always doing\n... is he wants it both ways doesn't know how to get it both ways it's a very confused human being\nIs probably here so ... and I don't want to just beating down but he really needs to do\nThey can't see the right you and the prime example of what you get right here\nWhat is your thought about her credit for the cap on the ... because it as well that boy\nOr a key a key or a neighbor to get news or I Try to be stored you don't Halloween and that sort of we try what do you think I think he's in the early wrong that's what I think and I think probably ... to ...\nI Can't do a little bit and I had it both ways right right I work this back to the sincerely\nWrong and tomorrow there'll be another opinion right and you didn't use in the stage in the platform and amplifying his bipolar message\nYeah the one who doesn't bode did that they have a level of civic respond ... you know this is my uncle uh\nMicrowave younger but he was a superhero to really change his mind and that was a fire truck and\nWhat's the freedom of choice [laughter] I get it\nDon't explain to meet somebody great you have to be mentally you have to be mentally ill to do the things you do you have to be mentally ill are they a lot of the mentally ill people are hearing you\nAnd being activated by you you got to understand I'm sure that's I was mentally ill I'm sure to do the shadow of the ... the synagogue with mentally ill I'm sure the guy that data so it was so why do you think you don't have a level of responsibility to my your word well he worried that\nOtherwise they wouldn't have got I support people who ... who are accountable for you know the misuse of power so we understand the concept of it he doesn't realize that he is the issue\nI lay the gym and so we're asking what do you think they just see are going to have it both ways a tend to have a two for two to four to six more because we have a debate right now is John Stockton boys to me you break it up but they\nWant to thank layer Lionel Richie of credit\nShow and so\nI don't\nShop and\nRunning this\nOn and\nShe only known\nI'm shopping\n\n\nThat was John Stockton I'm feeling a little some I'm Glad to see the man yeah now\nIs he now shot in the dark skinned dark well yeah he's\nNot wind up getting now show as well to me and then they\nLook like any yeah ... they have in the mail [laughter] All right\nSo do you think the ... what is the CEO or the or just to try to play one or it gets to me\nSaying come on your plate and everybody you know he claims that show that shot his wife founded on yeah and that's why it's kind of stuff that's not what he thinks he's a genius and Trump thinks he's a genius\nI I'm just I'm just still kind of\nI I don't understand the dad as yet he that's kind of ethical we all went on the ever end up that they'll let me just a waste of time to even think about the well\nHey listen I'm all for reasonable are\nI I can understand people having a different idi allowed to go back and\nAnd I promise you I Love I Love the bronco momma I loved it will be going out that they the politically spouse if they do and they did a lot of things I didn't like\nBut if they acted like this I Would distance myself and right and I would say I was doing I wouldn't sit by while they do is scaring be talking about we're going to rewrite the constitution so that we don't have people that are born\nHere in the constitution or ... it was emitted in the ... it was part of the uh reconstruct it was given to us and like anything give it to black\nPeople people didn't like there were rights as the likely will can voting right act like people who use it more\nRight affirmative action was like we were white women usable try their best listen I'm not ... and it just because that kind of beer an animated activating people when you say almost any troops down to the border\nBut today's millennium and it was the one and only DJ which it for\nThe guys now at at the shop and LeBron James\nAnd yeah yeah yeah we're all the athletes are getting ... getting hurt and yet if it was a white woman and that it always was I'd like to sell insurance so\nThere's that company complex than that complex on in Long Beach I was actually in the ...\nUm they ah I probably do HBO and they're going to recreate a shop in complex on and they're getting people free care type in line up and all that by that professional or like a brand elaborate and you know that live around not doing what I like the library or\nI guess barbers they're coming they're and they're going to get the ... by just to add up there and there are they all your bar because you know yeah it's like that I don't it's like what she would be like but\nIt look as you know when you go to a barber shop is always wanted to share it empty yeah that could be a fad Barbara\nHarris in the end you know no one's ever do that it's time to give free are good I Wonder how do you yeah\nNever so but now she cleaning the couponing and shiny maybe and he was now that I don't know I asked him going to do that either that or I don't use I might be there for the ones I even if you're going to come on I did you download the ask\n'em and sign up though I didn't have that they're getting their recreating shops all that ... that has been your millennial many of\nThe um leaders are trying to get rid of that tape to pay for the ticket but like I did did you go\nAll right we've got to be talking to a actor director Spike Lee that's coming out of out of that they managed to the ... just\nAfter ... into the details you share\nThis week ... buy one get one on hundreds of vitamins and supplements plus sixteen ounce Lou Diamond almost just five nine and I would start\nToday with my life please not talked to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you remember what you've learned\nI always thought I was the added languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within weeks\nI was amazed that I could start having real life conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning up in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battle for free download the app or tax vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for eight for aid for eight\nHi Jamie progress is number one number two employees leave a message\nOK Jamie Jamie [noise] this is your daily pep talk I Know it's been rough going ever since people found out about your archipelago group Matt harmony but you will bounce back I mean you're the guy always helping people find coverage options with an enterprise tool it should be you know get out there that high note and take\nMatt harmony all the way to national this\nPrecursor casualty insurance company enough at least partially coverage match limited by state law\nFor a limited mission where you can get to complete pairs of glasses rains Landon that works for just forty nine dollars on single vacant lot has an eighty nine dollars on progressive\nThat's a good deal on but we all for that I think on over five hundred ... which makes it a great deal a great deal better than the other guy right now by to complete package single they can glass inspections forty nine dollars are to pass a progressive for only eighty nine dollars can work where here to help heal damage by the north of detailed offered by November can\nPose a no start with low because Los pro save on tools they rely on the job done\nNow get up to thirty five percent all sorts of all Howard Wilson accessories including the wall and tool twenty vote Portland combo cat now five hundred and twenty nine dollars that's three hundred and twenty dollars off plus save five percent of eligible purchases every day when you use your Los business credit account\nSo profound that you know start with low Waltham fell through a lot more widespread it offers up and credit approval can't be fine with having credit offering solutions while us on\nWhen it comes to your health you deserve the best Hackensack Meridian hell has for hospitals ranked a New Jersey's top ten by US News World Report more than any other network and we're in the top ten percent nationally and then nothing special from Hackensack\nAnd Jersey Shore University Medical center to reverse reverting back medical centers expect quality care and compassion learn more and Hackensack already and helped out or flashing us\nThree justifiable it's six nine six seven thirty twenty three I was facing foreclosure desperate for help pay the Fifteen hundred dollars and never got the help they promised don't let the fear\nOf losing your home make you the victim of a loan modification scam remember these facts to protect yourself it's illegal for most companies to charge fees and advance no matter how small no company can guarantee that can modify your loan or stop a foreclosure\nAnd never send your mortgage payment to anyone but your lender\nThe easiest way to avoid a scam don't pay for a loan modification get free help promote approved counseling agency now\nTo learn more reporters scam or find out if you've been a victim call one eight eight eight nine nine five hope or visit loan scam alert dot org that's one eight eight eight nine nine five for six seven three and loan scam alert dot org\nNotice on the fact\nThat you have you envy in Rockville New York's best makes them want to be a junior this taste [noise]\n\n\nI ... a gentleman remember if you are in New York I Will be there tomorrow Friday Saturday\nAnd Sunday I'm very excited my book out not to get shot other by some white people just received a good humor veteran rain or humor a nomination for the best\nI got an adult when you go to good do you go to human like ice cream and I'm Sorry good\nRead okay um is that you go to a good read and\nAnd you've been out there you know all these other people's shuttling jive and even with the baby I see I see I see you\nYou you remember a long time ago we were I'll never forget as I I don't get a chance to tell the story like we're doing the kings of comedy and I was telling your system as it may you got to you got it you should just be who you are you had this long conversation would make is that you know I wasn't necessarily I like coffee and I never forgot and I appreciate what you do if they\nKnow mom you know know BS I saw so I just want to share with you know so that was about maybe\nYou've been doing this for a long time you you you want to do that at ease and he said Cade if every day in the game\n[noise] great films and not one sexual harassment that's all I'm not one thing you have to say [laughter] she's got to have it but not in court that was great I left the company that um yeah one\nOf the things I'm always said about you and like the ... you know like when they asked me about my creative influence is one of them would have been more of a game because he was able to tell a story the music that was so demonstrative that we're so in Delhi being printed I might've even yes one of the song now\nAt fifty years later when my kids kids will be able to sing a song and I think you do are like that and so on\nThe deck you indefinitely decide what's going on work today off [laughter]\nAnd I'm\nNot saying that to put myself up to do with me but great part never gets old yeah that's that's a great art does whether it's a novel play a song tape and\nWhat do you think of all these uh like Everytime you turn around\nThere's a new allegations of of of of of sexual impropriety like I used to years ago I used to work for three decades ago I used to work at a corporate America I met this girl I really liked her a lot and I I was a supervisor I got her number are\nAsked her and Thirty years later and three kids later I realized that might have had sexually harass my wife and I I keep expecting lawyer already shorter my liberal but I think\nI think that they they tend to put all those things in one basket elected like hobby wise thing at the same as Louis began it like even in murder there and get a great age of the murder that great of assault and sexual acts all around it as\nWell I think you have a good point but now it's like a wave and people are just being caught up in it and and now and that's not to say I don't want people you know Brittany ... will bombs but stuff like that\nWomen are afflicted muscles as they should ... and they're saying enough is enough yeah and women have to be\nRespected I mean this is not you know that stuff went on you know Ozzie and Harriet and leave it to beaver days now you know Eisenhower so this is a different day and yeah men we have to conduct ourselves differently or there'll be consequences yeah\nI'll sell them I don't know if you don't have that and I said to me and my wife got to care for that that the truth [laughter] in that area is likely we got to have ... document let me do it [noise]\nAll right but he also mix is going to be experts in about twenty minutes we're going to have another meeting in my book club a comedian Brandon Patrick on the ... [noise]\nFruits come out in the afternoon\nStore is called the ugly truth about Tom sure it'd be kind of given up on your family fiber by buying a Tom sure you need my help hello I'm ... McDowell CEO and founder of Wesley financial group two years ago I started helping folks canceled their timeshare contracts and in the process started what's now called\nThe Tom shirt cancellation industry Tom shares the only thing that you can buy that you can't tell me how much is going to cost or whether it's going to end when you buy time shirt you give them a blank check to fill out any amount they want for annual\nMaintenance and assessment face sound crazy\nThe crazy thing is there's never ends even when you die your families\nNow going to be stuck with this burden stopping insanity to stay calm office now I'll guarantee if we can't answer your timeshare contract you'll pay nothing\nCall for your free information kid eight and ready to three fifty by forty four that's eight hundred eighty three thirty five forty four\nHow old is your water heater if it's been around for more than ten years it's been around to the Home Depot is here to help with Rene about the number one water heater brand in America\nGet ten percent off of ... water your when you have it installed by the Home Depot local license to short prose\nIt'll make saying goodbye easy call one eight hundred Home Depot to get started ringing only available at the Home Depot or saving for doing that with her the twenty first ... months are the restrictions apply for license a mercy on people to accomplish more here and so\nI'm now a trauma diary of long skinny diary\nBrush off again I don't get it is there something wrong with the way I waive although although I Want that little Basset\nGet everyone peace of mind when they protect their homes their progressive jumping for joy when I walked by\nSaving averages Seventy percent the car insurance when you're going to home an auto through progressive me\nNo attempt progressive casualty insurance company and affiliates discounts not available at all states are situations\nFor limited haven't mentioned where you can get to complete pairs of glasses brains lenses that works for just forty nine dollars on single making a lot has an eighty nine dollars on progressive\nThat's a good deal on but we are for that type thing on over five hundred friends which makes it a great deal a great deal better than the other guy right now to complete patent single they can go out and in fact has forty nine dollars are two packs of progress as for only eighty nine dollars can work where here to help you that much ... by the daughter detailed offered by Democrat\n... know start with low because at Los pro save on tools they rely on the job done\nNow get up to thirty five percent also like the wall power tools and accessories including the walk ten to twenty vote Portland combo cat now five hundred and twenty nine dollars that's three hundred and twenty dollars off plus save five percent on eligible purchases every day when you use your Los business credit account\nSo profound that you know start with low Walter fell through a lot more widespread it offers up and credit approval can't be fine with a credit offers explosions while us on [noise]\nI don't drink I don't smoke\nHer run three miles a day\nI just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAt our W J Barnabas how\nWe offered the latest in Congress has had breast health services\nIncluding mammograms ... genetic testing and breast surgery [noise]\nNot to mention peace of mind\nAnd with breast health centers located throughout New Jersey finding is simple\nTo me the most of breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash manner\nMaking excuses is easy\nAre to the tape aren't at his house\nBeep breast cancer together\nThe healthy together\nToday arithmetic like please not talked to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was bad at languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently in your new language within a week\nI was amazed that I could start having real life conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning up in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battle for free download the app or tax vote job\nTo forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for eight for aid for aid\nInsurance companies to Texas had available and all the details that an IT direct dot com it takes a lot of courage to pay your own death but a grownup ... see I was putting up with a whole life insurance to protect my family\nEven though I knew what was important but my first husband died\nI watched her struggle emotionally and financially it really made me face reality if my husband died how would I pay the mortgage the car payments or keep up the life the kids who may I realized I needed to get our life insurance right\nAway so I called a I T direct it left them by little I had a quote I was shocked at how affordable it it just fourteen dollars a month or two hundred and fifty thousand dollars a term life coverage I feel so much better knowing my family are protection\n... a a G direct right now for free no obligation quote the coal takes less than five minutes and you can save up to Seventy percent called out one eight hundred seven six one nine nine to five that's one eight hundred seven six one nine nine to five one eight hundred Seventy six one nine nine to five\n... at that but when a little more Seventy four Seventy four\nHey where the sound of New York radio won all three nine you know what else is down in New York car horns let's say that roe\nWhile we're getting really heavy out here ... radio what else are we now and you have any transit checks sponsored by now but if you're on the beach you we it looked like a ... metropolitan avenue here jam packed anyway I'm looking at everything between the\nQueens boulevard and the Brooklyn Bridge and pushing away from the beach you leave the LIE loaded out to the ... Grand Central parkway pretty tough to now the west bank Ross Ross delays or Westchester avenue out\nOf times\nThem when they got a lot of great history but now\nThe way I don't know I have ever seen him on what that might [laughter] her name is pat personally ... go\nDo what you should uh named her again\n[laughter] [laughter] I'm doing a\nLike now read it and they said it's all laid them come from the cat that China and the\nGermans honored the money or time understanding like when they are going to go\nKnowledge about our water to Henri 'cause you don't want to hear there's the Lackawanna here that are really\nBeing [laughter] criminal [laughter] I\nGather you're there you go\nOn here that are out there\nWho are going to be built on a bit and want to go outside it's a pretty good\nAnd bring it may be a pretty broad degree in order to protect\nMarine mammal match but at the\nBut [laughter] it every\nWeek by these kinds of like the highest battle and the ball may\nBe I Know he got and by the\nGoing to be kept you right now I'm just making a free for a boat or you\nHear you know what can we tell them to tell everybody\n[laughter]\n\n\nI\nOn a\nLong long\nI just wrote\nThe line\n[laughter]\nSomething strange to me to go all the time [laughter]\n[laughter] I'm afraid of them goes [laughter] I Know [laughter]\n\nThey run it through there can you can also join the middleman and everything like red and yellow did it and\n\nTo say you know [laughter] I Know [laughter]\n[laughter] oh God [laughter]\nI used to live in line for either [laughter]\n\n\n\n\n\n\n[noise]\n\nGot married [noise]\n\n\nThe midnight [noise]\nTo\n[noise]\nTime and [noise]\nIn shambles\n\n\n[laughter]\n\nWhole game now timely ended our book club here is comedian Brandon Patrick how are you young man Iran\nAll you know we're all I'm scared a poll or they like it was like oh ... what they probably think you are right now I'm\nGoing to a black man you know I look I got this great body like a teenager they weren't just seems a little ... how\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for aid for aid for eight\nMy dad and his own it next I'm ready to one of ... still tough trying to get out of that GW\nBe whether you're on the west on crowds Ross are coming up the west side time for your radio when it's really nice rapid transit chat sponsored by NASA now the western ... started Westchester avenue south\nAnd dig in real tough go into Fordham Road down to the restaurants north down from the are okay triborough southbound Harlem River\nDrive bumper to bumper into the triborough endorse sound very heavy one forties all the way up to the George each that up to ... deal with that wrapped around a hundred and forty nights at ... everything around that triborough bridge heading on out now by NASA reusable bags today for just Ninety nine cents and you'll get twenty percent off nearly anything that's inside from spark plugs air\nFreshener oil filters all twenty percent off polity parts helpful people latch Napa no how\nWhile supplies last exclusions apply minimum three items now more than ... show coming up on what us right now I don't\nKeep it to hear what's happened and then you were I Know you better be agreed that when I get home I Know that you know I don't know is that the Facebook and\nUsually\n\nWhen\nYou use\nMe\nI'm I'm In you\nKnow hey I Know I\nMean\nI'm\nNot even\nBeen\n\nHow\n\nWhen you\nAsk\n\nWhen when you do\nThem\nOn you know\nTurn back to\nLa\nStreet you\nYou know and that's why\nI\n\n\nShould\n\n\nOn\nThe day she began the record on during the year to\nGo and get out doing my job to report to the Halloween although we're not drug appropriately what we do have is a nice nice little medley for here it is [noise]\nDuring the get voted on you can't be Sarkozy and nor can they\nDo you do the right to make\nSure that that can be true that energy job but uh no mom who would you have to treat I shall Elaine candy and called take back along the way I began\nLike to get them back in one\nOr the you know what the shot at when\nShe would have been delivered that speech and the way when they didn't bring me a lot of the wing man which really question that will do well to get the kind of get\nMoney is no better be\nYou with the kid but I Wonder if she didn't read the like the chicken treat my town na\nNa ve around get any gotta wage jobs around me any way\nOh\n[noise]\n\n[laughter] holidays that's all right come into your dad become I've got a dog on your mom and dad was due to go to the pledge of need to stop going through your kids guinea back\nThen you're making sure if they you know you just barely make get it by yourself but we've got to prove it on my top ten that'll be elected Fifteen minutes just to be able to show you the truth\nAfter\nYou know an ad from Roche save money on car insurance when you bundle home an auto with progression\nGot to do what is it well where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] so that's not the near Charlottesville\nProgress with Trudy from becoming your parents but we can save your money when you know of course we can just go through your overtures comes off a little a little stricter situations\nFor a limited haven't mission where you can get a complete pairs of glasses brain when does the work for just forty nine dollars on single vacant lot as an eighty nine dollars on progressive\nThat's a good deal on but we all for that pricing on over fiber rain which makes it a great deal a great deal better than the other guy right now by you complete ... single vision glasses purchased forty nine dollar or two pairs of progressive for only eighty nine dollars can work where here to help you summertime by the door for detailed offered by November ten\nHose and I know we start with low because Los pros they big on the supplies they use smokes right now so he's even more on what concrete mix\nNo thirty percent off when you buy in bulk what they ... percent on eligible purchases every day when you use your lows business credit account ... what was proposed dot com or detail so pro now that you know start with low minimum purchase\nRequired watching very by location critter offers up their credit ruble can be combined with other credit offers versions while us on me\nI don't drink I don't smoke\nAnd her run three miles a day\nI just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we don't need\nAt our W J Barnabas hell\nWe offer the very latest comprehensive breast health services\nIncluding mammogram ... Graham genetic testing and breast surgery\nNot to mention peace of mind\nAnd with breast health centers located throughout New Jersey finding it is simple\nTo me the most to breast cancer awareness month\nBy visiting our W. J. P. H. dot org slash mammal\nJasmine Sanders Halloween candy or the ... the top ten Halloween candy my kids world dot\nCom All right now these are not mind these are kids that come right number ten to ... oh you got to have that just it's a class and the big one that the tiny ones yet at the time of year the year it seemed like you like to make that I Do and they wait a minute on my side that we're not at the top than Halloween candy you know a\nBig problem but OK they did they not only getting a more um 'cause I don't want to get to do but to have you seen the kill kids get along with assault with a with a Chabrel double the without all the it'll solve all the ...\n... they are they believe the Oh yes yes yes we have a number of the top ten Halloween candy lovers\nOh yeah I like my math and I know it's a multi thing yet I'm off and then I don't like multiple your number seven on the fact that how you feel it through our patch I Am now than he is I like to go\nOut to eat [laughter] ever stopped in Halloween candy ... Nader never by the time than Halloween candy nerds na na\nNa long before Halloween candy Garber observe I Love to have you had the new star burst that come with heat knows that they're sweet hot that oh I like laying a Mexican guy\n\n\nWakes up immigration drive by ... number three of the jobs created Halloween candy ... no\nI mean\nThey always he'll candy is great when they are older than us and they still making them and selling all that high ready and then the doctor and Halloween candy receive last\nLast uh can weigh like read the piece of the reason I recently read my line they might have pledged\nNothing whipping go smoother than to read the speech yet I don't know that got number whining\nAbout how we get a kick out I Love\nYour favorite gave me that I\nGet a call ... ... you know the best ...\nNo no oh our lady I Know and it's only the only black identical was a ...\nAn hour later jammed in\n... and that's why no one has to be in a way to live there you go that's right and you like way\nWay way way every year and a lot of you know\nWhile she walked in ... as a writer named Yvonne we got Mac running from ZD picked up in the middle of a deal\nTo do more and more you\nMore and more you thanks for listening to the\nOptimum attached to relieve no that behind every tax problem out on us are working Americans with family home saving paycheck that need protection like our listeners naidoo oh they are as tens of thousands of dollars with no way to pay the Irish put a lean on his home anyway\nOptimal bought aggressively when they got a deal that said ten thousands now if you already are as called optimal tax relief eight hundred and four five eight three won three hundred four five eight\nThree one drowning in ...\nIowa the Irish thirty seven thousand dollars to\nGet ready for a toll free hotline taking advantage of new Irish tax forgiveness program may protect you from IRS collection agencies they have the power to garnish your wages put leaned on your property and led to your bank account Vivek tax relief can help protect you from the IRS\nCivic actually basically represented me against the IRS and by the time everything was completed I didn't know the artists anything find\nOut about the fresh start program that is now available through the big tax relief living tax relief special tax hotlines can help you discover all the relief programs available for free\nI Would recommend anyone who has a ... in the context of actually\nJust call eight hundred to one one six one one seven eight hundred to one one one one seven don't wait call now eight hundred you won one thinks one one seven eight hundred she won one thinks one one seven [noise]\nCasting calls casting calls thing call\nUs energy gospel record and group renewed in price would like to invite you to be a part of their music video she would put their singled out to be made whole enjoy them on Saturday November said would sharpen mount ... Baptist church Eighteen eighty three Adam Clayton Powell ... boulevard in Harlem that Saturday November to that one I'm sure\nThe bites you and your congregation to come dressed in your studies missed it a few besieged for the seat they will need fifty choir members just an all black attire it'd be digging and digging best dressed in black and white attire and one hundred us or just in uniform for special seat for more info call nine one seven six two thirty five\nSeventy six to nine one seven six two three five seven six again nine one seven six two three five seven six for email Mr release seven eight ... dot com M. R. L. E. L. I. E. seven one eight in GI Bill dot com\nIf you have really big gaps incorrect to fill the Home Depot has really big news introducing new law type type phone big gaps insulating foam seal it with four times the density of conventional spray for it'll fill gaps up to three inches in malls in a row pipes in one path\nSo big gaps are no longer a big problem ... with luck type type phobic gas exclusively the Home Depot\nOr saving for joining us only store for details\nAnd was now a trauma diary of law\nDo diary that goes to this house is protected the progressive but that doesn't mean it's a hot house would you explain that radiator clanking sound for the moon colored light in the hallway that's gone by morning maybe he never bundled home in auto and he's doomed to suffer an eternity without\nSleep an average of Seventy percent the car insurance when you went to home in order for progressive oh right the wind casually insurance company and affiliates discounts not available at all states are situations\nFor a limited haven't mission where you can get to complete pairs of glasses rains Landon that works for just forty nine dollars on single vacant lot has an eighty nine dollars on progressive\nThat's a good deal on but we all for that I think on over five frames which makes it a great deal a great deal better than the other guy right now by to complete path a single they can go out for forty nine dollars or two pairs of progress as for only eighty nine dollars can work where here to help you stomach so by the north of detailed offered by November can\nHose and I know start with low because at Lowes proceed big on the supplies they use most right now save even more I thought concrete mix\nNow thirty percent off when you buy in bulk for say ... percent on eligible purchases every day when you use your Los business credit account to stop by our visit most proposed dot com for details so pro now that you know start with low\nMinimum purchased required selection varies by location credit off the subject credit frugal Kathy combined with other credit offers explosions fly us on me\nI don't drink I don't smoke\nHer run three miles a day\nI just had a complete physical my family has no history of breast cancer\nCurious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAt our W J Barnabas how\nWe offered the very latest in Congress to breast health services\nIncluding mammograms three D. mammograms\nAnd the testing and breast surgery [noise]\nNot to mention peace of mind\nWith breast health centers located throughout New Jersey finding is simple\nTo me the most of breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash manner\nMaking excuses is easy\nOur W J Barnabas how\nLax the breast cancer together\nHealthy together\nThat's a good they were like please not acted dry ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and basketball you'll remember what you've learned\nI always thought I was bad at languages but after using ... I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lesson you can be speaking confidently in your new language within a week\nI was amazed that I could start having real life conversation right away because it's so fast now I'm speaking Spanish\nNo wonder battle is the number one selling language learning gap in Europe tried for yourself in the white battle is the quick way to get conversational in a new language like Spanish French for more you can try battled for free download the app or text book job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for aid for eight forty eight\nIt's up to sort of more Seventy or Seventy [noise] say quick\nLook at the road there will be right back edited video\nYou show still child trying to get out of that GW be whether you're on the west bank crowds products are coming up the west side of your radio when it's really not Traficant transit checks sponsored by NASA now that west bound ... started Westchester avenue south and dig and real tough go into Fordham Road down to the ... north down from the Europe gay triborough southbound Harlem River\n\n\n\n\n\n\n\nNumbers on you already know Halloween rock well somebody watching me and my time in this environment is through the ...\nAgain I'll come every time I hear your last year when the ... the ... the\nHolding my breath [noise] 'cause I don't know what kind of what we're going to show up is it the one who said this lady was a joy is it the one who said he wanted to buy the Thursday the remains of the one to talk about how your blanking out the superhero [noise] is it the one will now saying that he wants to do this this double politics at the back except that he made sure\nTo to to tell the envy that it wasn't about Donald Trump it was about a candidate Owens and the black to move\nAt the uh uh I understand the Kanye West\nMay be mentally ill like any may believe a thing to be saying I just want to know what God gave them to stand up what Tanya he wasn't going to show up 'cause one peel can't deal with all the person that I get that he's mentally ill\nI get that he's having a nice break break down and I may I understand he may be calling up by but that help is taking on a notorious tell right now in America people are dying\nBecause of the things they are hearing\nNow I Can't say that somebody is calling them to actually I can say some of the things that they're hearing are activated limits on what you had a president who said that he was a natural\nAs he talked about global what uh what did the man was shot up a that's in a guy he was a ... and he referred to the Jews the goal but what is ... do the guy who made all those bombs you specifically targeted people who believe were globally and people who believe what that may have enemy and that's when you support\nYou you took pains to make sure that\nYou distance yourself from the from the not out of the ... but not Donald Trump and he's the one who's doing that he's driving a country that way even right now he's got people believe in what what what are the man who shot him to say the guy he\nThink that the Jewish people are now bringing an illegal immigrant that are going to replace white people when they were talking about Charlottesville you will not replace those who do you think that we're talking to people are dying while you messing around people that die while you're normalizing\nHatred and racism and I don't give a damn how crazy you are I don't care how ... I Can't I Can't forgive you let's say some of the things you say but when you make crazy look normal when you make hatred look normal I've got no used for you and I don't care what anybody say you can give them a chance if you want to do but he's getting pushed the and the way people are seeing that there's no\nIt is not normal for people to hear these things listen I understand what it's like to be great to live by my great uncle he he he thought he was a superhero\nNow to get by a truck miserable eared illness explains you it does not excuse you Kanye\nWest is normalizing hatred and ... on a scale that it's on ... I've never seen people whether he's right or wrong or Lucy or not\nHe is having a hand people looking at this a certain way people feeling a certain way about\nBut you could be as crazy as you walk ... you can be as mentally ill as you want and I understand what it's like and I understand all those things going on in your mind when you add to re enter could lead to\nThis level of hatred and bigotry oh I don't care what your problem now is our best ... detected ... coming up next the the ... Daniel Caesar in the ... oh\nI\nKnow ... you\nDon't know me know\nHow you know\nOh and in town is that in the\nYou know day to\nCome down on the long run run run on march ... oh\nGod\n\nNo no\nThere's been\n... and\nWhen we when\nWe make\nMe feel so na\nNa na ...\nJews alone\n\n\nAnd\nMy in my early ... was reading the ... Williams has it's got to see the synthesis letter to uh the Trump Administration because they were using it so I'm happy just hours after the than the God now that you know right from here and then he got to be for writing at the end it there but I guess\nHe got to the bank right there I mean I have one that the one with Robin thing where I get the idea about that oh indeed [laughter] so I figure being happy uh I don't know why is it turning but it's everywhere I Can't get away from it I don't know all the details about it\nBut this whole uh I guess Nick humanizing cardio the the I guess is over a I guess the Mickey said something cartoon came for her and now they keep them as much as ... and all that money you know what we're doing great let's be brand new car he was like okay I Do know a one of those I Know\nYou can guide Nikki lumped or a night of like listen why don't you guys come on the show and will do lie detector test Maury Povich yeah he wants to do that I Know Nikki loved her at night yeah not a very big enough to know yeah\nBali trending we talked about the little bit uh James Whitey Bulger while it was a a killed basically now what crazy you know what ...\nWhat I Do know fifteenth ... yeah and so he ended up spending seven years in prison but they transferred him to a new temper genuine and the day the next day they killed yeah yeah that oh you're a show\nThat's called ... there again after what does the oh we got about ... eighty nine years old to do it keeps you hanging out with him on the left loves going to put a here he is that what they're going to at All right what have you learned is coming up next some of the evening\nTo more and more you learn\nMore and more you landed thanks for listening to the do you\nLook at the table Medicare part D switching to Walgreens may help you save on your Medicare part D prescription well green trusted since Nineteen oh one talked to a pharmacist to learn more\nHappiness here any bar called for a limited time getting our Lancome howdy Doody box worth four hundred and twenty two dollars for only sixty five dollars that need these with any thirty five dollar Lancome purchase\nEnjoy can talk I did essential for the perfect holiday clout flats new activating Jenna the ice cream and Iran and are things your mouth guards all in a luxury travel case [noise]\nBelieve in the ... is it my company the if the gift definition [noise]\nSo we're at dinner and my girl Jackie fact one of our stereotypical stories I laughed and get what\n\nOne of\nBetter than any word I\n\nLearn from what I've learned Charlie Brown here at talk about what we learned\nAll right ladies and gentleman so remember I I don't want to go there by November to please remember voting because it would be a great I'm constantly there's no Jamie ...\nYou know when you openly or anti Semitic openly doing business with no the are gone made out you're overly races the overly massage and if they can be overly homophobic\nListen they deal with Robin waiting to do this for a very light on\nThe monkey in it up yeah what does that had come a rabbit hash when you know yeah and I do Steve\nKing was a clear he's still racist Republicans do they do read the will give money and they cover wages for the way to get the money all the time but then when people call 'em out there well we\nWe can't do it I mean it was Perino Trina like that that don't blow jobs yeah ...\nI don't know I get both ways you got to let my book I'm not a good shot at apple a good read a little stuffed in humor book [noise] um so you go to good read a look at a humorous category click boat yep\nAnd then you can use those units being shared by about when I'm going to give you have much of that um is already small oh\nWell that [laughter] oh Charlie ... [laughter]\nI mean what I said I Love\nWhat airs sat through ... grade sand and where did you learn today\nToday I learned something that I already know but of course just you know being a\nI don't know more aware of it when someone's ... who they are believed him and that's what I learned about Kanye West I think he showed us who he was a long time ago\nAnd I think he showed us even more when we saw him in the White House acted plum food and I think he continues to show a two year so I think we should stop making excuses for him and we know exactly we as a kid my main learn\nToday I learned that today's the birthday of bumpy junk you know if I may even\nWith the Harlem crime king pan spent time in Alcatraz one of the biggest criminal but you know what he's not the biggest criminal born on this day with Christopher Columbus his birthday today too\nBig a criminal marrying him yes he is he still every day I on the next the argued we showed ... gas masks okay\nIs the latest director producer and we're going to hear ms project I saw a bunch of record plus our beaches that a whole jazz for somebody to get to exactly what they deserve it to the future we'll see you on the other\n\nDay after New Hampshire radio Felicity is the most exciting show on the radio safe English in Egypt at least yeah\nFor a limited time at work you can get to complete pairs of glasses brains when does the works for just forty nine dollars on single making a lot has an eighty nine dollars on progressive\nThat's a good deal on but we all for that I think on over five hundred grand which makes it a great deal a great deal better than the other guy right now by to complete patent single they can glasses forty nine dollars are two pairs of progress as for only eighty nine dollars can work where here to help you that much ... by the daughter detailed offered by November ten\nWhen it comes to your health and you deserve the best Hackensack Meridian helped pass for hospitals ranked in in Jersey's top ten by US News World Report more than any other network and we're in the top ten percent nationally and then nothing special from Hackensack\nThe Jersey shore University Medical centers to reverse reverting back many expect while the chair and compassion and learn more and Hackensack greeting helped out or slashing us\nAnd you know an ad from um [noise]\nI Know home in honor with progressive and have on your car insurance [noise] excuse me maybe we should add an award money so they know that they're saving money\nGoing to have that in there OK yeah how how just nodding yummy okay well he's\nGot enough funds to pushing their progressive city from becoming your parents but we can't save your money when you pop bottle of course actually insurance company for other insurers just could not be a little a little stricter situations\nHey honey take a look at this resorts world casino in Queens is offering rewards members a chance to earn a mini vacation package where members right oh yeah yeah we joined last year we can fly right from islip airport and it's been a long weekend in the Bahamas them let's go we can use a getaway\nOr in a free ... vacation package not a rewards member signed up today and start packing resorts casino NYC comes lane and get away [noise]\nIf you have really big gaps incorrect to fill the Home Depot was really big news introducing do luck type type phone big gaps insulating foam seal it with four times the density of conventional spray for it'll fill gaps up to three inches in malls and around ... in one path so big gaps are no longer a big problem I\nSee what would you address moisture impressed with luck type type phobic gaps exclusively the Home Depot or saving for joining us only store for details\nToday right to make like please not talked to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they used babble the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was bad at languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within weeks\nI was amazed that I could start having real life conversation right away it was so fast now I'm speaking Spanish\nNo wonder battle is the number one selling language learning up in Europe stripe for yourself and see my battle is the quick way to get conversational in a new language like Spanish French for more you can try battled for free download the upper tax to vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for eight for aid for eight\nAnd a phrase towards members only see participating source for details you drop bill broadcasting live from New York and hard rock hotel and casino Atlantic City studios\nMy fan is that New York Knicks the bar in the ... station\nLong can\nBe no\nDoubt\nThat China then went\n... try\nOh my God\nNo\nNo no no\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\nOh it sounds like you have the cold is radio three nine New York's best mix of art and be with Mike Shanahan and oh I'm so looking forward to this when I found that this lady was coming through and she is the lovely the legend herself Melba Moore\nWho wants to be making [laughter] how are you my Facebook friend on science\nSo good good life has really good right\nNow and it really is you look great I mean you know people always say I I think he said one time you know stop worried about age and just live your life you\nKnow I said everything all ain't that okay okay [laughter] well that's true to what you know old you are you saying is\nTo stop wearing if you can you have to work at it that that's like a therapeutic exercise sometimes right stuff going on like you can't ... that's right\nRight you've got to keep going you know what I mean I think that's one of the reason why you look so great I mean you just you never stop you know you've always been around and I said this to the nice William she was a a couple of weeks ago in the same for you I feel like you're part of the soundtrack of our lives\nAre slowly we're blessed to have music that people have been listening to and you know sometimes we don't kind of get that perspective\nBut one of the things that happens at the time you get to pay them to people coming back to you and say where they heard you and what they were doing in their lives and um what you meant to them if you met something right rather that remember you you do and then you realize you have been part of the soundtrack of people's\nLives who are very blessed\nYeah yeah most definitely I mean oh and I I wanted to say go way back 'cause I when I first heard on a I was a war I don't care how old are you yeah you can't be that All right well I remember that show in the summer from Nineteen Seventy two of you and Clifton David\nAll year we're going all the way back yeah yeah [laughter] okay All right but I'm using the line if you've seen it already\nBut I mean that's how far back I go with you and I mean it's just you know and I was growing up seeing you wouldn't jet magazine Broadway work and everything like that you just you've been on the soundtrack of our lives have been a part of our lives and the music has always been great and\nThat's why you're still around this when you're living legend and so you're here to but we can talk about some other things real quick but ah the legends of disco show yeah this is I get some other legit and oh my goodness so would you\nWe got alpha Anderson Lucy Martin a Norma Jean right they all used to sing mushy right okay and I think they call themselves now the ladies if she goes ladies up that was going to ask you that the ladies of Sheikh okay so we get the ladies are sheep which makes that then we got the ladies of sky\nAnd they are just ridiculous because so much fun yeah yeah you should come [laughter]\nHere's my number and a dime Myrtle that was back there [laughter] so what's up to the lowest Bonnie Indonesia so I can never remember all three of the nation I got it right tonight and double exposes on do you call ... in\nFirst choice in a mystery guest that we can't talk about do\nShine we know who it is but\nOkay we're gonna have to go on a slip and say I [laughter] now\nDo you do better than that so this is going to be sad it is going to be the third at the center for the one part in the Bronx so I Would all those great people on stage show starts Saturday a good show the other day about Tuesday sometimes by it could be show yeah yeah yeah but a great show so I mean but I think your view is way more than just disco\nWell yeah I'm really privileged to fit in with the pizza disco heavyweights really hey are and when you hear that music or not only do you remember how great it was ... to feel like you're just hearing and for the first time in your mind you we have some great great music and even though which\nStood the test of time to hear it now ... you still don't want to get up and do something I don't want to just sit there and\nLegs and I knew he could still great exactly and the thing about just go to you know at at some point it became a dirty word you know\nRight I ... I think maybe I was cutting you off I didn't mean to but it was at one time that he would just go August for instance like you weren't as good as something which you know that's the Americans the newest country on\nOn the globe right and so we're always coming up with something that nobody ever heard of before and it takes some time for people who see it ain't going nowhere\nRight right right and see the beautiful thing about disco that a lot of people especially younger folks might not know or remember is that you know disco was a unifying force it brought people together well\nPeople from all different right John ... were able to be and that's one of which is probably since I'm really known for white he was a space for me in it right right right\nBut I mean it brought everybody together you know what I mean white black Asian whatever young old gay straight everybody was like one of the first time you just like everybody enjoying the music together right and it was just love you know what I mean and\nI think you know we could use some of that now almost nightly news so I think it's a beautiful thing that you're having a show like this and that you know this music as definitely stood the test of time so this is something that you know you guys are going on the road with or is it certainly is\nJust a different um performances in shelters people really want to hear it right there for a while to have live music\nPeriod was kind of on on the damn thing because we had to have some more\nPromoters and and people who put the shows on right right we had to have\nA new crop of young people doing that that's a whole new talent in itself right and then we had more people like when my friend here with us today and he uh who's who's producing shell and so they go out and they got out and they said we'll do people want to see this and they see that there is\nPlenty money at it there's plenty of shows that you don't have to just you know perhaps he will have a two in the summer saying not right but there's lots of different shows on the same time all over the country and all of the world I buy right we've got to say thanks to own world old school Europe for keeping it a lot\nOlder than Europe they they they love our music they never let it go\nOh yeah come back to it right right right you know and you hear about you know you wonder whether these artists are that you might not have heard from here in the states for five six seven eight nine years trying to over in Europe to kill it it you know Rachel and I think\nThey've kept it alive for so long and you have been killed her first of all we have new generation of young people love to come here why is that running here he is brand new and so they love it they don't say well it's not like on using so we don't like it they don't do that right right you know what I said well what is this to sell his name\nWas real musical they sample it because they love it they say you know [laughter] yeah yeah yeah they will be a little piece of that and right right exactly exactly but like I said you've done so much more than describing the but the Broadway them that this everything you know what I like I said soundtrack\nEven do like college I was playing music adulthood you've just always been there and it's always been simple enough\nOne of the things that happened like is that like most black people in this country music was always the center of my life and of course in the beginning back in those days we really didn't have very many um icons that were black for us to look at anything else um\nSo when I came along the actually I taught school first but\nI I wanted to try my hand it seems that could be an artist and one of the first people I met with now The Simpsons oh yeah and she was doing studio what she can you read either why heck yeah [laughter]\nSo my first music my first work was in record it and use it too but not as a solo artist but out of the recording industry\nUm I got to do my first Broadway play\nWhich was hair and that was the first uh play that did well they called the rock music because like if it was because we simply white people write write about hippies in the white culture but again it brought people together this year and they gave me the opportunity to start acting and I wound up\nWith the female lead and replacing a Diane Keaton\nSo I really had quake great success in theater because they probably got a Tony Award for that yeah yeah ten uh ten bucks two opposite as a kid with Jeffrey holder\n[noise]\n[noise]\n\nIn the previous that'll\nKeep you thinking we're radio one oh three nine\nYeah yeah\nBut you know\nI'm really not a good\nLead on any easy but you\nThey\nWe'll we'll we'll meet again\nMuch time on\nWill nominate you'll\nYou usually much\n\nWill will will will get middle\nName that died in ... and the baby boom boom boom bang bad\nWe're in a\nLeading\nWill be using much to\n\n\n\nThe ... ... if you go ...\nOr no on\nAnd\nII and you know I own a young\nAnd my mind and ... and ... and\nThe audience and that you do oh and those\nAre my guests to name I'm I'm just saying\nThat\n\nI mean I Know\nWe have\nShown that\nDown and\nOf me and bank\nNa na\nNa\nNa\nNa na na na just you know I'm not a\nLot of the audience\nBeing\nThose na na na na na\nNa na na\n\nNa\n\n\nNa build on\nDon't you think that shell out\n\nYou know\nBack in\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\nYeah\nAnd you know I don't\n\n\n[noise]\n\nReally work here in\nThe new one but um you know\nMaybe one day I'm leaning more than we were way way way\nThere and then maybe the last\nWe need the dollar\nYou know we'll just go on the news we choose what you mean\n\nWas the lead in the business\nYou would be in town and\nI'm young I'm\nRemembering\nAround you know her name\nRan and mommy on a on\n[noise] [noise]\nThe\nAnd then in ... [noise] [noise]\n", "year": "2018", "show_name": "no_show", "city": "New York City", "day": "31"}