{"month": "10", "state": "NH", "station": "WEVN", "content": "Know important one W. E. V. S. natural he point three W. E. V. H. hen or the Ninety One point three W event keen Ninety point seven WABC ... one of seven point one W. E. D. J. Jackson Ninety nine point five W. E. T. F.\nCobra Ninety point three and that he ... he little ten Ninety One point nine and online at any age PR dot org [noise]\nLast night President Trump mark Christine Blasey Ford for accusing Brett Kavanaugh of sexual assault\nHow does he get home I don't remember how did you get there don't remember where is the place I don't remember how many\nFor Wednesday October third this is all things considered on an age PR\nPeter below this isn't the first time Trump has used this tactic against women love that story in this hour of all things considered on an HP are also a prominent us based Saudi journalist has gone missing in Istanbul after visiting the Saudi ... their raises concerns he's the lead us to be caught up in the kingdom's crack down on free speech\nAnd communities across the country ... here in New Hampshire are grappling with a new kind of chemical pollution in their drinking water the science and regulation rounded aren't settled reading some people frustrated and H. P. R. news headlines coming up in just a few minutes first we'll get the latest from NPR\nLive from NPR News in Washington I'm Windsor Johnston\nPresident Trump's divisive remarks about the woman who accuses Supreme Court nominee Brett Kavanaugh of sexual assault risk alienating key Republican senators\nTrump mock Christine Blasey Ford at a campaign rally last night NPR's Tim Mak reports Kavanaugh's confirmation almost certainly hinges on boats from Senator Susan Collins Lisa Murkowski and Jeff Flake Trump\nMocked Ford's Senate testimony at a political rally in Mississippi his attack on Capitol is accuser was greeted with cheers\nBut where is the place I don't remember how many\n[noise] not\nSo much on Capitol Hill Republicans have a slim majority in the Senate meaning that Kavanaugh's confirmation may come down to three key lawmakers Here's Senator Murkowski\nEye and taking everything into account and I think that the president's comments yesterday came to the doctor for we're totally inappropriate and in my view unacceptable\nSenator Collins called the comments just plain wrong and Senator Flake called it kind of appalling Tim Mak NPR News Washington\nA un tribunal has ordered the U.S to ensure that sanctions against Iran do not impact humanitarian aid or aviation safety as NPR's Michele Kelemen reports Iran is welcoming the decision while secretary of state Mike Pompeo is blasting Iran for abusing the court\nSecretary ... says Iran brought what he calls a merit lists case at the international court of justice based on a treaty that he says Iran has been ignoring\nI'm announcing that the United states terminating the Nineteen fifty five treaty everybody with the wrong this was a decision frankly that is thirty nine years overdue ...\nSays while the U.S is re imposing sanctions on Iran having pulled out of the Iran nuclear deal\nThe Treasury Department is making sure that humanitarian transactions can continue but the secretary ads Iran could be helping its own people rather than arming proxy militias in Iraq Syria and Lebanon Michele ... NPR News Washington\nA journalist group and turkey is calling on the government to look into the apparent disappearance of a prominent Saudi journalist and critic of Saudi policies NPR's Peter Kenyon says journalist ... reportedly entered the Saudi\nSupport for an HP ours live stream comes from you our members and from the law firm of or in Reno sustain excellent since Nineteen forty six offering sound judgment and a practical approach to New England is legal challenges find out how or in Reno can help you online at or dash Reno dot com\nKenyon reporting on Wall street the Dallas out city for ... and he asked you this is NPR\nNews for oh for this is an H. P. R. News I'm Peter below\nA residential treatment facility for kids struggling with addiction is slated to open in Manchester in early November\nAs an HP are taught book when reports the executive council approved the four year contract today the group granted pathways will operate the treatment center it's going to have thirty six beds all the dedicated to servicing kids ages twelve through Eighteen who have substance use disorder\nThan facility is located on the grounds of this new youth services center in Manchester\nThat the state secure facility for juvenile offenders recent reforms in how the state detained and punishes juveniles who break the law has reduced the population at the new new center opening up space for this separate addiction treatment program\nFor H. P. R. News I'm Todd book in Dartmouth College is celebrating one of today's Nobel laureates that for instance Arnold who received this year's prize in chemistry\nDartmouth awarded Arnold an honorary degree last year and she delivered a personal address to graduating students at the college is the er school of engineering\nWhen I was asked to speak to you on this day when you and your family's celebrate your hard work\nAnd your achievements my first thought was to say no\nI don't have any advice to offer even words of wisdom because so many things in my life have gone awry\nArnold had recently lost her college aged son unexpectedly she urged the gathering engineers to build something beautiful and create something meaningful she's only the fifth woman in history to receive the Nobel Prize in chemistry she wild widely recognized for her work in the evolution of enzymes\nAnother main key well has been found dead on the New England coast\nThe carcass found in Massachusetts yesterday march twenty six steps of what regulators called an unusual mortality event for Mickey whales they're not considered endangered but like oh well they are protected species in American waters\nTwenty of this year's Mickey deaths have been in New England including two off the New Hampshire seacoast Mickey's are not the only whales in trouble this year in North Atlantic right whales and ... are seeing an unusual die off to\nFor tonight some fog cloudy skies ... around fifty and for tomorrow partly sunny skies in southern New Hampshire the north will have some afternoon showers tomorrow highs and the low to mid seventies for friday mostly sunny skies with ties in the low sixties and for Saturday sunshine again with high in the low sixties\nSupport for an H. P. R. comes from listeners like you and from parents major brands appliances family owned with seven locations across New Hampshire providing appliances and employee expertise for over Seventy years learns major brands dot com and from ... to feature the also kid zone at the king challenge bike ride October twentieth\nTo benefit individuals with brain injury details that king challenged dot org this is an age PR\nAnd you listen to an HBO or because you want to keep up with the news and you know that the news affects you whether it's from the other side of the state or the other side of the world\nDay after day you choose to listen to an HP art for high quality news and information and today we're asking you to contribute any amount to help pay for the news that you trust\nBecause this is an HP our fault member Dr I'm Todd book man here with Emily quirk we think this is a great time for you to show your support for the station every\nGo to an H. P. R. dot org right now to make your gift or pick up the phone and call one eight eight eight eight zero five six four seven seven\nAnd now is a great time to make that gift to an age PR because we are giving away and just less than two hours or one thousand dollars southwest airline gift card we're giving it away at six PM\nAnd you can use that gift card however you see that if you have family in California you could also take it ah I Know that sounds less goes to a rubella and I'm a bunch of places in the Caribbean so you don't have to go visit family you can take a trip for yourself\nHowever you want to spend that money that is up to you but you can make a trip during this winter coming up so uh if you want to be entered a when you do have to get now we're giving it away and just under two hours make that get it's quick and easy to do at N. H. P. R.\nDot org if you need another reason to become a sustained of New Hampshire public radio well\nHow about pain for the the information the analysis and the enjoyment that you already get from New Hampshire Public radio every single day uh thinking back to some recent stories Lauren children's reporting on the fallout\nA at St Paul's school after years of misconduct was revealed a Jason moon two plus years of reporting on this unsolved murder case in New Hampshire officially launched today as a podcast called bear Brooke\nIt takes time it takes talent to report on these stories and it all happens because of listeners listeners who take the step to become financial supporters you can become and sustain a right now at an H. P. R. dot org\nAnd your guest can go further when you become less a stinger of an HP are as as a stinger you designate a monthly contribution from your checking account or your debit card credit card and your contribution is always active\nSpreading your support out monthly is easy and your contribution will have the maximum impact for an HP are so that we can do some of that long for a form journalism that Jason moon has done some of that in depth reporting that Keith McDermott and Annie Ropeik end and Todd look than does ... each and every day\nSo you can become a part of this public radio community right now when you become a sustaining number at an H. P. R. dot org\nThey prefer Republican by ten points women on the other hand give Democrats at twenty pointed advantage\nThat something that they've been saying all along so you can see really who vis a vis Kavanaugh hearing really affected and had the most impact on is the takeaway\nHere that the quote unquote blue wave seems less likely today than it did a month ago\nI think absolutely that's one take away and I think that there there have been warning signs for Democrats that that the blue wave wasn't going to be as big as it could be because Republican enthusiasm even at a lower level was still higher than out parties in past wave years\nIt's NPR's to medical mountain are with results of this new ... You're welcome\n[noise]\nIn Saudi Arabia and internationally known Saudi commentator has gone missing ... reportedly disappeared after entering the Saudi conflict in Istanbul on Tuesday\nAnd there's growing concern the columnist who's a vocal critic of Saudi Arabia is government may have been detained by Saudi officials the state department says it is following the situation closely NPR's Jackie Northam reports\nFor the past year Jim ... has been a columnist with the Washington Post the newspaper says early Tuesday Afternoon he entered the Saudi consulate in this temple to file some papers necessary to get married his fiance waited outside for him until early evening because she'll be never emerged\nTurkey's presidential spokesman even a him color and sit on Wednesday ... remains in the consulate and that the Turkish government raised the issue with the Saudis but an official with the Saudi embassy in Washington DC was adamant ... was neither in the consulate nor in custody\nThe incident is raising concern that ... may have been caught up in Saudi Arabia is recent crackdown on free speech he\nHad spent decades covering the twists and turns of Saudi Arabia's royal family often supporting the government's actions that is until he apparently fell out of favor with Saudi Arabia's new crown prince Mohammed bin Salman mind\nDuring an interview with NPR in may ... said life in Saudi Arabia had become repressive that government began rounding up activists and businessmen\nHundreds of sort of loose maneuver the ... when there is no rule for freedom of expression no tolerance for independent opinions\n... became an outspoken critic of the crown prince after some of his colleagues were arrested because she'll be left Saudi Arabia and moved to Washington where he continued to write calf commentaries about the government because she'll be said the choice for self exile was hard but ultimately the right decision\nOf sixty years old or don't feel like going to spend the rest of my life changes it's said that choice and says goodness that I made that decision to leave\nEven though he was in Washington because she'll be felt the long arm of the Saudi Government\nEven when I speak to you if you're somebody over my shoulder and have fun with the book and Saudi Arabia I have friends on the the government\nAnd it just may have followed ... is tumble Jackie Northam NPR News [noise]\n\nSupport for NPR terms from the station and from Amazon Prime video presenting to return of the men in the high castle were America's history is under siege but the resistance rises to fight for the world today was the new season premieres this October on prime video\nAnd from capital one offering a variety of credit card options with features for a range of customers from food Easter travelers capital one what's in your wallet credit approval required capital one bank usa in a [noise]\nSo many missed Sarah Walsh I'm from ... New Hampshire and then usually listen to the Concord station for me I'm working eighty percent and having three kids it's really hard to stay up on the news and it's also sometimes painful to hear the news but at least with an inch pure I can listen to them I commute and I also know that it's a reliable source and ah\nThe introduction humor wherever possible which I always was [noise]\nSo there's plenty of people out there I think that listen to an HP are they haven't taken the lead\nAnd I always use a little bit of a reverence I'd say come on how much is spending and everything else you know let's help out I decided to become a sustaining them or an HP are on 'cause it's really the right thing to do a great community resource and want to make sure we can sustain it and I had the ability to help so we do [noise]\nYou can help right now by going to end H. P. R. dot org you can also make your contribution by calling one\nEight eight eight eight zero five six or seven seven will get right back to all things considered and just a few moments and coming up a local story from our very own Annie Ropeik her coverage of pee fast chemicals here in New Hampshire\nIs now getting national a national audience during the next segment of all things considered and a talented reporters like Annie Ropeik like\nTodd book man who's sitting here with me in the studio right now uh this town is paid for by listener contributions that's you so if you'd like to do your part right now this is your chance to get on line it's quick and easy at N. H. P. R.\nDot org in the next hour hour and a half or going to be giving away one thousand dollar Southwest Airlines gift card and I've got some fun facts here southwest flies to one hundred destinations in forty states Puerto Rico Mexico Central America and the Caribbean\nAnd so when those Chris autumn days turned into cold winter nights can you imagine taking a trip to a ... or Jamaica or Bermuda those are all places at southwest travels\nHaving this as a thousand dollar gift card it gives you some flexibility on when to travel because\nYou won't have to wait for you know like the best deal or maybe less planning up front and more of a spur of the moment trip who doesn't like that every once in a while or you could give these to your to your grandparents are your grandkids or take the\nThe trip around the holidays is the family that you've always dreamt up so those are some fun facts about the southwest a gift card that we're going to be giving away it's six P. M.\nToday support us right now is an H. P. R. dot org or by calling one triple eight eight zero five six four seven seven\nThat's right just an hour and a half remaining on that drawing there's also the grand prize drawing which is another trip it's a recall it the truth of the lifetime to your choice of Australia or New Zealand we're giving that away on friday so if you give right now you'll be entered into this drawing for\nThe one thousand dollar southwest airline gift card as well as the grand prize\nThat are really big prize to either Australia or New Zealand so right now we'll be entered in two more prizes so now is the best time to give an H. P. I. dot org again that number AAA eight zero five\nIs the most convenient way to support New Hampshire public radio it seeds you\nTime and hassle it saves us the processing cost and you get to decide how much you want to give every month five bucks ten bucks a twenty bucks a month maybe a dollar a day you sign up on line or over the phone in and that's it you're membership is always up to date it's a really\nA hassle free way to support New Hampshire public radio and as as a state or you will get the benefit of being automatically entered into all of the drawings during drive like this so that southwest gift card that were pulling\nOut of the had six PM you'll be entered for that uh online right now at an H. P. R. dot org or take the time and give us a call one eight eight eight eight zero five six four seven seven\nWhether we like it or not we spend a lot of time in the car commuting shuttling kids to and from school running errands well all this was going on your also listening wherever you go and H. P. R. as along for the ride all things considered brings a kind of portable wisdom that travels with you and forms you land and occasionally entertains you\nAnd it keeps you sane as you said idling in traffic\nAnd you can support your companion right now at an H. P. R. dot Oregon as Todd mentioned when you do you will be automatically entered the when the one thousand dollar south west airlines get card so do get that make that gets now and H. P. R.\nDot org and H. P. R. is the source for the stories that mattered to use stories from New Hampshire about New Hampshire such as\nMy colleague Casey McDermott coverage of voting laws in the state and challenges to those laws in court of folks like Josh Rogers who takes very up close look at\nUh the complicated politics surrounding the race for governor in New Hampshire you listen because you care about what's going on in this state and it's important to remember that\nYou make all of this uh outstanding award winning news coverage possible make a difference in today's world support independent journalism I become a U.S to stay in the right now it's quick and easy\nAt N. H. P. R. dot org and when you act today you'll make an important investment in your favorite public radio station be part of ensuring its future future tomorrow next month\nNext year you can become a sustaining number right now it is so quick and easy to do it now and H. P. R. dot org\n[noise]\n\nFor twenty nine this is all things considered on an HP are when you're yellow support for an HP are comes from listeners like you and from Dana Farber Cancer Institute bringing Dana Farber expertise closer to you in a fiber dot org slash locations from people's United bank and have supporting families and transitions mission of providing safe\nSo you can make your support more powerful and enduring give to your checking account your credit card your debit card whatever works best for you at an H. P. R. dot org\nWhen you give right now at the hundred dollar a month level or one time gift\nA twelve hundred dollars we have a great offer for you we're excited to offer a pair\nOf VIP tickets to see the host of one a Joshua Johnson encountered on October Eighteenth you'll be supporting New Hampshire public radio and you will get premiums feeding plus a special invitation to a small reception with Joshua Johnson after the show you'll probably be able to shake his hand\nMaybe a hug when you become a new leadership circle member or increase your existing a gift to this point you can choose the VIP package as a way of saying thanks thanks for supporting New Hampshire public radio on line right now make your gift at N. H. P. R. dot\nOr hopefully the hugs don't cost extra I Hope they're included with that I don't know but we like to thank everyone who has taken the time\nTo go on line or to call triple late eight oh five six four seven seven Lindsay and and field and the net and ... I can never say that that town name and thinking it in a coal and Dover\nShe says and ... like hanging out with a really smart chatty friend it keeps me company and well informed\nTo everyone has done their part to show their support for an HP are by becoming a sustaining number thank you so much if you get to make your contribution go on line to an H. P. R.\nDot org it's quick and easy to support New Hampshire public radio just go to an H. P. R. dot org and in just a few clicks you'll have done your part and then after giving\nTake a minute look around the website you'll find some really great features some stories that'll keep you informed\nUs and we'll keep you entertained and if your financial support that makes all this happened uh the quickest easiest and best way to give these through your checking account online at an H. P. R. dot org or pick up the phone and call one eight eight eight eight zero five six four seven seven\nThere's so much happening in the news these days around the world and also right here at home and you can be confident that your and H. P. R. journalists are committed to covering our home front with insight fairness and intellectual honesty\nExamples of this include our investment and long form audio story telling and investigative reporting through podcasts\nI'm an series and the production of award winning international journalism with award winning multimedia presentation to boot your support right now is necessary to ensure an HP arcane continued to be your invaluable linked to the end up news report that you need to stay in power to an informed\nMake your guest now at an H. B. R.\nOrg chances are that you surround yourself with news programs that bring new new voice\nGreat journalism stories that may surprise you are you getting insights into topics that may challenge your long held opinions or provide you know insight with another perspective\nThat's public radio support it right now with your gift at an H. P. R. dot org or by calling one eight eight eight eight zero five six four seven seven\nFrom NPR News this is all things considered I melted\nChang and I'm Ari Shapiro many people in the U.S auto industry are breathing a sigh of relief this week the new trade deal between the U.S Mexico and Canada and months of uncertainty if it's approved by Congress it will spare carmakers from some of the terrorists that they had feared\nAnd will soon as senior vice president of the motor and equipment Manufacturers Association which represents more than a thousand companies that make auto parts you're in the U.S thanks for joining us here on all things considered thank you very glad to be with you to begin with what you just described for listeners what you remember companies making and where you are in the auto making supply chain\nSo our members make the vast majority of the content for new vehicles and we also manufacture parts and components for maintenance and repair\nAnd how much was on the line for you in this trade agreement ... holding your breath to see what the details would be\nWell our industry has actually done quite well injured after we've actually been able to grow our supply chain in North America we've been able to grow manufacturing jobs in the United states but it counts in all three countries being part of the agreement\nSo we are very pleased relieved to that all three parties were able to come to an agreement this weekend we're cautiously optimistic that the terms of the agreement will work for the industry and for the American public\nWhen you look at the details of the agreement can you tell how it compares to NAFTA for you\nWell there's going to be an increase in the amount of North American content that will be required\nFor parts to travel through the three countries going to have to call it the U.S Mexico Canada agreement but she traveled through North America without having to pay tariffs there's going to be a requirement for more North American steel and aluminum us so all of that were impact our members\nAnd in addition there's going to be some new administrative costs that are going to be required one of the concerns we have though are there some new tariffs out there right now on steel and aluminum and we'd like to see Canada and the United states address that before they finalized disagreement in the end of November\nSo on the one hand there won't be terrorists for material crossing Canada U.S Mexico border is on the other hand the steel and aluminum tariffs that were of concern to your industry have not gone away\nNo they have and I think one of the things we have the mind as they have been a particular burden to smaller manufacturers many of these smaller manufacturers are only in the U.S\nAnd some of our members have seen the cost of their steel purchases rise almost fifty percent\nSo this is a significant increase it's typically is concerned between Canada and the United states we'd like to see those two countries roll up their sleeves used his fame energy they use to conclude this this new NAFTA and be able to come to some kind of agreement on steel and aluminum tariffs\nI Know that there's a lot of relief from the auto industry now that the uncertainty is gone but how does this compare to the old rules under NAFTA isn't an improvement is is it worse well\nI think from the United states perspective one of the things in the United states said little pool through was an increase in the U.S content and for some of our suppliers and some component manufacturers this is going to be a challenge there is no doubt about that\nI Do think that we're going to see more Fillmore aluminum that's from North America in our vehicles the biggest concern our members are going to have\nAnd we're going to have to work really hard with all three parties can minimize those costs because consumers are going to get any value out of it and that's going to be our next a real challenge for as we look for that Greenland\nAnd Wilson is senior vice president of the motor and equipment Manufacturers Association thinks we're speaking with us today thank you it's a pleasure\n[noise]\nCommunities across the country are grappling with a new kind of chemical pollution in drinking water it's called pee fast a group of thousands of chemicals used for decades and products like ... pans\nTo science and regulation around this still aren't settled leaving some people in limbo New Hampshire Public Radio's Annie Ropeik has the story\nJillian lanes family built a house in a tree lined cul de sac in the New Hampshire town of green on a recent morning as she wrangled her three young daughters door she pointed at a picture window for the woods in the backyard\nAnd that's\nIt is a federal Superfund site called Coakley landfill lane didn't even know it was there until two years ago when she heard of an nightmarish discovery nearby a cancer cluster of young kids all with the same rare deadly diagnoses lane was desperate to know for girls were risk so she started reading\nUnderneath one of the articles was just a comment from a Public Citizen that said Coakley question mark and I was like totally at the heck is ... so I started Googling it\nShe found a former town dumb but turned toxic waste cleanup area just through the woods and ... [noise]\nBob Sullivan city attorneys nearby port Smith he says the landfill now a huge grassy hill used to be an empty Corey and that was\nActually kind of stayed back in the Nineteen seventies when people looking to get rid of municipal waste trash they would find a hole in the ... somewhere in Philadelphia [noise] public seemed like a good idea\nBut heavy metals and manmade toxins were seeping from a landfill into neighbors' water wells Coakley shut down and became a Superfund site in the mid eighties\nIt was covered with a cap to keep Iran from washing out more toxins for years this put the public fears to rest then amid news of the cancer cluster and twenty sixteen workers made an alarming discovery high levels of pee fast chemicals and surface waters around the landfill\nSince then traces of these industrial toxins have also turned up in nearby wells officials are still working to pinpoint where the chemicals come from\nAnd they may never be sure what caused the cancer cluster but pee fast chemicals have been linked to a wide range of health effects including cancer so neighbors like Julian Lane are still terrified\nRight and so were drinking the water and were bathing and brush her teeth in it and we have no idea that we're living with this potential problem\nLanes family spent thousands of dollars on high tech water filters and she devoted countless hours to public meetings and petitions for more clean up an aid\nThe environmental protection agency says the ... and nearby wells is not a threat based on state and federal standards\nW. E. V. H. Hanover Ninety One point three W. E. D. and king Ninety point seven\nWABC Gore I'm One of seven point one\nW. E. D. J. Jackson Ninety nine point five W. E. V. S. Holbrooke Ninety point three and\nW. E. V. cute little in Ninety One point not hand on line and in each PR dead word [noise]\nProtestors against Brett Kavanaugh are confronting Senate Republicans and the GOP is not happy about it\nBut I Want to make it clear to the table or treasure my members around the hall there\nAre us on the air for are going to they're all man tell me about it for Wednesday October third it's all things considered\nAnd Peter below more from Capitol Hill in this hour of all things considered on an HP are also in the wake of sexual assault allegations against his Supreme Court nominee President Trump has been talking about how men feel in such situations\nCould that help his party and the twenty Eighteen elections and scientists have detected plenty of planets outside of our solar system and now they say they've found the first moon circling one of them\nWill get some sunshine as we can details on the weather coming up and just a few minutes then H. P. R. news headlines coming up as well first we'll get the latest from NPR's [noise]\n\nLive from NPR News in Washington I'm ... fear the White House is defending President Trump's comments about Christine Blasey Ford who's accused Supreme Court nominee Brett Kavanaugh sexual misconduct ... more\nWhite House press secretary Sarah Sanders says Trump was not making fun of forward during his remark that Mississippi campaign rally during the event the audience laughed in a plot as Trump questioned Ford's account of the alleged sexual assault\nSeemed to me that he was stating facts that Dr Ford herself a laid out in her testimony once again I every single word that judge Kavanaugh has said has been looked at examines picked apart by most of you in this room\nCannot have categorically denied all allegations of sexual misconduct some Republican senators have complained that Trump's remarks were inappropriate ... NPR News the White House\nAnd ... soon be in the hands of a jury as Patrick Smith from member station WBFO easy reports Van Dyke attorneys wrapped up their defense today\nThe defense called twenty witnesses over the span of more than a week much of the testimony was aimed at trying to undercut a dash cam video showing Van Dyke shooting Seventeen year old Laquan McDonald sixteen times\nThat video at the centerpiece of the prosecution's case and shows McDonald walking away from police and Van Dyke keep shooting until his gun is empty even while McDonald is laying on the ground\nProsecutors called the former FBI agent and use of force expert who testified that the shooting was unjustified on Tuesday then I took a stand in his own defense he choked up describing the shooting and he testified that he was in fear for his life when he shot closing arguments are scheduled for Thursday for NPR News I'm Patrick Smith in Chicago\nSecretary of state might palm Pelayo says he is cancelling a treaty with Iran that dates back all the weight of Nineteen fifty five establishing economic relations and consular writes between the two nations\nMove comes on the heels of a ruling by the United nation's highest court ordered us to lift sanctions against Iran the fact imports of humanitarian goods store does not enforceable bomb pale telling reporters day the ruling is disappointing but also a loss for Ron\nThis is a decision frankly that is thirty nine years overdue\nIran alleges sanctions imposed by the Trump Administration after the U.S withdrawal from the twenty fifth the nuclear deal violate the Nineteen fifty five treaty\nPrivate sector jobs report out ahead of friday's broader base government data on hiring show solid gains last month payroll processing from a deep pie says private sector companies added two hundred and thirty thousand jobs in September the most in seven months there were games and construction professional and business services and education\nOn Wall street today stocks closed broadly hired the Dow Jones industrial average up fifty four points to twenty six thousand eight twenty eight that's a record high as that goes up twenty five points the U.S and the five hundred closed up two points today\nYou're listening to NPR\nIt's five oh for this is an H. P. R. News I'm Peter yellow Amazon announced yesterday it would raise the minimum wage to Fifteen dollars an hour for all us employees some advocates for a higher wage are applauding the increase in the Granite State in each PR Robert gorilla reports\nThomas Lopez is an alderman for the city of Nashville where Amazon runs of film and center\nA company as a ... for years started the holiday shipping interest eating a industry so adding them become more socially conscious and aware is going to be positively felt\nAmazon acquired online pharmacy pill pack this summer which employs about five hundred people in Manchester Amazon says the wage increase would also apply to subsidiaries but it's not clear how pill pack employees would be affected for H. P. R. News I'm Robert grove and\nState health officials have identified a batch of mosquitoes in Manchester with the virus eastern acquaintance ... latest or triple e this is the third detection of Tripoli in New Hampshire this season there have been no reports of human cases and the virus so far\nTripoli is less common but more serious than the mosquito borne West Nile virus symptoms are flu like an appear for ten days after being bitten\nManchester health department says as of now it does not plan to spray for mosquitoes but it will continue to monitor mosquitoes for Tripoli until mid October\nResidential treatment facility for kids struggling with addiction is slated to open in Manchester in early November as an HP are taught Brooklyn reports the executive council approved a four year contract today\nThe group granted pathways will operate the treatment center it's going to have thirty six beds all of them dedicated to servicing kids ages twelve through Eighteen who had substance use disorder\nFacility is located on the grounds of the new youth services center in Manchester that's the state's secure facility for juvenile offenders recent reforms in how the state detained and punishes juveniles who break the law has reduced the puppy\nSupport for an HP ours live stream comes from you our members and from the law firm of or in Reno sustain excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges find out how or in Reno can help you on line at or dash Reno dot com\nLow sixties and more sunshine on Saturday with ties again in the low sixties\nSupport for an HBO comes from listeners like you and from tops held freedom plant and northeast tilted dental a partnership created for better or an overall health right here in New Hampshire learned more at ... dot com\nAnd from gr pony automotive group with ... and certified ... vehicles available to meet the used car automotive needs of New Hampshire one simple price no hustle no surprises\nThis is an age PR\nAll things considered is here because listeners like you needed and because listeners\nLake you supported and we'll have more all things considered up in just a moment but first we're asking you to contribute in any amount to help pay for the programs that you love New Hampshire public radio\nThis is our fault fund drive you can give right now through your checking account or your credit card at an H. P. R. dot org I'm Todd book ... year with more is Emily ...\nOnly about fifty three minutes remaining on this drawing were giving away one thousand dollars in southwest airline gift cards for you to start planning your winter escape winter is coming in now is a great time to start planning a warm weather get away\nA southwest you can slide to a robot Jamaica Bermuda [noise] um you could visit family down in Key West or out in California um but you know be able to win this drawn unless you put your name into the hat\nAnd the best way to do that is by making your guest now at N. H. P. R. dot org\n[noise] this is alpha Chang of all things considered\nAnd you hear on N. H. tiara helps you helped your neighbor helps instill that shape our own opinions about the issues that affect\nUs all Public Radio's journalists investigate issues that often means asking difficult or pointed questions these journalists provide you with contacts they bring to you viewpoints some diverse voices and each PR is funded by individuals listeners who give ten dollars or twenty dollars a month\nAnd your support allows your public radio dream was to remain objective and preserves the editorial independence that makes him hamster and this country a more informed by support the news you try to contribute to engage PR today your tap\nAnd H. P. R. dot org or help make us a more informed place by calling one eight eight eight eight zero five six four seven seven and offering your donation you know all day long you've been immersed in\nWork or maybe emails meetings demands running around Erin's\nYou often can't wait to get in the car and leave it all behind right and what's the first thing that greets you when you start the car will\nProbably all things considered briefing you on the day's events and during this membership Dr we're asking that you support New Hampshire public radio by by paying for the listening that you do every day and maybe a monthly ongoing contribution is the best in the easiest way for you to do it\nOr do that right now sign up at an H. P. R. dot org or call us at one eight eight eight eight zero five six four seven seven\nYou've ever wondered what it means to be a number of an HP are well here it is numbers are simply are frontline supporters because they contribute financially to help pay for the program to help pay for shows\nLike all things considered like marketplace like the daily it's it's that simple it's very important and with your an HP our membership we promised to continue to deliver the best news and information possible to you every day your\nThe day after the hearing conservative host Laura Ingraham offered this analysis on Fox News\nI don't think the whole year the woman thing [noise] I Wonder if they haven't been off more than they can chew on that because I think it could easily as well turn out to me the era of the man who feel like the target is on their back all the time and it's not fair\nAnd NPR PBS NewsHour Marist Poll out today found a big swing in public opinion among men following the hearing with at ten point increase in those saying they plan to support a Republican candidate in the upcoming midterm elections parakeet NPR News\nAnd now to Chicago where a police officer Jason Van Dyke defense team rested its case today ... is\nCharged with murder for the on duty shooting of a black teenager look one McDonald\nIs the first time in decades that Chicago police officer has been charged with murder for an on duty shooting at McDonald's case caused major political upheaval in Chicago and sparked reforms to with police department from member station WBEZ easy Shannon Heffernan\nReports when Jason Van Dyke shot the comic Donald in October twenty fourteen police first reported that he was lunging at them with a knife\nBut after political pressure and a lawsuit the city was forced to release a dashcam video of the incident\nThat video is a fundamental piece of evidence in this trial in it and the Donald appears to be walking away from officers and she has been shooting him sixteen times including after the teenager was lying on the ground\nAfter its release activists took to the streets chanting sixteen shots and a cover up three officers at the scene were charged with conspiracy Van Dyke was charged with murder yesterday he took the stand ... testimony\nSee we've noise from\nMore rights or ...\nOr ... or [noise]\nGiving cross examination prosecutors ... to point out where and that infamous dash cam video McDonalds can be seen raising the ninth video [noise]\nDoesn't show my respect\nThe prosecution then asked him about an animation created by his own defense team with the goal showing ... perspective again they asked him to point out where the video shows McDonald music the night\nIt's not showing what I saw is showing the back of my head in\nThe index defense team called a psychologist at the stand to testify about how being a life threatening situation can more memory and perception other defense witnesses including people who ... McDonald while he was in juvenile detention they recalled incidents where McDonald's shut it threats and resistant staph\nSharon Mitchell is a former defense attorney he suspects index lawyers are trying to distract jurors from what the video shows\nHow you decide this case really ride along with your thinking much more about what ... McDonald's actions or whether you're thinking about Jason Ben thanks actions and the more the distance can draw you to a quarrel McDonnell is the least amount of time you're thinking about what Jason Van Dyke\nDefense also brought witnesses to testify about the effects of PCP which McDonald had an assistant prosecutors made the point the plum McDonald is not on trial and throughout this trap have again and again showed\nGeorge the video the defense team rested its case today and each side is expected to make closing arguments tomorrow before the case goes to the jury radio news I'm Shannon Heffernan Heffernan works with a team at W. be easy to produce a pod cast on this trial called sixteen shots [noise]\n\nYou're listening to all things considered from NPR\nSupport for NPR comes from the station and from constant contact who's email marketing tools help small businesses and nonprofits connect with their customers learn more constant contact dot com\nFrom Baird of financial partner guiding families businesses communities and institutions since Nineteen Nineteen R. W. bears dot com has more information\nAnd from the Pew Charitable trusts celebrating Seventy years of serving the public learn more at ... dot org slash Seventy\nOr as certain type of person I'm Sarah McCammon and we know that people who listen to NPR are more likely to do things like vote and call their representative but it's a chicken or the egg kind of thing do you listen because you're engaged citizen or are you more engaged because you listen\nWhatever the case and informed public is essential to our democracy so support the news that keeps you in the know [noise]\nThat's the way to do that is to go on line now to an H. P. R. dot org you can also give us a ring at eight eight eight eight zero five six four seven seven this is an age PR fall fund drive and we're asking you to contribute any amount to help pay for the news you trust because\nThis is a number of Dr we our listener supported a public radio with this works when every single listener contributes what they can you can make that get through your checking account or credit card at N. H. P. R. dot org and then like working with me now is Todd ...\nWe've got just thirty five minutes to go if you want to get in for this thousand dollar Southwest Airlines gift card uh think of all the places that you could travel with a thousand dollars a ... it sounds like a very nice gift to make the best way to give his online through your checking account or your credit card\nFive bucks a month ten dollars a month whatever works for your budget and get yourself a chance to win a thousand dollar southwest gift card\nYou'll be automatically entered into the grand prize drawing coming up I'm sometimes in the near future a once in a lifetime trip for to to the winters choice of either Australia New Zealand and H. P. R. dot org or call one eight eight eight eight zero five six four seven seven\nQuality and honest reporting sanity searching for the truth smart journalism these are just a few of the many comments we have received over the last week\nFrom our generous supporters listeners just like you your family your friends your co workers and people you've never met before\nWho have taken a moment in the last week to make their contribution to an HP are you can join them right now it's so quick and easy to do he'll also get yourself entered to win that drawing that Todd mentioned earlier that one thousand dollar\nSouthwest airline gift card where you can travel wherever you'd like to like you have to make that get now before six o'clock at an H. P. R.\nDot org if you're thinking about becoming a new member well consider this if you listen on your way to work and on your home each day a let's say an hour or two each weekend that could add up to a couple of hundred hours per year maybe a couple of thousand hours per year that's a lot of time it's a lot of you know\nCompared to movies or basketball games or whatever else you're into I mean you Public Radio's important to you you spend a lot of your time on it or we're asking you to spend a little bit of money on it we're asking for a first time gift of five dollars a month or ten dollars a month to help pay\nFor the programs that you rely on a an age pairs one of the best sources of information and entertainment\nYou know bargains you're going to find anywhere contribute right now as an H. P. R. dot org\nAnd then consider maybe joining the leadership circle of an age PR maybe you've listened\nFor five years maybe ten years maybe Twenty years to engage PR and you've never made a contribution\nThen maybe that one hundred dollar a month sustaining membership is something that works for you if that sounds like a reasonable uh I'm a ... an offer we can offer you a pair of VIP tickets to see and PR is host of one age Joshua Johnson he's come into conquered on October Eighteenth\nUh you'll get a premium seating plus a special invitation to a small reception with Joshua Johnson after the show when you become a part of the leadership circle a at that one hundred dollar a month level if that sounds reasonable to you'd consider it and give us a call triple eight eight zero five\nSix four seven seven you can also set up that sustaining gift on line and H. P. R. dot org\nAnd each beers coverage of issues and topics\nThey connect you to your community by introducing you to people and places that you might never encounter and one way we can do that is through our podcasts think about ah something wild which explores\nThe wonder the landscapes of New Hampshire a shows like word of mouth which explore you know just what a unique and interesting place this is to live the people who ... who make up the fabric\nOf New Hampshire so when you become an Hussein or you'll support podcast from New Hampshire Public radio\nThat keep you connected and H. P. R. dot org\nLots of listeners give on line at an age PR dot org it's so quick and easy to make your gift they're also while you're on line you can take a minute to decide if you'd like to thank your gift our way of living you know that we really do appreciate your contribution\nAnd when you get on line and you save us the price of a phone call it's so simple you can use your credit card or your debit card at an H. P. R.\nDot org you can also give us a call it's so quick and easy one\nEight eight eight eight zero five and six four seven seven when you make your gift right now you'll be entered to win that one thousand dollar Southwest Airlines gift card\nNow an H. P. R. dot org\n[noise]\nFive twenty nine this is all things considered on an H. P. R. and Peter be yellow support for an HP are comes from listeners like you stand firm listen community services denouncing the opening of their new thrift store in Lebanon accepting donations of clothing furniture housewares and more [noise]\nAnd maybe it's for the local news that we bring you every afternoon from Casey make governments coverage of new voting laws in New Hampshire and challenges to those laws in court\nJosh Rogers up close look at the complicated politics surrounding the race for governor you listen\nBecause you care about what's going on in the state and it's important to remember that you make all of this outstanding award winning news coverage possible you can make a difference in today's world by becoming an HP our supporters support something that is important to you at an H. P. R. dot org\nHere's a great reason to give right now when you make your gift\nAt an H. P. R. dot org you'll be entered to win a Southwest Airlines one thousand dollar gift card were given this away in twenty minutes at six PM twenty minutes or imagined telling a friend or family member that you're going to take them on a trip and that you\nHave the airfare covered a Southwest Airlines one thousand dollars they go everywhere you can go anywhere with this thing it's good if you want this you only have twenty minutes left though to throw your name in hat give right now at N. H. P. R. dot org\nAbout becoming a new member if you listen on your way to work and on your way home each day and maybe an hour or two each weekend\nI've maybe ten dollars a month to help pay for all things considered for marketplace and the daily that makes an HP are one of the best information and entertainment bargains you'll find anywhere you can make your contribution now at N. H. P. R. dot org\nPerhaps you've never contributed to an HP are before\nWell give give me a moment to explain why your gift matters at its heart we are a grassroots organization it's contributions from our members giving\nAt the five dollar a month or ten dollar a month or Fifteen dollar a month level all those contributions they add up to the most important portion of an age peers operating budget it's the collective voices of new members and all members that become more powerful than any other single source\nOf income so make your first ever gift to New Hampshire public radio if you've never given before right now and in H. P. R. dot org\n... Richard from Manchester he says as a conservative either I appreciate and each PR programming which provides balanced information\nAnd they just sharing in Durham she says\nAnd each PR is daily trustworthy in for an informative news it's the only thing I listen to she loves the marketplace and she's very happy to hear that science friday is back on friday afternoons if you agree with Sharon and Richard if you appreciate\nThe well balanced information and news content you receive on an HP our support it now and H. P. R.\nDot org remember the thousand dollar Southwest Airlines gift card is coming up in just about Eighteen minutes or so to make your donation now so you have a chance to win that terrific prize you can give on line at N. H. P. R. dot org or pick up the phone call one eight eight eight eight zero five six four seven seven\nThousands of planets have been detected around far away stars in recent years and the scientists studying those planets may have found the first moon NPR's Nell Greenfieldboyce reports\nEven in our own solar system some of the most intriguing places to hunt for life are moons like and sell it is and Europa around Saturn and Jupiter these moons seem to have oceans of water and he's an icy crust\nIt's been hard enough to find planets around distant stars let alone moons still David chipping thinks he's finally found a really good evidence for one\nEvent is it's so strange and it's the first of its kind that demands a higher level of rigor and skepticism than you would normally apply to a run of the mill detection tipping\nIs an astronomer at Columbia University he points out that our moon the one with the astronaut footprints isn't just a pretty face it keeps our planets tilt stable it affects the tides\nSo when we look for in a twin I think one of the Muslims things you might ask you to have a mean twin because it seems to have a large influence\nWhat's more he wants to find moons because when E. T. calls home there's no reason home can be a moon\nHas been a key driver for us for a while just trying to understand because macabre toss out the that we look for ...\nA couple of years ago he and a colleague named Alex teach II begins scrutinizing data collected by NASA's Kepler space telescope\nThey checked around three hundred planets for any weirdness that might mean a moon what popped out was a planet called Kepler sixteen twenty five feet ain't Jupiter sized world that orbits a star around eight thousand light years away\nThey followed up with the Hubble Space telescope and today in the journal science advances they say this gas giant appears to have a Neptune sized moon\nStill ... that we think is the leading hypothesis the researchers have requested more time\nNext may if this does pan out and turn into a true discovery it would be really revolutionary Megan but Dell is an astronomer at the flat aren't Institute in New York\nShe says moons are kind of the next frontier when it comes to understanding alien solar systems they capture imagination she says if this moon can't be confirmed new telescopes mean that before\nToo long scientists should be in a better position to find real moon if they're out there Nell Greenfieldboyce NPR News support for NPR's\nComes from the station and from lumber liquidators offering flooring installation nationwide with new styles of hardwood and would look waterproof flooring more lumber liquidators dot com or one eight hundred to two seven four zero three six\nFrom western hotels and resorts west and is committed to the wellbeing of travelers with offerings like heavenly beds a super foods are rex menu and gear lending for when workout gear is left behind it home western let's rise learn more head west in dot com\nAnd from tire wreck offering a tire decision guide to help customers buying tires that fit their car and driving conditions with networks of more than seven thousand independent installers tire rock dot com helping drivers find deliver install\nIn the past month three people in New Hampshire has been charged with Sony's promoting twice in the twenty sixteen general elections\nThese people were identified using information from the interesting voter cross check program that's a database that allows states to compare their voter rolls\nAt one point as many as thirty states used it is but recently some states have stopped for a look at why we turn to Peggy Lowe she's Casey you ours investigations editor and she has reported on this issue in Kansas where the program was created ... welcome to all things considered\nHey thank you Peter so tell us why have some states stopped using the interstate voter cross check program\nWell it's really interesting to cross check program this year came into a lot of focus because a self appointed cross check watchdog for lack of a better term a woman from here in the Kansas City suburbs\nIt got kind of a league of sensitive information and sell it came to light at the cross check system doesn't have a great deal of security\nUm meaning a lot of the sensitive information about your voter registration whether that's your address your phone number your date of birth your Social Security number some of this has leaked out so\nSeveral states it became very alarmed when if I hit the press and\nThe what had been about thirty states that were part of the project system are now down to twenty five because of the concerns over the security breaches\nSo the program was created in in Kansas what was its original purpose\nRight it was created in two thousand five by that then secretary of state and it was basically in agreement with just for local tiny Midwest states Kansas Nebraska\nIowa and Missouri and they were in talking to each other said hey we have a lot of folks moving across state lines and so\nPerhaps if we just run these checks we could keep our voter lists cleaner is part of federal law that says each secretary's day each state has to keep their voter lists up to date that there's a certain amount of maintenance required so it just started as that package it hasn't five\nTimes the use of the program changed under Kansas secretary of state Kris Kobach\nTell what had been this sort of small good government program that began in two thousand five in Kansas really grew to this huge potentially powerful database\nOf state and twenty eleven he is a big anti immigration crusader and so anyway he he inherited and twenty eleven and under his purview he takes it all over the country and promotes it a different uh association meetings and conventions that include other secretaries of state\nSo he grew from just for states to\nAround thirty and it held at one point half of all the a voter registration\nIn the country that's that's pretty remarkable\nAre there any alternative programs to this particular program that work better\nSo there has become a secondary um system it is called electronic registration Information Center for Eric as it goes by the acronym Eric it was launched by the Pew Charitable trust in twenty twelve and many election watchers consider that to be much more accurate", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Keene", "day": "03"}