{"month": "10", "state": "NH", "station": "WEVN", "content": "... ... s Nashua eighty eight point three W. E. V. H. Hanover Ninety One point\nThree W E the end keen Ninety point seven\nW. E. D. C. ... one of them point one W E v J Jackson Ninety nine point\nFive very easy access code\nBook Andy point three and W. E. V. cute little pin Ninety One point nine and online at an H. P. R. dot org [noise]\nAfter a contentious debate or the Senate held a key procedural vote on Supreme Court nominee Brett Kavanaugh today and it looks like Kavanaugh has the votes needed to join the U.S Supreme Court it's friday it's all things considered from HP are\nI'm beyond Kogan good afternoon protesters in Washington and around the country came out ahead of today's procedural Senate vote to move forward with judge Brett Kavanaugh's confirmation to the Supreme Court will have more on that coming up\nAlso jobs report released by the government today showed unemployment falling to three point seven percent the lowest rate and fifty years and the Silent Spring Institute will study how the fast chemicals affected the health of children in Portsmouth and on Cape Cod\nLooking for a mostly clear night tonight low temperatures in the thirties the mix of southern clouds over the weekend the news is next\nLife from NPR News in Washington I'm Luis skills on a Republican Senator Susan Collins of Maine has broken the says that she says she will be a yes on the nomination of judge Brett Kavanaugh to the U.S Supreme Court\nMy fervent hall\nIs that Brett Kavanaugh\nWill work to less than that ... in the Supreme Court so that we had far fewer five four decisions\nAnd so that the public confidence in our judiciary and our highest court is restart\nMr President I Will vote chicken from judge cabinet\nOne Senate Republican who voted to stop the nomination in a closed procedural vote this morning Lisa Murkowski of Alaska\nI made me\nVery very difficult to get me that I Can't tell you man\nThought maybe just maybe [noise]\nMeanwhile the American bar association has announced it is revisiting it's evaluation of Kavanaugh after last week's Judiciary Committee hearing a final Senate vote expected tomorrow evening\nThe jury had reached a verdict in a murder trial of Chicago police officer Jason Van Dyke guilty second degree murder he was accused of shooting Seventeen year old ... McDonald's who was holding a knife sixteen times in October of two thousand and fortunately [noise]\nThe release of police dash cam video of the shooting sparked massive protests three years ago that died was also found guilty of sixteen counts of aggravated battery with a weapon not guilty of official misconduct\nThere soaking grains of Hurricane Florence appeared to get the job growth last month but as NPR's Scott Horsley reports unemployment continues to fall to its lowest level in nearly fifty years\nEmployers added one hundred and thirty four thousand jobs in September well below the reason average but much of that slow down is likely to be temporary as hotel shops and restaurants reopen after Hurricane Florence the unemployment rate compiled from a separate survey continue to drop to just three point seven percent what else economists Kevin Hassett says\nOpenings than there are workers to fill the if you look at things like the the surveys of businesses than they list finding workers is one of their main challenges right now that demand for workers is so far but only modest upward pressure on wages\nEarly wage growth over the last year as average less than three percent Scott Horsley NPR News the White House\nOn Wall street get that close that gap Jones industrial average off one hundred eighty points at twenty six thousand four hundred and forty seven NASDAQ down Ninety One this is NPR\nSupport for NPR comes from NPR stations other contributors include progressive insurance committed to offering a streamline shopping experience where home and auto can be bundled together now bats progressive learn more at progressive dot com or one eight hundred progressive\nThis is an HP our news is for all for 'em Dan Hogan that afternoon New Hampshire tourism officials are projecting some three hundred thousand visitors to the Granite State over the Columbus Day weekend and H. P. R. as Robert ... has more\nOvernight visitors are expected to spend more than one hundred and Fifteen million dollars this weekend that's good news for Tom will point and keep her at the Adair country in a restaurant in Bethlehem\nWar slamming so we're completely sold out for the weekend and our dining room is like we we couldn't do any more business\nState tourism officials they expected visitors and spending for this Columbus Day weekend is up five percent year over year this is New Hampshire second busiest travel season and its forecasted visitors will spend one point four billion dollars in the Granite State this fall for H. P. R. News I'm Robert grow them\nThe ACLU of New Hampshire along with a group of news organizations are calling on the state attorney general to release in internal list a police officers with credibility issues\nThe state has kept the so called Laurie lists since two thousand for it contains the names of more than a hundred Seventy law enforcement officers who have\nSustained disciplinary issues and may not be appropriate to testify in criminal trials the ACLU filed a suit in superior court on friday calling for the release of the list under the state's right to know law the eighties office has denied request in the past signing confidentiality rules\nRed Sox will be hosting the Yankees tonight at Fenway in game one of the American league east playoffs\nIt'll be mostly clear tonight could see some areas Apache frost in low lying areas lows tonight in the thirties for tomorrow mostly sunny some early morning frost especially in northern parts of the state high temperatures in the lower sixties\nPartly to mostly cloudy on Sunday chances some showers high temperatures upper sixties slower seventies and Monday\nAnd will be mostly cloudy with a high around sixty degrees support for an HBO comes from you our listeners and from west Lebanon feeding supply the upper valley is locally owned home for all things pet an animal over forty five brands of pet food and so much more west Lebanon supply dot com\nAnd Massachusetts General hospital using research to develop treatments were complex conditions all the help their patients get back to their lives Mass General revolutionizing care\nThis is an HBO our news [noise]\nSupport an HP are today and you could win it's typical lifetime to land down under are lucky winner has a choice between Australia New Zealand which means you'll have to choose between kangaroos are key leads the bright lights in Sydney opera house for this stunning views of mount cook national park\nTowards the news you trust today as an an HP are sustaining and you'll be automatically and to do when they get now here town [noise]\nJust go to an H. P. R. dot org I normally cork in with me is Rebecca ... and just a few minutes we'll get right into all things considered of course a big Newsday judge Brett Kavanaugh has hit critical\nWas on his confirmation is expected as soon as tomorrow if you've been listening for a little while now you know that we just took live a breaking news coverage of Senator Susan Collins Republican from Maine and her Senate floor speech confirming that she will vote in the affirmative\nUh again as early as tomorrow this is a important news and that's why you listen to all things considered if you listen often if you rely on this information maybe it's time for you to put something back into it you can become standing member now it's super quick and easy to do at\nAn H. P. R. dot or I think it's important to point out that ah the final day of the fund drive is really important day for us to raise money on the air and yet it was an easy decision to break away from fundraising to cover this developing and very important story that we know our listeners care very much about\nThat's why we did it and it's also why we're asking you to do your part to support this kind of journalism right now and when you do you will be entered into when the drawing we're doing and just a couple of hours the deadline is less than three hours away for a lucky winner to win a trip of a lifetime of a choice to go to either Australia or New Zealand\nThat could be you but only if you make a gift and the next couple of hours to get it done right now while you're thinking about it head on over to an H. P. R. dot or that's where I get it done before you begin\nYour long weekend you can go into your weekend known you've done your parts of support and H. P. R. and please remember that you are not the only one who relies on the station there are people all over the region who lives in every day but for whatever reason are not in a position to contribute\nAt one point you were probably in that place where a monthly contribution was out of the question but now\nYou're able to do that choosing amount that works for you give now at an H. P. R. dot org do it before seven o'clock and you'll be entered a win this incredible drawing were giving away a trip of your choice to either Australia or New Zealand and H. P. R. dot org\nMany first time givers make a gift of ten dollars or Fifteen dollars a month right out of the gate probably because that's about what it costs to subscribe to services like Netflix\nThinking about how much you listen to an age PR we had about twenty five thousand dollars left to raise to end this Dr successfully\nAnd we're not asking you to write that whole jak we're asking you for ten dollars a month or Fifteen dollars a month you can get the H. P. R. T shirt or the teacher and the mug\nAnd accusers came forward to the Alabama Senate race yeah yeah there there was there's corroborating that a lot of his accusers had that that made their accounts convincing and I I didn't personally see that in in any of these circumstances\nI also want to ask you both about the political consequences of this debate because when Ford first testified in front of the Senate Judiciary committee Democrats and Republicans called are credible and express sympathy and admiration for her willingness to speak publicly this week some took on a different tone starting with President Trump here he was at a rally in Mississippi on Tuesday night\nHow did you get home I don't remember how did you get there I don't remember where is the place I don't remember how many [noise]\nThe audience laughed and applauded and at that same rally Trump said this is a very scary time for young men in America with the midterms one month away Bethany do think this will have an impact\nYeah absolutely and we're we're already seeing that as far as fundraising and\nAnd sort of enthusiasm from Republicans this has been a very unifying moment for Republicans I mean we ... we saw Brett Stevens and the New York times applied to President Trump and that's something that I don't think anyone thought that they would have seen three weeks ago let alone um let on now but\nThis is this is really I think going to to drum up a lot of enthusiasm on the right in a way that hasn't existed since twenty sixteen\nCan really do think that I'm ... and will last for the next month if Kavanaugh is confirmed with the court this weekend is expected\nI think that's a still unclear I mean there are definitely was a fear Republicans told me they were afraid that the poor part of their base would revolt against them if they didn't get Kavanaugh through now that won't happen it seem more like a defensive play\nI don't know if that's enough to counteract the energy that we're seeing right now on the other side that is burned by the sort of gender war it seems that's being a exacerbated by the president or with the comments that you played\nA I think that really ... the other side the losing side traditionally is the one with the momentum after a fight like this\nAnd just briefly from each of you know that it looks like having a will be confirmed to the Supreme Court apart from the shift to the right ideologically that he was expected to bring to the court to each of you think that the echoes of this fight will linger in the Supreme Court itself Kimberly\nIt could I mean look Clarence Thomas still speaks with a lot of disdain about his own confirmation process so it's very possible this is a consensus building a group\nThat's how they have to be the function so it's tough to see how that doesn't play a role\nAnd briefly Bethany will give you the last word [noise]\nYeah I I think that this has radicalized a lot of people and I think have announced one of them I I I'm not sure how much of this sort of\nThis experience has impacted his judicial opinions but I I Can't see that it hasn't changed his mind somehow about due process about the presumption of innocence um I I think that this probably did maybe pushing more right were then he would have otherwise been had to spend his mood confirmation process\nThat's Bethany Mandela editor of Russia and columnist for the forward and Kimberly ... chief Washington reporter and columnist for the Boston Herald thanks to both of you have a good weekend thank you thanks [noise]\nSupport furnished ... live stream comes from you our members and from the law firm of or in Reno sustained excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges find out how or in Reno can help you on line at or dash Reno dot com\nAnd from zoom zoom offers cloud video conferencing online meetings and the video conference room solution in one platform featuring digital video and audio would screen sharing account registration and more zoomed on us\nI'm Mary Louise Kelly we live in unsettling times and as we all try to make sense of forces shaping our world country our towns\nWere than ever I feel our job at NPR is not telling you what to think it's not yelling we try to be a force for ... home for civil and respectful fierce questions to the people we interviewed\nWe sure your support for this station become a sustaining member and thank you\nAll you've got to do his head on over to an H. P. R. dot org to get that done I'm Rebecca ... and with me in the studio this evening is Emily clerk and this fall fund drive ends in about two and a half hours we have about twenty four thousand dollars left to raise\nListeners support from listeners just like you is the most important source of revenue for any age PR so it was just a couple of hours remaining\nWe're asking you to say ten dollars a month Fifteen dollars a month to say that is worth it to me to support the kind of quality journalism I get here each and every day had an over right now before you leave the office for the long weekend and H. P. R. dot org\nAnd when you contribute you will be entered to win the big finale give away of this drive the once in a lifetime trip for two to Australia or New Zealand the opportunity to get in on this end today at seven when this Dr ends that's only as Rebecca said two and a half\nHours away from now so the winner choose as either New Zealand or Australia the trip includes round trip airfare from Boston\nAnd accommodations for eight nights so the best way to give on line through your checking account or credit card debit card five ten Fifteen dollars a month whatever works best for you but do that now before you start your weekend at an HP are dead or\nI bet you can find drives here at an age PR for a really long time and I can say with confidence that this is one of the best trips if not the best trip we have ever given away during a fund drive if you are considering whether or not an age PR is a nonprofit organization that you want to support\nThat should tip you over the edge you have a chance and two and a half hours to win the trip of a lifetime\nThinking about how much time you spend in a car listening to an age PR thinking how much time here at home just with the radio and listening to an age PR consuming this amount of content it's worth ten dollars Fifteen dollars a month and you're supporting the highest quality journalism imaginable\nMake a gift right now we make it very easy it takes less than two minutes at N. H. P. R. dot org\nAnd Karen in New castle she says an HP are as a radio station I can trust it's eye opening entertaining and so knowledgeable across the board\nThank you to Gabrielle in Hollis she says that she's already a sustaining member but wanted to add a little extra\nSo she appreciates all the programming and each PR gives her each and every day you can do the same way of twenty four thousand dollars left to raise we're closing this thing down at seven pm tonight that's just two and a half hours away so get yourself entered to win this grand prize finale trip a trip for two\nTo either your choice of Australia or New Zealand the best way to make your gift and to make sure that you're in this drawing is to go to an HP are dead or when\nYou're at and H. P. R. dot org yes check out all the top stories of the day but also check out our thank you gifts to thank you get this drives have been very popular because their brand new we have a beautiful new\nAnd mug we will send you that T shirt for just ten dollars a month it's going to become one of your favorite teacher to one of those very soft\nQuality vintage T that beautiful and H. P. R. design on it with the headphone showing that you love public radio this T shirt will be or is it gifted just ten dollars a month ago a long way toward helping us make our goal plus you'll be entered into when the trip to Australia or New Zealand get it done at N. H. P. R. dot or\nIf you've already started your weekend a little early if you left work maybe you're on the road somewhere and you're traveling with somebody who have that a person sitting shock on go to their phone right now to an H. P. R. dot org because if you wait you're going to forget\nSo do it now while you're thinking about it the number to call his one eight eight eight eight zero five six four seven seven you can also make that gift on line and get yourself entered a win this amazing drawing at an H. P. R. dot org you have just two and a half\nHours from meaning we're closing this thing down at seven and you can help us at an H. P. R. dot or\nA lot of people have said they don't know how they would choose whether they would go to Australia and New Zealand well I'll give you some fun facts about New Zealand that might help you out\nIt has a world famous a high quality wine or you can go surfing skiing snow boarding kayaking ... not sure what that it laying eyes swimming parachuting horseback riding and caving all within a hundred mile radius\nAnd on the same day maybe New Zealand or maybe you want to see those hands were brothers and go to Australia it's up to you\nYou won't get a chance to make the choice though if you don't when you can't win if you don't call one eight eight eight eight zero five six four seven seven or even easier make your gift at an H. P. R. dot\nOr you know that being a sustain her than H. B. R. has its benefits as\nAs a state are you are automatically entered into all the drawings held during these number drives\nA welcome to choose I think you get the annually and you are provided with a special access\nTo the pledge restrain which gives you the ability to listen to any power without hearing Rebecca and I talk about why should give so do your part right now we have twenty four thousand dollars left her race and you can get yourself entered to win this incredible drawing as Rebecca said this is definitely one of the best\nDrawings we've ever offered a trip of your choice to either Australia or New Zealand to make your guest now it's going to be the easiest thing you do this Friday afternoon make it now at N. H. P. R. dot org or AAA eight oh five six four seven seven\nFor twenty nine good afternoon still to come\nProtest in Washington DC and around the country came out of bed of today's procedural Senate vote on whether the move forward with\nJudge Brett Kavanaugh's confirmation to the Supreme Court will get a report on that coming up in about Fifteen minutes support for an HP are comes from you our listeners them from the mortgage center at St Mary's bank offering borrow focused home mortgage options with officers and conquered Manchester Nashua in Portsmouth\nRemember when you discovered at age PR maybe it was in the backseat of your parents' car maybe you just stumbled on this American Life when you were listening one weekend\nThe bottom line is now you're hooked now you listen to all the time it's it's probable that you don't listen to anything else on the ratio besides an age PR and you pay for all sorts of content and your life and we offered this to you for free and we just ask you to support it make a gifted this nonprofit that is bringing us service you actually enjoy and that you trust\nTen dollars a month to Fifteen dollars a month it's not a huge ask for something that you love make the gift right now at an H. P. R. dot\nOr maybe you've been a sustaining member for a while now maybe you've been at that ten dollars a month sustaining membership\nAnd consider than increasing your monthly give to Fifteen dollars a month and if you do you can ask for a year long in New York Times digital subscription which is another favorite choice of those who have already contributed during this drive\nWhen you choose to stinky gift you will get unlimited access to all times content through any smartphone\nTablet or Web browser all year long you will also be included in this incredible drawing that we're giving away tonight at seven PM you can help us up and this Dr successfully and get yourself entered to win and some really cool thing could gifts while you're at it\nMake your sustaining membership online and H. P. R. dot org\nDoes an excellent chance that the winner of the strip of a lifetime to Australia or New Zealand that we're giving away and little over two hours\nAn excellent chance that winter is listening right now that winter could be you could be you\nSitting on that airplane wing off to the land of the key we are the land of the kangaroo it is up to you which one you would choose but\nYou won't get to choose if you don't make a gift so if you've been thinking about it it's a wonderful time to do a little over two hours left to get it done now before that deadline comes and goes one eight eight eight eight zero five six four seven seven is the number to call\nOr go on line and H. P. R. dot or\nThere are so many reasons to make your gift right now but to think of your contribution to an H. P. R. as an investment just a few minutes of your time and a few of your hard earned dollars will bring you hours and hours of great programming guilt free\nYour contribution will make you a shareholder of this an HP our public radio station so good now and H. P. R. dot org you can also give us a call ... eight eight eight eight zero five six four seven seven there are only two and a half\nHours remaining before this drives then you can help us get there an H. P. R. dot org\nFrom where it made a gift she said because I listen to an age PR to get unbiased a thorough and trustworthy news reporting I'm not only connected to what's happening in our state but to our country and the world we have paused are fun drive several times this fall to cover breaking important\nThat kind of thinking that kind of putting journalism first is worth supporting and of course another reason I support it because you have two hours and Seventeen minutes left\nTo maybe when a trip to Australia or New Zealand make that call one eight eight eight eight zero five six four seven seven get your name and it had to win that trip you can also get it done at N. H. P. R. dot org\nAll things considered from NPR News I'm Mary Louise Kelly and I'm Ari Shapiro judge Brett Kavanaugh is likely to be confirmed to the Supreme Court tomorrow now the two previously undecided senators say they will vote yes\nMaine Republican Susan Collins in West Virginia Democrat Joe Manchin announced their support this afternoon people have been gathering in Washington and other cities to protest Kavanaugh's nomination NPR's Brakkton Booker spoke with some of them earlier today\nShow me what the US Capitol they help signs that read believe the survivors and stop Kevin Rachel ... is an attorney who traveled here from Anchorage, Alaska per trip was funded by the American civil liberties union\nHere and part of the hash tag one hundred AK women um it's a group of Alaska when all the way down and dropped our lives are job dollar responsibilities to attend to lobby our senators specifically Senator Murkowski to know against the confirmation of judge Kavanaugh\nRepel ski wound up voting no today as far as tomorrow's vote it's unclear so it is clear on where she stands on Capitol she says she would be trouble to appear before him especially after what she says where his partisan attacks last week during a Senate hearing\nSo I think there are many reasons not to confirm him but I think that one alone can help\nAll of our senators and had great concern\nAnother woman Susan Barnes arrived in Washington from Rockford, Illinois with her daughter Leighton they're also here to protest and read me there are signs Eighteen year old Lincoln goes first\nIntegrity still matters no Kavanaugh is good for a beer with the guy's\nNot good for the Supreme Court\nSusan Barnes says she doesn't want to see ... on the high court because of the impassioned testimony of Christine Blasey Ford she told lawmakers last week that Kavanaugh sexually assaulted her decades ago while they're both in high school\nI definitely felt for eye doctor for it I Am Dr Ford bond\nSays she was sexually assaulted in high school and never wants her daughter to go through something like that\nCapital of supporters were hard to find outside the Capitol today but Michael ... who says he's an independent was happy to take up the mantle because nobody\nElse is out here on his side right now they're all here they need to hear that they need to hear that\nAs the time New York for the Senate to vote protesters huddled around a portable speaker\nAnd the clerk will take a moment in the Senate to record the official tally expected to be fifty one and two forty nine and Brett Kavanaugh nomination we'll get Vance final confirmation vote would happen\nSome protesters vowed to come back tomorrow even though it looks likely Brett Kavanaugh will be confirmed\nIf that happens many say they will take their term casting a vote in next month's midterm\n\nRocky Booker NPR News Washington\nIn July when Kavanaugh was named as the nominee among people gathered at the White House for the big announcement was John Malcolm Malcolm is with the Heritage Foundation that is a conservative think tank here in Washington a think tank which President Trump has credited with helping to inform his thinking on judicial nominees\nIt's a pleasure being with you and my right in thinking you were pleased with how the confirmation vote appears to be shaping up\nYes I'll be more pleased after it's done tomorrow but it is now looking increasingly likely that Brett Kavanaugh will be an associate justice some Supreme Court and I'm very pleased about\nThe numbers are there I let you address some of the questions that have been raised that will continue to be raised in light of his testimony hum and questions about his temperament I'm more than twenty four hundred law professors from across the political spectrum have signed a letter arguing\nThat he demonstrated a lack of judicial testament temperament when he when he was testifying that there should be disqualifying and then I Want to play you a little bit of John Paul Stevens the former Supreme Court justice\nWho weighed in last night and said he no longer believes Kavanaugh should be confirmed here's Justice Stevens\nIs into the room and he should have been here for a when he was nominated but I think that his performance during the hearings cause me to change my mind\nJoe Malcolm so these are not he said she ... she said questions there that are being raised these are serious questions about his temperament what do you think\nSure well we don't have to guess about a judge Kavanaugh's a temperament we have twelve years of experience with him being on the DC circuit court of appeals to bar who\nKnow him well say the justice that they've known before was not the man on display last week will testifying\nWell that that is certainly true I think if there were some people that would have preferred that Brett Kavanaugh in the midst of an incredible onslaught against him his reputation as family that he would have acted like a ton of time\nI had by the way he acted like in ...\nI think that response which had been well clearly he must be guilty because he truly innocent man would have expressed righteous indignation at the at the charges that he was facing so I think that Brett Kavanaugh was put into a position where he was damned if he did and damned if you did it the American bar association of course\nInterview well over a hundred of his fellow judges and lawyers and said that he has an outstanding judicial temperament and he will as the Supreme Court justices well\nPeople coming in and continuing to weigh in on both sides of this absolutely right let me let me ask you this why should we have confidence that a man who said under oath with no evidence that he was the victim of a revenge plot on behalf of the Clintons that he was the victim of a big left wing conspiracy\nThat this man will be able to serve as an impartial nonpartisan justice\nForeign sure one Brett Kavanaugh has a history of caring about the rule of law and not base he released based on any political or personal beliefs and he is not about the sacrifice\nThat well deserved reputation for integrity by throwing it all the way on the Supreme Court I wouldn't know by the way that you know obviously with Peter Ginsburg had some harsh statements to say about Donald Trump before he went on the all you know became president I don't hear too many people are questioning her integrity and I certainly won't either\nBut to that specific remarketing or he went on to say he was the victim of a calculated an orchestrated political hit I mean do you have confidence that he will be able to operate in good faith on cases involving politics\nCobra Ninety ... W E v cute little since Ninety One point nine and on line at an age ... [noise]\n[noise]\nAfter a contentious debate in the past couple of days the U.S Senate held a cheap procedure will vote on U.S Supreme Court nominee Brett Kavanaugh today and it looks like he could be headed to the U.S Supreme Court it is friday this is all things considered from an HBO [noise]\nI'm Dan ... good afternoon protesters and around the country came out ahead of friday's procedure the procedures Senate vote to move forward with George Brett Kavanaugh's confirmation to the Supreme Court\nWarn that coming up this hour as well plus a jobs related a report released by the government today showed unemployment falling the three point seven percent the lowest rate in almost fifty years\nAnd the sun and spring Institute will be studying how ... chemicals affect the health of children in Portsmouth and on Cape Cod\nThese stories plus a weekend weather forecasts coming up first we have a news updates from NPR live\nFrom NPR News in Washington I'm Janine hurt on the Senate floor this afternoon Maine Republican Senator Susan Collins took away any doubt on where she stood on Supreme Court nominee Brett Kavanaugh saying she will vote to confirm him\nTelling says she did fine Christine Blasey Ford's testimony compelling but she says without cooperating evidence the allegations of sexual assault shouldn't prevent his confirmation\nI Do not believe that the charges\nKen fairly per bad\nJudge cabin uh friends surfing on the court\nEllen's praised Kavanaugh's judicial record saying he received rave reviews for his twelve year track as a judge West Virginia democratic Senator Joe Manchin says he will also though it's confirmed the judge a vote is expected to take place tomorrow we will President Trump says he is very proud\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n... so we're completely sold out for the weekend and our dining room is like we we couldn't do any more\nState tourism officials they expected visitors and spending for this Columbus Day weekend is up five percent year over year this is New Hampshire second busiest travel season and its forecasts the visitors will spend one point four billion dollars in the Granite State this fall for an HP our News I'm Robert Grover\nIn sports Red Sox Yankees tonight at Fenway game one of the American league east playoffs mostly clear tonight low temperatures dropping in the thirties tomorrow mostly sunny some early morning frost possible especially in northern parts of the state without temperatures in the lower sixties\nIt'll be partly to mostly cloudy Sunday a chance with some showers high temperatures upper sixties the lower seventies and on Monday mostly cloudy ... sixty degrees\nSupport for an age ... comes from you our listeners\nAnd from the office of Catherine Jay morning probably supporting at age ... while the Peterson society\nBy helping individuals incorporate plan to giving into their wills trusts mono law dot com and I'm from Massachusetts General hospital using research to develop treatments were complex conditions all the help patients get back to their lives Mass General revolutionizing care\n... this was an HP are\n[noise] support an HP are today and you could win a triple the lifetime ... down under are lucky winner has the choice between Australia or New Zealand which means you'll have to choose between kangaroos are key leads the bright lights of the Sydney opera house or the stunning views of mount cook national park\nTowards the news you trust today as an an HP are sustainable and you'll be automatically interested when they get now here's how [noise]\nJust go to an H. P. R. dot org but do it now because time is running out we're picking the name of that lucky winner tonight as seven PM so you know time is of the essence we're giving away that trip of a lifetime to either Australia or ... it could be you why not give now at an H. P. R. dot org\nAnd I'm like working with me now is Rebecca lavoy when you contribute you will be energy when that final give away all also be helping\nUs raise the last Twenty one thousand dollars that we need to end this Dr successfully this Dr end at seven pm that's about an hour and fifty two minutes from now\nThat's how much time you have to get your name in the hat to win our grand prize drawing that trip of a lifetime for two to either Australian or any of the land that trip includes roundtrip airfare from Boston and a combination for eight nights\nThe very best way to give is on line for your checking account or credit card ten dollars a month or Fifteen dollars a month whatever amount you choose works all you have to do his head on over to an H. P. R. dot\nOrg consider um becoming has a standing member of an age PR for just twenty dollars a month and if you do you can ask for a year long\nNew York times digital subscription and and each pure as new as trustworthy love worthy mug this times and Macondo is been up and it's been a favorite among our donors during this drive so far and when you choose this thank you get you will get unlimited access to all times content through any smartphone tablet or Web browser\nAnd as you ... the time she can sip your favorite beverage from the red mud but you do have to make that give soon if you do want a ... gift plus\nThe possibility of winning this trip of a lifetime to Australia or New Zealand give now at N. H. P. R. dot org\nAn hour and Fifteen minutes remaining before the deadline to win this trip I perhaps you've never contributed to an age PR before I let me just give you one minute to explain why it matters\nAt its heart we are a nonprofit grass roots organization our reporters are the only reporters in the state working for a nonprofit journalism outlet Casey make German at the state has she's the only reporter at the state house\nCause retired Supreme Court Justice John Paul Stevens a lifelong Republican to speak out against the nominee\nAnd he said that he'd like Kavanaugh as a judge even put his picture in one of his books because of a decision to Kevin wrote but Kavanaugh's demeanor and partisanship Stevenson Steven said demonstrated a potential bias involving enough potential litigants before the court\nThat he would not be able to perform his full responsibilities and might have to recuse himself because of that a parent bias here's here's Stevens speaking to a group in Florida yesterday\nFor the root of the court who it is not in a healthy they get a new justice slowly do part time jobs\nNow I don't really think the cabinet as likely to recuse himself and indeed you saw him today and the wall Street Journal and an op ed piece trying to somehow walked back some of his comments without specify which ones\nIt appears are based on how things are shaking out in the Senate today that um plenty of senators enough senators are prepared to vote to confirm Kavanaugh despite all these questions being raised by Justice Stevens another so what does that mean for the politics of the court or at least the appearance of the court that it should be above politics\nWell the justices will grit their teeth and and they'll put on a good show in public and private I suspect\nChief justice John Roberts knows and has stressed that the courts best currency is the notion that it's not a partisan institution that there may be ideological differences but not partisan once\nAnd all of this cannot be sitting well with him\nOf Maine a made a dramatic speech today weighing in on some of these questions she was announcing her support for Kavanaugh here's a little bit of what she had to say\nMy fervent hope\nIs that Brett Kavanaugh\nWill work to less than ... in the Supreme Court so that we had far fewer five four decisions\n[noise] how big a challenge is that going to be enough for for Brett Kavanaugh at this stage to lessen divisions\n[laughter] well you don't even have to go there just all you have to do is look at his record\nCollins framed it as a quite moderate record today but there's a reason that President Trump added cabinet to that list of potential candidates for the court\nAnd that is that on questions ranging from gun regulation to executive power to abortion to overall regulations\nHe's firmly in the conservative some would even say ultraconservative vein of judicial ideology so I Would indeed expect eventually anyway lots of five to four votes\nWhere the five justice conservative majority firmly entrenched a court that is far more conservative that and then any we have seen in this country for\nI Would say probably three quarters of the sense of a century how fast that happens well that remains to be seen\nJust a couple of seconds left but if this vote goes as expected this weekend how quickly would you expect him to be seated I Would expect him to be seated probably Tuesday Morning [noise] wow NPR's Nina Totenberg thanks as always thank you [noise]\nSupport for NPR comes from this station and from sue zoom offers cloud video conferencing online meetings and the video conference rooms but Lucian in one platform featuring digital video and audio with screen sharing account registration and more at zoom got us\nAnd from Trader Joe's offering new products in every store and new episodes of the original pod cast series inside Trader Joe's\nAt apple pie cash or where pod cast are available more at Trader Joe's dot com\nI'm Mary Louise Kelly in one of the things that central part of the kind of journalism NPR is trying to do is that it's not just me out there on my own operating in isolation their teams of producers quarters and in fact checkers researchers\nThere was a rigorous editorial process that goes into when we put on there that matters because when you were putting\nA controversial resource story out there you want to have an editor of gone over with a fine tooth comb a mixture is that exactly the word is that the direct quote we sure of that data we sure of that fact I Would ask people to look\nAt what value that's brought to them what it means to them to wake up in the morning and had no that there's a team at NPR that has been up all night trying to figure out what happened in the world overnight what's coming up in the country that day and bring it to you in a way that helps make sense of this\nUnsettled landscape in which we find ourselves\nEditorial process manners this news matters and most importantly you matter to an HP are you are at the heart of everything we do here and your support matters right now you can become a sustaining number then each PR\nIt's quick and easy to do at N. H. P. R. dot org I'm Emily court and with me now is Rebecca lovely\nGot about Ninety minutes remaining in this whole fall fund drive we have about Nineteen thousand dollars left arranged to end it successfully and we have an amazing grand prize drying that deadline Seventy and about Ninety minutes away you can have a chance to win a trip for two to either Australia or New Zealand the winner will get to\nSupport for an HP our live stream comes from you our listeners and from revision energy a local employee owned company helping thousands of granite staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more a revision energy dot com slash careers\nUncover issues in a way that helps each of us make informed decisions and your monthly support feels this award winning work that informs your decisions and that shines a light on the decisions made by\nCongress and the courts your contribution today ... pays the salaries of the journalists who dig out the facts and examine all of the arguments we just heard that incredible conversation between Mary Louise Kelly and Nina Totenberg if you appreciate conversations like that\nIt's time to put something back and you can make your gift now at an H. P. R. dot org you're going to be entered to win that trip of a lifetime to Australia ordinance Zealand give at an H. P. R. dot org Ninety minutes left in this Dr\nNineteen thousand dollars left to raise\nBecome a sustain are at ten dollars a month or Fifteen dollars a month your contribution is deducted automatically\nFrom an account of your choice wheel you'll save us money on things like renewal mailings in postage you get access to a pledge free stream every time we have a fund drives you don't have to listen to a lot of the fund drive pitching\nPlus you'll be entered into when all of the drawings and our drives of course you'll also better than to win the drawing we're doing tonight to trip to Australia or New Zealand that clock is ticking\nOn that deadline about an hour and a half remaining make your gift now one eight eight eight eight zero five six four seven seven or do it online it's really easy they're\nAn H. P. R. dot org thank you to Roberta here in Concord she says I listen every day so I felt it was finally time that I should contribute the farm stand on her system analogy on the air the other day is what pushed me over the edge\nI wouldn't never still from a farm stands so I Would never still from public radio thank you Roberta thinking of Brianna and we're Kathleen in Westchester\nKara in Keene these people have done their part to show their support for an H. P. R. and they're also entered to win this incredible trip of a lifetime to Australia or New Zealand and if you want to be a part of it you have to give now there's just Ninety minutes remaining in this Dr\nWe have Nineteen thousand dollars left to raise and you can be a part of everything we do when you become a sustaining number\nAt an H. P. R. dot org the phone number to call if you'd rather do that one eight eight eight eight zero five six four seven seven was Nineteen thousand left are raised and the drive successfully a leadership circle gift right now would make a huge difference if you've been thinking about it\nA hundred dollars a month or more to an each PR you'll get tickets to special events to get to meet NPR personalities\nYou get like VIP seating it writers that a New England stage lots of cool things coming your way with the leadership circle membership it's a great time to give it and of course you will be entered into when that trip to Australia\nOr New Zealand joined the circle right now and H. P. R. dot or it takes just two minutes of your time going to end H. P. R. dot org and make your gift there and after you're done you can then daydream about which place you would choose Australia or New Zealand if you choose New Zealand\nYou could go to sub tropical forests beaches there's off shore islands to the north there's glaciers there's lakes there's everything he could possibly think of it's a magical place\nAs our volunteer Karen Anderson described it she says\nIt's like a CGI country it's just incredible to the eyes so you could visit it you could see for yourself but you do have to make that give soon it's quick and easy to do at an H. P. R. dot or it says something when I resident ... says she would choose new\n[laughter] you could make that choice to but only if you give us a call the next hour and a half or so of go on line make you're gifted N. H. P. R. dot org\nAbout Ninety minutes remaining this Dr get your name in the hat to win that trip\nOr New Zealand they could get at an H. P. R. dot O. R. G. and good luck yeah\nI'm twenty nine good afternoon [noise] still come the confirmation process for Brett Kavanaugh has brought back a blistering fights among senators potentially marketing a permanent break in the institution\nReflecting sharp tensions with the nation will get more and this from NPR's Ron Elving and about Fifteen minutes on all things considered and ran HP aren't comes from you our listeners from little in regional healthcare announcing the new North Country comprehensive pain center\nSupport an HP are if you if you hear a news story you've never heard anywhere else during the week and that's important to you support an age PR if you think it's important to bring accountability journalism to everyone in the state whether they can afford to support it or not\nSupport an age PR right now with a gift at N. H. P. R. dot or\nTime is running out for you to get entered to win this drawing Australia or New Zealand and which would you choose I we've been saying I think New Zealand is where I Would go but I don't know if you decided to go to Australia a few are the winner you could check out Sydney it's known for its famed opera house and harbor city also both an incredible bridge\nThere are fantastic parks delicious food lots of free stuff to do\nAn amazing surfing so just think about that and make your gifts and then you can sit back and daydream Australia or New Zealand helpless finish up this drive there is just about an hour and Fifteen minutes remaining with Eighteen thousand dollars left to raise what can you do to help us out five ten Fifteen dollars a month choosing amount than go to an H. P. R. dot org\nLeave 'em dead um gave because she says an HP our gift your sanity and long car rides\nAre being in the ... with smart folks and my parents and reassurance that I'm not the only one who was wondering about all those squirrels\nThat squirrels story by the way was broken here at an age NPR and its breed agreed broke the squirrel pocket lip story if you think it's important to cover Syria story and break the squirrel apocalypse story support this news service right now with the gift of ten dollars a month or Fifteen dollars a month you can be entered into when this trip or giving it away an hour and twenty minutes\nMake that call one eight eight eight eight zero five six four seven seven or go on line and H. P. R. dot or\nIf you have never made a gift and H. P. R. before considered becoming a sustaining member at that five dollars a month level when you do you can choose the brand new red mug as a thank you get this become one of the most popular thank you guess during this Dr there's a big heart wearing headphones the heart thing warmed by listening to\nProbably all things considered right here on all on an HP are so additionally the mud is carefully inscribed with the words trustworthy\nAnd love where the additives that you might think to find an HP are but we think they define our listeners act now go to an H. P. R. dot org you can also call us at eight eight eight eight zero five or six four seven seven\nOne hour or an Eighteen minutes remain in this fall signed drive and that is that how long we have until the deadline to win this trip of a lifetime for two\nTo either Australia or New Zealand make your gift right now get your name in the hat\nWhile you're doing that pick up a great thank you get to get the H. P. R. T shirt for ten dollars a month you can check out all the thank you give up for offer at N. H. P. R. dot org while you make your while you're checking though that make your gift there you will be ... when this trip for two to either Australia\nOr New Zealand about an hour and twenty minutes remains to be to get your chance to win Eighteen thousand dollars left arrays\nHanover make that gift right now to an H. P. R. dot org\nThis is all things considered from NPR News I'm Mary Louise Kelly and I'm Ari Shapiro the fight over Brett Kavanaugh's nomination to the Supreme Court has been divisive and bruising\nAnd many fear it has been damaging to revered institutions the U.S Senate and the Supreme Court Ron Elving is senior editor and correspondent on Washington desk here with NPR News and he's in our studio to talk about this Ira good to be with you Ari\nIt's always been known for a special kind of ... geology where members can work together respectfully despite political differences and reach compromises for the sake of a greater good that's been deteriorating for a while now do you think the Kavanaugh confirmation process his down even further damage\nIt's the latest symptom of an infection that's been president for some while we've had parties in the Senate almost from the very beginning but there have usually been at least a few conservatives in the liberal party liberals and the conservative party lots of moderates in between\nThe politics of the last quarter century however have been purging those crossovers and those moderates even those who now remains sounded increasingly like hardcore partisans\nAnd here's Sen Lindsey Graham Republican of South Carolina voter but times in the past as something of a matter of brick somebody who can talk to both parties\nHere use at the Senate Judiciary committee hearing a week ago addressing the Democrats across the room boy y'all power God I Hope you never get it of course Lindsey Graham is referring here to the mid term elections next month when Democrats had hoped to have at least an outside chance of getting back in the majority\nLindsey Graham new cameras were rolling then does language like that actually poisoned the kinds of relationships and interactions that you see behind closed doors or some of us just for formative\nWe should say there have always been occasions of heated rhetoric and angry words and especially from certain members at certain times but as you say the collegial nature of the chamber and belong six year terms that they have and the need for certain perverse you drill arrangements\nThat tended to bring people together bring them into a more cooperative mode of operation but that can break down and that is what democratic leader Chuck Schumer was referring to this morning on the Senate floor when he concludes his argument for rejecting Kevin\nFor the sake of the center of the Supreme Court ended up America I Hope I pray my colleagues\nWill do so we've been talking about the impact this fight is having on the Senate what about the Supreme Court where if confirmed Kavanaugh might serve for decades do you think this will have\nA long term impact there it will be a burden on the members of the court who have proven remarkably good at times at least ... their political differences within their larger relationship to each other\nAnd to the court and to the country and to the law that gets harder after a confirmation process such as this process that is\nStressed by the collision of major movements within the culture\nWithin the Supreme Court for years we've heard stories about justices with ideological differences having close friendships having a relationship that flourishes even though there might be on opposite sides of a political divide do you think this affects that kind of dynamic\nIt could and that is what concerns people the relationship between for example Antonin Scalia the anchor of the conservative wing and Ruth Bader Ginsburg are very different justice and yet quite close friends who would spend every New Year's eve together and go to operas together and so on\nThat kind of ... geology is stressed when you have a candidate who comes to board with the background of this sort of a confirmation process it's not that the court can't deal with it but it will\nMake the court more visible doesn't mean they have to come out from underneath those robes doesn't mean that suddenly we're going to have CSPAN or that they're going to stop their very small group conferences but it does mean that for many people the court has been identified as something different from what it was before\nNPR's Ron Elving is a senior editor and correspondent on our Washington desk facts wrong thank you Ari\nThousands of Indonesians are living in tents or in shelters a week after a devastating earthquake and tsunami more than fourteen hundred people died as NPR's Julie McCarthy reports a lack of heavy equipment has slowed the recovery of bodies from the mud and debris\nWatch it with someone pulling the roof down or is it falls down around into view among them ... ... ocho John too high roller sit inside the ruins of the small seaside establishment and says the ... is not the sound of the roof being repaired but coming apart\nEverything has come apart here in the wake of double calamity that struck without warning last friday night\nWith them I Know what I'm up on me I felt panic ocho says I couldn't think clearly we couldn't help anyone but ourselves\n... eight twenty foot wall of water and ran I didn't even think to save my father he says I chose father died praying in his home fifty yards from the windswept shell where I met a chill\nAnd elected neighborhood advisory leader who lived here with some two hundred families\nThey're strip of beach is now a landscape of splintered wood and debris\nCorrugated metal up to your knees and huge labs of concrete and UC clothing is through an around the smell of dead bodies rises around us [noise]\nMall in tears search and rescue teams ... through the devastation looking for victims of the suit me first lieutenant a reef it's even moral says he and other Marines assist when the volunteers locate a body let me get on you\nDon't win interpreter seem a Morris says without the assistance of sniffer dogs he and his team walk to the beach and smell\nWe smell the smells because they already know anything he smell loss and animals and human bodies and if we want to smell and then we found bodies we will treat you did you discover anything here today this\nWas fought ... [noise]\nBoxing moves to there and not to their\nStomach valley at the foot in this in a way they deal with their bare hands they mutilate the newly discovered bodies losses in ... heavy equipment residents from this area blanketed\nIn hopes of flattened homes are dismayed at these modest operations to salvage the dead one rather than put it you need heavy equipment to really discover the death toll here and there just hasn't been any seen repeated a pass policy [noise]", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Keene", "day": "05"}