{"month": "10", "state": "AL", "station": "WERC", "content": "Was over there and saying I Am really disappointed will lay you'd be wrong [laughter] around the ... pride in your right your ... your ... protests\nJewish shift in the midterm isn't going to get real young earlier conversation continues on news radio one oh five five doubled you we are the\nFox News I'm Carmen Robert our prayers are with those who lost their lives and with their family size it on Trump\nReaches out after six people dying hurricane Michael now it's about helping the victim\nThe only people getting into Panama City tonight or utility crews and first responders police and National Guard at set up roadblocks checkpoints other major highways into the city telling people who evacuated you can't go home yet\nFox has wrecked eleventh on or forks are Turks have told us they have audio recordings that proved the Saudis murdered journalist democracy Yogi editor Dick Durbin says President Trump needs to demand the answers from Saudi Arabia\nWe also have until just traffic or that has been disclosed publicly suggested we knew they were up to kidnapping him returning to Saudi Arabia for punishment or worse the\nWashington Post reports that say the recordings contain sounds of\nChevy torture and murder this [noise]\n\nMixed feeling eyeballs Carson repeat discovery borrow from the national Science Foundation ever fantasize about being sixteen again great times for stone but for others adolescents\nWho have emotional roller coaster\nInundated by she normally you using confounding negative thoughts and feelings new findings\nFrom Harvard shed light on our experiences of emotion barrier different ages and white adolescence maybe an especially vulnerable period and emotional development\nHere's what the team found in a study of one hundred forty three people ages five to twenty five young children can differentiate or tell them or negative emotions for you to get those emotions don't overlap\nI'm sad I'm angry scared they're more likely to experience the motions one at a time\nAdults over twenty tended to report undergoing many motions at one time\nAnd being able to distinguish each one individually\nAdolescence those seem more likely to your experience overlapping emotions and be not be able to build them apart\nMaking adolescence of period a murky assuming emotions they're feeling knowing this if you're trying to figure out a rebellious team remember they're trying to make a quick to\nGovern the dog go I'm Bob course news radio one oh five five W. E. R. C.\nM. S. R. P. envoys list\nPrice dealer price to be happier if your car shopping you probably heard these terms\nWhat do they mean it's so confusing well it was confusing not anymore I'm telling you about your price from true car it's a price it actually means something because it's the exact price you pay for the car you want including season accessories and basketball you'll know if you're a true prices competitive ... shows you what other people are paying for them\nHey Dan can you believe it's our ten year anniversary of getting a great\nNight sleep I Know Trina for ten years he quiet has been helping couples like us kicked snoring out of bed think of the millions of lives we've changed and that all happened years before other ... companies shut up on the scene the quiet really started a revolution\nHigh were Dan and Trina as the founders of the quiet people often ask what sets us apart from the competition it's easy knowing with our problem\nAnd we know what night\nNews radio nine sixty WBRC\nNeurotic vote Democrat not turn into an angry mob we refuse\nTo do and generated by the mob of people know mob rule on things\nCannot be hit with a political party that wants to Troy what'd you stand for what you care about and that's why I Believe we are fortunate enough [noise] to win back the house band or the ... can start again when you see people like Ted Cruz getting\nChange that are run by a mob no\nYou're not going to use the library and hopefully a mom and it was allergic to know whether we're now getting to know what I paid off now\nMr Trump accused Democrats are using Bob ... says the Democrats are angry mom brand\nName Denis Rodman as an angry mob Democrat and and the woman\nBond David lob the mom a lot of angry mob mob mob ball mom and mom mom Bob Beck and call on the mob mob on the Democratic Bob the mob and the ... part of an angry mob an angry mob and he said what\nAbout the people who were at the marine corps banging on the wall with all that [noise]\nThat\nMajority in this country and they're made out can be violent and disrupt dead\n[noise] I mean it really wasn't a mom [laughter] I\nThink the last of the angry while damages particulate [noise]\nMisrata\nProtesters lobbed at the fat\nAged white guy down\nRoad and it's funny because I Try not\nTo talk of a mob rule and so on I mean if you have you been to a Trump rally\nDonald can call them a mom and compare that to heart than calling liberals\nAnd the angry dangerous live and they\nActually a tactic that are in the way you're dealing with ideological party that is\nDriven by the left her power that is funded by corporate in red wine with government that that the bidding you think these horrible [noise] but you have what they\nYou know my mom\n\n\n\nLike Louis Jewish or to ground zero mosque rules destroys except history thirty seven hundred that's AAA fix up at three thirty seven hundred [noise]\nSo what do you make of what Hillary Clinton said what do you make of what the president said both are saying hey violence either way more instability and don't want to check Hillary Clinton\nOut of context now do I no no she said we cannot\nBe civil and the thing is is that whatever her civil definition is\nI've noticed what the stability and instability is in my own home state of Portland, Oregon I I Am at home John in Portland, Oregon I've seen what this whole idea of being in civil meet the means blocking traffic and he's calling people names it means scratching the doors at the Senate during the cabin are gearing it means harassing people that's what it means\n[noise] instability violence maybe Trump said violence he said well you know [noise] what is going to happen this this this and this [noise]\nSo uh you know I don't know it just seems to be this is what they're talking about [noise] and so then when people started commenting about the whole idea of what Hillary Clinton\nSaid Donald Trump said\nGoes in and said oh we got to stop this eight hundred people eight hundred sites gone [noise] and it Google Jordan's round leaks a memo and says oh by the way we're not going to shadow ... certain sites my politics alone we're just going to do it a ... because you know we don't want to or we don't want to ruin anybody's when we don't want to start\nFury will just eliminate them by their tone so now it's back to the ... back to the algorithmic five police again this time it's for your tone it's more how you deliver your message is not about don't it's it's not about what you're delivering but how you deliver it now [noise]\nBecause all of a sudden they changed their tune who maybe we are causing some problems maybe we need to kind of settled down a little bit so we don't have a war it's going to Robert in Washington I Robert you're on ground zero\nHow're you doing what I read about this algorithm all day that Google has and it's a it's a a\n... for the military and they you give your code what job you have in the military and the and the military I mean as Google find your job or the or the spirit was talking about today I go\nYou know I recall it was a better story if one of them Alex Jones or client list is talking about this Google and I are going to call and they said yes you call this a can of a strange thing is\nThat the algorithm or what what what I say about it is that Google gather information all the time but not really for our good\nBut if there's if the Chinese have a you know the inside scoop and give it all\nThings are sad and then actions are done and what actions are done we try to figure out why the actions of done it they're done because I have a feeling that both Facebook and Google realized that what they're doing is they're creating an atmosphere for civil war\nAnd we'll let me when we hear earlier today aren't leaders saying things like well there will be\nViolence or if uh you know we don't win and the other one says we're we're going to continue to be a [noise] not civil until we when\nMrs ... jacks up the motion and that's why they're trying to do is they're just trying to play but\nWe're real close as I hear the music okay do you think Trump and Hillary actually working together in order to to make the civil war happened and then bam all of a sudden we have the whole global is get the martial law they looking for\nNo idea [noise] I don't think that's a that's a good conspiracy theory but I have no idea\n[noise] have agreed not collide thank you thank you [laughter] [noise]\nYeah Stormy Daniels said though that when they were together [noise] arguably or allegedly together that he was talking to her about a plan [noise] only about ... bucks every three thirty seven hundred will be back [noise] news radio nine sixty W. E. R. C. [noise]\nThinking about life insurance what if you could make one free phone call and learn your best price for nearly a dozen highly rated price competitive companies well that's exactly what happens when you called select quote life for example Georgia's forty\nHe was getting sky high quotes from other companies because he takes meds to control his blood pressure\nBut when I shopped around I found him a ten year five hundred thousand dollar policy for under twenty five dollars a month I'm select what age and dance to be now and believe me if select quotas and shopping for your life insurance you're probably paying too much\nFor your free quote comb eight hundred seven to one forty eight eighty eight hundred seven to one forty eight eighty eight hundred seven to one forty eight eighty or go to select quote dot com since Nineteen eighty five we shop you say\nGet full details on the example policy has slowed down ... commercials or ... depending on your health insurance company that factors in Austin\nMessage ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that\nDegree in his little less sixteen months one hundred percent on line\nTo find out more text prepare to seven nine six four or five\n... P. R. E. P. A. R. E. to seven nine six four or five star to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online\nText prepare to seven nine six four or five\n... ... P. R. E. P. A. R. E. to seven nine six forces [noise]\n\n[noise]\nGo to Don and then in the eyes on your ground zero because those are the men\nGet you in on I'll just watch it if they hear the other like a\nLot to do anything they did not many but\nHistory shows that he had a as above last night alone ... and it was going against certain groups\nCertain opposition a boat like eight thirty six like a thirty a\nGood you compare what the Democratic Party is doing to\nThe Christians are white males are that's going on today could you compare that you know not as you know of ballot as it is right now I mean I've seen things going on it or\nWhere you're at and it's you know ... and I was just all of that it could say the parallels\nTo you know I could tell you that now I don't think\nWe're seeing the Democratic party doing anything not see I I'm sure that the I'm sure the Democratic party or people who are representing a the the left wing will say that everything the Republicans are doing or not see I mean\nCalling out of Nazi or calling not be here and not see there's kind of it's the God when argument and it certainly dumped pills everything into a soup of not of nothing this and it makes it less effective but I Will tell you that's\nAbout all this oil no but\nLet me finish I'll tell you where it's going well yeah but mayor in this town that is corrupt and deserves to be arrested in fact today I came to work wondering how I could organizer group to arrest them he needs to be arrested or on many reasons many reasons he's arrested because he is not holding together the rule of law in this in the city not at all uh ...\nIt's it's like it you know the same as live as a write without the violence but we still have the same kind of their employees you know I don't know is seen as a solo before last they shut a major bridge going across the river to live as\nWell what we do when we have okay well we have groups that are uh basically blocking traffic a and there and there are abusing people and the police look on the police are told not to do anything so their their arms and tied their hands are tied when it came on the ice or when there would be a\nIce takeover here the icy takeover in ah Oregon\nSame thing happened in fact they were saying that what he did was unconstitutional in and would be a and I think there is somebody actually suing him for what happened there but we also have a governor here that is very corrupt she's actually a there are a lot of things that she's doing right now\nBut in my opinion uh would would probably born arrest as well for some reason we have two very corrupt leaders\nA mere Portland is a corrupt leader and the mayor in a in a new governor of Oregon and super corrupt\nAnd both of them are in power right now and so even if they're gonna wait it out to the elections but in my opinion [noise] something's got to be done sooner than later [noise] and uh so and this is why we're in the position we're in right now\nAnd I you know I don't normally I don't normally talk about local politics I leave that up to a guy that I work with the Mars Mars than he was amazing without up these conservative very staunch conservative but still you have a handle on Portland politics and a lot of ways\nAnd I keep telling them every day what are you going to do\nTo get people start talking about arresting our mayor Ted Wheeler and tell him look you don't you don't allow this type of thing and a lot of crime to run in this in this in the city and I think that uh you know it's being well known and across the country now his reputation and what he's doing and what has been happening\nHere in Portland, Oregon they sent me poor prepare for anything\nAnything can happen in any thing is happening right now so as I say it's best to be prepared I'm not calling for civil war I'm not asking are running the streets I'm asking to throw up your hands and scream and yell all I'm saying is be prepared for anything will be back [noise]\n\n... his online banks for closing on how are they even have documents and I signed for home equity loan only I didn't what a nightmare\nThe victim of a devastating crime called mortgage fraud [noise] your ... title and mortgage are kept on line where these foreign and domestic hack them\nSimple they forge your title and borrow every penny of equity you happen to your whole life this police officer\nI Know about title fraud so I register with home title walk and discovered some faith had already taken over title thank God I found out in time\nNo bank identity theft program or insurance protects you hope title luck will for pennies today oh title lock puts a barrier around your homes title and mortgage the instant it detects tampering there on it helping to shut down\nFind out if you're already a victim of title fraud get your hundred dollar shirt free with sign up this at home\nTitle luck dot com [noise] home title luck dot com [noise]\nFit your insiders cheat code to gaming I'm indignant over watch continues to expand into the real world this time as part of a complete breakfast the blizzard own game is apparently pairing with ... to make Lucio knows a fictional item in games lord based on support character Lucio\nSaid dedicated to new items in the candy and snack on whether or not the Syria will be part of a balanced breakfast will have to wait until December third\nFresh off the announcement of a Google Video game streaming service Microsoft has responded with its own and now he's two\nBillion cameras in the world some of them have a PC I have a console some of them have smartphones some of them have all three\nTidal project X cloud in a blog post cream chowder IQ gaming cloud vice president for Microsoft announced the project\nWe believe we need to build a game streaming service\nThe service will allow gamers to play games between the the X. box one and smart vice that Fox beds for Fox News\nHe was radio now you're sixteen tell you we are seeing farming has had on line nine sixty W we are C. dot com\nI harsh radio Seavey eleven o'clock [noise]\nAnd now the cleanup ... Callahan Fox News this monster storm devastated the Gulf Coast enter panhandle Florida's governor Rick Scott of the devastation caused by hurricane Michael so many families have lost everything [noise]\nI think somebody felt the heat [noise]\nI think they're beginning to feel the heat I think they're beginning to realize that they can't be biased like they are they can't continue to do this and there is any go hog wild and be all violent and crazy on on Facebook or on Google but they're looking at tone and once again once again this brings to mind the social credit score\nWill look at tone will have a heat scale will will run the site through the algorithms and the heat scale and we'll see just how it measures up out of it and it turned out that they have it turns out the ... I think the algorithms to you have a lot of hate hate speech in your and your Web sites we won't post them\nOnce again the robot determines whether or not you're a racist based on their criteria [noise]\nYou know when you're constantly getting these fans\nAbout war civil war and the license for violence and the motives of course getting what you want to promote it you know we want so many people to go out and vote but we don't want certain people to win and if they win will keep being on civil to one another if they if they lose maybe there'll be more violence\n\nAnd of course the media says about Trump when he said about the GOP violence situations well that's respected you know he's a he's a fear mongering narcissistic blah blah blah blah blah blah and he do that anyway but then Hillary Clinton says consequences be damned we need to have instability until we get what we want\nAnd they're claiming civility could return when Democrats have power is a measure the ends justify the means\n\nMeanwhile she said this one we've had Republicans that are being shot stabbed docks beating mailed a at rice in powder run out of restaurants sent death threats and yet she says oh we got to be an civil until we get what we want well who's giving the chilling responses right now\nSome guy I guess a bit of two hundred pound bombs but you want to detonate on election day one guy said he was going to do is what it was reported the news Eric Holder's are basically set out by the quote somewhere Eric Holder just recently said we need to kick up talking about the Republicans we need to kick them when they're low [noise]\nThese are words of war\nAnd I know people don't want it you don't want to they want to admit to it but they are so what do we do well you've set of inciting civil war which many people were saying I'm doing why don't we take the task these people are making these statements including President Trump [noise]\n\nYou know we we stop blaming the Russians for our meddling now we're doing it wide open\n\nElections or or there's meddling going on the media is battling Hillary Clinton is battling and now Donald Trump says well the that's battling to\nThat voter manipulation in my opinion is motor manipulation\nRegardless of what you think of your president regards what you think of Hillary Clinton that is voter but it'd be elation\n\nSomebody to sit down with him and say hey you know you just did what you said that your ... your manipulating the vote\nHillary when you said that the Christian on the ... you really believe in the boat I'm sure they don't care\nI'm sure many of you don't care that I'm telling you this because you're thinking well the cards the liberal about carpet conservative but I I'm neither I basically telling you what is\n\nIt is what it is\n\nTo go to Sarah in Oregon Hi Syria from ground zero to feel good food [laughter] don't do that in the street [laughter]\nOkay it's was touched now [noise] I'm going to preface this by saying that stands nothing Hillary Clinton actually suggested it was\nA really really ...\nOpposite of civil is not violent it is now I Know that they're being very socially and dangerously route but they are being rude and the less violent not yet ... there's not other party ... well I don't think anybody realized that they don't want the party\nThey don't even have a ... era black okay that call to talk about\nAny [noise] what has been done\nLike Hillary in the service of whoever's\nPutting up lots and all the other thing is a lot more insidious than simply saying we cannot be violent anymore we have to be violent now that's not what you remember the last ... proof this the other night when you did your show that\nMost Americans have no idea\n... said how absurd that just got Harris they know that the CDC estimates at thirty percent of all antibiotics prescribed an outpatient clinic or necessarily you can help prevent taking unnecessary antibiotics simply by asking questions\nAsk your doctor what the antibiotic is treating and if there are ways to relieve some\nIllness without the antibiotic also use good hygiene practices like washing your hands around\nIn staying home from school or work when you're sick\nOur website at Alabama public health that you'll be more information [noise]\nLast News I'm Carmen Robert so many lives have been changed forever so many families have lost everything\nFlorida governor Rick Scott after seeing the devastation from hurricane Michael Fox's ... eleventh all is in Panama City\nFor many residents of Panama City the only way to get out with a chain saw hundreds of roads are blocked by downed lines and trees including one hundred fifty year old oaks major thoroughfares are reduced to one lane buildings or shredded there's no power and limited phones are\nAnd what was once nearly a category five hurricanes moving off the coast to Virginia to become a post tropical storm Kanye West meets with President Trump at the White House and wears out make America great again hats I\nOff it made me feel like Superman made a Superman our favorite superhero\nThey talked about prison reform and other social issues this scene [noise]\n\nSmart ankle\nBob ... discovery filed new advances in science and engineering from the national Science Foundation prosthetic legs are much improved but to users loose still a major unintended stumbling block\nTo rain every field sterile rapper Anita ... brown slows movement goes on certain balance in the building ... just to be for different terrain they do naturally\nRole promotional walking but a dean at Vanderbilt University is working at the problem from a new angle they developed a prosthetic smart ankle that moves with the user it's packed\nWith a tiny motives censors would chip and an actual ... been stimulates my muscles\nAll work together to send to react to changing terrain conforming to the surface of the Buddhist contacting or remaining stationery to devote what we're saying it figures out what you're doing and then does what it should be allowed to use you to wear any kind of a shoe running dress why\nThe device or just automatically part of who gives you the match room very human few used to the team reached out to nearly a hundred potential users to understand what would make the ankle success the idea is for people to be able to do more of the activities they want to I tell you who's made plenty pinned to major strides to\nDiscover more it NSF doctor I'm Bob ... news radio one oh five five ... yards the\nOffer not by law Dylan need some cash fast no matter what your credit score is just go to Linda genius\nHey Dan can you believe it's our ten year anniversary of getting a great night sleep I Know Trina for ten years he quite has been helping couples like us kicked snoring out of bed think of the millions of lives we've changed and that\nAll happened years before other ... companies shut up on the scene the quiet really started a revolution high were Dan and Trina as the founders of CSI quiet people often ask what sets us apart from the competition it's easy knowing with our problem and we know what nice\nDot com to get access to a quick cash alone in his little is one business state that's right Linda genius dot com is the new and smart way to get cash when you need cash fast Linda geniuses bill to help you find alone regardless of your credit score just go to lend genius dot com now\nSee [noise]\nAll about that one more one on how to do\nDoes lead a\nYou own a leading question first and foremost Google already knows you're a liberal so that's the problem\nYou're eating when we want to read\nProblem by your\nSpringer offering triggering Mercer was\nAll [noise] and and those are shattered and [noise]\nEarly early on uh on on on our on our line\n\nOf fire it or not read [noise]\nHeart either one\nThe house on them and\nThe only thing that the Republican\nSaying like you're automatically party or you're automatically the enemy and [noise]\nI'm like Louis you are listening to ground zero you\nKnow I Hope that [noise] having this dialogue and demonstrating what is happening here will avoid a civil war or some sort of horrible civil people that's the point of the show tonight because I Want to point out to you how it's done and\nWhat they're doing and this is how it's setting up [noise] or you react to it the way you want to react to it or you know you can say hey I'm not going to buy into this crap I I'm not going to buy into dividing my country allowing it to be conquered by some global is [noise]\nYou know the infrastructure it's not going to happen [noise] go to Bradley in Pennsylvania Hi Bradley on ground zero\nHey did you know you you mentioned you mentioned holder said about looking\nA little bit sounds good over the phone yeah we'll do it oh go ahead but boy it\nLook like we I mean [laughter] [noise]\n[laughter] that was\nWhen we go low you when when they go low we go high but instead we go where they go low we kick them that's what he said\nIt was that were national supporting do national candidates Stacey Abrams and stuff [noise]\nSo okay let me let me a ... there's a clarification I got to read the clarification this is from the Washington Post ready for this so they're saying about what he said uh after holder said uh when they go low we kick up Mrs what the Washington Post claims\nHe then said but he's not advocating anything Olympic when I say we you know we kick them I don't mean we do anything inappropriate we don't do anything illegal holder said but we got to be tough we have to fight for the very things that civil rights leaders John Lewis Martin Luther king Whitney Young you know all those folks are you doing\nSo the kind of clarify that because he really is I think what he said\nYou know so there you go here's the thing about that I think there's there's there's there's idiots cause that all these people have said they stay all these things and that oh wait I didn't but there is the part that they're creating it's already believe that that is what they're passionate\nWell it's like what Sarah said the dog whistle with the dog was it's like you know they say it and like you said the people that are radical\nHere at the media they go oh yeah that's what we do we keep being a you know getting and people's faces until we when you see they don't say that the Trump things they oh Trump advocating violence\nKnow this this ... this is something we're not doing but it is it's not whistling their dog whistling their people\nTo kick them when they're low their dog whistling their people to be uncivil until everything you know goes down the way they want it to and then what happens is immediately both ... and the guys that Google Groups groups that we'd better we're going to make some ... soon because I think maybe we don't want to be held responsible if there's a civil war\nSo but here's the thing about that anyone who says Hillary Clinton does not know what she's dealing with I'm Sorry to that woman is called you yeah idiots Hillary Clinton knows one hundred percent ... ... what she is and there is no one that can mean otherwise\n... okay friendly things for the call you will\nGet out of breath in Michigan Hi Brett you're on ground zero", "show_name": "Ground Zero with Clyde Lewis", "year": "2018", "city": "Birmingham", "day": "12"}