{"month": "10", "state": "MA", "station": "WNCK", "content": "Of cloudy that's on Saturday nights when he's showers wins diminished lower sixties a few clouds Saturday Night middle to upper forties and look for sunshine Sunday beautiful finished the weekend at fifty to fifty five that's your island forecast this is a meteorologist Russ\nMarlon W. N. C. K.\n\nPretty ... ... it had a wonderful gift for melody maybe that's why you wrote many songs and leader they came to him so easily and if the notes were making the music up themselves it was like they spontaneously reproduced one right after the other\n[noise]\nAnd it's a good thing that she had such a gift with morality because that means some of the best city ever wrote didn't die with the instrument it was written for [noise]\nParts for the ... are now played on field a cello sometimes guitar [noise]\nDavid Finkel is the challenge that you'll hear what she roots are ... twenty five minutes ahead [noise]\n\nLive from NPR News in Washington I'm jak sphere\nSaudi Arabia is acknowledging the ... the journalist ... ... the Saudi consulate in Istanbul this month according to report in the Saudi state news agency NPR's Peter Kenyon reports Eighteen people are now under arrest including to advisors to the Saudi crown prince\nFirst official confirmation of democracy ... death came from a report in the official Saturday press agency it said ... died after what he called a fight inside the consulate in Istanbul work it showed you had gone to collect paperwork for his pending marriage to a turkey\nBull ... had gone to collect paperwork for his pending marriage to a Turkish woman\nThe report says several officers were fired including senior intelligence officer major general Ahmed Asiri and another advisor to crown prince Mohammed bin Salman so delicate Tony\nTurkish investigators have said to show was killed in his body dismembered until now Riyadh and maintain the show do you left the constantly freely and it didn't know his whereabouts Peter Kenyon NPR News this temple\nSpeaking in Arizona tonight President Trump called the Saudi announcement a good first step the president also said he would prefer any sanctions not involve canceling arms sales\nDropped administrators and wants to deliver more water to farmers and his ordering a fast track review of environmental restrictions in California and other western states Here's NPR's Kirk Siegler\nMemorandum takes aim at California's complex delivery system but publicly built and federally subsidized water canals farmers in the states Central Valley has long decried environmental restrictions that limit the amount of water pumps south from snow fed resurrect forced you to endangered fish in Sacramento delta\nThat's the largest freshwater estuary on the west coast it's not clear how much peace this memo has an distant environmental roll back were to happen it would almost certainly be litigated\nTrump signed the memo in Arizona State that gets most of its water from the Colorado which is not part of this review but he was joined by California Republican Jeff Denham isn't it tight reelection race\nKirk Siegler NPR News Los Angeles us\nLaw enforcement intelligence agencies say they are still worried about possible effort by Russia China a rod and other foreign countries to meddle in the upcoming us midterm elections\nThat's the latest assessment from the office of the director of national intelligence the Justice Department the FBI and the department of homeland security homeland security under secretary Chris Krebs says there's no evidence the tax compromise actual voting system\nWe haven't seen certainly any compromises or any sort of access to elect shit equipment across the United states at this point\nAll the agencies are concerned about efforts to sway public opinion do some state and local governments which one polling sites have reported would appear to be attempts to block their networks officials say they were able to prevent access\nStocks have up or rally early in the day to end the session mix the Dow Jones industrial average was up sixty four points to twenty five thousand for forty for the NASDAQ fell thirty six points today you are listening to NPR\n\nA caravan of Central American migrants who arrived at the border between Guatemala and Mexico clashed with Mexican police today about fifty people were apparently able to push their way through a Guatemalan border fence find both Mexican authorities calls for an orderly migration and US President Trump's threats of retaliation\nPlease then closed the gates migrants from Honduras have said they intend to make their way to the U.S\nPresident says he has no regrets about his rally remarks praising the Republican congressmen for quote body slamming reporter NPR's tamper Keith reports the Montana congressman pleaded guilty to a misdemeanor assault in two thousand Seventeen\nTaking heat for his comments praising congressmen Greg gene forte Montana\nRemarks in light of what happened to Saudi journalist come out to show the Trump said no not at all\n[noise] tremendous person [noise] and he's a tough cookie [noise] they'll stay within [noise] to do when you're talking about\nWhite House correspondents association president Olivier not set in their statement that the president praised for the assault amounts to the celebration of the crime and do they tack on the first amendment camera keep NPR News the White House says it\nSeems like lottery jak pots are getting bigger well that's because they are tonight's mega millions jackpot for example by that to be renamed since the prize has not risen to a billion dollars that no one pick the six winning numbers Tuesday\nNights multi state drawing will be the second largest lottery prize in us history five other top ten drawings of all come in the last\nThree years I'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include the Joyce Foundation committed to advancing racial equity and economic mobility for the next generation and the great lakes region learn more at Joyce SBN dot org and be any e Casey foundation\n\nA new release of Berlin ... tangled in the sky with Christopher down is coming up first Charles ... suffers a\nSort of a ... a snapshot of a an emperor secret palaces have delight it's hidden we often the enchanted wilds and ended a woman cries for her demon lover\nThat's right demon lover\nAnd there is a sacred river that are ups in violence before meandering into the dark caverns some let's see inspired by the twelve run on sentences or just twelve since since I guess the ... the pleasure to almost ... by Samuel coal rich who's the buffalo philharmonic orchestra joins Gillette ...\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nMhm\nMhm mhm\n\n[noise]\nMm\n\nMm\n\nA new release of tangled sky music by rolling dines played on guitar by Christopher ... W. N. C. K. Nantucket\n\n\n\n\nPackets NPR station eighty nine points fine W. N. C. K.\n\nThis is the musical equivalent of uh do do the instrument that it was written for is known as the ... six strings frets like guitar it was ... like a cello\nAnd invoked for I don't know maybe ten years so that's really short in classical music turn it's just a ... minute really [noise]\nAnd if you hear music for the ... now typically it's played on something like the guitar to build a or the cello when you hear plead to guarantee that the music was composed by front Schubert too bad too I think that\nShe Brits knack for writing Clyburn catchy melodies could have saved the music maybe even the instrument told me he'd written a few more pieces for it and actually got the public it was the ... she would start ... with David Finkel cello and ... on CNN\n[noise]\n\n\n\n\n\nMm\nMm Mm\nMm\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nMm Mm\n\n\nNo\nNo no no [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\nMm\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\nMm\n[noise] Mm\n\n[noise]\nMm [noise]\n[noise]\n[noise] [noise]\nMm\n[noise]\n\n\nMm [noise]\n\n\nMm [noise]\n\n\n[noise]\n\n[noise]\n\nMm\nMm\n\n\n\nMm Mm\n\n\nMm Mm\nMm\nMm Mm\n\n\n\n\nMm Mm\n\nMm\n\nMm\n\nMm Mm\n\nMm\nMm Mm\nNo no no\nNo\n\n\n\nJust\nWondering [noise]\n\n\nMm\n[noise]\n[noise]\n\nMm Mm\nMm Mm\nMm Mm\nMm\nMm\n\n\nMm\n\nMm Mm\n\nMm\nMm Mm\n\nMm Mm Mm Mm\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\nMm Mm\n\nMm Mm\n\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n[noise] [noise]\n\n\n[noise] ... [noise]\n\n... [noise]\n[noise]\n[noise] Mm\nMhm mhm [laughter]\n\nThat's the number ... ... ...\n... ...\n... [noise]\n[noise]\nNo no no no\nNo no no ... Mm\nMm\nMm Mm Mm\nMm Mm [noise]\n\n[noise]\n\n[noise]", "year": "2018", "show_name": "Classical 24 with Bob Christiansen", "city": "Nantucket", "day": "20"}