{"month": "10", "state": "MA", "station": "WNCK", "content": "That Charlotte forecast meteorologist Paul Janice eighty nine\n[noise]\nThis is a name that keeps popping up around twentieth century music [noise]\nThe name of a lifelong patron of the arts that's responsible for commissioning [noise]\nWell really stellar abusive [noise]\n\nIt's Elizabeth spray Coolidge and the list of composers she has worked with summer commissioned music from or otherwise supported is a who's who was powerhouse composers everything from Barbour distributed ski [noise] she had a hand on the success of ... three by the by the chili pictures to man that's coming up and just twenty minutes [noise]\n\nLive from NPR News in Washington I'm Jim how President Trump says he plans to visit Pittsburgh soon and has been in touch with both the mayor and the governor following Saturdays mass shooting at a synagogue that left a woman dead as NPR's Tamara Keith reports he maintained as scheduled despite the tragedy\nReading from prepared remarks that a campaign rally in Illinois President Trump condemned the anti Semitism in unambiguous terms saying the synagogue attack was an assault times humanity Trump said he considered canceling the rally but didn't want to let someone so sick and evil when\nWe have our lives we have our schedules and nobody's going to change it\nOkay [noise]\nAnd if\nYou're going to tone it down just a little bit is that okay [noise]\nHe didn't tone it down much and when Trump mentioned Hillary Clinton's name the crowd chanted lock her up this in the same week she had been sent a package containing explosives ... NPR News\nThe man charged with mailing pipe bombs to prominent Democrats CNN and critics of President Trump is expected to appear in federal court Monday NPR's David Schaper reports from Fort Lauderdale some of those who worked with fifty six year old Caesar say actually they never saw him as threatening\nDislike driving and living in a band covered with ranting political stickers and angry messages those who were working with states are see get a gentleman spoke just hours before he was arrested here friday\nWorking with these are say or get a gentleman's just hours before he was arrested here friday say he never appeared to be confrontational bizarro is a good uh operates a food truck right outside of the\nNever again I think he never does allow for these days\nDo nothing else I just [noise]\nOthers who wants to say I get a pass John Say he did the racial antics Dominican anti L. D. V. T. Q. rhetoric cousin and his former attorney the political fervor becoming pro Trump\nIt's relatively new is the only first registered as a Republican two years ago\nDavid Schaper NPR News Fort Lauderdale\nWinter weather advisories are posted in parts of Maine through Sunday Morning National Weather service forecaster mark ... says some ... or do in higher elevations\nRussia looking at some winter wintry weather across central northern New England um say none of the big cities big days we'll see just rain but the head up and to further north of New England you'll see some snow sleet freezing rain\nGoes do winds have been approaching sixty miles an hour and there are reports of several inches of snow and higher elevations of Maine and New Hampshire [noise]\nUS military aircraft are now delivering emergency supplies to the northern Mary on the islands in the wake of super typhoon you to which left one person dead and caused widespread damage site pan the international airport reopened but with a limited schedule of flights\nThis is NPR News\nHuman rights activists in Serbia or condemning a government moved to publish the books of war criminals as Joanna Kakissis reports from Athens are you in court convicted the two ex gender roles of atrocities committed during the war in Kosovo Twenty years ago\nThe ... military officers now the ... which were jailed for participating in a terror campaign against ethnic Albanian didn't tell us about\nMore than ten thousand people died in nearly a million were displaced during the war Pasca Beijing was out of H wrote testimonies of the Seventy eight gain NATO bombing in Nineteen Ninety nine that push Serbian forces out of Kosovo\nThe Serbian defence ministry promoted these testimonies at a book fair the Balkans based group called the youth initiative for human rights says the shows that the government is trying to rehabilitate war criminals\nPops can they just serving a twenty two year prison term they got a vet you served fourteen years and was released in twenty Fifteen\nFor NPR News I'm Joanna Kakissis in Athens\nMore than a hundred Mexican federal officers have abandoned the blockade they got formed on a bridge allowing a caravan of thousands of Central American migrants to advance toward the United states but Mexico was promising shelter schooling in jobs that those who agreed to stay in southern Mexico\nIn the world series the LA Dodgers scored four runs in the ... and then Boston scored three runs in the seventh the Dodgers currently are tied with the Boston Red Sox for the for in game for a Dodgers Wynwood even up the series at two games each\nI'm Jim Huck NPR News in Washington\nSupport for NPR comments from NPR stations or their contributors include the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online it Hoffman dot org\nLike Copeland a\nPiano sonata by Carl Philip Emanuel bunk on the way and three months of chili pictures as well make sure you're listening for that agree performance with the Academy of St Martin in the fields Denise classical music is supported by queen bee pipe organs of Missouri and shown stunning pipe organ builders in California\nMember firms of ape he'll be a the associated pipe organ builders of America a group of designers creators and maintain are is a pipe organ there's more at a P. O. B. A. dot com\n[noise] six promenades by ... playing here by the scene ensemble\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n\nSix promenade spy ever do guard that once we have seen an ensemble ...\n\nHi this is talk of the town manager Libby Gibson listen to a live audience time will cast of the Nantucket more to select means meeting this Wednesday at six pm here an eighty nine point five W. N. C. K. yeah tickets NPR station\n\nElizabeth Spring Coolidge had a big impact on music even though she wasn't a fulltime musician she didn't pose a string quartet once but she mainly foster chamber music from some of the biggest composers of the early Nineteen hundreds more than two dozen composers wrote music in her request\nMany times many names that you've heard of in some you know we have as well\nBut this next one I'm sure you're familiar with this three by the chili pictures by ought to Reno Ruth speaking not only commissioned by spring Coolidge but she also hope to arrange the premier in Vienna Nineteen twenty seven it's risky ease music shimmering ... justice is three paintings that inspired\nBy the chili generation of imagining that Venus and spring [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\nNo no no I [noise]\n[noise]\n\n\nNo no\n\nOh yeah\nMm [noise]\n\n\n\n\n\n[noise]\n\nUh ... uh uh uh\n\nUh\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\n\nWell [noise] Mm\n\n[noise]\n[noise]\n\n\n\n\nDo you love the ... chili pictures but how do we know ... that was ... conducting the Academy of St Martin in the fields I'm Scott Lincoln ... music like colonel Philippe Emanuel box Mm\n\nHi this is kind of job right and I like to join me for the artists association of Nantucket are taught each weekday morning at nine a six string MORNING EDITION here in eighty nine point five kids the N. T. K. Nantucket NPR station\nThe piano sonata N E major by CPB by his plead nearby Danny Driver\n\n... ...\n[laughter]\n[laughter]\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\nMm [noise]\n\n[laughter]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\nMm [noise] Mm\n[noise] Mm\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nMm [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[laughter]\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]", "show_name": "Classical 24 with Bob Christiansen", "year": "2018", "city": "Nantucket", "day": "28"}