{"month": "10", "state": "TX", "station": "KTDH", "content": "March to know where you're more to news second survey which was written during the second World War that's all under Morrow up you can join us and I hope you don't you know just turn off the radio now there's more great stuff coming up just stay to proceed tomorrow\n\n... music is produced by city dealer to W. with ... in Chicago and produced an engineer by bill Sigmund that W cue acts are in New York City who get production help from ... Marcos and digital islands studios\nMajor support is provided by the early British Shapiro foundation was so Mr and Mrs Williams you brown an anonymous gift and they lose their supporters of W F empty\nExploring music was created by Steve Roberts and I'm ... and thanks for listening this is the ws empty radio network\nOn\nA\nHair on the high plains we love our live music and that's why H. P. P. our living room concert Gary brings you inspirational song writers from across the world which I was in Amarillo Garden City and towns across the high plains joined the mailing list and learn more about living here in concert that H. P. P. R. dot org\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to inquire or volunteer just email us at H. P. P. R. at H. P. P. R. dot org or call eight hundred six seven eight seven four four four\nFrom NPR News in Washington I'm jak sphere researchers have issued the first report on hurricane Michael's impact in Florida last week NPR's Greg Allen says will be used to revise building codes along the panhandle in a preliminary report a team of civil engineers funded by the national\nLast week NPR's Greg Allen says will be used to revise building codes along the panhandle\nIn a preliminary report a team of civil engineers funded by the national Science Foundation says the high winds and storm surge tested code and construction practices in the panhandle with devastating results to hospitals in Panama City took significant damage to the air force base had damaged the roofs and aircraft hangers and is currently uninhabitable\nMany metal frame commercial buildings failed in the storm losing much their exterior glass and siding even their interiors exposed\nResidents will damage wasn't confined to older homes built before current building codes were adopted the reports that some newer structures with elevated living spaces and concrete peers were destroyed by the record setting storm surge Greg Allen NPR News\nI'm In Turkey's claims that as evidence that missing Saudi journalist ... was killed inside the Saudi ... President Trump says he is now asking turkey to provide that audio or video to the U.S if it exists similar requested the Saudis came from democratic Senator Mark Warner vice chair of the Senate intelligence committee\nMy hope is if the Turks do have these tapes audio or video or that they release them in an appropriate way and then there needs to be consequences\nU.S officials say they're taking the disappearance seriously though Trump says he has not sent the FBI says journalist while working in part for the Washington Post is not a U.S citizen and the president also again called Saudi Arabian important ally\nThe Trump Administration is threatening to withdraw from another international treaty as NPR's Yuki Noguchi explains latest involves a postal agreement Trump asserts give Chinese companies unfair advantage when they ship goods to the U.S\nFor forty four years the U.S has been part of the universal postal union which sets shipping rates for international deliveries\nPoor developing countries including China I pay lower rates well rate than the U.S and Europe are higher nowadays because so many products are shipped into the U.S from China\nThe Trump Administration argued this amount to a subsidy this new escalation of trade tensions between Washington and Beijing could mean higher prices for American consumers\nThe administration says it will start the year long process of withdrawing from the treaty unless it is renegotiated ... NPR News Washington\nCommerce secretary Wilbur Ross is warning that the European Union is moving too slowly and trade talks with the U.S and he says patients on the part of the administration is running out\nDrop in the ... commission president John Claude younger greed in July to start talks intended to achieve zero tariffs and zero subsidies on non automotive industrial goods in an effort to try to avert a trade war\nOn Wall street today the Dow dropped Ninety One points to the NASDAQ was down to points this is NPR\nBased on early sales numbers in Canada there appears to be strong demand for cannabis products their today's the first day of legal marijuana in Canada and the farm shop all five which is powering many of the online stores there says it was at one point recording more than a hundred cannabis orders a minute today\nIt was department of agriculture is approved a new kind of cotton one with seeds people can eat as NPR's Dan Charles reports the seeds could become a source of proteins for animals\nCotton plants produce a lot of seeds globally forty million tons of them each year they're rich in oil and protein but people and most animals can't eat them because they contain a toxin called gossip all scientists at Texas A M university have created a genetically modified cotton plant that doesn't make gossip all and it feeds\nPeople can eat this cotton seed meal so can chicken and fish the inventor say the seeds taste like chicken ... the USDA now says farmers are free to grow the new cotton plants but it will be years before they're widely available and the F\nSay the seeds taste like chicken ... the USDA now says farmers are free to grow the new ... class but it will be years before they're widely available at the FDA still has to give its approval before the seats can be sold for using food Dan Charles NPR News\nIn Arizona manner purchased a band in stores you need to Phoenix suburb peers don't hit the jackpot stumbling upon a treasure trove of historical documents when reporting the Arizona Republic Don Smith found about two hundred letters longing to Henry ... Barbara Republican congressman from California from Nineteen Nineteen Nineteen thirty three\nIncludes letter signed by president Herbert Hoover an ... Nineteen thirty three letter says was made from wood used at the U.S Capitol after it was partially destroyed the British set it on fire\nAnd Eighteen fourteen I'm jak sphere NPR News\nSupport for NPR comes from NPR's Beijing or their contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodel homeowners can read reviews the local pros and book appointments online at home advisor dot com [noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\nAn earlier for pins John Beasley change your heart is the title of it too was until now which the tobacco you only a saxophone Jerry Lyn Carrington was the drummer John better to chew on base\nAnd bill summers doing percussion ... hands that you're brushing together toward the end John these we now with\nAnd bill summers doing percussion those are pans that you're brushing together toward the end [noise] John deeply now with the band monk straw and they used to tour with the band steely Dan this album a change of heart was produced by\nWalter Becker\nAhead of it we heard from vocalist Vivian Lee her album is called let's talk about love we heard or seen the man I Love which granted low on piano ... what's the basis and Jeff many whether the drummer and we they can that sat with Errol garner\nErrol garner with his unique interpretation up to my funny Valentine from an album called night concert alive concert in Amsterdam from Nineteen sixty four Eddie ... food was the basis that Kelley Martin the drummer\nArrow garner from light concerts to begin that said\nWe're listening to jazz I'm John Hill\nFrom guitarists ... Luke and\nReally that great the album titled do what this is looking up\nDog or [noise]\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise] [noise] [noise] Mm [noise] [noise]\n[noise]\nNo no no no [noise]\nNo but I'm going\nUh\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] just banking ding ding ding ding ding\nSkipping sickening getting thinking they're going to get a\nSecond oh well I got I got on that you can do I gotta\nGet get get get get get get get get I get that does that seem to get up and said you know it's\nGoing to make the thing that I could get get get get get get get\nGet get get [laughter]\nTo to make\nTheir own\nBusinesses and the\nBoom\n\n... song got to run as a result we ride I took one of the airline\nJake my seat to board the plane and what is this I speak Leonard Bernstein comes the boredom sits right next to meet the person last New York to LA some things just workout rank\nI'll be sitting next to Leonard Bernstein the lights\nMaybe I should just like like I Do not recognize\nThe way we can do my best not to act like I said now we're rolling down the runway the next layer nonchalant like God right next to lead the at ... ...\nNaturally I tried to get what you're my only\nIntroduce myself by the\nAnd we start to chat down to drink and talk about our word\nMan side by side of New York too and\nThem were chatting during the dog you like the very best pals\nTalking music like ...\nNow is that the upbringing but really low can [noise] do you love the Malone and he's got to stay\nSome songs I wrote them\nTo the poetry of music seems to have\nHe tells me that new show\nWell then now it's being the beach urban he's not used to dealing with the\nLending side by side of the New York too\nMeat does the London\nTimes crossword ... through\nDoes the puzzle with him I Do not have\nWhat an intellectual but a woman to run the government\nWe talk about the world but low as when\nWhat an intellectual when the guy\nWe talk about the world but low as when\nPlanes to Disney\nWhat are trained in the back up just like just\nStart a New York to LA\nKnow what I'm saying I'm not\n\nBlessing that live\nFrom basis and\nVocalist Jamy Ian Hart life at that Tuesday's the name of the album me and many of the name of that tune Joe back on guitar Terry Clark was the drummer and Dave Samuels on vibes\nAhead of it we heard from Michael ... Michael brick or from an album called two blocks from the edge that was El Nino Don alliance on percussion Justine ... says the drummer bassist James Genus and pianist Joey Colorado\nTwo blocks from the edge refers to something his friend the pianist Don grown that used to say that he liked living close to the edge as long as it was two or three blocks away\nAnd we began that said with your next to Erin Goldberg his album at the edge of the world speaking of education the tune black or if you saw\nHim on the current law ... opinion on base and Leon Parker on drums and vocal\nPercussion which we heard there the first time I saw Leon ... you had an extremely small drum kit\nTom tom bass drum and uh what is it a high hat or was it just as simple as probably a high and that was it\nAnd now he's at a vocal percussion to the mix Aaron Goldberg to start that set on John hills were listening to jazz\n[noise]\n\n\n\n\nAnd\n\n\n\nAnd\nWas a\n[noise] [noise]\n[noise] [noise]\n\n\n[noise] [noise] and I\n[laughter]\n\n[noise]\n[noise]\n\nSupport comes from United Wireless serving southwest Kansas with wireless products and plans that suit Jordan each stores in agents across the region coverage you deserve service you expect you to wireless dot com\nH. P. P. R. is a community resource that delivers media that matters and is made possible by listener contributions from HP are you gain knowledge and grow community\nAre is a community resource that delivers media that matters and is made possible by listener contributions through H. P. P. R. you gain knowledge and grow community so please give today at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da ... of high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\nLive from NPR News in Washington I'm Jim ... President Trump says the U.S is asking turkey for audio and video relating to a missing Saudi journalist Trump confirmed it during a brief cue and I and with reporters\nAnd that was a big deal in Phil is with her but we have asked for it if it exists with them but I mean we've asked for it if it exists\nThe president on Wednesday repeated that Saudi Arabia is a major ally noting and there's also an important customer for US military experts\nIn an interview with the Associated Press on Tuesday Trump warned against a rush to judgment comparing condemnation of Saudi Arabia to the allegations of sexual misconduct against Supreme Court justice Brett Kavanaugh\nResidents in parts of Florida's panhandle are still waiting for power and cell phone service to return after hurricane Michael tour through the state's northern coast a week ago NPR's Hansi Lo Wang reports some rural communities are just starting to receive relief services\nFEMA has been sending teams of search and rescue specialist like Adam sheets of Virginia task force one injecting county sheets them multiple trailers damage from the storm on the same property way brick house still stands\nAll families and their own at home or a third of all of them are okay in order to get assistance from medically they have some medical issues\nHundreds of families are still sheltering in school buildings around the region on along NPR News Jackson County Florida\nMigrant drownings and the Mediterranean Sea have reached an all time high this year and as Joanna Kakissis reports from Athens the United nations warns against a rising tide of hostility\nThe un says the anti migrant rhetoric that's rising in Europe is toxic and divisive in a statement the un high commissioner for refugees fill up a grandy said the anti migrant rhetoric is out of touch with reality falsely painting Europe as a plate under siege by foreigners\nGrande called this scapegoating these are human lives he said\nMore than Seventeen hundred migrants have drowned so far this year mostly in the central Mediterranean they're trying to reach Italy or an anti refugee government has tried to ban all private humanitarian vessels rescuing migrants whose flimsy boats St in this long in perilous stretches see\nFor NPR News I'm Joanna Kakissis in Athens\nEuropean Union leaders are giving themselves several more weeks potentially until the end of the year the clincher friendly divorce with Britain before their separation brings a summit on Wednesday avoided any friction but also produced no tangible results\nOn Wall street stocks ended slightly lower on Wednesday trading remain choppy the Dow Jones industrial average gave up Ninety One points after being down as much as three hundred Nineteen earlier than as the composite flip two points and the five hundred index fell less than one point this is NPR News\n\nThe corners of spin off of its recent revival of the sitcom Roseanne group\nNews\nABC's the corners of spin off of its recent revival of the sitcom Roseanne drew ten point five million viewers and its debut Tuesday NPR TV critic Eric Deggans says the ratings were still strong even without the original shows starring\nViewers are the Connors learned pretty quickly how star Roseanne Barr had been written off her own show a character Roseanne Connor died off camera after an opioid overdose the controversy didn't bring blockbuster viewership on Tuesday but the counters ratings ranked as the most watch new showed the fall TV season so far\nWith audience members closed to the ten point three million people who watch the last episode of Roseanne in may\nABC developed Connors as a version of its Roseanne revival without Roseanne Barr after this star center racist wheat in may that prompted the network to cancel the sitcom bar issued a statement criticizing the decision to kill off our character as quote grin and morbid Eric Deggans NPR News\nCanada became the world's largest legal marijuana marketplace on Wednesday and some retail shops had to turn away customers after selling overhead Canada's national approach allows unfettered banking for the pot industry inter province shipments of cannabis and billions of dollars in investments\nA sharp contrast with prohibitions in the United states where nine states have legalized recreational sales of pot\nAnd more than thirty have approved medical marijuana\nCanadians come out so order of marijuana products through websites run by provinces are private retailers and have it delivered to their home by mail\nI'm Jim Huck NPR News in Washington\nSupport for NPR comes from NPR stations other contributors to include the public welfare foundation committed to advancing justice an opportunity for people in need more information at public welfare dot org and that John D and Catherine the MacArthur Foundation at max bound dot org\n[noise] my uh [noise] um\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nDue\n\nBoom\nBoom boom [noise] her\nBlue moon and [noise] um [noise]\nMusic from a group calling themselves the unhinged sex tests don't blink is the name of their album all of them all\nThe name of that song from will Campbell\nThe Alto saxophonist in the band Matt Olsen on tenor\nBurn she worked on trumpet Michael coke or at the piano John hammer on base and I'm more ... on drums the unhinged sex\nBefore that pianist Harold ... and guitars Kevin Eubanks tuned up on a Wes Montgomery to go full house from the\nHerald may run out of the leading man and we begin that said we're Artie Shaw from an album called mixed bag kind of an all star session from February or march Nineteen fifty four\nWith the ... and his grandmother see five Joel rolling on Bart Jones at the piano tell follow the tar Tommy Potter on base in herb\nQuicker on drums the two was sunny side up Artie Shaw from mixed bag this is Jeff Gordon\nThe two was sunny side up Artie Shaw from mixed bag this is jazz or bureau St John hill\nI'm Angie ... regional content director ... high plains public radio I injury each day that your delivered the news that matters most to you your membership makes that possible show your support today by visiting H. P. P. R. dot org\n[noise] how'd you like to wear your shirt and eat it too this is Sandra Tsing Loh with down on science when Cyprus are plucked\nFrom a cotton plant what's left behind our pilots teach practically bursting with protein\nUnfortunately they're also bursting but they better tasting toxic chemicals called gospel it's the plants natural defense against insects\nSince the Nineteen fifties scientists have been trying to get rid of gospel and turn the N edible cotton seed into a nutritious little snack\nThat came to break through from researchers at Texas A M university and the U.S department of agriculture the same interest interest the air with approaching made by a key genes and slow gossip all production down to a trickle result in much mellow where seed while the rest of the plant is still protected from past\nThe same technology could apply to other crops with toxic parts like father beans what could that mean about forty million metric tons of cotton seed are produced annually around the globe from that you could feed half a billion people each year\nAnd closed them to vote talk about dressing tastefully [noise]\nThe lowdown on science has produced by LDL west Media Lab in partnership with the University of California Irvine science communications and eighty nine point three K PCC on the Web but Ella wage deal WN on science dot\nOrg [noise] this is Sandra what's on Twitter S. H. B. O. W. S. [noise]\nSupport comes from Amarillo symphony presenting concerto an F ... conducting and featuring Conrad towel on piano October Nineteen twenty seven thirty PM at the globe new center Amarillo symphony dot org\n[noise] [noise] [noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\nIt was the [noise]\nThe\n\n\n\n\n[noise]\n\n\n\nSaxophonist flew to St Lois on this album Joe Farrow album called Joe Farrow quotes that\nWere ... Korea the piano Dave Holland on base jak digit on drums and guitarist John McLaughlin the song was molten glass to cut was sung by mark Murphy I'm an album called stolen and other well that's a collection of tombs\nMark Murphy with Claudio ... on guitar ribbons ... drums shallower water percussion and Michael often bow at the piano\nAnd we began that fit with a another you're being to cold in the middle passage Jean from drummer ... boss Brazil\nWe're Dimitri ... ski a saxophone Jerry we're on vibes Bob Rodriguez keyboards and Gary Missouri rugby on base\nAnd to ... go look that up a useless landscape I knew it was something to do with a landscape just continue\nOn your host Jon Hill\n\nYeah teach which\nWill lead and\nMe here not telling you and\nThen in ...\nYears\n...\nJones you\nKnow the\nOne to keep some Tammy\nOne can't\nWhen I'm\nIn San Diego and the\nJets to me I Try to draw\nThe\nLine you know we\nWe\nAre making my twin again with my son in law suit and [noise]\nTo nine nine\nNo one is they\nDon't you know from my\nMy songs\nI seen\nMy son did you want\nMy DNA that\nWe're on the ground zero\nDo you remember that\nWe're um we're on to do because I'm\n... percent do not\nKnow what I\nCould see\nThat I could just be on your cell phones when we see\nNo I only know what I see the Jewish ...\nWent to probably\n[noise]\nThis is John Hill and you're listening to jazz time on listener supported high plains public radio\n[noise]\nSupport for H. P. P. R. comes from pioneer communications tech center elicits Candace here to answer your questions with a phone line of desktop laptop tablet PCs and accessories more at P. I. O. N. T. O. N. N. dot net\nHi I'm Jonathan bigger an every weekday I bring new news stories about the high plains that I Love doing it but I Can't do it without your support so call one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org to pledge today\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da ... service of high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support tablet H.\nP. P. R. dot org for details live from\nNPR News in Washington I'm Jim hawk the Washington Post has published the final column written by missing Saudi journalist ... who disappeared more than two weeks ago after entering the Saudi consulate in less than ... ... ... Neuman has more I'm\nIn a column published by the post on Wednesday 'cause she'll give Jay warns that governments in the middle east quote has been given free rein to continue silencing media at an increasing rate\nAsked because he says Arab governments who suppress journalists are no longer receiving backlash from the global community he gets in Saudi Arabian government as an example earlier this year a criminal court gave a prominent Saudi writer a five year prison sentence for insulting the royal court the official body that represents the king\nBut now the case of parents have to show that she has sparked international outrage and brought her need attention to the authoritarian kingdoms human rights record genuine nprmontagne Washington\nFlooding from torrential rains in central Texas has left at least two people dead Governor Greg Abbott issued state disaster declarations for Eighteen counties are affected by the flooding in ... Texas local official Mary Cunningham says a lot of roads remain closed\nEverybody's actively working three some of the province that exists we still have the ... a lot of water crossing that are close please don't does three that water ah remember a turnaround that drown\nYou already saturated area was expected to get an additional one to two inches of rain Thursday and friday is rivers overflow to bridge was destroyed people were forced to evacuate their homes and others had to be rescued\nThe Democratic candidate for Illinois governor is facing or racial discrimination lawsuit against his campaign from his own campaign workers Illinois Public Radio's Brian Mackey has more\nTen current and former staffers are claiming Jamie ... campaign operation subjected them to harassment and retaliation the plane\nPublic Radio's Brian Mackey has more\nTen current and former staffers are claiming Jamie ... campaign operation subjected them to harassment and retaliation the plaintiffs worked his field organizers for the Democratic gubernatorial candidate most are African American one is Latina\nThe alleged they were forced to work in dangerous location than had to endure quote crafts and racially discriminatory language in a statement Partridge says the allegations are not true and his running mate Giuliani Stratton who are self as black since they're baseless an offensive\nWith less than three weeks to go in the campaign Pritzker has consistently held a double digit lead over Illinois incumbent Republican governor Bruce Rauner for NPR News I'm Brian Mackey in Springfield, Illinois\nAn official with the U.S Geological Survey says automated alerts from the new west coast earthquake early warning system are ready to be used broadly by businesses utilities schools and other entities but not for mass public notification\nSystem is designed to give just enough warning to allow time to automatically slow trains stop industrial processes and started\nBack up generators this is NPR News\nA government minister in India has resigned amid accusations of workplace sexual harassment as NPR's Lauren Frayer reports from Mumbai he's the most powerful man to fall so far in India's burgeoning me too movement\nAnd Jay act by with India's minister of state for X colonel affairs one step down from the cabinet he was a long time newspaper editor before he got into politics and it was in the news rent and said he ran for many years that at least twenty women say he harassed or touch them inappropriately\nBy denied any wrongdoing and find the decimation last week against one of his accusers in a written statement he said he's resigning to challenge false accusation levied against him\nSocial media in India had been flooded in the past two weeks with stories of workplace sexual harassment many are calling that India to meet you moment Lauren Frayer NPR News Mumbai\nElectric carmaker Tesla says it signed an agreement Wednesday into securing land in Shanghai for its first factory outside the United states the company is pushing ahead with the development despite mounting us Chinese trade tensions China is the biggest global electric vehicle market untouched was second largest after the United states\n... filed the lawsuit against Amazon Wednesday saying the online retail giant used ... messaging system to steal at shelters\nIn the lawsuit ... said Amazon representatives signed up for ... accounts and message sellers to get them to sell their goods on Amazon dot com which ... says violates its user agreement Seattle based Amazon\nDeclined to comment I'm Jim hawk NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the Charles Stuart my foundation for more than Ninety years supporting efforts to promote adjust equitable and sustainable society more at ... dot org and the corporation for public broadcasting\n[noise]\n\n\n\n\nThat are going\nWhere you're in the background\nThan more\n... percent of the\n[noise]\nDa da\n\n\n\n\nDa da da\n\n\nDa\n\n\nDa da da da da da da\n\n\nDa\nDa\n\nThe Frank man to jazz orchestra with Lyme house of blues\nFrom an album called a miracle that tracked future Danny embryonic guitar Bobby shoe on trumpet and Kim park on Alto saxophone Larry Harris on piano\nMove Fisher was the basis and drummer re Brinker before that it was dizzy Gillespie and friends and some friends\nBasis ray brown virus nope Jackson pianist Hank Jones\nDrummer Philly Jo Jones and saxophonist James Moody recorded live in Montreal and Nineteen eighty\nIt was called the concert of the century a tribute to Charlie Parker and the two heard was blue and buggy\nI'm John Hill you are listening to jazz\nHere's music from guitarist Jim Hall the album called dedication and inspirations the two called my piece\nFor the artist or read my piece was inspired by Jim stocks about much he said he sat in the studio one day [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nThan we may\nYou know\nThe trees\nThe three the three\nBe that they need to read 'em\nDarryl from his album Bob Barrows jazz Tobin dream featuring Dwight west vocally\nBob pharaoh with a no not a large orange section but about six then you ... and Rob in key on Trump it's Gerald Ford and\nFrank Elmo on Alto saxophone\nFrank nickel low sea on Alto and ... and a baritone sharp graduate on piano Darryl John ... was the bassist and Steve John on drums I'm John hills and this is jazz\nMm Mm Mm\nAnd this is ...\n... ... [noise] [noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\nI got nine and she did it on\n\nAnd I had to stay [noise]\nIt was not in the hands\n...\nAnd I had no way [noise]\n\nFrom the dark I mean I'm going to do\nAnd it seemed to say you you go\n\nThere you go [noise]\n\nWhen I say\nI just can't recall [noise]\nAnd they were\n", "year": "2018", "show_name": "Jazz Time", "city": "Dalhart", "day": "18"}