{"month": "10", "state": "TX", "station": "KTDH", "content": "Additional funding is provided by Mr and Mrs Williams ... brown Brenda Earl Shapiro this is Joanne Harris endearing Heritage Foundation and the members of the ws empty fine arts circle executive producer is Steve rabbits and\nI bet McLachlan extra listening\nYou're going to a concert scenario with the music on the program or would like to know more\nExploring music dot W. I. N. T. dot com it's a companion to this program and a quick reference for all things classical with over twelve hundred hours of programming it's a one stop resource for newcomers to longtime music lovers\nExploring music dot W. F. N. T. dot com from the ws empty radio network\n\n\n\n[noise] this is Ninety One point five Casey ... eighty nine point three Katie de ... Ninety One point seven KGAN Hayes service of high plains public radio\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. T. R. S. H. P. P. R. dot org live\nFrom NPR News in Washington I'm jak sphere\nIn Trump is celebrating what he calls the biggest trade deal in us history NPR's Scott Horsley reports updated agreement with Mexico and Canada could give a boost to American dairy farmers an auto workers the deal announced or rewrite of the quarter century old NAFTA agreement which President Trump\nWith Mexico and Canada could give a boost to American dairy farmers an auto workers\nThe deal amounts to a rewrite of the quarter century old NAFTA agreement which President Trump is often criticized it gives American dairy farmers new access to the Canadian market and is designed to encourage more auto production in the United states more auto parts and automobiles\nWill be manufactures inside the United states we will be manufacturing many more cars\nWith the White House deadline approaching candidate signed onto the deal late Sunday night the agreement leaves in place for now us tariffs on imported steel and aluminum as well as the retaliatory tariffs that Canada and Mexico imposed in response Scott Horsley NPR News Washington\nAs the death toll continues to rise from last friday's massive earthquake and tsunami in Indonesia President Trump is sending condolences to the country and its president\nAnd the rose garden press conference today Trump said he is dispatch first responders including the military and others to help in the aftermath of the disaster\nOfficials say the earthquake and tsunami wave that struck there have claimed the lives of at least eight hundred and forty people and destroyed thousands of homes triggering immediate humanitarian crisis perhaps the hardest hit area of the city near Palo another quake that struck the country today the it's not clear though whether that cause additional damage\nThe White House has released a memo analyzing the testimony of Christine Blasey Ford by the prosecutor who questioned or before the Senate last week NPR's Kelsey Snell reports sex crimes specialist Rachel Mitchell says she believes for doc Ford's accusations would create a weak case\nCynically his hearing Committee Republican hired Mitchell to question for Dr accusation that Supreme Court nominee Brett Kavanaugh sexually assaulted her more than Thirty years ago in the nano maker because she does not being a reasonable prosecutor would bring a case based on the evidence for preventing\nRichard Ford identified written either refuted her allegations or therapy corroborate then she worked for the lack of details about the party where she rented the attack took place undermined her clean\nThe FBI is now investigating fourth accusation against cabinet and another accuser who had come forward in recent weeks county it's now NPR News Washington\nA group of business economist is forecasting the U.S economy will continue to grow to healthy pace this year in June next though is that the national association for business economics said the Trump administration's trade policies could potentially slow growth\nSurvey fifty one economist forecast us economic growth a two point nine percent this year from two point three percent last year next year the group predicts the economy will expand at a to point seven percent annual rate\nOr makes clothes on the first trading day of the fourth quarter the Dow was up a hundred and Ninety two points today the NASDAQ closed down nine points you're listening to NPR\nToday marks the one year anniversary since a man opened fire with an outdoor music concert in Las Vegas killing fifty eight people before turning the gun on himself and bears Windsor Johnston reports the shooting sparked a nationwide debate over bump stock devices that allow semi automatic weapons to operate more like machine guns\nThe sale of bump stocks it's still legal in most states despite efforts and promises from lawmakers to ban the devices Andrew Patrick with the coalition to stop gun violence said there's been some action on the state level but very little on the federal\nWe were told by Speaker Ryan that they would take a look at bump stocks there was never a hearing on that in the house of the president told us that the Parkland that bump stock for done that he was going to get rid of them a we know that's not the case the ATF has still been caught up in the bureaucracy in in banning these accessories\nPresident Trump has reiterated his pledge to get rid of bump stocks saying he expects to finalize restrictions on the devices within the next several weeks Windsor ... NPR News officials in Georgia today\nIt's pledged to get rid of bump stocks saying he expects to finalize restrictions on the devices within the next several weeks when Johnston NPR dates\nOfficials in Georgia today called in the capital re after a tractor trailer caring eighty nine cows overturn this morning interstate Seventy five and I truly eighty five sending animals fleeing causing accidents and clogging morning traffic\nCobb County police at last words that all but two of the cows have been recovered ten animals were killed in the crash law enforcement officials directed a metal barrier into real cowboy solve law enforcement to round up the way we are the animals could also features prices\nClosed higher today oil up to ... percent to Seventy five thirty a barrel in New York I'm jak spirit NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews the local pros and book appointments online at ... dot com\n[noise]\n[noise]\n[noise] Mm Mm [noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\nTired your heart from dying lock your dreams that night\nAnd you could happen\nTo ... to\nYou might as well\nAs a more jobs are so high and we're\nDown you know\nLow number\n... now\nI Am going to run when church bells ring and\nGood to have to do\nThere was one of the town you're are really would be\nThat it happened to\nMe is\n\nHow do you\nLive your dream that night\nHad done she\nOh night down\nNumber one eye drops\nNot sure\n\n[noise] ah\nThere\nAnd do\nJobs [noise]\nTo me\n[noise]\n\nA medium to large ... ... ... ... we're going to crawl bring you ... it could happen to you\n[noise] some medium to large ensembles in the Senate with Diana crawl bring it home with it could happen to you by the Clinton\nHamilton jazz orchestra from her album\nFrom this moment on another Canadian this time Oscar Peterson at the piano along with ... or Kenya so I'm doing to our news in order to hurt us in on base\nMartin Drew on drums and Michelle aground conducting the Michelle Leveron streams open spaces the name of the piece from a commissioned sweet called trail of dreams\nAnd we begin on that set with this\nShook oh it was something of a travelogue of lower forty eight states the two all had no saddle [laughter] featuring Corey christiansen on guitar and clay Jenkins on trumpet\nRandy broker and ... also guest on this album your Danny got really there on drums and pure Daniel sing along piano competition spot Chuck owing a jazz surge the album called\nWhispers on when you're listening to jazz I'm John Hill\n[noise] open your mind with three hours of music every weekday on high plains morning tuned in at nine AM central for the next full of forgotten favorite must live in Studio for new artists high plains wanting to MORNING EDITION only I'm looking at the point at high plains public radio\nTo sign a shrine in\nSupport for high plains public radio comes from member listeners and marched in engineering incorporated consulting petroleum engineers of own it's Kansas\nAre you tired of hearing the same music over and over again I Want something a little more maybe something simple into function disorderly on my plane public radio this week Lewis Black flag she first and the gimme gimme lots more\nI'm Brian bureau joined me this Saturday Night at midnight sexual right here on HBO or his\n\nSupport comes from the list are members up high plains public radio and by Regan jewelers for quality and craftsmanship had been backed by their last name for over eighty years located in downtown Garden City Kansas breaking mean\nFrom the BBC with her that those are the religion of either being completely submerged by the water or what the way in ... states from act that\nThey're trying to an oil spill which which holds your spouse [laughter] you know when somebody about\nCorrespondence on the ground zero to ... you can try to like to see me overnight on HBO [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\nIn the ...\n\nDaniels ...\nCountries in the\nYou\n\n\nYou know ...\n\n\n\n[noise]\nHe said he had\nMentioned in June the ...\n\n\nLives in the knees\nDomonique ...\n\n[noise]\n[noise]\n\nFor taking my Mooney hey I Know I was going to ... [noise]\nNah\n...\n\n\nMm\n\n\nFocused join you Michel from pianist Herbie Hancock Gershwin this world\nRelease Stevie Wonder on her Monica Wayne Shorter on sex and the Ira Coleman on base summertime before that that was the longest mark junior from the first take album the tune\nOf course his dad's composition around midnight you did a great job there with Bobby for chili on Alto Willie Williams on tenor James genius was the basis with Don stickler on trumpet and Ronnie Matthews at the piano\nAnd we started that set with a very interesting line up on the man I Love your drink Miles Davis on trumpet Milt Jackson on vibes the longest mark at the piano ... chief and drummer\nKenny Clark come through my collection for on the prestige label lets the jazz showcase series\nJust Miles Davis that too was originally released on an album called\nMiles Davis and a modern jazz giants giants indeed\nYou're listening to jazz I'm John hale\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\nDo do do you\nSee the ninth inning per has been the better than eating squirrels\nAnd binding horseshoe losing your hand had any any thing about a little bit of any of these\nThings they say that I think but I live on the on the spot it crashed into the ... a\n\nMan in the pool and the bad thing about these things\nTo ... the main on\nThe stand ...\n\n\n[noise]\n\nHello my name is Mary and everything 'cause we can't just when you look into hiking up the media in\n\n\nAll of the brightest people in Haiti Kansas the high plains public radio [noise]\n\nThe brightest people in his hands in the high plains [noise]\n\n[noise] this is Ninety One point five ... eighty nine point three ... Ninety One point seven KGAN Hayes a service of high plains public radio\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or call eight hundred six seven eight seven four four four\n\nLive from NPR News in Washington I'm Shay Stevens President Trump says the FBI should do a comprehensive investigation into the allegation surrounding Supreme Court nominee Brett Kavanaugh as NPR's Mara Liasson reports Trump also says that Senate Republicans should determine the scope of the probe\nPresident Trump said he wants the investigation to end quickly and that the FBI should look into whatever the Republican Senate wants it to he said he believes Kavanaugh was truthful in his testimony and that his family has been treated horribly but he also said he has no backup plan if Kavanaugh should withdraw or be rejected by the Senate\nI Hope that he gets approved I Hope that the report comes out like a ... like I really think it should I think it will I Hope I Hope\nWhat look I'm waiting just like you the president said he was surprised how vocal Kavanaugh was about his drinking problems in high school President Trump doesn't drink which he joked today was one of his only good traits Mara Liasson NPR News Washington\nNorth Korea is warning the United states than a declaration to end the Korean War should not be seen as a bargaining chip\nAnd talks to NPR young nuclear program the North's official news agency claims that country has taken what it called significant step student hostile relations between the two countries but it says the U.S it's a sub doing those actions through sanctions\nIt also says a formal entered the Korean War can never be seen as a bargaining chip for denuclearization\nPresident Trump is celebrating what he calls the biggest trade deal in us history Canada's prime minister Justin Trudeau is also talking up the benefits of the new continental trade agreement as damn carbon Chuck reports Trudeau brief for eventual leaders earlier today\nDrew those as the United states Mexico Canada agreement will modernizing stabilize the economy and guarantee a higher standard of living over the long term the Canadian prime minister says the agreements still needs to be ratified by all three countries but Trudeau says he and his American and Mexican counterparts agree that this trade deal would strengthen their close partnership\nNot everyone in Canada is pleased representatives of the dairy sectors say will undercut their industry by opening up the Canadian market to American products\nAnd there's concern that the tariffs on Canadian steel and aluminum are still in place but the head of you know for the auto workers union says overall us MCA as it's now known will provide benefits for Canadian workers and the economy for NPR News I'm Dan carpet ... auto\nSome four days after an earthquake and tsunami devastated much of Indonesia is still a ways the island the region still experiencing after shocks the quake another quake hit the region today at the search for trap survivors continues the disastrous claimed at least eight hundred and forty lives and destroyed thousands of homes\nThe hardest hit area is near the islands capital city of ... President Trump's at the U.S is sending first responders to aid disaster relief efforts [noise]\nThis is NPR News\nThe universe they one of the nation's largest for profit colleges is being sold to Connecticut based venture capital firm ... ventures if the deal is finalized palm CEO\nFor profit colleges is being sold to Connecticut based venture capital firm palm dentures\nIf the deal is finalized palm CEO Bradley Homer would become CEO and chairman of the national education chain he already runs Caldwell education L L C which owns a small profit for college in San jose\nThe business friendly Trump Administration has given a tentative green light to the sale the department of education says that divide must honor promises previously major students including a commitment to disclose a variety of information about costs and student debt\nTo scientists one from Texas the other from Japan shared this year's militant bill fries for physiology or medicine and she's in public media Davis land tells the cold winters are being recognized for dancers and cancer treatment\nThe Nobel Committee says James P Allison in ... ... both discovered ways to use the body's immune system to fight off cancer Alison spoke at a press conference this morning he thinks patients in clinical trials instead of receptor called C. T. L. A. for was key in his discovery\nOr figured out that she taught for was the breaks open riches sort of role is just disabled or breaks cheer for that role album your sister to to attract transfer and uh did\nAllison says it's the first Nobel given to a cancer therapy drugs developed from the method treat melanoma and other cancers for NPR News I'm Davis land in Houston\nFor the wall street stocks closed mixed the down gain a hundred and Ninety two points this is NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum pitcher who collection and the museum of fine arts more at visit saint Pete Clearwater dot com\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise] ... [noise]\n[noise]\n[noise]\n[noise]\n\n\nThe group called fossil Roseville led by drummer Mari\nSealed de Souza and the album try tortillas which I Believe means trajectories the to their children do not row Sierra although I've heard it as double rainbow\nBut that's a that's result for you or you feel the leader on drugs were Dimitri ... on sex Peter where on vibes Bob Rodriguez a keyboard and Gary Missouri\nOn base ahead of it it was George Benson from his body talk album along with a Nineteen year old Earl clue on guitar backing him up on the tune when love it's grown\nGary King on base jak do Jeanette on drums and Harold ... at the piano and we began to set with organist joy to Francesco the album ballads and blues\n... to ... see or or between Paul ball and back on guitar Byron Landrieu on drums and special guest\nGary bart's on saxophone\nThis is jazz I'm John Hill\n[noise] [noise] [noise]\nHello this is Trevor hands from Garden City and you're listening to members supported the high plains public radio [noise] and then\n[noise] one better vision how about this question your eyeballs this is Sandra Tsing Loh with the lowdown on science I shape is the key to perfect vision\nBut most of us have eyes as wonky as a ... show portrait lasik eye surgery fixes decision by reshaping the eyes lens by blasting bits of your eye out for the laser scary\nBut if you click group from Columbia hope to find a gentler way to reshape the eyes of\nTheir big break came well blasting pig eyeballs with lasers they found that with the right amount of power the I Would more laser linked together fibers that make up the lands it's going to be into shape without removing anything\nThat did this damaged the ice to find out the researchers took near sighted bunnies and laser their eyes\nDid their lenses send blight to the right place yes they may twenty twenty buddies so perfect vision could be insight ... what other problems can be solved by squishy maybe love handles\nHalf [noise]\nThe lowdown on science is produced by el DOS Media Lab in partnership with the University of California Irvine science communication and eighty nine point three Che PCC on the Web at ... WN on science diet or\nThis is Sandra with us we're at L. O. H. T. O. W. in [noise]\nPhillips from age ...\n[noise] [noise]\nPhilip Shaun Hayes Kansas and my wife and I are proud members of\n[noise] I'm Glad\n... in this would be\nTo capture me [noise]\nBut you had such for assistance you wore down my resistance I fell and that was where\nRaven handsome Romeo\n... one you\nI shall never never no\nIt's not that on there but all my heart relax do when you\nCame in to you [noise]\nReally part\nLeads notion\nKnow much emotion\nFor a lovely causes [noise]\nYou want to be Monday we pick on the furniture in\nAs I had\nBaby you know and you [noise]\n\nThere you go again you\nCan wait a minute or a lovely continents [laughter]\nThat regret\nOn you [noise]\n\n\n\n\n\n\nThe high yesterday in Hong jazz orchestra from the album he yucky\nWhich means stories that was part of me and you go to Don day all the composition\nBy how you see in Hong Kong and she is also the director of the orchestra featuring on that to been kono once parental saxophone and Jeremy pow on tenor sax\nAnd it was so not true at the sand is just ...\nBraun and Jeremy pile on tenor sax\nAnd it was so not true at the sand to start with Count Basie orchestra a couple of troops there I've got a crush on new and a guy you undermine arranged to conducted by Quincy Jones a classic album ... not sure\nThat the sense you're listening to jazz I'm John Hill\n\n\n[noise] [laughter]\n[noise] [noise] [noise]\nOoh\n\nWe may know me\nWell you know [noise]\n\nI think that [noise]\nThat\n\nWe see [noise]\n\n\nAh [noise]\nI ... my ...\nAnd ... where\nThe ... [noise] well I'm\nHappy to\nSee\nAnd we go back to the bar on\n\nA jury\n\nSo long to [noise]\nTo he\nBought a ... [noise]\n...\nFor um [noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nThe new\nThis [noise] me during\nAnd we'd\n\n\nMe [noise]\n[noise]\n[noise] do he\n...\n\n\n[noise]\nThis is John Hill and you're listening to jazz time on listener supported high plains public radio\n[noise]\n...\nMy name is Michael Jordan you and you're listening to high plains public\n\nSupport comes from palace computer center of Garden City with every expanding sales and service for computer needs in southwest Kansas\nLocally owned and operated for Thirty years palace computers dot com\n[noise] this is Ninety One point five ... eighty nine point three Katie da di di di ... seven KGAN Hayes a service of high plains public radio\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n\nLive from NPR News in Washington ... Stevens Senate majority leader Mitch McConnell says the sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh do not warrant a criminal investigation FBI agents of question at least four people about accusations\nDating to Kevin O's high school and college years and huddled says Republicans are not deterred by the set back and getting cabinet confirmed operation\nProcess for judge Brett Kavanaugh one of the most qualified and most impressive Supreme Court nominees\nAt our nation's history is moving forward\nMcConnell is expressing doubt the Democrats will be satisfied with the results of the expanded background checks either way he says investigators have until the end of the week to gather any additional information on Kevin off\nThe United states Mexico Canada agreement is being counted as a boon to the economies of North America K PBS's border reporter gene Guerrero reports that experts say that once again Mexico's small scale farmers are getting the short end of the stick\nAfter the original NAFTA was signed the u._s. so large waves of illegal immigration from Mexico\nThat's because Mexico small farmers are compass enough couldn't compete with heavily subsidized agriculture in the U.S [noise] Duncan wood of the Wilson Center in Mexico Institute says the new treaty is great overall but more of the same for Mexico's rural poor\nI don't see that the future of the mix income seniors gonna be any better off to disagreement\nHas changed the you know have a government in Mexico which is committed to providing support to work because of the few swear bombers\nMexico's president elect End Days member Lopez Obrador has promised to make the poor his priority for NPR News I'm Jean Guerrero in Washington\nPresident Trump has resented the medal of honor to an Afghan war hero as NPR's Greg Myre reports the former Green Beret was recognized for helping to say\nThe medal of honor to an Afghan war hero as NPR's Greg Myre we report the former Green Beret was recognized for helping to say wound do comrades during an intense firefight\nStaff sergeant Ronald sure unit faced relentless fire for more than five hours when it tried to attack a remote mountain village in Afghanistan shock valley in two thousand and eight\nShort treated the wounded put them in a makeshift sling lower them down the mountain and help them evacuated by helicopter Vinnie return to the battle President Trump praised him at the White House\nNot a single American died and the brutal battle thanks in great measure to runs heroic actions sure\nNow a secret service agent is facing another fight for his life he's been diagnosed with stage four lung cancer Greg Myre NPR News Washington\nNorth Korea says it will not allow us to use ending the Korean War as a bargaining chip and denuclearization talks the north state media cleans Pyongyang has taken significant measures to and hostile relations\nBetween the two countries you're listening to NPR News\nOregon is the first state to ban in herbicides commonly used to control roadside weeds and reduce wildfire risk in the west trouble is the active ingredient also kills trees as Oregon Public Broadcasting's Emily ... reports\nThe pesticide regulators are investigating potentially widespread tree deaths across the north west this comes after chemicals sprayed around the highway that Fifteen hundred large pine than a national forest into a death spiral the incident was linked to herbicides manufactured by teapot and they're\nNow those products are banned in Oregon for six months but they're still approved by federal regulators at the environmental protection agency nearly a decade ago the EPA pressure dupont it stopped selling a product with the same active ingredient people using it for we'd inadvertently killed trees across the northeast and Midwest\nFor NPR News I'm Emily cure attendance Bend Oregon\nA new study finds that some older women may benefit from a periodic intravenous treatment to strengthen their bones that six year study about two thousand women averaging around each Seventy one with moderate bone loss researchers say a fracture was preventive in one out of every Fifteen women who received a drug to treat osteoporosis\nThey say there were no cases of the rare side effect of treatments costing deterioration of the job loan or unusual ... fractures but at the study was not large enough to rule out those risks results are published in the New England Journal of medicine\nOn Asian stock market shares are mixed lower in Hong Kong following mixed trading on Wall street\nI'm she Stevens NPR News in Washington\nTrue those are the United states Mexico Canada agreement will modernizing stabilize other than tributaries\nInclude visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic drugs including St Pete's Dali museum pitcher who collection and the museum of fine arts more er visits saint Pete Clearwater dot com\n[noise]\n\nDing ding ding ding\nDing\nDing and\n[noise]\n[noise]\n\n\nDid I remember my ...\nJanuary I annoy\nAnd then I live in a while you were\nNa ram memory loss and\nJust the loans with a view that\nJust na na na na those you know\nIn your home\nAnd that's what I'm\nKnow we may or may\nWhat they do you\nRemember\nView\n\nMe my son and then\n\n\nLearned he learned I W\nAnd then I live in a you know\nMen are male\nThat they are in love with a ...\nAnd ... and Ron oh\nWhat I read that ... London in\nWe are all alone just we have a\nLane and you may\n\nThen and now they're you\nWell in the law that you know\n\nMy mom and then you\nNot be\n\n... Jones drummer easy living out when what\n...\nEasy living out what Houston Person a saxophone that I remember\nThe more I see you came from ... do you know since album brothers under the sun and we began to set with the Peter Mehlman Bernie trio the album haven't been out to not be a cure a ton of on drums the way\nIn the water I'm John Hill you're listening to jazz\nIn just a couple of minutes Ted naturally these great quintet like the music of the audience ... but first Leon at you live in her own music\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\nYeah I'm a really a yellow and vocal and her own to see you for her CD called the three American young they're presenting the feelings that job north central and South America and the recording\n[noise]\n... better\n\n\n\n\nMm\nMm\n\n\nMm\n\n\n\n\nOh\nOh God\nClark Terry trumpet growling away on the Ellington tune East St Louis to loop from the day Bruce an album simply titled homage to Duke with Tom Scott on tenor George go on and on trombone\nBrian Brown Berg was the basis charge Mason the drummer and they grew sitting at the piano ahead of that music from the hoops they can be and who you might remember if you're a steely Dan fan from their album a\nGouge show and the two glamour profession deacon blues reform there the all the horns laying out featured Michael laying at the piano with Paul Humphrey on drums and chalk Burke offer\nOn base starting about ... music from Randy Waldman that the piano and conducting the band from the album unreal that is our double E. L. various motion picture and television themes in this collection weird to my favorite things with Gary Burden on vibes\nDave Carpenter on base\nYou are listening to jazz\nI'm John meal [noise]\n\n\n\n\n", "show_name": "Jazz Time", "year": "2018", "city": "Dalhart", "day": "02"}