{"month": "10", "state": "TX", "station": "KTDH", "content": "The executive producer is Steve Robinson\nMcLaughlin thanks for joining us this is the W. F. empty radio network\n\nWhatever your skill and playing an instrument from student to adult learner exploring music can support your pursuit with more than twelve hundred hours of programming exploring music dot W. F. N. T. dot com gives you access to composers and performers through recordings and illuminating demonstrations of musical techniques than theory\nThat's exploring music dot W. F. N. D. dot com from the W. F. empty radio network\n\nMakes time\nOn the ... next to Michael Barbaro and any brown at the New York times poll constant daily we'll talk about social media and the mid term election that next time on city out some lectures on public radio station Wednesday morning it one central [noise]\n\n\n[noise] this is Ninety One point five Katie XP ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere on line at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find indication to thank them for their support\nFrom NPR News in Washington I'm In ... President Trump is announcing a big departure from his foreign policy team today ... to the U.N Nikki Haley is leaving at the end of the year more from NPR's Michel Calvin appearing with Trump in the oval office ambassador Nikki Haley was made\nMichele column and appearing with Trump in the oval office in Pasadena Nikki Haley was making clear she has no plans to challenge him in twenty twenty she says she's proud of her record in promoting Trump's America First agenda at the un\nNow the United states different countries may not like\nI said that's what they know that if we say we're going to do something we fall when\nFor that in her resignation letter she town to the administration thinks that's in passing top un sanctions on North Korea and an arms embargo in South Sudan she says she also push back at what she called the relentless bias against Israel at the un Michele ... NPR News the state department\nAre you on human rights expert says the case of a missing Saudi journalist to support the Turkish government in a difficult position the UN's David Cay says that's because ... was last seen entering the Saudi consulate in Istanbul\nAnd puts turkey in the position of having to may have diplomatic relations well so conducting a high profile investigation\nUS state department spokeswoman Heather Nauert is among those calling a ... to provide answers\nUnited States it certainly concerned about his whereabouts a senior official at the state department have spoken with Saudi official through diplomatic channels about the matter we called the governments have body Arabia to conduct a thorough ... transparent investigation turkey\nToday says it will search the consulate worker show he was last seen some Turkish sources of should they believe ... critical Saudi policy was killed while inside the mission Saudi Arabia is called those allegations baseless\nAfter hurricane her mean destroyed the northern coast of Florida two years ago hurricane Michael appears about to wreak havoc in the same area as\nA category three storm W. F. tease Tesla ... spoke with a local business and the town of steam happy to see how they're preparing to\nEmployees that good times motel in marina are busting down on the tables chairs and everything else that's movable and the bar area there trucking as much as they can to higher ground to protected from flooding manager Kenny McCauley says she's been through this kind of thing before\nI've not heard about it for myself but for that job\nAnd the hair\nI Want to make sure to come after the her\nShe's hopeful that with the precautions they're taking damage won't be as bad as it was two years ago even if the storm it's worse for NPR News I'm ... and seeing how she Florida\nNewly appointed Supreme Court justice Brett Kavanaugh seems to be wasting little time jumping into his new job do they have to ask questions in the first arguments of the day a case dealing with increased prison sentences on Wall street the Dow closed down fifty six points you're listening to NPR\nMajor U.S coal producer is filing for bankruptcy Westmoreland coal operates seven minds across the U.S would you employ more than Fifteen hundred people in the mountain west news bureau made hedge has more\nWith more than coal company says it isn't laying off anyone or closing any minds right now shortly after announcing the bankruptcy the company's stock plummeted by more than forty percent Peter Morgan senior attorney with the Sierra Club he says the company might try to sell its coal mines\nBut I question whether Westmoreland going to be able to find anyone willing to buy these mines given that their economic model is just inherently flood\nThat model involved owning coal mines that directly supply power plants Westmoreland has struggled as the nation transition towards cheaper and more abundant renewable and natural gas for NPR News I'm ...\nAlphabet Inc says Google is unveiling three new devices as this continues to push its Android operating system as an alternative to others on the market\nFor banks Google is unveiling three new devices that just continues to push the Android operating system as an alternative to others on the market addition to the new pixel smartphone in the company's first tablet computer Google Home is making available new smart speaker with the display\nPixel phones have faced a tough road garnering less than one percent of the global market during the ... first two years of trying to break into the market Google bunch like libel apple is trying to branch into the hardware market in order to have full control of its applications and the ... they generate\nCritical futures prices regain some lost ground oil and the discussion up nine tenths of a percent at Seventy four Ninety four a barrel\nIn New York I'm jak spirit NPR News in Washington\nSupport for NPR comes from NPR stations other contributors to include the public welfare foundation committed to advancing justice an opportunity for people in need more information at public welfare dot org and that John D and Catherine the MacArthur Foundation at ... dot org\n\n\n\n\n\nNa na\nNa\n\nNa\nNa\nAmerica\n\n\n\nFront door and and I do not have been done on and on the gun and\nTo win and it would be\nThe number of becoming a blue moon and the number one number wrong to do that than the minimum number to get to look at the dinner and you know to\nMm\nMm Mm Mm no\n\n\nNo\nNo\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n\nUm [noise]\n\n[noise]\n[noise] [noise]\n\n\nThat tune was funky that is the title of the two from the album funky for saxophonist gene Amad are farmer on trumpet Alto saxophonist Jackie McLean pianist mouth all during the guitarist and composer Kenny Burrell\nBassist Doug Watkins and drummer art Taylor\nBefore that we heard from car in Alice in her album called some of that and shot the two right here right now we're ... Sprague piano Chris ... what's the organist just Johnson the bassist guitarist Ron fleeting\nDrummer drum Jennings along with special guest saxophonist Houston Person and we began that set with the end it's Bob James\n... Bob James trio from the album espresso the tune was Mr magic with Billy kill ... drums and Michael\nPollan's mhm Michael Pollan's Zillow ... base okay\nI'm John Hill and we're listening to jazz\nTrumpet of at the end of Charles from the album folklore pop up a lot\n\n[noise]\n[noise]\n[noise]\n\n[noise] Mm\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n... ... ... ... pen than\nBeing a company now has the ... ... ... and then the then suddenly handling them from you who left the ban\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\nReally in\n\nBurn\n[noise]\nPer ... per\nPer se [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\nHe was from Mr magic himself Groberg Washington junior with S. dot the or in summer piano solo by Hank Jones the cello George mirage and the drummer Billy heart\nA bit of a a Portuguese sat here because ahead of it that he caught or jazz waltz written by the pianist and composer Antonio adults all\nJoined by the big band orchestra at ... on an album titled in control or musical gathering or musical gatherings\nAnd cultural Antonio doubtful and or case struck at lunch\nAnd we began to set with drummer\nAccurate ton of his album is called jazz and over and we heard I was ... Marco or the water's march it is said that it's the only two Antonio Carlos ... originally composed using English\nAnd they stood on its head and did the Portuguese version which was very nice Claudio our morale and quality up the eight or the vocalists with the trumpet of Arturo ... keyboard is Peter ...\nRicardo ... on guitar Jerry Brown on bass percussionist Michael Spiro of course the drummer and band leader a carrot top from jazz or no we're listening to Jack I'm John Hill\nDon't you know\n\n\n\n\nThis is John Hill and you're listening to jazz time on listener supported high plains public radio in touch with the world at home on the high plane\n\nSupport for H. P. P. R. comes from Tuscaloosa oft machines in Amarillo serving the area since Nineteen Seventy eight with sticks locations in western Texas in eastern New Mexico more information online at ... office machines dot com\nDonate your older vehicle and purchased that new variety you've been ... for a while now H. P. P. R. except the vehicle donations in all shapes sizes and conditions get started today at H. P. P. R. dot org under vehicle donations\n[noise] this is Ninety One point five Katie ... eighty nine point three Katie de ...\nUh service the high plains public radio available everywhere on line at H. P. P. R.\nPoint three ... service of high plains public radio available everywhere on line at H. P. P. R. dot org the cost of operating\nH. P. P. ours Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nLive from NPR News in Washington on trial Snyder hurricane Michael is strengthening in the Gulf of Mexico and NPR's Debbie Elliott reports on a path to make landfall in the Florida Panhandle tomorrow as a major hurricane\nFlorida governor Rick Scott says the biggest threat from hurricane Michael storm surge that's predicted to be eight to twelve feet high along the wide stretch of Florida it's coast east of the storm's path\nThinking about this way this storm hits near Panama City the temporary was still see life threatening storm surge you cannot hide from storm surge so get prepared and get out if an evacuation has ordered\nCultural evacuations are under way from the Alabama Florida State line to Florida is Big Bend area National Guard troops have been deployed to help with the response and the coast guard has closed all of the port in the path of hurricane Michael Debbie Elliott NPR News forecasters\nAt the national Hurricane Center in Miami expect Michael to being near category for strength when it makes landfall latest word from the hurricane center puts a storm about two hundred miles southeast southwest of Appalachia cola Florida\nIs currently packing top winds of one hundred twenty five miles per hour President Trump has Claritin emergency for the entire state\nA surprise announcement from the White House today about the United nations ambassador Nikki Haley she's planning to resign NPR's Scott Horsley reports of Haley relief or opposed as one of the nation's top diplomat at the end of the year\nHaley offered no explanation for the timing of her departure which caught many observers off guard the former South Carolina Governor suggested she simply worn out by the often combative diplomacy at the un joking that she wears body armor on the job President Trump praised Haley is an effective advocate for his America First agenda\nWe've just had a lot of many other friends who also and I think the world as Nicki says the world is really respecting the United states much more so they haven't they haven't many many decades\nIn fact international surveys but if you Research Center showed that attitude towards the U.S and its president have sharply declined in most countries since Trump took office Scott Horsley NPR News the White House\nSecretary of state Mike Pompeo was praising ambassador Haley\nTo put a great partner mine for them now five months and I had been working together [noise] uh and I want to wish her very well whatever comes back for\nPresident Trump says he will name a successor and the next two or three weeks he told reporters on his way to Iowa though there are five people in his short list including former White House advisor Dina pow\nOn Twitter today evil uncle Trump shot down the possibility of replacing Haley after her father suggested that he would consider her but acknowledge that they would be accused of nepotism federal law prohibits hiring relatives had an executive agency\nFrom Washington this is NPR News\nPresident Trump is celebrating the swearing in of the Supreme Court justice Brett Kavanaugh\nStar for America [noise]\n\nI'm Talking about why\n[noise]\nYou can about why\n[noise]\nPresident Trump speaking earlier tonight at his campaign rally in Council Bluffs Iowa again calling Democrats attempt to block Brett Kavanaugh a national embarrassment he did not mention the sexual assault allegations capital joined the eight other justices on the bench for the first time today following a bruising confirmation fight\nThe national trust for historic preservation of St John Coltrane Long Island home a national treasure\nNPR's Andrew Limbong reports the group hopes to preserve inner revitalize the house\nJohn Coltrane do know is one of his greatest were lifted ... in the upstairs bedroom\nHis wife Alice Coltrane recorded her own jazz records and the base [noise]\nThat is currently bacon to end in disrepair but ... the director of the action fund at the national trust for historic preservation that do work with the local neighborhood to raise money to restore the house\nAnd they use that to inspire the next generation of artists to follow in the footsteps of the coach right\nWell good according to plan leg says the house will be open to the public in two years into Limbong NPR News and on trial Snyder in Washington\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's work in food health power jobs and resilient cities at rock found dot org and Americans for the arts\n[noise]\n\nNation\n\nReason or\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\nGuitarist Dave striker been banned from his album strike and head that's Charlie Parker is to Donald league with Steve Nelson on vibes Jared Gold it was the Oregon is down ... when the hunter the drummer Dave Brubeck gave us blue Rondo a la Turk\nFrom the time out album with Paul Desmond on sex Eugene right on base and Joe Murillo on drums\nAnd we started off with the tonight dreamer Wayne Shorter composition from drummer Dave Potter is album called you already know Jason Marcellus on vibes Austin Johnson the piano will go on base\nI'm John Hill and this is jazz\nOctober isn't important fundraising meant for high plains public radio because it's the first month of H. P. P. R. fiscal year and sets the tone for the rest of the year support your public radio station today by visiting H. P. P. R. dot org\n[noise] smartphones smart speakers smart watches what's next to Sandra Tsing Loh with building down on science saying smart walls was or the campus of a real showcasing beautiful paintings and crayon drawings\nThe creative minds at Carnegie Mellon and Disney Research we're bored with regular dumb walls so they turn them into smart wells\nYour smart phone knows where your finger is by using special sensors these sensors detect the electrical charge that is naturally present on your skin\nThe researchers found that they could paint these sensors onto surfaces they tested different paint materials censor connections and painting methods their final formulation is based on water and nickel and uses ... for the connections\nThe painted walls could track users touch and detect electrical devices next step a room sized pad\nBetter yet no fancy skills or equipment required for installation all you need to know how to paint a wall\nEventually we can say good bye to boring white walls and had no just smart sensing well now if I could paint on more power outlets\n[noise] the lowdown on science is produced by LDL with Media Lab in partnership with the University of California Irvine science communication and eighty nine point three K PCC on the Web L O ... O W n\nPartnership with the University of California Irvine science communication at any point three tape PCC on the Web but eh low wage deal WN Australians dot org more\nSupport comes from Amarillo symphony presenting concerto an F ... by roast conducting and featuring Konrad towel on piano October nineteenth and twenty seven thirty PM at the globe new center Amarillo symphony dot org\n[noise]\nNo\nNo no\n\n...\n\n\n\n\nAnother man and I'm going to\nShe been married\nTime on one\nTown in\nOh\n\nOoh [noise]\n\n\nFocus Helen Merrill from the album clear out of this world with\nCallaway on piano red Mitchell on base and drummer Jerry Clark what's interesting is love and from an album titled acoustic masters body of water which saxophone is Charles Lloyd\nPianist cedar Walton basis buster Williams a drummer Billy and it gets to Clint ... a pseudo Walton composition beginning that you're listening to jazz I'm John Hill [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\nOn on base along with the Latin jazz all stars\nBig band we've again with abortion even a few drinks Shirley Horn ... tar bassist Ron Carter drummer drummer Harvey Mason and Alex recruiting ya on percussion that recorded in Sao paolo Brazil\nAround Nineteen Ninety three and a celebration of the music of Antonio Carlos\n... beam and in addition to Shirley Horn there was Joe hinder sin Gonzalo ... cover\nJon Hendricks go Costa all under the direction of pianist and music director Herbie Hancock Antonio Carlos ... and friends\n[noise]\n\nSupport comes from Fort Hayes State University encore series announcing Russian string orchestra under the direction amnesia ... on Tuesday October thirtieth ... H. S. U. dot edu slash encore\nHi I'm Jonathan Baker a news curator here at H. P. P. R. and we take so much pride and bringing you news stories that you can't find anywhere else but we can't do it without your help go H. P. P. R. dot org today to pledge your support\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da Silva serve high plains public radio available everywhere on line at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\nLive from NPR News in Washington on child Snyder\nHurricane Michael is getting stronger the latest word from the national Hurricane Center in Miami puts Michael's top wins that one hundred twenty five miles per hour\nStorm is still a category three hurricane but forecasters expect Michael to wrap up to a major category ... storm before it makes landfall tomorrow along Florida's Gulf Coast\nKyle gas it of Troy public radio reports on the preparations of people in the past the storm are being advised to make\nThe national weather service in Tallahassee is warning residents in Florida's panhandle and those in southern Alabama and Georgia that hurricane Michael we'll pose an extreme wind threat when it comes to shore although the areas of highest concern are largely along Florida's Gulf Coast\nThe possibility of catastrophic storms and flooding in Alabama prompted governor Kay Ivey to issue a state of emergency on Monday\nSome of the storm preparations that officials are recommending include filling up the cars gas tank securing any medications and packing clean clothes and portable chargers for cell phones for NPR News I'm Kyle gas it in Troy, Alabama\nUnited Nations ambassador Nikki Haley is stepping down\nIt is then and honor and I I you know I said\nThat I won't leave this day and I can't say I\nRarely made her announcement that she will step down at the end of the year at the White House Tuesday alongside President Trump many did\nInclude filling up the carts gas tank securing any medications and packing clean clothes and portable chargers for cell phones for NPR News I'm Kyle gossip in Troy, Alabama\nUnited Nations ambassador Nikki Haley is stepping down\nAnd honor and all I Know I had\nI won't leave this day and I\nRarely made her announcement that she will step down at the end of the year at the White House Tuesday alongside President Trump many did not see Haley's announcement coming or fellow ambassadors at the un reacting with surprise\nPresident Trump says there are five people on his short list including former White House advisor Dina Powell President Trump toyed with the idea of naming his daughter he volunteered to Haley's ... book knowledge that he will be accused of nepotism\nPresident Trump hoping to capitalize on the confirmation of ... students Supreme Court nominee to energize Republicans in the upcoming midterm elections he appeared in Iowa earlier tonight\nAnd NPR's Scott Horsley reports Trump is highlighting the fight over justice Brett Kavanaugh in a series of campaign rallies around the country this week\nAs justice Kavanaugh gets down to work on the court promising to be a good team player President Trump is fanning the partisan flames at\nA campaign rally in Iowa Trump thanked home state Senator Chuck Grassley and his fellow Republicans for helping to see his second Supreme Court pick\nJustice alongside of justice Gorsuch\n[noise]\nThe bitter confirmation battle over capital has the potential to drive turnout on both sides Trump is cheering on his supporters this week with additional rallies in Pennsylvania Ohio and Kentucky\nScott Horsley NPR News Washington and you're listening to NPR News\nThe Boston Red Sox are going to the American league championship series bones to beat the New York Yankees tonight winning the division series\nAnd the right to play the Houston Astros for the American league pennant the first African American football player drafted into the NFL has died Georgetown Farrell was drafted by the Chicago Bears in Nineteen forty nine he died late Monday at the age of Ninety One as NPR's Tom Goldman reports\nGeorge tell a pharaoh was a star running back for Indiana University in the Nineteen forties Chicago took tell a pharaoh in the Nineteen forty nine draft\nBut he'd already agreed to play in the rival all America football conference after that he played six years in the NFL in was named to the pro bowl three times\nTell affair and said the thing you'd like most about football was hitting people because it let them vent his frustration about discrimination he told the Indy star than in Nineteen forty seven he went to a segregated movie theater in Bloomington\nAnd took down the colored sign in the balcony\nAnd I took a screwdriver with me and took this side and put it in my pocket and I've had it ever\nBeyond football tele pharaoh taught and worked in the administration at several universities Tom Goldman NPR News\nCrews and west Texas still searching for for people who remain missing after flooding their authorities say swift water boats are patrolling a thirty five mile stretch of the south down a river which we had rising Sunday night because of more than a foot of rain that fell early Monday the floodwaters over in a recreational vehicle park\nAsian chair steady after us financial markets into Tuesday trading nearly where they began the Dow closed\nDown fifty six points this is NPR News\nFor NPR comes from NPR stations other contributors include the joys foundation committed to advancing racial equity and economic mobility for the next generation and the great\nSo where do you say swift water boats are patrolling a thirty five mile stretch of the ... river which we had rising Sunday night because of more than a foot of rain that fell early Monday the flood water so for me in recreational vehicle park\nAsian chair steady after us financial markets into Tuesday trading nearly where they began to doubt closed down fifty six points this is NPR News\nSupport for NPR coverage from NPR stations other contributors include the Joyce Foundation committed to advancing racial equity and economic mobility for the next generation and the great lakes region learn more at Joyce SBN dot org Andy any EKG foundation\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\nTo\n...\nBack\n\n\nThat on\n\n\n\n\nTo ... to\nThe\n\n\n\nUh\n[noise]\nAnd moved\n\n[noise]\n[noise]\n\n\n[noise]\n\n\nThe tune looks cool one from an album by clerk Perry and max Roach on trumpet and drums respectively the album called friendship\nDoing that alone is monk tune with the un is done treatment and bassist Marcus McLaurin New York voices did in a mellow tone\nPeter Eldridge Loren cannon diamond meter and Ken as Oregon along with Andy has run at the piano bassist Paul ... ski and drummer Marcello ... Terry along with John Bucky pits rally on guitar\nComes from their album seeing seeing seeing and it was pianist daddy for years and her trio from an album called loving Hank it's a tribute to the pianist Hank Jones Peter ... on bass and David rookie dj on drums how about you\nI'm John Hill and if you are listening to jazz from the album Red Square blue jazz impressions are rushing composers featuring pianist Fred Kurdish cellist Eric Friedlander\nAnd food is James ... which is ... years on Dr from country to do for a Cold War to\nThey sent David rookie edge on drums how about you I'm John Jill and you're listening to jazz from the little Red Square blue jazz impressions are rushing composers who drink pianist Fred Kurdish cellist Eric Friedlander\nAnd food is James ... this is ... years on Dr from ... to\n\n[noise]\n\n[noise]\n\n\n\n\nSo\n[noise]\nI don't know if you don't know\nA bird\nBut I Do know that that would be\nState of\nAbout\nHome\nAnd the first person ever to look at the broad therapy da\nDa da da da da da da and\n...\nBit\n\n[noise] ... [noise]\n\n\n\nFantasy and the Trump guitarist Larry Corey out all the album cedars of Avalon that is the seat of Walton two seater at the piano\nBuster Williams on base and Billy drumming on drugs we started with Gerald Beckett food is Gerald back at his album oblivious to tune out of this world Ruben self feeder on sax Steven the quarry on keys\nBasis Charles Thomas\nOoh\nThat is he in the Trump guitarist Larry Korea opium cedars of Avalon that's a seat or Walton two seater at the piano buster Williams on base and Billy drumming on drugs we started with Gerald Beckett food is Gerald back at his album\nOblivious to tune out of this world Ruben socio on sax Steven quarry on keys basis Charles Thomas and drummer Greg German\nOn John Hill you're listening to jazz [noise]\n\nThe main\nLast\nMay name\nShowing me [noise]\nYou see me me me\nNah\n\n\n\n\nSchool\n\nAnd it's taken\nMe\nOf the\nMain\n[noise]\n\n\nMhm Mm\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\nHe he\nNamed ...\n", "show_name": "Jazz Time", "year": "2018", "city": "Dalhart", "day": "10"}