{"month": "10", "state": "TX", "station": "KTDH", "content": "Additional funding is provided by Mr Mrs Williams ... brown girl Shapiro remembers WFL the fine arts circle\nThe executive producers be Robin\nThis is a W F empty radio that were [noise]\n\nAs Benjamin Franklin once said and investment in knowledge pays the best interest\nExploring music is dedicated to giving listeners and music students of all ages a deeper enjoyment of music if you work at a music school or conservatory and are looking to connect your message to listeners of this station right us at exploring music at W. F. M. T. dot com\n[noise] this is the ws empty radio network\n[noise]\nHi this is Mike fuller joined me a Saturday nights at seven central for what the whole two hours of music from all kinds of genres rock 'n pop and blues in world in reggae and bluegrass\nYou never know what you're going to hear [noise] all tied together by single see that's what the folk Saturday nights at seven central right here on high plains public radio [noise]\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da da Silva plains public radio available everywhere at H. P. P. R. dot org\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nFrom NPR News in Washington I'm ... beer president Donald Trump at a campaign rally in Wisconsin denied again address the issue it looks closely of devices that be the mail to some democratic politicians and the CNN in New York the president earlier today\nExplosive devices ... the the mail to some democratic politicians and the CNN in New York the president earlier today saying it was a despicable act in a major investigation is underway he also said all sides must be more civil Trump said that also includes the media which you often disparage is\nPart of a larger national effort to bridge divides and bring people together\nThe media also has a responsibility to set a civil and stop the endless hostility and constant negative and oftentimes false attacks and stores have to do\nThe best to get as are looking at least seven packages sent a former president bronco Obama Hillary Clinton investor George Soros Debbie Wasserman Schultz Maxine Waters and former CIA director John Brennan among others none of the packages exploded CNN was evacuated for time today\nCongressional investigators say immigration and health officials were blindsided by the Trump administration's zero tolerance policy for migrants crossing the southwest border NPR's Joel Rose reports that's the finding of a report released today by the government Accountability Office\nThe jail report says officials at the department of homeland security and health and Human Services did not plan for an increase in the number of children separated from their parents at the border\nOfficials a da chats and HGH has told investigators they did not know in advance that attorney general Jeff Sessions plan to begin prosecuting everyone crossing the border illegally until he announced the policy publicly\nAt zero tolerance policy costs thousands of children to be separated from their parents more than twenty five hundred children ended up and government sponsored shelters before President Trump was forced to abandon the family separation policy under intense political pressure\nAnd a federal judge ordered the families to be reunited Joel Rose NPR News New York\nExxon Mobil suing the New York attorney general alleging the energy giant uh fronted shareholders by mistake and the rest of the company of greenhouse gas emissions NPR's Wade Goodwyn reports\nThe legal action is the result of a four year investigation by attorneys general first in New York and then other states into whether Exxon Mobil engaged in a long running fraudulent scheme what was the alleged game\nEssentially the company claim that the cost of combating carbon emissions would be so high that no meaningful government restrictions could or would ever be implemented therefore investors didn't have anything to worry about and the company could pull as much oil out of the ground as it could procure\nExxon called the legal action against that ... lesson tainted blaming Al Gore Democrats and environmental is Wade Goodwyn NPR News Dallas\nOn Wall street the Dow dropped six hundred and eight points today you're listening to NPR News from Washington was chemical safety board says docked in factories poses a serious danger to workers as NPR's Rebecca Hersher reports dozens of people have died in dust explosions over the past decade\nThis isn't normal household dust it's dangerous that combustible dust like the tiny pieces of wood released by paper mills or the tiny particles that float away when you grind flower or corn meal at an industrial scale if there's too much combustible dust in the air at a factory it can explode\nAnd that's a hazard for workers according to the chemical safety board fifty nine people have died in death explosion since two thousand six more than three hundred had been injured the explosions mostly happened in food processing and wouldn't metal manufacturing facility is\nThe agency says companies and federal regulators need to take death control more seriously Rebecca Hersher NPR News\nAuto makers including General Motors Tesla and Ford faltered somewhat in this year's Consumer Reports reliability rank\nHer shirt and fearing it auto makers including General Motors test and Ford faltered somewhat in this year's Consumer Reports reliability rankings magazine website blaming the decline in such ratings amongst the number of the major vehicle makers on mechanical problems and other issues\nGoing to be anti war liability report all us branch fell to the bottom half of the twenty ninth brand rankings Japanese companies Lexus and Toyota getting topped the list Martha ... infinity Audi BMW miniature ... round it off the top ten\nBrutal futures prices gain some ground rebounding slightly from a two month Luo was thirty nine cents a barrel today ending the session at sixty six eighty to a barrel on the New York mercantile exchange I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors includes the air and about a Brewing Company\nFamily owned operated and argued over since Nineteen eighty crowd supporter of independent thought whether that's on line over the air or in a bottle more at the ... dot com and\nAnd and\n\n\n\n[noise]\nLa\nThen did they\nAbout that\n[noise] [noise]\nDo you\nKnow then I show\nNeed the\n\nWe\n\nHave\nHim in the\nGet over\n\n[noise]\nVocalist Renee\nMarie ... album vertigo I think this was the first one that was moving away with Chris ... saxophone\nAnd Robert hurt ... what is the basis drummer Geoff paint lots and Miller brewery Miller Seattle we heard in his Aaron Goldberg just ahead of it doing a body hunters and composition titled isn't this might sound around me\nRobert H ...\nI'll be hedging Matt ... was the basis and Leon Parker the drummer and percussion is for Aaron Goldberg and beginning of that set Gabriel mark hassled back from example mid century modern\nRaleigh won the to Mississippi jump\nWith miles blackout the piano Lawrence Mahler was the basis and the drummer Joel founded and a couple of guests start it's a really watch and Corey we sons sex is\nGabriel mark hassle back on John Hill where you're listening to jazz\n\nFrom the sound track from the motion picture Glenn Gary Glen Ross here it's music featuring saxophonist Wayne Shorter\nTitled the wife [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\nThey swear dream job or\nYou know\nYou know in a\n\nWay to uh\nSaw\n...\n...\n\n\nIt in on every day to\nGo through our every the word and drink from the every day\nAnd\nA\n\n[noise]\nWay I Am\n\nVocalist Kurt LA and his unique interpretation of the two never never land\nFrom the album close your eyes which started it all was quite impressive\nFirst effort with theaters Lawrence how good acoustic basis Eric Hochberg and Rob hamster on electric bass on that particular tune with Paul where'd you go on drums\n... LA for the debut release in the long haired days ponytail not man but he wasn't crazy\nBefore Kurt weird music from Texas a list Don bread and the album is called earth wind and wonder [noise]\nA a celebration you might say up the music of earth wind and fire and Stevie Wonder was Stevie Wonder tune I Can't help it with Don breathing on sleep the pianist was Brandon acute basis joyous TV and the drummer\nSeasonal Brooks this or maybe we could get the set with pianist Kenny Baron squint at\nThe album concentric circles and a tune a killing spree of all I should say which makes absolutely no sense seriously because ... is a South American rhythm and so as I should say and the ... that just that so that ... know\nNext time kit tunnel but most of it was in town I'll have to ask about that one can bearing quintet includes basis to P. O. she could have got a drummer Jonathan Blake Mike Rodriguez on trumpet and Dana Stevens was the saxophone\nWe're listening to jazz on your host Jon Hill ...\n[noise]\n[noise]\n[noise]\nSupport comes from panhandle planes historical museum bringing murder and mayhem a murder mystery dinner November second third seven to nine PM in the dairy ... tickets at panhandle planes dot org well H. P. P.\nCelebrating all of the contributing members who reached out we support over the past month there's still a ways to go to meet the cool things to a gym membership match from Amarillo your contribution is\nThe contributing members who reached out we support over the past month there's still a ways to go to me the cool things to a generous membership match from Amarillo your contribution is waiting to be doubled at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to age ... PR to volunteer just email us at H. PBR at H. P. P. R. dot org\nLive from NPR News in Washington I'm ... Evans the FBI is providing new details about what is called potentially destructive devices center various high profile Democrat and a cable news network NPR's barbers prompt has the latest\nThe FBI described five suspicious packages that were address two leading Democrats all large manila envelopes with the same return address Congresswoman Debbie Wasserman Schultz his office in Florida\nThe targets former president Brock Obama former CIA director John Brennan by way of the CNN office in New York George Soros a frequent contributor to democratic confidence Hillary Clinton and former attorney general Eric Holder\nThe FBI sent the packages are being sent to its laboratory in Quantico, Virginia for further examination their bureau altered says it's possible that more packages are still out there ... NPR News Washington\nThe FBI has arrested the leader and two other members of a violent white supremacist group based in Southern California NPR strict Siegler has details on the government's case against the so called rise above movement\nAccording to the criminal complaint white power leader Robert run do and three other California men are alleged to have traveled to political rallies in Huntington Beach San Bernardino Berkeley in Charlottesville, Virginia last year where they quote violently attacked and assaulted counterprotesters\nThe leader run do was arrested here after reportedly returning from a trip to Latin America\nThe foreman are charged with conspiracy to riot and riding the FBI says these men publicly promote themselves as being a combat ready militant group that posted videos on social media of assaulting people at rallies usually with their faces covered up with American flag masks\nThey're seen as leaders in the latest white nationalist surge in the U.S since the election of President Trump Kirk Siegler NPR News Los Angeles\nExxon Mobil is dismissing New York's lawsuit against the Texas energy giant as being baseless in ...\nNew York's attorney general Barbara Underwood says Exxon Mobil misled investors about the risks that climate change poses to its operations she says Exxon used inaccurate information to court investors such as the state's public pension funds\nAnd other bottled today on Wall street with the latest turn to sell all sending all three of us stock indices down two percent or more million swamped is chief economist at grant Thornton in Chicago she says one reason many investors are so rattled this time is that the direction of stock market is so unpredictable\nUnfortunately the complacency ... market wasn't the norm the volatility we're seeing today is more than ... and you know the audience never as pretty as what we like it to be\nA combination of disappointing earnings higher interest rates on a slow down housing or all weighing on stock\nMarkets you're listening to NPR News federal health\nRegulators have approved the first new flu drug in two decades the Roche groups genetics unit\nFederal health\nRegulators have approved the first new flu drug in two decades the roost groups genetics unit markets the drug do flus as a pill that can produce flu symptoms after a single dose\nJeanette intact plans to launch so flu so within a few weeks it'll cost a hundred and fifty dollars without insurance there are cheaper version of roaches older flew drove ...\nDemocrats have aggressively attacks Republicans as midterm campaign season for trying to repeal Obamacare as election day approaches NPR's Danielle Kurtzleben reports that Republicans are fighting back more than half\nOf pro democratic TV ads in the home stretch to election day have mentioned health care compared to around one third of pro Republican ads according to the Wesleyan Media project that's a big change from twenty ten and twenty fourteen when Republicans slammed Obamacare and Democrats barely touched the topic\nNow Republicans have ramped up their own messaging in a recent crop of ads GOP candidates promised to protect people with preexisting conditions however experts say the Republican Obamacare repeal do would likely have made insurance prohibitively expensive for some sick Americans Danielle Kurtzleben NPR News\nThe Federal Communications commission will soon allow us devices to access the European global navigation satellite system known as Galileo German a jeep ... doing though should make us GPS system more precise and reliable for us consumers the FCC is set to vote on the matter next month\nI'm shape Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the state of Joan ... who's ... served as an during investment in the future of public radio and seek to help NPR be the model for high quality journalism and the twenty first century and the listeners who support this NPR station\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nYeah Danny grits I Will remember the name of it too weird a friend in the ... dream Dana Steven Sean socks and shoot the archer what basis that drummer bill ...\nThe name of it as soon as we heard a friend or indeed your dream Dana Stevens on sex Vincent the archer was basis then drummer\nBill Stewart before that the Knesset Ruben from her album I'm Glad there is you attribute to carbon McCray with yard bird sweet those lyrics written by Eddie Jefferson\nCarlos McKinney on a piano Ontario heart was saxophonist with your on Israel on drums and bases Charles ... we began to set with the lighthouse all stars\nFrom the album jazz invention but tuna was topsy Bob Cooper on dinner bud shrank on Alto coffee can do it with the trumpeter\nBob ... on bell trombone with all the Williamson that the piano bassist monitor ... and John Gehring on drums\nI'm John Hill you're listening to jazz\nIt's only so generous and ongoing support that public radio exists on the high plains with a one hundred thousand dollar goal for this month your membership is critical help build community one contribution at a time at H. P. P. I. dot org\n[noise] have you ever met a shark who's a vegetarian [noise] this is Sandra Tsing Loh with the ... down on science okay so maybe not a strict vegetarian but there is a shock to each Morsi graft and fish\nIt's the bonnet had shark a small relative of hammer heads Samantha Lee and her colleagues at the University of California Irvine are studying it's bizarre feeding habits\nThey took bonnet sharks into the lab and set them almost exclusively sea grass it turns out that bond that has had the enzymes or digestive juices specifically for breaking down the glass\nIn fact they digest the nutrients in the grass is on par with sea turtles square known on the board and sometimes even ...\nWhy is this news making waves sharks impact ecosystems that we depend on for food and economic resources since this shark each veggies shouldn't be considered a top predator in food Web models\nInstead it may play an important role in transporting nutrients throughout the ecosystem understanding how will help us conserve though see grass meadows through management and habitat conservation I guess bonnet has really just the ... fish are friends not do how [noise]\nThe lowdown on science is produced by LDL west media labs in partnership with the University of California Irvine science communications and eighty nine point three shaping the seat on the Web at low wage D O W N on science title [noise]\nSupport for high plains public radio comes from member listeners and marched in engineering incorporated consulting petroleum engineers of own that's Kansas\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\nA\n\n[noise]\nWell\nSaxophonist Jimmy from is little man big band album is to Ellington this stray heart where this rolling hand out yeah I Know Tony Peron a guitar been brown on\nBass Lewis Nash was the drummer and an outstanding orange section\nPianist Cyrus just started the south from his album there's a sweet sweet spirit with bassist buster Williams that drummer Lenny White you heard the vibes that Steve Nelson featured\nOn the tune easy living\nI'm John Hill you're listening to jazz Mm\nNew ... new\nShoes for ... light blue\nOr the ... you know you know\nYou\nWatch the news of the ... the\nCrude we\nKnew the ... ... ... ...\nThe new [noise] without you\nKnow\nIt's ... ... ...\n... ... ... ... ... [noise] [noise]\nOh\nOh [noise]\n\nNew a\nPair of raised a\nAh\nBig a\nBall to change the\nAuthors and a story and [noise]\nStudent or\nSo slow\nWave your ...\nOr ...\nA\nLong enough to be in ... [noise]\nWon't you say in\nA driver\nWas with me\nThis one out\nYou're\nWhile I can say its own wager here is ... ...\nThat is a\n...\nSeconds nah\nMan or a\nAnd the [noise]\n[noise] [noise] [noise] [noise]\n\n... Mm\n\n...\n... ... ... oh\nOr they'll do these were wager is you know what's the use of the ... but wrote three Jim ... who\nAre they eating the\nBlowout in the ... where are you\n[noise] it's not the [noise]\nYou may never\nYou've never comedy show in the evening [noise] don't do what they use ...\nWould they need me the ball [noise]\nWhere they have three\n[noise]\n[noise]\n\n\n[noise]\n\nDay in the main [noise]\nWhere where they we\n\n\n[noise] you know\n[noise] [noise]\n\n\n[noise] Mm\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\nThis is John Hill and you're listening to jazz time on listener supported high plains public radio\nSupport\nComes from tomato graphics Amarillo with over Thirty years experience in graphic design and innovative marketing ideas served up in a professional and friendly manner tomato graphics dot com\nThanks to all of the number of listeners who have played a part and sustaining the service there still time to show your support things to a membership match from Amarillo, Texas health H. P. P. R. fill the gap and get your dollars doubled at H. P. P. R. dot org\n[noise] this is Ninety One point five ... eighty nine point three Katie da da Silva serve high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to inquire or volunteer just email us at H. P. P. R. at H. P. P. R. dot org or coal eight hundred six seven eight seven four four four\nLines from NPR News in Washington ... Steve and President Trump says there is a major federal investigation into the bomb threats targeting several prominent Democrats\nThis egregious conduct is abhorrent to everything we hold dear and sacred as Americans my administration will provide additional updates as they become available and I just want to thank everybody for their understanding\nWere extremely angry upset unhappy about what we what this this morning and we will get to the bottom of\nPackages containing pipe bomb type explosives were sent to former President Obama and Hillary Clinton among others but known exploded\nOne at the suspicious packages addressed a former CIA director John Brennan was sent to CNN ... building in midtown Manhattan when Hogan of member station WNYC was there at CNN employees spent hours outside their offices while authorities combed the building for explosives\nThey will live on the air when Anchorage had to cut out and evacuate the building outside behind a police barricade CNN staff were rattled but they're reporters kept reporting here's anchor cake Baldwin right after she interviewed New York governor Andrew Cuomo\nSaid day when you don't want to become an area and we all became a little bit of today but I never been more proud of my colleagues and honestly you know it might be they were beyond professional for that but yeah it's scary\nAuthorities say they transport it the explosive which was found in the mail room to a remote area forget nation other pipe bombs were sent to prominent Democrats including George Soros Hillary Clinton and Barack Obama for NPR News I'm Glen Hogan in New York City\nThe Catholic archdiocese in Anchorage, Alaska says it will take a close look at ... sexual abuse within the church Alaska Public media's Abbie columns reports on the steps being taken the church is appointing an independent\nPossible sexual abuse within the church Alaska Public media's Abbie columns reports on the steps being taken\nThe church is appointing an independent commission to review file from the lack of fifty years or ... H ... says the investigation will look into how sexual abuse accusations have been handled we are taking care of business\nAnd we're taking care of victims the three commission members have brought a background in law enforcement and criminal prosecutions ten years ago the Catholic dioceses in Fairbanks, Alaska filed for bankruptcy after paying out millions of dollars and settlements to victims stretching back decades\nAgent says the current review was not prompted by new allegations in Alaska but instead the climate throughout the country and returned to revelations in other states\nThe review is expected to be completed next year\nFor NPR News I'm Abbie Collins in Anchorage\nAnd others Philips and Wall Street stocks tumbling again Wednesday the Dow Jones industrial plunged over six hundred points Asian markets aren't lower at this hour this is NPR News\nThe food and Drug Administration has approved a new medicine to treat the flu NPR's Richard Harris reports that it is not a substitute for getting a flu vaccine to prevent flu\nScientific study shows though flus out is about as effective as other flu drugs on the market including generics this brand name drug it's administered as a single dose to people twelve and older it was developed by a Japanese pharmaceutical company it will be sold by Roche and its American subsidiary Jeanette in tech\nThe drug has unique mechanism of action and it effective against strings of flu that are resistant to a popular flu medication\nJeanette in Texas the drug will be available in a few weeks the wholesale prices a hundred and fifty dollars but genetic says it's offering a coupon that will bring the cost down to as low as thirty dollars for people with health insurance Richard Harris NPR News\nState of Maine plans to use the state's ranks choice voting system for the first time to our next month's midterms the system that allows voters to rank candidates on the ballot and the person with the most first place votes wins\nIf there's no majority winter than the last place candidate is eliminated and vote to re allocated until someone ends up with the most votes\nFederal Communications commission is proposing a sixty three million dollar fine against ... based broad band company that is accused of misusing government money the FCC claims American broadband and telecommunications bona yacht private plane and other luxury items\nWith funds that were meant to help low income people get phone and Internet service\nI'm chase Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the William and Flora Hewlett foundation committed to supporting ideas and institutions to advance education for all preserving environments and promote vibrant performing arts more information is available at ... dot org\n[noise]\n\nMm\n[noise]\n[noise]\n\n[noise]\nYeah I'm\n\nA I'm\nSaying all\nRight let's\nSee Mm\nAh right na na\nNa na\n\nNa\nNa na na na\nNa na\nNa na na na\nNa na na na na\n\nNa\n\nNa na\nThey\nReally um\nReally ...\nThe\n[noise]\n\n[noise]\n\n\n[noise]\n\nWell\n...\nMean\nNo nothing\n\nMan a man\nVery ...\n\n\nDa da da da\nDa na\nNa na\n\n\nWell um\n\n\n\nA little bit of cause and effect lined by Cassandra Wilson along with James Weissman that the piano Kevin Bruce Harris on bass from her album after the beginning of gas bottles rankles that the\nSteep gone ahead of that from his album back log\nBubbles rankles at the\nSteep common ahead of that from his album back log doing that to our turnout with mark Walker on drums Ruben Rodriguez on base\nMark ... Bobby ... de ... percussion Congo bongos and we open that sat with Bill Evans someday my principal come\nFrom the very best to bill Evans is on the burger label any government is on base jak these you're not on drums recorded at the Nineteen sixty eight Montrose jazz festival\nI'm John Hill and you're listening to jazz\nThis is love an author from pianist Henry ... burns album for all\n\n[noise]\n\n[noise]\nShe needed to take\nA call\n\n\nRecord that may or Joe hinders in June before by Alto saxophonist Greg Cosby tenor sax is Mark Shannon five ... Stefan Harris pianist Jason Moran\nWhereas ... Martinez on base and she waits on drugs comes from an album called new directions\nWe heard the under hinged sex due to called don't blink the title track from the album\nBurn sealer on trumpet\nAlto saxophonist will Campbell Matt Olsen on tenor Michael ... at the piano basis John harbor and dome more on drums and we began with the title track from the album moving picture\nFor Trump buttered Tom herrell Danny drifted at the piano gotta okay go base and Adam Cruz was the drummer\nI'm John deal you're listening to jazz [noise]\n\n\n\n[noise] [noise] when the cookie jar instead\nThere were people from the ... job\nAs the other day when they get so close to ... do you do when the cookie jar as they do they do this ourselves\nTo eat to eat and\nThey break ... shows they will be will be pushy or leaders are ...\n... ... ... you're\nSaying that if you miss and read the book you mentioned throws a system that may\nBe in the\nRio as high as I Am really make you do the meat the lover so out of it and the ... the way the cookie jar is Seventy\nAnd they do the ... going to try to\nDo that on\nFirst TBB painting rats\nAnd just do a ... it's so sad to say [noise] repeat the topic I\nGuess but I guess\nWhen you're in\nVery among the size of ... the apes Knoxville for\nInstance I have to be\nVery low as high as ... people in the blood is thicker than she is learning to be the base [noise]", "year": "2018", "show_name": "Jazz Time", "city": "Dalhart", "day": "25"}