{"month": "10", "state": "TX", "station": "KTDH", "content": "\n\n\nSpring music is produced by ... W with ... in Chicago and produced an engineer by bill Sigmund the W ... in New York City [noise] we get production out from do Marcos and digital islands studios\nMakes your support is provided by the early British Shapiro foundation was show district Mrs Williams you brown an anonymous gift and it was through supporters of W F empty\nExploring music was created by Steve Robin I'm\nDo McLachlan and thanks for this thing this is the debate was empty radio network\nH ... is the news and information service at high plains public radio where you'll find programs to bring you diverse perspectives and voices from your region the country and the world\nWe're committed to bringing you information that goes beyond the headlines and gives you a deeper understanding of the issues and have an impact on your life you can find a complete schedule and you can listen to H. P. P. R. connect on line by visiting our website at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da di ... high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to inquire or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or call eight hundred six seven eight seven four four four\nFrom NPR News in Washington I'm ... beer\nSecretary of state Mike Pompeo traveled from Saudi Arabia to turkey as he pushes for a full investigation into the disappearance of a Saudi journalist turkey says ... was killed when he went to the Saudi constantly ... they'll do Saudis denied any knowledge that more ... second\nTurkey says ... was killed when he went to the Saudi constantly is tumble they'll do Saudis denied any knowledge of that or from NPR's Michele Kelemen\nSecretary Tom Perez says he had a candid conversation in Saudi Arabia an end in every one of those meetings that Saudi leadership strongly denied any knowledge of what took place at their country and its Danville\nHave statements that there is a serious commitment you determine all the facts and ensure accountability President Trump spoke by phone with the Saudi crown prince wildlife day over there\nAnd came to the same conclusion writing on Twitter that Mohammed bin Salman totally denied he knew what happened Trump goes further in an interview with the Associated Press saying he sees this as an attempt to declare that Saudi guilty until proven innocent\nMichele Kelemen NPR News Riyadh Democrats have continued\nAnd even strengthen their financial advantage in the fight to control the house of representatives NPR's Peter Overby says the numbers told the story in third quarter reports just filed at the federal election commission\nIn sixty two races that will determine the house majority Democrats have consistently and dramatically outraged Republicans last quarter the Democrats collected a hundred and forty million dollars to Republicans fifty one million\nA couple of specifics outside Austin, Texas Democrat and Jay Hagar raised one point nine million compared to not quite six hundred thousand for a long time Republican incumbent Jon Carter\nSome races are closer than that in Wisconsin district that's been represented by house Speaker Paul Ryan Democrat Randy Bryce pulled in one point four million or Republican Brian style wasn't far behind it just over a million as for the polls the races are generally tighter\nPeter Overby NPR News Washington [noise]\nCuban diplomats and their supporters disrupting a un meeting called by the U.S the spotlight the islands treatment of political prisoners protesters loudly banging tables and shouting and Spanish to be asked us blockade no the\nProtesters rounded out us deputy investor Kelly curry senior tropical distraction officials or the secretary general of the American organization of American states above the noise in the U.S chamber was aware protests by accredited diplomat to have a right to attend any open un meeting\nAlso shows the generation of us Cuban relations under the Trump Administration but when the restoration of ties with the island nation under then president bronco bomber in two thousand Fifteen\nNumber of help wanted ads went up in August Labor Department says job openings rosy tens of percent the seven point one for a million that's more than six point two million people on the unemployment rolls last month\nOn Wall street a strong day the Dow jumped five hundred and forty seven points you're listening to NPR\nOf federal judges approve the settlement between Tesla CEO Elon Musk and securities regulators over his infamous message on Twitter about taking the company private\nThe SEC to argue the message must posted was misleading and harm to investors who bought stock in the electric car company the company letter announced it was not going private the SEC find mosque and the company a total of forty million dollars and sell them and agreement allows him to hold onto a CEO posed but he's given up his seat is company chairman for three years\nAnd NPR News investigation finds women in prison get disciplined more than men for smaller infractions\nHere's NPR's Joseph Shapiro women get punished at higher rates often two to three times higher for those lesser a non violent violations of prison rules for things like in someone's disrespect for cursing or disobeying an officer\nNPR in the ... school of journalism at Northwestern university analyzed data from Fifteen states and found punishments even for small infraction can have big consequences women go to solitary confinement they lose good comic credits that would reduce time\nEven for small infraction can a big consequences women go to solitary confinement they lose good comic credits that would reduce time in prison and they lose phoning visitation privileges that cuts off mother's from children more than half of women in prison or the mothers of children under the age of Eighteen\nJoseph Shapiro NPR News you attach daughters survive last week's failed launch an emergency landing after problems with the Soviet liftoff does he knew we needed\nTo remain calm us air force colonel make Hagen she'll be cosmonauts were on their way to the international space station will show years rocket failed their capital ripped away and that's designed plummeted earth both men are okay I'm jak spirit NPR News in Washington\nSupport for NPR coverage from NPR stations other contributors include life lock lifelike with Norton works to help protect identities and the information on devices from cyber criminals learn more at life locked dot com and the ... foundation at ... dot org\n\n\n\n\n\n\n\n\nHas made for ...\nOh\nYou yeah the the\nYou're drawn to the\n\nMain thing is you're getting the big bang\nWe may\nBe drawn on me\nShe can call so he\n\n\nWhere we\nWell you're going to come back to Joe\nJimmy [noise]\nThat's these are from the Count Basie orchestra stripped down group backing up vocalists Jamie Davis performed with account set for you yesterday Scott Bernard on trumpet he actually directs the latest incarnation of the BBC orchestra\nRicky Woodard another Stacey alone and Freddie Green on shaker\nNot that fray green no it does bear some investigations doesn't oh and the title of the album is all about that\nThey see you wouldn't get there yeah a\nHeaded that was David Sanborn was Saint Louis blues from his album here and gone with drummer Steve Gass Christian McBride on bass guitarist Russell Malone guilt goes the keyboard key on Gerald and loose all off\nSteve Gass Christian McBride on bass guitarist Russell blown guilt goals the keyboard\nKey uh Gerald and lose sold off trumpets special guest trumpeter who took the sold on the track Wallace Romney sooner trombone Mike Davis to intersect Lou marine baritone sax Howard Johnson and bass clarinet Charles pillow\nAnd we began that sat with Yousef ... chief from the album the complete Yousef teach in the evening you loss and not piano you still may be the basis and Roy Brooks are drummer\nI'm John ... and we're listening to jazz\nYou might be able to check him out if you're ever in the windy city at the green mill jazz club his name is John Boulder ... John mulder an album of original compositions titled decade memoirs this tune is called\nAbout us introduction Mm\nMm\n\nMm\nMm\nMm\n\n\n\n\nMm\nMm\nNo no\nNo\n\n\n\n\n\nMm Mm\n\nMm\nMm Mm\nMm\nMm Mm\n\nI propose to Charles Lloyd and the march out plus the Williams at some local to the album vanished garden that was simply defiant\nWith Bill for sale and guitar Greg Lee's pedal steel Ruben Rogers was the basis stand the drummer Eric harlot\nUgly began with a song called time lapse to fall but Danny green trio pluck street one day it will just Danny green along with Justin Grinnell\nDrummer Julian can tell violinist king had ... ... ... ...\nWith the oldest Travis Morrow and chose Erica Erin you\nWere listening to jazz I'm Johnny\n\n\n\n\nOn the\n\nKnees\nWould fall\nOoh\n[noise]\n...\n... to\nWhen\nWhat\nWe know that the\n\n...\n\nMe I\nGood\n\n\nOh\nScreen [noise]\n\n\n\n\n\n\n\n[noise] [noise]\nThrough\nThe\nOh\nBall\n[noise]\n\nMovie\n\n\n\n\n\n\n\n[noise] [noise]\n\n\nThis is John Hill and you're listening to jazz time on listener supported high plains public radio in touch with the world at home on the high plains\n\nSupport comes from a marvelous company presenting concerto an F ... by roast conducting and featuring Conrad towel on piano October Nineteen twenty seven thirty PM at the globe new center Amarillo symphony dot org\n[noise]\nThis is nine of Blakeman from ... Texas\nAnd you're listening to members supported the high plains public radio\n\nThe members supported high plains public radio [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three ... heart a service of high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\nLive from NPR News in Washington I'm neuron President Trump is still standing by members of the Saudi ruling family as they continue to deny knowing anything about the suspected killing of Saudi dissident and legal us residential market ... NPR's Mara Liasson reports\nTrump told Fox News that if the Saudi ruling family knew about what happened to ... that would be bad but he also tweeted that he talked with the crown prince who quote totally denied any knowledge of what took place inside the Saudi consulate in Istanbul\nTrump tweeted that he had no financial interests in Saudi Arabia that may be true but in the past he's boasted about how much Saudi money comes to him in the U.S in twenty Fifteen he said of the Saudis quote they buy apartments for me they spend forty million Fifteen million am I supposed to dislike them I like them very much\nMeanwhile there are bipartisan calls in Congress for sanctions against Saudi Arabia Mara Liasson NPR News the White House\nAbout Ninety percent of all the immigrant children separated from their parents at the border have now been released from us custody but as NPR's John Burnett reports more than two hundred children remain in shelters\nThe office of refugee resettlement that oversees the government's youth shelters reports the two thousand three hundred and sixty three migrant children who were taken from their parents as part of the Trump administration's controversial zero tolerance policy had been released as of Monday\nOf the remaining two hundred and forty five kids still in shelters a majority of them are there because their parents were deported back to Central America\nThe American civil liberties union which successfully sued the government to reunify the family says almost all the parents back in Central America had been contacted to find out if they want to be reunited with their children\nAnd ACLU attorney says two thirds of those deported parents want their kids to remain in the U.S were there'll be safe from criminal gangs and food insecurity in their hometowns John Burnett NPR News\nDoctors at the Centers for Disease Control are tracking a rare disease that affects mainly children it's called a huge flats at my latest and causes partial paralysis knocked or Nancy ... says it's affected more than one hundred people this year\nIn twenty Eighteen so far the CDC has received the port of one hundred and twenty seven patients under investigation or he wise in twenty two state of which sixty two cases have been confirmed as al than\nShe urges parents to seek medical treatment right away if their child develops a sudden weakness or lots of muscle tone and the arms her legs she says she's frustrated doctors have been unable to so far to identify the cause of the elements\nStock closed higher today the Dow is up five hundred and forty seven points jumped over to present the NASDAQ rose almost three percent and the ... he was up more than two percent\nThis is NPR News\nAnalyst say part of the reason for the games on Wall street today was some positive company earnings report NPR's Jasmine Garsd reports on the digital streaming company next\nToday was some positive company earnings report NPR's Jasmine Garsd reports on the digital streaming company Netflix\nNearly seven million people subscribe to Netflix just in the last few months that's according to the company's latest quarterly report it's streaming revenue grew to about four billion dollars\nNetflix shares were up four percent market clues and continue to rise in after hours trading in the report Netflix predicts it will continue to grow for the rest of the year I think nearly ten million more to describe ... in the fourth quarter Johnson the guards NPR News New York\nThe Labor Department reports the job openings in the U.S rose in August to the highest level since it began keeping that statistic in two thousand it says the word seven point one four million open jobs far more than a six point two million people who are looking for work that much\nThat suggests companies are finding it increasingly difficult to find qualified workers\nThe death toll continues to rise six days after hurricane Michael's slammed into the Florida Panhandle officials now say at least twenty six people died in Florida Georgia North Carolina and Virginia tens of thousands of homes and businesses are without power\nCanada is legalizing marijuana starting tomorrow it becomes such a country after you're going to allow the recreational use of the drug it's already tomorrow in Newfoundland so sales are now legal their candidate has authorized the medical use of marijuana and since two thousand one\nI'm neuron NPR News in Washington\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's work in food health power jobs and resilient cities at rock found dot org and Americans for the arts\n[noise]\n\n[noise]\n\n\n\n\nThing I\nCould\nLeave we\nThat'd\nBe\n\nFun when you\nBack\nMean\nDon't even know [noise]\nOkay [laughter]\nMaybe go Dave Lambert Jon Hendricks any Ross Lambert Hendricks and Ross\nDoing come on home or Silver's too with Jon Hendricks lyrics from the album everybody Bob but other than that it was written our\nFrom an album called roots house during the lead Morgan to party time early watts on sex Ellen ... on piano basis the carpenter drummer Peter or skin and Jerry hay on trumpet or the yeah and that set with\nFrom a self titled album\nSaxophonist Josh where it rather than with Kevin Hays at the piano Christian McBride on base and Gregory Hutchinson on drums the two I got you\nOr I feel good better though probably a few good because I got you because I came on home [laughter] and then it was part of the time I'm John Hill you're listening to ...\nHi I'm Jonathan bigger and I hope you find living on the high plains as fascinating and wonderful as I Do if you do any like hearing stories about this unique place we all live in go to each PBR dot org employed your support today\n[noise] next time you're at the pharmacy asked for again this is Sandra Tsing Loh with the lowdown on science teacher Jenna diets are all the rage who doesn't want to eat more begun but slashing carbs and eating lots of fat does more than trim waist lines\nDoctors have noticed for decades that the diet miraculously reduced seizures in children with epilepsy\nBut exactly how or why has remained a mystery now Elaine show and colleagues at the University of California Los Angeles have figured it out\nIt's all in the got hurt teams that ... a key to Jenike diet as expected the mice on the diet had fewer seizures but there was another key change the poop\nGenetic analysis of the mouse coup revealed that completely different baking loving bacteria overtook the got when her team killed off these new bacteria with antibiotics seizures returned\nBut when they transplanted these bacteria you might not on key Joe they also lived a seizure free day the researchers hope that in the future kids with epilepsy can take ... to stay seizure free but they still don't know just how these bacteria are stopping seizures my one son\nThey can take probiotics just stay seizure free but they still don't know just how these bacteria are stopping seizure my one suggestion clips covered baking for science [noise]\nSaloon down on science is produced by LDL west media labs in partnership with the University of California Irvine science communication at any point ... BCC on the Web but eh low wage deal WN on science diet or\nThis is Rafael Rodriguez supportive from age ... our studios in Amarillo your contribution keeps this state you live without you there would be no H. P. P. R. to keep it going to gain knowledge grow community and give now today at H. P. P. R. dot work\n... ... ... ...\n... ... ... ... ah\n[noise]\n[noise] [noise]\n\n[noise]\n\nBe\nShit\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\nMm\n\n\nMm\nMm [noise]\n\n\n[noise]\n\nMm Mm Mm Mm Mm\n\nComposition by high derby Lobos rocky honest broker you this number five from saxophonist Wayne Shorter his album I'll agree with Charles Curtis taking the solo cello out of the cello ensemble\nJohn tighter to chew on base and Alex of Qunu on percussion\nBefore that we heard from ... Stefan Harris from a cloud of red dust album the tune was the profit with Jason Moran at the piano ... Bernal on base Elvis garden that on drums\nBetween Greg ... and Steve Wilson on Alto saxophone which Steve ... playing is called shells and trombone ... watt Nabil on flipped\nWe began to set with Trump or Tom herrell his album moving picture\nThe two was for the moment that's F. O. U. R. the moment Adam crews on drones who've gotten a okay go on base and Danny ... was the pianist you are listening to jazz with John Hill\n\n\nThe very sort of you\nAnd I forget to do\nA little thing that men every one of\nThe\nHappy hour the queen ...\nOkay nice\nTo me that every thing and I'm near idea\nA new\nLaw means here for\nGood you\n\nKnow whether I the only man\nThat I have a lot of you that they're making fun\nThat that is\n[noise] [noise]\nThe very bottom you\nForget games do\nDo they do the new everything every one I did do\nA new\nThey say\nDon't live near blow you\nLong do\n\nThe [noise] Mm\n[noise]\nThey were able\nTo\nGo\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nSupport comes from local authored George a Hopkins the novel one more turning the page set in Nineteen eighty nine Robie Kenya is available on Amazon more at one more turn the page dot com October\nMarks the beginning of H. P. P. R. as the school year in the fall membership campaign you can play your part in keeping the service available in our region by becoming a new member gain knowledge go community gets today at each P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three ... heart of service of high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on error recognition for your support\nLook under the support jab at H. P. P. R. dot org for details\nLive from NPR News in Washington I'm nor rom secretary of state Mike Pompeo traveled from Saudi Arabia to turkey shortly as he pushes for a full investigation into the disappearance of in Saudi journalist\nTurkey says ... she'll go she was killed when he went to the Saudi conflict is double the Saudis denied any knowledge of that NPR's Michele Kelemen has more\nSecretary bumped ... says he had a candid conversation in Saudi Arabia and in every one of those meetings that Saudi leadership strongly denied any knowledge of what took place at their consulate in ... his statement says there's a serious commitment to determine all the facts and ensure accountability\nPresident Trump spoke by phone with the Saudi crown prince wild Bombay over there\nAnd came to the same conclusion writing on Twitter that Mohammed bin Salman totally denied he knew what happened Trump goes further in an interview with the Associated Press saying he sees this as an attempt to declare the Saudis guilty until proven innocent\nMichele ... NPR News Riyadh\nSixteen people are now confirmed dead in Florida in the aftermath of hurricane Michael it was the strongest storm to hit the region and fifty years NPR's Greg Allen reports taller than the Taliban he's earned bay county\nCounty in Florida's panhandle is where hurricane Michael made landfall with a sizable storm surge in one hundred and fifty five miles per hour winds some of the worst destruction is in Mexico beach where search and rescue teams have been combing through thoughts of destroyed homes with ... dogs enlisting gear deaths have been reported in Mexico\nProven innocent Michele ... NPR News Riyadh sixteen people are now confirmed dead in Florida and the aftermath of hurricane Michael it was the strongest storm to hit the region and fifty years NPR's Greg Allen reports taller than the ... are in Bay county\n... county in Florida's panhandle is where hurricane Michael made landfall with a sizable storm surge and one hundred and fifty five miles per hour winds some of the worst destruction is in Mexico beach where search and rescue teams have been combing through thoughts of destroyed homes would help all dogs enlisting gear that's had been reported in Mexico beach it's not clear yet how many\nBefore the emergency operations center says twelve debts and big ... plus one death the ... Gulf county had been confirmed by medical examiner's under state law medical examiner's responsible for confirming and attributing Des occurring and their counties\nDebts from the storm of also been confirmed in Gadsden county ... county there were also deaths from hurricane Michael reported outside of Florida and Virginia Georgia in North Carolina Greg Allen NPR News\nThe chairman of the joint chiefs of staff General Joseph Dunford says that although terrorist attacks have declined in number and severity in recent years the world must not become complacent we know from\nPrevious experience that when you're relieve relieve pressure from the thread so they will take the ability to reconstitute and so the key to success is\nTo continue to provide pressure even if that pressure is a different kind of pressure when the old and as much ground and they're operating in a more decentralized matter that does it really was responsibility to the to relieve pressure\nHis group such as al ... and the Islamic state group are adapting using the Internet to inspire attacks from remote locations\nUkrainian fighter jet crashed in western Ukraine Tuesday military officials say both pilots on board were killed including one from the U.S the jet with taking part in enjoying exercise with us and other NATO air forces this is NPR News\nEuropean Union countries are meeting in luck them burn Wednesday without an agreement on how Britain will leave the block its schedule to depart march twenty ninth\nA major issue is how hard or poor as the Irish border should be a new council president Donald Tusk is urging British prime minister Theresa May to think like a free spirit and come up with something creative to solve the impacts\nIn Nevada brothel owner reality TV star and aspiring politician Dennis Hopper has died NPR's Leila Fadel reports his death came as he was seeking a seat in the state legislature\nHot died at the love French one of his several brothels in Nevada\nThey Seventy two year old twins best known as a showman famous for a late night reality TV show that it's legal prosecution business that used to err on HBO and a recent interview with NPR health described to lay people spoke about him in the most populous town in the district where he was running for state office\nOf the trunk of\nAnd famous he's good news is to you who likes girls\nIn recent months he caused an uproar that got national attention when he beat a three term Republican state lawmaker in local primaries and appeared poised to win a seat in the Nevada state legislature and the father and NPR News Las Vegas\nSome major financial and health care companies they showed strong earnings reports Tuesday that sent stock prices soaring that that was up five hundred and forty seven points just over two percent the NASDAQ was up almost three percent I'm neuron NPR News in Washington\nFor NPR comics for NPR's Beijing other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic drugs including saint Pete\nTo that state legislature and the father NPR News Las Vegas\nSome major financial in health care companies issued strong earnings reports today that sent stock prices soaring but that was up five hundred and forty seven points just over two percent the NASDAQ was up almost three percent I'm neuron NPR News in Washington\nSupport for NPR comments from NPR's Beijing other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum pitcher who collection and the museum of fine arts more at visit saint Pete Clearwater dot com\n[noise]\n\n[noise]\n\nNo we\nLet him go God\n[noise]\n[noise]\n\nYou\nDo that maybe they needed to do that\n\nMm Mm Mm Mm\nMm\nMm [noise]\nDo that\n[noise]\n\n\nI was just not that the piano from his album there's a sweet sweet spirit the tune nerdy buster Williams on base at Lenny White drums\nFor that senior blues from pianist or silver Hank Mobley on tenor sax Donald bird which the trumpeter basis Doug Watkins Ann Lewis hey John drops and we began the set with the trumpet of ... which\nThe album is called all through the night and crystal read is that the song St James infirmary ... at the piano Todd Harris at on drums and Paul entering on base\nI'm John Hill and jazz continue the solo\nGuitar of Stanley Jordan from his upon mislead titled debut relief missions ... [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n\n\nMm Mm Mm Mm Mm Mm Mm Mm\n\n\n\n\n\nAll that other\nNo above blah blah blah blah blah but that are ...\nAre they\nDa da da\nDa da da da da da da\n\nVocalist Corinne Allison from her album ... hey we're a little assistance from Brian Hicks Bernie's Tune or a ... on piano Todd straight drummer Bob Bowman on based any embryo on guitar", "show_name": "Jazz Time", "year": "2018", "city": "Dalhart", "day": "17"}