{"month": "10", "state": "TX", "station": "KTDH", "content": "Or we enjoy this and I hope we give herself another few minutes at least right now to continue listening to the radio 'cause there's more reprogramming coming up right now\n\nExploring music is produced by city killer to W. F. M. T. in Chicago and produced an engineer by bill Sigmund that that'd be a cue acts are in New York City\nWe get production help from ... Marcos and digital islands studios major support is provided by the URL and British Shapiro foundation hello so Mr and Mrs Williams you brown an anonymous gift and they lose their supporters of W F empty\nExploring music was created by Steve Robin and I'm McLachlan and thanks for listening this is the debate with empty radio network\nA\nA\nHere on the high plains we love our live music and that's why H. P. P. I. is living or in concert series brings you inspirational songwriters from across the world which I was in Amarillo Garden City and towns across the high plains joined the mailing list and learn more about living room concert that H. P. P. R. dot org\n[noise]\n... Ninety One point five ... eighty nine point three Katie da da Silva is of high plains public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\nBy from NPR News in Washington I'm jak sphere six days after hurricane Michael hit parts of the Florida Panhandle are still without electricity or drinkable water NPR's Quil Lawrence reports many are still missing after the storm\nOf people are still living in shelters thousands or starting the painstaking process of trying to file insurance\nReports many are still missing after the storm\nHundreds of people are still living in shelters thousands or starting the painstaking process of trying to file insurance claims or hire contractors or get assistance from FEMA\nWhile the search for survivors is over poor phone and Internet service has made it difficult for people to let their loved ones no they're okay in the devastated town of Mexico beach it's still not clear how many of about two hundred people who stayed through the storm might not have survived\nEleven thousand military personnel and their families evacuated from tend to air force base which took a direct hit they're still waiting for permission to get back to their homes on the base Quil Lawrence NPR News Miramar Beach Florida\nThe Trump Administration is planning to acquire a drug companies to include the retail price of their medications in television or other consumer adds more from NPR's Alison Kodjak\nHealth and Human Services secretary Alex ... says he'll require drug makers to include retail prices MTV advertisements for prescription drugs\nPatients deserve to know what a given ... could cost when they're being told about the benefits and risks that may have\nUnder the proposed rules companies will have to disclose the monthly list price of any medication that costs more than thirty five dollars\nThe pharmaceutical industry is already taking steps to preempt the administration's actions\nThe industry group farmer says it's member companies have agreed to include in their ads information about where consumers can look up and medications price but that plan fall short of actually disclosing retail prices Alison Kodjak NPR News Washington\nPaul Allen who cofounded Microsoft with his childhood friend Bill Gates has died out is reported to have died from complications from non Hodgkin's lymphoma in Seattle just weeks after announcing he'd restarted treatment a decade after first battling the disease\nThat would sports fan I don't know the Portland TrailBlazers in the Seattle Seahawks settled times reporter Matt de says he also gave more than two billion dollars to a wide range of philanthropic interests\nThat are real wide range I'm not just a lot of stuff that you felt that it was only ... I'm going to do or he was in a unique position you know goes all the way from you know number of students studying artificial intelligence on the brand 'em to a campaign to count essentially all of the elephant in the wild I'm On the kinds of Africa\nBill Gates in a statement said I'm heartbroken by the passing of what my oldest and dearest friends Paul Allen was sixty five years old\nAppliance maker whirlpool says it expects what is calling a very limited impact with business from Sears decision to file for chapter ... bankruptcy protection there's as close a hundred and forty two unprofitable stores she started as a mail order catalogue and then they were Eighteen eighties and its peak had for thousands Kmart and Sears stores\nOn Wall street the Dow is down eighty nine points this is NPR\nOregon Senator Ron Wyden is blasting a planned under consideration by the Trump Administration these military bases or other federal facilities for fossil fuel exports\nWind says it amounts to trampling on the rights of West coast communities democratic lawmaker understatement today says the federal government should invest in renewable fuels and not try to prop up dirty energy sources like coal\nAnd new study finds teenagers see lots of images of smoking and vaping when they watch hip hop music videos NPR's Allison Aubrey reports a new study finds about half of popular music videos feature marijuana or tobacco use\nResearchers reviewed about eight hundred videos that had been on billboard magazine hot are in the hip hop songs left they found popular videos including hits by artists including drink and beyond that had been you'd almost forty billion times over five year period the use of electronic cigarettes and the videos increased\nI did images of specific brand products at a time when a hip hop is very popular in the U.S especially with teens and young adults\nAnd the videos increased and did images of specific brands of products\nAt a time when the hip hop is very popular in the U. S. and especially with teens and young adults researchers say the widespread appearance of these products may increase tobacco and marijuana use and decrease the perception of harm the study is published in the journal jama internal medicine\nAllison Aubrey NPR News\nPrivate plane operator net jets says it's going to buy up to three hundred and twenty five new sets it sets the jets over the next ten to Fifteen Years that jets in ... and now it's in the long term deal today based in Columbus ohio net jets is owned by Warren Buffett's Berkshire Hathaway company\nThe company sells fractional shares are private jets I'm jak spirit NPR News in Washington\nSupport for NPR comes from NPR station other contributors include abject the foundation of donor advice farms working to maximize the impact of charitable giving and to create customize philanthropic solutions learn more and have J. C. dot org and the N e Casey foundation\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\nThe upper imagine the Bible is Stefan Harris and his band blackout sonic greed is the name of the album the tune from virus Bobby Hutchison titled now we do McDaniel providing some words as sung by Jean Baylor\nJames Francis was defeated that's this is Josh ... crumbling drummer terrier gummy sections always to Casey Benjamin and guitarist Mike Marino Regina Carter was the principal violinist\nDaniel Frank cues was challenged and Lena hinder shoes the flu we began that said with the trumpet Tom Sheryl from his album wives children the two was ... as well said ... days\nShe'll be green was sexist trombone is Douglas courteous basis to ... and drummer Quincy dangerous with Sylvia come in and Antwon Silverman on by Lynn ... ... Hefner\nAnd cellist Daniel Miller and Jeffrey's cafe provided the percussion we're listening to jazz I'm John Hill\nYou discover H. P. P. R. connect you'll find a variety of informative enlightening and entertaining programs for National Public radio\nWhen you discover H. P. P. R. connect you'll find a variety of informative enlightening and entertaining programs from National Public radio the b._b._c. World Service American public media and others thought provoking programs like Ted radio hour travel with Rick Steves\nAnd radiolab will stir your imagination and expand your horizons to see a complete schedule and listen online visit us at H. P. P. R. dot\nOrg support comes from a marvelous company presenting concerto an F ... conducting and featuring Congress towel on piano October Nineteen twenty seven thirty PM at the globe new center Amarillo symphony dot org [noise]\nOpen your mind with three hours of music every weekday on high plains morning tune in Ninety and central for the best next full of forgotten favorite must live in Studio steps for new artists high plains morning after MORNING EDITION only a listener supported high plains public radio them\nTo the sun shine the Suzie\nWelcome to October H ... biggest month we'll just started a new fiscal year your public radio see she needs you to keep a Grammy strong with diverse music and the best news of year joined the mission should we today at age ...\nAnd\nHere on the high plains we love our live music and that's why H. P. P. our living room concert series brings you inspirational songwriters from across the world which shows in Amarillo Garden City and towns across the high plains joined the mailing list and learn more about living room concerts at H. P. P. R. dot org\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\nName of\n\nMan's land because we know\nBanging on the phone number\nIs ... ...\n... ... ... ... ...\nLess\nThan ... may\n\nHelp maintain\nThe bottom of the deep\nYesterday I have never\nKnown me know that this\nIs ms ...\nNa na has left me\nAnd I can't think of the biggest\nThing\nIs that even though\nIt is so [noise]\nI Know and\nAll\nThe you know tell me more\nTo me that she\nTold me you know I'm\n... I'm mad\nAs men that they didn't maybe in ...\nNew\n\n... na na\n\nLady day Billie Holiday I Can't face the music from a collection from the ultimate series we're contemporary singing select\nWhat they consider the best suits from seeing is that they love\nThis compilation was put together but surely horn she says no I had that old record in a war that tells the story that swing court nobody's business with that together was like pure set a date\nStory the swing court nobody's business but they had together was like pure set a date in this instance is Oscar Peterson pianist Oscar Peterson and Billie Holiday\nAlbum also included tenor saxophonist Paul when the ... or ... is acceptable\nGuitarist pretty green ... brown on bass and Gus Johnson was the drummer\nBefore that use it from the Rob Dixon trio saxophonist Rob Dixon with guitarist Joe like hunter drummer Mike Clark and trombone is\nErnest Stewart coast drew crossroads is the name of the album we heard San Leandro and we began to sit with saxophonist Jim snow Darrow and trumpeter Jeremy felt the album\nIs celebrating saxophonist cannonball had already had it's called jubilation\nTo sack away oh with the un is David ... teen basis Reeves and drummer Billy drawback\nI'm John Hill and we're listening to jazz [noise]\n\nPer diem came from our bureau\nYou know Jim T\nUse my\nMe all of them [noise] by August scar you\nIt would be really on\nThe ... and ... you are willing to move on if you can have\nBall and too many changes\nI can read and then [noise] you\nWhy did they\nHe is now ...\nHere in St\nOnly a slave\n\nIt'd be in\nOn to the news\nKnow in ...\nHe gets in the\nOnly of late [noise]\nTen ...\n... [noise]\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\nI'm Bob Davis H. B. PR is executive director NPR's all things considered is a great way to hear the news of the day a great way to support H. B. PR is to become a sustaining member joined the mission today at H. P. P. R. dot org\nSupport comes from the office products of Garden City announcing their new location at ten sixteen west Mary street offering business supplies sales and service on new and used office equipment more information at the office products dot com\n[noise] this is Ninety One point five kids\nThe service on new and used office equipment more information at key office products dot com\n[noise]\nThis is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. at age ... P. R. dot org or coal eight hundred six seven eight seven four four four\nLive from NPR News in Washington I'm neuron President Trump today suffer himself the devastation caused by hurricane Michael in the Florida Panhandle last week after viewing the record you by air he visited in a distribution center in Lynn have announced signs Panama City and describe what he saw part to believe\nI've seen pictures but it's hard to believe when you're above if they don't play and that is a total devastation\nHe later visited neighboring Georgia that storm is blamed for at least Seventeen deaths in four states more than a hundred and fifty thousand people are still without power in Florida after the hurricane WFSU Sean locate he reports some recovery efforts\nCrossroads academy a charter school in Quincy, Florida outside Tallahassee remains closed but students and teachers are here distributing hot meals and food to the community you know people just here eating with her son and daughter she said that storm\nWas horrible it was terrible if you have the wind was blowing it will take it all of a single dumped him home and everything and um I was watching all the trees they have three and half\nOf define everywhere crews are working around the clock but officials say could be anywhere from weeks to months before cleanup efforts are complete talk with electric hopes to restore power to most queen the residents by friday but the hardest hit areas could be in the dark for two weeks or longer for NPR News I'm Shawn ... in Tallahassee\nTens of thousands of homes and businesses lost power in northern California by design Pacific gas and electric ordered a blackout fearing high winds will toppled trees and power lines and sparked wildfire it's the agility already could be liable for billions of dollars in damages caused by wildfires this year\nThe Trump Administration is proposing to export coal and gas from military bases on the west coast John Ryan from member station Taylor W in Seattle has more\nInterior secretary Ryan Zinke he told the Associated Press he aims to use military bases or other federal sites to ship fossil fuels overseas for our allies\nHave horrible reliable bugs in energy\nWest coast states have blocked coal exports Washington governor Jay Inslee says he won't let the Trump Administration kid around environmental laws\nThey have to show compliance with state and federal laws we have the right to protect our water and our air\nThe coal industry views exports has a lifeline as domestic use falls for NPR News I'm John Ryan in Seattle\nPaul Allen is dead at the age of sixty five along with Bill gates Allen cofounded Microsoft the world's biggest software company the two and a falling out in Nineteen eighty three and Paul Allen became of philanthropist to also invested in conservation and professional sports it's company announced he died today of non Hodgkin's lymphoma\nStocks close lower again today the Dow lost eighty nine points down about a third of a percent this is NPR News\nSears is now in chapter eleven bankruptcy and found a record of the nation plan in white plains New York today it proposes to shut down about one hundred forty two of its seven hundred stores by the end of the year and lay off thousands of employees\nDay it proposes to shut down about one hundred forty two of its seven hundred stores by the end of the year and lay off thousands of employees Sears was founded an Eighteen eighty six and publish its first male or a cat lover two years later grew to become the biggest retailer in the world\nThe former security director for the Senate intelligence committee has pleaded guilty to lying to the FBI NPR's Carrie Johnson reports\nAuthorities say James wolf lied about his contacts with reporters when the FBI interviewed him in late twenties Seventeen\nWolf has pleaded guilty to a single felony charge in a federal court in Washington D. C. his lawyers emphasize the work did not share classified information with reporters covering the Senate intelligence committee and at his sentencing hearing shortly before Christmas they're expected distress his nearly Thirty years of service\nThe guidelines call for ... between zero and six months the judge was allowing walk to remain free until he faces punishment Carrie Johnson NPR News Washington\nA federal judge in Los Angeles today throughout a lawsuit by adult film actress Stormy Daniels she had sued President Trump for defamation after he had tweeted that she was lying\nBeing threatened and twenty eleven not to talk about her claim she had had a sexual encounter with Trump the president tweeted it was a total con job the judge said the tweet constitutes rhetorical hyperbole normally associated with politics and that's protected by the first amendment\nI'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Sierra Nevada Brewing Company family owned operated and argued overturned Nineteen eighty crowd supporter of independent vote whether that's on line over the air or in a bottle more if you're in Nevada dot com\n[noise]\n\n[noise]\n\n[noise]\n\nOh sponge\nWhen the moon has been getting anything\nThat would go\nAway and the way\nThat is my big no\n\n\nGood to know\nWho\n\nThat\nFor\n\nA while right do love the snow like no\nNo no\nFor sure they\n\nKnew\n\n\nWho to\n\n\nRepay\nThe I\n...\nOr ... you know and that's the goal which my ...\nIn their child the way\nMy middle every I look better by then\nIf you want\nMy been through this man\nKnew\n\n\nUm well ...\n\nYoung bloggers\n[noise]\nIf you want\nTo know\n\n\nThat the pot book a gun\nIn their child in the way he he you\nKnow every night\nThey would\nKnow\nBetter bar then the\nMan you know\nI've been through them a\nNew\n\n\nBook\n\nLet's pause\n\n\nIf you want to but in la\nLa\nLa\nLa\n\nLa la\n\n\n\n\n... would love for sale from the best of the song books\nThat close Olbermann's orchestra with Michael Burger gator dreams the name of the album weird to prescribe the drug all ... stores word of mouth big bad to start things off whose song the chicken were so intro\nYou're listening to jazz were John who\nWas H. P. P. ours for membership campaign right around the corner your support today will take H. P. P. R. that much closer to the eighty five thousand dollar goals for the month of October joined the mission today and support media that matters at H. P. P. R. dot org\n[noise] good news is the bad news this is Sandra Tsing Loh with the lowdown on science we love good news intend to filter out bad news this could be why some folks ignore warnings to lead disaster areas is there any hope for us cheesy optimist\nSriracha from University College London wondered the same thing she and her team asked two groups of volunteers to get the chances of something bad happening to them\nFor example burglary or identity theft Dutch west one group was stressed out over a speech they'd have to give after the experiment both groups often low balled their risks afterwards they were told the actual crime statistics and we're allowed to correct their gas\nThe non stretch group never faced reality\nThey stood by their optimistically low risk\nBut the stress out group they listened their new assessments we're in line with real world data\nThere's no space for optimism researchers think this flexibility is good for us optimism can keep us happier when times are good but stress keeps us cautious when they're in danger on the horizon shows the issue [noise]\nThe lowdown on science is produced by LDL with Media Lab in partnership with you\nThe state yeah sure [noise] the lowdown on science is produced by LDL with Media Lab at partnership with the University of California Irvine science communications and even though I'm forty three tape you see on the Web but eh low wage D O W N Australia started or\nSupport comes from United Wireless locally owned and operated what service plans to provide coast to coast coverage stores in agents across the region coverage you deserve service you expect you to wireless dot com\n\nAnd um\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\nMm Mm Mm\nMm\n\nMm\nMm Mm\nMm\nMm Mm Mm Mm [noise]\n\n\n[noise]\n\n\n\n\n\nTo be the the people [noise]\nWho\nYou know between the two people with the with the [noise]\nWho ... to ... to ... to\n\nDo [noise] even\nIf the people to do what they\nDo it if it was a big big big big\nFrom our da\nDa da da\nDa da\nOur\n\nPhone number one number for her for her\nFrom some of them were the\n\nThe trumpet of Tom Sheryl from an album called moving picture that was different\nClouds with Danny Griffith on piano or gun out okay wait on base and drummer Adam cruise\nBefore that vocalist Robert MacArthur dreams bill from his album stranger in child ... on piano guitarist Alex Rogalski trumpeter Curtis Taylor basis Marion she now drummer that is ...\nAnd we started the set with the sex of Hank Crawford organist Germany regret their album road tested too for sentimental reasons\nWhen Boyd their car Bernard pretty on drums I'm John Hill you're listening to jazz\n[noise]\n\n\nAnd\n[noise]\n\nMm\n\nAnd\n\nAnd\nAnd\n\n\n\n\n\n... [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\nThis is John Hill and you're listening to jazz time on listener supported high plains public radio\n[noise]\nOctober is an important fundraising month for high plains public radio because it's the first month of H. P. P. ours fiscal year and sets the tone for the rest of the year support your public radio station today by visiting H. P. P. R. dot org\nSupport comes from mobile mobile eastern and fair about of Amarillo trial attorneys representing clients across the high plains attorneys licensed in Texas Oklahoma New Mexico and Colorado level ... dot net\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\nLive from NPR News in Washington I'm nor rom\nSecretary of state Mike Pompeo is on its way to Riyadh Saudi Arabia he's expected to meet with the king to discuss the disappearance of Saudi writer ... who hadn't been seen in public since the entered that Saudi consulate in Istanbul, Turkey nearly two weeks ago\nTurkish authorities say they believe he was killed there is so good Jay had been living in the U.S and wrote for the Washington Post\nHundreds of people are still in shelters days after hurricane Michael slammed into the Florida Panhandle it came ashore last Wednesday as one of the most powerful storms on record to hit the continental us NPR's Quil Lawrence has more on recovery efforts\nCharge and chainsaws are in high demand as residents clear falling trees and patch up the holes in their roots made by hurricane Michael's one hundred fifty five miles per hour winds electric generators or sought after with power companies still tentative\nWhen the lights might come back on there is no cell phone signal in much of the region locals have been getting tips from radio stations about where they might find gas food and water distribution and medical care\nTraffic in and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flow into the pan handle from all over the state Quil Lawrence NPR News Miramar Beach Florida\nPresident Trump visited Florida and Georgia Monday to view the devastation he said the government is doing all it can to help survivors\nTo be\nAt least Seventeen deaths in four states have been blamed on the storm Microsoft cofounder Paul Allen has died at the age of sixty five from complications of non Hodgkin's lymphoma as NPR's Martin hockey reports that\nDied at the age of sixty five from complications of non Hodgkin's lymphoma as NPR's Martin Kaste reports the tech billionaire help define the early look a personal computers and went on to shape the look of its own town\nIn those early photos of Bill Gates and Paul Allen it's a bearded Allen who looks like the grown up starting in the seventies the two childhood friends parlayed their computer hobby into the world's most important software company providing the dogs that ran IBM and other PC clones\nIllness forced Allen to seed control of the company to gates but his Microsoft shares made him a billionaire and then the succeeding decades he became a major influence here in Seattle as owner of a local football team and as a real estate Baron\nAllen spent millions on brain research and causes such as Ebola but also on memorabilia of is youthful enthusiasm Z science fiction and rock and roll\nMartin ... NPR News Seattle\nSears once the largest retailer in the world is now in chapter eleven bankruptcy and plans to close doors and eliminate jobs to stay in business at least for now this is NPR\nA trial is underway in Boston this week claiming that Harvard University discriminates against Asian American applicants\nAnd an opening statement Monday lawyer said that school deliberately ranked Asian Americans lower on a personal rating use to measure trade such as courage and likeability a lawyer for Harvard denies any discrimination\nThe archdiocese of Washington has published the names of twenty eight clergyman credibly accused of sexually abusing minors as far back as the Nineteen fifties a lotta wise of member station WAMC new reports\nOf the twenty eight religious leaders accused and the new report some have multiple accusations of abuse more than half were convicted for their crime and many have already died\nThe news comes just days after Pope Francis accepted the resignation of archbishop of Washington cardinal Donald Wuerl who has been accused of covering up sexual abuse scandals during his time at the bishop of Pittsburgh\nThe survivors network of those abused by priests criticized the timing of the release a group called the move a quote hastily assembled PR stunt men to distract from worlds Frederick nation for NPR News I'm a lot of lives in Washington\nFederal regulators are proposing prescription drug companies to advertise on television they're required to include praised the\nHealth and Human Services secretary Alex ... says patients deserve to know what a given drug could cause when they're being told about its benefits and risks a trade group says including the price it could it's courage people from seeking medical care I'm newer rom NPR News\nSupport for NPR comments from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs for major remodeled homeowners can read reviews of local pros and book appointments online at home and visor dot com\n\nTo [noise]\nBeing ... you [noise]\nYour mom or\nI hear you\nBegan to you\nYour mom mom most do work to a\nDog but\nNo one no\nWhere you will you will\nOr ...\nWho was the name\nOf Mahmoud gab humanely\n... those or rural\nUm\nSurveying my life\nI pull them all in a mall or all through it was a ball\n\nAnd ...\n\n\n\n\n\nThe ... party no pet march you know with James rental on Seattle basis mark Johnson and Jo Bonner deal on drum is this autumn as ours is the name of the two comes from ... Martinez album called the maker\nAnd we started with mark Murphy yeah some time ago the two year my alter ego which was written by the pianist James Williams here we heard ... music or on piano Steve was you know on base and wintered Harper on drums\nWith Alan mosquito on saxophone I'm John Hill\nAnd you're listening to jazz [noise]\nOscar Peterson accentuate the positive\n\n\n\n...\nAnother re\nHoning cool\nWith it mainly to me in\nOpinion in\nAre and natural way\nAnd you know by the end\nJust PR and natural way\nHave you seen or any place [noise]\nThis is not only from your e yeah\n...\nI'm lucky in little hatchlings frightened\nBelong out in the night [noise] don't even know enough\nTo sit here and I believe\nShe jumped the piano\nLike chat\nBank ... Lee is then then then the [noise]\nI keep saying to myself it's a wonder back then\nBut it's so loud\nShe liked the friends\nBack in the middle of the area\nAnd then that she didn't really rich\nI'm not aware [noise] now and then I Know she's an empty\nGate things through\nThe school and me I live in\nA part of me that helps me be the part of me that [noise]\nNa na\nNa na\nA\nDirty word to\nThe ah\nThe thing\nDo want to win the\n... a\nYoung guy named\n... not carry on one you know\n\nKnow what you are\n\nHe says\n\nThe\nThey're all on\nThe show today\nA re lower the\n\nWell and ... ...\nYou know\nA little\nThing and to try and go in the low brand\nYou may go then [noise] um [noise]\nSo [noise]\nThing [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\nFluids Gerald Becky from his album of living in a song called Eva with Ruben Saucedo on Alto sax Dan Neverland vibes\nJim sure what's the bassist and poll soon tank on drums\nBefore that Charles Lloyd from his album Hyperion with\nChickens too was dancing waters big search to by Charles Lloyd with Billy she goes on drums John Abercrombie was guitarist basis Larry granted here and the interest bread meld though\nAnd we begin with vocalist Abby Lincoln and pianist Hank Jones\nYahoo called when there is love we begin with a poem by Abby called a part of me\nAnd then she uh did there are such things so I Would be called the mentally but a a poem than a song from every Lincoln I'm John Hill you're listening to jazz\n\n\n[noise]\n\n\n\n\n\n\n[noise]", "show_name": "Jazz Time", "year": "2018", "city": "Dalhart", "day": "16"}