{"month": "10", "state": "TX", "station": "KTDH", "content": "\n\nHi this is Jenny ... your H. P. P. R. music director and host of high plains morning and I'm here to say thank you for three hours every weekday you trust me to build the airwaves with a mix curated just for you regional favorites classic songwriters and new voices in folk Americana world music in more and I'm honored\nThanks for paying for this service things for keeping real music alive every contribution is crucial please give today at H. P. P. R. dot org and again thank you when you discover\nH. P. P. R. connect you'll find a variety of informative enlightening and entertaining programs from National Public radio the b._b._c. World Service American public media\nStay you trust me to fill the airwaves with a mix curated just for you regional favorites classic songwriters and new voices and folk Americana world music and more\nAnd I'm honored thanks for paying for this service I think for keeping real music alive every contribution is crucial please give today at H. P. P. R. dot org and again thank you\nWhen you discover H. P. P. R. connect you'll find a variety of informative enlightening and entertaining programs from National Public radio the b._b._c. World Service American public media and others thought provoking programs like Ted radio hour\nTravel with Rick Steves and radio lab will stir your imagination and expand your horizons to see a complete schedule and listen online visit us at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three K. C. D. H. doll heart Ninety One point seven KGAN Hayes a service of high plains public radio\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find indication to thank them for their support\nAnd ah\nA\nHair on the high plains we love our live music and that's why H. P. P. our living room concert series brings you inspirational song writers from across the world which shows in Amarillo Garden City and towns across the high plains joined the mailing list and learn more about living room concerts at H. P. P. R. dot org\n\nLive from NPR News in Washington I'm Jim hawk the national Transportation Safety board is investigating a crash involving a limousine that killed twenty people on Saturday as NPR's Bobby Allyn reports the accident happened in front of a country store in upstate New York after the limo apparently failed to stop at an intersection\nNew York state police say the two car collusion happened in sky Harry Saturday afternoon\nOfficial say all Eighteen adult passengers in the limousine were killed and to pedestrians who are struck also died the victims have not been identified National Transportation Safety Board chairman Robert Sumwalt says this is the most deadly transportation accident in the country in nearly a decade\nTwenty fatalities as just\nI've been on the board for for twelve years and uh\nThis is one of the biggest loss of lives that we've seen in a long long time\nOfficials have not confirmed where the limo came from and where it was heading Bobby Allyn NPR News\nA politician from the far right one a commanding lead in Brazil's presidential election Sunday but as NPR's Philip Reeves reports he failed to secure an outright victory and the first round setting up a runoff election\nVeteran congressman and retired army captain ... NATO needed more than fifty percent of the valley of votes to win the presidency of Latin America's largest democracy outright he came close was just on the forty seven percent after almost ... votes were counted\nIn Rio is supposed to celebrate it as if you put this contest will now go to a runoff which also NATO or face financial ... from a leftist workers' party\nThe stand in for Brazil's former president Luiz ... Lula da Silva who's in prison for corruption this election's opened deep divisions of Brazil between those who think both NATO will combat rampant crime and corruption and others alienated by his ... racist comments as his admiration for Brazil's policies military dictatorship\nFor the Braves NPR News Rio de Janeiro to\nDamage is still being\n[noise] in Rio is supposed to celebrate it as if he won the contest will now go to a runoff which also NATO will face financial had that have from a leftist workers' party\nThe stand in for Brazil's former president Luiz ... Lula da Silva who's in prison for corruption this election's opened deep divisions of Brazil between those who think both NATO will combat rampant crime and corruption and others alienated by his in such a dentist and racist comments as his admiration for Brazil's polish military dictatorship\nPhilip Reeves NPR News Rio de Janeiro\nDamages still being assessed in Haiti or a five point nine quake struck Saturday and was followed by a five point to aftershock on Sunday NPR's Carrie Kahn reports a dozen people are dead the ten most ...\nEarly evening Saturday in the northern province of Haiti happening at church and homes in several cities as well as damaging an auditorium and the police station in the town of ... pay the quake was felt more than a hundred miles away in the capital Port au prince where no major damage has been reporting\nIt was all about the neighboring Dominican Republic and in eastern Cuba\nHaiti is vulnerable strong quakes and given the poverty in the country most living tenuous scratch it that lead to higher casualties\nInches out in tennis player one quake struck near the country's capital killing more than two hundred thousand people and covering billions of dollars in damages and housing and other infrastructure nearly a decade later much of the capital has still not fully recovered Carrie Kahn NPR News\nYou're listening to NPR News in Washington\nHundreds of people who won a second referendum on Britain's membership in the European Union staged a demonstration with a different Sunday in London as Larry Miller reports they brought their dogs alone [noise]\nOrganizers of the wolf or random campaign [noise]\nContend that along with much of the British populist animals will suffer from rags it's saying it would lead to a shortage of vets and more expensive pet food\nAlong with canines of many reads the march through central London to parliament square drew politicians actors and activists one protester says it's nice to highlight a serious issue in a fun way she draped or a Beagle interview flag this all for random demonstration as a prelude to a much larger rally in two weeks\nHowever prime minister Theresa May has categorically ruled out another public vote\nFor NPR News I'm Larry Miller in London\nFlorida governor Rick Scott on Sunday Warren the tropical storm Michael headed for the Florida Panhandle could become a category ... hurricane with winds up to one hundred miles per hour by the time and make landfall in the middle of the week\nScott issued an order for a state of emergency for twenty six counties in the Florida Panhandle and the Big Bend area also activated five hundred members of before the national guard the head of the storm\nAt the weekend box office the comic book movie venom shrugged off bad reviews and opened the number one Lady Gaga ... star is born made its debut in second place small for which third followed\nBy night school and the house with a clock on his walls I'm Jim Huck NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include ISI MC foundation working to improve postsecondary educational outcomes for underserved students through evidence based innovation learn more at ease the embassy foundation dot org\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n\nPR comes from NPR's spaceships other contributors include each the emcee foundation working to improve postsecondary educational outcomes for underserved students through evidence based innovation learn more at ease the empty foundation dot org\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\nOoh\nOoh\nOoh ooh\nOoh\n[noise]\n[noise]\nNo\n\n\nAnd didn't need\nTo\nThe\n\nWay in all ways to do stand on the run\nTry to make it will come\nTrying to make it\n[noise] the\nRun a main get full\nDee Dee Bridgewater from red or that was compared to what and you've heard here on jazz with the Alexander ... from the quest out troll\nAl ...\nAnd I made an hour and\nAnd ...\nAnd I and\n\nNa na na\nNa\n\nNa\nNa na na\nNa\n\n\nDa da da da\n\n... do\n\n\n\n\nDa da da and always getting down from groove awakening that was a leader dance get a visa and dance quite beautiful wife\nRita before that the latest from John mulder from decades memoirs and that was African sunset here's music from a great book without a Chicago Syrian Ford from New standard cotton sure\nWell [noise] [noise] [noise]\n[noise]\nLead to me that in ... in the Alamo battling with the gift that in the bottom line\nYou know reading the regime than the other daughter ... na na hey we don't go the middle of the within the not on the line\n\nBit and then in ... and did now know better than the than the other night\nOn June ... being rich in the minority leader who live within the nine but like do we not heard some of the bad guys da da da da\nDa da di\nDi da dun lives there and you know little\nMoney by a letter to win\nYou\nMay have done this rule things nobody died on my end to the\nGrid lock\n'em down near the ...\nWithout knowing\nWhat kind of don't get to talk\nThings don't you\nWe lived like go down to a place\nWhere you live like go to\nAbsurd\n\nYeah I I I I'm not up on my body\n[noise]\n[noise]\nShot to call in show\nMy day when I'm\nShot to call in show [noise] you know I'm\nMight not be a\n\n\n[noise] thank you for listening you with the Alexander and there is yeah\n[noise]\n\nHi this is Jenny ... music director at high plains public radio things do you remember listeners this shouldn't rocks and rolls and swings and it's because of you keep the music going give now at H. P. P. R. dot org H. P. P.\nR. is a community resource that delivers media that matters and is made possible by listener contributions so H. P. P. R. you gain knowledge and grow community so please give today at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da di di di point seven KGAN Hayes a service of high plains public radio\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nLive from NPR News in Washington I'm Jim hammock\nA limousine loaded with revelers bound for our thirtieth birthday celebration crashed outside a store in upstate New York killing all Eighteen people in a limo and to pedestrians National Transportation Safety Board chairman Robert Sumwalt called it the biggest us transportation accidents in two thousand nine\nNTSB is very concerned about\nAbout safety on our roadways and uh we are here the fact that the NTSB as here indicates that we're very concerned about this um you asked about the magnitude of this twenty fatalities is just\nHorrific I've been on the board for for twelve years and uh this is one of the biggest losses wife loss of lives that we've seen a in a long long time\nThe vehicle involved in the accident was an after markets stretch limousine which often don't have safety measures including side impact airbags reinforced roll over production bars and accessible emergency exits [noise]\nPeople opposed to Brett Kavanaugh's confirmation to the U.S Supreme Court gathered in Delaware Sunday Sarah Mueller from Delaware public media says one group as worried about possible biased toward corporations\nCan purchase attended a small rally in Wilmington she's a descendent of not pay Indian tribe in Delaware purchase that she's concerned Kevin ... ruled in favor of businesses for protecting the rights of indigenous people\nHe will vote for anything that protects international corporations what his track record that\nPurchased adds a lawsuit currently pending before the Supreme Court involving Alaska Native people could have\n... Miller from Delaware public media says one group is worried about possible biased toward corporations\nCan purchase attended the small rally in Wilmington she's a defendant does not pay Indian tribe in Delaware purchase that she's concerned Kevin our rule in favor of businesses over protecting the rights of indigenous people\nHe will vote for anything that protects international cooperation with what his track record that\nProject that the last few currently pending before the Supreme Court involving Alaska Native people could have implications for travel members in Delaware the case could play federally protected land under state control for NPR News I'm Sarah Mueller in Dover, Delaware\nRomania is attempt to ban same sex marriage in its constitution has failed after a poor turn out by voters in a two day referendum as Joanna Kakissis reports from ... arrest the powerful Romanian Orthodox church it back to change\nMe an orthodox priests Sunday services urged voters to support the chain which would define marriage as between a man and a woman in the constitution marriage is now a defined as between spouses\nRetired engineer Mario to fit side and the church when he insisted spouses cannot be of the same sex\nI don't like mentally as men\nAnd women was when he voted for the constitutional change that hardly anyone else showed up to vote in his precinct ... there's not much even when you go to ... percent nearly fifty million dollars with a taxpayer money on this referendum eat salads and in the end it didn't matter for NPR News I'm Joanna Kakissis in ... Romania\nBrazil's presidential election will be decided in a runoff between right winger ... an hour on leftist Fernando ... run off between the two top vote getters is required window candidate wins a majority\nVote will be held October twenty eighth this is NPR News leading\nExperts in climate science conclude that new technology another untested methods are needed to take greenhouse gases out of the atmosphere NPR's Christopher Joyce has the technology is yet to be invented\nThe scientists were asked if it's possible to keep the planet from warming more than about two and a half degrees Fahrenheit above pre industrial temperatures that's\nA red line for dangerous effects on the climate\nThey conclude that current pledges by governments to simply limit emissions of greenhouse gases are not enough to stay below that line what's needed are new and potentially expensive technologies to extract those gases from the atmosphere as well as a vast new forests to soak up carbon dioxide from the air\nThe report is from the inter governmental panel on climate change a scientific group that advises the United nations Christopher Joyce NPR News\nSecretary of state Mike Pompeo said that he and North Korean leader Kim Jong known made unspecified progress Sunday toward an agreement for the north to give up its nuclear weapons there was no immediate indication whether Pompeo had managed to arrange a second summit between Kim and President Trump\nForecasters say tropical storm Michael has gotten a little stronger and is next expected to dump heavy rains over western Cuba before it makes its way toward the U.S Gulf Coast\nNational Hurricane center in Miami says Michael is packing top sustained winds of sixty miles an hour and as about one hundred forty miles southwest of the western tip of Cuba storm is currently\nHeaded north at five miles an hour and could become a hurricane in the next few days ... NPR News in Washington\nSupport for NPR comes from green wave maker of luxury massage chairs from Japan with she apt to point detection and sixteen programmed massages including morning night and stretch sessions retailers nation\nYou know Hurricane Center in Miami says Michael is packing top sustained winds of sixty miles an hour and there's about one hundred forty miles southwest of the western tip of Cuba\nStarbucks currently headed north at five miles an hour and could become a hurricane in the next few days ... NPR News in Washington\nSupport for NPR comes from green wave maker of luxury massage chairs from Japan which she got to point detection and sixteen programmed massages including warning night and stretch session retailers nationwide more ... chair dot com Andy any each case the foundation ...\n... ...\n...\n...\n\n\n\n\n[noise]\n\n\n\n\nThat was I got my mobile Joel working Jimmy Smith on him and be screen before that myth Tio full or on Alto sax from diamond cutting with tears of Santa Barbara next step family feeling surreal Stafford on Trump addict old Alto birth\nThat was I got my mode Joel working Jimmy Smith on him and be screen before that myth T o cooler on Alto sax from diamond cut with tears up Santa Barbara\nNext step family feeling to rail Stafford on Trump addict old Alto Bruce bark piano ... tenor they would want base in Byron land them on germ ... for Mr tighter\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\nAnd\nDa da\nDa\n\nLaden and da\nDa da da\nDa\n\nDa da\n\n\nThen\n\nThen\n\n\n\n\n\n[noise]\n\nThen they\nWill\n\n\n\n\n[noise]\n\n\n\n[noise]\nMm\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise] our beloved John right also known as poppy the John right\nTrio south side so see that fans five times [laughter] thirty fifth street blues with John right on piano window Roberts on base Walter McCants on drums recorded in Englewood Cliffs New Jersey August thirtieth Nineteen sixty\nMixed up we have music from Cassandra Wilson from blue sky ...\n\n... ...\nThat maybe\nThey\nShould know that\n\n\nShow that\nShow ... say\nMean\n\nGoing a\n...\nShall we say\nMean we're\n\nWe're in the\nWould be the two\nWill be\nJob\nA reason\nNews is shot with\nA\n... a\nBut\nWhen\nWas around those\nShows will be able to\n\nAh\nLove this God thank\nThey\nDo [noise]\n\n\nThe\n[noise]\n\n\n\n\n[noise] now\nPlease\nShow we day\nSo they stay\nWhich I'm not [noise] and\n\nWe [noise]\nDo they do\nBut it is that\n\n[noise] [noise]\nMm\n\n\nI have given you my true low\nBut do you live close\nA new low oh\nWhat am I supposed to do no with you know your through you know\nYou'll be on your way [noise]\nUm ... believes is to say [noise]\nI haven't been through new ...\nOh new la oh\nWhat am I supposed to do now with the you know your through you know\nYou'll be on young man in the way [noise]\n... leads is to say [noise]\nI haven't been through new ... [noise] I'm never fall or get um [noise]\nThat are due to low [noise]", "year": "2018", "show_name": "Jazz Time", "city": "Dalhart", "day": "08"}