{"month": "10", "state": "TX", "station": "KTDH", "content": "Additional funding is provided by Mr and Mrs Williams ... brown Brenda at Earl Shapiro Mrs Jones Harris had the Heritage Foundation and the members of the W F empty fine arts circle\nExecutive producer is Steve Robinson about McLachlan thanks for listening\nWithout music a philosopher once said life would be a mistake\nListening to familiar music reminds us why it matters well discovering new works provides an endless source of delight exploring music is dedicated to the deeper appreciation and pure enjoyment of music it comes to that station because of support from listeners like you together\nWe keep the music playing thank you\nThis is the W. F. empty radio network\n[noise]\nSinuses Mike fuller coming up on the next what's folk songs all about girls all kinds of girls\nRiver girls southern girls\nTokyo girls with girls American girls music from guy Clark ... Harris and mark an off color Harper Simon iron and wind chimes much more song is all about girls on the next what folks here on high plains public radio\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da na ... point seven KGAN Hayes a service of high plains public radio\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to inquire or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or call eight hundred six seven eight seven four\nFour four\nLive from NPR News in Washington I'm ...\nThe three Republican senators who have been wavering on the choice of Supreme Court nominee Brett Kavanaugh today works brushing varying degrees of unhappiness over remarks made by President Trump last night at a rally in Mississippi Trump mocking the Senate testimony given by Christine ...\n... degrees of unhappiness over remarks made by President Trump last night\nAt a rally in Mississippi Trump mocking the Senate testimony given by Christine Blasey Ford the first woman to publicly accused Kavanaugh sexual misconduct for being unclear about certain details of an assault she claims happened when the two were in high school today White House press secretary Sarah Sanders had this response to questions from reporters\nThe president's very confident in his nominee at the state of time and time again and we expected to vote and we hope faded that said\nDemocrats have blasted the president's remarks and so have Republican Senator Lisa Murkowski Susan Collins and Jeff Flake FBI report on Kavanaugh is expected soon clearing the way for a Senate vote on his nomination this week\nWith November's midterm is getting closer a new NPR PBS NewsHour Marist Poll showing more Republicans are becoming enthusiastic about election day NPR's Brian Naylor reports the survey also shows Republicans have narrowed the gap with Democrats over which party voters want to see control Congress the poll\nShows a two percentage point difference between the numbers of Democrats and Republicans who are calling next month's election very important in July the number was ten points in favor of Democrats and the Democrats advantage on which party Americans want having control of Congress has fallen in half\nFrom twelve points in mid September to six points now the latest poll numbers conjuring a heated partisan battle over President Trump's nomination of judge Brett Kavanaugh to the Supreme Court\nMultiple women have accused him of sexual misconduct which Kavanaugh has denied the controversy appears to have fired up Republican voters\nBrian Naylor NPR News Washington\nWhen officers dead six others have been injured following a shooting in Florence South Carolina it happened as authorities tried to serve a search warrant South Carolina Public Radio's Victoria Hansen as more\nInvestigators say this aspect open fire the officers as they try to serve that war edge they say he was barricaded in a home with children inside the kids have been taken to safety\nThe sense that it has to be the only thing the standoff lasted two hours some of the officers injured are said to be in serious condition no word on the reason the war with ... served for NPR News I'm Victoria\nAs promised electronic devices across the U.S sounded off today around to Eighteen pm eastern time mobile devices emitting a tone and sending a message with the subject line presidential alert reading this is a test of the national wireless emergency alert system no action is needed\nHim was hoping around two hundred and twenty five million electronic devices or Seventy five percent of mobile devices nationwide received\nThe test alert stocks closed higher today the Dow was fifty four points to the NASDAQ rose twenty five points this is NPR\nPhiladelphia non profit is planning to open what may be the country's first supervised injection site for illegal drug use is with the help of the state's former governor Bobby Allyn of member station WHYY reports the Trump Administration has threatened to shut down the side of it opens\nAdvocates call it an overdose prevention site where users injecting illegal drugs under the watchful eye of medical staff\nSupporters say it will save lives and move more people into treatment deputy attorney general Rod Rosenstein says if the site opens the response will be swift and aggressive because it violates federal drug laws former Pennsylvania Governor Ed Rendell is a board member of safe house the nonprofit trying to open that site he isn't worried\nI have a message from his rose inside I may incorporate or of the safe injection site\nNonprofit an incumbent arrest me first researchers say the opioid crisis claims a hundred lives nationwide every day for NPR News I'm Bobby Allyn in Philadelphia\nAstronomers say they may have found the first moon outside our solar system to researchers at ...\nNationwide every day for NPR News I'm Bobby Allyn in Philadelphia astronomers say they may have found the first move outside our solar system to researchers at Columbia University presenting tantalizing evidence the moon could be considerably larger than earth\nAbout the size of ... they said they believe the planet it orbits is roughly the size of Jupiter based on the evidence the parents say they estimate the moon is some eight thousand light years away and they hope to be able to validate the discovery as early as next year with more views from the giant Hubble Space telescope\nPlenty planets exist beyond our solar system but a moon around any of them is you've got to be confirmed\nOil closed higher today rides at one point six percent to end the session at Seventy six\nForty one barely New York I'm jak spear NPR News in Washington\nSupport for NPR comes from the Charles Stuart my foundation supporting efforts to promote adjusting equitable ethics Dana both society and it's home town of Flint, Michigan and communities around the world more at ... dot org and that listeners who support this NPR station\n[noise] [noise] [noise]\n[noise] [noise] [noise]\nNot been wrong with three\nAs long as they come through once they're in or\nWhy what that\nStruggle with my jury [noise] where they now come on tell me it's very [noise] must be going out of\nThe most we go out I'll just\nDie [noise] and\nAll of my dreams oh I Know we're going to be ... I\nWant to go read up on us um\nI Know we must be your\nDream that you when we\n\nWould be too good well album\nOr\n... or ... or ... one way and I'm ... and\nThen my dreams and you walk out the door oh\n... must be your way out of ...\n[noise] at\nMy dreams are and are going to be a nice thing\nAbout why do we go read up on on on ... oh [noise]\nI Know a must be go hang out and stuff\nI used to dream of my fear\nThat somehow we've got away [noise]\n[noise] [noise]\n[noise]\nThat somehow we got over ...\n... it has to do that I used to wear a third day in\nThe marine corps or does that mean\nAll our lives very law I Know when you go to ... a lot of ... or ...\n\nLa\n\n\n\nThat's the uptown jazz to in touch with the Jimmy ... used to the imagination from their album there it is featuring ... green button on trumpet and the Trump bonus when apple white\nIdentity was count but you see bad recorded in my truck Nineteen Seventy seven that's the name of the apple\n... Jimmy forced on saxophone doing his own composition called\nBack the dreams do bases which occasionally use are used to the nickel bag for some reason just ahead of the ... going to New Orleans with Johnny abs we just kind of the country and and so\nYou feel like sometimes anyway to dreams must be going to start teaching ... guitar genes singleton on base and Michael skin gets on Congress\nTune dreams must be going out of style fishing Steve ... guitar James singleton on base and micro screen gets on Congo's from the John Adams album\nThe verdict by the way back of dreams yes you ever heard that a as a focal to I'd have great Tate covered it and it was called sack full of trees just a little to no\nYou're listening to jazz I'm John Hill from food is Kirby\nMan's album America Brazil is a natural\nCandles that lives in\n\nAnd the [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nOoh\nAnd\n\n\n\nAnd\n\n\nThen\nShe and her\n\nWere\n\n\n\nI don't\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n\n\n...\n[noise]\nI felt this world to from the album oblivion for food is Gerald Beckett was Ruben\n... on Alto sax Steve McQueen worry on keyboards bassist Charles Thomas and drummer Greg German\nWe began to sit with Dave striker to charge to Dave strikers album is called striking ahead Steve Nelson heard there on ... with Jared Golden Oregon and Mick plenty hunter was the drummer I'm John Hill you're listening to jazz\nBut she said dreamy\n...\nKnocking at that\nWith my\nDoctor is we ... [noise]\n[noise]\n\n\n\n[noise]\nLike a lovely [noise]\n\n... where\nA\nA\nUm [noise]\nOn any names such as this\nTo do very singing sensation um\nA nurse or\nNo I'm\n[noise]\nWhereby who who's a\nWay\n\n\nH. P. P. R. is a community resource that delivers media that matters and it made possible by listener contributions through H. P. P. R. you gain knowledge and grow community so please give today at H. P. P. R. dot org\nAngie have fully regional content director ... high plains public radio I injury each day that your delivered the news that matters most to you or your membership makes that possible show your support today by visiting H. P. P. R.\nDo I answer each day that your delivered the news that matters most to you your membership makes that possible show your support today by visiting H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three Cape Cod H doll heart Ninety One point seven KGAN Hayes a service of high plains public radio\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n\nLive from NPR News in Washington I'm ... and the FBI is wrapping up its supplemental background check on Supreme Court nominee Brett Kavanaugh majority leader Mitch McConnell says the Senate will get the report tonight and that a procedural vote on the nomination is that for friday\nAnd NPR's Scott Detrow explains the FBI's findings are not being made public\nEvery senator is being given the chance to read the FBI's findings about the report will be held very closely only one copy is being made available and will be held in the secure room to Senate uses for sensitive topics senators and a limited amount of age with security clearances will be allowed to read the report\nThe Judiciary Committee asked the FBI to conduct a one week investigation of claims cabinet salted Christine Blasey Ford and other women are though to Senator Jeff flake yes vote was contingent on that demand but the report scope is already coming under fire from Democrats Ford says the FBI never tried to interview her\nScott Detrow NPR News the Capitol\nA federal judge in San Francisco is temporarily blocking the Trump administration's plan to end temporary protected status\nFor immigrants from Sudan Haiti Nicaragua and El Salvador us district court judge Edward chance granted requests for preliminary injunction pending a lawsuit chances there's evidence that President Trump is hostile toward immigrants who do not come from Europe\nTemporary protected status has granted to people from countries devastated by natural disasters or conflict until conditions approve at home\nThe murder trial of Chicago police officer Jason Van Dyke will soon be in the hands of the jury W. B. easy it's Patrick Smith reports\nThe defense called twenty witnesses over the span of more than a week much of the testimony was aimed at trying to undercut a dash cam video showing Van Dyke shooting Seventeen year old upon McDonald sixteen times\nThat video with the centerpiece of the prosecution's case in shows McDonald walking away from police and Van Dyke keep shooting until his gun is empty even while McDonald is laying on the ground\nProsecutors called the former FBI agent and use of force expert who testified that the shooting was unjustified on Tuesday Van Dyke took a stand in his own defense he choked up describing the shooting and he testified that he was in fear for his life when he shot\nClosing arguments are scheduled for Thursday for NPR News I'm Patrick Smith in Chicago\nAt least one South Carolina law enforcement officers dead and six others were wounded after a gunman opened fire on them and the city of Florence Allen Hitler is the city's police chief there were responding\nTo the state of it as sort of\nWhere they knew that their brothers from the sheriff's officer brothers and sisters when the sheriff's office for the\nFinal says terrorists were trying to deliver a search warrant when a man barricaded inside a home opened fire on them and police responding to the shooting he says that the suspect\nIs now in custody you're listening to NPR News\nOrders and Utah arrested a man in connection with suspicious letters mailed to President Trump and officials at the Pentagon spokesman\nAnd with suspicious letters mailed to President Trump and officials at the Pentagon\nSpokesman for the state prosecutor's office at thirty nine year old navy veteran William Allen the third\nWas arrested in the city of getting to the letters contained traces of what turned out to be cast her seat they were thought to contain traces of the poison rice and which is made from a byproduct of castor oil production all of the envelopes were intercepted it mail screening facilities\nThe occupational health and Safety Administration has find superior refining company more than eighty three thousand dollars for eighty worker safety violations as Wisconsin Public Radio's Daniel ... reports the violation stemmed from an explosion earlier this year that injured thirty six people\nOSHA found the company which is owned and operated by husky energy failed to inspect and test equipment to make sure it would fit for surveys the agency said those measures could've prevented the explosion that constant evacuation for much of the city of superior in April ginger jewel with the activist group twin ports action alliance that the ... it's a slap on the wrist\nThis wasn't the first time this company the superior refining company has been cited for some of the serious issues bio shot a husky really wants to be a good neighbor to our community they'll make a commitment that they will not continue operations like\nA husky energy's spokesman says in a statement that the company is continuously improving safety programs for NPR News I'm Daniel ... interior Wisconsin\nOn Wall street stocks closed a bit higher Asian markets are mixed I'm shape Stevens NPR News\nIn Washington\nSupport for NPR comes from NPR's Beijing other contributors include the symbol Family Foundation supporting the national Center for learning disabilities which works to improve the lives of the one in five individuals with learning and detention issues learn more at mc L. D. dot org\n[noise]\n[noise]\nThat's music from guitars Steve ... from his album backlog a tune called Qatar featuring\nBobby Rodriguez on base mark Walker on drums were marching your names and Bobby ... on bongo Congo and\nVarious percussion restarted upset with the un is\nHarold ... along with Ron Carter on base and jak dues you not on drums which Stevie Wonder is don't you worry about it being from the Herald maybe an album\nStraight street you're listening to jazz um jobs you know\nHarm Jonathan bigger an every weekday I bringing you news stories about the high plains that I Love doing it but I Can't do it without your support so call one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org\nTo pledge today to a happy marriage being more sugar literally this is Sandra Tsing Loh with a lot of data and science meet Brad bushmen from Ohio State university\nHe is value added the relationships about hundred married couples then he gave each husband and wife their own bizarre take home catch it had a blood sugar test or\nFifty one pins and\nOf food do draw each night for three weeks the volunteers measured their blood sugar in private they also stuck they're stuck spouses with as many pins as they wanted this gauge to spouse directed anger the idea the ... the more pins\nAnd when blood sugar was low all received more abuse they were stabbed at twice as many times on average one subject used all fifty one pins on two different nights what's going on well self control it takes a lot of brain power\nBushman theorize that by the end of the day when blood sugar gets low our brains have less energy to control angry impulses like dropping our partners toothbrush in the toilet groups that's what I Need that bedtime muffins and thank you [noise]\nThe lowdown on science is produced by LDL with Media Lab in partnership with the University of California Irvine science communication and eighty nine points briefcase PCC on the Web L O ... O W n on science dot org [noise]\nSupport comes from relax awhile massage therapy for the pressure of hands that causes the springs of life to flow\nThe book comes from relax awhile massage therapy for the pressure of hands it causes the springs obliged to flow offering relaxation techniques for all ages in Amarillo more on Facebook at relax awhile massage therapy\n\n[noise]\n\n[noise]\n\n[noise]\n\nThen ...\nAnd ...\nMen and women are voting\nA room and\nAnd and\nMany men and\nAnd men and you know and\nThen when the\nThey go\nMoon and then in a day\nAnd\n\nAnd and as\nFor\nLong ago the unity\nAnd all\n\n\n\nWill will go\nIn\nBank\n\n\nOf those\nNeed and\nDid it and\n\n\n\n\n\n\nSaid I Know\n\nAnd um\nIs\nA ... which\nA\nA\nR\nOr who\n\n\nMore\n[noise]\n[noise]\n\nWhat I'm saying there's danger\n[noise] the fact\nThat\n\n[noise]\n\n[noise]\n\n\n\nNo no no\n\nUh [noise]\n\n\n... Joe luck performing the music or Henry Man see me along with the child is on piano basis any domains and drummer gene Jackson from the album moment to moment I was sure rate\nBefore that trumpeter Craig Frederick with his band trilogy\nI mean I'm all through the night crystal reams vocally with Tony ... at the piano drummer Todd Harrison and bassist hall Henry\nWith the ...\nAnd we began that said we're bell TD long tall Dexter Dexter Gordon with Art Blakey on drums Percy sheet on BASE jumping or ... Shaw pianist cedar Walton George Benson helps out on a couple of tracks on this album called Gotham City\nI'm John Jill here and now with Jeff\n[noise]\nMm Mm [noise]\n[noise]\n\n[noise]\nMm Mm\nMm\nMm [noise]\n\n\n\n[noise]\nMm\nMm\nTo Mm\n[noise]\n\n\n\nMm\nMm\n\nMm\nMm\n\n\n\nMm\nMm\nMm or\nThe for the\nNext [noise]\n\nDo the same thing for me\nAnd then ... and\nThe thing of the things that they can use\nIt for granted\nThat thing and then ...\n\n[noise]\n\nMm I\nDon't believe the [noise] the ...\nFor the\n\nCompany\nTend to\nPay the\n...\n... ... ... same thing\nDo with it and then in ...\nIn in ...\nDan [noise]\n\nMm [noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\nThis is John Hill and you're listening to jazz time on listener supported high plains public radio\n\nWelcome to October H ... biggest month we'll just started a new physical you your public radio say she needs you to keep a Grammy strong with diverse music\nAnd the best news on the air joined the mission 'cause she'll be today at age ...\nAbove Davis ... executive director NPR's all things considered is a great way to hear the news of the day a great way to support HP PR is to become a sustaining member joined the mission today at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie de ... Ninety One point seven Casey a haze of service of high plains public radio\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support\nLook under the support tablet H. P. P. R. dot org for details\nMine from NPR News in Washington I'm shape Stevens White House officials are defending President Trump's criticism of a woman accusing Supreme Court nominee Brett Kavanaugh of past sexual assault spokeswoman Sarah Sanders was asked about Trump's comments at a Tuesday rally where he mocked Christine Blasey Ford's testimony at a Senate hearing\nThe president was dating the facts I frankly facts that were included in special prosecutor Rachel Mitchell's report the was fading facts that were given during Dr Ford testimony and if it had to make a decision based on those facts are and whether or not they see judge Kavanaugh to be qualified I hold the position on the Supreme Court\nSanders says Kevin O's detractors had made falls in baseless allegation in a coordinated smear campaign to question his legitimacy for the high court\nSaid it majority leader Mitch McConnell says the copy of the FBI supplemental background check on Kavanaugh will be released to lawmakers for review he says a procedural vote on the nomination is set for friday\nThe international court of justice is ordering the United states to make sure that it's sanctions do not hinder aid to what Ron NPR's Michele Kelemen reports that the Trump Administration is fighting back accusing Iran of using the court as a propaganda for them\nTried that minutes ration is pulling out of the Nineteen fifty five treaty of amity with Iran which you can use to bring its case against the U.S at the international court of justice national security adviser John Bolton says the U.S is also withdrawing from another international protocol to undercut a Palestinian case that the court which challenged\nNational court of justice was ordering the United states to make sure that it's sanctions do not hinder aid to Iran NPR's Michele Kelemen reports that the Trump Administration is fighting back accusing Iran of using the court as a propaganda forum\nThe Trump Administration is pulling out of the Nineteen fifty five treaty of amity with Iran which Iran used to bring its case against the U.S at the international court of justice\nNational security adviser John Bolton says the U.S is also withdrawing from another international protocol to undercut a Palestinian case that the court which challenges the decision to move the U.S embassy in Israel from Tel Aviv to Jerusalem\nUnited States will not sit idly by as face looks politicized claims are brought against us\nFulton ad that he's now reviewing all agreements that exposed the U.S to the jurisdiction of the un tribunal Michele ... NPR News Washington\nAnd Florence South Carolina seven law enforcement officers have been shot in one killed whole trying to serve a warrant South Carolina Public Radio's Victoria Hansen reports that authorities say a suspect barricaded himself inside a home and help children hostage\nInvestigators say the way the suspect with position he had an advantage shots were being fired everywhere three of the wounded officers were removed with a bullet resistant vehicle as a suspect continued to open fire rooting for more police officers\nAuthorities at the standoff lasted two hours some of the injured officers are in serious condition the children have been taken to safety the suspect is in custody the shootings happened at an upscale neighborhood police have not said why they were serving the warrant for NPR News I'm Victoria Hansen\nOn Wall street stocks closed a bit higher although blue chips hit a new high the Dow gained fifty four points on Asian market shares are mixed up one percent in Shanghai this is NPR News\nWorkers at seven Mariano hotels in Boston walked off their jobs after months of field contract talks their union UNITE HERE says more than Fifteen hundred service workers are taking part in the strike\nThe Boston walkout comes days after members of another unite your local reached a new contract agreement at more than a dozen Chicago hotel strikes continue with several other Chicago hotels where workers are insisting on year round healthcare benefits for workers who are laid off during slower mumps\nAnd hotels and several other cities are facing the possibility of strikes most of them in California\nThe engineer who helped shape the sound of the Beatles to dodge of America was Seventy two years old and NPR's on a stop the few cuss reports emerge died yesterday of heart failure at his home in Los Angeles\nJust America came of age with the Beatles\n[noise]\nAnd I\nWas ... years old when he began working it out of the road studios in London he was an assistant engineer for such early hits as love me do and a hard day's night he became the Beatles primary engineering jets says he turned Nineteen and help turn into a laboratory for salad\n[noise]\n\n\nHemorrhage went on to work with a wide range of artist from Michael Jackson to Kate Bush ... NPR\nNews New York and I'm Steve and NPR News in Washington\nFor NPR comes from NPR stations other contributors include vital project started supporting the museum of modern art in Manhattan where drugs and dance theater the work is never done it on view\n[noise]\n\nYes I remember when you work with a wide range of artist from Michael Jackson to beat Bush on his ... NPR\nNews New York and I'm Steve and NPR News in Washington\nSupport for NPR I'm from NPR's Beijing other contributors include vital project started supporting the museum of modern art in Manhattan where jets in dance theater the work is never done it Don view and includes weekly performances in Marin atrium more it moment dot org\n\n[noise]\nWell\n\nMm\nMm Mm\n...\n\nDing ding\nDing\nStream\n\n\n\n\n\n\n\n\n\n\nOr according to the notes by Leonard Feather ... Harris has been called the only man complex soprano saxophone on tuner study Harris with the theme from the sand piper composed by Johnny man do who happened to be a jazz trombone instant and bases band and others but\nHe went on to become a successful motion picture writer shut off your smile was cedar Walton at the piano Ron Carter on base\nBilly Higgins on drums\nFrom ... in sound originally but you can also find it on a compilation disks called greater than the sum of its parts on the thirty to jazz label\nWas preceded by Lambert Hendricks and Ross from the album everybody's bothered with centerpiece and read it again that said with maps holding Quist\nBig band minimal wisdom is the name of the album featuring saxophone stick oats and trumpeter Randy broker\nOr with the Latvian radio big band and a tune called same old song match home quest big band minimal isn't\nI'm John Jill and you're listening to jazz\nThis is any calls yet I mean [noise] [noise]\n\nSo Matt ... of course big band minimal\nI'm drawn to you and you're listening to jazz\nThis is Betty Paul now to where she got up and\n\n\nBetter but I\n\nIn the [noise]\n\n\n[noise] and your name\nIn the\nIn the [noise]\n\n\n\n\n\n\n\n\nThe\nMay not\nBe\nDo in the evening\n\n[noise]\n\n\nA\n\nThe\nLike this calling me back a\nSo it goodbye to what you\nMaybe we'll get five strikes we beat up until we\nGet good bye to country western\nLead on the baby got played it and the\nDon't they just da da da da de ... ... people would get ... get that data we do for money to feed it would be the\nOn the ...\nSwing the pop song\nMetal disc or photos both laugh\nUm and when I hear the police beat on nobody\nAway from you know\nOh\nMm\nMm well I'm In\nGet the fuck contests last\nWant to hear from eats meat on not ready\nMy\n\n... well\nInto\nA place of John ...\n\nEveryone I Know who's been almost in love with ... ... they're Susanna from her album from ... to Brazil with the tuna adios America\nI'm In Florida My piano Howard older you know a guitar geo she could a gala bassist and drummer Chuck read ahead of it it was yeah and it's your call me while your call me what trio from the album pathways Lago rhythm\nLog oh rhythm\nAnd that was the unhinged sex tech starting that set don't blink the name of the album the two was the swing or and the St imposed by Alto saxophonist will Campbell with burn sealer on trumpet Matt Olsen on tenor sax\nMichael ... the piano basis to John hammer and dome Mario on drums you're listening to jazz with John Jill\n\n\n... [noise]\n\n\n\nBut\n\n\nDo you\nTo do\n\nThe doo doo doo doo doo\nDoo doo doo doo\n\n\n[noise]\n[noise]\n\n\n[noise]", "show_name": "Jazz Time", "year": "2018", "city": "Dalhart", "day": "04"}