{"month": "10", "state": "NH", "station": "WEVN", "content": "W. E. D. S. ... eighty eight point three W. E. V. H. Hanover Ninety One point three\nW. E. D. end keen Ninety point seven\nW. E. V. C. Gore on one of seven point one\nWill be a BJ Jackson Ninety nine point five\nW E via the cobra Ninety point three and W. E. B. Q. little ten Ninety One point nine and on line at N. H. P. R. dot org\nMajor funding for only a game is provided by Geico offering car insurance as well as services for homeowners and renters insurance through the Geico insurance agency additional information can be founded Geico dot com or one eight hundred nine four seven auto\nFrom W. B. U. R. and Boston I'm Karen given and this is NPR sports\nIn Nineteen Ninety nine Nike released an air zoom asked five named for WNBA start Don ... it\nWas like a hundred Christmases kind of\nThe one but in today's WNBA players like Simone Augusta have no choice but to where men signature she we talked about it often I mean what what ... what ... what would a silly like who would get a shoe this week on only a game when we get a signature she's for women\nPlus a look back at the record\nThe beach boys states ... ...\nLive from NPR News in Washington a joyous night or after two weeks of contradictory statements Saudi Arabia has submitted that the journalist ... was killed inside its consulate in Istanbul the BBC's Martin patient says more\nSaudi Arabia claims off falling broke out between ... and the people waiting for them inside the ... which led to his death\nBut many will question Saudi Arabia's ration of veins which suggests this was some kind of kidnapping operation that went wrong that's in stark contrast to Turkish media reports which they missed the show she was tortured march towards a ...\nSome us lawmakers are skeptical of Saudi Arabia's explanation of what happened to ... the President Trump says the announcement that suspects are in custody is a good first step and that he will work with Congress on a U.S response\nPresident Trump spoke to reporters in Arizona where he held a campaign rally last night from member station cages ISI in Phoenix Jimmy Jenkins reports of president returned to many of us anti immigration talking points from the twenty sixteen campaign\nDespite saying his campaign was doing well with Hispanic Americans Trump spent a good portion of the rally drumming up fears about immigration from Latin America looting several times tuna legit impending migrant crisis that threatened to overtake the southern border the president warned that his opponents were pushing a radical immigration agenda that would bankrupt the country\nDemocrats want to give a legal alley is free welfare free health care\nFrom hers the capacity crowd in an airport hangar it used to Phoenix to vote warning that his accomplishments could be done if Democrats take the house of representatives for NPR News I'm Jimmy Jenkins in Phoenix\nResidents of Guatemala and Honduras due to meet today to discuss a migrant caravan heading toward the U.S hundreds camped overnight on her fridge separating Guatemala Mexico yesterday there were clashes with police on the Mexican side of the bridge\nAttorney general Jeff Sessions says he as opposed to federal oversight of Chicago's police department from member station WBFO easy Shannon Heffernan reports\nUnder the Obama administration the U.S department of justice released a report on Chicago policing it's under views and bias and recommend it federal court oversight Chicago police Chicago eventually agreed but now under the Trump Administration the Justice Department says that's a bad idea\nSpeaking in Chicago sessions says police can't be micromanage Chicago\nPolice are not the frog struggle police or the solution for all\nThe American civil liberties union of Illinois critique Sessions' remarks and said he creates the incorrect impression that the only answer to crime is unconstitutional practices by police for NPR News I'm Shannon Heffernan in Chicago\nAnd you're listening to NPR News\nIt's seven and for good morning I'm Sally her sticking sing with New Hampshire public radio news [noise]\nIndustrialists out that climate change conference in Portsmouth said on friday that the free market should take the lead on tackling climate change event was organized by citizens count a nonpartisan voter education group founded by a New Hampshire businessmen\nSpeakers included Charles McConnell the fossil fuel industry veteran who worked on energy policy and the Obama administration he says government should replace renewable energy subsidies with funding for research to make those fields cheaper than coal or gas\nIndustry nice steak isn't this needs to be\nIn some ways reward incentivize and also more than encouraged\nTo go down that road\nOther speakers said climate change likely won't be as bad as mainstream science projects and therefore it's not worth a lot of new spending some of the audience felt the event was one sided and promoted dangerous climate change skepticism\nIs official overseeing the New England electric grid says the region is threatened with winter power shortages due to potential shortages of fuel to run generating facilities\nGordon van really a biased so New England says the region has sufficient generating capacity to meet the winter demand for electricity but the natural gas pipelines that bring fuel to the region are not sufficient to guarantee natural gas power plants can stay on line\nIn many cases when it's cold producers must get power from plants that burn coal and oil and many of those are being taken out of service men really who spoke Thursday in South Burlington, Vermont says just building more pipelines isn't practical so the industry is being forced to find new ways to ensure there is sufficient capacity\nIn sports the red Sox heads of the world series looking every bit like the team that led the majors with a hundred eight wins the season\nAfter eliminating the defending champion Houston Astros and the American league championship series the red Sox we'll wait to see whether they'll play the Los Angeles Dodgers or Milwaukee Brewers in the world series opener Tuesday night at Fenway Park is an HP our news\nSupport for NPR comes from NPR stations other contributors include the corporation for public broadcasting and the state of John crock who's ... serves as an enduring investment in the future of public radio support and the Robert Wood Johnson Foundation and R. W. J. F. dot org\nSupport for an H. P. R. comes from you our listeners and from my community a proud tradition for senior living in Nashua silverstone living life planned community information at ...\nSunny today with high fifties across the state temps overnight unloaded mid forties this was an HBO or\n[noise]\nThis is only a game I'm Carrying given Matthew ... has his own signature basketball shoe and if you don't know who he is you're not alone he's a veteran guard for the Milwaukee box he's never made an all star team his career scoring average is six points per game he\nIsn't even in the box starting line up but he has his own shoe the peak deli ones\nNow that you develop a dove and not withstanding a signature issue deals says to a player you've made it about twenty active NBA players wear shoes designed especially for them and sold to the public in the WNBA the number of players would signature issues is zero\nBut it wasn't always like this only against Matthew stock has the story\n... is the head women's basketball coach at the University of South Carolina she won three Olympic gold medals and as one of the greatest WNBA players of all time and when she was a kid basketball shoes for everything\nAnd I grew up in the projects in North Philly I grew up wearing a lot of different sneakers I didn't care what I look like for my ankles that I had to have the new is the best to seek it out their\nDaughter members wearing Charles Barkley signature line she wasn't much of a Jordan fan in any case ... shoes\nEverybody that I play with were males that's what I wore that's what I was comfortable wearing and I just really didn't know difference\nBasketball shoes for women didn't exist when John was growing up\nBut before long that changed\nIn the summer of Nineteen Ninety six dawn and team usa won their first gold medal at the Olympic Games in Atlanta\nWomen's basketball was pretty much at an all time high\nThe American basketball league or a B L had been found it a year earlier the WNBA followed shortly after and it's the countries are women's basketball gaining popularity Nike store groundbreaking business opportunity\nTo me now later in life I feel that it was more special an amazing that it felt at the time\nMoney Gerber has been a senior designer and Nike since Nineteen Ninety two\nIn the lead up to the Ninety six Olympics Shia Nike partnered with team usa star Cheryl swoops to design a signature basketball shoe by then Nike had released ten Michael Jordan signature issues in the air Jordan line several other NBA players have their own models to but in the women's game\nCheryl groups issue would be the first and for Gerber that meant rethinking with basketball shoes could be\nAt the time basketball shoes were really overbuilt\nCheryl that giant like some of these guys are so how could I design issue that was less shoe and more\nGerber watcher oh play at the team usa training camp taking notes on how she moved on the court she even joined sure on a trip to her home town of loving Texas to get to know her outside of basketball\n... airfield fifty thousand square foot skate and bike park offering public concessions lessons parties in a full service pro shop information that right airfields dot com and northeast delta dental for individual and family dental plans plan choices available at my oral health dot com\nThis is on the media um burglary\n\nSupport for only a game comes from Geico offering auto insurance coverage for cars trucks or SUVs\nAnd providing twenty four seven customer service more information on auto insurance said Geico dot com or one eight hundred nine four seven auto\nAnd linguistic ... three sixty with news in slow Spanish news and slow French and use in slow German programs weekly language learning shows was discussion of current events more at news in slow dot com news in slow language learning through current events\nI'm Carrying given and it's time for three stories you should know we're going to start this week by analyzing a new scientific study I'm not joking but I promise it'll be fun I'm joined by Michael ... of the athletic and by Nora prints the audience at the Boston Globe welcome back to you both make severe thank you Karen\n[noise] so I don't normally follow the latest research out of the Aspen Institute but this week our friend Patrick ... treated out an interesting report and they study the dangers and benefits of high school sports and no surprise football was ranked at the very worst for causing injuries\nBut it was also ranked number two for what they called psycho social benefits\nAnd football would have been ranked number one for psycho social benefits if not for the fact that football players are also more likely to engage in risky behaviors like excessive drinking but that to me seems like a a self selecting kind of thing like\nKids who are going to be attracted to risky behaviors are also going to be attracted to risky sport of football\nSo this really sums up to me the issue that we've been grappling with for about the past decade which is easy\nDress without turning off the kids that need it the most and those are the kids who are attracted to the dangers of football and I'm all questions and answers to ... what do you think\nSo first of all my perspective on football is that kids don't need to play in high school high school football scares me a ... just because all the research shows that when your brain is younger that's when it's the most vulnerable and the thing that I thought looking at the study was just that\nThe psycho social benefit seemed more related to playing a team sport mhm than playing football specifically so even as a football writer I looked at it and thought well yeah that's great but don't you think it's maybe just being outside and being on a team and making friends\nYeah well I I don't know if I have an issue at high school football as much as I Do like pop Warner like really little kids but I think that you know at a high school level you know that's kind of like those awkward years where you're trying to find yourself the teams are usually pretty big and so you're a part of a really large community\nAnd you have the whole town behind you know from my years from cover in high school football I Know just what that sport can do to just bring people together\nAnd to also raise a self esteem of the athletes to perform because you've got eleven guys saw it on the field has one\nIf you play high school basketball the gym maybe Mt\nIf you play um cross country for sure you're really by yourself 'cause there's no one there to cheer you even when you cross the finish line I Know that run across country [laughter] but but football I can totally understand why it's viewed positively by the participants that doesn't make it any less dangerous\nYeah I mean we were you brought up youth football and certainly the solution there has been just suggest that kids under fourteen just plays flag football and sad that they don't really need\nTo call 'em in there that yeah and I'm totally in Britain far and yeah yeah yeah and you know\nTom rainy and the Manning's none of them play tackle football until they they were a little bit older\nBut what was interesting to me in this study because I I have thought hey what if we just need high school football flag football like with with the with the community still show up would you still get those hundred kids who are all working towards the same thing\nAnd this study really made me question my own sort of point of view on that because then I Wonder these kids who are\nLooking for a risky behavior [laughter] I'm not sure they're going to find it in flag football so it's a problem there's definitely more work to do\nMichael a basketball we need some basketball help us out [laughter]\nWe have our latest effort to fix an issue for college basketball at all boys the obvious solution pain\n[laughter] he did the G League\nIs are now offering alternative to the in sees one and done rule by providing the ultimate incentive to have a leap prospect from high school Eighteen years old ... before the draft to come and play for a hundred and twenty five thousand dollars a year\nYou choose a lot of money especially when you consider that this is more than the Mac salary for WMBA player and that's another topic that we can discuss later but the best part about the select contracts with the league is going to offer is that the players are able to sell their likeness but assigned with an agent\nAnd but there is a risk to this\nBeing you're playing in the ... so you're playing with grown men so you may not be able to establish yourself or separate yourself\nFrom your perspective as you say in college when you're playing against guys are on age also the G League does not provide the platform that ... billion dollar industry like the NCAA will while I applaud the Julie for trying to provide an alternative I think that the NCAA\nCould actually benefit their athletes in especially the elite basketball players but just allowing them to have the ability of the hiring agent to sell their legs\nCould resolve the issue of paying the players I just wonder can the NCAA ever just step up and just solve its own problem\nWell so I Would say that no I have absolutely no confidence in the end of all I\nJust sort of [laughter] one day waking up and deciding like oh we're going to do the right thing cool that\nSaid probably the best possible outcome from this right or at least as I see it would be that the threat of\nElite high school players going to the ... league instead of being one and done would be enough to push the NC double A. to reform they're not going to do it on their own because they just feel like it [laughter] uh I mean I think the only way it works and this seems like a an uphill battle is is\nThe alternative is a good enough one I can actually be a source of real pressure on the inside of light which would be the first time that there's an alternative that's been able to do by\nIf guys are actually getting drafted out of the G League into those top spots then I think I could work but Michael you promised that we could talk about the WNBA issue so I'm going to hold you to that WNBA players get paid less than these tough high schoolers would\nI didn't immediately make that connection like\nHey this is really prove that something is a little off here and it really shows how ingrained this idea is that men male athletes should always get paid more than female athletes\nAnd no one is suggesting that WNBA players should get paid as much as NBA players you know what I Do you know the bird has said that there's a bias that exists here and I really think the idea of\nMinor league players in a league that hasn't even like they don't they're not even on to not only ...\nAnd the fact that they would maybe Maureen as a better television do you eat\nRight right I mean if we need a stronger indication that there is a bias I don't think we'd find one a minute [laughter]\nI totally agree I think it's really unfair Dennis Ross is my favorite basketball player like male or female like I Love seeing her play and then you have this deal that sort of like a slap in the face of sort of reminds you that yeah in this country we we reward mill um athletes much more significantly than we do females\nWell we ... I mean the percentage of total revenue that goes to player salaries and the WMBA is significantly lower than eight to twenty five percent right and center ... sort of ... percent\nSo as it is only a game tradition we save our most important topic for the last ... who\nYou yeah I think this is going to mark the end of my tenure as the Boston Globe patriots supporter because I'm sure that I Am just say is from a column for the spotlight investigative team I wrote a piece recently about touchdown and big play celebrations and it was kind of a something that\nThe NFL has been letting players do a little bit more I Love when guys get really creative about it I went around and and did a little digging in the patriots locker room and pulled a bunch of guys to come up with kind of a grading system ah how to look at a celebration and decide if it's up to snuff\nAnd I have a confession for you guys because\nWhat all the patriots players said was that you just can't celebrate when you're losing and this that actually happened in the cold got an interception a couple of weeks ago in a game and they were down by two scores and they started\nCelebrating like during the stand there you know because the ads on the cameras on them and obviously on TV you see the score\nAnd that's coming up and just about twenty minutes here on New Hampshire public radio\nSupport for an H. P. R. comes from you our listeners and from conquered farmers' market on Capitol street offering a variety of local foods and products Saturdays eight thirty to noon through October Facebook dot com slash conquered farmers' market and H\nMassachusetts General hospital using research to develop treatments for complex conditions all to help their patients get back to their lives messed general ... and care and Vermont Academy a boarding and de high school with three hundred fifty seat theater hosting an open house Saturday October twenty seventh Vermont Academy dot org slash open house [noise]\nSupport for only a game comes from the listeners have W. B. U. R. Boston and your NPR station\nFrom Loomis sales and investment partner workings navigate challenging financial markets around the globe and offering investment strategies to clients worldwide since Nineteen twenty six learn more Loomis sales dot com\nAnd posters Smith\nBritain posters on wrinkle resistant full double fabric that transports flat for conference presentations poster Smith provide that service to research communities worldwide\nLearn more at posters Smith dot com\nI'm Carrying given next week on only a game from ... to an Austrian soccer player who may or may not have stood up to the Nazis well look at athletes who stand or sit or Neal in protest\nBut now it's time for this week's news with Charlie Pierce hey Charlie yarn it's normal for us to start in the segment by talking about USA Gymnastics but these are not normal times\nWe're going to take this week's developments one by one starting with the arrest on Wednesday as Steve\nSupport for any ... life's dream comes from you our listeners and from Congress regional visiting nurse association\nA home health in hospice agency serving people of all ages and more than forty one communities discover how the conquered regional DNA can help you remain independent in your home and live life to the fullest\nDid it the RV an A. dot org\nAccess has indicted penny for allegedly destroying or hiding documents relating to Dr Larry Nassar who has been sentenced to more than a hundred years in prison for sexually abusing athletes and I really really want to see what's in those missing document\nYou as does everyone else including I suspect someone Nassar's victims I think one way or another either a disguised trial er into discovery the eight zillion lawsuits that are going to be filed against usa ... we're going to see what's in the documents and it's not going to be great\n[noise] so let's talk about Mary Bono she was an which I never thought I Would do it again [laughter]\nRight right well she was announced\nLast friday as USA Gymnastics new interim president by Tuesday she had resigned there were two major issues first up\nDoes the fact that means bono worked for a law firm that also represented Larry Nassar disqualify her from running USA Gymnastics yes next question All right next question [laughter] the second issue to me is a bit more complicated\nIn September a month before she got the job Mary Bono treated image and in it she was using a marker blackout the swoosh on her Gulf shoes and as anti Colin Kaepernick tweets go this one was pretty tame\nI might disagree with her point of view but I respect her right to express it\nYeah well first of all I missed the ... in which Mary Bono became qualified to run you said your true second of all she managed to alienate both Nike and Simone Biles when you've alienated the primary corporate sugar daddy and the face of your sport it's\nReally time to go and it's pretty convincing evidence that you shouldn't have been there in the first\nPlace I mean what can USA Gymnastics do at this point to at all bring anybody back\nThe Olympics will bring people back you will see what will probably be a Nike fuel run up\nTo the next Olympics where whoever represents the United states in God Knows Simone Biles is going to be one of them are going to be the redemption team they're going to be the ones who bring honesty and non criminal behavior back to women's gymnastics and it will sell because the Olympics will help sell\nCharlie you and I have been saying for a while that the best thing that the NFL could do regarding players who choose to Neal\nIs absolutely nothing and they seem to have listened to us are you surprised no because we're smart Karen and more people should listen to [laughter]\nNo I mean the basic probably NFL had with the whole anthem thing was they got three or four owners who were off the reservation out of Jerry Jones\nBombing narrowed down in Houston uh Jerry Richardson and and kill and those guys are print pretty much marginalize if they didn't depart the league entirely white churches and was cooler heads prevail\nOr they realize that probably forty percent of their fans are at the beer stand during the anthem anyway and the ones that you know are offended by this they can afford to offend what I really love\nAbout this story is that they actually came up with actual data that showed that tweets made by the president didn't try fans off to football what turned fans off the football was those owners speaking up right\nAnd finally Charlie I Want to draw your attention she the Kenya Iceland because the country only has enough ice hockey players to field one team they had never played a game against an opponent so why has this team made international news\nUh first of all I Want to Jersey Jersey so bad [laughter] apparently Sidney Crosby and Nathan McKinnon help you\nTo play against the team of firefighters\nAnd then Crosby and McCain and played for the gang [laughter] ... which we did the last story on our on our segment every week is usually a funny one this isn't a funny one this is an author and McKinney even said hey you can't really put out which is pretty good considering most of them didn't skate before last year\nThere was a video because of course it's sponsored by a coffee company and my favorite but it's one of the Kenyan players reaches out and like pot Sidney Crosby on the face and says is it really you know [laughter]\nI've always been and you can sell hockey anywhere if you give it a chance you could sell hockey in Kenya I Hope the lions practice very hard and are in the next Olympics because they will be the biggest thing there\nYou can find the sports writing a Charlie Pierce at Sports Illustrated from time to time and he joins us each week here on who may again thanks Charlie thanks [noise]\n\nIn the fall of Nineteen sixty three the beach boys celebrated a national hero just two months earlier Craig Breedlove and the jet engine powered spirit of America\nHad set a new land speed record\nBut ... didn't stop there only gain scary while like has the story [noise]\nOn October\nFifteen Nineteen sixty four Craig Breedlove hurdles La Crosse Utah's Bonneville salt flats he reached a top speed of five hundred twenty six miles per hour\n[laughter]\nFiedler had just surpassed his own land speed record but things began to go wrong as he tried to slow down the first problem was with the emergency parachute\nTo shoot broke off and I didn't know that that it happened\nBut he did know about some of the other things that we're going wrong the steering was malfunctioning and then there were the brakes\nHe tries to breaks\nThey melt Dutch writer Samuel Hawley\nHe has no breaks he's going five hundred miles an hour he's running out of course and he's got no way to stop\nSo I came down the course and went through the place that I'm supposed to be stopped\nWent through is understatement in the extreme\nSo I was still traveling a good four hundred miles an hour\nCrew members gave chase in cars but their top speeds were just Seventy or eighty miles per hour they knew spirit of America wouldn't stop before it reached a construction site at the edge of the highway\nI had to make it over a wooden bridge that the bill and ended up knocking down a telephone pole by highway eighty and went over and embankment out at about two hundred twenty miles an hour and the car went airborne\nWouldn't tell me if he was terrified when that happened he's too logical into analytical to portray emotion but\nOf America as it launched skyward wouldn't you be and wouldn't that make you rethink your career choice [noise]", "year": "2018", "show_name": "Only a Game", "city": "Keene", "day": "20"}