{"month": "10", "state": "CO", "station": "KRCC", "content": "Time favorites to new discoveries you didn't even know what you were looking for ... I Hope you'll join me this weekend for killer show with comedian taught Barry ... Diana Gordon and the one the only ... turn on tune in and ... [noise]\nLive from here is coming up next year I'm Ninety One point five here see see it's a minute before ten o'clock currently fifty degrees in Colorado Springs\nYou're listening to southern Colorado's NPR station K. R. C. C. E. N. K. R. C. C. H. D. Colorado Springs Casey will hunter KCBS dark ville and K W CCF em woodland park streaming online uh K. R. C. C. dot org\nSunny skies day with higher around sixty nine\n[noise]\nFrom American media [noise]\n\nAnd\nFrom here in the Senate performing thing\n\nI'm here with musical director Mike Elizondo admitted\nIs a nice day former on key is our heart rate zone little were the elder John for ... and April ...\n\nDinner tonight comedian John Barry is here [noise]\nThey're just waiting\n\nFortified carbon I watch offering secure data production solutions for businesses including automatic back up for servers advanced and point protection higher bail ability and disaster recovery solutions and automated data migration learn more and ...\nJoshua recovery solutions and automated data migration learn more at ... dot com um life from years produced by American public media um\n[noise] [noise]\nBring up a tall tales now [noise]\nBut we told by the fire is the guy slide bumble like a diver [noise]\nGoats who like owls in the long nights when I did not look over my shoulder\nAnimal just lurk in the ... the whole under the stairs where the gas meters check [noise]\nThat we went to singing Carol swans [noise]\nWhen there wasn't the shaving of among to light the flying street [noise]\nAt the end of a long road was a drive to lead to a large house in which stumbled up the darkness the drive that night\nEach one of us afraid each one holding a stone in his hand\nAnd all of us to brave to say a word\nThe wind through the trees made noises as of old\nUnpleasant and maybe Web footed men we using\nCaves we reached the black book the house [noise]\nWe begin to sing our voices high and seemingly\nDistant in the leaves felt in darkness round the house that was occupied by\nAnd we begin to sing our voices high and seemingly distant in the leaves felt darkness round the house that was occupied by\nWe still close together\nNear the door to door\n\n\nAnd she did\nDry voice like the voice of someone who\nHas not spoken for a long time and joined are singing a small dry\n... shells voice from the other side of the door a small\nDr voice do the keyhole [noise]\n\n\nShe does and\nWho were students just around so\n\nIt's that time of year y'all [noise]\n\nThis story time [noise]\nThat one was from Mr Dylan Thomas with a little help from guinea ... but [noise]\nYou know my my very favorite to the true stories that we tell each other in small apple jak fuel groups about our own\nParanormal encounters I've got one for yeah if you promise not to tell anyone [noise] this is this is one hundred percent true\nAnd I I'm not a ghost guy just so you know uh I remember this had happened\nYesterday even though it's it's been it's been about Seventeen years almost exactly a okay there we go\nWhat\nDylan Thomas gets creepy improv but I don't know [noise]\n\nIt is creepy improv but I don't [noise]\n\nI'm driving home from dinner with my girlfriend on a dark chilly fall night in Boulder, Colorado\nWe stopped at a stop sign as one does [noise]\nBut when I started pulling forward my girlfriend gas violently and I mean like\nI slammed on the brakes and a split second later out of nowhere this guy with an absolutely crazy look in his eyes comes barreling past us on a bike I mean maybe ten feet in front of the car\nIf I hadn't thought the car I Would have killed him for sure I hadn't ... the guard would've killed that guy and if my girlfriend hadn't gasped I wouldn't stop the car\nSo here's the creepy part [noise]\nHere's the creepy part as soon as I taught my breath I turned to my girlfriend and I said what in the ever living hell just happened how did you how did you see that guy I Can't see a damn thing that isn't right in front of the headlights\nShe was shaking white as a she still just looking straight ahead and said almost in a whisper\nYou mean you you didn't hear that I I didn't see anything\nI heard a crash I heard a crush on an\nAwful awful screen\nBut you know as God is my when I was\nThere was no crash there was no screen [noise]\nI Know right [noise] we got a hell of a show for you tonight Jeff Tweedy Diana border\n[noise]\n[noise]\nSo my family has three ghost stories that likes to tell around the fire this time of year you just heard one of them that one's mine and again seriously\nOne hundred percent true or the other two you\nKnow we tell our our in this week's brand new song a which I'd like to send out to the memory of my grandma Barbara McKay\nThat we tell our or in this week's brand new song a which I'd like to send out to the memory of my grandma Barbara McKay who taught me that there's more to death\nThan anybody knows\n\nBiography all their goal in the spring ... scary sign up for candy corn ... and parents\nDon't worry we have a black on all the candy corn now breastfeeding\n[noise] but\nWhen we do yes because some people think it's okay\nTo look at it while they're read\n[noise] I Do not look at Cornell I I wouldn't even know where to find it Patty you're lying dying\nEvery where the\nBut do they\n[noise] they actually do they are due in three weeks or you will the issue to find [noise] that goes for you to ... you know what are you saying well you can see the shades of gray checked out where\nI'm starting to worry about my reputation library ours are still six eight and still six and you should really go straight home right after that no I don't hate the clubs anymore Deb I told you get a\nLittle bit [noise]\n\nOn doors started about this like a musical director sent\nMe her new ... which is called the hard way about a month ago and I ... I reached out the singing is so good the songs are so good so fresh\nAnd yet there's also something familiar about them turns out I've been humming her songs for quite some time and so have you she's written hits for and with such artist as Mary J barge\nJennifer Lopez and I'm a a write the queen of America beyond ...\nAnd with such artist as Mary J barge Jennifer Lopez and I'm a All right the queen of America will be here to perform some songs from the new ... pi the hard way ladies and gentlemen please make welcome Diana Gordon [noise]\n\n... ...\n... ... and go to all of that and does the same in a blue moon and\nJews and the other end of ... and again in a mother in law loves during a bullet through all ... all of them do I go home and got a story would I Do that in in a global rebellion well no ...\nTake a trip to the moon to cook the body remind on one hand on\nAny other oh no holiday remind him\nShe can dance all night they called me in the long run that woman she's living in an adult lay around baby she's a ...\nA guy\nI Know you may not be wrong wrong wrong\n\nWell we'll know Jack of all trades for the money on the counter where um she the Bob ... Braves though don't you let\nDown well\nKnown and got him bingo on a trip and she ... well that woman she's a dangerous so how they like to do that and that\nNow and again you know [noise]\nAm I wrong wrong\nAnd\nKnow from a guy\n\n[noise]\nDon't you go home well let me\nKnow my\nYou know\nOn Jews and I was\nOut of the day Joe our nice yeah\nEven know what else\nThank you don't know\nGet your own\n\nDon't you know the\nOh you want a good job [noise]\nMe\nDidn't go\n[noise]\n[noise]\n\n\nA quick worried about that song so easy it's called pure not that hard it's called pure and I wrote that song after finding my missing brother who he was missing for sixteen years\nAnd I moved from New York to California and one day I was just coming home from the flea market and there he was on the street homeless sitting on a box so I wrote that from my brother and that's just a little personal pure is about my brothers and sisters so [noise]\nSitting on a bike so I read that from my brother and that's just a little personal periods about my brothers and sisters so [noise]\nWhat's\nThe process where you are going through an experience like that and putting it into into song um\nYou just feel everything everything is feeling everything is a motion it was very quick I wrote it in my basement in a very safe environment and yeah yeah like built out the garage\nUm yeah I mean I wondered where he was for so long and I think it was just really freeing for me to know it wasn't my fault\nAnd so I it was easy and we're glad you did it Diana Gordon [noise]\nWhy do we\nKnow jeans cat\nAs a bulldog skiing live in a way for me in the way we need to know the\nAge of ...\n\n... they had a hard time and\nThen\nAsk so what's your name\n\nThey\n\n\n\nWant to\nYou again\nYou know you [noise]\n\n\nAnd then that's been a good job\nAlways do we give us when the kids I mean the\nDo\nYou want to\n\nThe um [noise]\n\nWell I\nDon't know we'll do the [noise]\nFor anyone [noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\nI don't want to travel farther comedian come papa in the segment we call our cheese in America Tom are you there\nI'm here Chris on behalf of live from here I'm resuming my journey across the country sharing the good stories of our fellow Americans\nThis week I was lucky enough to experience the iconic New York on them as I rolled into New York city there's something magical about fall in Manhattan It's that sweet spot between the summer humidity and the icy winter when you can actually walk around town\nFeel good and things don't smell so bad\nIt was late afternoon when I checked into my hotel and dropped off my bags New York is a great walking city and nothing encourages that more than a hotel room the size of a pine cone [noise]\nThe streets were colorful as always and Halloween has hit the city have you ever complimented someone's costume and realized he was just a New Yorker wears a milk carton\nIs a hat [noise] I have\nWalked into Washington Square park and sat on a bench near a dog run there is nothing crazier than in New York dog park\nThese are not dogs that are used to the freedom of backyards and rolling hills these or pass that have been locked indoors for hours drinking coffee trying not to be on the New York post\nWhen they finally get to the dog park they lose their minds\nI sat next to one of the dog owners musician named Dave even though he was in sweat pants has long hair and cool Jean jacket said he was a rocker his dog look cool to he was a mutt named Rocco with a spike the collar and an upper lip and a permanent ...\nDavid lived in the village with Rocco his whole adult life and makes a living now in the studio musician he was lamenting about how the city's changed\nThere's no scene for the young bands any more so than New York used to be a city of artists and weird of who we are too strange delivering their hometown but now there's nothing left at the weirdos can afford and\nHe said the one thing that will never change is the amazing diversity in the city there are people from all around the world he said\nHe said the one thing that will never change is the amazing diversity in the city\nThere are people from all around the world he said just look at this dog park Rocco just a crazy mud and here he is hanging with three pug a purebred German Shepherd and the French poodle who's getting a little too friendly with her nose\nList as New York\nAfter meeting some friends were dinner I headed back towards the hotel through the west village on a normal night's this area's hopping but as Halloween comes near it's truly outrageous but bars were in full force and people were dressed up in costumes roaming the streets\nTo me it's the adults in costume gr the scariest part of Halloween\nAt least one child dresses up like a ninja turtle chances are he won't be drunk and hitting on your girlfriend\n[noise]\nAs I headed down McDougal street I was approached by what can only be described as a large dirty humor his faith painful smudge is had had a muddy footprint on it he was sweating and confused\nHe grabbed my arm and asked if I knew where his friends where I felt bad for the summer but I had to laugh what kinds of friends was looking for where they merged two did they live in a magical lamb should I Try and return them to his hollowed out tree\n[laughter] and I felt bad for him so I took his big white hand in mine and walking down the street have you ever gotten looks from strangers on the street and you knew without a doubt they thought you in the summer for lovers [noise]\nI [noise]\nTry to reach racist steps and we saw a lot of people but no ... that's when he got desperate and decided to climb onto a mailbox for a better view the postal department might be slow they may not run their post offices that well but one thing they did right was designing their mailboxes\nThey created a square bottom that makes it seem as if climbing it would be easy but when you get to that rounded top you quickly find out\nIt's impossible to stand on especially if you're drunk desperate and dress like a blue cartoon character [noise] his effort was valiant he wasn't falling off but he wasn't going up either he was clinging to the side frozen like uh\nHis effort was valley and he wasn't falling off but he wasn't going up either he was clinging to the side frozen like a very koala there [noise]\nI have never heard a live ... I couldn't tell you what kind of noise they made this one let out little half ... runs that broke my heart\nJust as I was about to help three others ... came running up and grabbed him\nHis mom lost brothers housing them and knocked him to the ground in a pile of blue and white for\nI felt as if I was responsible for this story book ending and I wandered away have you ever tried to cross the street and found yourself tackled by a gaggle of giant beer so stuffed animals\nThey insisted that come with them and get some pizza before they caught the train as a bank you we went to Joe is on ... street and sixth avenue it's a tiny shop with one table a couple stools at the window most people just by through the crowd and take their slice outside\nI was worried about causing a scene by walking in with these murders\nBut as soon as we entered I realized it was not going to be a problem it turns out that at midnight on friday before Halloween in the west village there are a lot of people in costume thinking the same thing\nThere was a sexy devil a hotdog Michael Jackson to clowns from it and one guy who looked like a sea captain who turned out not to be in costume at all [noise]\nI'm smiling and not as if I Know what he's talking about but the truth is I don't care [noise]\nNow watch my should be young children and passively attractive husband walk towards being slow motion because we are all Christian and we're all laughing\nNow you know that I Am a Christian parents who lab [noise]\nBut I can also be Syria because now I'm In a business off as there are papers in a telephone on a desk in front of me\n[noise] but I can also be Syria because now I Am in a business out and there are papers and a telephone on a desk in front of me if you enjoy paper or telephones that are plugged into a wall and [noise]\nYou were going to want to vote for me\nJust remember if you want things like changing or changing but also want\nEverything to exactly the same I Am clearly the better choice to represent here [noise]\nSee now I have a hard hat on [noise]\nBuilding some saying I'm candidate and I approve this message paid for by\nAfter\nA short intermission you are listening to live from here coming ... from the center for performing arts center\n[noise]\nLove from here is supported by the S P certified financial planner professionally trained in providing holistic financial planning in their client's best interest\nFor short and long term goals from starting a business to saving for college to retirement let's make a blend dot org and by ... meal prep service delivering fresh gourmet dinner kids that are table ready and Fifteen minutes would just one band\nGobbled up to ... do you spend less time shopping more time with family learned more global dot com slash live from here\nAnd buy home advisor measure homeowners with home improvement professionals for a variety of home projects for minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd by the real price offering a strategic investing approach that examines investment opportunities first and institutions advisors employers end individuals' choose the rope price he wrote Bryce invested with confidence\nAnd by Roger creating modern photo decor and gifts by printing photos directly on glass\nIn a ... image frame and violent all in one hand made and carbon neutral Florida factories\nAnd learn more at ... dot com slash law\nAnd by progressive insurance offering a way to buy a home insurance with their home quote explored to over coastal\nDot com slash slash\nAnd progressive insurance offering a way to buy health insurance at their home quote explored to cut some quotes and rates are available online learn more and progressive dot com or one eight hundred progressive Latin progress\nAnd my mother goose online test prep for the ACT that's designed to improve scores students can get video lessons practiced questions expert support on line prep smart go far and enjoy the ride at ... dot com slash ACT\nThey say video killed the radio start but I think the Internet has really helping\nVisit live from here dot org to learn more about our upcoming shows and check out video clips from like show and other recent favorites Lindsay Buckingham and the war and treaty you can also join us for live video streams from the town hall throughout in December with guests like power on the east and the whole pack\nAll that and more at life from here dot org fly from here is produced by American public media\nMore and more people are getting their news on mobile devices and through social media in Ninety One point science he ... he doesn't have to be any different missed this morning and you can find it on our website getting out of your car don't want to keep listening to all things considered download the mobile apps\nNeed info on a local story impacting your community followers on Twitter feel like passing along that NPR story my guest unsafe to news never stop neither do we Ninety One point five pay our CPA named\nRandy price I'm the owner of Rocky Mountain restaurant group there was a law to address to the city the outdoor recreational opportunities grade schools great people you know a good business climate and\nCare cc was natural fit for us we started in two thousand and two is also Robin rocker imminent we've grown to twelve locations up and down the front range in the last Fifteen Years and feel like it's been a great partnership to find out how to sponsor were Ninety One point five seven nine four seven three for eight zero one you'll be glad you did\nNPR on Ninety One point five K. R. C. C. is supported locally by Ninety One point five or see see underwriters who realized the benefit of reaching Ninety One point five K. R. C. C. listeners for more info on your business underwriting was gay or CDC calls seven one nine four seven three for eight zero one\nThis is southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs ISI see law hunter the CCS dark for all and K W CCF them woodland park\nCasey she structural n K W CCF them woodland park [noise]\nCenter for performing arts in Lincoln, Nebraska welcome back from here with the\n[noise] and\nNow every other political ad after\nThat other candidate wants to take away the rights and freedoms of the good legal citizens of here [noise] I'm not going to let her just look at this quote that other candidates said about something totally unrelated [noise]\nIt looks like it's ripped from the headlines just like that other candidate Blue Ridge stuff out of your hands like freedom Andrew gas powered automobile [noise]\nNow look at this footage of that other candidate with a person who does it look like you know why she's smiling water they up to [laughter] to remind you what this is scary here's this dog photo of the bill of rights and it's on fire [noise]\n\nNot scared yet well here's some random B roll footage from the TV show the walking dead [noise]\nNow look at this slow motion footage of meat staring sadly had closed steel mill other candidate wants to keep it closed\nYou don't want this even though you don't really understand what a steel mill is here's me with my gun and here's me with my oil rig here's me at a football game that other candidate wants to take away bubble and give it to immigrants who want to call it soccer\nHow candidates like you I'm scared\nGood candidates for like you I'm scared of change joy promise to change things so that they never changed [noise]\nHere's my name and white letters and here's me with my white picket fence and hear the me with my family who match the letters Anderson's\nHere the slogan that's filled with let's do a job for a time that we legally can't return to\n[noise]\nI'm candidate and I believe this\nPrevent\nGrow them back to the stairs risk Diana Gordon\n[noise] [noise] [noise]\n[noise]\nThat's all on the\nA [noise]\nA little bit\n\n\n\nI'm\nUm\nYou know\n[noise]\n[noise]\nWhich Jeff maimed them birthday on Wednesday jetlag I'm a neutral milk hotel for him\nOne of my favorite living songwriters if you haven't already checked off the neutral motel record in the arrow plane over the sea\nWhere you'll hear [noise] [noise] absolutely no middle of doing it [noise]\n\nBut something kind of liked it\nAbsolutely no mandolin during [noise]\n\nAbout something kind of like the U.S [noise]\nTo\nLose ... and all the ...\nThe ... this has\n...\n... ... years has huge trial on your job and\nYou\nKnow\nHad a ball boy\nThe photo Sunday shoes to an ... to ...\nTo ... ... and\nYour heart\n\nGo bomb close male main\nSeeing moves and um\nThey just ...\nA new a new a new\nDi di di di di di ... [noise]\nI've ever had [noise] a mad\nOcean Frank Ocean birthday is tomorrow\nFrank Ocean on among leading\nMusical voices of our generation and it's easy to hear why spend on a little timer songs like that\n\n\nSounds like that's\n\n\nThe way\nControl these this guy he's standing in the same way he shows me\nPlay the game show\nThe pits that immediate Sam Stone it's the bills and learn\nHow to do a good thing to do was make you don't want to do\nThe same way she'll she'll owe me\nShowed me\nA ... oh\nOh he he\n\n\n[noise]\n[noise] happy birthday Frank Ocean\nI recall itself is worth a segment with one of the greatest musicians to ever let Joni Mitchell [noise]\n\nOn his songs lives out there her birthday is actually until November seventh\nBut we don't have a show scheduled that way and let's be honest it's always the right time to celebrate the fact that Joni Mitchell was born and my\n[noise] [noise]\nThen the woman because we are but I Know\n'cause you know they don't get the man\nThe\nBut no not enough to [noise]\n\n\nDa da\nDa da\n\n\nDa da da da\nLong\nStory short made them send me a case of so [noise]\nAnd I'm not lying [noise]\nThey send me a big old boxer so\nI Would call it an uncomfortable amount of so [noise]\nI like getting free stuff but I'd like to be able to explore other soap options\n[noise] before my eight hundred birthday [noise]\n\nWould you do get free stuff when you're in show business I get more than most people 'cause I asked for it [noise]\nI might try to open myself up tonight's or with the beard what do you do service administer you got nothing for me [noise]\n\nI live near a big CBS walked in there recently perfectly times just as the guy was asking if they sold sausages\nI was to feed into the store here you still sausages [noise] it was like ooh this might be an unexpectedly delightful trip [noise]\nTo CBS let's see how this plays out\nNo sir we don't sell sausages you don't\nHe's surprised\nThat CBS was not sell sausages\nI guess when he walked in there and saw ten different types of bed pans for sale\n[noise] like this is the place to get killed awesome\nI guess when he walked in there and saw ten different types of bed pans for sale\n[noise] like this is the place to get killed but also [noise]\nWhen he was there recently his son's life skill and shampoo prescription [noise]\nLike it'd be crazy to leave your without some trees a [noise] I memorized the sausages for that ya [noise]\n\nI did some shows in Canada I wanted to tell a joke I remember they don't have CBS there so the last second I changed to shoppers drug march joke works fine [noise] fewer people start tweeting at me actually shoppers Dr Martin does sell sausages\n[noise]\nThank you for that up day [noise]\nThank you for a fact checking a joke [noise]\n\nBefore I go I like that show chop so that's a great show for chefs compete for a ten thousand dollar first prize my favorite part about that show was none of the ... the grass what'd you can buy for ten thousand dollars [noise]\nIt was like ... what do you do if you when the ten thousand dollars I've always wanted to travel around the world for a year [noise] flying first class everywhere or you can do that for another one point three million dollars [noise] here's what you're gonna do you're gonna fly first class to Cleveland [noise]\nLike a mega bucks to Columbus [noise] fly back premium economy from Columbus [noise]\nThen you're out of money [noise]\n... what are you gonna do when the ten thousand dollars six brothers I'd love to buy the major rolls\nRoyce [noise] here's what you're going to do you're gonna buy three decent skate boards [noise] they can make a little sign up sheet in your brother's going take turns [noise]\nChef ... going to do if you when the ten thousand dollars so I think it'd be great to buy my mom a house [noise] that'd be the greatest on your mom make sweets ten thousand dollar house [noise] here's what you're going to do\nYou're gonna by yourself and upgraded food processor [noise] then the best wouldn't spoon\nThen you can make your mom some debt and she can enjoy it in the house she currently live in [noise]\nBag you very much\nShe can enjoy it and the house she currently let that [noise]\nOh you're very much for [noise]\nUm this is Jeffrey [noise]\nI like to play another song for you policing alone\n[noise]\nKnow they didn't know\nMaybe [noise]\n\n\nThis is Jeff Tweedy [noise]\n\nOr if I'm with you is drawing to a close a and a you know show full of scary stories and songs I mean that's a long while sounding quite happy is\nPretty scary yes it's sweet but it's we really haven't done yet\n[noise] I thought we\nHad a Halloween talking about our hands there\nJeff Twitter always finding a way\nAround [noise] but normally even the paranoia [noise]\nSo uh what would you been on the shows that give me some of these stories are our is it possible that we have not yet heard that\n[noise]\nBringing about [noise]\nLike I'm a man of silence there's no like\nKnow what to well [noise] we're not going to [noise] instead\nWe'll go to read a little excerpt from\n[noise] we're not going to do it [noise] and said\nWell don't read a little excerpt from the book that inspired do you know about this I learned this this week I was listening to the song thinking well maybe we'll do this I'm sure this week and as I was paying attention to the lyrics and usually it goes by I'm like yeah\nWell yes\nTotally I Will [noise]\nI Know who you are or what does that was actually looking at least I was like this is a lot like the master and margarita the Bulger cough novels anyone ... read the the master and margarita incredible incredible very few oh my goodness oh it's going to be put in scary night for you\nA master margarita McHale Boulder cough wrote it and it's a it's an amazing story a bit that Jagger was clearly reading while he well he wrote the lyrics to simply for the devil\nAnd um I like eat it it's true so in a master margarita uh the devil the devil goes to Moscow to check in on the mosquito bites see how they're doing so what's what's the big largely about the devil and okay so it's just a little bit", "show_name": "Live from Here", "year": "2018", "city": "Colorado Springs", "day": "28"}