{"month": "10", "state": "CO", "station": "KRCC", "content": "Home radio players will be there with our new music director Mike Elizondo and our news team with are now in America for bonding Tom pop on\nSaturdays and war and Sunday mornings a tune on Ninety One point\nVodka your cc there\nCall radio players will be there with our new music director Mike Elizondo and our news team with our allies in America correspondent Tom Papa don't\nSaturdays in war and Sunday mornings at ten on Ninety One point guard to your cc\nThere's so many little bites of news you get throughout your day all things considered fills in the gaps between the day's most important stories to get\nThe what's the last midterm election only about twenty percent of voters under age thirty showed up at the polls and the wives can only stay young people tend to move around a lot can still they often feel rushed invested in local election here the bigger picture on all things considered every afternoon from NPR News afternoons\nAt three thirty Ninety One point five gay or C. C.\nProgramming on Ninety One point five K. R. C. C. is supported by urban steam a craft coffee roaster in whiskey bar serving brunch every weekend until three PM with Colorado style green chili burritos crab cakes eggs Benedict creative waffles breakfast cocktails in more urban steam dot com\nThis was southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs ISI see law hunter tc of ... n T W CCF them woodland park\n[noise]\nFrom American media [noise]\n[noise]\nMy yard anger and yours truly Serena Brooke\n[noise]\nMy yard and gr than yours truly Serena Brooke learn\n\nBlind gambling I Know [noise]\n\nNight comedian in only\nEmployer owned an independent\nBaptist kept clients financial interests for since Nineteen Nineteen\nOr W bear the dot com has\nAbout carbon I offering data protection solutions for businesses including automatic back up for\nLiability and disaster recovery and made a migration learn more carbon I dot com\nBy Sierra Nevada Brewing Company\nFrancisco\n[noise]\nJust grieving breathing deeply [noise]\nFrancisco\n[noise]\nJust grieving breathing deeply [noise]\nOh I Wish you folks are home\nTo see what we're all saying right now to look deeply into your radios\nIt's a lovely side a lovely side thank you everyone here\nAnd everyone back home listening in radio land for making our dreams come true yet another year we are back [noise]\nThen ... and\nHow the new\nFriends Aerosmith to archery is hardly strictly bluegrass\n[noise] which is totally appropriate here at hardly strictly bluegrass him you know don't bark\n[noise]\nHard to put into words just how special this festival is but as my pal Steve Earle put it\nIt's the most free live music reaching the largest number of people on a yearly basis anywhere in the universe that I Know\nOf [noise] and [noise] he went on [noise] I get to see my friends we get to see our friends here it's so nice nice to see all of you like to see all the view [noise]\nAlso usually a stricter there's usually a stronger\nBut that's beside the point I Know the question on everyone's mind today is\nHow was my summer I had a great summer thank you for asking I spent a lot of time on a tour bus with my fellow punch brothers drinking might ties because they paralleled with the news cycle and I got to spend many hours\n[noise] I get to see my friends we get to see our friends here it's so nice nice to see all of you nice to see all the view [noise]\nThere's usually a stricter there's usually stricter\nBut that's beside the point I Know the question on everyone's mind today is\nHow was my summer I had a great summer a thank you for asking I spent a lot of time on a tour bus with my fellow punch brothers drinking my ties because they paralleled with the news cycle and I got to spend many a happy afternoon on a playground in Brooklyn pretending to be chase from pop patrol\nSometimes if I was lucky my son would play too\nBut I also spend a lotta time this summer thinking about a different children's television program after watching a documentary about Mr Rogers\nCalled [noise] won't you be my neighbor have you seen it\n\nWell have you stopped crying yet for all the tissues on delta flight three Ninety were not enough to soak up my chairs there were not enough to she was considered this my formal complaint twenty five thousand bonus miles deposited into my count on to cover it [noise]\n\nOn a series there's been a lot of confusion lately about what it means to be a map a real man Fred Rogers\nWas a real man [noise]\n\nI never thought I'd want my son to be more like a daytime TV star who played with puppets\nThan a Supreme Court nominee [noise]\n\nThen the bride days they'll be days\nToo when she's change going to turn this thing\nGo insane [noise]\nShe'd go daddy as\n... no\nI\nThere will be the day\nToo which is ... we're going to turn this thing\nGo away and say\nShe go ...\nBed last known\n\nI mean if you\nWhat you can and should the man he isn't\nLike we wanted to do any bleed red blue\nShe\n\nSay [noise]\n[noise]\n\n[noise]\n[noise]\nThis is a song called Rican beach\n\nThis is a song called Rican beach\n\nMan\nMan\n\nNot sure the\n\n\n[noise] [noise]\n\n\n[noise] [noise]\nWell\n\nWell I\n\nWhat does that\nTell you\nAs\nWell [noise] [noise] Mm [noise]\n\n\n\n[noise]\nMisfortune of the show and brought to you by the San Francisco board and you are in them and our new slogan prince let's go and where you\nYou love breathtaking Vince does he food and great Nightline in San Francisco is for you I'm a software engineer and father up to San Francisco is for you I'm a visual artist in a light come to San Francisco is for you and your doctor studying to become a Buddhist blame on to\nSan Francisco is definitely for you [noise]\nDo you make you feel like a weirdo just because you live a little different friends go is for you I'm a\nI'm a studio musician in transcendental meditation her boots counting on the days till November speaks like an advent calendars [noise]\nSan Francisco for you to I used the cloth diapers and claw sandwich bags\nYou know it's three yeah\nGo to the doctor because I discovered the healing heart how we're of course critical\nSan Fran for you baby hey do you want to be a part of the new economy throw on a hunting get on your computer and check us an\nIdle limited my carbon footprint and I agreed to a new test every year it's\nKind of guy who was looking for a place to live that slightly more expensive than Manhattan but as in LA\nSan Francisco and definitely for you\nDowntown and make two hundred and fifty thousand dollars a year and can't afford a studio apartment in Douma maybe Oakland is for you [noise]\nVolunteer on a computer chips are because I live off my parents to trust fund\nAnd I agreed to a new Tesla every year it's\nI'm the kind of guy who was looking for a place to live that slightly more expensive in Manhattan but as in LA [noise]\nSan Francisco and LA for yeah\nDowntown and make two hundred and fifty thousand dollars a year and can't afford a studio apartment in Selma maybe Oakland is for you [noise]\nVolunteer on ... because they live off my parents to trust fund [noise]\nSan Fran I'm a Reagan who wants to be buried in the mushroom back\nI Am an eyebrow coach mountain we made it a few friends for [noise]\nAt\nThis time a number of our stations need to take a break to tell their listeners what station they're currently listening to and what the weather is like in a place where they currently are\nWe'd like to take that opportunity to play a piece of music that comes from where we currently are this week's local break features the great Oakland band tower of power\n[noise] um [noise] what is hip [noise]\nThis week on all things considered here the latest news judge Kavanaugh gave a forceful vigorous defense what it means\nI Do wonder if the bakery is just pretty strict too many cakes and maybe they're not each getting the attention they deserved\nEven things that hard that theory and got my first paycheck screw it I'm going to get a path to listen to all things considered to hear the bigger picture every afternoon when NPR News [noise]\nAfternoons at three thirty a Ninety One point five gay or cc\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News music thanks for your generous support\nNPR on Ninety One point five key or cc is supported locally by Ninety One point five K. or cc members throughout our listening area thank you for your supportive southern Colorado's NPR station Ninety One point five years cc on line at J. or C. C. dot O. R. G.\nCare cc allowing us to bring your local stories NPR News in music thanks for your general support\nNPR Ninety One point five to your cc is supported locally by Ninety One point five K. R. C. C. members throughout our listening area thank you for your supportive southern Colorado's NPR station Ninety One point five years cc on line at J. U. R. C. C. dot O. R. G. [noise]\nAbout it\nYou think\nAnd I'll definitely be back until next time this has been Tom Papa out in America [noise]\nAnd I'll definitely be back until next time this has been Tom Papa out in America [noise]\nBut [noise] for for jobs will\nBe performing here here deliver more performing arts center October twenty fifth\nLadies and gentlemen please take a moment to join me in a welcoming for the first time as musical director the secret to wizard himself Mr Mike that was\nWas very close to my for his contribution already and we're really lucky to have him with us all\nSeason long and they have works added to announce a brand\nNew segment this season one that runs contrary to my nature is a control freak\nWe're calling it three minutes of improv three minutes of improv [noise] we have no idea what's going to happen\nBut I Know that it's one of the great pleasures of my life to play music with Mike Elizondo surfer this first installation of three minutes of improv we're at a time or for three minutes start playing and see what happens is\nWish us luck this is a beautiful place right\nLike how does it sound in your heart and had ... right now being in this place\nSince this is your first shows he's a greater or move your mouth you know\nI think you got to take this from Chris I bet you I think you got to take this one that it's it's it's all you\nAlright alright tough tough but fair I'm okay\n[noise]\n[noise]\n\nAlright alright tough tough but fair I'm okay\n[noise] [laughter]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\nThree minutes of an ... [noise]\nI Can't believe that my life including getting to do something\nLike ... for\nThe Lindsay Buckingham talk show [noise]\n\n...\nWish you all\nCan treat\nOver ... Mm\n\nAnd uh\n\nYou\n...\nCan dream\nOf ...\nDoes she know\nIn a\nHome for\nA\nTreat you on a\nOh\nGo\nOn and off for the la la\n... and ... and\n... no\nOh\nHe is he is\nHome for a you\nCan he had\nThe\nMoney you could see him\nTime know\nHave a son\nAnd\nMature new\nAnd you try and just\nCard ha\nAnd ...\n... the\nAnd ... ...\n...\n...\n\nHow are you man and have them see\nClearly yeah\nFor their bowl or\nKnow a good job I\nAnd ... ...\n... as a\n... a\nProgramming on Ninety One point five K. R. C. C. is supported\nProgramming on Ninety One point five K. R. C. C. is supported by Ninety One point five to your cc members who continue to fund the news music and other quality programming that Ninety One point five years he's he brings to southern Colorado and beyond okay or CBC dot org thank you\nThis is southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs K. E. C. C. law hunter PCS charcoal and K W CCF them woodland park\nOutside law firm here man the time and\nAnd this is about to be\n\nTo be a bad name you know that is nice\n\nOption is with the higher the\n[noise]\n\n\nRemember\nYou know that that we were\n\nThat the next song is called by them they\nThere needs to move forward and that's where we got to go no matter what [noise]\nGet back home these something\nJust wonderful and\nSo I'm hoping\nAnd somehow they\nBill more now than\nTreated as a\nWoman man\nA ... day night [noise]\n\nDon't know that\nTreated as a\nMan\nI guess I don't want to this day and I [noise]\nReally\nSaid\nSee some [noise]\nLate\n\nIn\nMy last night\nDo you [noise] [noise]\nThey really\nWant me to write\nBlank um time\nI don't know where I'm\nBe every time and I don't\nFor any day\nAny day\nWith any day now\nOoh any day\nAny day\nYour new any day now\n[noise]\n\n[noise] how about this band [noise] wishing Brittany Howard\n[noise] how about this um [noise] what's your Brittany Howard are very happy birthday\nYou know we celebrated her birth or on Wednesday other than my mother by the way happy birthday mom I Love you so much [noise] he's ... [noise]\nI've been no matter what I mean\nI Will always be a ...\nI got to meet in your once and can confirm that she is nothing short of a ray of light as one might expect upon hearing her music such a\n\nKnow how to weigh less over some of\nThem even bother me I wouldn't really be able to pull the Marlboro [noise]\nModel that is so not\nTonight I'm In my\n...\nHow to\nThe\nLow low [noise]\n...\nLittle boy that happened by\nThe\nNo\n...\nGot to be cautious\nIndia or read [noise]\nI don't publish off his birthday started out with the one and only\nJulian ... well [noise]\nTuesday [noise]\nYou know whenever I get down about the world\nI remind myself that contains a whole lot of ...\nThere's a piece of profound to music by doing a lot for any occasion including this one\nMe\nYou go\nWell why not go now does she\n\nYou go\nWell why not go now does she\n\n\nLike [noise] [noise] [noise] [noise]\n[noise]\nThat was that it's time for an instrumental this instrumental break is supported by Sierra Nevada beer crafted to be instrumental to your weekend\n[noise]\n[noise] I Would caution\nWe're not yet at the finish line this week on MORNING edition digging deeper into America's new trade deal with Canada and Mexico is the U.S MCA a win for all three countries and Congress sign off\nThe single greatest agreement ever say they'll say well you know Trump likes it therefore we're not going to\nListen to MORNING EDITION every week from NPR News weekday\nMornings beginning at five or Ninety One point five to your see see\n...\nI'm ... from uh king and you're listening to Ninety One point barn kitty our movie ...\nProgramming on Ninety One point five K. R. C. C. is supported by Ninety One point five ... summit club members who have dedicated twelve hundred dollars or more and supportive or award winning coverage of life in southern Colorado information about joining the summit club at your cc ... or\nProgramming on Ninety One point five K. R. C. C. is supported by Ninety One point five gay or cc summit club members who have dedicated twelve hundred dollars or more in support of our award winning coverage of life in southern Colorado information about joining the summit club at K. R. C. C. dot org [noise]\n[noise]\n\nCalled rush for you right now [noise]\nIt's our time is on the federal commission Cris Eldridge\nOn the guitar [noise]\nYour head on and you can check out her show on Comedy Central it very funny and the\nGolden rule drug for heroes [noise]\nWith our target is on the Federal Reserve Chris [noise]\nOn the guitar [noise]\nYou hadn't seen her on ... and you can check out her special on Comedy Central it's very funny in some\nSee how\n\nDo you do me\nThanks\nMe tell you\n\n[noise]\n[noise]\n\n[noise]\nOh\nThis is my favorite yeah\nIt's my favorite surfer he is so totally your point what's my tight skinny eighties nerd is going to grow up into that Grey's Anatomy guy\n... guys welcome back I'm Chad can I start you off with some drinks tonight\nI yes yes that will have a bottle of the house red please and thank you\nYou bet I'll get that out you guys brought up the thing\nAnna may I point out to you that you were just totally rude to my favorite server uh may I point out to you that your favorite server just call the guy is\nYou guys he said it twice I didn't even notice of course now we've been called by their entire lives we don't even hear it anymore but once you start noticing it it's\nThe men that only a few days ago my nephew for high chair who's saying it to me and my mom well what do you want from you guys Thomas and that's not funny\nBut come on women call each other guys all the time that's the point we're all too happy to be like but then with the most valuable gender those ... keeps coming back chat\nGuys house read for ya but you guys like two or three days first or oh I'm Sorry that's a little spill there okay oh man oh boy\nI thought there was a guy\nIt's fine if I'm really why don't we just order um I\nWell what are you want from you guys Thomas and that's not funny [laughter] but come on women call each other guys all the time that's the point where all too happy to be like she was in with the most valued gender is cool he's coming back chat coming\nGuys house read for ya what you guys like two or three days first oh ths outfit or that's a little spilled air Kaye how man oh boy\nThere does my father died\nMy God it's fine if I'm really why don't we just order um I\nLike the all of the book a teeny place yeah the ... for the woman and I another woman would like the ... oh\nOkay oh get that right in and again those are ... yeah\nAnd my husband's fork in my ... crushes over in magic and if you walked up to a table as dude didn't was like hey gals can I say often during their fight there would be a free gang fight they'd be like what do you just call laws\nWere not chic dude let's go pee on ... yes\n[noise] you\nThought about it you know I think it's weird that the mom carried the baby for almost a year you know read her life and childbirth and then we named the kids after the dad\nIn one of the dad do the equivalent of ...\n[noise]\nBut you write their names are on everything yeah every street I walked down is named after him in every building I Walk into is named after a man when I was born I was named after a man and if I ever marry all have the option of changing from being named after one man to be named after a different man oh\nMan James Brown was right it's a man's man's man's man's world [noise]\nIt's just three man it is it's a man's man's man's where I could have started with man's man's man's man oh you're thinking of it's a mad mad mad mad world oh I Am\nBut here's one beyond say who runs the world okay who'd win a fight between beyond saying James Brown queen bay would clean up dude don't call me too oh sorry\nThe joke you hear some fresh bread for ya but be careful the plate is hot [laughter] just like you to come on they um maybe this is to forward but ah I see you in here a lot I was I was wondering if maybe you'd like to get coffee sometime\nOh well Chad that took some over read oh I'll tell you what\nBut here's one beyond say who runs the world okay who went in a fight between beyond saying James Brown queen bay would clean up dude coming to\nThe joke you hear some fresh bread for ya but be careful to point is hot but just like you say um maybe this is to forward but ah I see you in here a lot I was I was wondering if maybe you'd like to get coffee sometime\nOh why Chad that took some ... oh I'll tell you what Chad if you have a single friends maybe we could double date with you gals\nUh I don't know what's happening right now I was just wondering if you'd like to go out and get some coffee you know what she'd like how about a little\nR. E. S. P. C. G. were not lesser then we're tired of being called guys if the inverse is considered derogatory\nSo that's a no on the coffee\nAt a girl [laughter] [noise]\n[noise]\nGotta remember at all [noise] three in the world [noise] and how we run\nY'all Lindsey\n[noise]\n... ... ... ... ...\n... yeah and he had me yeah\nIt made me see well uh-huh\n... yeah\nDon't\nKnow\nHow they will go and buy the keys", "show_name": "Live from Here", "year": "2018", "city": "Colorado Springs", "day": "06"}