{"month": "10", "state": "GA", "station": "WABE", "content": "Before asking them to build an ikea project if\nThe problems with difficult lots of people fail to solve them now volunteers became much more likely to want to demonstrate that competence through the ikea building project that participants\nWho at least temporarily had the expense of competence threat and who got a very difficult math questions tends to be more willing to build their own products so when we when we surveyed ... would you prefer to have and\nMake your product that comes to rebuild or the exact same product that comes on built and you build it yourself those who had got difficult math problems and we're feeling someone incompetent at the time seem more willing they were much more likely to want to build their product themselves and their for instance restore their sense of competence through this activity\nI mean give me the number ceremony was a big effect was a small effect I mean what happens when people feel bad compared to when they don't feel that\nSo so what you find is that about a third of the people want us to build the ikea book shelves in the control condition when they weren't made to feel bad and just never went up to about sixty percent when they were made to feel bad so so significantly larger number of people want us to do with\nThe IKEA effect an implicit eco tourism might seem at first blush to be interesting and amusing\nNot terribly significant but the more I thought about this the more I saw the potential applications just as we can be drawn to those who have the same birthday as fast or the same name as us we might also be more inclined to help people who look like us or sound like us or live near us\nLet's zero congressperson who's drafted a particular piece of legislation your commitment to that bill might outweighs importance to the public\nWell let's say you're a president who starts a war after years of investing your time and effort to prosecute that who are you may find it difficult to accept the evidence that you made a mistake\nIt's fine to gauge lovingly in the mirror and defeat invested in our own ideas but like ... discovered himself falling in love with our own reflection can come in great peril [noise]\nThis week's show was produced by Maggie Penman and ... it was edited by ... a team includes Rena Cohen ... Schmidt and run a flower\nOur engineers are ... and Jay says NPR's vice president for programming an audience development is on the ground but [noise] if you like to show check out our weekly podcast judge for hidden brain and NPR One I Choose or wherever you find\nYour podcast you can also follow the show on Facebook and Twitter and Instagram and listen to my stories on MORNING edition each week on your local public radio station I'm Shankar made that them see you next week support\nFor hidden brain comments from the Rockefeller Foundation this is NPR\nSupport for NPR comes from this station and from the ... foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size Sam's foundation dot org\nFrom the William and Flora Hewlett foundation committed to supporting ideas and institutions to advance education for all preserve the environment and promote vibrant performing arts more information is available at Hewlett dot org and from Americans for the arts\nYou're listening to Ninety One W. H. B. E. Atlanta way ATM each NPR Atlanta whether partly cloudy and dry overnight with loads of fifty for Sunday will be policy cloudy and dry with Heinz of Seventy eight and Monday remains partly cloudy and dry with high eighties finds\nA special edition of wait wait don't tell me isn't\n[noise]\nSupport for W. H. B. E. comes from Atlanta celebrates photography celebrating art and photography books that the ACP photo book fair October twelve and Thirteen at the museum of contemporary art of Georgia details are available on the app or an ACP info dot org\nAnd from Manhattan creative mad have creative vision Atlanta based video production company that helps businesses build their brands through broadcast commercial and social media videos more on how ... provides video solutions at mad HDL dot com [noise]\nFrom NPR and WB is the Chicago this is wait wait don't tell me the NPR News quiz it's me your pledge drive anchorman I'm chair of the bill Curtis\n[noise]\n\nSet the chase right got Atari among them down Chicago Bears say go [noise]\nSo I don't\nKnow if people are sufficiently aware of this but this year is the twentieth anniversary of wait wait don't tell me making dumb jokes about the week's news\nIt's also the twentieth anniversary of us pleading with you to give us money to pay for it\nThat's right and we have been we'd only for cash as long as we've been here just today for our twentieth anniversary pledge special we're going to revisit path we'd all the ways in which we haven't touched you to give us the money you gave us back then so that will give us more money now it's kind of a double whammy\nSo think of it not as a clip show but a clip show about ... shows it's like inception but with a gig [noise] travel\nBack with us now twenty Thirteen when we played you this wonderful clip from even further back in the past [noise] smaller\nPerhaps a solution for our latest energy crisis slate magazine published a scientific inquiry that seek to prove that in the future women will be able to\nPower their paws and other devices by harnessing the power of what your own mind [noise]\n\nUm my harnessing the power up I don't know juggling fat comes to my mind boggling fat no press\nWriter [noise] wait\nA minute if it's just women or men too well who knows how far the technology may go\nStill girls to feel inadequate [noise] now can't even watch TV\n[noise]\nCapitalism shorter song [noise]\nThe big girls will be here like symphony in [noise]\nHigh school boys ... power and [noise]\n\nI mean they're going to get through to try and go to mind [noise]\nShould I should I claim is writer\nWriter Adrian [laughter]\nName is Adrian so she's writing she's writing in late she says quote I've always found the concept of breath bothers him they will fulfill their intended function for about three of the Seventy years that I have done the rest of the time they alternate between getting in my way and embarrassing me unquote\nSo she decided to see if they could lead to some useful works you talk to engineers were working on ways to harness motion either right or energy I just want to see the patent that these guys are [noise]\n\nAnd then show discovered that in theory you could construct a bra that captures the otherwise wasted energy of balancing breast and converted into electricity to power personal\nThe cell phones iPod [noise]\nHim and went on a stupid idea if you were Pamela Anderson the nation of Colombia [noise] on\nThat same show in Seattle local celebrity Bill Gates was the topic of conversation since he was about to step down as the chairman of Microsoft we done spontaneously came up with some ideas about how to get rid of another famous Microsoft employee\nGauges departure from the software but he is not expected to result in any huge changes of Microsoft they will still be an implacable force for evil [noise]\n[noise] you ...\n... is a departure some people found this two thousand three email it was revealed in court documents from the antitrust case\n... gates complains at great length with the most bitter\nFrustration and anger much like any of his customers about his experience trying to use the Microsoft website to download software gates said quote this site is so slow it is an usable others pointed to even more angry Nineteen Ninety nine memo titled simply clipping must die\n[noise]\n\nI've seen that many of them but it could be in a car hey where we got one [laughter]\n[noise] clipping [noise] one\nDay to the engineers of Microsoft said you know the people using our products they're frustrated they're angry but they're not insane with rage how can we get their rage and how about if just in the middle of doing something an animated paper clip popped up on the screen is that's going to help you know what you're doing okay\nI see [noise] see there's a lot of trees out here [laughter]\nSome degree anywhere near Redmond anymore [laughter] [noise] what does that can only [laughter] [noise] you know what you begin what are you did get\nThere is a sense of all and grander when you walk into the Senate building\nOr do we each of us every volt desks that you can write anything on cars are too tired they're like the best you have no memory school if parents when you go to a you know a parent teacher day and you're sitting there water that's outfield but uh but when you pull the\nDoors open a there are the names carved inside of all the previous occupants of the desk and so in my you know you'll see named ... lodging\nAnd passed in but you also three names like Bobby kennedy and Paul Wellstone and that really gives you a sense of sort of the sweep of history but you're part of the supposed to do that [noise]\nI suspect the first couple of guys more [noise] I don't know [laughter]\nI don't think people realize the far reaches graffiti\n[laughter] are there are a little I was thinking about taking a break him\n[noise]\n[noise] well that's how we do have a very long after America read about it [noise]\nBy the way later in that interview when we asked him if he was ever planning to run for president and so we finally on wait wait don't tell me could actually breaks the news\nHe told us the only thing he was planning to do was go home and do the dishes\nThanks Obama that interview and not my job game with then Senator Obama is just one of the many highlights you'll hear on our twentieth anniversary best to wait wait collection last year from Tom Brady Steven Kobe or Bill Clinton and George Clinton\nTo get your download code and get a copy end up bonus collection we put together just in case you want even more all you have to do support the station right now yup that's it here's how\nAnd that digital download is yours for a pledge at seven dollars and fifty cents a month you get it by calling six seven eight five five three Ninety Ninety or going to W. A. B. E. dot org\n\nSupport for WABC comes from Grady health systems Avon breast center accredited by the American College of surgeons national accreditation program for breast centers recognized as a breast Centre of excellence by the commission on quality and safety more at Grady health dot org\nAnd from the law firm of Arnold golden Gregory the real estate attorneys are ... real estate donors developers lenders and investors navigate legal challenges and opportunities are no golden Gregory ... but how more at A. G. G. dot com\n[noise]\nFrom NPR and WB easy Chicago that says wait wait don't tell me the NPR News quiz I'm a pile of thinly sliced beef covered in Velveeta thrive on me or Billie Jean state\nYou're\nGoing to go very\nWell thanks everybody ... is the time of year when the world is in transition the earth is moving from summer to winter when we put away our white shorts and breezy Halter tops and put on our quarter right pans in wool Halter tops [laughter]\nGuy it was one hundred percent beef stew in the hot cocoa\nHas we adjust to the new colder reality we want to play for you some of our favorite moments from our old reality starting with our conversation with astronaut Scott [noise]\nReading your new book or about your life and your mission up there called endurance and it's fascinating one of the things that amazed me is that uh in your description of the space station it sounds a little grimy er and I imagine it would be you know we we see science fiction movies everything's clean and white and it didn't seem that way and space\nYeah you know it's a functional its own working and living space and there's a you know a lot of equipment up there to any place to live I think it's a little more I mean\nYeah I guess a except you you talked about like how things are floating around in the compartment and sometimes you think they might be like a fair bit of candy that got away from the last meal but you have to be careful because there are also mice on board [noise]\nYeah yeah he always wanted to make sure there's an M. and M. M. on anything\nYou see [noise] read it out loud [laughter] and I was also interested I assumed\nThat Europeans you were in space you were hundreds of miles above the earth that you'd be cut off but it seemed like you had Internet email you with cable you watch CNN all day [noise] yeah well\nWe we have CNN on while we were working we weren't like just watching TV all\nDay [laughter] you know the astronauts don't do that the president does that the astronaut the job and [laughter] I I it was it was one story\nThat you told that I couldn't get over that you talk about one movie night you had early in your mission and you watch the movie gravity\n[noise] so\nSo this is the movies that are both movie about a horrible disaster that takes place in space in orbit and you're watching the movie in space in orbit and and what were you thinking as you were watching this\n[noise] you know it's it's kind of like a little bit like watching a movie on your house burning down while you're inside of\nWhose\nI'm not I think it was mine [laughter] hey\nScott you you have an identical twin brother and you're both astronaut which I I find so intriguing so did one the first\nThing you know I think we we we decided to apply independently of one another um but he actually applied the selection before we both got picked show I guess it was his idea there and\nHe was he was on the ground because if I remember correctly the point of you being up there for so long was because you're identical twins same DNA they could then see how your if you would physically change at the end of your time compared to your identical twin on earth and so he sent you some odd things if I remember\nUm like the real issue yeah I Would say\nYeah I'm going to be straightforward I was thinking of the girl is why does your brother send you a gorilla suit in orbit\nWhy not a gorilla suit\n[laughter] well there's never been a girl\nIn space [laughter]\nI guess\nI guess that's true [laughter] once you had the gorilla suit in space what did you do with it\nWell you know I certainly I had some fun um but you know the purpose behind this was not just to go around you know me being a kid\nGrowing up that ADD or ADHD and uh you know not being able to pay attention often as an astronaut when I go to school there is always a\nKid and the fact that he laid international I'm Talking about space can get you know engage with that kid yeah but you put a video of a guy and a girl is big in space [noise]\nNo one could not look at that [laughter]\nThat's for sure [noise] Scott have you ever run into one of these crazy people it says the earth is flat and nobody seen it and say excuse me I have [noise]\nYeah you know I had a ... and some of my advantage they actually have flatter protestors\nOut what then bill are coming out I Love\nScience the fact that you know science explains why the earth is round the mean those kind of people just don't believe in that and that's either you believe what what you want but at the airport is truly flat wouldn't be edge be like a really cool place to visit\nLike the best [noise] that's a really mean I'd ...\nI'd build a house there I'd look over my bedroom would be hanging over the edge\nOf the things you've done I have no doubt that would be the case cats kept pushing things off the end\n[noise] I Know\nBecause you say that's the thing that everybody ask you about is the toilet up there and I and I was going to stay away from it but then in your book I found out something amazing\nWhich is this weird barter system you have with the Russian [noise] than what you would give them I guess extra energy or from what was it you generated from the solar panels and they would give you their urine [noise] you know it's part of it [noise]\nYeah will change let me turn it into the water and then we drink it I guess you'd take their you're and you're changing and water you drink it it turns back into your into all just seems so pointless when you think about it [noise] um ...\nAnd I know what you're thinking that guy Frank ... H. P. for a whole year right I wasn't saying I drank everyone everyone speak\nI could you could you tell who was it was\n[noise] oh\nBut it does taste better than the water and Florida\n[noise]\n\nCommander Scott Kelly we're honor to talk to you but we've invited you here to play a game today we're calling\nInternational Space station meet the international house of ... okay [laughter]\nBefore the I. S. S. was launched another institution showed us what we get will mean cooperate across nations namely five different kinds of artificially flavored syrup when asking me questions about the pancake chain get to write and you win a prize one of our listeners a short stack of voices on their voice mail I ready to find\nTime reading All right\nWho is commander Kelly Planck will ... Indianapolis, Indiana are here is your first question I hop seemingly so harmless has been involved in\nSuit such as which of ease a I hop the PS F they sued the French NGO pancakes sounds frontier for diluting their brand [noise] me I hop versus apple they sued the computing giant saying the name I've had some too much like I hop\nAnd you say to me well okay great I get tickets but how do I get there don't worry about it because the trip includes airfare hotel a combinations and the tickets so it's two people to get to see the show in the spring make a donation right now\nAnd don't wait wait to do it it's at W. A. B. E. dot org or six seven eight five three Ninety Ninety or online at W. A. B. E. dot org we're going to be back with face and right in just a moment\nSupport for WABC comes from horizon theater presenting nomad motel by Carlin changed this fresh rye comedy drama tells the tale of two families one Chinese one American living in the land of plenty without a safety net horizon theater dot com and from Rosie's roofing\nProviding commercial and residential roofing installation and repair\nFrom tiny houses to warehouses Rosie's is committed to keeping you cozy and dry Rosie's roofing dot com\n[noise]\nFrom NPR though to be easy you should go this is wait wait don't tell me the NPR News quiz I'm they'll Curtis and hearing other shows that the chase bank auditorium in downtown Chicago Peter cycle\nFor money but instead reminding you of the times we asked you for money in the past and the hope that you will donate money now so that we can continue doing shows like this in the future it's like getting across the fourth dimension [noise]\nSecond twenty four team we did an interview with Tim Gunn Project Runway live on stage of the Brooklyn Academy of music and it was a terrific we immediately played it again we're holding out of ...\nFor your donation metaphorically so you do have the single best Vivian van story I heard oh I Do but [noise] if you would like until you're ... who am I to stand on your way [noise]\nThe event played apple yeah I Love my father was a ... on and he was a boy he was a major but he ended up being\nJ rumors ghost writer speechwriter took ... correspondence on his office was two doors down from Missouri Hoover's off of him growing up my sister and I love the FBI tour ... this one particular year I was\nNine or ... him and my sister was there for six or seven of them and my father so you because they're going to be so excited\nVivian found using Mr ... office and I was a huge I Love Lucy found them\n... yes of course so we did and it was lovely and she was charming years later my father was in a nursing home was old timers disease he's not the banks giving table or family has gathered and all these rumors are out about Hoover being cross dresser yeah\nSo I was reporting upon a time in his office we're living in now\n[noise] and\nI turned to my sister and I said a punt reflection I Know it\nDoesn't it strike you as onto the\nHoover wasn't in the office [noise]\nDon't know how it was how was\nJ Edgar Hoover as ...\nWhich is really what matters to me I'm studying how ...\nHow are you on that\nI I wrote about this and one of my book some guns golden rule so that was published by um division of Simon and Schuster the Simon and Schuster legal team went to the task on that book is about two weeks with us\nAnd they contacted Libyan bounces to biographers neither of whom knew anything about this visit to the FBI and then they went to the FBI to look at their visitor ... no ...\n[noise]\n\nThat is a betrayal of cigarettes at a sweetheart last in the ... like my kids would love that is so let's let the water to Jared who wants to dress up as Vivian Vance but that's I don't know if he wants to meet children ads\n[laughter] your father's has made some kids that age\nWeird 'cause it's like your father was the apple ... losing [laughter]\nI I have a series of questions here on him to grow them away and just tell 'em or story [laughter]\nTo ask you um I Want to ask you about your personal style because we're always on the show as you are right now perfectly dress if I were to and I won't do this if I were to break into your house and say you know eight am on a Saturday Saturday morning Europe\nUh you've got you know you're going in all of a sudden oh my gosh I'm Out of coffee ... alright so you say to yourself I Need to go down to the big at the corner and get some calls\nOut what's actually know the ... when I was a stunning food and boring I Am [laughter]\nFor him and this has of course it is [laughter]\nA point in history as you say to yourself I'm Jim gun I Need to walk down the block I Will be seen by people do I need to put on a suit you know I Know when I was sort of religion you are willing to walk down the I mean a little boy and and your James\n... Oxford shirt or blazer [noise]\nOf times people think public radio is behind the times filled with funny daddy's and old stirs not true it is true it is mostly true however\nWe are quite sometimes as the kids say for example here's a moment with that I kind of used culture\nReally blood junior Roy please listening to this track I'm sure you've heard of before it's from the new album by the rapper risk\nRats can\nBe made and\nBless the dog will now you're already [noise]\nCurrent events in magazines or do you of the album riff\nLyrical style is very similar to ... [noise]\nKnow I heard him say a lot of what you out\nIraq and Syria before the jury and I think yeah I saw it on\nThe line and this is actually what they thought was derivatives of his sort of artistic model here blind as I can shoot at ... through a frosted cheerio from Boulder yards away\nOur ... no [laughter] no orders for her to go to a ... or to a modest or there was supposedly referring style Marta ... [noise]\n\nNew album ... magazines and riffraff delivers quota swagger rainbows full of loyal to London junior ... like the one we were just [noise]\n\nSouthern Folkways I've articulated while writing for Sports Illustrated\nDeer and by the way we we we were curious as to how a hip hop artist could be inspired so we dug up or one of your uh one of your deep trucks Ryan says red lungs [noise]\n\nLike like a real world\nFrom a sea of [noise]\nYou just heard Roy Blunt juniors debut end final performance as a rapper if you need further proof of life with a public radio would be a disaster for him and for you and for us listen to this to married at the Kennedy was driving across the Tulsa, Oklahoma\nFirst I thought it was some kind of spider Web but no one turns out it was a crack in class and he was cracking windshield glass\nIra Glass [noise] dangerous region blessed that I wrote to lose your glass\nFor their lives and their own hands and they don't repair the windshield [noise] well I don't know I mean my dad drove for years with a crime oh no no no it's a dangerous dangerous and it needs to be replaced [noise] immediate\nThat's right [noise]\nThe b._b._c. Chicago this American Life distributed\nBy public radio international I Am Ira Glass for Ira collusion and glass today in our show three stories of people based on the most terrible thing that could ever happen to anyone ever ever ever and then of course is\nA broken windshield [noise]\nYoung woman\nGoes to Ira ... glass job a leader in auto glass replacement [noise]\nThat's true [noise] another customer at our equation glass [noise]\nIra doors human bless you ... your glass [noise]\n", "show_name": "Snap Judgment", "year": "2018", "city": "Atlanta", "day": "13"}