{"month": "10", "state": "GA", "station": "WABE", "content": "And uh and and part of what I'd say is picking and choosing is actually called interpreting and the scriptures need to be interpreted because they were you know there are sacred text but they were written by human beings we believe they're inspired by God but we don't really know exactly how that inspirational work\nThey were written by human beings in particular cultures and historical circumstances so there's two hundred and Seventy plus versus the Bible that affirming allow slavery including beating your slave with rods as long as they don't die within two days because the slaves were property that's what it says an actress\nSo we look at those passages go yeah no not that that there are other passages that over ... overshadowed those but two hundred and Seventy plus of these are six passages about gay and lesbian actually six passages about some form of St John gender relationship one of which calls for you to kill gay men\nAnd nobody I Know it was killing gay men were advocating for that even though that's what the Bible says and so there's a place for us to go and there was a preacher once uh I was talking about this um I'd written a book called making sense the Bible and I was on a national lecture on this and then he said you know you're just picking and choosing and I said well let me just ask you a question\nDo you have a pension fund and Methodist preachers love their pension fund you know do you have a pension fund well yeah of course I said let me ask you this what part of Jesus words don't store it for yourself treasures on earth did you not understand\nBecause that's a pretty clear passage and yet you've somehow managed to say no we need pension funds to even though Jesus about to start churches are and what you did as you interpreted so you could say you're picking and choosing or you could say you're interpreting\nHow do you how did he respond I'm sure you didn't liquidate his pension fund though he was such a silent [laughter]\nAnd you know I I like they're not telling people not to have a four one K. you know I'm not OK I'm saying\nI'm saying that we need to be able to take our sacred texts and we need to understand the times which was written and we need to recognize you know again let the women keeps selling in the church has the women with their heads covered there's a whole lot of these passages where we don't\nObserve those things in the same way today and we recognize that these words came within a particular cultural context and we've got it and so we inform our structuring we interpret the scripture in the light of our experience in the light of the tradition of the church and ... those things help us to be able to make sense and that's how it always worked pastor Hamilton thanks for talking to us Joshua thank you it's been a joy\nAdam Hamilton is founding pastor of the church of the resurrection in league with Kansas that the nation's largest Methodist congregation thanks to the Aspen Institute for its help with this interview\nThis program comes to you from W. A. M. you part of American University in Washington distributed by NPR until we meet again I'm Joshua Johnson thank you so much for listening this is one egg\nSupport for NPR comes from the station and from the Alfred P Sloan Foundation bridging science technology and the arts my supporting exhibitions such as programmed at the Whitney Museum in New York City on view through April fourteenth more at Sloan dot org\nFrom the doors do charitable foundation whos clinical scientists development awards support promising early career physician scientists and their research efforts to improve human health\nAnd from the sustaining members of this NPR station\nYou are listening to Ninety point one W. A. B. E. Atlanta where ACL meets NPR\nThey say that words matter everyone has their own style but has the rhetoric at rallies gone too far I just don't think you can connect to the threats are acts of violence in the White House calls it outrageous to blame the president for recent acts\nLet's critics said no one bears more blame him\nWho's right next time on one a week nights at ten Ninety point one W. A. B. heat [noise]\nIf that old car or truck he'd been saving for one of the kids is it really safe are cool enough for them anymore consider donating gets W H ... program will take care of everything from pick up the paperwork just call one eight six six nine zero one W lady and thanks\n[noise]\n\nWelcome to strike up the band celebrating the music of the wind ensemble and contraband I'm Scott Stewart\nOn this episode a strike up the band we raise our virtual glasses and propose a toast each wind repertoire connected by the inspiration of wine at\nThe University of Texas at Austin is front and Center for much of our repertoire and we'll also hear from some talented musicians from Youngstown, Ohio to sit back relax and of course listen responsible [noise]\nComposer Dan will sure on the University of Texas at Austin music faculty pop the cork for our concert opener\nThis is to Monte which you can post back in Nineteen Ninety eight this piece was originally written for the opening of the Boston Pops season it just standard overture form familiar to many listeners to primary themes development section in the return of both themes\nWhat's a little unique about this one is that the second theme is actually the same as the first but its upside down or Indian version in musical terms the Boston Pops premiered your casual version\nAnd the wind transcription was made by Paul Bissell and first performed by the Dallas when some funny in two thousand here's a sparkling overture made for sparkling mind\nThis is who Monti music of Dan Welter Jerry junk and leads the University of Texas wind ensemble\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\nMm [noise]\n\n\n\nMm\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nBut when I come\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\nEarly one morning beach cheery ending of Gordon Jacobs old wine in New bottles we've heard the data chamber wins conducted by Steven gauge\nI'm Scott Stewart and you're listening to strike up the band I Ninety point one W. H. B. E. Atlanta you can check out our weekly pointless at W. H. B. E. dot org just search for strike up the band\nContinuing our musical toast music of John Mackey written on a commission in honor of the one hundredth anniversary of the butler school of music at the University of Texas at Austin\nThis is the wind dark sea symphony for band composed in two thousand fourteen this progression work references portions of the ... the odyssey by Homer\nIn the first movement hubris Odysseus filled with arrogance after each successful military campaign is cursed by ...\n... ... sailors were drowning to see him a second movement we imagine the ... calypso who saves Odysseus brings him back to health shares seven years together with him only to be abandoned by just use when he remembers his former life\nAnd then the third and final movement the attention of the soles is a turbulent episode of disuse making a sacrifice the dead at the gates of the underworld\nJust as an epic symphony for an epic story the wind dark sea symphony for band music of John Mackey the University of Texas wind ensemble performed with Jerry jumping on the podium\nWell\n\n\n\nWell\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\nMm\n\nMm\n\n\n\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\n\n\n[noise]", "show_name": "Snap Judgment", "year": "2018", "city": "Atlanta", "day": "31"}