{"month": "10", "state": "NY", "station": "WAMC", "content": "Woodstock playhouse dot org\nAnd from the button boxes Sunday when Massachusetts makers of our boys concert peanuts also selling new and used concertina send accordion and providing repairs and accessories button box dot com\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W are you an HD nine points reruns in Utica W. A. M. K. U. H. D. nine point nine Kingston W. O. F. R. H. D. Ninety One seven Middletown WC yell HD Ninety One Ninety ... Ninety three three cannot ... W. A. N. C. H. D. one oh three night talk on the road got W. A. M. U. H. D. one in\nFive one great Barrington W W E S H da da da da da da da da da da and are idiots five Brewster WAMC am fourteen hundred Albany\n\n[noise]\nI'm ... and mark yeah young coming up on that that happened where there's smoke there's fire as a Wednesday\nPots would be legal in this country but in Halifax Nova Scotia there's that kept the regional municipality doesn't want anyone to actually smoke it or tobacco or anything anywhere on city property which includes all the streets\nHis motel it's gone so our for has cats but\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for long term success would weave district to me and gastric bypass surgery monthly seminars open to the public for what three three nine five seven five one zero to register ... barely\nThose stories and much more coming up on the Monday edition of as it happens [noise]\n[noise]\n\n[noise]\nThe tech industry can't seem to stop picking nurses this big CEO's\nBut are they bad for business from American public media this is marketplace check the midst of buying the digital economy em Ali would [noise]\nMarketplace tax is supported by Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and be more more at his Cox dot com or from an agent his costs insurance encourage courage\nAnd by carbon night offering data protection solutions for businesses including automatic back up for servers and point protection high visibility and disaster recovery and data migration learn more carbon I dot com\nSilicon Valley loves a charismatic founder story but there's a difference between leadership\nAnd nurses and new research shows that narcissistic CEOs are actually bad for business Jennifer Chapman is a professor of management at UC Berkeley as high school of business\nOr research focused on the tech industry and found that narcissistic CEOs tend to pay themselves more and pay their executives less they get involved in more lawsuits because they take more risks than they need to and they tend to hire people more for their loyalty then their skills are judgment\nI asked her if the myth of the genius founder means a lot more nurse assistant tech\nWe hear a lot about CEOs who our founders in the technology industry adopting behaviors that appear high on the narcissism scale\nBut in the end there are as many founders who are not narcissistic as they're our founders who are nurses cystic\nSo it's not really a causal factor you don't have to be a nurse assist to be a founder\nIt sounds like it's hard though to disentangle those two things those two perceptions right\nIt's very hard to disentangle them particularly if you think about being a board of directors who selecting a new CEO and the c._e._o. is savvy enough to put his or her best foot forward\nIt's much easier to see the energy and division and the confidence um and harder to detect how the person treats other people how much um he or she will claim credit for success and so forth\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for what three four nine nine six six zero zero\nNuanced understanding of these kind of down sides of the narcissistic personality\nWhat will it take\nFor companies to get better boards of directors to get better venture capitalists to get better at weeding out these personality well I think what's so tempting in the entrepreneurial world is that in fact entrepreneurs are almost\n... selected based on having delusions have grander right thinking up things that haven't existed before and having confidence in those visions what\nBoards of directors need to do though is go further and try to evaluate not just the idea and the confidence of the person proclaiming the idea but what is there a long term source of knowledge going to be are they going to only rely on their own instinct and their own ideas\nJennifer Chapman is a professor of management at UC Berkeley toss school of business I should point out here that narcissism isn't unique to the tech industry uh twenty ten study of college students found that nurses has um has increased by more than half\nSince the Nineteen eighties eight years and ... trillion selfies leader and well here we are I'm only what a mess marketplace jak [noise]\nThis is eight PM [noise]\n\n\n[noise] hello I'm Carol Off good evening I'm Mark ya young sitting in for Jack Douglass this is as it happens [noise]\n\nAnd I watched taught kind of is will be legal across Canada on Wednesday but if you light up in Halifax things will get heavy city officials have banned smoking pretty much anything pretty much everywhere\nHigh gear and new clinical trial at McGill University finds that Eighteen to twenty four year old driver of a higher risk of crashing their vehicles even five hours after\nThey've smoked wing of view is no runes child Smith lost his motels to hurricane Michael and almost lost his life but he says he plans to rise from the wreckage in Mexico Beach Florida [noise]\nHow climate change on climate change a cabinet minister says his government is still committed to its carbon tax despite its recent adamant rejection by several province that this is a\nDining of their age of aquarium one in particular rip please aquarium in Toronto where officials are pretty upset with the guy who decided to skinny dipping a shark tank and anal redemptive\nAlive thought farmer on TV I Apologize to a federal cabinet minister through a letter to the editor for calling the minister and um [noise] aperture and the hind quarter she will [noise]\nAs it happens the Monday edition radio that tries not to engage in or if is politics [noise]\n\nOn Wednesday at twelve o one AM Canadians will have legal access to recreational marijuana but in Halifax Nova Scotia\nStreaming support for WAMC come from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nIt's including tobacco county has put into effect and new law that banned smoking on the property even parks anti box the only exception the handful and designated smoking areas\nTim ... is the editor of the online news site Halifax Examiner we reached him in Halifax\nHim I Know you had been walking around downtown Halifax today so are people following the new law they're not letting up on the city sidewalks\n[laughter] not at all they're not following and blow it all started Carol I uh got off the ferry today and walked out of from the waterfront and within a block attach themselves they being on the corner\nWalked up to city hall a there is a a man sitting on one vote the picnic tables out and grab parade editor cigarette I Walk down a Argo street and there was there was one of the workers from the bars uh discreetly smoking in off the debts that part of the street people smoking at the library\nOr the wall was collapsing in on itself I had to cats at one of the bed and they were just terrified I stay in the look on my one of my cat faces\nSupport for streaming on WAMC comes from the Davis financial group providing the based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nHold keep from getting sucked out into the Gulf I ended up getting sucked back in to the laundry room and then on the ... and was overdid it beat me up a little bit and I wanted to grab for the other cat and ah I couldn't walk caved\nIn and they flew out the on the bed out and then I got [noise] I just I couldn't save him\nBut you say to my\nI was able to save two out of six\nI'm so sorry and you just this scene and what you're describing it's not just a lottery to wind right you're dealing with a hundred and Seventy five miles per hour winds the same time\nYes ma'am I'm On my face and it's completely of wind burn after was all over it took me an hour to get the salt water to get out from behind ... air I had\nSalt water and they were just right behind my eyeballs and it hurt and ... and ... and you must still feel really bruised yes ma'am I Am really bruised\nSome cut I got holes and me from Israel\nAnd you're lucky and I'm happy that you survived it owed child what an incredible experience\n[noise] yeah I really wouldn't suggest that ever when they tell you to get out get out [noise] don't stay grab your pet take your dog your cat your turtles put your goldfish in a plastic bag heck I'm with you\nThere were so many of us there is over two hundred almost three hundred other states everybody thought it was going to be like that I've we've never seen in our lives that kind of power in a hurricane is just horrible\nAnd what about people we know the new Fishell death toll at this point is Eighteen whose parents are still there are still people unaccounted for and your community right\nYes ma'am I got a next door neighbor it was him and his dog wrote it out and or or his houses completely gone and they haven't got him up yet when they start pulled it all the lumber and pick up those piles up you will start finding more people\nWhat are you going to do now what's your ear motel is destroyed right\nYes ma'am I got to get in touch with my insurance company hope they\nDon't do the wrong I got to get through FEMA I got my family and my friends I'm going to build back ... unity I owe it to my employees have been so truffle for so long you just got to put your big boy bands on and do what you gotta do don't just think of yourself you got to think of others\nAnd given people are saying how unusual this storm was how it didn't come Hindi and do predictable waited income the way hurricanes normally comet doesn't didn't fit in these rules right do you worry that I'm the mother nature's will have changed on on hurricanes in storms\nYes ma'am I Do I see the way the weather is changing there is something going on I probably manmade way has got to be a little bit better door planted otherwise she's just going to try to shake us off of her we got to get a little bit better otherwise it's going to get a lot better or worse\nCharles ... I I I hear you and I hope you can you have that to the strength to do rebuild it sounds like you do and a lot since the are going to I really appreciate speaking with you and I'm really glad you're okay All right sorry about two hours you have to call and have a concern appreciate that okay by\nWe reached Charles Smith on the road back to Mexico Beach Florida for\nSupport for streaming WAMC come from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nBoom\nI'm\n\nOne\nIt was hollered and they he has the moment\nAnd soon after it came out of Ronald McFarland mouth he regretted McFarland as a dairy farmer in P. I. at an event this month he had a choice words for federal agriculture minister Lawrence McCauley but now he feels really bad for senior so he delivered an apology but now you might expect\nMr McFarland penned a letter to the editor in the eyes the guardian newspaper\nAnd just a heads up about language you're going to hear that choice word we reached rental McFarland and for would PI Iran of people have been warned so we can start at the beginning why did you call the federal cabinet minister Lawrence the collie and\nI was ... we had our our votes house or the bad deal that the the federal government has set up for the Jerry on the fire is a hundred of those ... like a ... a towel and focus sounds and what's not like farmers here the pick our focus on what they did\nAnd horror of very firmly hard liquor alone back stay local tall Lawrence about what a huge loss\nTo the areas but I mean the young people or loss while the leave the ... well some farmers persuaded laws to stay on the ship all us all of these kids orange was not happy virtually\nLawrence we leave oh Las urban look up a lot my voice has a tendency to carry oil\nI Lawrence earlier about the mayor of him and I said you're a\nBoss just like that or was it a bit louder than that\nFar but like my voice carries a lot of them not to say it loud he heard on the road he looked at me he looks our but I'm absolutely party looked the federal mouse or that he's learning the federal government take Gary down the road it's a deal with the devil and we don't like it\nOkay to some people know the deal the devil you it's making us is the U.S and see a which is if the trade deal distinct between Canada and the United states and Mexico right\nBox right they have given away a huge piece of our industry for forty years myself and Ali was there for hours I work for a belt equity I've never taken any money at the bottom I've always thought about English farm\nThey've given all of our games away and we are in la ...\n... so the kids you're referring to these are the next generation of farmers who will inherit these dairy farms and you wanted they want to say what it meant that they did this deal how this deal is going to affect them right\nAbsolutely and last one I Want to stay for it so\nHe was made to stay and um he is getting quite cranky at the end of it goes one young mother in particular ripped gamble on call them don't sign this deal a large ... the editor and said I'm going to sign this deal\nSo well I was being a bit of a woman or white and he was leaving a lot of them were like oh but but five seconds after I get that ah\nStreaming support for WAMC come from Berkeley Center for weight loss surgery with a focus on life skills and support for long term success with we've district to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nSo that that just before we get to your apologies that I mean ... well I Know that that's it well I hung out a lot in Cape Breton that's pretty big because someone that so I'm prince Edward island what that is something that people often say\nOh no no like gets editorial caught off for me I blame the CBC I blame a crutch mark cultures normal I use oil but um oh yeah it's it's a it's a ... just like to call them up in the ER and he was quite sour voted and I really do with them on ... and I gave you a hotel ...\nWhy did you decide to issue this apology to the ministers who a letter to the editor\nAll politicians read a lot of history at it and I might send them a lottery and my something on Facebook now you're on your way through apology wrecked by a ... on a lottery to\nAlways read\nAnd you shouldn't minister McCauley reads the guardian\nOr at a dog with one of the staff or he did and I'm a majority of all you got back to learn a lot worried\nAnd it's going to read part of what you wrote says dear lord McCauley and prefer card again and federal minister of agriculture\nI Would like to formally apologize to you for calling you in last friday at the hall in pools corner have you had a response from him\nWell I'm sure all running on Sunday the as a small price all just a matter of time I mean and you are you running of the people you're trying to avoid or on all\nThe ... you'd think that he didn't acknowledge the apology did he accept your apology\nOh I've never heard from Lawrence are where the law and falls off problems in the front or almost rather altered it has to be in the front man for further on this terrible agriculture deal I think he's got enough problems related\nI bet you did go on and his mother didn't he didn't stop there you said that ah you said he should tender his resignation and come home to ... and then you said please don't be remembered as the jerk that destroyed the dairy industry\nSo now you tell them he's going to be a jerk if he doesn't resign\nWell I'll tell them I don't want him to be remembered as a joke I didn't actually follow mature\nBut so if he doesn't do what you say you should do which is ... resigned and come home that he is a jerk\nFall outlaw let's hope it goes like\nAn accident we did not put them on the road but in these simulate that task yes ah they were distracted enough to cause accidents\nEven after five hours even after five hours yes how much do do they have in them [noise]\nThey had a hundred milligrams of the candidates with inhaled candidates and this is a little bit less than the typical joint and they were still not performing at their maximum after five hours with that type of adults\nWere given I understand that joined contains maybe three hundred five hundred milligrams of dried cannabis so considerably less than what they would have it why not do the real does not give them what they might have had they been at a party or or just so just having a joint on their own\nWhat we wanted to do is use um does and and the assistance of ah using vaporize or is that would be safe and that we could control well in terms of the bills that we were giving to our participant because in in a joint you can have different does is\nSo we wanted to control that\nPart of the study as much as possible\nAnd I know the CIA funded study and they did some polling where they found that one in five young Canadians believed that they are as good or even better when they drive when they're under the influence of what do you make of that\n[noise] it's interesting because in in our study what we did ask them at different times ... also how they felt about their driving safety and the majority of our participants um didn't feel that they would be safe drivers and even after five hours\nThe they have some self awareness ability and that's interesting when we're thinking about maybe going through with uh some self awareness campaigns\nSo you didn't have those one in five young to know the other war but also they ... they're aware that there is a test and those are probably being more reflective ... on their state\nYeah it might be the case you're right uh that they may be more reflective because they're in a study about driving and and and the use of candidates\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of books or health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nYou sensitized a Republican and the young drivers I think that's an interesting way one interesting way to go\nGiven your research given what you found out what what would what would you advise and the way of trying to teach young people about marijuana and driving\nI think that the ... messages that issue are under the influence of Kennedy's if you smoke or inhale you shouldn't be driving and you should wait long enough period of time before Dr resuming you're driving in our case even after five hours\nAt a ... he was still impaired so uh you need to uh wait to significant amount of time before taking the wheel again\nYou were looking at Eighteen to twenty four year old and you know you were interested in knowing how senior citizens who might be interested in marijuana for medicinal reasons as well as recreational I mean that are you looking to do some more studies like this\nI there are many still didn't need it but there are other groups that we didn't look at in our study so as you were mentioning a older I'm drivers who are using a candidate for an additional reason\nA daily users Kennedy's um these are all different group and I don't know that we can extrapolate our result to these other groups where the impact or the incidents of Kennedy's Manhattan different effect\nAlright well very very interesting information during this historic weeks are ... ... thank you it's a it was a pleasure thank you\n[noise] that was professor is about ... from the school of physical and occupational therapy at McGill University we reached her in Montreal [noise]\n\n\n\n\n\n\nDominic lived long is struggling to sell something that once seemed like a no brainer Mr that long is Justin Trudeau is minister of inter governmental affairs he took on the job this summer as what was once widespread support for liberal carbon pricing plan\nBegan to implode the Trudeau government has put the plan at the center of its commitment to combat climate change but Ontario Manitoba since ... and the odds are all now oppose we reached inter governmental affairs minister Dominic ... in Ottawa\nMinisters about you had a broad provincial support for your carbon pricing plan was ambitious and they are on side now you have three minutes would be premieres lining up to fight to even to take you to court what went wrong\nBut so girl from our perspective um we have been\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks or health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and interior hip surgery for one three for nine nine six six zero zero\nHundreds of climate change we campaigned on that and twenty Fifteen as you noted are referred to in twenty sixteen the provinces a ball signed a framework agreement which spoke about a number of measures\nAnd some provincial elections have created circumstances where different governments are now saying that they want to take a different approach we've also said publicly that our provincial election doesn't actually constitute or climate change plan\nAnd we have told Canadians and we've told internationally international community that Canada was going to take robust\nAnd serious actions so we're continuing towards the commitment we made around for example putting a price on pollution making polluters pay\nTo get back to what you just said because you said that they're they're taking a different tack you have ... years and opinions Ontario or they want to be premier of Alberta who quite possibly will be there in the ... who I not just opposing you taking a different tack they are campaigning\nBy fighting the carbon tax they are putting out rallies come and fight the carbon tax they're raising funds for their campaigns on the backs of saying we're going to tear up this carbon tax idea so it's not just a little bit of pushback you have a full scale wind coming toward you\nSo ah again if some conservative leaders are conservative ringers want to run campaigns on particular issues they can explain to their citizens and be accountable for those campaign decisions I don't\nOr purport to understand or or speak for the campaign strategy of different conservative leaders across the country [noise]\nBut if conservative leaders and in this case Andrew sheer federally does not have any semblance or any coherent plans to meet the challenges of climate change\nOr telling Canadians we do and and provincial premier is getting organized\nRallies if they want and say what they wanted those partisan rallies what we're focused on a is bringing forward a very clear and robust plan to tackle the serious challenge of climate change which Canadians see in their daily lives is very real\nWe saw Carolyn New Brunswick with a historic floods last spring the wildfires in British Columbia the tornados that hit auto and gotten a few weeks ago so Canadians notice Israel they expect their government to take coherent and concerted action\nThan we have said that we will we are prepared to do that and with in the case of provinces decide not\nTo be partners we have a federal plan including a price on pollution which will come into effect on January first and we will then be in a position to give the money back to Canadians in those jurisdictions where we apply to federal plan because provincial leaders have decided not to take their obligations seriously\nI guess I'm asking is that yes it some of these ... are\nActually campaigning on fighting the carbon tax or calling it the job killing taxes you know and they're being successful doing that isn't entirely their fault that people are buying into it that or is it the fact that possibly you're a liberal government the federal government has failed to make it clear to Canadians why you think it's necessary\nSo again that the job killing taxes that was a phrase Mr Harper used to use all the time in the house of commons I remember that when we were sitting in the corner in third place he used to accuse the liberals are having all these job killing tax secret plans\nAnd Canadians took us from from third place to first place with a majority government and implement\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks or health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine an anterior hip surgery for one three for nine nine six six zero zero\nThings that our government is very serious about uh about putting in place and as I say I think we need to be careful if there were Thirteen premier of provinces territories across the country", "year": "2018", "show_name": "As It Happens (CBC)", "city": "Albany", "day": "16"}