{"month": "10", "state": "NY", "station": "WAMC", "content": "Kathy ... dot com\nThat changed in companies and employee owned sperm providing engineering lenders are paying planning environmental health and safety and landscape architectural services for Seventy years she's in companies dot com and from river valley collapse Northampton, Massachusetts a food co-op featuring fresh local foods a deli department with\nMade to order sandwiches uh soup and salad bar and the bakery river valley that C O O P\nOoh [noise]\nThis is Northeast Public radio WAMC at that age to Ninety put three Albany\nW arguing HD Ninety point three rooms in Utica W. A. ... W. O. R. H. D. Ninety One southern Middletown W C. E. O. H. D. Ninety One night Plattsburgh WC again HD Ninety three three Kennedy Harry W. N. C. H. D. one oh three point I kind of rogue W. M. H. D. one by one great granted\nW. W. E. S. H. D. A. D. point about the scope W. A. N. D. H. D. Ninety point once the effort W a an eight point by Brewster at WAMC am fourteen hundred Albany\n[noise]\nHi there I'm Carol Off and I'm just dug was coming up on as it happened unpacking the pact President Trump calls it a historic transaction and prime minister Justin Trudeau has described a last minute deal with Mexico and the U.S\nAs a victory for all Canadians but we'll hear from some Canadians who feel defeated today including an unhappy dairy farmer and a brief history of former FBI official says the ...\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu age\nIf investigators are given a lot of latitude they meet those stories and much more coming up on the Monday edition of as it happens [noise]\n\n[noise]\nWith or without Tesla the electric car market is already in ludicrous mode from American public media this is marketplace check the mystifying the digital economy I'm Molly Wood [noise]\nMarketplace tax is supported by my French makers of a flexible software platform for building portals Internet websites and connect the digital experiences tailored to your business learn more life ... dot com\nBy his insurance providing customized insurance for small and medium businesses so they can do more in the morning markets Cox dot com or from an agent cops insurance encourage courage [noise]\nHe learned must must resign from Tesla board of directors after a settlement over the weekend with the securities and Exchange Commission over his tweets about taking the company private he'll stay on as CEO and I know it's tough\nTo separate the conversation about Tesla from the conversation about you I must but let's talk about cars for a minute because it feels like electric car announcements are coming fast and furious lately Mercedes Audi Ford is promising and electric crossover that's the size of a Tesla model X but inspired by the Mustang\nThere are rumors of a thirty thousand dollar electric Volkswagen so is Tesla's biggest problem actually competition\nMarianne Keller is an independent auto industry analyst and she says sort of\nThe difference between what Tesla has done and these newcomers and there are some very competent vehicles coming from Mercedes and Audi BMW Porsche jaguar is that these were not purpose built electric vehicles day we're existing vehicles that have been modified\nFor battery power this isn't to say that they're not good very good and I think the fact that they're being built by companies with the reputation for excellence as all of these are I think that whatever supply they have they will probably sell\nIs it also still a luxury market I mean how the model three willows and kind of a new electric car announcements we made it seem like the market isn't quite mainstream yet\nIt's not really mainstream yet I mean we don't have the charging infrastructure in this country to enable widespread usage of electric vehicles\nThey are still very very expensive and if not for different kinds of inducement to you by the federal government and various state governments to encourage the purchase of these vehicles we probably wouldn't see the demand that we do now\nNow that we're starting to see more of a move I guess toward electric eagle is there a possibility that people would look at Tesla and Eli mosque and say you know what maybe we don't actually want anything to do with this market maybe it was all based on the cult of personality and not real well I think the Europeans\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n... because of the diesel scandal in Europe they have had to move very quickly toward alternative technologies for clean energy and the only option in the short run is batteries\nYou can hardly keep up with the number of announcements that the German car companies are making you know the rapid transformation of their product lines which there all the jets thing will be completed by mid next decade they're not saying that\nAll of their vehicles within five or six years are going to be full electric they're going to have product that would be acceptable in all parts of the world and the U.S is not expected to move as quickly toward full electrics as Europe or China China's going to be first to go to full electric\nMary and Taylor is an independent auto industry analyst the Paris auto show was happening this week look for plenty more easy announcements from the big name she mentioned\nAnd also Tesla which is still planning to bring the model for you and show it off the French customers who have made model three reservation\nThis is eight PM [noise]\n\n\n\n[noise]\n\n\nHello I'm girl off good evening I'm Jeff Douglas this is as it happens [noise]\nHard\nBargain a last minute trade deal between Canada the U.S and Mexico has been pronounced historic and as if to me but it's a new name is tougher for now\nHe wins soon you'll lose them and how much Canada won and lost in the U.S MCA depends on who you are scheduled era when we ask representatives of the current government and the former governor much\nMilk shake the liberal government is saying it's a great deal for all Canadians but Canadian dairy farmers day is a raw deal for them\nHell of a high water first an earthquake center to know me and three days later the horrific cost of friday's disaster in Indonesia is still not clear\nHow one week case could be one strong case of former FBI official says investigators can learn plenty about Supreme Court nominee Brett Kavanaugh in just seven days if the White House gives them free rein\nIn the ... the steak Financial Times writer angrily tweets that us MCA is not an acronym because you cannot see it as a word as a bunch of people scrambled to pronounce that scramble as it happens do Monday edition radio that believes he is correct\nAbout oh my God\nOh my God [noise] like\n\nA victory for all Canadians that is how Canada's foreign affairs minister Christie a free one has described the U.S MCA the trade deal to replace NAFTA the U.S\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nVersion of concessions and a lot of back and forth trips from Washington DC to Ottawa here is what prime minister Justin Trudeau said today\nI think we have all been through moments or over the course of these negotiations where we felt very close only to see it or not end up working out so I think we were all very mindful that there was a definite window at now\nWhere the uh the midnight deadline by the United states to send a text to Congress a was a very real deadline that gave us an opportunity to work towards that\nBut I have to say from my own perspective it was there wasn't a single a ha moment there was just a series of okay we got this one settled wow we ... we saw this one and is not done yet but there is this sense that when things were falling into place\nThere's an essay appreciate your time thank you they're more than welcome\nAnd re Leslie is the parliamentary secretary to Canada's foreign affairs minister we reached him in on a wall now there is at least one group of Canadians who ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nDairy farmers as a part of the u._s. MTA us farmers will now have access to about three point six percent of Canada's current dairy market she and her skin is a dairy farmer we reach them an engine broke Quebec\nDoes your skin a prime minister Trudeau called this deal a good day for Canada is it a good day for you as a dairy farmer\nI I Would question first of all a good day for Canada and definitely not a good day for Gary farmers uh this was not the deal we're hoping for at all at all so um I I doubt waiting for information and see what details are\nBut it it seemed that we've been warned that this was coming that something had to give and that it was going to be the likely that did the dairy industry and finding a little more largely I in this deal is going to be the trade off to get the other concessions can seeking did did you see this coming\nWell I'm certainly there's been a precedent set\nIn all trade deals up to date that when he gets it gets down to the wire hum they seem to give up a a a percent of the the dairy market to people like to talk of votes or the powerful dairy lobby in Canada were over three so far as powerful\nAs some Canadian point of view here's what it looks like we were looking at a um a really big dent being put into our manufacturing industry in her ... and in a in in the auto bills and auto parts\nAnd what we've trained and also ... disputes mechanism this chapter Nineteen that was very important to Canada and in exchange they seem to have given up three point six percent of the Canadian dairy market to us farmers\nThat doesn't seem like such an awful trade to a lot of Canadians I don't think\nWell I I find it interesting you say that because um the the NAFTA deal is already in place chaplain Nineteen was already in place\nSo if chapter Nineteen or this or NAFTA panel such an efficient it's such a great of a thing to have a why wasn't doing anything about the aluminum and steel tariffs why wasn't it going to be able to protect us from terrorists in our automobile\nUh if if that's not the panel was half worth in a forgiving up the street or we shouldn't have been concerned about those terrorists in the first place\nWhat would you have done would you have walked away would you said no deal\nIt's very complicated obviously a they were getting ready to hit us with more tariffs so that that was not a good situation for candidates to be following it but um I I didn't find this was like any other trade negotiation at least\nWith ah the Europeans and the Trans Pacific ill ah everyone was there I think the groceries eating fairly\nThis one was more like a star and\nThis one was they hijacked sectors of our economy they threatened to do irreparable damage to our economy and if we didn't give them what they want it or they would proceed with these tariffs um I I found it was very aggressive it wasn't that go sheeting\nOr this wasn't a negotiation that's what a negotiating our way out of a hostage situation\nSo again would you walked away then would you have said no deal I'm not going to be held hostage\nSome somebody has to do this a wage Trump is proceeding in and and uh the way he's he's ruined I I find so many uh of parts of society\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nTo them and said you know this isn't right we have rules in place NAFTA already had a certain rules that you shouldn't have been able to to put tariffs on aluminum and steel and they told me to address those issues we shouldn't have been any further\nBut we heard today from ... to do and some foreign affairs minister freelance\nWas that and they basically said that well that the upside for the dairy farms and dairy farmers is that the supply management system is fundamentals in at least is still in place and that the dairy farmers are going to be compensated for losses they sat for his part of this trade deals so against the Canadian point of view\nIt's hard to see how we've lost that what would you say back if you could be at that press conference and respond what would you say\nHow did we get to that point that we were no longer looking for a better deal we're just looking to salvage something out of it so that we didn't get completely destroyed that I don't understand why we allow ourselves\nTo be on her knees as bad as we want we were in a bad physician and uh they negotiated to salvage something but we weren't smart enough to get ourselves in that position for them so lucky\nAnd now if it does go to as we see it how does that change your life how does that change your work your business\nOr you mentioned the the compensation package or a they've had numerous compensation packages or credit for for other trade deals that I received your dollars to date usually instead of giving a money over to a chair and farmers to figure out the best way to distribute it\nThey come up with some bizarre way of uh investing it in our farms and uh if you don't fit the exact the type that they want for the investments and you're not eligible on the money is always ... so to date I receive dollars\nBut are you going to survive and you're going is your business going to to be okay\nIt's doesn't help I mean of course you know you ... your carry on I'm a I'm Still relatively young I have a son was wanting to come home and farm\nSo we'll have to make an investment and are trying to\nBe more efficient or fight back the mafia and share that we've lost a lot of money a reinvest that money and and and try and get my cash flow back up to where it was for\nA wide survival of the rate at which are going a trading off a three plus percent uh every year we only know how much of our market share\nA knowledge can't continue to go on forever doing that\nAnd the problem is is next time you go to negotiate no one's ever happy with what they have they'll want orange so if we're already over ten percent of a given up of our market\nThe Americans only allowed to ... percent of the trade war over ten percent now so who's who's the protection of food who's not a free trader and not not in says\nOkay that's a good point Mr is going to appreciate speaking with you thank you well thank you for calling\nJane ... is a dairy farmer we reach them an inch in brook Quebec and we will have more on the U.S embassy ain't later on in the program including various tongue twisting attempts to pronounce the name of the new agreement and an interview with former conservative cabinet minister Peter McCain\n[noise]\n[noise]\nFirst there was an earthquake and then came the water a dead\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n[noise]\nBut it was a clip from a video that has been circulating on social media a man on a balcony warning people below the water is coming\nToday survivor's on the Indonesian island of ... or dealing with the destruction of friday's left behind as we go to air the official death toll is over eight hundred number is likely to rushed over one thousand [noise] a visual urban\nBurying the dead in mass graves Rebecca ... is the BBC's Indonesia editor Richard in Palo which was hit by the tsunami\nRebecca can you describe what you're able to see in power right now\nAt the moment I'm standing on one of the main ruptured head in to the worst affected area\nAnd you might hear in the background the sound and have the a truck coming in they towering excavators into the area the has the much needed in the recent day that people are being thinking\nSued the rent for within their hands that hasn't seen this heavy building quip meant to try and rescue survive\nAnd also to find ... in the rubble of houses that were destroyed by that powerful quake on friday and then also washed away by the tsunami that was triggered by it\nDo they still believe that they can recover people alive or is this a recovery operation at this point\nThere has been some rescue attempt in the last forty eight hours that have been successful in one place he killed in a horror\nTales eight or a hotel that collapsed a hotel owner was saying yesterday that he would still hearing people\nYelling out for help underneath rebel but he was able to reach them they did manage to rescue more than twenty four people though say using their hands from that hotel\nBut as the days continue the hope of finding people alive I Would have to say a now blame\nAnd the quest for the truth of what happened in that house in that bedroom in Nineteen eighty two\nAnd not just that because we also have these other other witnesses as well on this marriage screen when does it make some gets on the other woman who's made an accusation who will be interviewed by according to what we're hearing in within the scope what are the leads what would you be looking for if you were one of the investigators\nRight well you would want to talk to as many people as you could who were either in the house or witness the events\nOr those who spoke to the people who were at the house or witness the events remember what the FBI is trying to do right now\nIs not prepare a case for trial they're just trying to provide as much as good a information as they possibly can\nAnd so the circle widen the more you talk to people the more leads you get that so you talk to additional people and that process continues really until you run out of people to talk to\nBut what could they get out of it say talking to mark judge who was the the friend Kevin ... who was\nAllegedly in the room when this alleged assault took place they he has already put out a statement saying that he doesn't remember this a ... but it's totally against the character he knows that Kavanaugh to have\nA he doesn't think it happened what more could do ... what could the FBI find out from mark judge that didn't come out in that statement\nWon't Mark Church is a good example Carol statement that he put out was put out through his lawyer\nThat wasn't sort of has to he wasn't pushed on it he wasn't prodded to remember other details wasn't asked perhaps for the names of people who might have been there if he continues to claim that he mark judge was not and\nSo that's why I'm agents wants to talk directly to witnesses I'm not saying that all that but we're put together a false statement or a misleading statement but might have been a cursory statement and it needs to be tested\nAnd some of the things that had been set including by your former boss James Comey is that the leads that were presented on Thursday to an investigation would be evidence that a judge Kavanaugh may have lied during his testimony that he may have not\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nMoms in that area of alcohol what would investigators want to know about that would that be something that you need to know more about as to what words judge Kavanaugh is drinking habits while he was in in high school and in university\nNot necessarily except that it's important that anybody up for confirmation for Supreme Court seat before the Senate Judiciary committee be completely truthful\nSo oddly the underlying conduct whether he drank drank to excess in high school might not be all that relevant but whether he was honest with the Senate Judiciary committee about his drinking habits I think is relevant\nAnd then there are also the references to the year book that was presented that remarks that were sent about ... cabin at the time and that he said we're references to drinking when in fact I was just said no they were\nReferences to sexual activity and some of it quite quite awful about what they might have done or why you do to some women so whether he did or didn't do any of those things that what matters in that that he may have misrepresented but that you book was saying\nWell to be clear some of the underlying conduct if he assaulted women is absolutely disqualify a no ifs ands or buts about that\nOn the other hand if it had to do only with drinking I use that term only cautiously it's still very important that he'd be honest about it\nBefore the Senate Judiciary committee\nIf however the underlying conduct is um the way he treated women whether he sexually assaulted or abused them in some way or that matters a lot and that's why you want a full FBI investigation to the extent we can find out we need to find out\nAll right we'll be watching Mr Rosenberg I appreciate speaking with you thank you\nCarol thank you for having me on the show and thank you for giving me a chance to talk about the FBI\nTaken by by\nChuck Rosenberg is a former senior CIA official who reach met his office in Washington DC\nGive me you know\nAs you say what you got\n... is a God I Know\nYou got us MCA [noise] as you heard by now that it's a new name for the renegotiated version of NAFTA and that abbreviations awkwardness has many people annoyed or in the case of Financial Times writer Alan Beatty\nNearly furious media exploded on Twitter trying to stop people from referring to the U.S MCA as an acronym because he says it cannot be pronounced as he word\nWe reached howling B.D in Brussels\nAllen us NCA doesn't really rolled off the tongue doesn't\n\nDoesn't you know the ... language as well as trade deals are kind of just to point you know there was such a thing as a single word [noise] you know you could have dumped into slogans like not that we don't have to that kind of thing and not just rip been replaced by yet another abbreviation that you know when you say okay but you've taken this one's\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nPeople using it\nI'm a man could or how people using it I'm also not because people say acronym when they mean abbreviations and you know an accident was a thing you can say NAFTA is an accident us MCA isn't it ... and I just I don't think we should give a ... was the name of acronyms because they happen to them\nBut this is like you said this is a hill that you're willing to die on\nActually yeah ups and why [laughter] well\nI tell you why I've covered shade for more than ten years okay when I started a as a journalist when I started covering shade or they like this is the subject so complicated that they'd be the Asian and started running into fall that says the fall that basically all the stuff I've covered it into three left his marriage on edge for that and so keeping in your head\nAll these enormous it'd be patients when you came across one that you could actually say that was actually ... the acronym you really want to sort of hold on to it I'm afraid of the fact that this has gone on disappeared and ... seems to be out of angry about it that I just find very disappointing\nNow of course people are arguing that in fact you you can turn it into an acronym you could say ... or ... or something of that nature right I mean it's not all is not lost on\nThe reality is ... ... ... ... ... miles I'm\nJust trying to ... there's three thousand students like well I guess it was these two guys you came\nTo that in the inconvenient any place to either end you see what you really need is some kind of out in the middle east you all people invented they are the ... the or in a in the middle so suddenly as you just said it was ... as a loose some car or something like that one other thing I've noticed which is unbelievably deceitful and these people just switched to conference around\nUm and so people are kind of got what we should say it was more like you you could say it was like no yeah however that just endless tributes wrong because it's the constant during the run over\nOkay here's some way to get the next ... next to a vowing here since there's us there's two ladders Canada see aid to that is actually the only has one letters to the point and actually put\nThe ... in ... in this new you'd have ... ... I mean that would be\nThree vowels three countries everyone gets their fair share of the six letters and everyone has has their two letters\nThat will be absolutely great if that flooded named it\nI Would invite you to address you can face to the White House Washington DC but you know they didn't do that and why they called why they didn't do that in that respect that\nYou could also switches around right some suggesting that we could call it the ah the Canada Mexico us agreement and say see ... and you ask them to be Kenny and he didn't invent\nBuys you that I think it would be perfect that would open up the absolutely perfect and it was more or less you know the touch of existential despair and the nothing that's closer to ... to ... try to shift the numbers don't trust\nYou have ... you can actually add put ... into this existential angst and candy both the same thing right\nThat that's who I mean I remember the and opening ... was a young mother died today was it yesterday I called them to know if you just uh she she didn't catch\n'em on ... I think that you could just say exactly the same you know ... what was it yesterday I Can't remember [laughter] um that\nWould be that would be that I'd have gone for if if I had been ... they come up with I Would have ... if it's if it's such a nasty tiny little as ... ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n... the words free trade and trade isn't even in the world trade isn't in here free trade and open trade managed a no reference to trade", "year": "2018", "show_name": "As It Happens (CBC)", "city": "Albany", "day": "02"}