{"year": "2018", "show_name": "91.5 KRCC Music with Vicky Gregor", "month": "10", "content": "Ninety One point five carry the scene would like to thank the many businesses\nAnd art for that market their products and services on our station each year\nBy choosing Ninety One point five care see see they are investing in our community and we recommend support them in return\nInformation on how to become an underwriter is at ... dot org slash support or ... genetic seven one nine four\nOr eight year old ones\nNow you can have the\nHe got bored lasts for our country that in one nine four\nOr eight\nNow you can have the Ninety One point five ... the newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning sign up at ... dot\nOrg just past seven o'clock according to writer Lynn you tying when small men begin to cast shadows it means the sun is about to set [noise]\nJust past seven o'clock in the sun is definitely set here in downtown in Colorado Springs seems like that's happening a little bit earlier everyday these days\nThat tornado Vicki will Brighton our evening with the ah Thursday evening music mix Mickey back in the host's chair here momentarily first\nA check in with headline news from NPR and then today's edition of daily life and then Vicki and the Thursday night music mix forty eight degrees\nBeautiful a clear skies here in the downtown area mostly thirties overnight some twenties and those higher elevations but then sunny and warm is the weather is calling for our listening area right on through the weekend and er into Monday looks like\nHeadline news from NPR is next\nLive from NPR News in Washington I'm ...\nPresident Trump isn't sounding too hopeful about journalist ... ... Turkish authorities or maintain the show was killed inside the Saudi consulate in Istanbul mid reports there is audio or video evidence of what happened there secretary of state Mike Pompeo met with Trump but the White House today\nLiving for a campaign event in Montana the president was asked about whether he believes the Washington Post columnist was killed\nIt certainly looks that way very sad certainly looked out the\nSaudis have denied involvement but during a meeting with the secretary of state promised date complete thorough investigation into what happened\nJust days before a parliamentary elections in Afghanistan the government there suffered a blow today the Taliban are claiming responsibility for an attack in southern Kandahar Province that killed three top Afghan officials\nIt took place during a meeting with the top American commander general Scott Miller he was on harmed but three others including two Americans were wounded Here's NPR's Tom Bowman\nKilled including the provincial governor and the police chief who was the most brazen Taliban attack in memory the Taliban including the target was general Miller the Miller spokesman said the targets were Afghan officials at least one of the governors guards opened fire according to local media reports the wounded including an American soil\nIt's been said the targets were Afghan officials at least one of the governors guards opened fire according to local media reports the wounded including an American soldier in contractor along with a coalition contractor their injuries were not life threatening\nKandahar has been mostly stable in recent years mostly due to the police chief general ... a brutal enforcer who survived many Taliban assassination attempts but has been accused of human rights abuses Tom Bowman NPR News Washington\nMillions of Californians today do under ... tables all part of the annual great shakeout earthquake drill ... Craig Miller says scientists are edging closer to launching a system that off for several seconds of warning before an earthquake [noise]\nAreas rapid transit system already uses\nThe shake alert system to slow trains down the first subtle vibration\nNow scientists say the system is ready for primetime with plans to test the warnings in more than fifty schools businesses and hospital\nProgram will need federal funding to maintain her bank Congressman Adam Schiff a Democrat says he expects bipartisan support\nOther countries of if I'm at a system like this we're actually lagging behind a and as soon as we are to earthquakes a that's a very dangerous position to be\nAlso on the horizon smartphone apps that deliver quake warnings but those are still in development\nFor NPR News I'm Craig Miller in San Francisco MoviePass our problem played companies that offer discounts service but theater tickets is now being investigated by the New York state attorney general probes centers on allegations the company misled investors\nWill be passed a struggled financially and is also facing class action lawsuits filed on behalf of investors claiming it failed to disclose aspects of its business model\nOn Wall street the Dow was down three hundred and twenty seven points this is NPR\nCalifornia says it will reconsider life sentences were up to four thousand non violent so called third strike criminals reconsideration triggered by a ballot measure approved by state voters two years ago that's according to documents obtained by the Associated Press\nCalifornia Governor Jerry Brown says it his administration will not appeal the court ruling the state is illegally excluding the non violent career criminals from parole under twenty sixteen ballot measure aimed at reducing the prison population represents a second loss for brown who leaves office in January [noise]\nOne of the most influential in on the sun figures or the British leader has died Sicily Barry was voice coach for the royal Shakespeare Company for more than forty years she was Ninety two and died in a home care facility in Cornwall\nSicily Barry was voice coach for the royal Shakespeare Company for more than forty years she was Ninety to indict in home care facility in Cornwall Jeff Lunden has this remembrance\nYou might not know her name but you've definitely heard her work\nOver several generations Sicily Barry helped coach such actors is Sean Connery Helen Mirren and Ken is Brenda born near London she trained at the central school of speech and drama in Nineteen sixty nine Barry was hired by the royal Shakespeare Company to become head of voice\nA position she held through two thousand fourteen in her coaching sessions she helped make actors comfortable with Shakespeare\nOne is only the U.S came to to find how you inhabit the imagery and the texture the language you know in a ... way in a physical way\nBarry wrote five books and gave voice workshops across the globe for NPR News I'm Jeff Lunden in New York widow futures prices move lower\nOil down one point six percent sixty eight sixty five a barrel in New York I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station [noise]\nMy ... and this is a day in a life for October Eighteenth\nOn this day in Nineteen eighty five didn't intend to entertainment system was released in North America the release featured several games including Super Mario brothers who soundtrack by Kofi condo remains a landmark in video game music\nEntries to follow included Contra\nAnd the mega man franchise\nIf you find the aid bitten intend to sound world at least in Nineteen eighty five to be a bit limited and you\nMight consider how well it translates into other genres take the modern rock universe of Nintendo core stage honorary represented by bands like the advantage name for a favorite joystick violent controls already any advantages albums\nOf arrangements guitars and drum set loose the forceful potential of Nintendo tracks here's Batman and its original Nintendo form\nAnd now by the advantage [noise]\nThan now by the advantage [noise]\nOr take hip hop super Brooklyn by cocoa brothers turns the music from the super Mario underworld including sound effects and sly not to be over world music as a sonic infrastructure\nShe's off\nWhat what did you feel most at home and intend those original a bit sound universe you might check out a YouTube channel aid the universe to find your favorite tunes transformed into a bit masterpieces\nThan the rest as they say is history\nIn the library raw deal by ranch food to direct emphasizing the importance of knowing where food comes from how it is produced and how far it travels locally produced food available at the ranch rude to direct a store or twelve twenty eight you know more an online at a ranch rude to direct dot com\n[noise] this is southern Colorado's NPR station\nK. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ACC law hunter Casey ... K W C. C. F. M. woodland park streaming at K. R. C. C. dot org\nIt's eight minutes after seven o'clock it is also Thursday the Eighteenth of October yeah hey\nI'm your friend and neighbor Vicki hope you're doing well making your way through this working we want to think gee chief for sitting in for me last night and doing a terrific show\nAlways nice to hear him uh outside of the vintage voltage thing and having him get into this new release wall and play around with that so Gigi thank you very much\nSo let's start things off tonight with something from a compilation known as\nEight bit operators in any one point five K. R. C. C. Y.\n[noise] home [laughter]\nOr the gay and lesbian fun for Colorado supporting public policy reporting and promoting programs designed to ensure all Coloradans have the same opportunity to thrive\nOn line at gay and lesbian fund daughter were\nNineteen Minutes ... seven o'clock It's Tuesday evening music makes maybe your frame Vicky thank you so much for coming along well have music coming up next some ... ...\n... ... ... when I started asking something brand new CEO ... ...\n...\n... [noise] Tunisia [noise] got to tell\nThat ... that\nShe talked to that\nA guy by the time [noise]\n[noise]\n...\n...\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n...\n\nTo ...\nBuy\nA ...\nIn my car is\nReally has come to ...\nOr a\nThey had ...\n\n... yeah\nI Know here\nA man\n\n...\n... ...\n\nThe\n... will will will will will will\n[noise]\nDo you teach your\nBusy busy people be\nChris just the early morning wandering shrimp you've been despite everything but the girl following was driving from the language of life and wrapping up that set with stereo lab and neon bean bag\n\nFree caregiver workshop designed to entertain form encourage and support anyone providing care to love one happening October twenty six in Colorado Springs or formation on our duty counter linked accuses you see that or gee\nNow you can turn into Ninety One point five or six feet without whipping Springer or just ask your smarts the way they are cc\nProgramming on Ninety One point five three or cc is supported by the Colorado Springs independent newspaper featuring the twenty eight gene best audition available October twenty fourth through November ... new scams or at sea is indeed dot com\nBust you gee resenting Steve Martin and Martin Short with musical gift that steep canyon rangers and Jeff ... Saturday July third deep the pikes peak center in forward access dot com that's a ex S. dot com\nChecking in with the weather for your partly cloudy skies and forty seven degrees in Colorado Springs overcast and fifty eight in canyon city employed low fare and fifty one for the hunter overcast and a lotta forty nine degrees there\nLook for clouds for the most part throughout our listening area this evening lighter wins and temperatures will be mostly in the low to mid forties uh upper thirties hold true for ...\nLighter wins and temperatures will be mostly in the low to mid forties uh upper thirties hold true for Trinidad and polite to being in this will be on the lower end of that thirty range\nOn friday sunny skies throughout the day when five to Fifteen miles per hour and temperatures will be in the upper fifties to the mid sixties and approaching Seventy for ... mind to Iraqi soy it's seven forty one coming up in this study music on I have a couple of new things\nFrom America do stay in St Vincent and starting off\nWith the latest from gorillas in Ninety One point five K. R. C. C.\n[noise]\nTry\nTo do\n[noise]\n[noise] well\n\n\n[laughter] [laughter]\n\nUm\n\nHe\nHe\n\nHe he\nHe racked up the um the ... the\nMain thing I mean I'll be ...\nYou'll see\nBut you'll see\nLike ... [laughter]\nBlack or you know\nAm\nAm\nDid\nLead you to me is\n\nThe ... the cat\nThe sand\nMe am I\nObscene to\nIn the street for\nTeam\nOf somebody who am\nI'm not I'm\nI Am I\n\nA little [noise]\n[noise]\n[noise]\n... state ahead of that a brand new one called uh well I actually got the wrong thing listed in front of me nervous ticks and that's in the latest Marable state\nSt Vincent from mass education I have that one right that is a redo of mass production stripped down to adjust to vocals from St Vincent ... Annie Clark\nAnd Thomas Bartlett beautiful beautiful record sugar boy and girl is at the top of the set from the now now and humility featuring George Benson\n\nWind down your week Sunday evenings which jobs from seven to trim buddy one point five years [noise]\nNPR Ninety One point five through your seats\n\nNPR Ninety One point guard through your cc you supported locally by the Colorado Springs fine arts center at Colorado College resenting Virgil orgies revolution Rogers against the invasion reimagining the sixteen eighty Pueblo rubble five hundred years later on you know Colorado College dot edu ... see\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs ...\nCase he see it struck bill and K W cc ed and with um park streaming at K. R. C. C. dot org just about one minute after eight o'clock\nThursday evening music mixed with your friends and neighbors Vicki got some JD make fierce in coming your way but let's go ahead and start off\nThis said his music or with an artist who was born in this day Nineteen twenty six district Chuck Berry\n[noise]\n[noise]\nAnd\nRun up to and fro hard working at a level where you'll end up getting camaraderie or\nAll do much on around me up to you by going to try and pay next week I\nTo look I'm trying to get me who want me to marry a ... dollar right out\nSame thing every day you know going to need a meter bringing in my object to go rule I\nMade to be [noise]\n\n\nThey told me something wrong going will mail order to grow up like when you pay a lot\nThe money will be losing\nMoney will be\nTold me to be involved\nBend in Yokohama fighting in wall Ahmed ... a\nMuch more to do\nTold me the million\nWere getting into the real estate agent in too many white but when the chicken chicken ... a delegate hip hop\nLeaning in\nThink\nHave changed\nAnd\nWhen bees and\nAnd get some time we can\nUp and get some time we you\nMinute on and get some time we went\n... ...\n\n\n... million\nLast year was ...\nLong and I'm here in New\nAbout the story\nI mean now you go below\nAnd my mom will be\nWhen the\nMom low when she was allowed to go whoa\nMan my father\nAnd now we're ...\nWalking down the road\n\n\n\nPaying ... rolls\n...\n\nBrand new music on Ninety One point five K. R. C. C. from Elvis Costello\nIn the in ... jurors look now and undermine getting together to make music new music because whenever they sure they sell out and people clamor for ... says there it is to share more right there you're in the ... the head of that\nAnd uh people clamoring for more so there it is to share more right they're sitting there broken singles ahead of that\nLoves middle name brand new let me try it Steve Earle in the middle of Jericho road in areas well JD make fears and from let the good times are all and it ... me up\nAnd starting off with Chuck Berry and too much monkey business\n\nAnd it's critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR in the Ninety One point five are cc newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidate\nBut quality costs money as a nonprofit media organization we looked directly to you to help pay the costs of our services [noise]\nBecome a part of the team contribute K. R. C. C. dot org today thank you\nYou can tune in to Ninety nine key are cc without leading up to ... years learning new name or in the unit\n[noise] programming on Ninety One point five or so you see is supported by climate Granite Mountain climbing structure and bar and\nBathroom remodel to help listeners prepare for the holidays and granted offers a wide selection of countertops a mushroom room or thirty twenty Nordstrom on line with climate agreement dog us\nTwenty one minutes after eight o'clock and you're listening to Colorado's NPR station Ninety One point five\nK. R. C. seen to restate evening music mix coming up in this next said I'm going to have some new stuff and Jimmy Smith\nLeon Bridges from coming home release from a few years ago so very good and the latest for him to cause but first attest to the emergency alert system\n\n\n[noise]\n\n[noise]\nGood [noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\nJohn Janine di di di ...\nDe la\nYou know and the female role\nI Will break it down your\nAdvance and then they brought a job in jail in Iran\nLast movie you saw that\nNoise like that I like Egypt yeah and then we'll go\n... dollar [noise]\nBlows my late in\nOn\n... [noise] [noise]\n[noise]\n... [noise]\n\n\n... ... people can [noise] bing bing bing bing bing bing bing bing bing bing bing ...\nWith ... with the ... with the bird [noise]\nNinety One point five K. R. C. C. and Thursday evening music mix ... just then from cooked yeah and infiltrate\nBernie music ahead of that from two claws life in the city fight the fire Leon Bridges in there as well smooth sailing what a perfect song that is from coming home and Jimmy Smith\nAt the top Jimmy Smith alive and music city Jimmy Smith plays Jimmy Smith and the cat\nThis election year you can count on to put the best journalists on the job from NPR to the Ninety One point five K. R. C. C. newsroom we bring you insightful reporting to help you understand the issues and the candidates you make it possible by donating at K. R. C. C. dot org thank you\nKnow you can tune in to Ninety One point five gay are cc without lifting a finger just down your smart speaker to noon in ...\n[noise] [noise] so many different ways to listen listen to Ninety One point five K. R. C. C. you know if you're missing some of the music in the evening music seven pm to midnight seven nights a week you have a favorite DJ you can go to ...\nIf you're missing some of the music in the evening music seven pm to midnight seven nights a week you have a favorite DJ you can go to music on demand ... ordered hit that listen tab ... music on demand\nAnd you can pick any DJ and and you show archived up to two weeks or that you want to hear a stream that on your computer or put it to carry it around in your your phone in your free Ninety One point five ... cc app\nSo lots of ways to I hear the music and the shows that you want where you want and when you want\nPartly cloudy skies and forty four degrees in Colorado Springs fifty chewing fair in Pueblo fearing breathing in Trinidad at forty five degrees and clear skies thirty nine in woodland park\nSome clouds for the most part throughout our listening area this evening light wins higher elevations will see temperatures in the low to mid thirties otherwise you can expect upper thirties into the mid forty range on friday sunshine throughout the day when five to Fifteen miles per hour\nAnd temperatures again higher elevations a bit cooler in the fifties or we could get into the sixties and almost Seventy for the hunter rocky Ford in Pueblo it's eight forty two let's get back into the music this with this year and a Ninety One point five K. R. C. C.\n\n[noise] [noise]\n\nOh\nNo\n\nWe are moving through law passed you on\nA\nPlane goes to the baseball team but I\nThink that you know I Am that named la la la a\nPitcher and it'd be a little bit further down the\n\nA\n\nKnow [noise]\nThen\nI'm\nThat and on and then a lot of those all those and you know they try and the job\nThe army a dialogue to live up to ... million dollars you know to me on\nTo the uh the more\nCan be\nA\n\n\n[noise]\n\n\n\n\n\n\n\nThe she\nShe\n\n[noise] Ninety One point five K. R. C. C. Thursday evening music Nixon is set that started off with the genes from when seen the night away and she lakes feisty\nFollowing with the bad in each other that from her medals release spoon hot sauce what a great record that was from them about a year year and a half ago or so\nCan I sit next to you and brand new dirty projectors taken from lamp lip pros and break through\nMy name is Benjamin Sharma presented in order a monument occupational medicine and money\nBreak through\nMy name is Benjamin German prison it an order of money with occupational medicine and money was Colorado are targeted audience are owners will companies each are professionals fifty managers and injured workers go to\nThe medical care that they need to get back to work boots ... quite a bit and we were able to team a lot of access to individually normally wouldn't have access to all through other means of advertising\nYou would like to become an underwriter like me ... seven when nine four seven three ...\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. hunter K CCS stark villain K W C. C. F. M. woodland park\nStreaming at K. R. C. C. dot org one minute after nine o'clock Thursday evening music mix and the third our other decided NPR hourly news which will happen at one minute after ten o'clock\nAnd Thursday evening means DJ probe will be in and that will be Thursday late night music right up to midnight and what a great adventure it always is on Thursday keep attuned to Ninety One point five\nK. R. C. C. hurting interview a brief interview earlier today em BBC uh with ... ... talking about what it's like to uh be huge too and touring to the crowds that you tour to and how you make sure\nEverybody gets to see in here so this kind of an interesting to interview and and wrestling with large amounts of fame but to to keep trying those boys from Dublin you two hundred Ninety One point five K. R. C. C. [noise]\n[noise]\n\n\n\n\nAnd starting off the set with the youth to from October in Gloria\n\nMy very first car was VW treaty I Am jet up and brought radiolab always really left it after this GPS perfect forty loved the shape of it and then gave me nothing but grief I broke down the\nBrooklyn Bridge push this thing across many lanes of traffic it was just freaking pizza junk at school to think that\nEven that card can be turned into and out to the radio lab turn your car into the programs that you love or\nInformation through your C. C. dot org memberships or the largest source of funding Ninety One point five tier cc allowing us to bring your local stories NPR News music thanks for your generous support this is your\nPark here cc allowing us to bring your local stories NPR News music thanks for your general support\nThis is your friend and neighbor Vicky thank you so much for hanging out there is the evening Tuesday evening music next\nTo the new coming your way from Gary ... later on the beach yeah yeah let's kick it up a delay Dallas oh very cool new record here in Ninety One point five K. R. C. C. called heaven\nAnd hell\n\n[noise]\n\n[noise]\n\n\n...\n\n\nSay [noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n... ... ... ... ... ... ... ... ... ... well no well\n... ...\n...\n... ...\nYou know ... ... ...\n\n\n... [noise]\n\nThe ball\nYour mind and\n\nDogs on a well no no no three and a gun to\nMe the ...\nWith your\n[noise] Hi I'm ... joined me from Sunday evening from ten to midnight for the dog got a ... right here in Ninety One point five year old [noise]\n\nYou can have the Ninety One point five care to see newsletter highlighting the weeks local and national news delivery\n[noise] now you can have the Ninety One point five care to see newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning sign up at ... dot org [noise]\nPartly cloudy has throughout our listening area this evening with temperatures in the thirties and forties a light wins going along with that\nFriday we'll be sunny throughout the day five ... Fifteen miles per hour on those when a little bit ... not too bad\nAnd temperatures will be in the fifties and sixties put ... in rocky Ford could hit the Seventy degree mark right now in Colorado Springs partly cloudy and forty two degrees\nIt's nine forty coming up at one minute after ten o'clock NPR our really news and with great pleasure\nThursday late night music with DJ probe keep it June to Ninety One point five K. R. C. C. getting into this last set of music for me here's something new from Bob Moses\n\n\n\n\n\n\n\nBig huge\n\n\n[noise] [noise]\n[noise] yeah so you\nKnow ... or\n... or ... or\n... pounds on a coupon hours for now [noise]\n\n[noise]\n[noise]\nKnow\nIf you ... [noise]\nThey just voted to during the ... I just wanted to get around the female [noise]\nNow do you do not believe [noise]\nHow do you\nToo much about the\nNasal [noise] three and a\nBomb or just like [noise] ... ... you had to do [noise]\nWe had the\nPower you know [noise] in the la la la la [noise] [noise]\nNa na\nNa na na na na\nNa na na na\nNa na na na na na na\nVe [noise] you\n\n\n[noise]\n", "city": "Colorado Springs", "day": "19", "state": "CO", "station": "KRCC"}