{"year": "2018", "show_name": "91.5 KRCC Music with Vicky Gregor", "month": "10", "content": "As would be five hundred two points to be doing basically flash ... ... I don't know where that came from ... mentality engineer the broadcast for us I'm Guy Raz host the ... [noise]\n\n\n... ... pm\nTwenty five point three times presented\nAs some ... five hundred and two points to begin to basically the last ... ... I don't know where that came from ... to engineer the broad as far as I'm got rid of all of the ... [noise]\n\n\n... ... pm and this is K. R. C. C. K. R. C. C. H. D. Colorado Springs ... hunter Casey has struck Phil and K W C. C. F. M. woodland park also streaming can you see that or gee\n[noise] Hi I'm tired of the membership manager here in Ninety One point five years on behalf of all of us here at the station thank you for your support for membership drives could not do this without your [noise]\nStill Seventy six degrees here in the downtown springs area seven o'clock hour or good afternoon good evening my herself hope you hope you got a gander at that sunset that just occurred [noise] wow\n[noise] it is a [noise]\nExactly seven cocky in Seventy six degrees here in the downtown springs area according to wane dire love is the ability and willingness to allow those that you care for to be what they choose for themselves without any insistence that they satisfied you [noise]\nIf you love GOOD Music you will know likely no doubt be uh satisfied by the evening news a mix with our friend and neighbor Vicki that is coming up momentarily first of the check in with NPR headline news and then it's today's edition of Dana life and then the evening music mix with sticky\n\nIf your new to the area or just a little forgetful and you'd like to know when your favorite program marathon Ninety One point five passing the visit our website for you'll find daily and\nWeekly program guy much more are the things that are working\nAgain headline news from NPR Dana life in the evening music mix with Vicki all coming up here on the one point five ... see\nLive from NPR News in Washington I'm jak sphere the FBI is wrapping up its supplemental investigation of Supreme Court nominee Brett Kavanaugh the bureau was expected to deliver the report\nSo and he'd like to know when your favorite program airs Ninety One point I Can't see the at our website you'll find daily and\nWe we have and they are have got elected\nAgain headline news from NPR daily life in the evening music mix with Vicki all coming up here on Ninety One point five care cc\nLive from NPR News in Washington I'm jak sphere\nThe FBI is wrapping up its supplemental investigation of Supreme Court nominee Brett Kavanaugh the bureau was expected to deliver the report to the Senate Judiciary committee as soon as tonight or perhaps early tomorrow NPR's Scott Detrow explains senators will then begin reading the report ahead of a vote Senate Republicans are pushing for this week\nEvery senator is being given the chance to read the FBI's findings but the report will be held very closely only one copy is being made available and will be held in the secure room the Senate uses for sensitive topics\nSenators and a limited amount of age with security clearances will be allowed to read the report the Judiciary Committee asked the FBI to conduct a one week investigation of claims cabinet assaulted Christine Blasey Ford and other women Arizona Senator Jeff flake yes vote was contingent on that demand\nBut the report scope is already coming under fire from Democrats for to set the FBI never tried to interview her Scott Detrow NPR News the Capitol\nAt least seven South Carolina law enforcement officers were wounded today one failing and upscale neighborhood in the western part of the city of Florence\nPolice say the suspect to open fire on the officers is in custody of officials are providing few other details Orange County corners identified the debt officer as a member of the foreign city police department Alan Hi Blair was the chief of police were responding\nTo the seat of an incident [noise]\nWhere they knew that there are others\nFrom the sheriff's office of brothers and sisters and the sheriff's office we're in the\nSnow insurance we're attempting to serve a search warrant on a home in the vineyards placed neighborhood the suspect was barricaded inside and fired on them as police were responding to the same edition of the one fatality some of the officers reported to have been seriously wounded\nInternational court of justice has ordered us to make sure it's sanctions don't hinder aid to all Ron the Trump Administration meanwhile is fighting back ... Iran abusing the court as a propaganda foreign Here's NPR's Michele ...\nTried that minister ration is pulling out of the Nineteen fifty five treaty of amity with Iran which you can use to bring its case against the U.S at the international court of justice national security adviser John Bolton says the U.S is ...\nKate it inside and fired on them as police were responding to the scene in addition to the one fatality some of the officers reported Ruben seriously wounded\nInternational court of justice was ordering the U.S to make sure it's sanctions don't hinder age neuron the Trump Administration meanwhile is fighting back ... Iran abusing the court as a propaganda form Here's NPR's Michele Calvin\nThe Trump Administration is pulling out of the Nineteen fifty five treaty of amity with Iran which Iran used to bring its case against the U.S at the international court of justice national security adviser John Bolton says the U.S is also withdrawing from another international protocol to undercut a Palestinian case that the court\nWhich challenges that decision to move the U.S embassy in Israel from Tel Aviv to Jerusalem\nUnited States will not sit idly by as faceless politicized claims are brought against us felt\nAn ad that he's now reviewing all agreements that exposed the U.S to the jurisdiction of the un tribunal Michele ... NPR News Washington the\nPrivate sector jobs report show solid games last month payroll processor eighty peace says private sector companies added two hundred and thirty thousand jobs to their roles in September on Wall street today stocks closed higher the dollar fifty four points the NASDAQ rose twenty five points you are listening to MPR\nThe engineer will help shape the sound of the Beatles has died ... was behind the controls the bans most imaginative projects from ... through Abbey Road bears ... Lucas reports emerged died yesterday of heart failure at his home in Los Angeles the age of Seventy two\nJets American came of age with the Beatles\n[noise]\nAnd I was ... years old when he began working it out of the road studios in London he was an assistant engineer for such early hits as love me do and a hard day's nice [noise] he became the Beatles primary engineer and just as he turned Nineteen and help turn the steel into a laboratory or salad\n\n\nHemorrhage went on to work with a wide range of artist from Michael Jackson to Kate Bush ... NPR News New York\nThree months after his daring helicopter scape from prison French officials say one of the country's most wanted man is back in custody officials say the gangster read one fight ... was arrested earlier today with ours\nDoes he turned Nineteen and how to turn this into a laboratory or Sally [noise]\n\n\nWent on to work with a wide range of artist from Michael Jackson to Kate Bush ... NPR News New York\nThree months after his daring helicopter scape from prison French officials say one of the country's most wanted man is back in custody officials say the gangster read one fight ... was arrested earlier today without resistance French media said he was taken into custody along with two other men and a woman bite\nEscape from prison in July with the help of our bash men who took a helicopter pilot hostage forcing him to land in a prison yard they didn't use power tools break through the prison doors and also fight to freedom ... features prices move higher oil up one point six percent today to close its Seventy six forty one a barrel\nIn New York I'm Joe ... beer NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build them more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station [noise]\nI'm even here in this day in a life or October third to live\nOn this day in Nineteen Ninety to ... performance on Saturday Night live ... NATO Connor singing I can tell a version of Bob Marley song war at the end of which she presented to the camera a photo of Pope John Paul the second which he torn to pieces we\nHave Dan and Terry [noise]\nOh oh oh\n[noise]\nThe\nO'Connor changed literary so far at least to focus attention on the issue of child abuse within the Roman Catholic Church\nWhich\nShow\nThe time the public was largely unaware of the Catholic Church widespread role in covering up child abuse and the Congress spoke openly in interviews later about the abuse she herself had suffered reaction in the press and elsewhere was swift and largely negative among the critics was Joe ... who hosted the show the next week it was my show\n[noise] tried\nCorner changed litters of early on to focus attention on the issue of child abuse within the Roman Catholic Church\nWhich\nIs\nThe time the public would largely unaware of the Catholic Church widespread role in covering up child abuse and the corners spoke openly in interviews later about the abuse she herself had suffered reaction in the press males were was swift largely negative among the critics was Joe ... who host the show the next week if it was my show for\nThe game was such a Mac [noise]\nTwo weeks later the tribute concert to Bob Dylan O'Connor was booed off stage\nWere [noise]\nSuch that she told her then there was no point in trying to [noise] later bought ... said nothing and [noise]\nAnd the earth is it [noise]\nWhen\nThe lights just raw deal by ranch direct building community through sustainable local food real food from local farms available at the ranch rude direct retail store on east ... street in Colorado Springs and online and rent free to direct dot com\n[noise] this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... case CCS ... K W C. C. F. M. woodland park\nStreaming at K. R. C. C. dot org it's eight minutes after seven o'clock on Wednesday the third of October I'm your friend and neighbor Vicki and so pleased to be joining up with you one more evening here and hopefully a many more to come\nMy ... sunset tonight was just amazing ten twelve different kinds of patterns in colors and things going on depending on where you looked in the sky but all of it a very beautiful and or something for all of us to share\nJust amazing ten twelve different kinds of patterns and colors and things going on depending on where you look in the sky but all of it a very beautiful girl and a something for all of that to share\nAnd comeback kid sharing than opening for the national her bread rocks\nAnd that happens next week October the night\nBelonged but he won't be long how are you ready for\nLong term elections are about senator and governor battling for power with the midterms are just about who wins and ... or even which candidate\nAnd that happens next week October tonight the\nWeight has been a long but he won't be long now are you ready to come up with\nThe term elections are about senator and governor is battling for power with the terms are just about who wins and who loses or even which candidates at what they're about why you vote there about issues in your community there about you listen to all things considered and hear the bigger picture every afternoon from NPR News afternoons\nAt three thirty Ninety One point five gay or C. C.\nProgramming on Ninety One point five to your cc is supported by the law firm of shook shops and Gorman reminding listeners to check batteries in carbon monoxide detectors for twelve years handling claims for those suffering from exposure to carbon monoxide more at ... dot com\nWhite forty five degree gallery celebrating our ... dream winter green transfers by the late William ... and ... drawings by Patrick ... knows this Friday five to eight at forty five degree gallery forty five forty eight west Colorado\n[noise] twenty minutes after seven o'clock this is the Wednesday evening music mix and Ninety One point five K. R. C. C. thank you so much for\nListening records with me tonight I got a lot of new step for you including some things have Sarah but just in a broken singles John Butler trio\nHas a thing called home and I want to start a fleet of Gregory Allen I took off from evening machine [noise]\nNo\nNo no\nNo no no\nDon't\nKnow [noise]\nSports were the\nTwo of them you know Joe\nWell\nMonet\nAnd then I\n\nGuy a\n\nOr the day on a ship\nThat many\nShow who she\nOn a cell\nDon't\nOr to buy\n\nThe ...\n\nNow we turn\n\nTo enter the low\n[laughter]\nI'm In my mind and you know\nJob on the vine and Asian painting and drawing disarming them wrong\nImplemented that I knew bought into the venue bonded and neither\nThing about the vine in ancient mating line then then then the drugs the bugs around on\nThe time no mind you're being in a\nIn in the run them into the job that I get that a lot of\nOne was the I'm In favor of the man live value them but I Will try it but I'm On my\nAre men do then I'm\nAnd ...\n... ...\nThe\nLast year\n[noise]\nBut at\n\nWell\n\n\n\n\n\nA\nAnd a\nAnd a man\nAnd\nNa na\n\nNa na na\nNa na\nNa na na na\n\nNa na na na na hey hey [laughter]\n\n\n\n\nAround the ...\n...\n... do you know ...\n...\nB was All right I mean\nBe a plus I'm happy\nWednesday evening music mixed on any one point five K. R. C. C. with your friends and neighbors shaky\nDish in studying things off at the top of the set was saint Simon you find that one and she she narrow came into the following with music to a ... by lunar isn't in there as well brand new Paul McCartney\nCame in Palo following with music to walk home by\n... them in there as well brand new Paul McCartney from Egypt Station happy with you\nThe Beatles following was nowhere man that from rubber soul and said and you hear about the passing of Jeff emerge that is a name we got used to seeing on many many build those records a as an engineer\nAnd working with a George Martin creating that magic we all love so much\nSam Phillips wrapping up that set of music for martinis and bikinis or record that she and a producer and then husband T bone Burnett\nHave produced and made together a to a chip the hat to the Beatles and to George Martin's approach to things you've heard same changes\nDid the president's tough tactics lead to a new trade agreement with Canada and Mexico without the Arabs we wouldn't\nBe talking about a year just for those babies out there that you're talking about the Irish voters lose Congress oh please don't charge tariffs and all the benefits of the new deal worth the cost of the suffering of American dairy farmers is resulting from President Trump's own poll on the next MORNING EDITION from NPR News [noise]\nTomorrow morning at ... am on the one point five to your seafood\n... southern Colorado's NPR station\nK. R. C. C. K. R. C. C. H. D. Colorado Springs\nK. A. C. C. the hunter case CCS start filling K W C. C. F. M. woodland park streaming at K. R. C. C. dot org just about one minute after eight o'clock the second hour of the Wednesday evening music mix\nAnd a music from an artist who was born this day in Nineteen fifty for Mr Stevie rave on\n\nCCS dark filling K W C. C. F. M. woodland park streaming K. R. C. C. dot org just about one minute after eight o'clock to second we're the ones they evening music mix\nAnd music from an artist who was born this day like tea fifty for Mr Stevie Ray Vaughan\nAnd and\n[noise]\n\n\n\n\nBlood diamonds or the\nBand and\nOh ...\n\nAll of a whole lot to do\n\nForever oh\nIn the sun goes\n...\nRobert de la\nLa\nLa la la\n...\nAround the corner\nDa da da da\nDa da da da\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt\n\nWhy would you be\n[noise]\nYou\nKnow not drawn back all\nMom no no no\nNo no no no\nMm\nMm\nMm Mm Mm\nMm Mm Mm\nMm Mm Mm\nMm Mm Mm Mm Mm\nMm [noise]\nOh\nReally I'm not sure all\n... ... ...\n... you know ...\nMm Mm\nMm\nMm [noise]\n[noise]\n[noise]\n[noise] we're not sure of all\nGear or a beer [noise] Mm\nYou know ... ... ... yeah yeah\n\nMm yeah oh well\n... to ...\nThem in the journal [noise]\nMm\n[noise] Mm Mm Mm Mm\nWhere deeper and deeper no\nI'm a law does show the news day and\nA\nNew show\nA woman who live there oh let's say ...\n\nOh yeah yeah\n\nYeah me too Mm\nYeah most jobs do do do a good job [noise]\nOoh Mm no\nFood um\nYeah most jobs do know is a good job [noise]\n[noise] [noise]\n\n\nSome new music from string she's incident on Ninety One point five K. R. C. C. from the string she's in her lab a little E. pi forthcoming ... record and later in the year the song vertigo\n... given that Billy given from the top his solo record the big bad blues and second line Kelly Jill ... the head of that still the Jordan going back to roll away the stone\nAnd Stevie Ray Vaughan double trouble started you know things that help in the set with Texas flag\n\nBehalf of all of us here in Ninety One point ... thank you for your support during our faults\nGiven from his easy top his solo record the big bad blues and second line Kelly Jill Philips ahead of that still the Jordan going back to roll away the stone and Stevie Ray von double trouble starting off things at the top of the set with Texas flight\n\nB handled all of us here in Ninety One point five ... thank you for your support during our full membership drive your financial contributions will ensure that maybe one forty five years receipts provides accurate news and analysis user good entertainment today tomorrow and the day after he could not do this without [noise] right\n[noise]\n[noise] it's Twenty one minutes after eight o'clock this is your friend and neighbor Vicki hope you're doing well tonight sure like you when you come along for the ride making her way to the work in week\nDoing that together still have some new Macy Gray coming your way and dirty projectors will get into some sly and the family stone as well you're listening to Ninety One point five K. R. C. C. and the Wednesday evening music mix\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] you know I'm just\nOh God\nAbout uh\nYeah\nOn and you know God\n[noise]\nMm\nMm Mm [noise]\n\nYeah well it does say I'll bet round up day to be available you let's see [noise]\nI'm about to go and then we'll know for me to say yeah\nTo bail me [noise]\nKnow about\nIt's all about\nGetting a rabbit and smile\nAnd\nKnow what I'm saying and I knew how ban the guy\nReally on\nStraight talk\nMade a new mom and dad and my\nOther one\nAnd most of them\nI'm saying and then you have banned the cash\nReally on\nStraight talk\nI made my mom and dad and my\nOne of the fun when you know\nOf God I Wish I could get killed [noise]\n\n\n\nMan in a\nUnion band you made a\nGood I I Wish I could get that sank down [noise]\n\nKept Battlemind new is well ahead of the Moses dirty projectors scrum lamp lip pros your is the one featuring Robin ... from the fleet fun scene yeah\nTo battle lines new is well ahead of Bob Moses duty projectors from lamp lip pros your the one featuring Robin ... from the fleet Fox is singing outlast him down that as well\nOr requests for Amy Winehouse a good one to back to black wake up alone sly and the family stone with if you want me to stay and at the top of the set the latest from Macy\nGray the forthcoming ruby release and over you\n[noise] [noise] Hi I'm tired of membership manager here at one point five years on behalf of all of a ... I think you want or support for membership dry food not due to [noise]\nUm\nI'm ... and you're listening to Ninety One point von ... or\nNPR oh Ninety One point five through your cc you supported locally or the Colorado Springs independent featuring the election issue with coverage of candidates and ballot initiatives happening this fall papers available at over eight hundred locations around the area reports and features on line it's yes indeed dot com\nBust the Colorado Springs Brunner center at Colorado College presenting strict we're in love it comedic Rob filled with adventure Elizabethan England September twenty seventh through October twenty first tickets at Colorado College dot edu slasher if they see\nHope you're doing well this beautiful Wednesday evening it's eight forty and weather wise cloudy and Seventy in Colorado Springs fair and Seventy four for canyon city and pub blow partly cloudy and sixty four in ...\n... and ...\nPretty good chance of rain showers and thunder storm activity throughout our broadcast area this evening about a forty to fifty percent chance of that lighter winds cloudy skies in temperatures\nIn the forties and fifties tomorrow thirty to forty percent chance of continued showers scattered fog ah cloudy skies although it will be ...\nSeventy in Colorado Springs fair in Seventy four for canyon city in ... partly cloudy and sixty four in ...\n... and ... pretty good chance of rain showers and thunder storm activity throughout our broadcast area this evening about a forty to fifty percent chance of that lighter winds cloudy skies in temperatures\nIn the forties and fifties\nTomorrow thirty to forty percent chance of continued showers scattered fog cloudy skies although it will be sunny later on and you can expect ties to be in the sixties and in the seventies\nI've got some new music coming up in this next set from the Charlotte dies but I Want to start off with our very own southern Colorado's\nVery out in planes from their latest radio waves on any one point five K. R. C. C.\n... you know you're seeing but they are teaching them on a second\nCarry them home and you really need to really want to know that [noise] seem\nSo may men\nAnd your feet and are you going to\nA new way of going to ...\n\n... ... ...\nYou know your family came down so far and\nLoan man or a\nAnd ... in on that\nMeg Ryan\nAnd ...\nAnd ... where are you going to\n\nAnd these are my ...\nMy name is real and now\nOf snakes\nIs Larry and stories ...\n...\nWhere are you going to ...\nShows me a\nStory\n... a law a\n...\n\nA a\n...\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\nAnd\nAnd\nAnd and and\nWhere are you go to\nShows are really in a\nWay [noise] [noise]\n[noise] [noise] ...\n\nThen come by\nWhat do you go to a ... a\n... ... ... ... ...\n... ... ... ... ...\nThen\nThen by\n\nMan\nOh la la\nLa la\nI think you have the time and and me me\nYou have the time to spend ... million in\n... among some of the other great bands that are on now label helping to back them up on just for a minute this smithereens in the middle of the cover of something stupid from the cover tunes collection\nLittle Steven from Seoul fire his record last year and I'm coming back and\nMusic from an artist sits plane at star gays or is right now as we speak with Dave Mason Mr Steve Cropper from dedicated a salute to the five or else and helped me somebody\nDid the president's tough tactics leads to a new trade agreement with Canada and Mexico without tariffs we\nWouldn't be talking about it [noise] just for those babies are out there that you're talking about the Irish lose Congress oh please don't charge tariffs\nAnd all the benefits of the new deal worst caught part of the suffering of American dairy farmers is resulting from President Trump's own poll on the next MORNING EDITION from NPR News [noise]\nTomorrow morning at ... am on the one point five through your seafood\n[noise] this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... case CCS start selling K W CCF em woodland park\nStreaming at K. R. C. C. dot org\nJust a little after nine o'clock coming into this third our of the Wednesday evening music makes I'll have something new from phosphorus sent some built to spill and starting it off with the latest from Jim James taken from uniform distortion\nA Ninety One point five K. R. C. C. [noise]\n\nTo fill in starting you know with the latest from Jihad Jane taken in uniform stores and they were playing five K. R. C. C. [noise]\n\nUh\nA\nDa\nKnow\nStress and they hit is that from the new one the the the ... ... you know when do his ... if you could see you in reverse tree is ...\nPhosphorus in ahead of that from the new one say levy and new birth in New England built to still going back a few records to you in reverse traces its probably as close to a hit is they came and\nA great band every album they make is so interesting in involving Jim James sure my morning jacket starting things off at the top of the set with throwback from uniform distortion\nDid the president's tough tactics lead to a new trade agreement with Canada and Mexico without tariffs we wouldn't\nBe talking about a deal just for those babies out there to keep talking about there are others lose Congress oh please don't charge tariffs\nAnd all the benefits of the new deal worse to caught\nPart of the suffering of American dairy farmers is resulting from President Trump's own policies\nAnd the next MORNING EDITION from NPR News [noise]\nTomorrow morning at five AM on Ninety One point five\nTo your C. C. programming on Ninety One point five tree or see she is supported by Colorado Ballard presenting the ... Sleeping Beauty October fifth through the fourteenth ... Ali Caulkins opera house would live music by the Colorado belly orchestra Colorado bally dot org\n[noise] twenty minutes after nine o'clock till Wednesday evening music mix with father John misty from his latest and such a successful record for him good reason to from God's Favorite customer I Ninety One point five K. R. C. C.\n\nThe news\nYou\nKnow\nI'm new\nUsed to\nKnow in the ...\nThe um\n\n\nYou go to his show\n\nYou go to the uh\nSo both the ...\nA yo la I'm there all the time\nOr\nWhat she would read\nAnd\n[laughter]\nNa\n\n[noise]\n\n[noise]\nAre areas of light rain breezy\nA areas of light rain breezy clouds\nAre all over town here in Colorado Springs sixty five degrees that chance of rain forty to fifty percent throughout our listening area holding through the uh overnight cloudy skies light wins and temperatures will be in the forties and fifties\nOn Thursday thirty to forty percent chance of showers they're scattered fog and missed\nCloudy skies clearing up to a partly sunny later on in the day and temperatures will be in the sixties and in the seventies just short of nine forty let's get into this last set of music\nFor in a Wednesday evening music makes something brand new from Mary boosts state [noise]\n\n\n\n\nWoman local or\nOr or or you know\nBe able to buy a\nYeah\n\n\nNavy and the issue is linked to\nThe\nTo\nDay and you\nShe does and\n\n\nAnd\nNa\nNa na na\n\n[noise]\n\n\n\n\n\n... ... ... ... ... ... ... ...\n... ... ... ... ...\n... ... ... ... ... ... ...\nThe ... the book is called\n\nWe'll just get used to\nThey read the book is called\n", "city": "Colorado Springs", "day": "04", "state": "CO", "station": "KRCC"}