{"year": "2018", "show_name": "91.5 KRCC Music with Vicky Gregor", "month": "10", "content": "This is a beer and this is K. R. C. C. K. R. C. C. H. D. Colorado Springs ... hunter Casey CEO structural K W CCF in woodland park and streaming appears cc dot O. R. G.\nNinety One point five carry the scene would like to thank the many businesses\nAnd arts fruits that market their products and services on our station each year\nBy choosing Ninety One point five ... they are investing in our community and we recommend support them in return\nI Do think Ninety One point five here in the bay are investing in our community and we recommend support them in return\nInformation on how to become an actor writer and care for the last four continents\nFour zero one\nOver here Leo Tolstoy tell it people try to do all sorts of clever and difficult things to improve life instead of doing the simplest easiest thing refusing to participate in activities that make life bad\nShift past seven o'clock we invite you to keep attuned to Ninety One point five care cc and participate in an activity that will definitely make life good the evening news it mix with our friend and neighbor Vicki it's coming up here and momentarily right after headline news from NPR in today's edition of daily life\nForty eight degrees here in the downtown area fierce guys clear in cold tonight and mostly thirties overnight and then the sunny and it'd be a bit warmer for Saturday with a ... a touching Seventy for ... hunter mid sixties for the rest of the lower elevations little bit cooler for the uh high country but then\nA snowstorms moving our way winter storm watch for the ... mountains tomorrow night through Sunday night all of our listening area looks to be a colder and snowy or by Sunday\nLive from NPR News in Washington I'm ...\nHurricane Michael is long gone but the damage it left in its weight along with the mounting death toll will have a lasting legacy\nSearch and rescue teams are beginning to find bodies in and around Mexico beach where Michael Ward as sure as a category for hurricane with one hundred and fifty five miles per hour winds the official death toll is at least sixteen but that is expected to rise in Panama City Florida resident on trees McCormick says there are lots of people who are stuck\nHopefully helping some we're\nNobody came in and out and hopefully we'll be saying so [noise]\nHopefully or in some areas FEMA crews are using bulldozers and other heavy equipment to push a path through debris meantime authorities are handing out food and water the storm also cause damage in Georgia the Carolinas and Virginia\nTropical storm Michael Pashtu Georgia devastating several that states crops from member station WBUR a B. E. and Atlanta ... Sharma reports much of the damage was in southwest Georgia hurricane Michael or right before most\nOf the state's farmers had started harvest for the season specifically for the kinds peanuts and cotton\nGeorgia hurricane Michael arrived before most of the state's farmers had started harvest for the season specifically for the kinds of peanuts and cotton George's agriculture commissioner and carry black says he outlined farmers cotton crop in South Georgia\nIt is our ... I have seen gotten that were being harvested yesterday was standing in ... and you can ... and where the rest of it was harvested by the storm\nState officials say at least fifty three publishing houses for all the destroyed and five counties in southwest Georgia Georgia pecan growers experienced major losses last year and during Hurricane Matthew for NPR News anchor steam sound the Atlanta\nPresident Trump welcomed the release of an American pastor who was held for more than two years in Turkey NPR's Scott Horsley reports Trump expects degree pastor Andrew brunch at at the White House this weekend\nTrump says he expects Andrew Brunson to get a full checkup in Germany on his way home to the United states but he thinks the American pastor is in good shape Brunson was arrested in twenty sixteen as part of a round up following the failed coup attempt against Turkish president Recep Tayyip or the one\nWe're very honored to have him back with us he uh\nHe suffered greatly but we're very appreciative do a lot of people a lot of people\nTrump's his administration made no concessions to turkey in exchange for Branson's release spokeswoman says the administration remains deeply concerned about the continued detention of other us citizens in Turkey and around the world Scott Horsley NPR News the White House\nJust by recent remarks by President Trump that have been critical of the Federal Reserve is treasury secretary says the president respects the independence of the interest rate setting body treasury secretary Steven Mnuchin said Trump's comments including what he said about the fed being out of control indicate his own stance on interest rates\nThe Dallas up two hundred and eighty seven points this is NPR\nAmerican astronaut and a Russian cosmonauts are now in Moscow arriving there after a failed rocket launch the pair were bound for the international space station when they had to use an escape capsule two minutes into the fight after their Soyuz rocket suffered an unspecified failure of its second stage\nThe two men are apparently OK after making a rapid dissent back to earth\nNow says Nick Hagen Russia's Alexi ... chin and were brought back from Kazakhstan where they boarded launch occurred\nThe Taliban are reportedly killed eight soldiers and civilians in northern Afghanistan Jennifer glass has more from Kabul\nAfrican officials say the soldiers were killed when their talents\nTaliban have reportedly killed eight soldiers and civilians in northern Afghanistan Jennifer glass has more from Kabul\nAfrican officials say the soldiers were killed when the Taliban attacking military outpost in Archie in ... province northern Afghanistan as civilians were killed in far yet also in the north when a car bomb exploded prematurely they were Taliban casualties in both instances\nThe car bomb target with an election rally the latest violence I had a parliamentary elections next Saturday the Taliban and Islamic state have called on Afghan to boycott the vote and it promised to disrupt it\nThey've already targeted voter registration centers election workers and candidate killing and injuring more than three hundred and fifty people for NPR News I'm Jennifer glass in Kabul\nUp chicken hazing reports at Dartmouth College is prompting the ivy league school to take steps to put an end the practice including hiring an investigator to look at over a dozen groups including fraternities and sororities\nCollege officials telling the school student newspaper the investigation is tied to increased reports such activities over the fall semester including reports of excessive alcohol consumption and inappropriate sexual\nBehavior I'm jak spear NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include the Robert Wood Johnson Foundation working alongside others to build a culture of health that provides everyone in America a fair and just opportunity for health and wellbeing more at our W. J. F. dot ORG\nI'm Ryan ... and this is at the end of life for October twelve [noise]\nToday in Nineteen Seventy one the musical Jesus Christ superstar premiered on Broadway it was the ... version of a Nineteen Seventy rock opera concept album with music way a twenty two year old Andrew Lloyd Webber and lyrics by Tim race for years his senior\nTo shoot it picks the final week of Jesus as life with a particular focus on Judas one of the twelve disciples of Jesus Christ and the one apostle who the ... trade him sitting in motion a series of events that led to his crucifixion in death\nBut also ultimately his resurrection\nIn the opening number heaven on their minds Judas declares his admiration for Jesus that offers a powerful warning about his followers\nFor the apostles or restless questioning Jesus relentlessly\n[noise]\nAs a means of comforting Jesus Mary Magdalene is by his side continually reminding them\nOf course everything is not alright\nAndrew labor's decision to set the song of the off kilter time's signature of five four with five beats per measure instead of the expected for is her clearest warning of what lies ahead for Jesus [noise]\nEven if you don't already know how the story of [noise] and the rest as they say is history\nBut in the life has brought you buy ranch food to direct emphasizing the importance of knowing where food comes from how it is produced and how far it travels locally produced food available at the ranch rude to direct to store the twelve twenty eight east Fillmore an online at a ranch food to direct dot com\n[noise] this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. ... case CCS start feeling K W CCF Sam woodland park streaming at K. R. C. C. dot org\nEight minutes after seven o'clock friday the twelfth of October\nFor all of you who work so hard to get to friday congratulations you are here friday evening enjoy it I'm your friend and neighbor Vicki hope you're doing well\nI Want to give away a in this first hour of the friday evening music next uh the chance to pick up against ... for you and your friend\nTo go check out this side door\nAnd see I'm Carl Blau empire low low performing together on Sunday October the fourteenth she'll be listening for your chance to pick up on that keep attuned to any one point five K. R. C. C. let's start things off with will come from Yankee hotel foxtrot\n\n\n[noise]\n\n\n[noise]\n\n\nSees\nThe lead in winter\nBut you wrote a poem the steam or to the violence on this um\n\nYou see a gone\n\nLove you want to take with you\n\n\n\nAnd they should run laughing through your fingers and you want to take with you to the land of the winter\n[noise]\n\n[noise]\n[noise] [noise]\n\nOh\nMoon and\n\n\n\nMean there\nBeep beep beep beep beep beep beep\nBeep\nBeep beep beep beep beep\nBeep beep beep beep\nBeep\n[noise]\n[noise]\n[noise]\n\nWas twenty fourth annual Emma Crawford coffin races and festival happening Saturday October twenty seven\nMore information on this and other public service announcements can be found on the community calendar link ...\nNinety One point five K. R. C. C. is dedicated to covering southern Colorado and the Rocky Mountain west your membership to directly funds are journalism thanks for supporting Ninety One point five K. R. C. C.\nProgramming on Ninety One point five ... or so you see is supported by university park to care center in Pueblo providing stroke and Parkinson's care Osama's here as well as long and short term rehab committed cultivating a nurturing skilled nursing facility university park Pearson or CEO dot com\nBy the Colorado farm an art markets open through October thirteenth\nWednesday's three to six thirty at the Colorado Springs pioneers museum and Saturdays nine to one at the margarita ... farm in our market ... dot com\nPartly cloudy skies and forty seven degrees in Colorado Springs staring fifty five for Kenyan city in public\nService reports fair and forty six and fifty three in the hunt a\nClear skies tonight throughout our listening area lighter wins\nAnd temperatures and the crisp side mostly in the thirties and low forties\nSaturday promises to be sunny and temperatures back up into the sixties and seventies very pleasant come Saturday Night into Sunday Morning the changes hitting all the way through\nA forty to sixty percent chance of snow showers one to three inch accumulation to winter storm watch ineffective Sunday\nSunday night for the Trinidad areas so you're going to get it\nThree inch accumulation to winter storm watch ineffective Sunday\nSunday night for the Trinidad area so uh you're going to get it all this week and it's the full meal deal so we do travel safely if you're out late Saturday Night certainly on Sunday hunker down if you can but I enjoyed all safely\nAnd possibly from a bit of a distance unless you want to get in and roll around in it and that's OK to\nI Want to give someone a chance to pick up the guest list for themselves in a companion to catch Carl Blau importer low low at this side doors Sunday October fourteenth a side door sixteen forty five state so the take home street or\nIn the former blue star building so very convenient here in Colorado Springs area if you'd like to be that person who picks up on that gas with but\nBe color number three at four Seventy three for eight to one one eight hundred seven or eight to seven to seven color numbers three that puts in music now from someone who's playing tonight at ivy wild Mike Clark and\nUm no mom right\n\nHer through\nA long\nOff a long\nTime ago well below zero\nThe around the law suit\nI'm going to go\nThey are\n'em right\nJob to go to Iraq\nWell no we're\n... do\n... and what we're\n... we're\nA dime to go there and the\nIt's time to go out there and the\nThe first leg oh\nThe ah about\n... a rather\nAm a\nAnd ...\nOh\nAnd then in ... and ... and ...\nAnd ... and ... and ... ... ...\nThe top ... and the banner whoa whoa and lobster news page though many leaders\nIn in ... a ... a day\nAnd in in in in ...\nShe went on the back balance the pain to the ground in the ... and well Joel and Joel man you and they have been\nA big ... big he got involved\nIn again and again in ... a\n... and ... and\n... and ... and ... ... and in ... new\nBook out much too big and you can do and\nDuring the ... mile mushrooms and like you can do it\nAt all and I'm really are they the the ... I may be\n\nPain in the wall new law saying he been paid in dollars and in\nThis world and ... and ... on\nAs long as you open a ... ...\n... ... ... ... ... ... ... ... people who are welcome a\n... fears than it had him that we lucky penny from a divided heart and soul since the stick the way the walking blues\nAnd starting things are with the southern Colorado is very on the go to Michael clerk that Mr Mike clerk bound to break from his CD at the same name\nNinety One point five K. R. D. C. and Dr Laura ... had created the legacy bond to help thoughtful generous listeners build their philanthropic goals of ensuring public radio for future generations please consider the K are the the legacy fun when thinking about your state planning\nYour legacy gift will help Ninety One point five K. are the the provide programming that informs educates entertains ended Rich's southern Colorado for years to come more at K. R. C. C. dot org\nProgramming or Ninety One point or through your cc is reporter for the Goldwater springs independent you drink the election issue would covered your all of the new shoe to drop\nOne five three or cc is supported by the Colorado Springs independent you drink the election issue would coverage of candidates a ballot initiatives happening this fall papers available at over eight hundred locations around the area reports in features on line it's cs Cindy dot com\n[noise] this is still there in Colorado NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. lion\nCase CCS dark killing K W C. C. F. and woodland park\nStreaming at K. R. C. C. dot org just about one minute after eight o'clock on your friend and neighbor Vicki wishing you all wonderful friday evening get back into the music kicking it off with see progress a Ninety One point five K. R. C. C.\n[noise]\n\nBe [noise]\n[noise]\nWithin the Honda let it bother\n\nAnd\n\nTo\n\nThat's\nIn the\n\nAnd her\n\nMom had to\n\nTake\n\nIn the\nPaper\n\nHey how are you going to\nGo\nBack\nTo\nThe [laughter] the\nPain and\nPainter\n[laughter] [laughter] oh my\n\n\nThe Jews normally\nDuring the years you\nNinety One point five skinny or see see the music of spiritual life from the brand new one and nothing hurt here it comes to erode let's go\nHead of that by requests wooden ships and force ... Led Zeppelin in they're going back to physical graffiti and trampled under such\nAnd starting ... at the top of the ... was super grass taken from road to real and it kills the during part for five and six\n\nMembers from the judge merged with for years\n... ... ... or ... or ...\nOn Monday when with for years he\nJoined me for a journey through like Bob Hope of vocal was above covered also the seven to two Ninety One point for years [noise]\nNinety One point five care cc has been southern Colorado's NPR station since Nineteen eighty four discover more ... dot org and follow us on Facebook and Twitter\nNPR oh Ninety One point five to your cc is supported locally with a law firm of shook shops and Gorman reminding listeners to Chuck batteries and carbon monoxide detectors for twelve years handling claims for those suffering from exposure to carbon monoxide more ... and ... dot com\nBy a lot in drug gallery on the upper level of tropical hills mall offering a large selection in stock in more the ability to search the country to find the right rugs for each client or designer a ... rug dot com\n[noise] this is your friend and neighbor Vicki hope you're doing well this Friday evening thank you so much for spending some of it with me it's twenty three minutes after eight o'clock\nI got a set of music coming your way that's going to have something new from cat power some William fitzsimmons and starting off with St Vincent and a bit of a redo of two thousand seventies\nMass production this called mass education and stripped down version of the songs from that record check it out in any one point five K. R. C. C. I should\nSay in Chile\nTo slow\nThis go\nFor this thing\nI Know a father does not\n\nMean\nTrying\nTo ... miles\nFrom me oh I leave you dance\nAnd with um my yard and\nLeave you\nYou know ... ...\n... is ... ...\nYeah\nI mean I'm a mid day care center but in\nIn mud di di di di di di\n...\n\nLee\nI\nBeyond and leave\nThem to none lead to go\nTo my yard and\nLeave you done with ...\n... ...\nVisas\nAnd on and we\nDon't want to read us\nAnd you\nReading a\nKnow a bunch of ...\nThe rain and river on\nA brain tumor\nA two word ... but\nAnd stronger [noise]\n\nThe rain and\nWhere\nBrain tumor\n\nR O\n\nA long time between records I think it's been about six years so a very good to hear from her and ... Stevens going back to carry and law and the only thing\nHey thanks for listening this is David Draine ... students I'm Rachel Martin say there is Joshua Johnson the host of one day and I'm Abigail backs and joined me and my co host weekday mornings for news and cultural coverage on Ninety One point five K. R. C. C. hey everybody this is ruby foster this is crystal hello this is Michael from\nListening to Ninety One point five K. R. C. C. music seven pm to midnight seven nights a week\nProgramming on Ninety One point five ... or so you see is supported by Rocky Mountain PBS presenting seasons of arts district a weekly half our television program devoted to Colorado arts and culture including stories from the pikes peak region you voted on PBS dot org slash arts district\nBy ... kitchen a Colorado company with Russia never frozen three gone family meals in the same way meat department like chicken fajitas smoked pulled pork and carbon goulash dinner for ... minutes highlands kitchen dot com\nPartly cloudy skies and forty three degrees fifty to ... below fifty in Trinidad some lake George weather for ya\nFair and thirty four clear and forty one in woodland park clear skies for the most part throughout our listening area lighter winds temperatures in the thirties and low forties\nSaturday sunny throughout the day and he can expect sixties and seventies higher elevations will be in the upper fifty range\nAnd then Saturday nights Sunday and Sunday night it changes up windy conditions a very good chance of snow sixty percent chance of that for the most part winter storm watch\nA Sunday for the Trinidad area and you can expect up to at least three inches of accumulation and and we'll keep you updated if that tends to get even a more a ferocious I don't know if it's going to be a big storm but it's definitely a change\nAnd we'll keep you updated instead to tend to get even a more a ferocious I don't know if it's going to be a big storm but it's definitely a change and that snow is going to be with us through Sunday night and really back into Monday\nIt looks like a ... stops and we're back into a cruel and insurance so we'll keep you updated here in Ninety One point five\nK. R. C. C. it's eight forty one I've got to music coming your way from Gus Gus and starting it off with the LCD sound system\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\nShame shame\nShame shame\nShame\n\nShame shame shame\nHa ha ha ha ha ha ha\nHa ha ha so most of\nFor a movie not\nFor a living so you know she told\nMe she loved\nBold\nMe and told\nThe only new ... day\n\nThis week on all things considered here the latest new it has been an honor to like that do deserve\nMuch I mean what we have a number of people would would very much like to do a great position and some things that are so Syria has no children no structured mind goes with the song patrolled you're going to go free or you know wasn't all things considered\nTo the bigger picture every afternoon from NPR News afternoons or three dirty on Ninety One point barbecue your see see\nThis is southern Colorado than NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs\nK. E. C. C. law to case CCS dark cell in K W cc FM woodland park streaming at K. R. C. C. dot org it's nine o'clock this third our of the friday evening music mixed with your friend and neighbor Vicki\nAnd the latest from your all time is and the pain\n[noise]\n\n\nDa\n[noise]\nNo and we\n[noise]\n\n\n\n\n[noise] [noise]\nA\n\nBarber ballooning in our ... our number one of my\nMain thing\nDo so much for\nMean yeah the ... hour\nThe world\nAnd then when you're out on the outer\nBanks in the tea wherever\nBe adults do to\nBe like\nThe ding ding ding ding\nDing ding ding ding ding ding ding ding to come home\nAnd who do you think the\nDing ding ding ding\nDing ding ding ding ding ding ding ding ding\nThat group is\nMuch are allowed to all the time\nStream marijuana should I'm your guy\nGuilty or not\nKiller's ...\nBy the end worth writing all the nurses funder Lucia always hearing aids are okay and brand versions\n[noise] [noise]\nNah nah nah nah nah nah nah\n[laughter]\nMind your own and I'm Lynn\n... class\nA man\nWho my boy [laughter]\nDo\n\nYou think\nThey knew why\nBad\nYou don't happen to\nMe to do\n\n\nAsked you\nAnd\n...\nDa\nHey\nAnd you can say I don't\nThis and\nCheese da\n\nNa na\nNa na na\nAnd and and\n[noise] and\nAnd\n[noise]\n\n\nArea and a\nDa\n\nDa da\n\nShip\nAnd and later\nMean a\nIn there and and and and and and\nAnd\nMore\nAnd ... and\nA half year\nAnd then\nEnd up\nAnd you know a\n\nThe\n\n\n\n\n\n", "city": "Colorado Springs", "day": "13", "state": "CO", "station": "KRCC"}