{"year": "2018", "show_name": "91.5 KRCC Music with Vicky Gregor", "city": "Colorado Springs", "content": "Or digital team includes German and does Tony Wagner and joined Griffith Ben ... is our digital visual producers are movies is the executive director of digital started yet as is the executive director of on demand I'm a result we will see tomorrow\nBut [noise]\nThis\nIs a beer and this is K. R. C. C. C. C. H. D. Colorado Springs ... hunter Casey ...\nBut [noise]\nThis\nIs a beer and this is K. R. C. C. K. R. C. C. H. D. Colorado Springs ... hunter Casey CEO struck feel K W CCF him with ... park and streaming a key or C. C. dot O. R. G. [noise]\nNinety One point five care he would like to thank the many businesses\nAnd art for that market their products and services on our place in each year\nBy choosing Ninety One point five parakeets the they are investing in our community and we recommend support them in return\nInformation on how to become an honor writers\nIn at ... dot org slash support or continental seven one nine four\nOr eight year old one\nNow you can tune in to Ninety One wing find K. R. C. C. without lifting a thing or just now starting to renew named ...\nHappiness according to John Barrymore often sneaks in through a door you didn't know you left open just past seven o'clock leave the door open to crack for our friend and neighbor Vicki she will be here and just a minute or so with the Tuesday evening music mix she'll be happy you did [noise]\nIt is a currently forty four degrees in the downtown springs area temperature is not quite as coal last night but still pretty darn chili run around the freezing mark give or take a couple of degrees and then a bit cooler for Wednesday\nBy the twenty to thirty percent chance we could see some scattered rain or snow showers as well but the eggs extended forecast does call for a mostly sunny and warm finished or the week\nAgain or a pair of force on the Ninety One point five care cc thermometer here in the downtown springs area at seven oh one\nHeadline news from NPR up next followed by today's edition of daily life and then Vicki and the Tuesday evenings mix\nFrom NPR News in Washington I'm ... beer and Florida sixteen people are now confirmed dead and the aftermath of hurricane Michael's destruction\nDoes call for a mostly sunny and warm finished the week\nAgain appear to force the Ninety One point five care cc thermometer here in the downtown springs area at seven oh one headline news from NPR up next followed by today's edition of daily life and then Vicki and the Tuesday evenings mix\nLive from NPR News in Washington I'm jak spear and Florida sixteen people are now confirmed dead and the aftermath of hurricane Michael's destruction it was the strongest storm to hit the region and fifty years NPR's Greg Allen reports twelve of the fatalities on bay county\nBay county in Florida's panhandle is where hurricane Michael made landfall with a sizable storm surge in one hundred and fifty five mile per hour winds some of the worst destruction is in Mexico beach or search and rescue teams have been combing through thoughts of destroyed homes with help of dogs and listening gear that's had been reported in Mexico beach it's not clear yet how many\nThe Florida emergency operations center says twelve debts in Bay county plus one death of neighboring Gulf county had been confirmed by medical examiner's under state law medical examiners are responsible for confirming and attributing Des occurring and their counties\nThat's from the storm of also been confirmed in Gadsden county ... county there were also deaths from hurricane Michael reported outside of Florida and Virginia Georgia in North Carolina Greg Allen NPR News\nSenator Lindsey Graham is calling on Saudi Arabia's came to name a new era over the disappearance of a Saudi journalist visuals in Turkey accused the Saudis are murdering ... inside the Saudi constantly in Istanbul cars so gee isn't us resident and Washington Post contributor on Fox and friends this morning Graham said crown prince Mohammed bin Salman is tainted himself\nThis guy is a wrecking ball he had just gotten murdered in that conflict in Turkey and to expect needed north ... hours on the floor every time defending Saudi Arabia because there is a good allies\nPresident Trump has criticized mounting global condemnation of Saudi Arabia and has warned against rushing to judgment Trump Building he's spoken to Saudi leaders have denied knowledge of what happened\nA group that includes former United Nations secretary ... moon is launching an initiative to look at how to more quickly deal with climate change bond leading the global commission on adaptation with Microsoft co founder Bill Gates and World Bank CEO ...\nGroup's mandate is to push further development of ways of dealing with climate change utilizing technology planning an investment\nPresident Trump today British tack on the Federal Reserve NPR's Scott Horsley has more last week President Trump\nNation of Saudi Arabia and his warned against rushing to judgment Trump Building he's spoken to Saudi leaders who've denied knowledge of what happened\nA group that includes former United Nations secretary ... moon is launching initiative to look at how to more quickly deal with climate change bond leading the global commission on the adaptation with Microsoft founder Bill Gates will bank CEO Christina George Eva\nGroup's mandate is to push further development of ways of dealing with climate change utilizing technology planning an investment\nPresident Trump today readers tack on the Federal Reserve NPR's Scott Horsley has more\nLast week President Trump blamed the fed and what he called it out of control interest rate hikes for a steep plunge in the stock market markets rebounded Tuesday with the Dow Jones industrial average surging more than five hundred points or two percent but the president was still critical of the fed in an interview with the Fox Business Network\nLike ... is the fed because the fed is raising rates too fast\nTrump acknowledge the Federal Reserve is independent and says he's not expressed his complaint directly to the fed chairman rising interest rates boost cost for the federal government along with other borrowers the administration is expected to borrow more than a trillion dollars this coming year Scott Horsley NPR News Washington\nChecking some other Wall Street numbers the NASDAQ was up two hundred and fourteen points the S. and P. rose fifty nine points this is NPR\nA caravan of around two thousand Honduran migrants has restarted its journey north hoping to reach the U.S border\nAfter sleeping on the ground in their clothes migrants were up shortly after dawn today in Guatemala escorted by police President Trump is starting to cut off aid to Honduras if it doesn't stop the caravan of former Honduran lawmaker traveling with the migrants who was detained by Guatemalan police\nLawsuit says some Georgia counties are unfairly rejecting mailing absentee ballots as Georgia Public broadcasting seeming Fowler explained just the latest legal challenge to the states voting system\nMore than a thousand absentee ballots have been rejected across Georgia's so far about a third of them come from a predominantly minority metro Atlanta county libertarian candidate for secretary of state's mice Duval is one of the plaintiffs\n[noise] period [noise]\nOne of the most common reasons for addiction is putting twenty Eighteen instead of the voters birth year when signing off on the ballot the suit wants minor errors like that to be accepted and counted groups of also sued over a state law that puts registrations on a ...\nAbout a third of them come from a predominantly minority metro Atlanta county libertarian candidate for secretary of state's mice Duval is one of the plaintiffs\nSay one\nOf the most common reasons for rejection is putting twenty Eighteen instead of the voters birth year when signing off on the ballot\nThe suit wants minor errors like that to be accepted and counted groups of also sued over a state law that puts registrations on a pending lifted their application does not exactly match a database for NPR News I'm Stephen Fowler in Atlanta\nJust by the legalization of marijuana in Canada US Customs and border protection officials noted remains illegal in the U.S and say those founded possession of the drug could be arrested and prosecuted head of customs and border protection says a Canadian who admits to pass marijuana use may be denied entry recreational marijuana officially becomes legal in Canada tomorrow\nI'm jak spear NPR News\nSupport for NPR comes from the little market offering artist and made goods and home to core with the commitment to fair trade\nA nonprofit founded by women to empower female artists and in marginalized communities around the world more at the little market dot com Andy any E. K. C. foundation [noise]\n... and this is a ... truck Tobar sixteen nano ... today\nIn Nineteen Seventy six Stevie Wonder is album songs and the key of life went to number one on the billboard two hundred chart mixing everything from gospel to jazz to ... the album produce several Stevie Wonder classics such as sir do\nAnd I wish [noise]\nFrom studio musicians to engineers his estimated at a hundred and thirty people worked on the album with contributions by fellow legendary crossover artist such as Herbie Hancock [noise]\nSaid it number one for a living weeks holding the spot longer than any other album in Nineteen Seventy six\nThey earned wonder the Grammy for best album as well as best male rock vocal performance best meal or and be vocal performance and producer of the year\nFrom studio musicians to engineers who is estimated at a hundred and thirty people worked on the album with contributions by fellow legendary crossover artist such as Herbie Hancock [noise]\nThan George Benson [noise]\nFilm said it number one for eleven weeks holding the spot longer than any other album in Nineteen Seventy six\nThat are in one or the Grammy for best album as well as best male pop vocal performance best meal or and be vocal performance and producer of the year rightly so the album also earned a spot on the national recording registry in two thousand three numerous paparazzi be funk and sort of the site of the album as an inspiration including prince Michael Jackson\nWhitney Houston Mariah Carey and George Michael who performed the album song village ghetto land for Nelson Mandela's seventieth birthday\n\nAnd the rest as they say cheese\nIn the life has brought you buy ranch food to direct emphasizing the importance of knowing where food comes from how it is produced and how far it travels locally produced\nFood available at the ranch rude drugstore or twelve twenty eight east Fillmore an online at a ranch rude to direct dot com\n[noise] this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... case CCF start selling K W cc FM woodland park streaming at K. R. C. C. dot org\n... minutes after seven o'clock It's Tuesday the sixteenth of October and your friend and neighbor Vicky thank you for coming along this week Tuesday here we all gather\nAt feels real good and I thank you for it let's go ahead and start off with Stevie Wonder songs and the key of life a volume is one into the hardest part is is is which one to pick so let's go this way and Ninety One point five K. R. C. C. [noise]\nSounds in the key of ally shoveling as one into the hardest part and this is which one to his so let's go this way and Ninety One point five K. R. C. C.\n[noise]\nYou can have great music seven nights\n[noise]\nYes [noise] you can have a great music seven nights a week from seven to midnight and Ninety One point five K. R. C. C. [noise]\n\nNow you can have the Ninety One point five ... newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning sign up at ... dot org\nNPR on Ninety One point five to your cc you supported locally with a law firm of shook shocked and Gorman reminding listeners to Chuck batteries in carbon monoxide detectors for twelve years handling claims for those suffering from exposure to carbon monoxide more at ... dot com\nBy planet granite locally owned and operated for Twenty years planet granite maintains a large selection of marble rented and more for listeners planning new build and re models at thirty twenty nor stone or online at planet rennet dock us\nThis is your friend and neighbor Vicki wishing you well this Tuesday evening the Tuesday evening music makes right here in Ninety One point five\nK. R. C. C. guts music coming your way from Arrested Development taken from ... a semi ... brown out fear of a brown planet and starting things off with a tribe called red from we are the hallucinations\n\nBye\n\n\nCalled red from we are now who Lucy nation\n\nNa na\n\n\n\n\nNa na na na\nDa da da da da da da da da da da da\nDa da da\nDa da\n\nDa di\nDi\nDi\nHe he he he hung up on the\n\n\n\n[noise]\n\nYou know ... ... ... ... to ...\nTo ...\nGet to\nThe ... and ... and who do during the day and age I'm ... I'm sure there's a man\nOr a a school\nOther player would boost\nMenu and I knew a man as it is is that they do\nMe a more do we know a ...\n...\n... yeah there was\nDo we do on it is the\nMan and a yeah yeah she had a man in\nAnd you know he he did that in\n...\nNew year to go ... edition line\nWhile\nAgo he\nGoing\nOn but they're not giving\n\n\nWe can be with you wherever you go all you needed your phone gets a Ninety One point five K. R. P. the mobile apps free at Google Play and in the eye to Adam dark\nOn Ninety One point five to your cc is supported by peak performance physical therapy for listeners with ongoing dream issues from runners and cyclists do golfers and hikers menu\nWe can be with you wherever you go all you need is your phone gets a Ninety One point five K. R. C. the mobile app free at Google Play and in the eye tunes avatar\nProgramming on Ninety One point five K. R. C. C. is supported by peak performance physical therapy for listeners with ongoing pain issues\nFrom runners and cyclists do golfers and hikers manual physical therapy can help resolve ... back in ... peak performance P. T. dot org\nBy Rocky Mountain PBS present in Colorado experience for any made Duncan a two part documentary on the figure the cheap Colorado Springs history during Thursday's November Ethan fifteenth at seven thirty pm on Rocky Mountain PBS\nThe Tuesday evening music mix on any one point five K. R. C. C. partly cloudy skies and forty four degrees in Colorado Springs fearing fifty for canyon city and ... forty in light of mostly cloudy and forty seven in Trinidad\nLook for partly cloudy skies soda listening area tonight also a twenty to thirty percent chance of rain or rain snow makes for Trinidad saliva and being a vista\nAnd it looks like temperatures will be mostly in the twenties and in the thirties\nWednesday partly sunny throughout the day a chance of snow and rain again in ... county and the Trinidad area in temperatures warming up into the forties and fifties I'm your friend and neighbor Vicky thanks for coming along let's get right back into the music with something\nFrom school of seven bells taken from disconnect from desire\n[noise]\nTime\n\n\n\n\n[noise]\n\nThe country\nTime and\nBy the time and\nCard and\nPregnant\nNews lately many many many many many\nMinutes a day\nDi di di di di di di\nDi di di di\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\nCar when you're coming come on another level [noise] [noise] [noise] [noise]\nNo my number one hour [noise]\n\n\n\n\nNinety One point five K. R. C. C. and the music of emancipator taken from Iraq you and Don my morning jacket ahead of that going way back to it still moves and master plan\nTommy ... another song that from the ... area a soundtrack to movies hysteria a remake post yeah I think that's in the Nineteen seventies classical horror movie you heard has ended\nAnd school of seven bells starting things off at the top of the set with dust devil from disconnect from desire\nIn this critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR to the Ninety One point five ... newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidates\nBut quality cost money as a nonprofit media organization we looked directly to you to help pay the costs of our services\nBecome a part of the team contribute at K. R. C. C. dot org today thank you\nProgramming on Ninety One point\nHere\nIn this critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR to the Ninety One point five K. R. C. C. newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues in the candidate\nBut quality costs money as a nonprofit media organization we looked directly to you to help pay the costs of our services become a part of the team contribute at K. R. C. C. dot org today thank you\nProgramming or Ninety One point for three or she is supported by ... celebrating Halloween drinks or Trump costume Carter the return of march ... mark ... grams covering the BP choosing queen October thirty first ... pm ...\nMrs southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ACC lie to Casey cs struck filling K W C. C. F. M. would run park\nStreaming at K. R. C. C. dot org one minute after eight o'clock I'm your friend and neighbor Vicki it's the Tuesday evening music mix coming up in the Senate music will have something from it smithereens covers record but go ahead and start off with something brand new from the grip week\n[noise]\n[noise]\n\n\n\n... ...\nThem for her and um\nAnd on and on the\nAnd then and\n'em\nNa na na\nNa na\nNa\nHer and I'm\nNa na\nNa na na\nNa\nNa na na\nNa na na\nNa\nNa\nNa\nNa and\nThe phone number ...\n... ... ... ... ... ... ...\n[noise] na\nNa\nNa\nNa na na\nNa na na na na ... ...\n... ... ... ... ... ... ...\nAnd then you know and\nBe\n[noise]\n\nAnd ah\n... and\nWe're\n\nThat [noise]\n\nShaken\nIn the in\n\n\n...\n... ...\nWhat\nNa na\n...\n\n...\nAnd ...\n\nThe ...\n\nI'm\nThe\n[laughter] [noise]\n\n\n[laughter] ...\n[noise]\n\n[noise]\n\nOh\nYeah that is brand new music from dillydally a Ninety One point five K. R. C. C. taken from heaven and believe\nRun Gallo ahead of dillydally from his latest stardust birthday party and loves Supreme work together\nSloan don't step it feels good to do it in the middle just ahead of slowness smithereens they're covered teens record and shaking all over starting off with the group weeds\nFrom trip around the sun brand new from the grip wheat and reality stand still\nWaited long but he won't be long now are you ready to go with\nThe term elections are about senator and governor is battling for power with the midterms aren't just about who wins and who loses or even which candidates at what they're about why you vote there about issues in your community there about you listen to all things considered and you're the bigger picture every afternoon from\nNPR News ... or ... or ...\nYour Ninety One point barbed here see the membership is vital we thank you for your financial support which directly formed or news music an online services you're sushi dot org [noise]\nTwenty two minutes after eight o'clock the Tuesday evening music makes got some new English be ready to go for you from here we go love a has more like stop and some real Mira coming your way as well keep attuned Ninety One point five K. R. C. C.\nShe [noise]\nOnline services here cc dot org [noise]\nTwenty two minutes after eight o'clock the Tuesday evening music mix got some new English be ready to go for a year from here we go love her husband likes to end them real near coming your way as you're well keep it to Ninety One point five K. R. C. C.\n[noise] I'm\nA while to decide\nWe going to work I Believe the young lady\nWho was going to be younger who were\nOn my GED who bought\nThe young\n\nKnow\n\n\nI'd be mad magazine and your grand bargain and\nLot of times but even now\nMuch you\n\n[noise]\nAnd\nBe and all\nWe use them\nNow 'cause we're living on Monday\nYou end\n\nUp in age and hunting country who've gotten bit edgy got you on the line\nThen you get a\nThe rules\n\n\n\n[laughter] [noise]\n[noise] [noise]\nFrom the dog and\nThe middle\nVote again not glamorous guaranteed gone there guys want a\nDi di di di di\nDi di di di ... said\nVery very bad\n\nThe to do with\nThe [noise]\nGod worry about the book\nI mean we're not\nAnd the way around be\nDown bald guy bought I bought me a\nStart out their top it all the time\nOh God I bought I bought me and I'm\nNot supposed to be a job at a\nDon't know I Know you do well out of\nIt oh\n\n\nWe oh\nThe Tuesday evening music Nixon Ninety One point five can you hear or see see started things out that the English Beat the brand new one called here we go love and didn't call the sky\nWe a mirror after that ... to go in there to like stop happy appear at going back a few records to junior something brand new following that John Butler trio from home and take ... blue and Brenda\nNever I take from me moon do and her take care of in\nThis election year you can count on to put the best journalists on the job from NPR to the Ninety One point five years cc newsrooms we bring you insightful reporting to help you understand the issues and the candidate you make it possible by donating at K. R. C. seats\nIt's a happy appear that going back a few records to junior something brand new following that John Butler trio from home and take Haitian blue and Brenda never audio tape from me moon do\nAnd her take on care than\nThis election year you can count on to put the best journalists on the job from NPR to the Ninety One point five K. R. C. C. newsroom we bring you insightful reporting to help you understand the issues and the candidates you make it possible by donating at K. R. C. C. dot org thank you\nNinety One point five ... she is dedicated to covering a changing southern Colorado your membership dollars directly fund our local reporting thank you for your sister a membership\nPartly cloudy skies and forty degrees in downtown Colorado Springs fear in forty eight for ... overcast guys thirty nine and being a vista clear in woodland park right now in thirty three degrees\nLook for cloudy skies light wins twenty to thirty percent chance of rain or rain snow mix for Trinidad and chief he county this evening temperatures will be in the twenties and in the thirties\nWednesday some sunshine although continued precipitation for saliva unit vista and Trinidad\nCandid about a thirty percent chance of that\nCloudy skies for there as well and it looks like temperatures warming up\nInto the forties and fifties just about mid fifty or so for the hunter and rocky forward looking into the rest of the week it appears to be a cool a but dry except for those few areas areas that will see some rain and snow so\nEnjoy whatever you get that's what I say\nLet's get back into the music that is what we get here is St Vincent and ... a crew stick stripped down version of mass production called math education on Ninety One point five K. R. C. C.\nIn a say so in ... you know they live on the phone number ... around and no\nVersion of math seduction called mass education a Ninety One point five K. R. C. C.\nKnow ... and ... said today is ... ... am but I can be around and no ... no no no I'm a\nOh a\n... and hang out by the by\nBlood I can blame Ron no lie\nOh uh\n[noise]\nYou and I knew you\nKnew in the news even then I'm going to\nFew who\nDo you how can\nYou know them and ...\n\n... ... some ... ... [noise]\nGood to be a inches\nGray and gets a mutt\nHow can I mean I just saw that on my\nIn a ... brain they build and build on civilian don't have an hour on gay or how can I I Believe I ... I Would do the ... and\nYou know you lose you\nYou know they just do a snake now look worry they build and build on where you don't have no gain a\n... I Would do the ...\nYou know these are not nearly as you know them and\nHow can you how can you do you not use them and she ...\nMan in\nThe young mom sacred cow\nRon and no\nBomber on it\nAnd\nHow how do you\nYou tell them to\nHave\nGot the zoo that'd be even\n\n\nThat time\nI knew\nThat I Am\n\nI\nMe against your movie Mm Mm Mm Mm\n\n\nMe [noise] I guess you would [noise]\nMe [noise]\n[noise] [noise]\nGive me [noise]\n\n\n[noise]\nTrying to [noise]\n\n\n\nI don't know\nI think one of\nPain why I'm\nBoy Lenny yeah yeah yeah and um\n\n\n[noise]\nNo\n\nNinety One point five K. R. C. C. and the Tuesday evening music mix started out for St Vincent from her latest math education the stripped down version of mass destruction and life H\nGets a following with a ride you find that one I chime in there to fill in as so with the die young and wrapping up the SAT\nWith members of cross record and share wider known as a loner and the song black widow\nMy name is ... president an order of monuments occupational medicine and monument Colorado targeted audience are owners will companies HR professionals safety managers and interpreters tells\nThe medical care that they get back to work really cares he sees helped us quite a bit we're able to obtain a lot of access to individually normally wouldn't have access to through other means of advertising\nYou would like to become an underwriter like me ... seven one nine four seven three for each one\nIs a southern Colorado's NPR\nStation K. R. C. C. K. R. C. C. H.\nIn monument Colorado or target audience are owners of companies age are professionals safety managers and injured workers or go to medical care that they need to get back to work with the blue Jay or CC's helped us quite a bit and we are able to team a lot of access to individuals we normally wouldn't have access to through other means of advertising\nIf you'd like to become an underwriter like me who's called Jeanette seven one nine four seven three for each year one\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. the hunter Casey cs start feeling K W CCF family wasn't a park\nStreaming at K. R. C. C. dot org one minute after nine o'clock the Tuesday evening music mix right here in Ninety One point five K. R. C. C. coming up in this set of music nicotine is from a long engagement\nAnd start you know for the record from a long ago but he was in my head so now it's all over you this is afro kelp sound system\n[noise]\nThe need to be in the game and\nWe need to be in the beginning he needs to be gaining he can be in the beginning\nBe\n[noise] [noise] [noise]\n[noise] [laughter] [noise] she\nEach each di di di\n\nDa\n\n[noise] oh yeah nightmares on wax on Ninety One point five K. R. C. C. from shape the future very fine record from two thousand Eighteen and got his smile how can you know when you hear that song\n... head of that from ... in there as well make a dean is featuring the shutdown black mourn living your dream\nAfro ... sound system starting things off at the top of this that we were really real part one from sound magic vying one\nWas well loved low you Nineteen Ninety seven ... absolutely no bells and whistles we had tried to sell it\nMy teenage daughters about who would get money out of it and I'm like no no one's going to buy it and then probably about I don't know six months ago I was like okay we're donating it at the simplest thing I've done\nOn a tour guide was wonderful stuff I'm Susan I live in Colorado Springs and I was ... years cc dog or word je record donation information\nNinety One point five terror cc is dedicated to covering a changing southern Colorado your membership dollars direct refund our local reporting thank you for your sustaining membership\nYou're listening to Colorado's NPR station Ninety One point five K. R. C. C. Tuesday evening music mix it's twenty five minutes after nine o'clock coming up at one minute after ten o'clock\nI'm I live in Colorado Springs and I was ... years cc dog or word je ... mentioned information\nNinety One point five terror cc is dedicated to covering a changing southern Colorado your membership dollars directly fund our local reporting thank you for your sustaining membership\nYou're listening to Colorado's NPR station Ninety One point five K. R. C. C. Tuesday evening music mix it's twenty five minutes after nine o'clock\nComing up at one minute after ten o'clock NPR hourly news and Tuesday evening means Dr T music master will be taking you to the midnight hour with another fantastic show a I already know some of the stuff he's got up his sleeve\nBut I'm not saying keep attuned to Ninety One point five K. R. C. C. and you'll find out in the most beautiful way back into it with a husky\n[noise]\nTry to stay in\nA [noise]\nA shame on me a loan\nFrom\nCould come to school\nAnd uh\nSure oh\nDa\n\n\n\n\nA\n\nNa\n\n\n\n[noise]\n\n[noise]\n\nIron in wine ahead of that was milkweed that's from the latest ... called we garden this see the see ahead of iron in line with all go writes from the light the name of\nTheir latest release and husky at the top of the set with dark sea from forever so\nThe Ninety One point five through your cc news treat the meeting was the third for scheduled around the corner in the end the ban passed on six to to vote over the past five years officials say the gym or excellence by the Colorado broadcasters association\nYou're Ninety One point five K. R. C. C. membership is our largest source of funding allowing us to bring you local stories music and news from NPR Thanks for supporting Ninety One point five K. R. C. C.\n[noise] yeah what she said it's nine thirty nine Tuesday evening music mix on member supported public radio Ninety One point five K. R. C. C. partly cloudy skies and thirty eight degrees in Colorado Springs partly cloudy throughout our listening area where the twenty to thirty percent chance\nOf snow rain or snow rain mix for Trinidad and chief county tonight\nAnd tomorrow those temperatures this evening will be in the twenties and thirties tomorrow's highs back in to the fifties for the most part higher elevations mid\nTo upper forties some sunshine will be peeking out here and there it is nine forty let's get into\nThis last set for the Tuesday evening music makes this side of NPR hourly news and the latest from low called double negative\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise] [laughter] [noise]\n\n[noise] [laughter]\nYeah\n[laughter]\n[laughter] yeah\n\nWe\n\nUsually\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\nOh\n\nWow oh wow\nOh\n... oh\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\nNa\nNa\nNa na na na\nAnd\n", "month": "10", "day": "17", "state": "CO", "station": "KRCC"}