{"year": "2018", "show_name": "91.5 KRCC Music with Vicky Gregor", "city": "Colorado Springs", "content": "\n\nThis is a beer and this is K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. hunter Casey CEO struck ville K W cc FM woodland park and streaming a care C. C. dot ORG\nHi this is helping black host of looking up the nerd showing astronomy here on Ninety One point five K. R. C. C. where every Monday at nine AM and nine PM and additional shows are are tied to care cc dot org and available and I don't remember keep looking up\nSupport for Ninety One point five K. R.\nAnd available and I tunes remember keep looking up\nSupport for Ninety One point five K. R. sci fi comes from local organizations who want to reach a well connected audience many discerning about noon culture\nAnd how they spend their money becoming a corporate sponsor has Ninety One point five care I mean your brand was stand out from the ground for more information about underwriting Jeanette Nevin one nine four seven three for\nJust past seven o'clock good evening a micro cells still sixty degrees here in the downtown springs area Mason cruelly uh pretty much nailed it with this one regret for wasted time is more wasted time\nAnd in my humble opinion ah it's never a waste of time listening to some great music and who better than to listen to that great music within our friend and neighbor Vicki\nThat's all coming up here and just a few minutes the Monday evening music mix with sticky right after a headline news from NPR that is next on Ninety One point five K. R. C. C. again the sixty the current temperature changes for Tuesday and Wednesday they'll cooler with a chance for showers\nLive from NPR News in Washington I'm jak spear Saudi Arabia says it's crown prince met today with U.S Treasury secretary Steve Mnuchin as NPR's Scott Horsley explains the Trump Administration is still trying to figure out how to respond to the killing of a U.S based journalist under the Saudi government's watch\nTreasury secretary mission is boycotting Saudi investment conference this week in protest the killing of journalists ... but the secretary still traveled to the kingdom for high level talks with Saudi officials President Trump says the U.S intelligence experts are working in Saudi Arabia and in Turkey to get to the bottom of ... death\nWe have some at least ... people that do this very well they're coming back then I ... and I will not first soon as I Am not satisfied with what I've heard\nSpeaking to reporters before boarding his helicopter Trump said once again he's reluctant to take any action that might jeopardize Saudi arms purchases more investments in the United states Scott Horsley NPR News the White House a boil\nWater notices in effect in Austin, Texas that's because the city's lake so filled with sediment following severe flooding NPR's Wade Goodwyn has the story Austin's\nWater is simply too dirty for the water treatment plants that go with to drink it must be boiled for at least three minutes and about a million customers\nWater is simply too dirty for the water treatment plants that go with to drink it must be boiled for at least three minutes and about a million customers are affected\nDishes could be washed and so we water but must be raised with boiled or bottled water schools are covering their drinking fountains and cafeterias are coping by being creative\nThe University of Texas and saint Edwards students faculty and staff\nMust also he the notice as new thousands of restaurants and fast food joints testing has revealed no biological contamination of the water yet often water says the boil water mandate will last one to two days probably Wade Goodwyn NPR News\nHurricane will is still a monster storm with a hundred and fifty mile an hour winds is moving toward the Mexican coast south that mass at lion the storm has weakened somewhat as it heads toward land though by any measure it remains a powerful category for storm Daniel Brown as a forecaster with the national Hurricane Center\nThe system is a forecast to be an extremely dangerous hurricane as it approaches the coast on Tuesday oh we're expecting an extremely dangerous storm surge along with a damaging hurricane force winds as well as the potential for flooding rainfall\nThese areas are very mountainous where it will be making landfall and that can cause flash flooding and landslides\nStorm last word with southwest of Catholic rent is hurricane force winds are extending upwards of thirty miles from the storm center\nAlgae Beatty leaders are reacting with anger and dismayed reports that Trump Administration is considering a new definition of sex under title nine that would effectively deny some protections for transgender Americans\nGoing to New York times of drought memo from the department of health and Human Services for folks poses defining sects as immutable biological condition term in by person sex organs at\nBirth you're listening to NPR\nThe first woman ever on the U.S Supreme Court is moving back from public life for more than a decade after leaving the court in two thousand six\nSandra Day O'Connor and kept up a fairly active schedule including serving as a visiting federal appeals court judge O'Connor also founded their own education organization wherever the eighty eight year old former justice is now apparently fully retired\nVirginia could be the next state and cash bail or at least make some sweeping reforms wouldn't he Evans from member station WWNO ... has more\nAttorney general mark herring is urging state lawmakers to move toward a new system that strictly based on a defendant flight ray score danger to the community and did the current thing he says money\nState lawmakers to move toward a new system that strictly based on the descendants flight risk or danger to the community under the current system he says money alone often determined to stay behind bars\nIt doesn't make much sense nor does it make our community safer to make a low risk non violent person sit in jail while more violent or dangerous people can go free because of their will\nHerring says there are alternatives to cash bail that keep community safety George ... didn't show up for court that summer California became the first state to in cash bail research shows the system disproportionately keeps minorities behind bars for NPR News I'm Whitney evidence enrichment\nTo the big jackpot you just keep going up what amounts to lottery fever ripping much of the country with a mega millions lottery jak profits at one point six billion dollars over another lottery the Powerball is also climbing it's worth an estimated six hundred and twenty million that would make the fifth largest jackpot in us history\nOn Wall street the Dow closed down one hundred and twenty six points I'm jak spear NPR News in Washington\nSupport for NPR comes from the little market offering artist and made good at home to core with the commitment to fair trade\nA nonprofit founded by women to empower female artist friends in marginalized communities around the world more at the little market dot com and the any case the foundation [noise]\nI'm Ryan ... and this is at the end of life for October twenty second\nToday in Nineteen Seventy three the song sunshine on my shoulders was released as a single night by John Denver and\nThe chorus which opens the song simply states the various ways that sunshine makes her feel overwhelming sense of happiness always makes me although John Denver was born Henry John ... junior borrowed his stage name from the mile high city and is closely associated\nState of Colorado but the sunshine on my shoulders what inspired by late winter early spring day in Minnesota [noise] and indeed the orchestra arrangement to support the song unfold like the changing of the season\nAs the first first began a string section is added to the established acoustic guitar and bass is Denver declares his desire to give us\nAll a day just like the one that she has had\nThe course of food with\nA sonic sense of his sons reflection officer\nJust like the one that he's had\nA chorus of\nThey sonic sense of his sons reflection office of\nAnd the second verse an additional section of strings introduces a high story encountered echoing his wish the sun would shine all the while your consideration by Monday Night house is akin to that ...\nWell the temple remains consistent throughout the continual edition of instrumental layers propels ever forward to the final primaries the final four [noise]\nYear an additional layer of guitar string recalls the ceasefire snare drum of oil era\nMarching on forever like turning the\nAmyloid be brought to you by ranch food to direct emphasizing the importance of knowing where food comes from how it is produced and how far they traveled locally produced food available\nAt the ranch rude to direct store a twelve twenty eight these bill more an online that registry direct dot com\n[noise] the southern Colorado's NPR station K. R. C. C. K. R. T. C. H. D. Colorado Springs ... K CCS start feeling K W CCF than woodland park\nStreaming at K. R. C. C. dot org eight minutes after seven o'clock it's the twenty second of October it's Monday as well I mean your friend and neighbor Vicki let's do this together Shelley wanna start things off this evening with the Beatles [noise]\nDay sunshine\nSunday sunshine\nSunday Sun shine\nSome guy come last for about five you good\nA special way [noise]\nLove that sunny day\nSunshine\nMy name is Benjamin Sharma president and order a monument occupational medicine in monument Colorado or target audience are owners will companies HR professionals safety managers\nAnd injured workers and some of the medical care that they need to get back to work really scares he's he's helped us quite a bit and we are able to obtain a lot of access to individuals we normally wouldn't have access to through other means of advertising\nIf you would like to become an underwriter like me who's called Jeanette seven one nine four seven three for each year one\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your generous support\n[noise] twenty minutes after seven o'clock the Monday evening music makes your friend and neighbor Vicki and you thank you so much at all of us\nComing together to start this week off for right I'll have similarly on bridges coming your way something new from your al Thomas and the pain Macy Gray but starting off the set with the eyes Lee brothers and Santana\n[laughter]\n[noise]\n[noise]\n\n[noise] [noise] [laughter]\n[laughter]\n[laughter]\n[laughter]\n\nWouldn't you agree\n[laughter]\n\nWould you agree\n\nWith your\nBit [noise]\n\nOr\nOur\n... ...\n\nRunning around\nSure the\nComment\n[noise]\nNinety One point five K. R. C. C. and the Monday evening music mix started ... brothers with Santana from the record of the year year and a half ago or so called power of peace and are you ready Macy Gray following with things that made me change\nYour all time is to end the pain their latest called the right time slowdown\nLeon Bridges going back to good thing and bad bad news and wrapping up that set of music well that was really\nGood Jimmy Smith plays Jimmy Smith live in music city and root down and get it\nAmerica to springs heritage center preserves the twenty fourth annual ghost stories of old men or two walking tours October twenty ... or ... in public service announcements can be for them and orderly\nOr ... or gee now you can have a Ninety One point five care to see newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning sign up at ... dot org\nCloudy skies and fifty eight degrees in Colorado Springs fair and sixty choose for Kenyan CD and public partly cloudy and Fifteen woodland park and sixty one a few clouds in Trinidad\nLook for clouds throughout her listening area this evening lighter wins and temperatures will be in the upper thirties to mid forties and a looks like they're going to get that much warmer tomorrow\nA cooling off a little bit twenty to thirty percent chance of showers some patchy fog in mourning somewhere around eight nine AM\nCloudy skies windy conditions\nShowers some patchy fog in mourning somewhere around ... Ninety and cloudy skies windy conditions up to Fifteen miles per hour and temperatures will be mostly in the fifties the about sixty degrees in the teller county area\nWhen you get back into the music with something brand new from El ... del ... postures will get squeezed in there and dwell on Ninety One point five K. R. C. C. [noise]\nNo\nJob I'm a brand new\nPlay ... ...\nAnd the judge in which the well the\nRent to\nKeep all the way\nThey\n... and\nWas well loved low you [noise] Nineteen Ninety seven ... though [noise] absolutely no bells and look we had tried to sell it my teenage daughters about\nMe or get money out of it and I'm like no no one's going to buy it and then probably about I don't know six months ago I was like okay we are donating and it's the simplest thing I've done\nAnd on the tour guide was wonderful stone I'm Susan I live in Colorado Springs and I was gay our D.C\nThrough your dog or junior ... measurement promotion\nProgramming on Ninety One point five through your cc is supported by your optics the Colorado are we're gallery in the promenade drops it ... in Colorado Springs and in metro Denver and jury Greek north Greenwood religion to Aspen grew more at your optics dot net your optics we ...\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. law to case CCS starts filling K W CCF to em woodland park streaming at K. R. C. C. dot org\nKay CCS start filling K W C. C. F. M. woodland park streaming at K. R. C. C. dot org just about one minute after eight o'clock the second hour Monday evening music Nixon Ninety One point five\nK. R. C. C. what has been pretty men coming your way but let's start things off for the another thing new release here at the station from the afro Cuban stars\nThat you will get a ...\n... ... ... ...\n[laughter]\n\nLa my daughter my daughter when they when\nRead a\nBook like maybe\nA\nAbout\nIt but I mean I'm not\nReally\nA very\nYoung age we will be\nWorld I mean we will we\nBe not a living\nNow the age of the\nWorld I mean when when\nHe\nMe all\nAround me mom you're\nNot you know maybe a little la la\nLa la\nLa la la\nLittle while you may want to live\nA\nMay\nOne way or the saint Louis\nArea will be will ma ma longer\nYears go\nEnd of their own their\nYour\nMean they do it\nAnd let me by the\nMan we'll meet\nWell it is I Love the idea\nBe on memorial\nIn law for a long\nHey\n\n[noise]\nNinety One point five can you see the Monday evening music make it could've been taken\nNinety One point five K. R. C. C. Monday evening music mix and ... men taken from six AM and shine again\nRead legally Gabrielle or a head of that from nine dead or alive the sound maker ... rasa you'll find that on this time and starting things off\nWith the afro Cuban all stars and a very cool thing about the afro Cuban all stars a besides the obvious of being just amazing players\nAre they went into the studio in Nineteen Ninety six in over a two week period did that record which was the classic gave you record from the afro Cuban all stars and then stuck around with some of the same personnel and did the brunt of vista social club\nAnd then after that introducing Ruben guns Alice amazing players glad to have them on the globe\n\nThe midterm elections are coming soon the results could influence the nation for the next decade the stakes are high end NPR and all things considered are covering national trends\nWe won't just tell you who wins will tell you why it matters listen to all things considered to hear the bigger picture every afternoon from NPR News [noise]\nAfternoons at three thirty on Ninety One point five through your seats\nWe can be with you wherever you go all you need is your phone gets a Ninety One point five K. R. C. the mobile app free at Google Play and in the eye tunes app store\n\n[noise] Twenty one minutes after eight o'clock I'm your friend and neighbor Vicki and so glad to have you along one let you know that coming up at nine PM it'll be time for looking up a looking up at the stars and pondering the big stuff so keep attuned to Ninety One point five\nK. R. C. C. in the meantime a request for stereo lab\nMm\n[noise] every one\n\n\n[noise]\n[noise]\n\n\n\n\n\nAllowed to come down here\n\nSeason\n\nWhich is not even saw the ...\nWell being on the dog but I'm the only one who needed to say\nAnd you see them learn\nTo know what you're seeing king [noise]\n\nNot really sure how\n... how some things you know we you know\nTo me 'cause I Can't stand up\nAnd\nTakes me on their way of one in ... and\n\n\n...\nAround you and I\nKnow\nGerman and come and you know\nPleased to\nMeet this law\n\nMe or take a peek was going on they only want to\n... you\nSee that a\nDo you see that that is a\nKing\n\nNot sure how the\nSay well I can now with a Q A nice meal locally [noise] well that's a\nLong day\n[noise]\nThe\n...\nSenior obscure society\nSee is a skill\nTo charge really not your YouTube is nothing but ...\nPresence in the long term\nMemory me from un soon as I said\nI'm slowly from slipping joined us from reading your life trying to train me to my heart is trust people\nWith much chance constrained you and your description is depends prescription\nAround your stone in my chest pain again memory harder Marines become a pharmacy in Atlanta\nTo live and give them every part of me should silver splendid from your friends are just like to see which in the ... not going to bring in limbo friends stop your precious man you know there's no evidence that existed in ... new enjoy love but never seeing\nSee is a skill set\nShe isn't too much\nSee is a skill\nWhen you're in your right to either side of my head and never think clearly hoping the machine is just couldn't seem to cure me a lot of the time just resigned amid global complain\nWhen you start new governments are near the heart now the gene and pray that the ... let me directly to your show standing at the gate I Believe in it sweet breath but you have to go somewhere in Georgia and go to the candidate ramble resembled that'd be the opposite no one will know that I began to let it flow\nStarted welcoming the catch the pie in the world would be able to manage\nThe vibrant and the declaration paying that ... million spin and everything would have been named needs to make their way down Ninety and hear about him is the beginning starting to see\nSee is obscured by\nSee it\nSee as much\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] ... ... ... ...\n... ... ...\nThe ...\nThe city is to try\nTo be\n\nMore\nNot\nSure\n\n[noise] [noise]\nMm\n[noise]\nMm [noise] Mm [noise] and that's why\n\nTo it\n\nNa\n...\nYou know the time\n\nIt's\nComing up right now it is time for looking up after that to the third our of music on the Monday evening show here in Ninety One point five K. R. C. C.\n\nVisited looking up in northern Colorado from Colorado Springs economical signing I'm healthy lack and there are a lot of reasons or got regular listeners of looking at will recall that I really like the planet Uranus is cool\nIn many ways it's the first planet discovered in modern times it's also tipped way over on its axis with a single year lasting eighty four or five years you're going to say I was forty two years when only the northern hemisphere get sunlight followed by forty two years one only the south get sun so if you want to play in your urine is vacations be careful\nAnd tomorrow October twenty third year and it's just going to reach what astronomers call opposition that means that you're in a space we will rise with the sun setting and we'll start the next morning when the sun comes up\nAnd that means it's right there on the Colorado sky all night long begging to be looked at him this opposition is very special in that you're in his will be in the best position due to the mathematics of orbital mechanics to give us our best view of the green gas giant in fifty years\nWhen you look at your in his telescope you see something truly amazing you see a green disk of a planet unlike stars which up you're only as tiny points of light your presents an actual disk you can actually see the body of a planet roughly one point seven billion miles away so come to a star party and marvel at the magnificent ...\nIf you'd love to go look at your house or any other wonderful amazing things that are sky reserves of care succeed or thrilling to permission about our monthly meetings that aren't republics art verdicts ... springs Astronomical Society telling you to keep looking up something\nThere are really two permission about her monthly meetings are republics dark party bosses there'll be lots of course rings Astronomical Society don't need to keep looking up something Colorado\n\nIn in\nNa na\n\n\n\n\n\nWell let's bring them to be the hardest visit to\nCamp by what you're looking for even when it's a little getting bullied you\nThey show up in the criminal but you shouldn't I ended up breathing got so open and calm on screen them all children we do what do you can\nDo what he was\n[noise] yeah but my mom and my little ...\n... on a walk in\nThe reality is trying\nOut some of the drugs\nThey call them or are they\nThey don't want\nRunning who do well woman like she was you know will finally gone like you who will take the lead John ... who don't want to be key to\nWith them so\nKnow we're out Ron Muslim druthers\nDraw a\n[noise]\n\n\n[noise]\n\n\nAfternoons at three dirty on Ninety One point barge your she she ... she got her tutor to covering a changing southern Colorado your membership growers directly fund our local reporting thank you for your sister membership\nJust about twenty minutes after nine o'clock this is Ninety One point five K. R. C. C. coming up at one minute after ten NPR hourly news and following that Monday late night music wouldn't be the same without rooster coup getting huge midnight so keep a tune\nAlso keeping my promise to give away a guess with spot for you in a friend to catch each EEO just talked about him just hurt him a an airplane the summit music ... Diallo mass show Halloween Night October the thirty first if you'd like to pick up that gift with spat me here\nThe man show we never had a job or the thirty first if you would like to pick up back yeah let me hear from you calling for like ... seven three three zero one\nOne eight hundred seven or eight to seven to seven caller number five hooking up with it she um\n\n\nTo\nLower\nWe'll\nLower\n\nDa da\nDa da\nDa\n\n\n[noise] ... [noise]\nBe managed and da\nDa da da da\nDa\nDa\nNa ... de ... you know\n\n[noise] thirty nine minutes after nine o'clock this is your friend and\nVicky thank you so much for spending time this evening weather wise if you're going out there just want to know what's happening cloudy skies and fifty three degrees in Colorado Springs fifty eight in some clouds for Pueblo\nAnd it looks like a lie to him you know just to both reporting overcast sky and forty nine degrees clouds in the forecast throughout our listening area this\nAnd it looks like the light I mean it is to both reporting overcast sky forty nine degrees clouds in the forecast throughout her listening area this evening lighter winds temperatures in the thirties and in the forties\nTuesday or a cooler day was temperatures there in the fifties could reach six years so for la to\nIn rocky for twenty to thirty percent chance of showers some patchy fog in the morning when five to Fifteen miles per hour going along with the clouds\nAnd yet again you can expect to get these for the most part in possibly mid afternoon warming up to the higher end of all that it's nine forty many get into the last set of music decided NPR oh really news which in December\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\nAll these people to be\nI\n\nAbout the whole\n\nTo be\nThere would be a little bit\n[noise]\nPeach peach peach peach peach peach peach peach peach peach peach peach peach peach peach peach peach\nPeach peach peach peach peach peach peach peach\nThings she thinks\nShe\nTo you and you\nCan imagine\n\n\nIn the\nOn the [noise] the percentage", "month": "10", "day": "23", "state": "CO", "station": "KRCC"}