{"year": "2018", "show_name": "91.5 KRCC Music with Vicky Gregor", "city": "Colorado Springs", "content": "Marketplaces supported by progressive insurance offering a way to my home insurance with their home court explorer to Huston floating rights are available online learning more preventive dot com are one eight hundred for granted now that's progressive\nMarketplaces supported by progressive insurance offering a way to buy health insurance with their ... voted slower to cast implants and rights are available online learned more progressive dot com are one eight hundred progressive now that's progressive\nAnti foreign X. dot com for next time counted committed to empowering and helping trainers these opportunities in the foreign exchange markets learn boring for X. dot com points dot com it's your World Trade it for a training announced picnic at risk of la [noise]\nAnti exact science is offering ... over fifty comic out as a non invasive colon cancer screening tests that can be used at home or they'll\nDo my prescription only information that color guard task dot com\nOr we got to go off to a hundred today three quarters of one percent NASDAQ off one forty five at one point eight percent has to be five hundred down twenty three points\nAbout eight to ten percent just to be consistent here the tenure treasury three point one nine percent John bug leave ... even Gregory John Gordon Bessie Streisand or the marketplace editing ... the managing editor Debbie I'm Guy Raz all we will see more money [noise]\n\nThis\nIs APO it's seven o'clock at night the one point five K. R. C. C. southern Colorado as NPR station I'm Sean Roswell sitting in for my cell\nAnd I'm Vicky is on the way with or Thursday evening music mix and uh some tickets to go see hoot and holler as grants saving I'd I'd be while on Saturday Night one more parents tickets or\nTo get in a you can get in on that so stick around and um make sure you would stay tuned in with Vicki on Ninety One point five K. R. C. C.\nMostly a clear tonight it will be mostly sunny tomorrow with increasingly day showers and a clouds tomorrow sixty two right now going down to forty six overnight\n\nLive from NPR News in Washington I'm ... the New York attorney general's office says President Trump's charitable foundation repeatedly violated state and federal law\nStay tuned in with Vicki on Ninety One point five K. R. C. C. mostly a clear tonight it will be mostly sunny tomorrow with increasingly day showers and a clouds tomorrow sixty two right now going down to forty six overnight\nLive from NPR News in Washington I'm In ... the New York attorney general's office says President Trump's charitable\nFoundation repeatedly violated state and federal law NPR's Jim Zarroli reports the state filed papers today asking a judge to let a lawsuit against the foundation move forward attorney general Barbara\nUnderwood sued the Trump Foundation in June the suit said the foundation had soliciting money from donors and then used it for campaign purposes and to settle legal claims against Trump's company among other things\nIn August the foundation asked the court to dismiss the suit saying it was motivated by politics and her response Underwood argued that the foundation was miss stating that claims against it and ask that to be allowed to continue\nShe said the Trump Foundation was a show corporation that functioned as a checkbook from which Trump's businesses made payments Jim Zarroli NPR News New York\nSenate lawmakers there'll be gun they review of the FBI's report into sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh\nRepublican Senator Bob Corker says he's satisfied with the results of the pro incompetent Kavanaugh will be confirmed Senator Corker also said he's not upset by the fact that neither judge Kavanaugh or doctor Blasey Ford were questioning the least investigation\nI think they were planning I have no issue with that I Know the other side of the house trying to make that an issue I think the American people feel like they were\nPretty well interview one Democrat who had been undecided North Dakota Heidi Heitkamp now say she will vote no on the cabin on nomination\nWith barely a month till election day US Senate campaigns are top heavy with negative ads NPR's Peter Overby tells us just one of the findings that comes up in a new research paper by the Wesleyan Media project which tracks political advertising\nPolitics always gets nasty or closer to the election and the Wesleyan Media project finds that by now half of all Senate campaign had or negative\nThey mostly come from Republicans playing defense in the last midterm elections Democrats were on the defensive and going more negative you're most likely to encounter the negative advertising in Ohio in Montana which democratic incumbents in Nevada with a Republican incumbent\nNPR's Peter Overby tells us just one of the findings that comes up in a new research paper by the Wesleyan Media project which tracks political advertising\nPolitics always gets nastier closer to the election and the Wesleyan Media project finds that by now half of all Senate campaign ad or negative\nThey mostly come from Republicans playing defense in the last midterm elections Democrats are on the defensive and going more negative you're most likely to encounter the negative advertising in Ohio and Montana which democratic incumbents in Nevada where the Republican incumbent\nHas campaigned on average or slightly more positive the Wesleyan Media project is a joint effort led by political scientists from Wesleyan University Washington state university and boating college Peter Overby NPR News Washington\nThe number of people filing weekly claims for unemployment benefits at a nearly forty nine you're low last week pointed to what has been a relatively strong jobs market Labor Department says initial claims for state unemployment benefits fell by eight thousand to a seasonally adjusted two hundred and seven thousand for the weekend in September twenty ninth\nThe government's more broad based employment figures are due out tomorrow\nOn Wall street today stocks turned south the Dow fell ... points to twenty six thousand six twenty seven the NASDAQ dropped a hundred and forty five points this is NPR\nAmid a standoff over rebooting it's controversial commercial wailing program Japan's says it will revise its hunt plans in response to threats of trade sanctions in Tokyo John Matthews reports one wailing program was deemed illegal because endangered well made was being sold commercially\nSay well hunted in the northern Pacific is class as endangered the convention on international trade and endangered species of wild fauna and Flora says Japan is using meat from Hans for commercial purposes violating international law the convention can recommend sanctions from other member nations at the practice doesn't stop\nJapan's fisheries agency says it will be submitting revisions to the convention for approval although details are scant as to what that will entail\nIt almost certainly won't in their regular research hunt in the Arctic where Japan annually catches around three hundred non endangered means ... whales the programs are criticized for producing a little scientific research and for underpinning an industry in a country where we'll meet has gone far out of style\nFor NPR News I'm John Matthews in Tokyo\n... in court documents found in the case of navy vet accused of sending caster seeds of e mail address to President Trump and members of administration now say the suspect has confessed thirty nine year old William\nDetails are scant as to what that will entail it almost certainly won't in their regular research hunt in the Arctic where Japan annually catches around three hundred non endangered means ... whales the programs are criticized for producing a little scientific research and for underpinning an industry in a country where we'll meet has gone far out of style\nFor NPR News I'm John Matthews in Tokyo authorities in court documents found in the case of a navy vet accused of sending casters\nSeeds v the mail addressed to President Trump and members of administration now say the suspect has confessed\nThirty nine year old William climate admitting to investigators he sent the letters after he was arrested this home north of Salt Lake city letters set off alarm bells at a screening facilities since caster Caesar used to make rice and a potentially deadly poison\nBest skaters say along with the president that loves her mailed FBI Director Christopher Wray defense secretary Jim Mattis and navy admiral\nJohn Richardson I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the artists foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at artists foundation dot org and the corporation for public broadcasting [noise]\nI'm even have it and this is a day in the life for a job or fourth [noise]\nIt was on this day in Nineteen Seventy at the age of twenty seven the Janis Joplin died of a heroin overdose born in Port Arthur Texas job and graduated high school I'm enrolled\nFirst in the la Mars state College of technology in Beaumont, Texas and then at the University of Texas in Austin always involved in music deeply influenced by the lakes have Bessie Smith my rainy and no data gentleman was invited to edition with the band called big brother in the holding company in Nineteen sixty six [noise]\n\nAfter breakthrough performance at the Monterey Pop festival shopping recorded two albums with the band and then went solo having long battled with addiction by Nineteen sixty nine she was spiraling out of control allegedly shooting some two hundred dollars of heroin the day\nCame Seine\nThree days before her death and she was in the studio recording the legendary track Mercedes Benz as well as a birthday greeting for John Lennon [noise]\nWe just want to hear\n[noise] after breakthrough performance at the Monterey Pop festival job with a quarter to almost with a band and then went solo having long battled with addiction like Nineteen sixty nine she was spiraling out of control allegedly shooting some two hundred dollars of heroin the day [noise]\nA Mercedes and three\nDays before her death and she was in the studio recording the legendary track Mercedes Benz as well as a birthday greeting for John Lennon\nDrawn Janice [noise] we just watch what you got to be I think\nThe printing included a version of her singing the deal lemons cowboy songs happy trails\n\nAfter the massive farewell party the Joplin had called for in her will garages got it from a plane into the Pacific ocean alone to breach there was a private funeral service but it was only you tend to buy her parents are in the rest as they say is history [noise]\n\nJust brought to buy ranch direct building community through sustainable real food from local farms available at the ranch rude direct retail store on ... street in Colorado Springs and online that ranch roots direct dot com\n[noise] this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... case ... W C. C. F. M. woodland park streaming at K. R. C. C. dot org\nEight minutes after seven o'clock Thursday the force of October I'm your friend and neighbor Vicki wishing you a wonderful Thursday evening you know put some music to it and see what we can come up with let's start off so with Janis Joplin\n[noise]\n\n\n\n[noise]\n\nNinety One point five K. R. D. C. and the Thursday evening music mix I don't know about you but one of the musical highlights of my life\nOr was this year blues under the bridge to say as an Eighteen and low global doing birds are right there and all of this Sharon that together probably\nHas a great feeling your all time it's in the pain and head of that show yeah from the right time brand new and Janis Joplin here we are here today in Nineteen Seventy try just a little bit harder for him I got him a cosmic rays\nEvening music mix I don't know about you but one of a musical highlights of my life\nOr was this year blues under the bridge two thousand Eighteen and Los Lobos doing birth a right there\nAnd all of his sharing that together has a great feeling you're all Thomas in the pain ahead of that show yeah from the right time brand new and Janis Joplin we lost her today Nineteen Seventy\nTry just a little bit harder for him I got them all cosmic blues again mama nine\nI'd be handled all of us here in Ninety One point five ... thank you for your support during our full membership drive through financial contributions will ensure that very well forty five years eve provides accurate news and analysis music and entertainment today tomorrow and the day after we could not do this without [noise]\n\nProgramming on Ninety One point five tree or cc is supported by chopping dawn in saliva organic fair trade coffee and tea located at one twenty two used for street dropping dawn is online at ... dot com open six am the three PM daily\nBy Colorado Ballard presenting the bloated plastered Sleeping Beauty October fifth through the fourteenth but the only Caulkins opera house with live music by the Colorado belly orchestra Colorado ballot dot org\nComing up in the second hour of the Thursday evening music nexus evening I've got one more I guess Liz spot\nFor you in a companion to catch you know there's an grant saving together at ivy wild school the music venue that neat little venue that we have here in Colorado Springs Saturday October six so be listening to Ninety One point five\nK. R. C. C. for your chance to pick up on that senators got their chance to review the FBI's report on Supreme Court nominee Brett Kavanaugh Democrats say the supplemental investigation was too limited Republicans call it Sarah Oh\nWill they vote tomorrow to send the judge speeding toward a Senate confirmation vote or will they decide to break his nomination listening to special live coverage of the cabin uh a vote from NPR News here and anyone points\nSix so be listening to Ninety One point five K. R. C. C. for your chance to pick up on that senators got their chance to review the FBI's report on Supreme Court nominee Brett Kavanaugh Democrats say the supplemental investigation was too limited Republicans call it Sarah Oh\nWill they vote tomorrow to send the judge speeding toward a Senate confirmation vote or will they decide to break his nomination listening to special live coverage of the cabin uh a vote from NPR News here on any one point five K. R. C. C. tomorrow\nWhen they play music now from Paul Simon uh and it's called in the blue light or redo if some of his favorite songs\nAre in synch and favorites to done\nIn the style of jazz and that kind of Smokey atmospheric way are probably the last ... brand new disc or going to get from Paul Simon or so he says so we'll start off with that although I've got some staying in music from the future jazz compilation coming your way as well\n[noise]\n\n\nI can run but I won't do it faster to lose [noise]\nRun run Rudolph much to learn about [noise]\nTrees\nAre just from the new [noise]\nFor\nLot of stores in the food on the water from\nFrom from our bureau in much faster than was [noise] a reward was this one [noise]\nThe woman or not doing the ... going off much faster than was going\nDark here but I go to war was ferrets illness cannot learn\nLow level\nAfter the show we'll play the ...\nIs you use\nTo males wear a jacket in the new mayor was labs\nBack him up much faster than in the news came from\nKnow I didn't know much strategy will lose cannibalism what\nThink\nWhen\nIf the legend is based on the\nThere's a\nThe ... the topic I could live a little bit of a lot you know but I can walk much faster than is generally are in the\nDark here rather than work much faster\nThe new book\nNo but I could work much faster than is generally aren't in the [noise]\nPark here on the war much faster\n[noise]\n[noise]\n\nAll\nOn friday twenty percent chance of showers a partly cloudy skies some sunshine peeking through here in there and it looks like temperatures will be in the seventies and eighties and you can expect windy conditions again for safety county and very gusty winds interests\nOn friday twenty percent chance of showers a partly cloudy skies since insurance peeking through here in there\nAnd it looks like temperatures will be in the seventies and eighties and you can expect windy conditions against for safety county and very gusty winds in Trinidad up to thirty miles per hour\nReminder that in the second hour of the show tonight I'll be given away gift with but Eunice trend for her mother's and grants even if I Do well in school this Saturday October six so stay tuned keep tuned\nFor that in the meantime let's start off to that had music review to from Randall in her and then you one point five K. R. T. C. [noise]\n\n[noise]\n\n\nThey were\nThe [noise]\nBut those are\n\nDo it is a\n\nDo what is\nOlder\n\nReally does you know\nAnd\nThey when\nA man\nAnd then they're not\nThing\nThey don't\n\n\nRun and\n[noise]\n[noise] there's no sign a just a na and\nNow with stuff that's\nFine you know with a B\n[noise] no I'm a strong God ... [noise]\nNo store\nBought ... no no oh\nMaybe a ... [noise] ... [noise]\n[noise] [noise] yeah [noise] oh [noise] wow [noise] whoa whoa\nWhoa\nWhoa\nWhoa\nNineteen years old give or take in so very talented Jacob Collyer\nAnd the title track to in my room when the best speech was ever a protege of Mr Quincy Jones and a young musician who I've literally took over the music room that his mom taught in\nAnd kind of built out from there really beautiful stuff on that record to smithereens and their cover that don't come easy from their coverage ... collection\nBrand new I headed to smithereens Joey die sick with stories and on inside voice Marvin Gaye can I get a witness just ahead of joy dot sick\nThe Charlotte died for their brand new one love in the wind in those years are over and you to starting things off at\nThe top of the SAT from rattle an angel of Harlem\nAmes here today not because I Want to be\nTerrified Christine Blasey Ford and Supreme Court nominee Brett Kavanaugh in a historic hearing on Capitol Hill what impact could their testimony have on public opinion and how the Senate handles his nomination the entire country is watching how we handle it\nHead of joy dot sick the Charlotte died for their brand new one love in the wind in those years are over and you to starting things off at\nThe top of this set some radical and hum angel of Harlem\nAnd here today not because I see\nAnd terrified Christine Blasey Ford and Supreme Court nominee Brett Kavanaugh in a historic hearing on Capitol Hill what impact could their testimony have on public opinion and how the Senate handles his nomination\nThe entire country is watching how we handle these allegations\nOn the next MORNING EDITION from NPR News\nTomorrow morning at five AM on Ninety\nOne point five K. R. C. C. programming on Ninety One point five three or cc is supported\nBy the Colorado Springs independent V. drink the election issue with coverage of candidates and ballot initiatives happening this fall papers available at over eight hundred locations around the area reports in features on line it's yes indeed dot com\nIt's one minute after eight o'clock ... southern Colorado's NPR station\nK. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. the hunter case CCS start selling K W C. C. F. M. woodland park\nStreaming at K. R. C. C. dot org I'm your friend and neighbor Vicky thank you so much for coming along this Thursday even in\nA coming up still some new music from devil makes three some hoot and holler and starting off with the latest from mark nah flair and any one point five K. R. C. C.\n\n\n\n\nNumber two or three\nRing the lemon tree was under\nAbove the fray in the book but you\nThis is going to be under the sun in St Louis blue [noise]\nAll the time has improved a bug juice\nI'm a member of the dog to address the\nScreen do by his lemon retreat he yeah he was a quick and\nAbove all a phrase in the book but you\nIt's going to be another the sun and the most ...\nMember of the time I was going through a bug juice\nTo Brian's fresh coffee and blow themselves up and moved\nOn the stove Mormon alike bread day was not the like here with the cooking the day I\nYou want to do or happiness is it is a there's a hunch is going to look forward to this cat is going to get the creek and skin mango is so smooth smoother than the devil may go to slice it up to the ... the ... main rebel [noise]\nThat's on Iran needs to do\nThat's why he walked out\nWe would do to\nCountry and the way he was born and bred and\nHe's cutting it\nFor the day\nThe the ... and he's been recently\nThat's worthy work the\nWay he would do to\nIs where he was born\nOf these ...\n...\n\nA man I use the\n... ...\nI'm In the ...\nMm\nMm Mm\nThe music of grant saving a Ninety One point five K. I. C. C. taken from and to me as a college the letter to nose near\nThere who know how there's a head of that sticks and stones had taken from greetings from wealthy city grant and who now there's together this Saturday at ivy wild\nAnd that Saturday October the six Margot price in there as well we the weakness devil make three and the title track chains are broken their brand new in just ahead Margot pride\nAnd mark ... from the forest coming down the road wherever and good on you send\n\nOn behalf of all of us here in Ninety One point five tier cc thank you for your support during our fault membership drive your financial contributions will ensure that maybe one forty five years cc provides accurate news and analysis music and entertainment today tomorrow and the day after we could not do this without [noise]\n\nNPR oh Ninety One point five to your cc is supported locally\nLike forty five degree gallery celebrating our ... dream winter green transfers by the late William ... and ... drawings by Patrick Carter knows this Friday five to eight at forty five\n... twenty eight western Colorado by planet granted now planning kitchen bar and bathroom remodel to help listeners prepare for the holidays planet granted offers a wide selection of countertops industrial room at thirty twenty north stone and online at planet granite dock us\nJust about twenty minutes after eight o'clock Thursday evening music mix and a chance to get on that ... and a companion to catch hoot and holler and grants\nAnd Tom DeLay drawings by Patrick ... not just brought a date at forty five degree gallery twenty ... twenty eight western Colorado\nBy planet granted now planning kitchen bar and bathroom remodel to help listeners prepare for the holidays planet granted offers a wide selection of countertops and the show room at thirty twenty north stone and online at planet granted dock us\nJust about twenty minutes after eight o'clock Thursday evening music mix and the chance to get on that I guess with the EU and a companion to catch hoot and holler and grant saving this Saturday and the idea wild music school than you are school music venue it's id wild\nAnd if you'd like to be on that list is the last one I've got a caller number five four seven three for eight zero one or one eight hundred seven for eight seven to seven caller number five you're going to the show\nAnd again she discovered something in a\n[noise]\n\n\n[noise]\nIn ... but we'll see low to mid eighties when you get back into the music now this brand new from the grip weeds\n\nIn ... the low to me he when he gets back into the music no this brand new from the Greek fleet\n[noise]\nReal\n\n\n\n\nYear\nYeah\nI'm a\nThe\nUm\nAnd in the\nAnd now I Know because you're\nWe're having now and in the\nAnd a checklist\nJerry on the show\nThe way I Am the ground\nYou have now and then the\nAnd check\nJerry's on the u._s. do\nThe or walk the dog where have you on the ground\nAnd see on the ground all down\nAnd there was\nDream is choosing to stay on the bottom and\nThen landed on the Internet is\nNow and then on the lake\nThere and they\nAnd cannot manner then the\nWinners trees trees there would\nBe the ball and\nThen boom and I'm\nBut they're seeing on the go\nAnd be on the ground or\nDad was there to\nLook around and started than than manned\nOutlet and than they\nAnd and now\nWe have now\nAnd how\nMy story more\n... than I Am right now where are you\nHim down and panic\nI Am and now\nThey have now\nAnd how\nAm I going to address where you\n\nFan and I\nThere\nFan or\nA ... and it was [noise] going on\nSay\nGood\nHave to [noise]\n\nSaid\nShow in the city too\nShirt in exchange for the time\nShe tried to\nSurgeon\n\nSeuss\nSurgeon\n\nNa na na na na na\nNa\nNa\nNa now [noise]\n\n\n\n\n\n\n\nStarted things out and that is when you take away the grip bleed from their brand new one trip around the sun and vibration Iran following with Dan\nBlack colleagues in there when we were not there from ... toward the light of the stone following with Andromeda\nRequests for some cowboy junkies knew darn calming that\nMiles from our home and in the background Jeff Beck taken from who else an hypnotic huh\nFrom their brand new one trip around the sun and vibration Iran following with Stan\nBlack holidays in there when you are not there from softly toward the light of the stone following with Andromeda\nRequests for some cowboy junkies new dawn coming that\nMiles from our home and in the background Jeff Beck taken from who else in hypnotic uh\nThis week on all things considered here the latest news judge Kavanaugh gave a forceful vigorous defense what his name\nI Do wonder if the bakery is just too many cakes and maybe they're not getting the legislators are\nAnd even things that parts of Syria and got my first paycheck from like screw it I'm going to get a path to\nListen to all things considered to hear the bigger picture every afternoon from NPR News\nAfternoons at three thirty on Ninety One point five through your see see\nThis as southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs ... case CCS stark sale and K W C. C. F. M. woodland park\nStreaming at K. R. C. C. dot org it's one minute after nine o'clock I'm your friend and neighbor Vicki TSA Thursday evening music mix and I'm On a play or requests diet got for had earlier I had received\nFor Frank Zappa and full disclosure I forgot to write down the song but I Do remember it was this record and I hope this is okay\nA Ninety One point five K. R. C. C.\nMost of them came who in his mother's side [noise]\nAre rules Chong chok reads from mind\nTo pay a movie review of the [noise]\nWith\nYou know she I\nDominoes or it was ...\nTo pay a misery loves to be able\nIs a ... but\nKnow you'd see I\nThe mystery man a nerve agent\nA bit\nRolling when they when a kid I don't know how small it was around\nThe country and the team and I\nOne of the top and put them in this box will be the oil but I'm really dieting and the ... the brand was that you might not believe this little fellow be but it'll sure you're Adams lead to more not\nKind of a girl who when they were [noise]\n\n\n\n[noise]\nAnd you can help me out\nOf mine who knows it and you can help me out\nLike meditation ...\nRage and brand lab is now in\nAnd the health to rely less matched all the way from here and I showed them how to do it right\n\n... you know what you know\nSo low in New ways to battle\n[noise]\n[noise]\nYeah [noise]\nDon't know I'm In\nMy mind while the highway with some of the masses\nTo the brim and on the ship and\nHow we can go and try to I guess\nYeah\n\nNow I'm In the ...\nWhile the highway\nClinton did in Greece oriental spent on our way through school and Dr Bill I guess we'll be bound to be going to turn on the radio and\nOf you in jail\nWe're now we're going to be the case but what they go to try them for all of my\nGoals and the students lazy praise and blame and pleasure out\nAs compassionate and you know what I did about India to learn\nTo\n\n[noise]\n\n\n\n\n\nOf the\n\n\n\n\n\n\nThe music of Radiohead on Ninety One point five K. R. C. C.\nTeam from a moon shaped pool Tinker Tailor soldier sailor\nRich men poor men bigger manned the Bjork ahead of that with the army of me from post some brand new music from slightly stupid everyday life everyday people\nAnd higher now featuring Charlie Tuna river in free child in their little help from that to hazel Miller and gee love\nDilate in and Frank Zappa at the top of the set from apostrophe and cosmic debris\n[noise]\n... couple of following the river trunk or for ...\nFor the money one way like [noise]\nTwenty two minutes after nine o'clock Thursday evening music mix\nAnd but oh already said that part on your Thursday evening music mix of your friend and neighbor Vicki that's what she's trying to say also appreciate your hanging out this evening want to get right back into the music so much great new music on the new release well\nHard to stay away a so let's dive right in here is real Mira [noise]\n\n\n[noise]\nUh on Thursday evening music mixed with your friend and neighbor Vicki that's what she's trying to say also appreciate your hanging yet to see if they want to get right back into the music so much great new music or net new release well\nHard to stay away so diverse audience hears real me around [noise]\n\n\n\n[noise]\n[noise]\n\n\nNinety One plane science channel or the scene that Thursday evening music mix with an afro Cuban all stars just ahead in that ... and ... days stereo lab the head of Lincoln and her least annex\nHis ... and ... and ... that was something brand new some real me around and this time under rally\nSouthern Colorado is NPR's mission Ninety One point five to your seat you can be with you wherever you go all you needed your smartphone\nDownload the free Ninety One point five years cc mobile out like Google Play or the I tuned app store\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News in music thanks for your generous support\nProgramming on Ninety One point five K. R. C. C. is supported by squash blossom October's art walk features oil painters mixture my neck and Jean ... euro an artist in ... with social friday five to eight PM the squash blossom located uh twenty six been Colorado revenue\nFor the Colorado health foundation dedicated to the belief that help has a basic human rights Colorado health foundation is working to bring help in reach we're all Coloradans more information is available at Colorado health dot org\nShares ... degrees\nCc is supported by squash blossom October's art walk features oil ... and Jean ... euro an artist in ... with social brought a five to eight PM the squash blossom located uh twenty six when Colorado avenue\nOr the Colorado ... foundation dedicated to the belief that health is the basic human rights Colorado health foundation is working to bring help in reach we're all Coloradans more information is available at Colorado health dot org\nFair sky than fifty two degrees in Colorado Springs public reporting fifty nine degrees canyon city as welfare and sixty two in a ... to\nLook for clear skies when five to Fifteen miles per hour in temperatures this evening mostly in the forties and fifties higher elevations will be in the mid to upper thirty range twenty percent chance of showers on friday sunny skies once those clouds start to break up a little bit\nAnd it looks like we'll be in the seventies and in the eighties want to get into this last set of music for this side of your Thursday evening at one minute after ten o'clock will be playing ensure hourly news\nAnd then Thursday night means DJ pro is in the house so very good reason to stay up late on a Thursday night\nWant to start off this set with the latest from Tosh self tonner\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n", "month": "10", "day": "05", "state": "CO", "station": "KRCC"}