{"year": "2018", "show_name": "91.5 KRCC Music with Vicky Gregor", "city": "Colorado Springs", "content": "All right we've got to do the Dell up thirty nine points today about attempt present that gave up fifty two points about six tenths present that to be five hundred was basically flat or\nDaily production team includes ... horse drawn McHenry daisy Blasio's and Phoebe ... special projects desk Andres ... is a producer on our wealth and poverty desk job result we will see tomorrow but [noise]\n\n\nThis is APN [noise]\nNow you can tune in to Ninety One point five care cc without lifting a finger just ask your smart speakers like Kay are cc [noise]\nHi this is helping black host of looking up the nerd showing astronomy here on Ninety One points\nProducer on our wealth and poverty desk I'm a result we will see tomorrow but [noise]\n\n\nThis is a PIN\nNow you can tune in to Ninety One point five ... say without lifting a finger just ask your smart speaker ...\nHi this is how black host of looking up the nerd show on astronomy here on Ninety One point five K. R. C. C. where every Monday at nine AM and nine PM an additional shows are archived at K. R. C. C. dot org and available and I tunes remember keep looking up\nGood evening it is a just a few seconds shy of seven o'clock here at K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... hunter Casey has struck filled K W C. C. F. M. woodland park also streaming accuracy C. dot O. R. G.\nG. Senate says your energy is a valuable resource distribute it wisely [noise]\nOur friend and neighbor Vicky is a a valuable resource here in Ninety One point five ... and she will be distributing some great music\nKeep a tune for Vicki and the Monday evening news mix that's coming up and just a few moments check in with headline news from NPR and today's edition of daily life and then Vicki\nAnd to be advisers to eighth freeze warning for portions of our listening every including Colorado Springs also freeze watches for Pueblo ... hunter and Trinidad\nForty five degrees right now in the downtown area chance for showers as well uh this evening and most of tomorrow maybe even through early Wednesday keep a tune for headline news from NPR that his next\nLive from NPR News in Washington I'm jak spear the newest justice of the Supreme Court will be on the bench tomorrow when the court begins hearing oral arguments NPR's Scott Horsley reports President Trump hosted ceremonial swearing in for Brett Kavanaugh at the White House this evening\nKevin ... had already been quietly sworn in on Saturday hours after he was confirmed on or near party line vote he said he wants to put the contentious and emotional confirmation battle behind it and he promised to serve in a non partisan fashion I was not appointed to serve one part\nNews in Washington I'm jak spear the newest justice of the Supreme Court will be on the bench tomorrow when the court begins hearing oral arguments NPR's Scott Horsley reports President Trump hosts the ceremonial swearing in for Brett Kavanaugh at the White House this evening\nKevin ... had already been quietly sworn in on Saturday hours after he was confirmed on or near party line vote he said he wants to put the contentious and emotional confirmation battle behind it and he promised to serve in a non partisan fashion\nI was not appointed to serve one party or one interest but to serve one nation\nWhile Kevin O's remarks were conciliatory President Trump's were not Trump blasted Democrats for a campaign against Kavanaugh he called dishonest and deceptive the president thinks seat in the new justice will give a political booster Republicans in the mid term elections Scott Horsley NPR News Washington\nAttend shelter for use in the west taxes desert continues to expand as the Trump Administration struggles to handle an influx of migrant children crossing the border as NPR's John Burnett reports the sprawling migrant camp is coming under increasing criticism\nThe U.S conference of mayors have sent a letter to the health and Human Services secretary demanding to know how that apartment is caring for records Thirteen thousand migrant children in its custody around the country\nOver the weekend protesters showed up at the ... border crossing to denounce the expansion of the camp which is next door\nThe cluster of sand colored tense east of El Paso was supposed to hold only a few hundred migrant children enclosed this fall but the government announced last month the shelter may grow to as many as thirty eight hundred beds\nThe tornado camp currently holds more than sixteen hundred children ages twelve to Seventeen most of the boys from Central America with more arriving every week\nCan't managers insist that children are well cared for with apple food recreation and medical care John Burnett NPR News\nTo Americans or this year's recipients of the Nobel Prize in economics one for studying the economics of climate change and the other for showing how to help foster the innovation needed to solve such a problem\nTo oil Swedish Academy of Sciences says William Nord house of Yale and Paul Romer of New York university will share the just over one million dollar prize Romer in his work is looked at the way innovation drives prosperity and a news conference to explain why globalization is critical making the world better\nIs not just about trading stuff\nYou know 'cause we got enough stuff here and you know people in other parts of our have their own stuff\nStudying the economics of climate change and the other for showing how to help foster the innovation needed to solve such a problem\nThe world Swedish Academy of Sciences says William ... of Yale and Paul Romer of New York university will share that just over one million dollar prize Romer and his work is looked at the way innovation drives prosperity at a news conference to explain why globalization is critical to making the world better globalization\nIs not just about trading stuff\nYou know 'cause we've got enough stuff here and you know people in other parts of their own stuff\nGlobalization is about sharing ideas\nRomas cold winter William nor houses work looks at imposing universal carbon tax [noise]\nWhat is now hurricane Michael is lashing the western edge of Cuba is expected to pick up strength as it heads toward the U.S mainland possibly making landfall later in the week as a category three hurricane on Wall street today stocks close mix the Dow was down for up to thirty nine points this is NPR\nStruggling to respond to mounting spice scandals Russia Today some of the ... to protest what Moscow sees as a coordinated misinformation campaign Matthew bond or reports from Moscow, Russia now claims expulsion no for Russians visiting the Netherlands on diplomatic passports wasn't misunderstanding\nRussia's foreign minister told journalists in Moscow today that the alleged spies are simply Russian experts traveling on routine business and that they made no attempt to hide from anyone last week the defense ministry presented evidence that the men were in fact Russian military intelligence officers and the Dutch authorities track then throughout their stay in the Hague\nAccording to the Dutch this by the tempted to hack into the organization for the prohibition of chemical weapons international body that's currently investigating they tend to poisoning of a former Russian spy so basically Paul\nRussians denied these allegations categorically and the foreign minister now says they're merely an attempt to distract western citizens from problems plaguing NATO in the European Union for NPR News I'm Matthew button in Moscow\nA year after a series of wildfires charter significant section of northern California's wine country destroying thousands of homes the Army Corps of engineers says cleanup has turned into a bureaucratic nightmare\nIn October of last year state and local officials lack the ability to quickly cleared the smoldering debris and called in the army which was in charge of a warning roughly one point three billion dollar cleanup contract\nWhereas in some contractors were paid by the ton meeting the more they all the way the more money they got some homeowners claim that deep holes were gouging their property damage driveway sidewalks and retaining walls many of which were not initially damaged by the wildfires\nConstruction of northern California's wine country destroying thousands of homes the Army Corps of engineers says cleanup has turned into a bureaucratic nightmare in October of last year state and local officials lack the ability to quickly cleared the smoldering debris and called in the army which was in charge of a warning roughly one point three billion dollar cleanup contract\nWas in some contractors were paid by the ton meeting the more they all the way the more money they got some homeowners claimed that deep holes were gouged on their property damage driveway sidewalks and retaining walls many of which were not initially damaged by the wildfires\nI'm jak spear NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include the Robert Wood Johnson Foundation working alongside others to build a culture of health that provides everyone in America a fair and just opportunity for health and wellbeing more at our W. J. F. dot ORG [noise]\nI'm sitting here waiting this is ... [noise] it was on this day in Nineteen Seventeen the pianist composer in jazz visionary Thelonious Monk was born in Rocky Mount North Carolina\nAmong conventionally gone piano lessons have his own his introduction to the instrument came well peering over his shoulder and watching her practice\n\nHe taught himself to read music that way by the time he was Thirteen months when the amateur competition at the Apollo Theater so many times to the management banned him from ever entering it again\nMy Nineteen forty one monkey joined the ... playhouse in Harlem where he began developing a new type of jazz it would later become known as [noise]\nMuch first recording dates back in Nineteen forty four and he was a member of the Coleman Hawkins quartet but it's three years after that in a series of five albums Blue Note when we first catch a glimpse of monkey neatly protests it really repetition and sometimes descendants sound\nThe piano said monk ain't got no wrong we got every one cup of tea and monks approach confused many but not all of his contemporaries [noise]\nDidn't Gillespie and Charlie Parker with two notable exception as was Miles Davis within months recorded bags route which some say contains month sinus recorded piano solo [noise]\n\nNineteen sixty four monk was on the cover of time one of only for jazz\nPetition and sometimes descended sound\nThe piano sitting monk ain't got no wrong every one cup of tea and monks approach confused many but not all of his contemporaries\nDid he get left being Charlie Parker were two notable exceptions as with Miles Davis who to month recorded bags group which some contains monk find this recorded piano so [noise]\n\nWhen I Do sixty four monk was on the cover of time when the only for jazz musicians ever appear on its cover interested they say is history [noise]\n\nPut it in the life has brought you buy ranch food direct emphasizing the importance of knowing where food comes from how it is produced and how far it travels locally produced food available at the ranch direct store the twelve twenty eight you feel more an online at a ranch food to direct dot com\n[noise] does his southern Colorado is NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. ...\nK CCS dark villain K W CCF him with them park\nStreaming at K. R. C. C. dot org eight minutes after seven o'clock Monday found us once again it's the eight of October\nI'm your friend and neighbor Vicki yeah do you think you any advance for warm in the room and Chile and a pretty wonderful day in October ... he had a chance to enjoy it or kicking back right now\nIn this cool evening let's start things off with something brand new friend Brad mailed a trio [noise]\nAnd that is taken from monk's music or some of the players on that particular song Art Blakey John Coltrane Coleman Hawkins tell together making that beautiful sent\nWord of caution\nNot yet at the finish line this week on MORNING edition digging deeper into America's new trade deal with Canada and Mexico is the U.S and see a a win for all three countries and will Congress sign off\nThe single greatest agreement ever say they'll say well you know drop likes it therefore we're not little robot\nListening to MORNING EDITION every weekday from NPR News\nWe dream mornings beginning a vibe on Ninety One point five to your so you see\nThis is your friends and neighbors Vicki wishing you well this Monday evening hope you're hunkered down\nNot yet at the finish line this week on MORNING edition digging deeper into America's new great deal with Canada and Mexico is a U.S MCA a win for all three countries in Congress sign off\nThe single greatest agreement ever say they'll say well you know drop likes it therefore we're not poodle would\nListen to MORNING EDITION every weekday from NPR News weekday mornings beginning a bribe on Ninety One point five to your so you see\nThis is your friend and neighbor Vicki wishing you well this Monday evening hope you're hunkered down in some fashion to placing music to go along with that whose David golly\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\nBut\nMy\nAhead to\nLearn that\nWere not [noise] [noise]\nStore them well not going\nWell\n\nTo\nJohn\nJohn oh man I Wish I was able\nAt least when he is number ... ... the eyeball it to you\nA guy who wants\nTo get on and on\nIn this day\n[noise]\n\nI'm thrilled\nDie oh\n\nNo\nThat guy never got a brother\nFeel\nKnow no\n\nWant\nGod I got a guy by\nThat if\nYou\nDo you know\nI don't enjoy na\n\nNa na\nNa na na\nNa na na\n\n\nBusiness will be doing it to you know I don't know\nGoing to be doing that didn't belong to you know they'll be\nBeep beep too you\n\n[noise] [noise] no I was hoping that bill\nBill with\n\nOne really really\nProgramming on Ninety One point five three or cc is supported by old world big on jelly ... New York style boiled riddles made in house daily to breakfast and lunch menu to pick up or eat in from sandwiches to solid old world bagel in Delhi is located one block west of self circle and twenty\nFive while you're optics the Colorado are we're gallery in the promenade shops at brigade in Colorado Springs and in metro Denver and cherry creek north Greenwood village at the Aspen grow more at your optics dot net your optics the order of optics\n... head of us have throughout our listening area overcast skies and forty two degrees right now in Colorado Springs overcast as well for public forty\nLunch menu to pick up or eat in from sandwiches to solids ... believes located one block west of self circle into our twenty five\nWhile you're optics the Colorado are we're gallery in the promenade jobs at brigade in Colorado Springs ended metro Denver in ... north Greenwood village at the Aspen grew more at your optics dot net you're up to the order of optics\nA chili night ahead of us have throughout our listening area overcast guys and forty two degrees right now\nIn Colorado Springs overcast as well for public forty seven Trinidad forty four mostly cloudy and thirty nine in saliva there is a freeze warning in place for the Colorado Springs area\nUh and it's cold just threw out\nThirty to fifty percent chance of rain showers that'll become snow possibly later on\nCloudy skies and temperatures for the most part in the upper twenties to the mid thirties almost forty four ... this evening tomorrow Tuesday expect some fog rain and snow possibilities\nAbout forty to fifty percent chance of that Seventy percent for the hunter and rocky Ford and uh not too much warmer than this evening it looks like we'll see mostly thirties and forties could get as warm as fifty degrees so for ... and being a vista\nIt's seven forty one and get into this next set of music it'll have some new blood orange in it for you or something from the trust of belief love and respect compilation and starting off with Supreme beings of leisure and Ninety One point five K. R. C. C.\n[noise]\n\n\n[noise]\n\n\n[noise]\nEnd in\nMaybe there\n\nBe decided in January she can\nThe book in\nKnow you know down\nAnd\n\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise] the [noise] the ball to the\nThe the\nThe the\n\nThe the [noise]\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] the thing about the [noise]\nThe the people in multiple [noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\nWas well loved while you [noise] Nineteen Ninety seven ... absolutely no bells and whistles [noise] we had tried to sell it my teenage daughters about me or get money out of it and I'm like no no it's going to buy it and probably about I don't know six months ago I was like okay we're donating it it's the simplest thing I've done\nAnd on the torture goes wonderful\nI'm Susan [noise] I live in Colorado Springs and I was ... years cc daughter word ... mushroom and promotion\nDecisions southern Colorado's NPR station K. R. C. C. K. R.\nDo you know he's ... absolutely no bells and whistles we had tried to sell it my teenage daughters about me would get money out of it and I'm like no no one's going to buy it and then probably about I don't know six months ago I was like okay we're donating it at the simplest thing I've done\nKind of torture guy was wonderful\nI'm I live in Colorado Springs and I was ... [noise] to your daughter word je ... mushroom and promotion\nDecisions southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. cc left to Casey ... K W C. C. F. and little park\nStreaming at K. R. C. C. dot org it's Monday evening music mix with your friend and neighbor Vicki Andy you making this a rather beautiful evening there was a a very cool interview on fresh air earlier today for Terry Gross\nA that's Monday through friday twelve o'clock noon here in Ninety One point five care cc with Adam Cohen Leonard Cohen son uh all kinds of great things were discussed a\nEspecially the music of his father Leonard Cohen and some of the projects they did together some of the Adams and stuff so let's go ahead and start did set off with Leonard Cohen from various positions\n[noise]\n\n[noise]\nGo oh\nAll\nWho led the mayor's steel\nAs a rom\nRather than we are lonely\nA\nThe way I mean how are we are all about\nMe about as low\nDa da da da\nTo be more than\n\nThen they can be an\nTo be armed [noise] then\nKnow where\nThen the to the er\n\n\nA stay\nA\nNot walk\nIn and put me out in the ...\nYeah ... ...\nBeen you know\nNot do as a\nKid and we're not out in the ...\nJust like we used to run ball whiz low key\nBeing na\nSearch in ... you could\nGet a well sometimes a long enough time way\nLet's just go away for a day and I love your mom always a family member that they're not you\nCan\nI tell\nYou the men when oh\nMan and\nA baby in the ...\n\nWhen we come back in the\nSlow\nDown and not\nJust pro men you may be some ... [noise] I don't\nStarted showing me [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nThey need\n\n[noise]\nThe thing\nBaby cry\n\nNot\nA novel and Judd old men you may want\nTo go in and\nCatching me\n[noise]\n\n\n\nDid he have been no\nMaybe maybe than\n\n\nThe Monday evening music mixed on any one point five K. R. C. C. and air taken from Puckett symphony once upon a time\nAnd he Lenexa headed that from her diva release money can't buy a ... after midnight that goes back to her very first one I Believe the first one I knew about called dreamland\nAnd Leonard Cohen at the top of the SAT taken from various positions and dance me to the end of love\n\nMy name is Benjamin charm president an order of monuments occupational medicine in monument Colorado are targeted audience are owners will companies HR professionals safety managers and injured workers don't have the medical care that they need to get\nBack to work with the blue Jay or CC's helped us quite a bit and we are able to team a lot of access to individuals we normally wouldn't have access to through other means of advertising [noise]\nIf you would like to become an underwriter like mean preschool Jeanette seven one nine four seven three for each one\nEither this is my little to the beach boys by this is Jonathan from shorter than the dominant ... from the motion\nThat'd be the end of the night my Ninety One point five K. R. T. the\nNPR on Ninety One point five to your cc is supported locally\nBy Anderson and used PC attorneys that law providing legal assistance to listeners throughout the front range in central and southern Colorado commercial and residential real estate transactions and water law more it Anderson does she use law dot com\nBuy seeds consulting deposit carry offering herbal formula was prepared on site such as intestinal sued embroiled blend which all balanced digestion consultations am classrooms available at twenty seven twenty seven north during ... street\n[noise] twenty minutes after eight o'clock Monday evening Ninety One point five K. R. C. C. got the dean John Butler trio queued up and ready to go you can also be a hearing since ...\nCommercial and residential real estate transactions and water law more at ... dot com\nBust each consulting ... offering herbal formula was prepared on flights such as instructional sued embroiled blend which all balance digestion consultations and plasters available at twenty seven twenty seven north during home screen\nTwenty one minutes after eight o'clock Monday evening Ninety One point five K. R. C. C.\nGot the dean John Butler trio queued up and ready to go to also be a hearing some trauma Hogan and ... in debt is music in since ... Phyllis mercy check it out Ninety One point five K. R. C. C. job ... trio [noise]\n\nA\nDi di\n\n\nDa da da da\nNa\nDied in\nTop so they're not going to blow up a [noise]\nA new ... not\nDream at\n[noise]\nTo lose a guy who's\nTop so to speak to you know [noise]\nA new ... and\nDream as a\n\nA day or a certain way\n\n[noise]\nHe just didn't go\nWas just thinking this guy\n\n\n\n\nThe music of divide gun Ninety One point five K. R. C. C. brand new from this night falls forever\nAnd done with those days strangled others ahead of that with golden brown in there as well to my ...\nAnd it's tough sledding go just full of mercy just ahead of to my father son that would be Ben Harper josephs are suing Danny Harrison together is just full of\nMercy rumor has it they want to do another record together so we'll see how that works out brand new at the top of the set jumbled their trio he shouldn't blue from his latest home\nHey thanks for listening with David Draine ... students I'm Rachel Martin say there is Joshua Johnson hosted one ... and ... joined me and my co host weekday mornings for news and cultural coverage on Ninety One point five K. R. C. C.\nProgramming on Ninety One point five tree or cc is supported by university park ... promoting stroke and Parkinson's career all farmers here as well as long or short term rehab committed cultivating a nurturing skilled nursing facility university park ... CEO dot com\nWant to remind you that it being Monday evening in all coming up at nine PM will have the latest edition of looking up so keep it tuned to Ninety One point five K. R. C. C. for that and great music\nOvercast guys forty degrees in Colorado Springs forty six for ... forty five in the hunted in thirty three in woodland park all under overcast guys freeze warning in effect throughout El Paso county thirty to fifty percent chance of rain showers and later on pasta\nWant to remind you that it being Monday evening you know coming up at nine PM will have the latest edition of looking up to keep it to ten Ninety One point five K. R. C. C. for that and great music\nOvercast guys forty degrees in Colorado Springs forty six for Pueblo forty five in the hunted in thirty three in woodland park all under overcast guys\nFreeze warning in effect throughout El Paso county thirty to fifty percent chance of rain showers and later on possibly snow thirties for the most part overnight mid to upper twenties in to lie to him being a just a\nCloudy skies going along with that as well Tuesday promises to be rainy and possibly snowy as well areas of fog and missed\nTemperatures will be in the mid forties into the low fifties remaining in the thirties\nFor teller county a bit warmer though in chief you can only about fifty degrees there as well [noise]\nWant to get into the music now starting off with when St go machine a Ninety One point five king or C. C. O.\n\n[noise]\n\n\n\n\n\nOr\nThose words ring the phone number is ... what was going to be for whatever\nReason\n\n\n\nAnd it's critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR to the Ninety One point five here cc newsrooms we have the best journalists bringing you intelligence insightful reporting to help you understand the issues and the candidate\nBut quality costs money as a nonprofit media organization we look directly to you to help pay the costs of our services\nBecome a part of the team contribute at ... dot org today thank you\nThis is southern Colorado is pure\nIn this critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR to the Ninety One point five K. R. C. C. newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidates\nBut quality costs money as a nonprofit media organization we looked directly to you to help pay the costs of our services become a part of the team contribute at K. R. C. C. dot org today thank you\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. hunter K. C. C. Esther villain K W C. C. F. M. woodland park\nStreaming at K. R. C. C. dot org come into right on up looking up and following that much more music uh Ninety One point five K. R. C. C.\n\nIt's looking up and southern Colorado from Colorado Springs Astronomical Society I'm ... and there are lots\nOf reasons to look up phase edition of looking up is going to be well very average and that's because the subject of today's episode is a very average SARS named them all but in this case being very average is very very helpful to astronomers\nLet me tell you why I'm all is the brightest star magnitude to point out in the fall consolation of Aires the rams but it's not special because of its location in fact it's not special at all which makes it well special it seems at home all is the absolute prototype for an orange giants star\nAbout Ninety times brighter than our sun astronomers have been able to calculate his temperature very accurately seven thousand eight hundred and two Fahrenheit\nWhich in turn leads to more calculations\nIncluding letting us measure the diameter of the fun very accurately we know that ... has the angular diameter as seen from earth\nOf only point zero zero six eight degrees put another way home all it's only the size of a penny viewed from thirty seven miles away that's pretty precise I think but that's just my two cents if you'd like to take a closer look at a mall or any of the other wonderful and amazing things in the sky\nPlease visit ... or for a link to information on our monthly meetings and our republic third parties does his ... Kessler for the Colorado Springs Astronomical Society and Ninety One point five care cc telling you to keep looking up southern Colorado\n\nPoint zero zero six eight degrees put another way home all it's only the size of a penny viewed from thirty seven miles away that's pretty precise I think but that's just my two cents if you'd like to take a closer look at a mall or any of the other wonderful and amazing things and the guy\n... dot org for linked to information on her monthly meetings and our republic start party wants\nTo do ... get blurb for the Colorado Springs Astronomical Society Ninety One point five ... not telling you to keep looking up southern Colorado\nNa\nI'm going to\nOh well\nShoo\nMm\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\nMm\nMm Mm Mm\n\n[noise]\nStrength and crashed and easy\nReally [noise]\nJews and\nChoose and\nGot semi awesome colors coming up here later in the set but let's go ahead and kick it off with the dead weather\n[noise]\n\nIn this said that it's go ahead and kick it off with the dead weather\n\nNo\n\n[noise]\nIn may but\n[noise]\n[noise]\nReally no\n[noise]\nThe shade\n\n[laughter]\n\nEdge\n\nOf\n\n[laughter]\nMm Mm Mm\nIt for two hours to\nGo\n\n\nAnd\nTo me\nAnd yeah\nI mean to me\nAnd then\nI went into the ... a man named the\nAnd\nAnd and then and all\nAnd then during the day\nDay and a bomb\nAnd and\nMany young men and women\nTo you know and and\nAnd on\nTo\nIn\nA in the news\nA and a the\n[noise] [laughter]\n[noise]\n\n\n\n\n...\n\n...\n\nLine\nFor\n[noise]\n\n\nNa na na na na na\n[noise]\nBeen in a\nLoud\nBang\n[noise]\n\n\nAround\nA\n\nHow\nOn\nWhat\n\n[noise]\nOut\nTomorrow forty to sixty percent chance of rain fog miss snow early on\nAnd temperatures warming up somewhat forties and fifties especially in ... county area\nUh do look for those early morning fog and miss patches be careful if you're driving around and make sure there's no slick spots as well when should be on the lighter side it's nine thirty nine and want to get into this\nForties mid to upper twenties for ... and ... just about freezing and tell her Toni to moral forty to sixty percent chance of rain fog miss snow early on in temperatures warming up so much\nForties and fifties especially in ... county area\nBut I Do look for those early morning fog and missed patches be careful if you're driving around and make sure there's no slips but as well when she'd be on the lighter side\nIt's nine thirty nine want to get into this last set of music for this side of your Monday evening let's go ahead and play something from pulp fiction the new crime jazz compilation\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nDa", "month": "10", "day": "09", "state": "CO", "station": "KRCC"}