{"year": "2018", "show_name": "91.5 KRCC Music with Vicky Gregor", "city": "Colorado Springs", "content": "Is APO dishes southern\nColorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. lie to K. C. C. S. ... in K W C. C. F. M. woodland park\nStreaming at K. R. C. C. died or this is your friend and neighbor Vicki a sitting in for these last few minutes for my ... thank you for keeping tune to Ninety One point five\nK. R. C. C. members supported public radio for southern Colorado a quicker\nTuned to Ninety One point five K. R. C. C. members supported public radio for southern Colorado a quick look at the weather it looks like we are entering a cooler and rainy or part of the week\nOver these next few days you can expect a forty to fifty percent chance of rain showers and under storm activity in Colorado Springs Pueblo saliva and the union vista Seventy to eighty percent chance of rain for Trinidad for Tuesday evening\nAnd Wednesday it looks like we will have cloudy skies tonight temperatures for the most part will be in the thirties\nAnd in the forties or you can expect Wednesday's highs to warm up a little bit into the middle and upper fifty arrange so make sure you have your and coats in your own ... and enjoy that good smell\nThat is going to be a coming your way here in southern Colorado coming up here and just a few moments it'll be time for NPR hourly news\nAnd following that a day in the life and then I Will be on the\nTuesday evening music next on any one point five K. R. C. C.\nLive from NPR News in Washington ... beer President Trump is describing the killing of a Saudi columnist as the worst cover up in the history of cover ups secretary of state says the U.S is taking appropriate steps in response and considering targeted sanctions more from NPR's Michel Calvin\nSecretary of state Mike Pompeo says the U.S has identified some of the officials in the Saudi intelligence services the royal court and the foreign ministry who are suspected of being involved in the killing of ... and ... says the U.S is revoking their visas\nThis is certainly not the last us or that we will take that we will continue to do our own efforts her own for finding to make sure that decision of the United states makes are based on real facts in real data that we can conform ourselves\nTo secretary than saying whether the U.S believes that the Saudi crown prince was part of what President Trump now described as a cover up he says the U.S should have a better sense of the facts and the next few days Michele ... NPR News the state department\nClinic pulled into the main square but southern Mexican town today to treat some of the Central American migrants who are in a caravan trying to reach the U.S now estimated being as many as seven thousand\nSkin town today to treat some of the Central American migrants who are in a caravan trying to reach the U.S\nNow estimated being as many as seven thousand people group is so large that some people are being forced to camp on a basketball court with no facilities and little food group is resting after days of marching earlier today the house state Leadership Conference in Washington President Trump reiterated his position on the migrants\nWe have a lot of people coming up we can't let that happen we have a border\nWe don't we hit a wall Trump also again blamed the poor southern border for allowing drugs into the U.S president has threatened to reduce or cut off aid to Central American countries including Guatemala Honduras and El Salvador were critics complain that will may cause more people to leave those countries\nAs hurricane will that moves closer to the Mexican coast authorities are rushing to evacuate some low lying areas the category three hurricane with winds of a hundred and twenty miles an hour is expected to make landfall along this stretch of the Pacific coast dotted with high rise resorts served surfing beaches and fishing villages\nJittery investors sold off and largely bought back shares today is volatility returned to the u._s. stock markets NPR's Yuki Noguchi reports the Dow end of the day down and a half a percent\nConcerns about a slowing Chinese economy and increasing tensions hitting us in Saudi Arabia prompted in early sell off at one point the Dow Jones industrial average didn't nearly five hundred fifty points before rebounding in the latter part of the day at\n... has already been volatile months and market and let's say that could continue has invested worry that the global economic expansion that field the ball by ... beginning slow those concerns and they declined for industrial stock such as three ... caterpillar\nThose stocks were hit especially hard at the company's forecast for a demand and higher cost ... NPR News\nWashington but as that goes down thirty one points to the U.S and the five hundred drop Fifteen points this is NPR\nBridges go eat is big uh thirty four mile long span that open today looking Hong Kong to the Chinese mainland\nChinese President Xi Jinping today presided over an opening ceremony for the giants structure it took almost a decade to build includes an undersea tunnel and cost tens of billions of dollars new super size six lane bridge will cut travel time from what has been several hours to just thirty minutes linking an economic zone of Seventy million people [noise]\nWashington DC attorney general Karl Racine announced today an investigation into the Catholic archdiocese of Washington for any sign of a sex abuse cover up by area clergyman Natalie ... of member station\nStation into the Catholic archdiocese of Washington for any sign of a sex abuse cover up by area clergyman Natalie du ... member station WAMC us more\nIn D.C the attorney general's office did not have criminal authority in cases of sexual abuse as all felony cases fall under the jurisdiction of the U.S attorney's office\nHowever the the attorney general Karl Racine does have the authority to investigate the church for any violation of the district law governing not for profit that lost that charities and not for profits in Washington cannot be involved in any cover up or can seem like it illegal activity and there's no statute of limitations\nIn other words the agency's out that had subpoena power and access to a decade of records from the archdiocese\nTwo prominent Washington cleric tip recently been forced out over sexual abuse or concealment of sexual abuse when the third in other cities for NPR News I'm Natalie don't get to you in Washington\n... futures prices took a hit today oil down more than four percent to end the session at sixty six forty three a barrel on the New York mercantile exchange I'm jak sphere NPR News in Washington\n\nSupport for NPR comes from NPR stations other contributors include that Jayanti and Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information or Mac found dot org and the listeners who support this NPR station [noise]\nHow many trees and this is a dam of life for over twenty third\nOne was on this day in two thousand and five a soul singer ... gave its final form and\nIt was a game two of the world series between the Houston Astros and the Chicago White Sox\nA team of which who rose had been a lifelong\nAnd remember the time\nOn on the Southside of Chicago rose grew up singing in the church and soon move into the cities music scene\nBumping shoulders with future music icons Curtis Mayfield and Sam Cooke and cook who were both members of the teenage kings of harmony local scene years later after touring the country as a member of the pilgrim travelers he moved to LA and recorded backup vocals for Sam cooks bringing on home to\nGlobal ended his own record deal with capital where he recorded his most no so you'll never find another love like my [noise]\nWhen does his own record deal with capitals where he recorded his most known song you'll never find another love like my [noise]\nIn Nineteen Seventy seven roles was invited to sing the national anthem before the Muhammad Ali Ernie shave was like\nIt did so well that he'd be regularly invited to send the star Spangled Banner and all sorts of events for over the next twenty eight years it was the song he's saying again two of the world series [noise] one that his ... White Sox will go on to win [noise]\n\n\nAnd the rest of the things [noise]\nIn a life is brought to you by ranch food to direct emphasizing the importance of knowing where food comes from how it is produced and how far they travel locally produced food available to any truth to direct stores\nTwelve twenty eight piecemeal more online and rent free to direct dot com\nEight minutes after seven o'clock you're listening to Ninety One point five K. R. C. C. It's Tuesday the twenty third of October I'm your friend and neighbor Vicky thank you so much\nFor following along this Tuesday evening and brightening after him like you do let's go ahead and start things off with Lou wells and this one taken from black and blue and tobacco around\nA loan\nMom mom or dad and my God we're a little oh you live you know to grow\nUp to back\nGrew\nI grew up in the\nRun this shot\nAll our own hang it on my back\nOr knows\nWe [noise]\nThat is the music of Toshi Reagon on Ninety One point five K. R. C. C. from justice you heard how long I Toshi Reagon also doing a lot of production work especially with her mom Bernice\nWho is one of the members of Sweet Honey in Iraq so really a a talented in lovely family there\nShannon shop from Shannon in Nashville her latest release\nBroken my own Dan are back from black keys are weighing in on that record as well and starting things off with Lou wells and the title track to tobacco road\nThe information on the evidence that we have so far collected indicate that Jim ... was slain in a vicious violent monitor\nThis week on MORNING edition Turkey's president has put his accusations on the record how will President Trump addressed that cause she'll do situation just two weeks ahead of the midterm listening to MORNING EDITION every weekday from NPR News weekday\nMornings beginning at five on Ninety One point five to your so you see\nNow you can tune in to Ninety One point five K. R. C. C. without lifting a finger just down your smart speaker to tune in ...\n[noise] [noise] [noise] programming on Ninety One point five three or so you see is supported what community\nKarate and fitness helping parents feel special under the tree this holiday season was karate uniforms could be wrapped in classes that started in January schedule and more online at nice karate school dot com\nBy Rocky Mountain PBS presenting seasons serving of arts district a weekly half hour TV program devoted to Colorado arts and culture including stories from the pikes peak region info at our him PBS dot org slash arts district\n[noise] Twenty one minutes after seven o'clock you're listening to southern Colorado's NPR station Ninety One point five K. R. C. C. the Tuesday evening music mix with Fleetwood Mac\nThe Knicks it's Fleetwood Mac\nAnd\nYou go\nAway and then go\nIn meaning splendor it's warm\n\nThe ban on gay and then the Muslim and when the new born dream job every day\nBut he has no meaning you my job so what\nDo we do\nOne thing that I have no color words do grow\nWhy um travel or Google dot com so to get under your nose\nYou do the things I read that are going to come by and then when they do a storm named John bam bam\nBetween\nOne meaning men's butter from I'm\nA black swan cattle dog\nThe well\nGoing to do some by what am I going to be able to change\n[noise] [noise] [noise]\n\n...\n\nGuy\nDa di di\nDi\nAnd he had\n\nTwo and according\nNPR Ninety One point five through your cc you supported locally by the Colorado health foundation committed to advancing and improving health care for Colorado communities more information on the Colorado health foundation and their core principles is available at Colorado health dot org\n[noise] this is your friend and neighbor Vicki hope you're doing well out there it's seven thirty nine on Tuesday evening weather wise mostly cloudy skies and fifty four degrees mostly cloudy as well for canyon city and Pablo at sixty degrees overcast and forty four in saliva\nAnd the same holds true for Trinidad at fifty three degrees that chance of rain with us for the next few days anywhere from forty to Seventy percent chance of that this evening and fifty to eighty percent and it looks like Trinidad has the are the biggest percentage of\nRain showers fog and this happening at tonight's temperatures will mostly be in the thirties and forties tomorrow you can expect to vote to upper sixties so a grab that umbrella and that rain talent and go splash and a few puddles\nYou will thanked me tomorrow brand new music now from real Mira on any one point five K. R. C. C.\n[noise]\n\n\n\nA yeah\nOh yeah\nOh yeah\nI don't\nKnow how high\n\nNo she sued and I live in a casual thing to do [noise] ... showing the book that my job\nTo\nGo do what she did ...\nDid you guys\nGot another\nOne yeah a lot of it but are\nReally ... I Know the most you know I Do my job I guess ah [noise]\n\nI guess ah [noise]\n\n... no I did a good ...\n...\n... ... ... ...\n... ...\n... she\nShe got she got\nIt back then he's got blown up oh ...\nThey ...\nThey know how could they do that to to to Jake so\n[noise]\nNo my neither oh she did that show too damn multi cool\nDog enough that Kesha\nPull new book why you\nShould go to the was the two\nMen ... oh no no no\n... got ah the guy\nThat got the get\nI don't know the ah there's maybe a no\nShow they\nThey got ... got ah [laughter] [noise]\n\nThey love me and\nMan\nOnly thing they do pay a heavy rain than me I'm not by the\nThe\nCheese eating you\nKnow\nAnd\nThe thing that I Need to\nFrom a bit and then\nTo\n\nThe joy of noise that is the afro Cuban all stars on Ninety One point five K. R. C.\nThe joyous noise that is the afro Cuban all stars on Ninety One point five K. R. C. C. keys in crates ahead of that music to my years\nIn there as well to kind of Batman from a beautiful record again I think everyone should have in their collection freedom is free jealousy ... from the window her brand new one just ahead of kind of Batman\nAnd real there are starting things off at the top of the set\nFrom their latest marine but del Pacific all\nOr\nWind down your week in the evenings which jobs from seven to trim everyone went far after your\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. law to Casey ... K W C. C. F. M. woodland park streaming at K. R. C. C.\nDot org skip back into the music and then I'll talk to you a little bit about who's in the studio with me tonight\nDing\nMm Mm Mm\nHim he\nWill leave you know\nI'd say that in many ... do you\nWeigh more than ... law as we mentioned in the ... the only way to go there and do they know about Joe I'm going in\nThere and watch all the\nWhen I Do need to buy\nGun in the same thing\nOf uh [noise]\n[noise]\nKnow what they\nWe'll\nSee you know when the big bang bang\nBang\nBang bang bang bang bang for them so they're looking at the same way with the main thing than the one they're going to vote for them and they were going to be you know in this\n... when you go see a return ...\n[noise]\n[noise]\n[noise]\nAnd I don't really do\n\nIn\n... new ... in ... in a little bit of\nA legal thing will\nBe in\nThe\nGo about it and going and they\nLive\nDog named oh\n[noise] [noise]\n[noise] [noise] [noise] well I Do not do that [noise] [noise]\n\nNo [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nI don't know\n[noise]\n\n[noise] [noise]\n\n[noise]\nBut\n\n[noise] [noise] [noise]\n\nAnd [noise] I\nMean a thing [noise]\n\n\n[noise]\n\n[noise]\nI'm\n\nNot I don't know\n\n\n[noise]\n\n[noise]\n[noise] really [noise]\n[noise] [noise]\n[noise]\n[noise]\n\nThat is totally a wonderful song Jake Shears from his new one's self titled\nAnd breathe through Jake Shears also known as the scissors sisters in making just one great record after another the magnetic field they're headed that from sixty nine love songs I don't want to get over you talk talk in the middle title track to my life\nTalking heads with I get wild wild gravity\nTalk talk in the middle titled track to it to my life\nTalking heads with I get wild wild gravity\nAnd starting things off at the top of the SAT on the little walk Bob label David Bird happened a hand on that William Anya bore taken from World psychedelic classics who is William ... Ninety One point five\nK. R. C. C. and this is a perfect time for me to say this or if you're enjoying the music tonight and I sure hope you are\nI'm having a a wonderful guest in the studio with me her name is Hannah she's the general manager to the sock that's the sound of Colorado College\nAnd has been doing the lion's share of the songs and the sets that you're hearing this evening so a time to give a shout out where it belongs to Hannah keep tune in Ninety One point five care see see we're going to keep it coming your way\n\nTo members from the judge or the ones with for years he joined me for a journey through the mobile vocal or go brutal seven of them on the one point for years [noise]\nNow you can have the Ninety One point five years he see newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning sign up at ... dot org\n[noise] twenty three minutes after eight o'clock the Tuesday evening music mix on Ninety One point five K. R. C. C. southern Colorado's NPR station I'm your friend and neighbor Vicki Hannah in the studio as well in common euro way right now aerial pinks hunted graffiti\n\n\nKnow\n\nMaybe\n\nEarly ... to me would be what they may\nBe too bad [noise] see\nWhy\nI Do\n\n\n\nTell\nYou didn't do so much better when we come\nBack [noise]\n\n\nKnows\nKnow I tell you about\n[noise]\n\n\nNobody\nSome time out one\nLove me like you say wait a minute I\nThat I've been I've been on the streets sometime I put my mom\nWas\nRuined\nWorld come we're\nWay already know why that John Adams\nDog and\nRow\nThree\nThere by\nA stream has murder\nOn her watch\nWhen they were both on the I\nI was done did we know it was well\n\nWould have done to when I was\n... a year when I was a\nDoes you would uh with uh\nJudge has to do\nThe run up to new\nA\n\nJob in the last day\nFor a\nAnd then one day\nA man\n\nThe time or just in listening to talk\nTo\nGet a job\nDa da da da da da da da da\nDa da da da da da da da da\nDa da da da da\nDa da da da da\nDa da\nDa da da\n\nDa\nDa da\n\n\n[noise]\n\nNinety One point five K. R. C. seeing the Tuesday evening music mix started ... set with Al Green tired of being alone steely Dan after that from can bias thrill and only a fool would say that\nShe directs cosmic a dancer and that from electric warrior\nConan the cats and I am the man that will find Jew and in the background fading out Neal in Liam Finn from their new one together light sleeper featuring ... on guitar and vocals as well and where's my room\nMore and more people are getting their news on mobile devices in through social media in Ninety One point five feet are cc doesn't have to be any different miss this morning ... find it on our website getting out of your car went to keep listening to all things considered download the mobile apps and he didn't want to\nMiss this morning news can't find it on our website getting out of your car went to keep listening to all things considered download the mobile apps\nNeed info on a local story impacting your community followers on Twitter feel like passing along that NPR story like us on Facebook the news never stop and neither do we Ninety One forty five K. RCB Newt\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. the hunter case CCS struck villain K W cc ed than woodland park\nStreaming at K. R. C. C. dot org one minute after nine o'clock\nI'm your friend and neighbor Vicki wishing you a great Tuesday the third our of the Tuesday evening music mix\nI won't let you know that coming up at one minute after ten o'clock it will be NPR hourly news\nAnd following that Tuesday means one thing and that is Dr chi your music master will be in with the Tuesday late night music show I reveal nothing but he's getting it together right now and I see some of the stuff he's got planned for you so a stick around you've been to one\nNinety One point five K. R. C. C. music now from one of the best bans I've ever seen live and it happened at red rocks and boy still smiling here's Wayne\n[noise] [noise] [noise] [noise] [noise] ... me that\n[noise]\n\n\nMe that [noise]\n\n\nOr [noise] [noise]\n[noise] [noise]\n\nAnd\n\n[noise]\nWhy are you scared to ...\nEven\nThe stars [noise] son so\nAn all day is seen\nClass um\nI feel to read this to\nSomali Boston bar\nWay ... ...\nBut she knows that\nTo turn the bomb at all\nShe says these bars are still\n[noise]\n\n...\nYou're not going to stay in the fall and\nA million new ... man no\nLong at all\nTo the city to\nPay them for\nA long\nThe [noise]\nA\nFrom home\nIn the ...\n\n\nBright eyes remind wide awake It's MORNING with any Lou Harris we are no we're in now and ... for the requests for mark ...\nTo remind wide awake It's MORNING with any Lou Harris we are nowhere and it's now and starting off with a request for mark not fully with any Lou Harris from all the road running and this\nIs us\nThis election year you can count on to put the best journalists on the job from NPR to the Ninety One point five K. R. C. C. newsroom we bring you insightful reporting to help you understand the issues and the candidate you make it possible by donating at K. R. C. C. dot org thank you\nNinety One point five ... she is dedicated to covering a changing southern Colorado your membership ... refund our local reporting thank you for your sister a membership\nI'm Lisa to sorrow it's I Am cofounder of at the central co working and the president of the Komen Foundation I'd been a member of care she's the\nFor over ten years I Would encourage anyone who listens to care sixty to also becoming number you know if you listen you certainly must find the programming valuable I think that we all listen to care she fee to keep up to date on what's going on in our world aunts and uncles our world\nIs really close to us and sometimes it's our world for\nMuch bigger joined Ninety One point five ... here she C. dot org\n[noise] nine forty Tuesday evening music Nixon weather wise we've got some clouds in Colorado Springs fifty two degrees with a hunter reporting cloudy skies and fifty six overcast and forty three in woodland park\nA very good chance of rain on and off the CD dean and tomorrow throughout our listening area cloudy skies lighter winds for the most part\nTemperatures this evening in the thirties and forties and tomorrow ties will be mostly in the low to upper fifties lunch in rocky Ford could a bump into the low sixty range\nGetting into this last set of music for this side of NPR hourly news Tuesday evening\nWant to go ahead and kick things off with their replacements [noise]\n\n\n\n\n\n\n\nNa na\n\nNa\nNa na\nNa na\nNa\nNa na\n\n\n\nAnd\nA lot of\nKnow there\nDad\nI\n\nWas\n\nMax and\n\n\n\n\n\n\n\n\nAnd\n\n[noise] [noise]\n\n[noise]\n[noise]", "month": "10", "day": "24", "state": "CO", "station": "KRCC"}