{"month": "10", "state": "MS", "station": "WMPN", "content": "Looks like Kurt Eli Dianne Reeves and great reporter mark in Charlotte it's been some time with after glow Sunday said six and BP music radio\n\n\nStations have been ... be music radio R. W. M. A. H. Biloxi there'll be ... ... ... you may you you\nIt'll be impeded in Jackson W. M. A. W. ... have you and may be stark W. M. A. V. Oxford W. M. A. O. green ... chicken what's happening on MTV music radio and listen online at M. B. B. on line or gee\n\n\nI have a secret to share\nSome of my favorite music as we find a great classical Massachusetts music I studied playing years\n[noise] my favorite music the music\nThere is something about the linking has a good time with music the\nMusic was composed to accompany a particularly big snake emotional and true story but you do a film and scored by a composer who make the real people in town took great care with the music\nThat said there's something that I don't like about the score share that with you later this hour [noise]\nThanks for joining me my name's Andrea plane and this is music through the night by young I think I hear your number three the I'm a man with a box and Sonia Mm\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n\nOh [noise]\n\n[noise]\n\n[noise]\n\nNo\nNo\n\nNo no\n\nNo no no no\nNo [noise]\n\n[noise]\nNo no\nNo no no no no no no no\n\n\nAnd the\n\n\nDa da da da da da\nDa da da\nDa da da da\nDa da da da da da da\nDa\nDa\nDa da\nDa da da da\n\n\n\n\n\n\nOh no no no no\n\n\n\n\n\nNo no\nNo\n\n\n\n[noise]\n\n\n[noise] no no no\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nYou know the role\n\n[noise]\n[noise] handle contention for two or ... number three with the academy and the ... music led by Christopher ... would\nHave you been feeling music now I Do know some music\nAnd uh and it sounds you know ... and ... what did film composer so his music is lovely and very suitable for the ... which is based on a true story he actually met the woman I mean and spent time getting to know the story\nIt's an Irish story however my beef with the score is that it doesn't use all the colors of Irish music that's sad\nIt's an awfully score the scores Seventeen the here's the sweet\n\nI M A s M A s a you", "year": "2018", "show_name": "Documentary or Book Club", "city": "Jackson", "day": "03"}