{"month": "10", "state": "NH", "station": "WEVN", "content": "One fifty nine this is an HP our support for an HP are comes from you our listeners interim you an age of MBA program fulltime on line and part time in Durham in Manchester information session October seventeenth\nDetails and application of NBA dot UNH dot edu\nAnd from North branch construction celebrating sixty years any business on time on budget on line at north branch dot net and from the courier museum of art presenting Ethan Morrow hauling featuring panoramic hand drawn murals inspired by the history of Manchester now on view details that courier died or [noise]\nSunny today plasma lower sixties me mostly clear tonight lows around us\nIt was coming to an age PR [noise]\nThese are the stations or New Hampshire public radio W E view conquered Manchester eighty nine point one W.\nE. V. S. Nashua it'd be a point of\nView and one more three double you ... the windy point seven W. B. C. or one of seven point W. E. D. J. jak Ninety nine point five\nWCBS cobra viewpoint W cute little Ninety One point nine and on line and H. P. R. dot on\nLine from NPR News in Washington I'm Louis skills on the nomination of Brett Kavanaugh to the Supreme Court is now on track for a final Senate vote probably sometime this weekend on this vote the yeas are fifty one\nThe nose are forty nine the motion is agreed to ... the majority yes vote on the procedural question the Senate will now continue to the final confirmation decision NPR's Scott Detrow has more\nIt was a party line vote with two exceptions Alaska Republican Lisa Murkowski voted no in West Virginia Democrat Joe Manchin voted yes senators can still change their minds ahead of the final up or down vote in fact Maine Senator Susan Collins a Republican\n... may not be final and she'll announcer ultimate decision later today in a speech on the Senate floor\nThe final vote will likely be held Saturday but it could be pushed to Sunday if Collins is a no Montana Republican Steve Gaines won't be available to vote tomorrow because his daughter is getting married Dayton says he won't skip the wedding for a vote Scott Detrow NPR News Washington\nThe nation's unemployment rate fell last month to its lowest level in nearly half a century NPR's Scott Horsley reports White House economist suggests the long running recovery is just getting a second went\nHiring slowed a bit last month partly because of Hurricane Florence but we only employment rate which is calculated from a separate survey still drop by two tenths of a percentage point to just three point seven percent what else economist Kevin Hassett says the jobless rate hasn't been this low since Nineteen sixty not\nIt really has us puzzling with our puzzlers here about how low the unemployment rate really can\nGo many employers complaint is getting hard to find all the workers they need but so far that has not produced a big spike in wages average hourly wages in September of ... up by modest two point eight percent from a year ago Scott Horsley NPR News the White House\nThe Nobel Peace prize this year goes to a Congolese doctor and an Iraqi woman who are working to end the use of sexual violence as a weapon of war the owner raised Dr ... and not him a rod ... survivor of kidnapping and rape\nWho escaped to tell the world the story of girls and women like herself\nUnited Nations secretary general Antonio good cherish applauded the decision of the Nobel Committee\nOwner to lay the mood of\nVenues for\nBeing on the swim team no these products in defending the victims of sexual violence costly for them is our share of\nBoth on a reserve are the first one their country's Democratic Republic of Congo and Iraq to receive the Nobel Prize\nDr ... says his dedicating his award to all women affected by sexual violence Wall Street at this hour the gal down two hundred and thirty points this is NPR\nSo my name is Sarah Walsh I'm from ... New Hampshire and usually listen to the Concord station for me I'm working eighty percent and having three kids it's really hard to stay up on the news and also sometimes painful to hear the news but at least advantage here I can listen to\nThe reliable source and the Internet ... humor wherever possible which I'm always\nSo there's plenty of people out there I think that listen to NPR they haven't taken the lead and I always use a little bit of a reference I'd say ... how much ... spending and everything else\nYou know let's help out I decided to become a sustaining them or an HP are on 'cause really the right thing to do it's a great community resource and want to make sure we can stay in it and I had the ability to help so we do [noise]\nAnd you can join Sarah today on this last day of our fun driving supporting and each PR I'm ... I'm here with Todd book men and we want to share with you this is the end of our fall fun driving our goal is to encourage every listener who values and age PR like Sarah Walton cocker does to support the station it's\nImportant because listener as far as our largest support source of revenue so you can help make this drive a success in our remaining hours by contributing an any amount ... at an age PR to or we have just five hours left in this phone numbers drive and we need your help now\nDon't we [noise] yes and when you contribute you will be entered too when the final give away of this drive this is the big one the once in a lifetime trip for two to Australia\nOr New Zealand the opportunity to get in this drive excuse me to get into ... ah a gateway drive ending of the trial ends at seven PM so there's only you know five hours left to go again the winner will choose either New Zealand or Australia ... includes round trip airfare for two from Boston accommodation\nFor eight nights you want this trip so when this trip and the best way he's by giving right now on line through your checking account or your credit card pick a level that works for you five bucks ... ten bucks a month [noise] go to an H. P. R. dot org\nTodd I've been having some fun facts about Australia to share with all of us we have the great Barrier Reef\nSydney isn't Australia they have barbecue they have why they have ... there are so many reasons to go to Australia and we have even talked about New Zealand yet so don't wait now is your chance to join this fall and drive to support and H. P. R. and B. entered for a chance to win that triple the lifetime to Australia New Zealand\nYou can do it now at an H. P. R. dot org we thank you for your support and we thank you for listening\n\n... science friday I'm Ira Flatow coming up being danger ... fossil treasures of Utah's ... slim down national monuments\nWe'll talk about the potential loss of important the fossils are the grand staircase and bears years\nBut first we're are around a hundred named ages in general you know all those if you're in general just my heart goes out to to remember once he's\nIn our recent proposal wants to edit a new one dating around forty two hundred years ago it has set off a debate between geologist and archeologists about what the ancient world really was like back then\nJoining me not to talk about that and others like Detroit subjects and science is that only knew what she science journalist and book author based in San Francisco she joined ... from Cape Cod ... welcome back [noise]\nHey thanks for having the I Know this was one of your favorite subjects and [laughter] right right yes it is so what does this debate about what ... what we're saying we need a new geological age and wide fellas in on it\nSo we actually do have a new geological age it's called the ... the age um it's named after estate in India and as you said it starts about forty two hundred years ago and it goes up into the present and it's been the source of incredibly bitter debate between\nGeologist and archeologists because\nThe way the geologist decide that there's ... new age on earth is that they have to identify some kind of huge event that's changed the east coast\nWe're in a new age here and so some of these events or things like ice ages or you know a media right hitting the earth things that we recognize kind of catastrophic\nSo for the ... in age what geologist argue is that there was a global dropped that affected the course of human civilization because remember this was a period when we actually have human cities and writing and people are kind of doing their thing\nAnd what archaeologists are saying is no actually we don't really have evidence that there was a drought that was altering civilization\nWow it was like the farmers in the cowboys should be [laughter] I mean so what so what evidence do they advance if there was a global ...\nSo most of the evidence really does come from archaeological sources and so in some ways the debates around this and there are many debates that I won't even get into here really boils down to how did the physical sciences and the social sciences talk to each other about data\nAnd so what we see our ... there's evidence in the written record\nThat cities were abandoned in the middle east uh and in North Africa during this time we have evidence for a lot of political instability in a lot of these places and so geologist look at that and they combine that with evidence from the the sort of um [noise] from\nEarth science records and they say look this was obviously a civilization changing event\nAnd there are still some serious bucks leaped to raise twenty seven thousand dollars and we want your help helping to raise that money you are essential to the health of New Hampshire public radio I'm Todd ... here with more is Annie Ropeik\nSo when you contribute will be entered to win this final give away the drive that's that once in a lifetime trip for two to Australia New Zealand your last chance to get it on this is ends at seven o'clock today that's when the drive and said just under five hours left\nAnd we have twenty seven thousand dollars to go toward getting you that trip to Australia and New Zealand you can choose who your favorite one whichever one you've ever wanted to go to\nIt includes round trip airfare from Boston combination for eight nights\nThere is so much time to do so much cool stuff in these cool places wherever you want to go is where we want to take you and we hope that you'll consider supporting in each PR as a way to get there so it's easy to give it an H. P. R. dot org or you can call us at eight eight eight eight oh five six four seven seven\nIt's hard to believe that you can run a radio station on the honor system but it is true listeners decide to financially support New Hampshire public radio because\nThey know it can't work any other way to keep the service is strong and independent it must be powered by the very public that it serves view or the public in New Hampshire Public radio so take some action right now support this radio station by calling one triple eight\nEight zero five six four seven seven or make your gift on line at N. H. P. R. dot org\nAnd if you've never given before now is a great time to do it not just because you could win that trip to Australia New Zealand but\nBecause you're standing up and being counted as a new member in our growing public radio community we want new members in this drive people with personal reasons for listening for caring about this community with individual commitments to support an independent meaningful local broadcasting\nYou can give ten or Fifteen dollars a month that makes a huge difference for the future of H. P. R. and it's easy to do it in each pure dark\nYeah and when you give it the ten dollars a month level ah\nWe've got a terrific thank you gift for you you can choose to New Hampshire the heart phones keyed in each PR hurt tunes me as a thank you if you want me to explain why it's called the hearts honestly ... so\nIt's got a heart on the T shirt and heart is wearing headphones and it says New Hampshire public radio the heart phones tea it's great it's very soft you could sleep in his T shirt it's words ... ten dollars a month\nYour ten dollars added up with everybody else is ten dollars that's going to help us hit this goal for this drive one eight eight eight eight zero five six four seven seven or make your gift on line right now at an H. P. R. dot org\nWe've been talking a lot about our thank you gifts maybe you can't decide which one you want you want the T shirt you want to go to Australia don't we all if you log on to an H. P. R. dot org you can see all of the thank you gifts and make your choice as you make a donation there are complete descriptions\nPhotos of everything that is on the table and you can click enjoying are growing community of public radio listeners all at an age pure dot org only five hours left baby basically four and a half hours at this point to make your contribution to go to an H. P. R. dot org now and thank you [noise]\nSuzanne HP arts to twenty three support for an age ... from you our listeners bedroom careers leather furniture featuring American leather comfort sweepers with solid platforms for even support\nNo bars no springs and no sagging with use\nCareers leather dot com and from Raymond more opera beginning of twenty third season with an opera cabaret production of electricity that Carmen ... country club October sixth and seventh raven more dot com\nAnd from bluebird self storage a New Hampshire owned and operated business offering through climate control pick up for new customers and personalized service details are bluebird storage dot com Mm\nThis is an age PR my reply\nWith Dr Francis Arnold recipient of the twenty the Nobel Prize in chemistry um [noise] ... you know a lot of people think you're a scientist but you were very proud of engineer are you not\nI Am tell us what the differences well\nI Love to build things I'd like to make new things that didn't exist before of course chemists do that as well they build new molecules so we're we're blending together chemistry and engineering in evolution of new proteins\nHow do you build that I was watching a to a Ted Talk you gave it was quite fascinating and you talked about being able to sit down at a keyboard and type out a recipe for some form of new genetic smell it out and and what a new gene comes back to you\n[laughter] yes it's really amazing has changed so much and the thirty years that I've been doing this\nSo that today you really can't type out a DNA sequence now whether it's a recipe is a different story and we can talk about that but you can type out a DNA sequence email it off to your favorite supplier of DNA and they will send you back in the mail that DNA\nYou you say in a talk that I I Want to write new DNA what what does that mean to you [noise]\nActually it's easy to write and you know DNA what's hard is composing it you'd think about it DNA is the code of life it's the product of almost four billion years of evolution\nWe don't know how to compose new DNA we can ride it we can read it we can edited but we don't know how to compose it how do you compose something codes of of a complex biological function that didn't exist before [noise]\nSo if you if you ... what is the problem in the composition why can't you compose [noise]\nBecause we don't understand how DNA encodes function\nRemember biology molecular biology is a brand new discipline it's been around the the structure of DNA was published in Nineteen fifty three so it's not been understood for but for a very short time\nAnd how DNA goes through all the complicated things of his cell and makes biological molecules in codes to ... the the the structure and function to these biological molecules\nIs a brand new field and we still don't understand those rules\nAre so what do you mean then and what what do people mean andme ... whom when you say\nUh the directed evolution of something what does that process me\nIt's just like breathing it's we've been breeding cats dogs race horses lab rats corn for thousands of years without really manipulating the DNA directly but now that we can\nSynthesize DNA and put it in a test tube I can go direct the DNA and\nCombined DNA from different sources different species I can dial in levels of random mutations that can direct negotiations\nSo I have control over the underlying DNA diversity and then I decide who goes on to parent the next generation\nAnd then how do you get a useful product that I'm that what's the next step [noise]\nYou put the DNA into a microbe and they start reading it as if it were their own\nAnd a day and they then take the DNA and create the proteins that the DNA encodes than I as the breeder of molecules so to speak I have to decide who is better than what I started with which one of those microbes makes a bitter protein\nAnalytical chemistry [laughter] so are you and take the DNA out of that and feed it back and I do it all over again it's\nSort of creating life in that cell is a new you're creating a new form of life or you're not [noise]\nWell I I think that's probably exaggerating because life was there for me to work with were using the tools of biology to make new things I'm making new proteins they're not alive but they do do some things inside of cells\nBut you do you need the cell to help you make the ... [noise]\nWell actually so [noise] you don't have to have the cell there is now very powerful systems where you can do everything from DNA to protein inside of a test tube with no cells at all\n... and so uh where do you bring truly see this research going what is what is your ultimate goal here\nI run my ultimate goal is to allow human beings to use the power of biology the power of biology to do chemistry to make molecules to make materials to make\nTherapeutic agents and an end pharmaceuticals and and basically all the things when we need in our daily lives from renewable resources without producing excess waste\n... I saw on you talked to said I have fun for us we molecules to have sex with Oh yes I Do I'm at [laughter]\nWell if you think about sex you have to wonder why nature would devise such a a a strange process and have all these half the population that doesn't carry the next generation\nSo there has to be some benefit to re combining your DNA with somebody else's and that benefit is the innovation that comes around if you we combined DNA you get progeny\nUh the good and the great reporting we have a comment from Sean in Dover I think this might be Mr Kelly from oyster river high school who\nSaid this is a great example for his journalism students who I teach at a workshop recently said thank you Sean for your support\nAnd for letting us teach your kids and uh we appreciate you listening and we hope that services that will help you want to give to engage PR and if that doesn't do it maybe the thinking gifts we'll see you can do it at an H. P. R. dot org or by calling eight eight eight oh five six four seven seven and the best\nWay you can support New Hampshire public radio is becoming a monthly gave her can you support your favorite public radio station with the contribution of just maybe five dollars or ten dollars this month if the answer is yes well what about next month in the month after that if it yes if you can chip in five or ten bucks or maybe twenty bucks each month you\nShould be a sustained that's how it works and it helps New Hampshire public radio a whole lot and H. P. R. dot org or one eight eight eight eight zero five six four seven seven\nYou know a lot of people think that public radio stations like an HP are just run on federal tax dollars and it's just not true you know federal funding accounts for just a small percentage of our income\nAnd its sources like businesses and dependable funding mostly from listener contributions people like you that keeps us going so that's why we need you to contribute now and it's easy to do just go on line and H. P. R. dot org and tanks\nAnd\nThis was an age ... to forty one support for an edge PR come from you our listeners metro Dana Farber Cancer Institute bringing Dana Farber expertise are closer to you Dana Farber dot org slash locations in from Rochester opera house presenting Engelberg ... the man I Want to be tore\nFriday November second at eight PM more at Rochester opera house dot com and from ... New Hampshire zone orchard siders made with bittersweet apples served with food or on his own sold in stores in New Hampshire liquor outlets state wide\nSunny today my eyes and the lower sixty is going to be mostly clear tonight Lewis around the thirties and listening to an HP are\n\nThis is science friday I'm Ira Flatow in a time of contentious dues indivisible political races Ken we have better conversations about the issues that get us most emotional talking about how a better understanding of logic\nLogic can help us talk and listen and may be starting to bridge some of those divides or at least understand why we're disagreeing so passionately\nOur guest is Dr Eugene Chang mathematician a scientist in residence at the school of the art Institute of Chicago her newest book is the art of logic in India logical world and we want to hear from you as anyone's logic ever change your mind about something\nSome some listeners are phoning in and first one Alex's from Chicago hey neighbor\nThey're either go ahead so odd\n... previously I find myself as a an aspiring feminist um and I done so because my logic was that I really couldn't fully empathize with some of the issues that women face\nI'm at the mail um and I was met with that logic from a coworker of mine who had said you know\nAs a black male you know you might be doing things that contribute to um\nKnowingly knowingly but that doesn't necessarily make you no longer and African American male and the same way um women or being a man who contributes suicide your systems knowingly\nWasn't necessarily make me I'm unable to identify as feminists um it would just mean that I have to do more to aspire to um to contribute to feminine system though I'm being able to see the fact that you can still be a male male experiences while existing feminist\nUm and identify myself in such a way really changed my mind\nUm and I thought about that that's great thanks for calling that is great that very heartening\nIs you know as part of the problem that we don't see how we others see us\nI think that is part of the problem but I think a big problem is\nThat we often spend two long trying to defend our own points of view instead of trying to understand somebody else's points of view and we often focus on trying to change someone else's mind instead of trying to see that point of view and see what it's believed if he is and one thing I found very interesting in that the cool has experience is that\nIt was a great example of using some abstract structure to tap into the person's own experiences\nSo in a way I think the logic was used very cleverly using emotions as well to say let's find an analogous situation that this person will understand from their own experiences and then hope that they can translate that to somebody else's analogous experience\nI have a tweet from James who says to me logical discussions don't require man he requires empathy empathy is caring enough to respect them in their view and listen to it is that emotional I don't know\nI agree I think that logic does not require mask that logic is in a way pauses math\nThese things have poor as boundaries I mean we've construct to the loss of artificial boundaries between subjects the bureaucratic purposes\nBut I Am a mathematician and from my point of view because I Am so deeply steeped in the discipline of mathematics I find that the full discipline of mathematics helps me with logic in the real world I'm not saying that you have to be a mathematician\nIn order to use logic and that's a good thing because I think everybody can use logic whether they're a mathematician or not\nWe'll talk about some from the current events or let's turn now to the oddest topic and current events and that is voters in Congress are divided over whether to believe\nAccusations of sexual assault ticket and it's a judge Brett Kavanaugh and whether this should affect his confirmation to the Supreme Court and you write than in terms of how people respond to stories about sexual assault\nThere are a number of different logical process has had plagues tell me what you mean by that\nWell that's a whole other our whole lot of different parts of this argument that we can analyze starting with what we mentioned before about Rome definitions because all of the people claim to the principle of the presumption of innocence\nAnd the thing about the presumption of innocence I think is that it's technically for court cases and criminal trials\nAnd it's something that gets bandied around as a general principle but it's really a very specific principal and similarly the idea of freedom of speech is often bandied around as a general principle when in fact that's just about whether you can be in prison for saying certain things\nSo going on from the presumption of innocence\nThere is a paradox because some people say well we have to ... ... someone innocence until that until that proved guilty\nAnd the thing is that if you have an accuser\nAnd an accused personnel let's just say the accuser is a woman and the accused person is a man then was about the fact that we should also performed a woman to be innocent until she has proved guilty of a false accusation and so then we have a ... because we can't actually hold the man on the woman both innocent at the same time\nSupport for an HBO ... comes from you our members on from Dartmouth Hitchcock imagine nationally ranked ... in your community was convenient location throughout northern New England world class providers are closer than you think\nThere is a Dartmouth Hitchcock dot org to learn more starting with Hitchcock is here\nAnd go what do we think of this world and so we can look at the world that we've created by presuming accused people to the innocence until proven guilty and I think what we should see is that we've created a world in which people know that they can get away with sexual assault because there is almost never actual evidence that can prove that it happened\nAnd if they know that they can get away with it that means that they will do it more and so we've ended up in a culture where\nSexual assault can it can happen does happen on happens all over the place because people know that they can get away with it so then the question is do we care about that\nAnd that becomes a question of false positives and false negatives so do we kept\nThat so many people are getting away with sexual assault all we more afraid of what some people are worried about which is that that will be false accusations and innocent men will be have their lives destroyed by a false accusation so having a false accusation\nUm would be when somebody is innocent but is thoughts is accused of being guilty and the other way is when somebody is guilty but ... didn't prove to be guilty and so it left off\nAnd that's really about whether your prioritizing the plight of victims of sexual assault or the the potential innocence of men and we have to have a discussion about that and about the fact that we have somehow prioritizing the the men who might be accused\nWere prioritizing them over the thousands and millions of women who are suffering sexual assault over time and so the question is are we going to do anything about that\nSo the next problem is a a question of black and white thinking\nAnd this happens a lot wet people get into arguments in extremes on so many of our arguments at the moment ton divisive because we take extreme opposite positions instead of something more moderate in between I'm so there is a an argument's around saying something like um you\nAre making everyone into a rapist or what one that professor long but said on his book that that we are ... just spin the bottle crimes as rape", "year": "2018", "show_name": "Science Friday", "city": "Keene", "day": "05"}