{"month": "10", "state": "NH", "station": "WEVN", "content": "W. E. V. S. miniature ... point three W. E. V. H. Hanover Ninety One point three Wu VN keen Ninety point seven\nWABC gone one o seven point one deadly\nEJ Jackson Ninety nine point five W. E. Z. asshole Burke Ninety point three and W. E. B. Q. Littleton Ninety One point nine and online at an H. P. R. dot O. R. G.\n[noise] in the U.S a third of all babies are born via very instruction what's causing this high rate am Ira Flatow and this is science friday [noise]\nCan read should be around Fifteen Percent\nBut the procedures are happening much more often this hour we'll look at a worldwide increase in C sections\nWhat are the decisions from patients to position as a hospital leading to fewer natural childbirth and what do we know about the effects on the health of the baby and the mom plus the oil industry ready to take action on climate change\nExxon Mobil says it's throwing money behind the U.S carbon tax but there is a catch details coming up after the break stay with us [noise]\n\nLive from NPR News in Washington I'm Lakshmi Singh\nBy the thousands Hondurans Salvadorans Guatemalans fleeing poverty and violence or taking a huge gamble and pushing their way north to the United states\nThey could be turned away by the troops that President Trump threatened to deploy to the southern us border but first they have to get into Mexico reporter James Frederick is tracking the caravans attempts to continue their journey as they faced security barriers lined by law enforcement in Guatemala\nOn here on the water most side of the bridge to come next in Mexico and water mall a few moments ago the caravan of migrants wrote a line of Guatemala and they are now [noise] [noise]\nRight up against the same Guatemala close with them from getting on the grid [noise] it would take them to Mexico or southbound Margaret outside when\nYou're in the front of me and military waiting [noise]\nThat's James Frederick reporting in Turkey prosecutors are questioning staff at the Saudi conflict in Istanbul where dissident Saudi journalist was last seen alive earlier this month\nInvestigators suspect Jamal 'cause she'll Jay was tortured killed and dismembered by Saudi hit men loyal to crown prince Mohammed bin Salman the Saudi royal family denies involvement Saudi officials are also taking part in the probe ... has lived in the United states and has been a columnist for the Washington Post\nMore hurricane related fake tell if he's a reported in Florida raising the death toll in several southern states to at least thirty five\nFlorida governor Rick Scott is asking President Trump to bolster recovery efforts at ten dull air force base NPR's Hansi Lo Wang reports hurricane Michael wrecked airplane hangers and flooded buildings\nFor than twenty thousand Florida residents worked at ... air force base last year according to the state's governor Rick Scott\nThe base is a major economic driver in the region and it was home to multibillion dollar effort to stealth fighter jets some were damaged by the storm in his letter to President Trump Florida's governor as the president to quote direct immediate action to dedicate the needed resources manpower and funding to return to indoor air force base to full operations as soon as possible\nDemocratic Senator Bill Nelson has been playing down fears that tend to will not be rebuilt after Hurricane Andrew destroyed south Florida's homestead air force base in Nineteen Ninety to that base was shut down under ... NPR News the County Florida\nAfghanistan's postponing the Saturdays elections in Kandahar Province for a week following a deadly ambush that killed two top Afghan officials including Kandahar as police chief\nAnd election commission says it wants to allow mourners to observe funeral writes for the victims Afghan guards opened fire on a security gathering three Americans were injured in the attack\nYou're listening to NPR nice\nIs an HP our news is too old for ... afternoon one of the state's largest unions will hold of the annual convention tomorrow has an HBO ... book reports it comes as a group is engaged in a lawsuit\nHas filed a lawsuit against one of its own the union which represents approximately ten thousand public sector employees is calling for past president Diana Lacey to stop posting information that it considers confidential\nLacey's posts focus on a long running dispute between the union and the state liquor commission over the agency's handling of alleged liking she says she hasn't disclosed anything not already in the public domain\nThe lawsuit could create a slightly awkward scene at the convention Lacey says she plans to bring forward motions that relate to how current union president rich cola has handled the liquor commission dispute\nFor H. P. R. News I'm Todd book in\nA superior court judge heard arguments yesterday in a case involving the public disclosure of a secret list of police officers with potential credibility issues\nThe ACLU of New Hampshire and a group of media organizations say the so called Laurie list should be made public onto the state's right to know laws the list contains the names of police officers who may have a disciplinary issues that calling question the credibility is witnesses\nThe attorney general's office says the list is a personal matter and that under state law it isn't allowed to disclose it here solicitor general Dan will\nThe legislature has made clear that information from police personnel files remains confidential except for very limited circumstances and this is one of the judges\nAllowing both sides to submit more written evidence it's gonna be clouding up tonight will of low temperatures in the lower forties for tomorrow and partly to mostly sunny high temperatures upper fifties to lower sixties and this is an HP our\nSupport for NPR comes from NPR stations other contributors include a log me in makers have go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more at goats who meeting dot com and that listeners who support this NPR station\nSupport for an HBO ... comes from you our listeners him from northern stage presenting Oslo and dear Elizabeth now through the October twenty eighth and why ... junction more information that northern stage dot org and from those bay lumber company of charges through find hard to bow lumber marine plywood in West system for boats canoes kayaks with surfboards\nNewspaper lumber dot net\nIt is two oh six and this is an HP our news\nThis is science friday I'm Ira Flatow a bit later in the hour we're going to talk about the worldwide increase in C sections and if you have a story you'd like to share with us about\nYour a C section or your partner C section while you had it had to go I was in like please share with us give us a call late for for seven to for eight to five five or you can tweet us at science fry phone eight for for seven to for eight to five five or tweet at science friday\nBut first last week's report from the Intergovernmental Panel on climate change\nGave us a sobering look at what world worn by two degrees Celsius might look like then on the heels of that report Exxon Mobil announced that it was throwing financial support behind the U.S carbon tax it's a big step for one of the world's largest oil companies\nWhich last year was sued by its own employees for misleading statements about the environmental and financial impact of fossil fuels\nAnd has a history of denying the climate science settled here with the story as well as other short subjects in science is ... or ... staff writer for vox ... welcome back to science friday\nThanks for having me again so Exxon says it's going to back us carbon tax on a service that sounds like a good thing but what exactly are they proposing\nThey're proposing to back a lobbying\nEffort launched by conservative former secretaries of state George Schultz and James Baker this is a group called the climate leadership council\nDollars per ton price on carbon dioxide emissions and that price would rise over time then they would use that money to go back to people like you and me a centrally in the form of a dividend or rebate and the estimate is that what started about two thousand dollars a year for a family of four\nThere is a catch though and Exxon wants ... rolled back some other environmental regulations and one big catches that they want immunity from climate change related lawsuit that want damages for these companies\nIt's the same deal that the the gun producers have [noise]\nYeah pretty much it's kind of analogous to what they got and it's what I'm other industries have also tried to get\n... or ... has a complicated relationship with climate change it it's been ahead of the industry in acknowledging it's a problem\nThey've had researchers who helped author the PCC report and yet they are also being sued for misleading people about the impact of fossil fuels years ago and in two thousand they took out ads in newspapers\nSaying that the science was not settled I mean should we be taking this seriously or is it just another you know ... ... make us look good sort of thing\nThat's always the question isn't it I mean the thing to remember what Exxon is that they are an investor owned company so they do have to answer to their shareholders and they've been getting a lot of pressure in shareholder meetings to better address climate change also climate change poses a business rest for them um in terms of their facilities and\nIf they aren't out ahead on this they might get slapped with a carbon policy that they don't like that doesn't actually work in their favor and another way a carbon tax might actually benefit them is that it would target the dirtier fuels first things like coal which would clear some space for one of axons other products natural gas\nAn organization that rich your life and that of others in your community to learn more about including an HP are in your state plans to go to an H. P. R. dot gets plans dot org\nThis is science friday I'm Ira Flatow for anyone having a baby the decision to have a C section is not unusual but what is unusual is the number of C sections happening all over the world listen to this worldwide rate has nearly doubled from twelve to Twenty one percent\nIn the past Fifteen Years and in the United states one out of three per se is by C section now\nA series of studies in the journal the Lancet looked at this trend to see what is behind is uptick what are the effects on mothers in babies and what into vengeance can be done to decrease that number and that's what we're going to be talking about C section rapes globally\nAlso what's happening here in the U.S and my question for your listeners is the you or your partner to get a C. section\nWhat factored into that decision what was your experience like you can phone it in or you can tweet us our phone number a four four seven to for eight to five five\nYou can tweet us ... fry let me introduce my guest Holly Kennedy is an author author on that a Lancet Siri she's also professor of midwife midwifery at the Yale School of nursing\nThank you for joining us today alec enemy\nThank you tell us the Lancet series looked at a hundred and sixty nine countries in overall there is a rising C section rate can you give us some of the numbers of different regions of must have buried around the world [noise]\nWell it does and um what we found was that over sixty percent of countries over UC sections and twenty five percent under use the the procedure\nSo there's a quite a disparity and there are multiple reasons I'm part of it has to do with um\nThe um sort of socio cultural acceptance of surgery is enormous his um thing to do part of it has to do with um insurance and um access\nAnd a and a large part of it has to do with on women not being able to get a ... birth after they've had their first this area and so it's it's it's it's complicated we've seen the rise I'm In a particularly in North America Western Europe Latin America and the Caribbean\nFor example in Latin America it's gone from thirty two percent to forty four percent\nAnd um it it there's a bit of a paradox when what we would call 'em\nToo much too soon and too little too late so in the countries that overuse says area and they are probably intervening too much\nIn low risk women that really don't need the procedure and in countries such as in Africa that um don't have enough to access probably are under using at the world Health Organization suggests that Fifteen Percent is about right and it's All right so when you you think about one in three women in the United states having um\nHas this area and we're way over\nLast talking about over by us visits to stick for example in Brazil Ninety percent of the women that go into a private hospital getting C sections are they are they requesting that before they go in what is the mechanism what happens there\nWell I Can't speak specifically to ... you know the the interaction but but you write women who are wealthier ... who had insurance are much more likely the majority of them will have a C. section and it's and it's and accepted norm is part of the culture in in Brazil\nAre there are big differences within countries in China the rate ranges from what four percent sixty two percent depending on the ... [noise]\nExactly and again\nSupport for an HBO ... love shrimp comes from you our listeners and from castle in the clouds and borrow\nToward the Nineteen fourteen arts and craft a mansion elegantly dressed for the holidays by local businesses and designers enjoy activities for all ages including an artist and fair craft making and a visit from Santa more capital in the clouds dot org\nSurgery and and things are there are small but serious risks are both with the immediate surgery and then later in terms of the score and\nStill birth and preterm birth leader and with um subsequent pregnancies and it's one small part of the piece of ... of the puzzle in the United states were increasing maternal mortality rate\n... you mentioned that in some places there's too much in some places not enough what are those not enough places like and why\nThe not enough places are places that don't have access in particularly in Africa and and countries that have lower resources so they just don't have the facilities to to do is his area and sometimes when women really needs it and I think it's important to to stay in the ... there are women\nWho and babies at that it is a life saving procedure but it it's not one that should be done for the majority of women\nWant to focus on a little bit about what's happening here in the U.S and why she sections are increasing your Tony Golan it'd be vice chair of quality and the department of obstetrics and gynecology at the Beth Israel Deaconess Medical center in Boston Welcome to science friday Dr ...\nThank you for having oh let's let's talk about this um [noise]\nBut there's also this idea of of planned C sections right the do the do you have to approach this do you have ... have you seen this in your experience\nIt's quite interesting I think there's a natural suspicion that this is a major contributor to the C section epidemic in the ... in the United states at this point and well it's true that a family's women can request to have a delivery of biases area and\nIt turns out that that's not really the most significant driver on in our experience at Beth Israel Deaconess for example which is\nA tertiary care institution academic hospital I'm In the middle of Boston I it really only contributes to about one percent of our deliveries per year\nSo while some of this could be attributed to patient opinions are patient desires or their perceptions of what safer um the truth is that I think that we as healthcare providers need to um\nRealize that we are probably the major major contributors to the rise and sit there and delivery right here in the U.S\nWhen you say health care providers you're talking about the doctors who actually are performing and [noise]\nUh so certainly the doctors the obstetricians um they're the ones who make a recommendation versus area and I'm at the end of the day on that who's responsible\nUm it's a complex environment to practice obstetrics so there are other things that put pressure possibly on obstetricians um we had incomplete somewhat inaccurate data about health and fetuses during labor that might contribute to our decision making\nOn the progress during labor in terms of the cervical dial a nation I is subjective so that can contribute to some inaccuracy\nThere's other things that happened on our unit that might put pressure on us other emergencies that might be happening on a labor and deliver a unit that might put some pressure on us to make quicker decisions to move toward delivery\nBut at but at the end it's really our decision on as obstetricians to make that recommendation and generally speaking when we make a recommendation like that um patients and families do say yes um and they asked questions but they generally do\nOh I Would completely agree with her that the culture of the unit where a woman who's giving birth is very instrumental um there's a number of strategies we can do to promote of a first time mother having ... and but you have to have the staffing you have to have the\nCommitment to do the kind of care that's going to ... uh in her physiology two two best achieving ... birth\nLet's go to the phones let's go to northern Kentucky Lauren welcome to science friday\nIra thank you You're welcome good\nThough I actually had an emergency C section at thirty one leave 'em and I think for that for that um but when I got pregnant for a second time\nI really wasn't given the option of that bird after that then I kind of had to do all of that um that I said I Do I look at what they had to look at rates what were the\nVery end mighty you've written in the ... and um it really it was a it was like my provider\nThat you want to have the time I was like oh\nI like that but I was that that risk and benefits that it will make at truly at it that says that um and so I think that I was able to\nActually win that Senate rain heat and then I change my mind at thirty six and I\nReally ... them with that and I was able to see that but I like a lot of them are nice and given to me by my provider I really had okay in a lot of waste and what's very emotional and it was really hard to find the facts\nBe partly to mostly sunny on Sunday nor the New Hampshire has a chance of some early mornings no showers temperatures Sunday\nAnd the low to mid forties and Monday mostly sunny high temperatures low to mid forties this is an age PR\nThis is science friday I'm Ira Flatow we've been talking this hour about the increasing the number of C sections and what that means for women's health\nMy guests are Dr Holly Kennedy professor of mid were free of the Yale School of nursing or Tony goal and vice chair of quality in a department of of obstetrics and gynecology at the famous ... Israel Deaconess Medical center\nIn Boston and though lots lots of folks on on the line and let's see we only uh gosh can't get everybody let me ask you how you you worked in research midwifery in the u._k. how does the approach here compared to what we do here in the U.S [noise]\nWell it it it differs in several ways and actually when the land the slanted series on C. section came out that W World Health organization also issued new guidelines to help\nHelp us look at decreasing says Erin's and and one of the things that they have recommended is what the UK does which is to have a collaborative midwife obstetrician model of care where the midwife\nDoes most of the primary care and that's what happens in the u._k. all women have midwife and some women had an obstetrician too when it's when it's really needed\nIn the Lancet also published a series on midway free very extensive review of the evidence and they found that midwifery was associated with improved outcomes increase the including decreasing C sections\nAnd so one what I'd like to just mention is in the United states\nThat study came out this earlier this year that mapped\nThe integration of midway free across each state to see how ... how friendly the state was in a regulation um and reimbursement independent practice to midwifery practice and so if you look at the at New Mexico which has the lowest sea section rate of of just about Eighteen percent\nTwenty six percent adverse are attended by mid was in that state\nConversely with New Jersey has the highest rate of thirty three percent and only seven percent adverse are attended by midwives and then they met that with outcomes and uh if you look at Alabama Alabama has some of the worst in the tournament and then out comes in the country and only one percent of births are attended by midwives\nSo that's not a causation it is an association type steady\nBut it is paused for thought and that is what we saw in the u._k. is that um when you have a model of care when when women have access to continuity of care with their mid why the midwife knows then they feel respected um you have better outcomes\nUh Tony go and you work to drive down the rate down at your hospital dealing after a decade went from forty to twenty nine percent in a in a decade what did you do there\n[noise] well first we recognize that we had a problem and I think that's step one and trying to solve it and then we looked toward the evidence I'm not just our own evidence but the national evidence about what was contributing\nTo mostly and ... mostly in terms of the indications forces areas and focus very narrowly on primary says air and\nHow we monitor fetuses um while women are in labor that kind of monitoring called fetal heartbeat monitoring is very tricky it's quite inaccurate and it predicts quite well for us when babies are well but does not do a good job of telling us when babies are on well\nAnd nonetheless obstetricians base decisions on this test um I often say that and no other area in medicine would we make surgical decisions based on such a on such a faulty test\nNonetheless it's ubiquitous and people use feel heart rate monitoring so we focused on really trying to focus on describing the fetal heart rate chasing using science and objective criteria rather than subjective words um we focused on our documentation our communication\nWe also really tried to make sure that people were using scientific modern definitions for progress in labor a old definitions were assumes that women would move much faster and labor than nowhere more modern data really proved to us\nWe want it to make sure that people use modern definitions for what we thought was normal labor\nAs I mentioned earlier we focused on improving access on and uh and I'm enthusiasm for be back and then also some other operations issues for our unit to change the culture of our unit\nFrom his book you were a bit of Israel and I said you if you were always from so phone down here in Boston and so there's this all mean to the to the hospital you go to determines more or less what you'll have a C section or not\nUnfortunately it does a\nAnd so uh one of the reasons why we know that we have room to improve on scissor and delivery rates is that if you look from one hospital to the next event separated by one or two miles from one another who take care of patients who have similar medical problems are of similar demographics\nThere's is there and delivery rates may vary by as much as ... percent\nThis is unexplainable by any other reason other than the environment the unit that you work in the people that you work with and the general enthusiasm for ... birth\nOr wherever tweeter the thrill of it to this and services I have to wonder how much of the increase has to do with how much money insurance companies make on them versus a typical delivery did did you study that in your your your report Holly\nWill uh ... not specifically except that it is the recommendation is that the financial strategies women who are having more money or were wealthier we'll have more C sections so which implies that\nUm they can get you know reimbursed for that and one of the recommendations that the series made was to not pay more for this area and to really\nUm level the playing field in in any in addition to liability reform um many in studies that I've conducted obstetricians have said to me you know I won't get sued if I Do a C. section but all I can get sued if I don't do one in in time or is perceived to be in time\nYour your ... issue\nOf reimbursement as is interesting here in the U.S a where by and large physicians are obstetricians do not get a a vastly different amount of money for ... delivery than necessary and delivery however the hospital does\nAnd that is something that I think isn't quite transparent for patients I'm and probably reimbursement itself\nDoesn't influence a lot of obstetrician decision making here and the U.S a three embarrassment is greater but it really goes more toward the hospitals side because of the length of stay\nHigh um I've had two C sections and um they were mandated by the doctor due to complications from Crohn's disease and so I I really appreciate this nuance discussion but I just wanted to get a perspective of how this is actually playing out I'm\nAmong laypeople and patience and um I think a lot of the talk about this has become very anti woman um when I tell people that I was having a plan C section\nDue to my chronic illness complications I had male friends saying things like well are you sure you don't want to just labor for a little bit maybe you could just ask if he could labor for a little bit and I really interpret it that\nKind of as questioning you know can I be a woman if I don't\nYou know push the baby out ... and and that was really upsetting to me because my two beautiful daughters wouldn't be here the C sections were not available to me\nAnd I you know I think um I just think it's really important for those at the academic and and provider levels to understand that that people are hearing these discussions and I think taking them and sort of inappropriate um in different directions slides I'd love to hear the response\nOr I got about a minute a tone of your own\nWhich I Would I Would completely agree with you that one of the most important things in this in this conversation is for the provider and the woman to talk through what is important to her and and so that she can make an informed decision about the best strategy for her so it it is\nI Would completely agree that it's important that you have that conversation and and the risks and benefits of both ... since the Syrian or fully fully discuss\nThem and told me what about this ... who's charge of sexism here\nI point well taken I think you know any extreme is going to be dangerous I think it is important to realize that regardless of how baby is born on the person who gives birth to the baby becomes apparent uh after that happens\nOn it's no less are no more ... regardless of what the motive delivery ... delivery I'm certainly makes you just as much as the mother on as having a vegetable delivery\nGreat way to him home we Kennedy professor ... Yale School of nursing Tony ... vice chair of quality in the department of his obstetrics and gynecology a Beth Israel Deaconess Medical center in Boston thank you both protecting thank you and today You're welcome", "show_name": "Science Friday", "year": "2018", "city": "Keene", "day": "19"}