{"month": "10", "state": "MA", "station": "WNNZ", "content": "We have so much fun last year with doing it again New England public radio second and you'll just be be Nineteen twenties holiday party Saturday December first to the hotel north up when you're glad rigs zone or get your ticket today at NPR done\n... new novel about science by the end of the inability very frightening that tomorrow problem while being bombed by yesterday people can only be dead dancing to the song by tomorrow and\nI'm Steve her when Barbara Kingsolver novel on sheltered next title I'm living on her from here I\nWas in Sunday evenings and things for a living on earth\nFor the latest in the arts stay tuned for a studio three sixty listening to NPR News network WINZ am six forty Westfield WINZ FM Ninety One seven Deerfield WFCR eighty eight five HD three Amherst\nW and then you eighty nine five great Barrington WN a nine Ninety nine atoms W. A. C. Ninety One non Springfield and W. A. M. H. eighty nine three immersed\nIn partnership with Amherst College and UMass Amherst streaming at any P. R. dot net it's four o'clock\nToday in Studio three sixty\nSpeculative fiction\nThe term that now in Columbus was fantasy and science fiction and all the adjacent to [noise]\nI have never written science fiction by writers like Harlem Alison for instance like calling Agatha Christie railroad writer because she wrote murder on the coach\nPlus mine's ... harms that everything that you've suspected is true which is that\nYour friends or family and everyone in the community\nIs a monster who wants to win the superb speculative fiction writer ... Whitehead tried his hand at full on horror\nThat's all part of the students were sixty hour about various kinds of non realism right after the\n\nLive from NPR News in Washington I'm Barbara Klein\nPresident Trump called Saudi Arabia's account of what happened to journalists Jamal ... G credible\nFor the first time Riyadh admits ... G is dead saying he died in a fist fight with Saudi suspect at its consulate in Istanbul NPR's Deborah Amos tells us the kingdom blame senior advisors for a policy gone wrong\nThe Saudis now admit that there's a standing order to bring dissidents back to the kingdom by force if necessary but the account lays the blame on the senior security officials who went beyond the order they killed this dissident journalist they\nCovered up the murder Turkish officials continue to search for ... g's body [noise] Afghanistan is holding its first parliamentary elections in eight years and ... the report several people were killed today in a suicide bombing targeting voters supplement\nStruck at school that was used as a polling station it was kept open to accommodate voters who hadn't been able to copy that ballots only because electoral stuff hadn't turned up in the morning fearing attacks\nBut as I did turn up in defiance of the Taliban and ISIS he struck campaign rallies in the lead up to these elections militants also try to attend voting and Scott and deadly attacks around the country\nThere was also confusion about how to use the new biometric systems and some days didn't have ballots because of the kind of surrounding the elections funding will now be extended to Sunday in some areas they had Dade NPR News Islamabad\nNearly eighty thousand customers in the Florida Panhandle are still without power ten days after hurricane Michael struck from Panama City NPR's Debbie Elliott has an update\nRecovery is slow going because of the scope and intensity of the destruction crews are working to restore phone service electricity and water and sewer systems mark Bowe and his chief of emergency services for hard hit ... county\nWill get it back um they'll never be the way it was but you know we'll make it into the best community that we can and move forward that show that human beings can do\nPower says it has already replaced\nWe're so much fun last year with doing it again New England public radio second annual gyms be be Nineteen twenties holiday party Saturday December first to the hotel north helping your blood red zone or get your ticket today at NPR does\nYour news Panama City Florida\nHundreds of thousands of protesters marched through central London today demanding another referendum on Brexit organizers say since the original vote in twenty sixteen new facts about the cost and complexity of the u._k. separation from the e you have surfaced\nConservative MP Sarah Wallace and joined the demonstrators\nEveryone deserves a chance to change their minds when they looked at the end of it is\nToday is was the biggest demonstrations so far demanding a public vote on the terms of Brexit prime minister Theresa May has ruled out another public vote this is NPR\nThe universal postal union is mourning American consumers will pay a heavy price if the Trump Administration goes ahead with its threat to pull out of an international postal treaty\nAs such slime reports from Geneva Washington claims the treaty benefits China at the expense of American business interests\nThe Trump Administration wants to renegotiate the treaty saying it allows China to mail small packages to America at heavily discounted rate making it hard for American business to compete\nAs senior postal union official warns Americans won't be able to send international letters or international packages if Washington pulls out to be one hundred forty four year old treaty he\nSays the U.S won't be able to access special codes needed to send and receive mail internationally and this will affect UPS that ... and other companies who also would lose access to these codes for NPR News I'm Lisa shrine in Geneva\nPresident Trump is wrapping up three days of mid term elections stumping for GOP candidates in next month's elections\nWith a rally in El Paso Nevada today the president has been trying to motivate voter turnout using reports of a caravan of Honduran and Guatemalan migrants heading toward the U.S border\nThe procession has shrunk from an estimated three thousand people to about one thousand and most are now held up\nAt the Guatemala Mexico border I'm Barbara Klein NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the logging meat is Brewing Company robbed supporters of the tiny desk contest and working to help bans reach more ears through beers more at ... dot com and the corporation for public broadcasting\n\nSupport for a studio three sixty comes from battle European made to language learning program that teaches practical conversation in Spanish French German and other languages available in the app store or online at B. A. B. B. E. L. dot com [noise]\nAnd I'm sitting on the steps of believes in level ... I'd like to have the education\nThe editing and all of our timing I tried to get a little bit away from the actual object you wish\nYou the I was very good Anderson\n\nSays the science fiction and fantasy are two different things on\nThe line separating fictional genres can be Maria's rod Serling noted on the twilight zone in Nineteen sixty two\nScience fiction the probable my possible fantasy the impossible my problem [noise] what would you have if you put these two different things together [noise]\nWell what you have is speculative fiction it's an umbrella term that's kind of taken off during the last couple of decades lots of writers and readers prefer it to the older narrow word John ... definitions that encompasses not dressage fi and fantasy but magical realism horror\nCounterfactual history dystopian fiction anything not strictly\nStreaming of New England public radio is funded by un Franklin Community co-op offering organic produce baked goods groceries and prepared foods in Greenfield ... Schober and falls community grown and community on since Nineteen Seventy seven\nYear career publishing more than a Seventeen hundred short stories in his lifetime\nYou also wrote novels such as the post apocalyptic classic a boy in his dog he also wrote movies end worked on a lot of the TV shows I watched growing up such as the outer limits and the man from uncle he dreamed up the city on the edge of rubber which was\nThe star trek episode about time travel to Ninety three to New York that may be the best of the original series [noise]\n\n[noise]\nHarlan Ellison died a few months ago age eighty four\nI spoke to him back in two thousand eight when he was the subject of a new documentary called greens with a sharp teeth I gave him a long Folsom introduction and the N harlot talking to the studio three sixty\n[noise] Christian there and the actor who played the only completely likable character on game of Thrones\nBut what he really wants to do is play dance music [noise]\n... speaks that's next on studio three sixty\n\n[noise] maybe it can be ...\n... any PR news network is made possible by the corporation for public broadcasting and the vehicle donation program any PR listeners who donate their old cars to pay for what they listen to on the radio clean out your driveway and support the station go to any P. R. dot net\nMore than a week after one of the most destructive hurricane ever recorded hit the Florida Panhandle survivors are still looking for missing relatives\nThat enabled every band for then an act that must contact the share dominant and call and every hour\nWill also have the latest on the caravan of migrants from Central America that's next time on all things considered from NPR News\nMemphis evening at five o'clock\n\nThis is the in the eye network from it\nStreaming of New England public radio is funded by you had all the energy solar helping homes businesses and firms in western New England save money and the environment with solar power all energy solar dot com\n[noise] support for Judea three sixty comes from battle a language ... conversation in a new language like Spanish French and German battles ten to Fifteen minute lessons\nAre ... are on line at the apple B a B B. E. L. dot com three [noise]\n\nIn this hour has to do three sixty we are exploring facets of speculative fiction side fi fantasy whore\nAnything otherworldly [noise] fans of the novelist George R R Martin have been waiting seven years for the next presumably final installment of his fantasy series a song of ice and fire [noise]\nThat idea a multiply novel series never sat well with a consistently productive and considerably more concise Harlan Ellison\nIt only took dust I ask you one book to do crime and punishment why do these blow hards these ... which need six books to talk about dragons\nBlown eating or not Martin a series of novels and its TV adaptation game of Thrones is the most popular fantasy franchise this side of middle earth and Hogwarts\nOne of the most popular characters on game of Thrones was played by Christian near such a perfect name for an actor in a medieval fantasy it was a difficult part because he only spoke one word and had to use that one word or express everything panic anger confusion joy [noise]\nTwo thousand Fifteen our colleagues Sean runners from talked with him about playing maybe the oddest a big role in big time TV history\nI'm Christian and I'm an actor a DJ um\nBest known for my real probably give them from and who do you play a good player who'd or just want to hear me say that\nEven if you've never watched game of Thrones is a fair chance you've heard of ... where he stands out because he's really big he's really lovable and he only says one thing\n[noise] total total\nTotal of\nThe one dimension Allie of hold or makes him really malleable as a walking hardly talking mean and the Internet has a ton of fun with them even search engines get it on it when you ... or the official Google Search results just say hold or over and over like forty times\nHold or had no idea it said something if you Google did\nYeah desire but if it's it's bizarre that that's a really took to the fair\nI Googled the idiom takes me to the fair but my results were inconclusive hold her belongs to a special league of TV characters that have found life far beyond their TV worlds online it's him the sailor moon the entire cast\nThe office their gifts and super cuts in means for days dedicated to these people just imagine how much power you wield when you're one of the most beloved characters on the most pirated TV show in the history of the universe the Internet's favorite TV show questionnaire is well aware of his unique position and he's using it to promote\nHis other passions out or is really in the house [noise]\n\nChristian can't stop and when he stopped either one not to hold or if not the house even if everyone's constantly second guessing his true love\nI first started acting um people would people would treatment and that it's probably going to do this you're you're you're a DJ you know how you're going to act you don't know how much it's going to face guys the German some credit dramas I wanted to draw in college and I mean I I Know how to do this yeah so how'd the proof\nStreaming of New England public radio is funded by you and all the energy solar helping homes businesses and farms in western New England save money and the environment with solar power all energy solar dot com\nEvery DJ's how to tell you when you're an actor I don't I don't want to do this all over again continually proving I can do things right and not just a one trick pony [noise]\n[noise]\nUm about um I live in Belfast still\nOkay and where do you do most of the shooting for the show and ... is that how it happened you were there and you say oh no no I mean that's the audition for a movie called ...\nAnd then to the park so just kind of forgot above a maybe five or six years later I got this round them coal want me to do that one tip 'em apart at the cops and drive to just couldn't imagine anybody else or the park and what does he mean to you now that you've done it for four or\nFive or ... yeah you know I like the guy that was the other person I've talked to them to get to a Muslim is not my life\nSo like when the show ends you'll inevitably start to miss him well yeah of course I mean I met some last year when he missed the question is not smells what does it smell like death\nSmells of its size and corpses [laughter]\nIt look terribly uncomfortable as bad as it right for one is like can you describe it because that's an\nIncentive will which was horribly warm in the first is that a season three you'll see a slurring Robert [noise]\nBecome far [noise] can\nI\nSuffer from the ... [noise] I Know [laughter] we'll odds Seventy dead level as\nSoon as I was I'm almost ... at the end of his journey yeah I'm like you have to do this yourself a little guy yeah I kind of help anymore and that was my most of them from it was almost like the ... yeah yeah yeah\nUm if if the producers of the show with the writers of the show came up to you or George came up to and said look he you know we really want to know since you've been body this character so well what would you like to see happen in season six is is there something in the back of your head that you really love to to see happen trout are um I\nThink he deserves a holiday for some sort of treatment those by so if you could ask for something more practical is there something\nI just thought you liked it a little bit about why not have a little bit more of his past yeah why why he'd only says that when we're there just for death\nIs of always wanted to know\nThat questionnaire and talking with Sean ... I'm In two thousand Fifteen since that interview originally aired game of Thrones viewers did learn wide or only says that one word and one of the most memorable and new mobile moments the series\nGoogle thing does not work anymore\nAnd asked for our students we sixty alumnus Sean these days every day\nYou can hear him on today explains a lot of news cash that\n[noise]\nWhen I was growing up in the Nineteen eighties scene is a girl and treated as a girl and it didn't really matter to me\nI was in ... I just thought of myself as a kid\nI've been er card is a writer who lives in northern California\nIt was only when I started getting closer to puberty when I started to realize that I wasn't like other girls\nHe recently wrote about his childhood for a future in slate magazine called spark notes\nWhich is about people's light bulb moments of sexuality\nI wasn't allowed to watch much t._v. the books were at the center of how I saw the world and of course also how I found myself\nThere were books for girls that I tried to decipher like alien hieroglyphics\nTrying to figure out how I was supposed to be in the world\nHideous Jessica Wakefield ground do you remember the sweet Valley High series of books she Lincoln Bedroom near as her twin sister Elizabeth Walter I seriously\nStreaming of New England public radio is funded by un Franklin Community co op offering organic produce baked goods groceries and prepared foods and Greenfield down Schober and falls community grown and community own since Nineteen Seventy seven\nThat's next on studio ...\n\nThe any PR news network is funded by you in big red frame part of the local cultural landscape since two thousand one providing complete conservation and decorative custom framing any temp to an end that big red frame dot com\nAnd by Castro land trust ten than you will five K. for farmland and farmers market festival with a run or walk local food crafts and music tomorrow at ten and had like Castro trust dot org [noise]\nMe to read\nCar inviting you to join me on an island hopping adventure as New England public radio is planning a trip to Greece next to me will enjoy twelve days with a special group of any listening as we walk ancient archaeological sites and taught an island Weiner [noise] take advantage of an early ... before December\nFirst seat the tenant rally and all the details that N. E. T. R. dot net [noise]\nSupport for city a three sixty comes from ... European made language learning program battled teaches practical conversation in a tie in Russian Swedish and other languages available in the app store or online at B. A. P. P. E. L. dot com\nBoom safety [noise]\nBook [noise]\nMost of ... and white has novels are speculative fiction the mega genre encompassing psi phi and fantasy and other non realism fiction of various kinds\nHe won the Pulitzer Prize for the underground railroad is great counterfactual historical novel about a literal underground railroad but he sometimes writes fiction that is\nDecidedly hope here and two dozen eleven he published a novel about zombies called zone one and only one is not some post modern take on the horror genre is smart and funny shore but it's also the real deal\nBrains are eating and living go to war against the undead when zone one was just out I ask ... joined me for a live studio three sixty show [noise]\n\nAh howdy I'm doing one takes place or after the end of the world people are pretty much gone down a more than\nThey're walking around with ... yesterday or post apocalyptic stress disorder\nWe had so much but last year we're doing it again New England public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags owners get your tickets today at NPR done that\nBefore everything became really horrible and Mark Spitz\nAre protectionist I'm not the actual marks but it's ironic nickname as well [noise] uh is thinking about his last\nNight story when he was six he walked in on his mother and getting his father oral pleasure\nOf public television program about the precarious and this of life and is Aaron Getty glimpse didn't passing had introduced him to dread and it had been eating at him the previous few nights bad dreams behind those entertaining\nShe needed needed to slip into his parents king sized bed have you had when he was very young before even he had been banished to his own big boy bed in accordance with the latest child rearing philosophies it was forbidden\nBut he decided to visit his parents he patted down the hall pass the green eye of the carbon monoxide detector that ever vigilant protector against invisible evil and the bathroom and linen closet\nHe opened the door to the master bedroom and there she was gobbling up his father [noise]\nHis father stopped unsettling growls and shouted for his son to leave the incident was never referred to again\nAnd it became the first occupant of that corner in his brains attic that he reserved for the great more to vacations [noise] the first occupants but not the last\nIt was naturally to that night his thoughts fled went on his return from Atlantic City on last night he opened the door to his parents' bedroom and witnessed his mother's grizzly administrations to his father\nShe was hunched over in ... on your way with ecstatic forever on a slapped with his intestine which in the flicker of the television adopted a phallic aspect\nHe thought immediately when he was six not only because of the similar tabloid before him but because of that tendency of the human mind in periods of duress to seek refuge in more peaceful times such as a childhood experience as a barricade against horror\nThat was the start of his last night story everybody had one [noise]\nWhitehead reading from\nWow [noise] you've\nFreud called it the primal scene you you you have one up Freud [laughter]\nWell yeah I mean he didn't I think for the the zombie epidemic or zombie plague working with what any individual says yeah um I guess I have that in my corner\nThere you go so you're a MacArthur Foundation genius uh and now you're now you're characters are eating each other's Cohen's um\nHow did you end up a writing or a novel\nI how much of a choice I was a bit of a shutdown as a kid or other kids like to go and leave their houses I send my afternoons watching the twilight zone and the outer limits\nAnd reading Stephen King and it's got to college I basically wander rights to black shining the black stadiums lot if you took any Stephen King titled put the black in front of the that's why I wanted to do [laughter]\nSo for me I always knew I'd write ... novel eventually and I'm from watching zombie movies as a kid I'd ... I'd had insomnia anxiety dreams for the last Thirty years and I had one that led to the idea for this but really [noise]\nUh yeah well some normal people had anxiety dreams about being late for an exam or they had in a prepared for the big presentation\nCity escaping thing I I've had but specifically escaping zombies oh yeah\nThey're fast or slow they talk they get me or I have Cape I'm Better than my life and actually um [noise] 'cause I've been on book tour people come up to me and said like I have zombie dreams to um [noise]\nSo maybe a support group is an order um [noise]\nBut the idea for his own one came 'cause uh I guess the summer of two thousand and non at house sketched out in Long Island and ah [noise] ah the house has very thin wall when you can hear everything that happens\nWe have so much fun last year with doing it again New England public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags on and get your tickets today at NPR done\nBut you can't really say that to your house I guess I'm a it's a no sex house which I Try to tell people before they come out because you can hear everything you can keep on your shoes you can smoke but just don't have said yes the spare room is available or no sex house do to bring corn or will put on the grill\n[noise]\nAnd so I heard them laughing\nI didn't I couldn't join in because I was sort of in a depressive episode and so I Will myself back to sleep and had a dream that I was in Manhattan that's why I was a dream in Brooklyn\nAnd\nAnd I wanted to go into the living room but I wasn't sure if they had swept the zombies out and then I woke up and it was like that's a real consideration after the apocalypse how do you get rid of the zombies\nThey they stick around like bad house guests and that became a book gotcha [noise] I I I remember\nA decade ago when my children were small and and just being amazed that they both\nAs six eight nine year olds\nCompletely we're familiar with ... zombie political like what killed them what didn't kill them how they lived and how they got that way and I didn't understand how this information had propagated into my you know little kids'\nBrains ... why is why did zombies do you think the last whatever decade or so become so interesting to them to you to the world\nWhen I was writing about two years ago my daughter was like I Know zombies I've seen Scooby Doo\nAnd she thought that I said I should a title my book a wake up the undead an army um which is you know a little longer than zone one um I can only talk about my weird orientation and mine's ... heart is that everything that you've suspected is true which is that\nYour friends your family and everyone in in the community it's a monster who wants to eat you know they've been pretending for decades um biding their time and then one day you wake up\nAnd they want to your face so that speaks to my sort of throw it in trouble so I guess um and that's what ...\nAnd ... it's a best seller now the highest amount of them there you go your parents I'll let you watched George ... they let you do what you want it in terms of cultural menus will if you\nAllow your kids to go to a crazy ideas and rent the big stack of beta max or tapes every Friday you don't have to talk to them so um and we were allowed to see any kind of R. Rated movie I saw ... orange and I was like ten\nAnd I remember as a family or evening and home and I remember being like mommy what's happening when they do that woman and her being like it's a comment on society and um\n[noise] uh\nIt'll actual parents [laughter] so I think it's you know it's it's during my work and I think it helped even though it was not particularly appropriate", "year": "2018", "show_name": "Studio 360 with Kurt Anderson", "city": "Westfield", "day": "20"}