{"month": "10", "state": "MA", "station": "WZAI", "content": "[noise]\n[noise]\nYou're listening to W. ca I your local news and information source for the keep the coast and the island's Ninety point one W ca I W C. A. I. H. D. one would toll Martha's Vineyard [noise] Ninety One point one W any ... Ninety four point three WBAI Brewster\nAnd W. A. G. H. P. H. D. three eighty nine point seven Boston on line at Cape and islands dot org [noise]\nAmerican by birth or not today on the world\nMarket a woman President Trump says he wants to end birthright citizenship but he may not have the authority to do that and\nSupreme Court and Congress have an important role to play and king has will stand as we ... back in on the president's executive order as he seems to have proposed San\nJose Antonio Vargas isn't surprised by trying to focus on immigration ahead of the midterms the writer has been called the best known undocumented immigrants in America but he's still hopeful\nAt a time like this I have to believe in love I have to believe in the ...\n... people [noise]\nI have to leave that we don't struggle alone that's all ahead today on the world\n\n[noise] hello I'm Julie Cantor with the b._b._c. news President Trump has offered condolences at the synagogue in Pittsburgh when we met in ... was killed by a gunman on Saturday the fed funerals had been held for those killed\nThe massacre has been described as the was anti Semitic attacks can be in us history Don Johnson reports\nPresident's and first lady visited the tree of large congregation synagogue to light a candle and showed that respect outside amongst the flowers and tributes there late white roses and stones from the White House a traditional Jewish custom\nDown the road to crowd held ban is calling for the president to denounce white nationalism and to stop targeting minorities some said this visit was badly timed given the first to be eleven dead wood battery today\nThere's a debate over the backdrop to the shooting continues\nDenmark has demanded new a new sanctions against Tehran afterwards Addison foiled their rainy and float to carry out an assassination on its soil\nNorwegian citizen of Iranian background has been arrested the Danish intelligence service says he was working for Tehran and planning to much of an Iranian Arab activists living in Denmark\nThe suspect denies involvement the Danish foreign minister ... said Copenhagen is recalling it some positive from Tehran\nIs is sealed off your for your niche and Russia and Iran is being recalled for the purpose of cultural traditions or would like to emphasize to this is a very strong an unusual diplomatic step to take\nThe red cross says aid agencies must reexamine the way they work so that people in need don't miss out on the health during humanitarian crises\nIn its annual world dissolves does report the red cross recommends that local groups who speak the language and understand their own communities be given more autonomy and crises image and folks reports from Geneva\nThe red cross identify several reasons why people miss out during a crisis lack of funding is on the list but it's not the only problem\nLack of access to communities and lifting need is a key factor said to his lack of information when disaster strikes aid agencies sometimes knew little about the numbers of children or disabled in the affected region or even the different ethnic groups\nCommunity Mr Trump to foreign aid agencies is another reason\nThe U.S defense secretary Jim Mattis has called for a ceasefire and Yemen within the next few days it's a massive said the U.S wanted to see all sides around the negotiating table and an end to dropping bombs\nYemen is suffering from a growing humanitarian disaster as a full year old war drags on between the Saudi led coalition supporting the Yemeni government and who the rebels backed by Iran well news from the BBC\nItaly has suffered a ... a day of storms that now known to have killed eleven people much of the lagoon city of Venice remains inundated\nThe water Lebanon's ... peak to more than one and a half meters all tax but the waiting to assess the flood damage to the thousand euros mosaic flaws of since ... facility ...\nA spokesman for Brazil's president elect shy about ... cents\nIt to lose which critics say will jeopardize the country's natural resources an advisor to Mr ... who supported by the agri business loyalties and the ... street would focus on production [noise]\n... have agreed to begin the repatriation of for the hinge of refugees in the middle of November despite a warning from un officials that conditions and not right for them for ten of the seven hundred thousand for him to Muslims fled admitted ... rationing me in my last year [noise]\nThe copy the th ... lady Chantal is now the that was used by the judge in a non smoker trying in Britain that's been sold at auction ... Seventy thousand tone is more than five times what was expected\nIt's publisher penguin books was eventually cleared of obscenity for the tail of a new passion between and I was to current ... husband's gained keeping ... takes up the story\nIt was one of the most talked about trials of the twentieth century a clash between the oldest ... and the new wave of liberalism in Britain the prosecution famously asked is it to ... you would wish Joel why full servants to read\nIn judge Lawrence burns case the answer was yes his wife lady Darcy burn marks up the sexually explicit passages in our husbands copay\nAlso included in the sale it's southern bodies were lady buns handwritten notes which she listed the page numbers of section she considered cos it's those details that undoubtedly boosted the books value\nBBC News\nFor the world comes from babble a European made language learning program\nBabble teaches practical conversation in Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com and from Clark university's international development community and environment department which recognizes that administrations change but global problems persist\nInformation about opportunities to develop solutions to global challenges and turn research into action at Clark you dot edu slash I. D. C.\nHi Margaret where men and this is the world thanks for being with us today if the U.S as a country of immigrants it seems that President is determined to change that from lowering the number of refugees admitted to the U. S. a record low kept under President Trump to making the laws of migrants coming to this country miserable\nNow Trump says he plans to eliminate birthright citizenship\nThat's the idea that if you are born in the U. S. you're automatically a citizen\nThe the concept is enshrined in an amendment to the U.S constitution for the president told actually as he could do away with it unilaterally\nYou can definitely do it was an act of Congress but now they're saying I can do it just was an executive order\nMartha Jones is a professor at Johns Hopkins university and the author of birthright citizens a history of race and rights so this is all tied in to the fourteenth amendment done there was an interesting history behind that could could you talk about what went into forming a\nSure the fourteenth amendment comes into being\nIn the aftermath of the U.S civil war for a million plus former slaves are now free people and the question is who will they be in a formal constitutional sense with respect to the nation the fourteenth amendment declares them to be birthright citizens\nBut it goes further of course because it extends beyond former slaves to all persons born in the United states making them citizens of the United states\nSo let's talk about that a more in a moment I'm up because it's all part of of your research let's just get into the president's for what we're looking at today or a prior case that's came close to defining or interpreting this from the Supreme Court the most important\nCase for thinking about this question is that of a gentleman named belong Kim arc\nUm which has decided by the Supreme Court and Eighteen Ninety eight\nOne Kim ark is born in the United states um his parents are Chinese immigrants\nWho cannot become citizens of the United states because of the existing Chinese exclusion acts of the period but long himself assumes himself to be a citizen because he was born in the United states he leaves states to do business in China\nAnd when he returns he's detained at the port and refused re entry his case goes to the U.S Supreme Court where the court affirms that\nEven as long Kim arts parents cannot become citizens of the United states he because he was born in the U.S pursuant to the fourteenth amendment is a citizen\nSo it seems like the cave kind of centered on the parents did did the outcome at the Supreme Court essentially defined birthright citizenship as we know today\nI have to believe that we don't struggle alone I Would argue that after this horrific horrific tragedy I bet you that more people are going to be more willing to help\nWith Antonio Banderas his new book is called dear America notes of an undocumented citizen I'll say thank you thank you so much for having me [noise]\nWe have rivers and always full interview with ... by the way as a world dot O. R. G. you're with the world\nDungeons and dragons players\nW sea ice is standing members helped make this live stream possible were grateful for the ongoing support to learn more about becoming a sustaining member visit Cape and islands dot org character in a book someone\nEater lovable enough everybody in the group skin to love them or just annoying enough that you always are memorable\nDungeons and dragons keeps my imagination open\nIs that childlike sense of wonder and that's why I take away from the Andy\nYou're listening to the Cape and islands NPR stations\n[noise]\n\n\nI'm Mark a woman and this is the world\nFor a platform that was supposed to build community has become pretty clear over the past few years at Facebook's communities have some problems hate speech disinformation fake news\nThese problems don't just live on line this spill into the real world and they have serious consequences our colleagues that front line here at W. GBH I spent a year looking deeply at how all this has impacted people all around the world they're documentary the Facebook dilemma is airing on PBS this week\nWe want to focus on one country discussed in the documentary the Philippines where president Rodrigo Duterte day is accused of using a coordinated army of trolls to silence critics\n... patriotic phone ring on line skates sponsoring him and his hirings mankind can rebate so they change from Asian custom jak change democracy I sat down and where our lives are prevalence [noise] play licensure\nFront lines James Jacoby worked on this investigation and joins us in the world studios thanks for coming by chance thank you [noise] uh what is the place of Facebook in the lives of most Filipinos like how much of the population has access to it and how much do they interact with each other by the up\nWhile it's remarkable the story Facebook in Southeast Asia is amazing that they pushed aggressively into south east Asia to Philippines and demand more other countries\nAnd they are essentially the de facto Internet and a lot of those countries because they offer Facebook as part of a data plan where people don't actually have to use the data in order to use it and the Philippines\nEnd of the Internet users in the Philippines use Facebook as the Internet basically and Maria wrestler who who's a woman were interviewing in the film from the Philippines who runs a big news organization there she\nTalks about the fact that it's their public space it truly is their public space in the Philippines in terms of\nTheir digital lives so Maria right so we just heard from him off from her in a moment um we've reported on the story that uh occurred in Myanmar where fake news actually lead to violence headed Rodrigo Duterte day the Filipino president weaponize Facebook during the election campaign and twenty sixteen so\nWhat happened is Facebook actually offered a lot of help to deter today during his campaign for president and helped him to really harness the power the platforms helped his campaign really understand how to use it effectively and as Maria wrestle reports\nAfter he was elected he essentially weaponized it by turning all this campaign machinery all these accounts that he was controlling he had\nA network of fake accounts and of paid followers that we're disseminating all sorts of lives about his policies and also going after critics in a rather vicious hateful way um and in some cases are trying to incite violence against\nPeople [noise] so uh on Maria ... a ... this activist I mean she worked for a prominent news website in the Philippines Rappler media and when she started noticing this problem she actually brought it to Facebook's attention in twenty sixteen as we learn in the dock here's an exchange between you James and Maria ...\nWere you given an explanation as to why they weren't acting [noise]\nI think Facebook walk back to the teams and they were focused on club but they didn't realize is that countries like [noise]\nCountries way institutions are clear corruption is ran these don't have any dogs [noise]\nWhen you bring everyone onto um time for him and do not exercise any kind of rules\nIf you don't implement those rules before ... chaos\nJames what did Facebook tell you about the way they responded to the Philippines and to Maria Russia's complaints well Facebook has set a number of things in response to it when they said they were too slow and addressing the problems that Maria brought to them and it ...\nTo three part investigative series that exposed the fact that there were these accounts that were spreading hate speech and misinformation that Facebook actually took action on those accounts but\nAs she tells us the problem is ongoing interestingly\nRecently in as a as I think it was an April Facebook is paying Murray arrest US Organization to be a third party fact checker of things that are going viral on Facebook in the Philippines but as she put it to us recently they're completely inundated and Facebook still doesn't really have handled the\nProblem there does that suggests you know hiring her as a fact checker ... does that suggest Facebook is going to pursue and due diligence or they were just trying to plug the hole\nI think that that there are fact checking project that they are trying to do all around the world um is what they're seen as the first step toward a solution or at least containing the problem of hate speech and misinformation to have\nPeople on the ground that are fact checking material in the home country on in the language and um it's really an outsourcing of it and what's also fascinated about it is that\nWhere your rent Reza runs a news organization and she's utilizing resources that would otherwise be put toward reporting and doing fact checking riots going viral on Facebook\nYeah [noise] um if you zoom out of the Philippines a for a moment I mean many of us are closely watching Facebook's operations here in the U.S and abroad and\nThe the big question which you raised several times are they doing enough at Facebook to stop these campaigns whether it's this information fake news hate speech uh what do you think after spending a year investigating all this and actually being at the you know age ... for Facebook\nWell they um it's an interesting question because what does it mean enough and I asked people at Facebook you know what's the standard for success here because there is no ability for us to audit them were really left in this position of having to take their word for it and whatever it is that the standard that\nThey set for themselves but there's so much that we just don't know but as a ... this is a writer Alexis Madrigal from the Atlantic ah says in your dog and it's really it was a really powerful quote the very things that divide us the most are the things that get the most engagement um talk about that have been ... where that's most evident right now\nWell we've got our mid term elections and um and we've had you know that the horrific events here of the past week and scenes that whether it's the shooter in Pittsburgh or the attempted bomber um these are people that are very rafts\nPolarization and filter bubbles are are a real thing on social media and this kind of reinforcement of world years that's the main discussion happening right now I think\nJames after a year of working on this er and investigating Facebook or are you on the platform or what if you were or you know off it I I'm On it I've always taken a I have a very small footprint on their um which by the way it doesn't mean much in terms of what data they collect revenue\nUm but uh it's just um [noise]\nYeah I'm I'm torn and sign up to ... who is in the film was a scholar at UNC\nUm says I think one of the most important line which is what are you going to do about the fact that all your friends and family are there it's just tremendous thing to be able to communicate with people it really is an amazing invention budget is so problematic so ... what are you going to do\n[noise] James Jacoby with frontline part two of the Facebook dilemma airs tonight on PBS and you can find part one online at PBS dot org James thanks very much for coming in at U.\nT. V. fever and then they can do to\nActually make them feel\nSpecial didn't\nOf the big forces in college campuses today is anti Semitism in those ants of anti Semite so usually not me not being on college campuses they're coming from the radical left so we have to stand against anti Semitism whether it's on civil rights or whether it's on civil law yeah\nUm I think here again Israeli Jews are not following the intricacies of right versus Latin America I think a lot of Israeli Jews would be no firm hold support Donald Trump they don't really care\nSo much better domestic policies they don't really know very much about a domestic these it's important to me it was really due to the Trump support Israel in the Trump supports a strong Israel so I'm\nRon dreamers comments I think perplexed American Jews whether they do Israeli Jews\nAnd it told me a bit of a reaction among some of Israel's left wing politicians to what happened in Pittsburgh\nOver all although there has been expressions of ... percent the shock of higher\nThan the new kind of quickly moved on here I think a lot of Israeli Jews don't fully understand the impact\nThat this had on the American Jewish community they don't fully understand the plays the synagogue life for American Jews they don't understand that for American Jews synagogue as a second home it's a place where kids grow up and Hebrew school where they hide as I did like you know hiding out from from Hebrew school in the bathroom with my friend\nAnd a place where you are playing kind of come of age and that you you know this\nAnd did a lot of reporting about the residents of Pittsburgh and the people from real hell and I'm\nOne of the stories that move me most was the story of Jerry Ruben ... sixty six years old he was one of the eleven people who were murdered he rushed to the sound of the noise we don't know if you knew it was going to fire at that point to go help and that is when he was shot\nAnd and as an immoral and Pittsburgh people spoke about how he had this interesting custom dream orders hottest which is a Jewish prayer memorializing the dead and it's set in every single service he stood up\nHe always stood up for the cash and that is traditionally a time but only those who are mourning actually stand up and when asked why did he stand up\nEvery single time he said well I have no children so one day there will be nobody to stand for me so I stand for all of those who have no one to stand for them and on Saturday everybody stood up and stood for Jerry in in his memory and I think um\nThat standing up at that standing up together is such a metaphor and I think overall Israeli Jews and Israelis in general they don't need a synagogue given Jewish humidity because they had their just unity\nWithin their own lives and in a way that American Jews if they want to find community if they want to find a sense of solidarity among themselves that they find it in the walls of a synagogue and that is another sort of way that Israeli Jews and American Jews you know don't connect\nYou know the president does reveal across the differences between American and Israel which is what would you how would you sum up those differences like what's the bumper sticker\n[noise] me think um\n[noise] that American Jews and Israeli Jews are two very different paths right now I Would say American Jews for the most part are liberal like consider themselves very much attached\nTo their immigrant roots and because of\nThat they tend to support rights for immigrants they tend to very much believe in the Senate the repeated in the Bible more than any other tenant would just be kind to the stranger because you two are much once the stranger in Egypt and so\nThere's this very strong desire to knowledge that you know American Jews have done fairly well to themselves in in America I'm and feel fairly successful and put so very comfortable um\nAnd I think that comfort to the lead them to sort of be more liberal and more open where Israeli Jews still\nFeel under attack they feel very much sort of the product\nOf sort of post traumatic has Holocaust world where they look at\nThings very much in the sort of there are some game at times you know a person's them whether it comes to Arab neighbors or you know I'm fresh from within somehow an Israeli the trend toward sort of like circling the wagons in fear and American jury you have a trend sort of towards plurality\nAnd I think you should just divisions coming more clearly now and for a half tragically in some ways highlights those splintered\nReporter Dina cropped with Haaretz in Tel Aviv she's also the host of the podcast the branch Dina thanks very much for your time and you\nKnow ... ...\n...\nIn\nThe ...\nAnd her life roof gates earned a reputation as a passionate defender of coral reefs [noise]\nWhen you look at organisms and um you look at a coral reef clearly we're losing more Carl [noise] than we would hope and that means the rates of changing the environments have essentially out pace the capacity of the Carlson fell to adopt\nRoof gates died last week at the age of fifty six just months after being diagnosed with brain cancer longtime friend and collaborator Virginia was says gates was one of the very first scientists to make the connection between coral bleaching and global warming\nShe started in the Nineteen eighties in the very early days when none of us understood what was going on she was able to show that corals did this strange pay lanes and she was able to\nTie it to warming and at that time we were just starting to understand what global warming was\nOver the years gates became a bowl of teacher and an eternal optimist in a field whose future looks grim until her death gates led a research lab at the University of Hawaii but trying to figure out ways to help coral adapt to warming oceans friend Virginia was says she was also a regular and vibrant public speaker\nI don't remember her ability to light up a room and make everyone in the room feel like she's talking jets to them she\nHad this wonderful silky highbrow English accent that she joked with her secret weapon and she was able to tell the story of corals and she was brilliant at it she really excelled at it\n[noise] I Know you've described her as an iconoclastic or feel why\nSo she was and I kind of class and a couple of different ways the best one to think about right now is this idea of assisted evolution of corals to very controversial it's the idea that humans need the help corals evolve faster\nTo be able to tolerate the heating that's happening and some\nDo that and but others led by roots really feel that we need to try a variety of options\nShe's the first to admit it may not work but if you don't try it then we can't know but personally I feel very strongly she was an iconoclast in terms of the way she approached science she disliked pushing your colleagues decided\nTo get ahead and she was much more about cooperation and encouraging\nAll diversity brown people and women and because of that sometimes she ruffled feathers but she ruffled feathers to make the world of coral science a more inclusive cooperative place\nSuch determination to help these coral reefs are in the face of in the past few years several major coral reef bleaching events and the rest of the news isn't good I mean coral reefs are expected to be almost completely destroyed in coming decades\nAnd yet Rick Gates remained so optimistic how did she retained that optimism all studying something so depressing\nWell it's such a great question mark how I think all of us are trying to bottle that um especially in light of her life she just looked forward and she felt like\nYou know we control our hands up and give up or we can look for solutions then I think her enthusiasm really instilled that\nSame passion and a lot of other people\n[noise] what is the one memory of Virginia that you'll always hang onto about risk gets\nHer laugh [noise] you know she was not a big person but she had this huge laugh that failed around people in restaurants would turn around and stare I mean general and she laughed she left early and often and it was infectious\nVirginia was a biology professor at Oregon State university and a longtime friend and colleague of coral researcher roof gates who died last week Virginia thanks for telling us about Ruth and our condolences to you thank you so much Marco\nAnd\n\nThis is the world in a support for the world comes from YouTube original and roadside attraction is presenting Pfeifer club story Susan surrender\nJournalists also starring ... any ... in theaters fighting and from babble like European made language learning program babble teaches practical conversation in Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L.\nDot com delete Polly he'll ... he'll arboretum in West is very\nThat's just an American magnolia and not cold that's why I'm Jody I'm ill because it was a\nA best one of the group children and I own ... he was my husband and he [noise]", "year": "2018", "show_name": "PRI's The World", "city": "Brewster", "day": "31"}