{"month": "10", "state": "MA", "station": "WKOX", "content": "Mary and get him out on that\nOn\nShe got the little children the ones that\nThey might not get a lot of them will be able to get the\nWouldn't let me say that they might look\n[noise]\nThat\nHim and I'm from and\n[noise]\nW I guess I\nMy\n\nWas a boy who made\nA ... [laughter]\nAnd\n\nWe have died\n\n\nAre bad guys are doing and\n\n\n\n\nDe\nThat owned by a dog\nDo you also need and y'all got cameras does that mean I Know why\nCan't hear you know\nThey're you\nDon't they don't do that now I\nAnd does that make us you and it's sad to say that but at the heart radio ... says but I Know he doesn't he sent this on the list yes yup ... as I said\nThat if they step because the only school just like you didn't get a salad and up yeah that's going to go negative I doubt it that I write\nOut a muscle Latino read he must ... to ... [laughter]\n[noise]\n\nYou\nKnow kids are some\nThat are are there Joe\n... email to\n... go to some others to maybe a joke but at\nBagel and a lot\nBucket of fairly\nHear from early in your story random\nNo longer a camp in da da da da da\nDa da da\nDa da da da\nLa ...\nBut\nThe ... on these shows in ... years\nAgo just a little\nBit but do you do the person\n...\nPercentage of the\n\nThem to use the ... the ...\nIssue we need\nMuch for your\nTime based\nMy on my own medical and ...\n... ... that that might come down\nAlive\nI\nBag that can be a man\nAnd\nMaybe they are\nMet a\nA blessing me you know\n\n\nI thought about that and then\nWell yeah I Know I don't know\nLike I Am by and\nBarrel again when it's\nSo fast that can be\nThen I\nDa da da da\n\n\n\n\nKnow say that they naturally ... and yeah go and that that\n[noise] [noise] [noise] Mm\nIs you know damaged or ...\nKnow it was going around\nGreen ones are all grown\nHe is\nBall\nMinute and get out there making me\nIn there\n\n\n\n\nOf\n\nThey don't want to be like me\nDon't need it done nicely saying you know it's like you're not you're\nNot you know he had a mess that he that get Dicky me and the guy that I don't want to get this done was that I Do me knowing that he is he not only ... then it's scary that picky but I guess we just got a hold of that but I but I Love a and B is and those those those those\nE. S. U. S. C. yet ... says so good and the idea that if they mean they'll let us and they ... the last decade got enough that you ended up\nYeah is this in Sudan yeah they got to let me in that I must ... envy is multiple to me that is seen as they can\nIt can be good old I'm must love Beatle read ... months by Leonardo da\n\n\nNa na\nNa na na na\nThen again I\nBill that three na na\nNa na\nI'm no matter where I'm On the line I mean I Know the younger you are and what he made up\nWell\nBelow on\n\nCome by here had\n... na na na na\nNa na na ve man\nWhy I don't know about those shows\nNa\nOh oh oh oh oh\n... no more\n... billion strong moral last June\nMan standing stone oh\nThose right yeah\nNo Mitch Daniels June I'm\n\nLove being done by luck that show that really struck him or not but you know we're not going\nFrom them and Sean when there's nothing on\nThe kitchen table and I thought that maybe at that time they own I don't know if he does seem legitimate Michelle and I know\nKnow nothing about the mental Jermaine showed I Know I\nAnd he'll go the can\nNa na\nThen you'll know\nThink it was the one for me that you may be mom according to the next time you know but you keep the numbers don't you come to\n... only\nWhen I'm On I mean we don't I don't know they must have been legitimate Missouri right now and\nThe situation that all that if the the ... election I'm blown up and it'll be just you must go just let me show you\nOn the hill and right now and\nTo the minor league\nEat it and then you'll be looking back into time and they dont na", "show_name": "At Home with Gary Sullivan", "year": "2018", "city": "Everett", "day": "27"}