{"month": "10", "state": "CO", "station": "KRCC", "content": "At least tune in again next another on shortly after we read\nThe uh [noise] just\nAt least tune in next\nOr another on shortly after we were\nReally on\n\nMore and more people are getting their news on mobile devices in through social media in Ninety One point five feet are the the doesn't have to be any different Mitt this morning news can't find it on our website getting out of your car but went to keep listening to all things considered download the mobile apps\nAnd he didn't want a local story impacting your community followers on Twitter feel like passing along that NPR story Mica unsafe but [noise] the news never stop neither do we Ninety One point five K. are seeking and\nNPR on Ninety One point five K. R. C. C. is supported locally by Ninety One point five to your see see underwriters\nThank you for helping to fund southern Colorado's NPR station\nNinety One point five years cc more information on how to underwrite at K. R. C. C. dot org this is southern Colorado's NPR station to your C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. law hunter the CCS ... M. T. W. CCF them woodland park\nThis [noise]\nIs Ted radio hour [noise]\nEach week groundbreaking had talked to\nHead technology entertainment design design is that really would tend to see him never known that delivered having had conferences around the\nWorld gift of the human imagination we have to believe in impossible thing the true nature of reality that and [noise]\nThose talks those ideas adapted for radio [noise]\nFrom NPR [noise]\nI'm Guy rise coming up\nUltimately we're interested in understanding how life works every year I have an inkling of who we are what we need to do is figure out how the brain does it as a biological piece of machinery we now have technology that could in theory you allow an individual to upgrade their you know this episode\nThe impossible thing the true nature of reality and [noise]\nThose talks those ideas adapted for radio [noise]\nFrom NPR [noise]\nI'm Guy rise coming up [noise]\nUltimately we're interested in understanding how life works every year I have read where you're where we are what we need to do is figure out how the brain dose of as a biological machinery we now have technology that could in theory you allow an individual to upgrade their [noise]\nThis episode what makes us us\nFor this news\nLive from NPR News in Washington I'm Barbara climb secretary of state Mike Pompeo has met with North Korean leader Kim Jong un and young young NPR's Anthony Kuhn reports this pump pale makes his way home he stopping in Seoul in Beijing to brief official\nPump AOL held three and a half hours of talks with Kim Jong un Kim than hosted palm pale for Ninety minutes lunch at a state guest house on arrival in Seoul Pompeo told president Moon Jae him that his talks with came and been productive and that he had made progress\nBut he offered no further details as to whether he nailed down a time and place for a second summit between him and President Trump or about even side's demands the U.S wants North Korea to hand over an inventory of its nuclear weapons programs\nNorth Korea wants sanctions on it lifted and a peace treaty formally ending the Korean War Anthony Kuhn NPR News Beijing\nPresident Trump is holding several campaign rallies this week as he fights for Republicans to maintain control of Congress as NPR's Tamara Keith reports the president's started last night in Kansas by touting the confirmation of Supreme Court justice Brett Kavanaugh\nPresident Trump says the one week delaying the confirmation vote for Kavanaugh turned out to be a great thing\nHe told cheering supporters at a rally in Kansas that Republicans have been energized by the fight something that is reflected in recent polls Trump said his backers could show how they feel about it by voting in the midterms is November if\nThe wrong people to get into office things could change\nThe president's party take the drug being in the first congressional elections after he takes office one question is whether the GOP enthusiasm in recent days the last democratic enthusiasm has been ...\nOr is at a rally in Kansas that Republicans have been energized by the fight something that is reflected in recent polls Trump said as backers could show how they feel about it by voting in the midterms is November and\nAllow the wrong people to get a job offers fingers crude change\nHistorically the president's party take the drubbing and the first congressional elections after he takes office one question is whether the GOP enthusiasm in recent days will last democratic enthusiasm has been elevated ever since Trump's election ... NPR News\nIn northern Haiti eleven people are dead after five point nine earthquake struck last evening NPR's Carrie Kahn reports\nThe ten most struck early evening Saturday in the northern most province of Haiti toppling at church and homes in several cities as well as damaging an auditorium and the police station in the town of Puerto pay the quake was felt more than a hundred miles away in the capital Port au prince were no major damage has been reported\nIt was also felt the neighboring Dominican Republic and in eastern Cuba\nHaiti is vulnerable the strong quakes and given the poverty in the country most living tenuous structures that lead to higher casualties in two thousand and ten a seven point one quake struck near the country's capital killing more than two hundred thousand people and causing billions of dollars in damages and housing and other infrastructure nearly a decade later\nMuch of the capital has still not fully recovered Carrie Kahn NPR News this is NPR\nThe death toll from the September twenty eighth earthquake and tsunami that hit central Indonesia continues to climb Indonesian officials now say more than Seventeen hundred people are dead more than five thousand are feared missing\nThe wife of Israeli prime minister Benjamin Netanyahu is going on trial today as NPR's Daniel Estrin reports from Jerusalem Mrs Netanyahu is accused of improperly spending public funds\nYou're talking you're whose wife sorrow and it's on Yahoo was indicted last year her trial open today she's charged with misusing about a hundred thousand dollars in public funds to pay for private gourmet meals from top restaurants which was not permitted because the prime minister's residence employed its own cooks\nSarin Antonio's lawyer argued that regulations against ordering private meals have no legal basis than it's on Yahoo\nGoing on trial today as NPR's Daniel Estrin reports from Jerusalem Mrs Netanyahu is accused of improperly spending public fun\nAnd it's on Yahoo his wife sorrow and that's on Yahoo was indicted last year her trial open today she's charged with misusing about a hundred thousand dollars in public funds to pay for private gourmet meals from top restaurants which was not permitted because the prime minister's residence employed its own cooks\nSarin Antonio's lawyer argued that regulations against ordering private meals have no legal basis\nThan it's on Yahoo family has long been accused of living a lavish lifestyle the prime minister himself is being investigated by police on suspicion of accepting expensive gifts as bribes he professes innocence Daniel Estrin NPR News Jerusalem\nThe private aerospace companies space sex is going for another first tonight if all goes as planned at seven and Twenty one PM California time stay sex will launch a satellite atop a falcon ... rocket\nAnd nine minutes later the rockets first stage will land safely back at Vandenberg air force base it's the company's first attempt to the landing on the west coast\nI'm Barbara Klein NPR News in Washington support\nFor NPR comes from NPR stations other contributors include Baird providing global financial resources and market expertise to clients the world over our W bears dot com has more information and the Robert Wood Johnson Foundation at our W. J. F. dot org\n[noise] it was well loved well you [noise] Nineteen Ninety seven ... absolutely no bells and whistles we had tried to sell it my teenage daughter so that\nThey would get money out of it and I'm like no no one's going to buy it and probably about I don't know six months ago I was like okay we are doing it for the simplest thing I've done\nAnd then into two guys one\nI'm Susan I live in Colorado Springs and I was ... years cc dot org ... hard to imagine information\nIt's the Ted radio hour from NPR I'm Guy Raj so imagine a big thick book\nAbout the size of a dictionary and inside that book each and every page filled with just four letters just four letters printed over and over\nA G C anti\n... when I see I live in Colorado Springs and I can see the tree or CBC dot O. R. G. for cars donation information\nIt's that Ted radio hour from NPR I'm Guy rise so imagine a big thick book\nAbout the size of a dictionary and inside that book each and every page filled with just four letters just four letters printed over and over\nA G C ... teams right for letters of the you know be in a\nSame four letter that every species on the planet has is made up of four letters each representing a chemical compound arranged in such a way to make you feel\nThis is really where the information comes from is not the four letters but exactly how they're connected to each other so is it a GCE\nTea or a a gene or a CD or a\nDay by the way is Sam ... gene editing technologies and Sam says if you print it out and all of the AIDS and cheese and sees and tease it takes to complete your entire genetic code which by the way is a lot of letters the genome\nIs three point two or so billion letters\nYou know you would have paid a lot of pages or if you had every\nPage filled with ... g's and T's you'd have\nEight hundred dictionaries worth of genetic code or\nSomething like that for one person for one person so could you say that every single out of our our our physical traits the color of our eyes are characteristics are personality traits come from for chemical\nI Would say that while I'm and this actually all the information to turn a single fertilized eggs so into an adult\nHuman is contained within that singular genome\nNow here's what's really crazy sixty years ago we didn't even know what do you know was the answer to the question what is life was in history\nAnd that of course the other question I wanted to know you know directly to explain a life after ... outside of what was the essence of live\nLife whether the essence of life that was the question answered by James watching who spoke about it a lot on the stage and the and why and along with his partner Francis Crick discovered the essence of who we are we\nNow here's what's really crazy sixty years ago we didn't even know what the genome was the answer to the question what is life wasn't mystery\nAnd that of course the other question I wanted to know you know ... explain life after it got started but what was the essence of life\nWhat was the essence of life that was the question answered by James watching who spoke about it on the stage and and watch and along with his partner Francis Crick discovered the essence of who we are\nIdeas about what makes us us I'm Guy rise and you're listening to the Ted radio hour\nFrom NPR southern Colorado's NPR solution Ninety One point five to ... you can be with you wherever you go all you need is your smartphone download the free Ninety One point five to ... mobile ah with Google Flu or the tunes app store [noise]\nEither this is\nMy ... this is Jonathan from your water does a dominant golly from the most uh\nAn easy Seventeen did need nighttime anyone ... the\nProgramming on Ninety One point five K. R. C. C. is supported by the Colorado Springs law firm of ... skin hurt and cry for forty five years helping clients with family asset preservation federal estate tax exemptions and more Fifteen west similar on your skin heard dot com\nBoom Ninety One point five ... or CC's summit club members who have dedicated twelve hundred dollars or more and supportive are award winning coverage of life in southern Colorado information about joining the summit club or kill your CBC dot or\nSupport for the Ted radio hour comes from the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. S. L. dot edu\nFrom Elijah Craig family owned makers of small batch Kentucky straight bourbon whiskey Eliza Craig bart's town Kentucky forty seven percent alcohol by volume Elijah Craig promotes responsible drinking and from the any Casey foundation\nIt's the\nTed radio hour from NPR I'm Guy rise and on the show today ideas about who we are what makes us us and we've been talking to a biochemist Sam Steinberg who's been explaining how a new gene editing technology called CRISPR cast nine\nFrank family owned makers of small batch Kentucky straight bourbon whiskey he lives a crack barred stand Kentucky forty seven percent alcohol by volume he lives a crack promotes responsible drinking and from the any case the foundation\nIf that\nHad radio hour from NPR I'm Guy rise in our show today ideas about who we are what makes us us\nAnd we've been talking to ... who's been explaining how a new gene editing technology called CRISPR calf nine could make it cheap and easy to create humans who are you're basically talking like super heroes right like perfect vision superhuman strength perfect SAT scores right that I\nYou know that I think that's that's the science fiction association of what\nChris could allow [noise] we have long lists\nOf gene variants associated with certain traits and some of those are silly like whether or not you're a morning person [noise] but we also have long lists of gene variants that are associated with\nThings that might be desirable like having extra strong bones or leaner muscles or lower sensitivity to pain or lower risk of Cornell heart disease and as those lists continue to grow [noise]\nWe now have a technology that could in theory\nYou allow an individual to upgrade their genome\nBut why would that be the science fiction version if it seems like the the technologies are promising like if there was a way to make a child more resilient a painter or give us a hierarchy is you can imagine that people would want to take advantage of all those things right\nThey will I think the challenge then is to is to think about how we can ensure that that technology if it becomes available is used safely because we're certainly not there yet but also I think equitably\nThere's a great example in the world of HIV aids so it turns out one to two percent of all humans have a specific genetic mutation that is associated with HIV immunity because this gene variant they have\nEssentially masks theirselves and HIV virus can't get inside\nSo what a friend you know delivered it into a fertilized egg cell into a human embryo so that that future child even though neither his or her parents have that mutation will still have HIV immunity\nWe might assume of course they would want that but it's still a game changing idea that we would be able to make those decisions and\nGenetic mutation that is associated with HIV immunity because this gene variant they have essentially masks theirselves and HIV virus can't get inside\nSo what a friend you know delivered it into a fertilized egg cell into a human embryo so that that future child even though neither his or her parents have that mutation will still have HIV immunity\nWe might assume of course they would want that but it's still a game changing idea that we would be able to make those decisions and not just selected traits still inherit from the parents something we can already do with ... and genetic testing but kind of installing new variance into their genome that they would\nNever have gotten from their parents if it's like a pre emptive solution for for for something that may never come come to fruition like ... like we're just saying hey just in case we're going to give you immunity against the finger you may or may not ever meet\nAbsolutely so do you consider that a an enhanced men or that disease prevention is you know many people see they divide DNA rewriting or gene editing into kind of\nTwo different categories one being disease prevention and one being genetic enhancement but I think there are many that far right smack dab in the middle so yeah with the with the HIV immunity genes easier five\nThat's disease prevention but it's preventing a disease that you may never get so in in a way it's kind of conferring a genetic advantage and I'll just state again that's a gene variant that exist naturally but only one to two percent of humans have yeah so it's clearly giving you an advantage above what we might call normal human species functioning\nBut I mean I mean a part of me wonders\nSweeping giving that you know you know what I mean like there's a process that just kind of sort of happened since the beginning of human evolution and we were completely be up and being that\nThat's certainly one way of looking at it and yet evolution is inherently cruel [laughter] for someone that has a genetic disease that's kind of a a crummy hand that they've been dealt\nSo I think this comes down to the question of of how secret as the genome and is it something that should remain untouched on tainted left alone\nOf course what we do in any one patient that's a lifesaver for that patient but when you think about human evolution over the course of hundreds or thousands of years now we're talking about a technology that will not only affect that individual but\nThat individual children\nEvolution is inherently cruel [laughter] for someone that has a genetic disease that's kind of a a crummy hand that they've been dealt so I think this comes down to the question of of how secret as the genome and is it something that should remain untouched on tainted left alone\nOf course what we do in any one patient that's a lifesaver for that patient but when you think about human evolution over the course of hundreds or thousands of years now we're talking about a technology that will not only affect that individual but\nThat individuals children and their children and their children and their children and so that's where I think you have this\nVery radio issue of directing future evolution\nYou know even saying that sounds hyperbolic it sounds like science fiction but I think the technology will get to a point where you could use it in embryos to install things like HIV immunity or stronger muscles and maybe someday gene variants associated with higher\nIQ or being a morning person if that's what you'd like to be\nThat's where things really take off [noise]\n[noise] ... camps turmeric is working on a book about all this it's called a crack in creation gene editing and the I think about power to control evolution you can check out his ... at ... dot com\n[noise]\nToday show we're asking a very important question is who are we\nOkay by like you have the answer dino who we are\nI Know who I Am [laughter] I ... I have a an uh an inkling of where we are this is Steven Pinker I Am a professor of psychology at Harvard University and I write books on language mind in human nature\n[noise] so what what is it that makes us who we are\nWell ... there are some uh intricately complex circuitry in the brain\nFabricated over millions of years by natural selection that he quips us with a set of motives and emotions and mechanisms for learning and thinking that make us who we are\nOkay there's a lot to unpack hair set to begin to understand what Steven Pinker Jeff ed and to understand what accounts for the differences between us we kind of need to understand how far we've actually come in trying to figure this all out\nThere are some uh intricately complex circuitry in the brain\nFabricated over millions of years by natural selection that he quips us with a set of motives and emotions and mechanisms for learning and thinking that make us who we are\nOkay there's a lot to unpack here so to begin to understand what Steven Pinker just said and to understand what accounts for the differences between us we kind of need to understand how far we've actually come in trying to figure this all out so Steven can you can you help us with this okay I'll do my best [noise]\n[noise] okay just to get us started human beings have debated nature\nVersus nurture for hundreds even thousands of years that is whether who we are our personalities are behaviors are either entirely inherited from our parents or whether it all comes from the environment around us that when we're born our minds are basically like blank slates\nAnd that all of a structure comes from socialize Asian culture parenting experience\nThat was Steven Pinker ... stage back in two thousand two in this idea of the blank slate it was especially popular in the second half of the twentieth century and it meant that a lot of us went through high school biology hearing stuff like this\nMan has no nature from historian who they are ... you got that man has no instincts when the anthropologist fast we want to give the human brain is capable of a full range of behaviors and predisposed to non from\nHochul a scientist Stephen J goals ... why should have been such an appealing notion well there are number political reasons why people are found congenial foremost if it if we're blank slates then by definition we are equal because we're all equals zero equals zero\nBut if something is written on the slate and some people could have more of an others and according to this line of thinking that would justify discrimination and inequality\nAnother political fear of a human nature is that\nIf we were blind place we can perfect mankind the angel dream of the perfect and then with the of our species through social engineering whereas if we're born with and certainly interesting and perhaps some of them can damage to selfishness prejudice and violent [noise]\nFirst of all there are a number of reasons to go to the human mind is a blank slate and some of them just come from a common sense as many people have told me over the years\nJustify discrimination and inequality another political fear of human nature in fact I if\nWe were blank slates we can perfect mankind the angel dream of the perfect and then with the of our species through social engineering whereas if we're born with and certainly interesting and perhaps some of them can damage to selfishness prejudice and violent [noise]\nFirst of all there are a number of reasons to go to the human mind is a blank slate and some of them just come from common sense as many people have\nBack in Nineteen Ninety to a big celebration was plans to mark the five hundredth anniversary of Christopher Columbus was a rival\nIn the Americans by the American Indian activists in American indian people just said enough with this Columbus craft enough with this happy\nIndigenous people's day this week's on the media from WNYC Sundays it to Ninety One point five to your seat [noise]\nHey everybody this is really the faucet this is Krista hello this is Michael from spirit\nWe seem to Ninety One point five K. R. C. the music seven ... seven nights\nA week programming on Ninety One point five to your cc is supported by Colorado Ballet presenting the ... classic Sleeping Beauty October fifth through the fourteenth that the only Caulkins opera house with live music by the Colorado belly orchestra Colorado Ballet dot org\nSupport for the Ted radio hour comes from the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nFrom Elijah Craig family owned makers of small batch Kentucky straight bourbon whiskey he lives a crank bart's town Kentucky forty seven percent alcohol by volume Elijah Craig promotes responsible drinking and from the any Casey foundation\nHits the Ted radio hour from NPR I'm Guy rise and on the show today ideas about who we are what makes us us and according to a humorist say Frank in this short talk it's not that complicated\n... from Elijah Craig family owned makers of small batch Kentucky straight bourbon whiskey Elijah Craig barred stand Kentucky forty seven percent alcohol by volume Elijah Craig promotes responsible drinking and from the any each take the foundation\nIt's the radio hour from NPR guy rise and on the show today ideas about who we are what makes us us and according to a humorist as they Frank in this short talk it's not that complicated areas on the stage [noise]\nThis is the human interest\nA death to see if you are the human [noise]\nPlease raise your hand something applies to you [noise] are we agreed [noise] yes [noise] been let's begin [noise] have you ever eaten the Bulger long past your childhood [noise]\nIt's okay it's safe here [noise]\nHave you ever made a small weird sound when you remembered something embarrassing [noise]\nHave you ever purposely lower case the first letter of a text in order to come across as sad or disappointed [noise]\nHave you ever ended detects with a period as a sign of aggression\nHave you ever laughter smiled when someone said something to you and then spent the rest of the day wondering why you reacted that way [noise]\nHave you ever seem to lose your airplane ticket a thousand times as you walk from the ... to the gate [noise]\nHave you ever put on a pair of pants and then much later realized that there was a loose socks most up against us high\nHave you ever tried to guess someone else's passwords so many times that it lock their accounts [noise]\nHave you ever had a nagging feeling that one day we'll be discovered as a fraud [noise]\nYes it's safe here [noise]\nHave you ever hope that there was some ability you hadn't discovered yet that you were\nAnd then much later realized that there was a little sock smashed up against your thigh\nHave you ever tried to get someone else's passwords so many times that it lock their accounts [noise]\nHave you ever had a nagging feeling that one day we'll be discovered as a fraud [noise]\nYes it's safe here [noise]\nHave you ever hope that there was some ability you hadn't discovered yet that you were just naturally great has\nHave you ever have broken something real life and then found yourself or looking for an undue button\nIn real life [noise]\nHave you ever marveled\nAt how someone you thought was so ordinary could suddenly become so beautiful [noise]\nHave you ever stared at your phone smiling like an idiot while texting with someone\n[noise] have you ever subsequently texted that person the phrase I'm staring at the phone smiling liking idiots [noise]\nHave you ever been tempted to and then gave in to the temptation looking through someone else's phone [noise]\nHave you ever had a conversation with yourself and then suddenly realized your real [noise] see ourselves [noise]\nHas your phone never run out of the battery in the middle of an argument and it's sort of sounds like the phone was breaking up with both of you [noise]\nHave you ever thought that working on an issue between news futile because it should just be easier than this or this is supposed to happen just naturally\nHave you ever realized with very little in the long run just happens naturally [noise]\nHave you ever woken up\nBlissfully and suddenly been flooded by the awful remembrance that someone had left to you [noise]\nHave you ever lost the ability to imagine a future without a person that no longer was in your life\nYou ever look back on that event with a sad smile a bottom and the realization that futures will happen regardless\nCongratulations\nYou've now completed the test you are\n[noise] have you ever woken up\nBlissfully and suddenly been flooded by the also remembering that someone had left you [noise]\nHave you ever lost the ability to imagine a future without a person that no longer was in your life\nHave you ever look back on that have them with a sad smile a bottom and the realization that futures will happen regardless [noise]\nCongratulations\nYou've now completed the test you are all human [noise]\n\nWith writer and humorist they Frank [noise] got a couple of other great talks at Penn dot com on the show today what makes us\nUs [noise] can you explain what it means to be conscious like what is it [noise] consciousness is\nThe most familiar thing for any of us and we all know the difference between being conscious and not being conscious\nThis is an al ... he's a professor of neuroscience at the University of sex in the u._k.\nConsciousness as any kind of experience at all whether it's a visual experience of the world around us whether it's an emotional experience of feeling sad or jealousy or happy or excited or from the experiences of intending to do something or of being the cause is something that happens consciousness is the word that we use to sex inscribed\nAll the different kinds of experiences that that we can have [noise]\nI think that pretty much sympathy for conscious system there is something it is like to be that system whereas for something that isn't conscious [noise] better than [noise]\nAnd how consciousness even happens and if we can recreate it artificially it's a question that we're still trying to figure out because what's more fundamental about being a human then knowing we exist\n[noise] and also explains more from the stage [noise]\nWatching this question is so important because consciousness for each of us is all there is without that that's ...\nThere's nothing at all and when we suffer we suffer consciously whether it's three mental illness or pen\nAnd if we can experience joy and suffering what about other animals might they be conscious to do they have a sense of self and ask them teachers get faster and smarter\nMaybe they'll come a point maybe not too far away when my iPhone developed sense of its own existence now\nStage [noise] watching this question is so important\nBecause consciousness for each of us is all areas without that that's ...\nThere's nothing at all and when we suffer we suffer consciously whether it's through mental illness or pain and if we can experience joy and suffering what about other animals might they be conscious she did they say have a sense of self and ask them teachers get faster and smarter\nMaybe they'll come a point maybe not too far away when my iPhone develop for sense of it saying existence now I actually think the prospect for conscious I owe a pretty ...\nAnd the story I'm going to tell you our conscious experiences of the world around us and about sounds within it\nAll kinds of control to these nations\nWith free and because of all living parties [noise]\nUm I Love this idea of a controlled ... nation\nIs is that is that what we experience is that how we experience the world that it's\nIt's a control to loosen nation we are just essentially hallucinating all the time [noise]\nI Love this rise I Wish I could take credit for it but but I Can't but I Love the fries because\nIt points out that everything that we perceive consciously or unconsciously but let's talk about consciousness for now is a construction of the bright I mean it's easy to think that we are in our eyes and objective reality is revealed to us through the windows of our eyes yeah and what\nCountries perception is is basically just in somebody's sitting inside us go looking out there and they see a red table they see a passing\nA law again there's the batter writers ahead [noise]\nThat real reality [noise]\n\nThat's right but the truth is that whole perceptions are acts of interpretation that act\nOf informed guesswork that the brain appliance encountered sensory data I think that the way I can think of this is the end it there is no light in the sky on those nice sounds that\nWas going on in the brain or electrical impulses whizzing around a complex passing an out of all this oldest passing much in the in the Brian ...\nAppeared on [noise]\nIn some sense we we've known this for a long time since meats and it's been pretty clear that colors red yellow green seven colors and no object to properties\nAppliance encounter sensory data I think that the way I can think of this is that there is no line in the ... and I found that\nWas going on in the brain or electrical impulses whizzing around and complex passing an out of all the oldest passing much in the in the brain or world\nAppeared on [noise]\nAnd in some sense we we've known this for a long time so since meats and it's been pretty clear that colors red yellow green seven colors and no objective properties of objects in the world they are attributes", "show_name": "TED Radio Hour", "year": "2018", "city": "Colorado Springs", "day": "07"}