{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n[laughter]\n\n[noise]\n\nNa\n\nNa\nAnd\nAnd ...\n...\nMm Mm\nMm her\nMm\n\nWMA H H de to Biloxi WMA E. H. D. to boot WMA you a fee to view WMA O. N.\nThe two Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford\n\nGets the always come in and they made the eight on MTV music radio evening jazz with mirrored it\nGot to start off this eight o'clock hour with a jump for joy or any Andrew talked to some\nUm\n\nThe weather ran the crowd we got ...\nJunk yard\nDon't shoot great little ... how about ... they have been ... job wouldn't do\nJust the technical low mood maybe\nWhen you do hear about it I mean you know the same ... detail that go\nIs there other you're being scared and Joe ... Joe\nGod in God we live our lives out of the\nKnow if you leave all round round the movie when you don't do real work\n...\nJust the technical local news\nWhen you made me\nSense in the\n\nTo\nJust before that Ernie Andrews jumping for joy after the break a contemporary set that begins with North Carolina indigo enjoy drummer Liz Taylor up next\nWe're not double digit she comes from the Mississippi link each week the link has connected integrated make an urban rule in community news from around the two people of Mississippi and beyond and now it provides the daily news and even at the Mississippi link dot net to come to your were\nSupported this program is made in part by\nFrom sore throat and fevers and well maybe this is MORNING EDITION line Pierre ... medical has you've covered with one and thirty primary care specialty across the Japanese ... metropolitan areas near medical providers all share with your skin when my hands are welcome in all primary\nCare practice said they are actually appointments are ... ... S H ... n F you mean because there's an inconvenience [noise] oh\n\n[noise]\n\n\n\n\n\n\n\nThey don't feel\nOf [noise] oh\nGod [noise] I'm so\nHappy to be here but uh\nThis next all the you know we pay almost to the north Carolina jazz musicians because we have a huge body of them from North Carolina that contributed significantly to jazz music uh and this next song is titled seeker\n\nCool and courage W genius and impede the music radio\n\n\n\n\nAnd courage WG I guess you\nWould impede the music radio\nMind in good nature you know\nWhere you\nCome back soon goodness no no\n[noise]\n", "year": "2018", "show_name": "1A Plus", "city": "Jackson", "day": "26"}