{"month": "10", "state": "MS", "station": "WMPN", "content": "\nYeah\n\n\n\n\nWithin revival with the pasture from bees changing sky it went from the verbs making by showing her punk roots Margaret steep Jordan souvenir and\nTo me oh Ghouta suburbs with leisure from their latest garage sale flying the family stone with running away and it was the kinks\nWith acute schizophrenia paranoid and I had looked at went up and it was Nineteen Seventy one that originally came out this was a re master from more recently just a few years ago most will hillbillies legacy edition\nEverything's on the plane was shown number forty seven sixty seven at undercurrents radio dot net also a link there to the archives of under ... weekend if you missed the broadcast\nVideos social media contact information it's All right there under current radio dot net thinks door team Gabrielle Acosta line casino understand and Joe Yuri I'm Greg McGregor and support comes from the corporation for public broadcasting\nFrom the fringe of undercurrents and from envy one stations like like gee I D E n ... California in ... W E in wider it's Minnesota industry is native voice won\nThe Native American radio network\nFor Twenty years the world's ... looking forward to what's next in music and keeping an eye on the richness of the past I'm David dye would live interviews and music you need to know about I mean you may have never heard before but I sure did lob the world cafe of become Public Radio's Muslims who do popular music\nProgram don't miss our next show but I Do tend to be be music radio [noise]\n\nAll educators MTV has partnered with the secretary of state's office who's\nThis year's promote the boats initiative or help your students learn important lessons about civic engagement while having fun in the classroom this opportunity is for hatred twelve students across\nMississippi get the ... with a mock election plus are an essay contest for more information about promote the boat or just sign up your class or school\nAnd he'd be on line ...\nI'm an artist I liked the bank I'm a chef I like to go like to join us for how much about what this season from northern that Margaret St John wide waters and this week all power to power we are in vinegar [noise]\nI'll be paying even gone along and I'm just going to\nGo join us Thursday night about the pilot season three [noise]\nSo you're there on the ballot there than seven on in the TV\nStations have been ... be music radio R. W. M. A. H. Biloxi W MA boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and maybe start full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening\nOn MTV music radio and listen online at impede the online duck or gee\nOh All right it's undercurrents I'm Greg Mick vicar welcome glad we could be a true service provider music knew from Kevin mo between Roseanne cash giving up some dark Miller monsters of folks probably phonics brie and started off nice and easy now with Katie where once in a while\n\nAnd love ... well ... I had been\nWith the ... is the\n...\n... ...\n... upside down shattered ...\nOther ...\nIn my\n[noise]\nMm\n\n\nYou don't know me probably phonics free from yes it's true\nReally parole before that live or die for months and no more ... case the last line of Albion was Katie like once in a while\nIt's undercurrents on your radio David Crosby stills and let's turn now to which we artist from Texas this is Sharon Sharon where Joe me more\n... ... ... ... ... [laughter] [laughter] [laughter] well\nThank you\nHow\nDo you\n\n\nKnow me too\nMe too me too\n\n\nMe\n\nToo\nWell\nNo they\n\nWhen you know\nName brand new car\nAnd then they will lead you know\nYeah well we live while the\n\nOne man\nOne\n\nBall will be gone and one day you know let me know Ireland one day you know\n\nI\n\n\nMm ... please don't\nMe see me in ... in the\n...\n\n...\n\nKnow a day\nPower no\nAs they can maintain\nI used to\nWalk and ... na\n... stuff but no they don't get no down\nTo take\nIn trouble\nA ... a bushel grilling\nToday he\nOr she\nKnow gosh dang\nA concern and\nI'm not gas Reno I'm Reid accused I'd never been\nAll of the bag check and the reason why\nYes they leave his own review Keenan\nReally\n\n\nStreet down down in history will be going\nDown\n\nJohn's\n\n\n\n[noise]\n\n\n\nYou do [noise]\n\n\n\n\n\nThat we knew that they they\nMade the right\nBe you know where\nYou're\nAt the border\nVery big break that\nWe've got the there were the\nGirl that\nWe need to\nBe the\nThat they'll do it", "year": "2018", "show_name": "1A Plus", "city": "Jackson", "day": "11"}