{"month": "10", "state": "MS", "station": "WMPN", "content": "You're listening to jazz with neo pets are where we have time to squeeze in something from the fact opponent Ken ... his Neal bop quintet this is from the recording standing tall he called the somebody's got to do it\n\nThat's that's a nice leash season they set a kind of Neal hard Bob when that led by the tenor saxophonist Kenny thousands of them came out a couple of years ago and features the group that he's been recording with for the last couple of albums including Josh Renault on trumpet\nAnd Germans in at the piano called Guillain based Jason team and the drummer was the name ... you should keep the keep your ear out for or your eyes peeled to see or in any case you're on the lookout for him he's he's very good stew called somebody got to do it\nFrom Ken I Wonder what you heard here on jazz Neal has her which I'm Glad that you got to spend some of this hour with me on ending the proposition and where I Hope you'll return to\n[noise]\n\n\n[noise] the Jimmy Smith geo the mid fifties to move out there that were\n\nH H de to Biloxi WMA E. H. D. to boot WMA U. A. G. to view WMA oh eighty two Greenwood double you wouldn't be in ...\nTo Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nDo shrinks\nEdited and joining me well\nThanks going during gray jaguar WGN view that as well on MTV music ...\nLearning all these eight o'clock hour we the battle\nAnd my\n\n[noise]\nThe\nI mean here on MTV music radio that was monk's music trio with drink all tangled because lord that the ... with a family and we started off with a little music from Dr Michael White\nAnd now one song contemporary sat down chick Korea with the the gang band after the break Chinese butterfly\nCorner double digit she comes from the Mississippi link each week the link has connected integrated and communicated urban rule and community news from around the globe to people of Mississippi and beyond and now it's time provides the daily news and even at the Mississippi link dot net welcome to your work [noise]\n\nSupport of W chicken you comes from the corporation for public broadcasting unless there's like you and thanks for making programming comfortable doing\nI'm any time at W. J. F. U. dot org\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\nMm [noise]\n[noise] Mm [noise]\n\nCool and courage W J I guess you owe to impede the music radio oh\nNo no\n[noise]\nLife thing\n\nAnd\nHe\n... and there's no\nNo\n\nNo\nNo no I don't\nEven try to do is just\nTo\n\nPut up a big you\nKnow you\nKnow\n\nMm sure we want the ratio of kids getting clean\n[noise]\n[noise]\nThis is not like they tell\nRead no yeah\n[noise]", "year": "2018", "show_name": "1A Plus", "city": "Jackson", "day": "13"}