{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise] [noise] oh\nAll\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nWMA H H E to Biloxi WMA E. H. D. to boot WMA you a fee to view WMA O. H. D. too Greenwood couple you will be an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. too\nCooling current activity on MTV music radio welcome back\nIt's evening jazz emeritus Michelle where his album is eight o'clock hour and I've got a quick kind of view the look of love is a collection from the album what the world now\nHere's the McCoy Planetree I\n[noise]\n\n\nMhm mhm\nMhm mhm\n\n\nA\nCharity little collection from Sherman ruby\nFrom the faith album before that song for dad from then the ... and uh we started off with a look love from the McCoy tiny trio ... jazz orcas round the way right after the break\nKicking off our contemporary said is it is election from their twenty album\nFor piano movement for black kid strikes again that's the name of the election it come your way up next\nJackson State university would like to thank the sponsors for their support at students scholarships and you know the ration of its elected president and Dr William ... junior without your continue dedication anymore you would not comfortable\nI Will come your sponsors are doctors when staying at a multi platinum sponsors are nice to have ... percent diamond sponsored the lead banquet Kelly road builders Kelly natural gas pipeline Mr Darryl into burn highway\nHoward catching strength America licensure catching the Mr Mrs Kelvin in June hill Dr Willie as former senior and this is Tony\nYes there's farmers got the the L and goal to be frankly Mr loser and this is William ... diner in the end of the three ... and Mr Robert E a doctor unless you're in Norway or make a science by ... cars and trucks marketing Jackson State university and when you [noise]\n[noise] [noise]\n[noise] maybe\nBoom boom boom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom there I'm ... I'm a I'm I'm a little boom boom boom boom boom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom out\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] I uh [noise]\n\n\nDa\n\n\n\n\n\n\n\n\n\n\n\nAnd courage W. J. guests on M. B. B. music radio [laughter] Mm\n\n\n", "show_name": "1A Plus", "year": "2018", "city": "Jackson", "day": "03"}