{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n... [noise]\nNamed\nThe\n\nAnd\n\n...\n\n...\n... ...\n\n...\nE\n\n\n\nThat was long tall Dexter\nSophisticated lady from the art of the ballot and before that yours truly the Alexander from wild as to when we're feeling good Harrison banking on base Leon joins junior on percussion\nAnd prior to that starting everything off with the latest release from the white triple from inspiration with a very nice re arrangement with the world needs now is ...\nDidn't know what time it was then I met him [noise] oh what\nA lovely time it was a ... I met was\nI\nDidn't know what day it was you know how my\n\nMom like a month of may it was about to say it was\nA real live every ... every minute derby yards all alone [noise]\nTurned me off very odd touch here your or if they are all\nYour oh I didn't know what life was no fry I wanted\nTo love them here it was shining\nOut of your oh I'm well I don't know what time it is there some law then Don Don I'm no\n[noise] [laughter]\nOh what you look at the time oh would fly so fast when you're having fun and I certainly had a bomb to be with you Sharon this music I Hope you enjoyed it as much as I please let us know how you feel about it email that suggests network\nIt W. F. M. T. dot com look forward to being with you again we'll soon until then\nTake care of yourself this is Jay\nLeno [noise]\n[noise]\n\n[noise]\n[noise]\nWell ...\n... ... wouldn't lie glory and\nAs an adult standby amateurs you adjust to one of ... most famous hedge Dan I'm from a letter by being dangerous dying\nSwimming you're much too much and don't do very very ... the dictionary\nAnd so I'm borrowing a love song from the birds\nDo Jay you then you're a marvelous ... [noise]\n[noise]\n\n[noise]\n[noise]\n\nH H E to Biloxi WMA E. H. D. too ... WMA U. A. G. to be you'd WMA O. H. D. too Greenwood WNBA an HD too\nJackson W. M. A. W. H. D. tumor radiant W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford\nTo\nMove to\nMove to\nMove\nTo\nThe\n\n\n\n\n\n\nYes that was Gen su cola from lighthouse wherever read the whole wrong\nWith Jim su cola on trumpet influence on Rob Dixon or saxophone Steve alley or piano Mick Tucker on base skinny filters on drone\nThat was very nice and before that we had music from the deadly Owens airing rights than people calling\nAnd that was titled you'll run deadly on tenor Justin Stanton on trumpet will earn ... ... ... men were right on base clip wallet aren't drunk now we have music coming up from Abby Lincoln Abby's things Abby would last month\n\nGuys\n[noise]\nThen he\nMan\n[noise]\nThe\n...\n... [noise]\nYou\n... ... ... ... [noise]\nYou read the new train lawful [noise]\n\n\nThe line with your was\n\nHe\nTo lung cancer in\n...\n... [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\nI Dream of ... ... ... ...\n...\n\n[noise]\nWe show\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n... ... ... ... ... ... ... ... ... ... ... ... ... ...\n...\n...\n... ... ...\nWell welcome to the twilight\nYou can only go to Lou what your ...\nThey were\nSaying in ...\n...\n...\nBut meanwhile they're like stuff that I'm going to be\nHand here's ray ... then [noise] they\n\nAnd Manuel show\nMan [noise]\n\nThese strange now", "year": "2018", "show_name": "1A Plus", "city": "Jackson", "day": "02"}