{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\nAnd all the automatic observe ban goes or the wife your bar on American Audi Vogel star Billie Holiday\nOrdered by a royal regret the way where I'll get by [noise]\n[noise]\n[noise] and now we need to do I'm not really been man in\nThe [noise] made me that to me [noise] what [noise]\n\nI Know and you [noise]\n[noise]\n\n[noise] no\nI've never been I'm not going to remain [noise] out man middle of the main thing that is true but what\n[noise]\n[noise] I Know\nNineteen forty four and they need day I'll get by from Billie Holiday the chronological Billie Holiday\nThank you so much we're listening thank you for joining me today with this great music hope you've had a wonderful time I sure hope that you shared this music with your children because they are definitely listening and we do want to pass that onto them and I cannot thank you enough\nFor supporting live music the artist certainly appreciated and so do I so until we got together again please keep great music playing in your home in your cars in your offices or wherever you maybe\nYou would the Alexander and this is Jay than now reprisal from Bobby Hudson's now\n[noise]\n\n\n\n[noise]\nOoh\n[noise] ooh\n[noise] ooh\nNo [noise]\n\n\n[noise] [noise] thank you for listening you with the Alexander and this is Jay\n\nWMA H H de to Biloxi WMA E. H. D. to believe WMA U. A. G. tube viewed\nWMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. do Ackerman W. M. A. V. H. D. to Oxford\n[noise]\n[noise]\n\n[noise]\nTo see the milk and honey\nWell\nHey man you know for as\n\nFar as it is and then my my\n\n\nOh well no but\nBut somehow they are ...\n\n... ... oh they sent a\nLetter to Susan in my mind\n\nI I don't want to make money for\nI Know that leaves a green and they um they tend to ... well no don't comes\nAround [noise] so\nI Know just what to do\nAny and all the\nTime and [noise]\nI don't know a lot\n\nOf nice it's it's the main thing is\n\nDo we have just a no Lee's and slow\n\nTo lose a man I\n[noise]\n\n\n[noise] [noise]\nNot well may cheese I\nKnow that ... Rodriguez [noise]\nOn the uh the right now you know when all the time comes around [noise]\nI Know I just want to [noise] to me\nAnd I'll see Santa\n... [noise]\nKnow I don't know\n[noise]\nI don't know\nDo we have\nA ... [noise]\nTo the movies and then\n\n\n[noise] so sue me Loren some violent from her latest the window with a beautiful treatment of Stevie Wonder is classic vision and she's accompanied by some women for dinner on piano before that we heard from\nDetroit Jim city dedicated to the memory of Detroit's jazz tighten markets bill great from Nineteen thirty six to two thousand Fifteen and that was a Marion Hayden composition the I'm crowned king next step we have the latest\nFrom a young man stew men demand woven threads and it's remarkable how people in places from once passed me become intertwined down the line\nHe grew up as a toddler in Chile and as an adult he revisited chili became tied to the culture and decided to embark upon a project celebrating its musicians and legendary word Smith on this latest recording woman ran\nHis father took a job with the symphony orchestra in Chile and the family moved there for several years and he was too young to have received much direct influence he did go accustomed to hearing the sounds of Chileans folk music\nFrom the records his mother and father brought home and he began learning Spanish I'm close family France they spent\nI grew up to become a busy composing arranging and producer and most notably he works with curtailing branch Marcellus Antonio than she hears from his latest album ... featuring the gals and um\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] worry\nAbout me [noise]\nBy all get along for\nForget about the you know we have three of them are\nMay and that are liberal\nAnd now the ... [noise]\n\nWay [noise]\nAnd we will remain friends [noise]\nShould be the rule\n\nDrove your car\nThrough memory you\n\nA rating wise\nStreet [noise]\nIf you\n\n\n\nThey do you why stop may be\nSee [noise]\nDo worry\n... maybe [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise] or her Davis's Chicago Jess he'll her money chamber ensemble sketches were paid deal mandatory before that the music of the Count Basie orchestra directed by Scott Barnhart featuring curtailing on don't worry about me\nTake a listen to a gym gallery does Jan string quintet ... featuring the local sheriff we'll see what the Joni Mitchell classic river\n\n\n\n\nCome in\nThey can do to bring\nPeace\nThe snow days\nHe\nHas really\nOh no she she\n\n\nGets really", "year": "2018", "show_name": "1A Plus", "city": "Jackson", "day": "16"}