{"month": "11", "state": "MS", "station": "WMPN", "content": "\nNa\nNa na na\nNa na\n\nNa na na\n\nNa\n[noise]\n[noise]\n\n\n\n\n\nWMA H H de to Biloxi\nWMA E. H. D. too ... W we make you a fee to view WMA O. H. D. too Greenwood WNBA an HD to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford\nThis hour of jazz on W. J. su it's underwritten by a A R P of Mississippi beat the different vote\nAny main welcome back to your evening jazz on FM eighty eight point five on MTV music radio I'm married and Michelle\nWe're going to go ahead and kicked off a jazz station oh eight o'clock hour with a with a dog then at the civil way from the release burn up the quiet\nMusic from me in it\nWent by Jeff Keizer on on this album\nThat was released in Nineteen Ninety eight ... we've got by wrote that piece to Iran drum\nWe've got a Mr Christian McBride good but your\nKeys that are of course the piano and open up a civilized Arkansas [noise]\nMm Mm\nMm\nMm\n\nMm Mm\n\nMm Mm Mm\n\nMm\n\nMm Mm\nMm\nMm ha ha\n\nHa\nHa ha\nDaylight time Thursday marks includes the following parishes Louisiana Madison and catch all remember\nA tornado watch means that conditions are favorable for the development of severe weather including tornadoes large shale any damage you when you close to the Washington area while severe winter may not be versus\nShould remain alert for rapidly changing weather conditions and listening for leader Steve Lynch impossible wanting to genuine weather radio commercial radio and TV outlets for Internet\nSources for the latest severe weather information [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\nGood had that same Kurt Meyer from the high and low album this forward that peonage\nCyrus chats not smoke on the water from his new release and title kaleidoscope\nAnd we started off with a another pianist Mr jak Keizer John show mark on the way this contemporary sat begins with Audrey code don't go anywhere more great jazz continues up next supported this program is made in part by\nFrom sore throats and fevers and overwhelming more specialized care mirrored health medical has you've covered with more than thirty primary care it's\nActually run across the Jackson ... metropolitan area you're married he'll medical providers offer share with your schedule one mind walk ins are welcoming all primary care practice in the next day appointments are ... asked me or at least eight more boring M. F.\nYou may or June because there isn't there an inconvenient and you need\nSupport of double each interview comes from the corporation for public broadcasting unless there's like you and thanks for making programming comfortable pledge online anytime W. J. F. U. dot org\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\nMm\n\n\n\n\nCool and courage W. J. su on MP be music radio\nHa ha ha ha ha ha ha\nTitle track from the album dig in the day that's Marcia hate and the project a love Randy Johnston just before that on the jump back\nWell hope your holiday or you know for those that acknowledge it has been a pretty decent we're going to go ahead and take a look at\nThe rest of our forecast for this evening and I know during jazz Monday Mornings I talked about the possibility of some rain\nI'm Around nine or ten o'clock looks like that's been pushed back to our very early am hours about two and three o'clock in the morning so our overnight hours\nWe should be expecting that rain to move on and which is I mentioned this morning we'll drop those tips Thursday's high expected to reach sixty eight with a low of forty nine so hope you didn't", "year": "2018", "show_name": "1A Plus", "city": "Jackson", "day": "01"}