{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\nYeah\n\n\nMm [noise]\n\n\nWasn't revival what's the pasture from these changing sky you went from the verbs making by showing her punk roots Margaret steep Jordan souvenir and to me oh Ghouta\nSuburbs with leisure from their latest garage sale flying the family stone with running away and it was the kinks\nWith acute schizophrenia paranoid and I had to look at when I was Nineteen Seventy one that originally came out this was a ringmaster from more recently just a few years ago most will hillbillies legacy edition\nEverything's on the plane was shown number forty seven sixty seven at undercurrents radio dot net also a link there to the ... under comes weekend if you missed the broadcast\nVideos social media contact information it's All right there under current radio dot net thinks door team Gabrielle Acosta line casino understand and Joe Yuri agreeing with vigor and support comes from the corporation for public broadcasting\nFrom the fringe of undercurrents and from envy one stations like like G. I. D. E. N. ... California and take a W E in wider it's Minnesota yeah just is native voice want the Native American radio network\nFor Twenty years the world's ... has been looking forward to what's next in music and keeping an eye on the richness of the past and I'm David dye would live interviews and music you need to know about I mean if you you may have never heard before but are sure to lob the world cafe become Public Radio's most listen do popular music\nProgram don't miss our next show\nThat I Do tend to be be music radio [noise]\n\nAll educators NPD has partnered with the secretary of state's office who's this year's promote the voter initiative to help your students learn important lessons about civic engagement while having fun in the classroom it's opportunity is for hatred twelve students across\nMississippi get the ... with the ... election plus are an essay contest for more information about promote the boat\nOr just sign up your class or school\nThat MBBS online ...\nI'm an artist I like the bank I'm a chef I like to go like to join us for how much about what this season from northern\nMargaret St John wide waters and this week all power to power we are in business [noise]\nI'll be probably never gone along and I'm just going to be [noise]\nYou know join a Thursday night about the pilot season three\nSo you're there how metallic history than setting on MTV how did you\nThe stations have been P. B. music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening\nOn MTV music radio and listen on the line at him be be online duck or gee\nOh All right it's under currents I'm Greg Mick vicar welcome glad we could be a true service provider music knew from Kevin mo between those and cash giving up some Derek Miller monsters of folk probably phonics brie and started off nice and easy now with Katie where once in a while\n\nThey love ... well ... ... I had been\nWith the ...\n... ...\n... upside down ...\nOther acts the ...\nAnd my\n[noise]\nOoh\n\n\nYou don't know me wholly phonics free from yes it's true\nReally Pearl before that leaves die from Baltimore legal case that last line of albio was Katie like once in a while\nIt's undercurrents on your radio David Crosby Georgia yeah must turn now to which we artist from Texas this is Sherry drugs were Joe me more\n... ... ... ... ... ... [laughter] ... well ...\nThank me\n\n\n\nMe\nMe me\nMe me\n\n\n\n\n\nAll\nI Know there\n\nNo\nNo no no\nNow do\nThey need you\nYeah well we live and why\nThey want\nTo\n\nWe\nWill be gone and one that you know well now me darling one day you know\n\n\nI\n\nSay\nJill ... we do\nThe major ... sees the\n...\n\nMm Mm\nMm Mm\nMm no who does they\nPiling yeah\nI've got have been there that are cheering maintain\nWalking past the mad\nAt you know just stuff but you know they can get down\nShe she could be some show\nIn trouble\nI Know was that question is a shovel religion with\nToday he\nBeat the\nNets gas tank\nA concern in in\n... I'm not yes Reno I'm Brita\nHaji ...\nAll the bags of chips and\nThe reasons why\nYes the leaders are on the beach you can\nSay\n\nHistory about history and these are going\n\n[noise]\nJohn\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nThe way back you know a big game they\nRaised the bar you\nWould call me back to where\nYou're\nAt the border\nA very big on the brink that\nGo we've got the birds were\nGirls that we need to\nBe the\nThe", "show_name": "1A Plus", "year": "2018", "city": "Jackson", "day": "10"}