{"month": "10", "state": "MS", "station": "WMPN", "content": "Yeah\n\nAnd\n[noise] Mm\nMm Mm\n\n\n[noise]\n\nMm\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[laughter]\n[noise]\n[laughter]\n[noise]\n[noise] [noise]\n\n[laughter]\n[noise]\n[noise]\n\n\n[noise] [noise]\nI didn't know what time it was then I met Darren oh\nWhat a lovely time it was a slow but I met was\nI didn't\nKnow what day it was you know well my\nMom\nLike Vermont maybe it was a dog today it was\nGreat to be a lot of your mind blurry yo yo\nYour ... your your your or they are all your old I didn't know what do you live what no\nRight I Want\nTo love them there it was shining out of\nYour um well I don't know what that is why I don't know\n[laughter]\n[noise] Tony Bennett I didn't know what time it was before that I see a ... year and the children if you return to the black ... with before you go thank you for joining me you with the Alexander and this is Jay\nMhm\nMm mhm\nMhm mhm\nMm Mm\nMm\nMm Mm\n\nH H ... to Biloxi WMA E. H. D. too ... W we made you a G to viewed WMA O. H. D. too Greenwood WNBA an HD to Jack Shit\nW. M. A. W. H. D. too Meridian W. M. A. D. H. D. too Ackerman W. M. A. V. H. D. to Oxford\n[noise]\nThe the the ...\n[noise]\nGet the the the the the the\nThe news at the\n\nMan\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] the B. B. B. B. B.\n\nB.\nB. B. B. B. B. B.\n\nB. B. B. [noise] to be [noise]\n[noise] [noise]\n[noise]\nTo\n\nJulian ... from the language of true ... high priest\nAnd before that a very nice version of Michael Jackson's all wow\nPerformed by the real I may performed in recorded deadly poison Rouge and New York I'll just sixteen to down to the next step is now and go from two world featuring yum all knowledge with with the title track to well enjoy\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n...\n\n\n\n\nMm\nMm Mm [noise]\n[noise] [laughter] [noise] na na\nNa na na na na\n\n\n\nA I'm a [noise] [noise]\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] oh [noise]\nOh that'd be no\nCalled oh no no we ain't\nNo come on out\nThere ... paying\nThe daddy down get auto [noise]\nThe same time\nThey have on much\nKnow the bees [noise]\nShedding any [noise] they don't ask\nThe daddy down his op\n\n[noise] ...\n\n\n\nReally\nYes all\nThe daddy down\n\nOh what a wonderful memories for my mom playing or music on her stereo or high by as they called it back then the wonderful boys so as the silver\nFrom and I love him with his on them and before that the latest from Marcus Miller laid black and that was\nThe blue many bunnies dream featuring the voice of John in next music Mr Jared Gold on him in these three\nFrom his latest reemerge and you know may [noise]\n\n\n\n\n\n\n[noise]", "year": "2018", "show_name": "1A Plus", "city": "Jackson", "day": "23"}