{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n[noise] [noise]\n[noise] [laughter]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\n\n\n\n[noise] [laughter]\n[noise] [noise]\n\n[noise]\nMm [noise]\n\n\n\nWall\nTo\nOoh\nMe from\nOr a mom\n\n\n\nYou know\nHe\nWMA H H due to Biloxi WMA E. H. D. to boot WMA you a fee to view WMA oh actually to green would be an HD to Jackson\nW. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford\nMaxine that when you see the jazz they are going to turn off the eight o'clock hour which ten ten ... from David Sanborn let's just from the from the musical relief wells they're airing wellbeing followed down do any way or the evening jazz\nPower\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDa\n\nDa da da da da\nDa\nDa da\n\n\n\n\n...\n\nCool and courage W genius on MTV music radio [noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nFlip cam some very good for for that very well the only Christian fans\nTo kick off our contemporary that don't go anywhere I've got music from the album reach a bird they're rather the E. pi not from his facing dragon CB that is reaching for the sun and it's live from this ... not ... actually\nAfter the break you keep it that it's a good thing or set up next\nTime you had your lab jazz we Cajun today\nI Do more schools to Latin jazz on Jae su joined me for musical jazz ... little sounds and harmonies Latin America the Caribbean Europe and the United states will travel into the jazz world jokes and ... and many more\nLatin to drag him Monday through Thursday only here on cooling W. J. N. [noise]\n\n\n\n\n\n\nLet's do much good tree from the Adam Schneider banned before that we enjoy the little Christians than hell about living in now ... after the break\nTabs on W. J. as you are under written by English ship building impact global metric tippy\nAngles as an equal opportunity employer hiring in the trees in the machine that ship hitters high critters and pipe welders positions are union representative information at eight nine three by one by goes for the English website at hunting them angles dot com slash careers\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n", "year": "2018", "show_name": "1A Plus", "city": "Jackson", "day": "31"}