{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n\nMhm [noise]\nAnd\n[noise] [noise]\n\n[noise]\n\n\n\n\nThat's trumpet R. T. I'm Harold you may have heard him and seen him in the Miles Davis movie that Don Cheadle wrote and directed and start in\nA couple of years ago this is from Catherine Harold album called magician you as in music G. I. C. I. A. N.\nAnd also featured a tenor saxophone market Strickland and the piano worker shed Rick Mitchell and before that the latest from the British saxophonist Courtney Pine his album is called black notes from the deep features the vocalist Omar\nAnd your heard them All right here on jazz Whitney Neal tester remember of you want some information about something you've heard or you want to discuss it a little further it's easy to get a hold of us or me in particular\nAnd you can do that by writing to me or any of my jazz network colleagues care of this radio station we'll hope to hear from you meanwhile the text up to the top of the hour your skills Scott heron\nWe get a lot of requests for all our commas generally during interviews and just said er about oh about what people should wear and where people should do how people should carry on um we'd like to make one small comment on that oh the name of the form is witty\nAnd um we'll let the titles stand for itself is would you\nMhm [noise] mhm [noise]\n\nStill your mind when you hit rags Nineteen when a man drags on very very proud of them that they were also a man to sit with you [noise]\nBlack woman but mother\nBought him they shouldn't have ... ... ... top from Komen brush that's no bought mob from Saturday Night dome to block them pay resembling electric shock the woman\nThat brings us to talk with you [laughter] baby we do the kinds of solve not well we're glad robo crowds were all a dog as long as we all did you get your [noise]\n[laughter]\n[laughter]\n\n\nWMA H H de to Biloxi WMA E. H. D. to boot WMA U. A. G. to viewed WMA O. H. D. too Greenwood WNBA an HD to Jackson\nW. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford\nJackson Lee always movie out with her and ask them any eight on MTV mood radio American Michelle eight o'clock and ready to start to that [noise] you know about that\nDon't be afraid\nTo go out afraid to\nHere's the Lincoln Center ...\n\n\n\nNa\n\nNa na\n\nNa\n[noise]\n\nNa\nNa\nNa\n\n\n...\n...\n\n[noise]\n[noise]\nThat the election from Todd markets was an intersection of change or don't be afraid the clown the afraid to from the jazz at Lincoln Center orchestra\nAnd now I've got a contemporary that that begins with a night insomnia here is that Meg Cora and the pan Asian chamber yeah\nI'm terrible support our double digits you come from the Mississippi link each week to lake has connected integrated make an urban rural and community news from around the globe to people of Mississippi and beyond and now it's quite provides the daily news and even at ... it'd be like dot net to come to your work\n\nWhether ... W J ask you a underwritten by Engel ship building empires Google metric tripping\nAngle for equal opportunity employer tracer machinist shepherd's pie critters card welders positions are union representing information at eight nine three five one five goals for the eagles website and causing them angles dot com slash careers\n\n\nMm Mm Mm\nMm [noise] [noise] [noise] [noise] [noise]\n\n\nNow\nThe and Asian jak\nChamber jazz ensemble before that with a night insomnia back on into a traditional sat with music from Frank Morgan all the way here's little walk up next [noise]\nWelcome to Jackson State university's College of Science Engineering and technology to call him ceased to provide excellent education and research by offering a variety of B. S. M. S. N. P. H. D. degrees this effect produced is highly competitive graduated in the field of science technology engineering and mathematics\nAll volunteering to be recognized nationally and internationally as a leading prepare outstanding men and women scientists for more information on the state or the state of excellence for stem education six of one Ninety seven nine two one five three Jackson State university [noise]\nA blues man any countries you can do to curb Eugene and she was five on your ... to ... dot org ...\nFrom ...\n...\nMm Mm\nMm Mm Mm\n... ...\n...\n\n... ... ... ...\n... ... ...\n...\n... ... ...\n...\n[noise]\nBoom\n\n\n\n[noise]\nMm\n\n\nCool and courage W genius on MP be music radio\n\n[noise]\n\n\n\n", "show_name": "1A Plus", "year": "2018", "city": "Jackson", "day": "20"}