{"month": "10", "state": "MS", "station": "WMPN", "content": "Look me in um the recorder\nFrom a recent album called the whistle blower\nThe button accordion as Richard Kelly I Know with any Lewis on organic ...\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\nThat's the French or get it at least with the French accordion that Richard golly I don't know the ... face to face Richard ... plays the button accordion which is laid out differently from the accordion you've seen it weddings in bar mitzvah was\nAnd he plays the heck out of it you're listening to jazz with Neal tester [noise]\n[noise]\n[noise]\n[noise]\nIt's Howard Johnson on any [noise]\nTalking about miscellaneous instruments in this hour\nAnd Howard Johnson's name often comes up in context with does\nBecause she has always played the tuba in addition of a baritone sax\nAnd the two but it was often considered a an instrument unusual when jazz at least since the Nineteen thirties\nIn fact our Johnson on this album leads a band up to ... that was kind of miscellaneous group\nCalled the testimony but on this one track is playing the penny what's your improvising on a child's toy and\nWell I'm impressed [noise]\nWMA H H E to Biloxi WMA E. H. D. to boost the double you may you a fee to viewed WMA O. H. D. too Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too\nFreudian W. M. A. D. H. D. too acrobat W. M. A. D. H. D. to Oxford Jackson than any going by the whole thing is when you only can be music radio on there and you don't show all\nThe little contemporaries labor law don't worry at all the way in traditional\nThey're going to kick it off with the McCoy diner trio the loan to be on the net\n\n\n\n\n\nWho\nAnd courage W genius on MTV music radio [noise]\n\n\n\n[noise]\n\n\n\n\nThe only school and Karen W. J. F. C. on MTV music radio this contemporary sat wrapping up with sunny that selection from Carl ... and the Jimmy jazz band the Toronto jazz orchestra yes before that\nSo you know Walton now but selection smoke gets in your eye is after the break\nJackson State university's College of education and you would development and had an ongoing mission to educate the teachers and school leaders and related personnel with the best practices and\nOffer the variety degrees from doctors did on tour all the colleges university leader student enrollment online degree programs and proudly partners with us prep National Center for educated preparation transformation\nInformation with a college education with development six one nine seven\nNine two four three three or four Jackson State university [noise]\nMm Mm Mm Mm\nMm Mm\n[noise]\n[noise] [laughter]\n\n\n[noise]\n[laughter]\n[noise] four to ...\n\n\n\n\n[noise]\nMm Mm\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\nMm Mm\n[noise]\n\nMm [noise]\nMm\nMm [noise]\n\nCool and courage W J I guess you could impede be music radio\n...\nThing\n\nTo do that", "year": "2018", "show_name": "1A Plus", "city": "Jackson", "day": "06"}