{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\nYeah\n\n\n\n\n\nWithin revival with the pasture from bees changing sky we went from the verbs making by showing her punk roots Margaret steep Jordan souvenir and to me oh Ghouta\nSuburbs with leisure from their latest garage sale flying the family stone with running away and it was the kinks\nWith acute schizophrenia paranoid and I had looked at went up and it was Nineteen Seventy one that originally came out this was a re master from more recently just a few years ago most will hillbillies legacy edition\nEverything's on the plane was sure number forty seven sixty seven at undercurrents radio dot net also a link there to the archives of under ... weekend if you missed the broadcast\nVideos social media contact information it's All right there under current radio dot net thinks georgine Gabriella cost alone Christina understand and Joe Yuri agreeing with vigor and support comes from the corporation for public broadcasting\nFrom the friends of undercurrents and from envy one stations like like gee I D E n ... California in ... W E in wider it's Minnesota and just say this native voice won\nThe Native American radio network\nFor Twenty years the world cafe if they're looking forward to what's next in music and keeping an eye on the richness of the past and I'm David dye would live interviews and music you need to know about I mean if you you may have\nNever heard before but I sure did lob the world cafe has become Public Radio's Muslims who do popular music program don't miss our next show today to tip on M. B. B. music radio [noise]\n\nAttention all educators MTV has partnered with the secretary of state's office who's this year's promote the boat initiative to help your students learn important lessons\nAbout civic engagement while having fun in the classroom it's opportunity is for K through twelve students across Mississippi gets an engaged with the ... election plus are an essay contest for more information about promote the boat or just sign up your class or school visit MTV on line ...\nThis is Ari Shapiro host of all things considered by the time you turn on our show in the afternoon you've probably seen headlines maybe you've written tweet you might have heard a newscast so we want to tell you more than just what's happening we want to give you reason why things are happening in the context around what's happening\nWe want to tell you something that will stick with you while you're driving home or making dinner all things considered listen every afternoon daily at board on N. B. B. big radio\n\nStations have been ... music radio R. W. M. A. H. Biloxi W MA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe start full W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online duck or gee\n\nOh All right it's undercurrents I'm Greg Mick vicar welcome glad we could be a true service provider music got new from Kevin mo between those and cash giving up some Derek Miller monsters of folk probably phonics brie and started off nice and easy now with Katie where once in a while\n\nAnd love ... well I was living in ... I had a man\nWho was the ... the\n...\nWho's upside down shattered ...\nOther ...\nIn my\n\n...\n\n\nYou don't know me wholly phonics free from yes it's true really burrow before they leave die from Baltimore legal case that last line of Albion was Katie way once in a while\nIt's undercurrents on your radio David Crosby stills and let's turn now to which we artist from Texas this is Sharon Sharon where Joe me more\n... ... ... ... ... [laughter] [laughter] well I\nThink\n\n\n\n\nWe need\nWe\n\nNeed\n\nA\nNew\nSchool\nKnow they\nHave\nNo\n\nNo no no\nNeither\nMe me too\nMm Mm yeah well we live and why the\n\nOne man\nOne\n\nBall will be gone and one that you know me darling one day you know\n\nNo\nNo no\n\nNo I don't mean dogs\nPlease let me\nLet me see me in ... when the\n...\n\n[noise] [noise]\n\nNone of the day\nPiling a\nI've got have been a show that I can maintain\nHis used to\nWalking past the na\nGet Jill normal stuff but no they don't get no doubt\nThe sheiks so sharing\nManager of old\nI Know was that last year and a show of\nDay he beat the\nGas tank\nA concern in Maine\nAnd I'm not gas or you know I'm ... I Know\nAll the bags of chips and the reason why\nYes the leaders are home\n\n\nShame\n\nMinistry down down down\nDown\n[noise]\n\nWow\n\n\n[noise]\n\n\n\nThe\nThe U.S [noise]\n\nDa\n\n\n[noise]\nWay back to not be\nThat way but we were both for me to\nDo the New York\nAt the border\nA very big moment to break the back\nWe've got the there were the well\nGirl that we need to\nBe the rules\nDon't do it", "show_name": "1A Plus", "year": "2018", "city": "Jackson", "day": "12"}