{"month": "10", "state": "AZ", "station": "KTAR", "content": "I now might be the time to think about moving your rental property in getting to a cash out positions see the market is it an all time value high and who knows where it may end up in just a short amount of time\nInterest rates are creeping up and housing shift could be lurking choices experience and getting the absolute most amount of money for your rental property\nProfessional to do it right and especially caring for your time it is a process which means everything for you as an owner and your tenant as well Carol can get your top dollar call the expert on this Carol Royce it forty seven seven six fifty two thirty one\nThat's forty do seven seven six fifty two thirty one or Carol how's the buyers dot com bats Carroll has the buyers dot com\n[noise] a A R I found when dealing with these Arizona's news ADA already we asked them\n[noise]\nABC John show Monday in Miami's first time scheduled for suspected package bomber to face a judge\nHe was arrested this morning north of Miami says ABC's ... some\nWitnesses say fifty six year old Caesar say I was in line at this auto zone store in plantation Florida when FBI agents rushed in and took him down\nHe wasn't yelling and screaming boiling it was it adds up to the way was escorted to the vehicle so I'm getting with no problem\nUm and he just had that look of [noise]\nOkay it's over federal investigators tonight are describing a domestic terrorist with a political chip on his shoulder\nSay white fantasies windows covered in pro Trump anti Democrat anti media stickers FBI agents FBI Director Christopher Wray saying of the mail bombs addressed a prominent Democrats another Trump critics\nSo we're still analyzing the devices in our laboratory these are not hoax devices President Trump says his\nRhetoric sought to blame but the media is about three thousand strong mostly Honduran migrant caravan traveling through Mexico hundreds of miles from the U.S border ABC's markets more with\nThem one man from Honduras he's Twenty years old his plan was to hop onto a train I Believe will pass through out the guy\nAnd that train known as alive as the on the beach [noise] um and if you follow the immigration issues he likely heard about this train that a number of migrants will hop on illegally hoping it will be an easy route to the ... not\nGiving up in a new court filings Stormy Daniels and her attorney are opposing efforts by Donald Trump banned Michael Cohen to have the case dismissed\nThis is a case involving the nondisclosure agreement that was put in place to prevent Daniels from talking about the one hundred thirty thousand dollar payment she received the president's attorneys are no longer contesting claims that the NBA is invalid and they want the case dismissed as moved\nBut Daniels team is arguing the case should move forward and said they want the president depose or Alex Stone you're listening to ABC News\nArizona's [noise]\nT. A. R. blond hair and Ninety two three FM online at Katy A. R. dot com screaming live on the T. A. R. news after your breaking news in traffic\nAnd said oh two Catholic line and here's our top story Arizona votes almost one hundred thousand early ballots were submitted today this\nParticular day of reporting marks the most narrow gap between the Republican and Democrat ballots that we've seen since we began reporting on the fifteenth\nGarrett archer with the secretary of state's office says democratic ballot world full point higher today than yesterday and if this trend continues the gap between Barney's could get into the single digits KTLA our eyes on education the Arizona Supreme Court\nSays it blocked the invested in that initiative from being on the November ballot because proponents\nSought to boost taxes on the rich but they didn't say how much it would increase taxes rather taxpayers\n... panel said also misstated how much the taxes of high wage earners would go up we\nAbsolutely disagree that that was either the intent or even in the language this was something that the opposition an idea that the opposition through with this\nShow Thomas with Arizona Education Association says the invest an ad and she did would embrace six hundred Ninety million dollars for public schools I Am a survivor of domestic violence sets her back in ... at last night's domestic violence awareness event held in ... park\nNelson told her story surrounded by dozens of people there were honoring those survivors and those last two abuse\nI was looking at a man that I didn't recognize and I felt like he forgot who I even was his temper boiled over and that is one of the threats start at and if I tried to leave him he would kill me\nNelson as a speaker an activist helping educate others and how domestic violence\nSorry that and if I tried to leave him he would kill me Nelson is a speaker an activist helping educate others and how domestic violence can affect victims who are in that situation\n[noise] now for check on traffic here is Tom Tucker line from the valley Chevy dealer traffic center Cathy\nI Seventeen has been having a bad\nDay all day and now we have two new ones I Seventeen north bound after Glendale right lane as blocks with a crash\nAnd the new collision I Seventeen south founded Indian school that one is blocking the right to ...\nWe have a serious accident in Chandler as well McQueen at occupy Tio\nWe want to use queen creek or maybe Arizona avenue to avoid the area traffic is sponsored by on bounds out or a girl in Kenya dreams of becoming a doctor an elder in Guatemala dreams of being part of a community reach out and change their world and it will change your own unbalanced dot org I'm Tom Tucker Kate T. A. R. news\nCame to the air weather for the valley tonight clear in ... sixty two tomorrow sending a hive Ninety Sunday sunshine lots of it high Ninety One\nRight now Seventy five degrees over in ... by Howard error whether ... however there\nI'm Cathy Klein on Arizona's new station Katie a our news [noise]\nDave Ramsey here I have a great tip on how to save money now\nGet yourself a kinetic co water system the only non electric whole house water powered hybrid on the market it not only filters your water but softens it to Connecticut reduces your cleaning supplies by up to Seventy five percent and cut your electric bill on water heating up to thirty three\nPercent you'll spend less time cleaning soaps gum\nLine scale and spots on glasses and silverware plus and extend the life of your appliances that use water up to fifty percent and protect your expensive\nPlumbing and fixtures look you're paying for kinetic system now\nAnd don't even have one so get a kinetic system today and start saving\nMoney I trust these guys Connecticut was founded in Nineteen Seventy and has an a plus rating with a bb called six to nine one sixty five Seventy or visit kinetic co pays the dot com and mentioned Dave since you for the best possible offer\nArizona's news stations here you are free [noise]\n\nIndependent and thought as punk rock in life\nIt's the best in show\nNationwide investigation of enormous scope\nOf the greatest for our investigation ranged from New York to Delaware to Marilyn ... district of Columbia to Florida to California\nYes and they finally caught him I give you one time that I say\nIsn't it right Caesar say that's it will say it again fifty six\nFailed chipping details dancer body weight lifter I cater a Native American uh\nHe's just the guys who ... his family has said that he is a lost his mind uh I think his cousins that he's lost soul who has a has really rage basically and its rotted his brain\nA but a definite supporter of the old Trump stir there but living in the van\nDown by the auto zone\nAnd it was quite the van and posted pictures of it on the ... and show and you could check it out also on Facebook ... Joe\nHe's crazy is is I'm going to go with he's mentally not all there that's what I'm going to say uh and that he took the rhetoric that's out there\nAnd came hard and you know what's funny is\nNobody wants to take any responsibility so the media wants to know responsibility and they want to be able to go and say all the things they want to say about Trump because they don't like him or his policies and all those kinds of things Trump wants to say that I've done all these amazing things as far as I've toned down which is one of the things he said the day\nWell I think I don't\nBecause as you know the media is an extremely unfair to me that the Republican Party [noise]\nYeah well I mean the times they have been a but there's also some fairness there but they go overboard because that's what ... that's the way I have to do anymore right we no longer can have and some of it as us\nPart of it is we can't have a a a ... we we can't have a normal conversation or some sort of the debate that's kind of a little bit deeper because\nWe live in a soundbite world and on top of that you've got to be above\nThe noise meaning you're noise has to be louder than everybody else's noise nobody's going to pay attention because we've become so desensitized to so many things it's almost has to be\nIt has to be louder than everybody else's noise nobody's going to pay attention because we've become so desensitized to so many things it's almost has to be like a train wreck right in front of you\nFor anybody to pay attention\nAnd that's kind of our fault but everybody's got a part to play I sure more than a few occasions I've been doing this for\nThat unfold you I'm sure more than a few occasions I is that stuff that that that that I put a little mustard on if you will a little bit harder than I should have pushed to uh not much of a conspiracy guys I won't go there but I'm sure that on more than a few occasions or anybody who's ever been in any of these businesses absolutely\nWant to hear from your three two three five three eight twenty four twenty three at checkpoints and show is your Twitter Jason Vorhees Michael Meyers a crutch for the black lagoon Godzilla let us know take the fall that she had been to Joe hey great organizations out there like a Mac who are out there and you're half\nFighting for things like a you know I don't know middle class tax cuts and keeping them around fighting for small business owners and they're doing it in a way that's incredible and the benefits that I ... and more and more you are texting me say man these benefits are incredible a retail restaurant hotel discounts all of these things are available to you\nWith a Mac and here's the great thing if you're over the age of fifty\nAnd you're looking around right ... Medicare is getting ready to have open and Rome and people are confused about this and they don't know what to do they've got people there that will help you dedicated you'll get your own dedicated personal help you walk through\nThese things and I'm telling you it is incredible what they are able to do for the benefits the political advocacy that's what a Mac will do for you they are going to let you join for free it's on me oh you have to do is go to a Mac us forward slash chat A. M. A. C. dot U. S. forward slash chat a Mac ... us forward slash a make us better for you better\nFor America ... shows your Twitter C. H. A. D. B. E. N. S. O. in its ... Joe\nWhen it comes to job hiring their job sites that send you tons of wrong resumes to sort through that's not smart you know what else is not smart using your relatives to fill a network while you're looking for staff when it comes to life you know was not smart making the lottery the centerpiece of your retirement plan\nBut you know what is going to zip recruiter dot com slash Benson to hire the right person ... recruiter doesn't depend on candidates finding you find them for you it's powerful matching technologies scans thousands\nOf resume identify people with the right skills education and experience for your job\nAnd actively invites them to apply so you get qualified candidates fast that's ... critter is rated number one by employers in the U. S. and right now my listeners can try sip recruiter for free at this exclusive Web address zip recruiter dot com slash bands\nThat zip recruiter dot com slash Manson zip recruiter dot com slash Benson zip recruiter the smartest way to higher on ... and I want to buy your house\nWho is this the topic is though says he could buy your house without any fees are commission can a person does this do says he could buy any house at any price cocked his five houses in as little as three days I mean is this the kind of man you want to do business with yeah what about his college years at ASU\nPay no attention to her and do not go to Doug ... dot com to sell your house I'm Doug off him and I do not approve this message\nPatrick van here wanting to talk to you about an ever increasing and deadly epidemic in our state is an epidemic which affects everyone of us and our families the epidemic is distracted\nDriving and the danger is real you're distracted driving seriously injures for kills tens of thousands of people in our country I'm Patrick Ben remind you of phones down ties stay alive dome Texas this message bronchial decision of a drive smarter Arizona [laughter]\nIt's Mac Watson for tackle T. A. K. L.\nYou need something picked up or delivered it could be groceries a grill piece of furniture or a box of books just go to tackle T. A. K. L. dot com or download the free tackle lap you can schedule a same day pick up or a time that works for you in a background check provider can be there in about an hour if you need it fast\nOne tackle customer reviewer said great service\nI use tackle for the first time and it was awesome once I ordered the job I immediately had six providers to choose from the one I selected got here early and did exactly what I needed this was a great way to get odd jobs done look if you've got something you need delivered are picked up and you keep moving it out of your way waiting for the time to get to it\nThan tackle it T. A. K. L. I'm telling you this apple changed the way you look at chores the app is fun\nWaiting for the time to get to it than tackle it T. A. K. L. I'm telling you this apple changed the way you look at chores the app is fun you get stuff done and with a few keystrokes or taps on your smartphone it's taking care of tackle T. A. K. L. leave nothing I'm done I'm\nTom shame hey guys wrote and change here ashamed company our diamond buyers are constantly in the world three diamond capitals and worked Tel Aviv andme Mumbai where the rough diamonds are cutting polish\nThe diamonds are sorted by grade then we picked each stone one at a time choosing only the prettiest diamonds from with in each grade\nWe sell diamonds loose and show you how to examine them the way our buyers do my friend Ryan recently started his search for a diamond on line which\nIs fine he found tons of ideas but to properly evaluated diamond I told them he had to see it in person and to paradigm and side by side it's a fun experience and a really cool thing to do\nBecause of how we buy our diamond sparkle more than other ... diamonds of the exact same grade shop around then come to shame company where you'll get the prettiest diamond in every price range now you have a friend and the diamond business shame company and shame go dot com\nWant to drive a brand new moms are not a lot of money you must go accountable back Missouri for Moscow now prices Amos on every month sock fast walk we must make room for next year's ... genes are price boom\nSelection channel back malls or while you're New Year's eve on the far we were just two twenty nine among your forty nine for us here by driving when mom for just two thirty nine among\nMuslims when we were just you know you see them off\nNinety three at all with only Nineteen Ninety nine viewing saving selection and the best selling them by just covers a camel back there were rushed to come back\nRooting for years like most of\nAre signaling focus on your ... title one's skinny positive require to charge maybe opposing the over ...\nArizona's news station or your new life to free up around [noise]\n\nAnd I wish I had an allowance I don't know where to go away and we don't really ill CDC says\nEveryone over six months old to get the flu vaccine as soon as possible calling it the best way to protect against influenza end it's potentially serious complications health experts at the newly released prescription pills or flus that could help reduce the length\nAnd severity of flu symptoms in adult if taken at the first sign of flu symptoms\nYeah it's huge you've already had two kids die from it and it ... we talk about like the bombs and we talk about the mass shootings we ... ... it's the little things\nThat matter so much we were so worried word kids like don't sit too close to the TV you're going blind don't do this don't do that he put some baby all oil and go outside right yeah yeah yeah maybe I'll get a nice tan like all these things like we we were worried about stuff we didn't need to worry about\nThis is something that\nWe need to worry about eighty thousand people died last year because of the flu and not all of them were six month old babies or Ninety five year old people with compromised immune systems there was a lot of people that were seemingly normal healthy people who caught the flu thought they could fight it off\nCouldn't and paid the ultimate price these are things that you sit back and go oh let's say maybe it maybe maybe I Need to\nThink about these kinds of things out like everything when you go get a shot you got to know that there's potential side effects\nYou always have to balance risk versus benefits when you talk about any treatment any medication and like ... there are side effects here to comment one headache a little GI distress upset stomach there have been some report to salute disturbances in some psychiatric issues that will be being followed\nYeah so I mean but if if ten million people get the shot and twenty five ... ... it's it's worth the risk I think you're not saying that you had you not steady naked on time dot map about Kentucky Fried chicken\nThat's what happened in the mood order kicked in no I'm not I'm not but I don't get the flu either to them three two three five three twenty four twenty three\nOrder kicked in no I'm not I'm not but I don't get the flu either because three two three\nFive three twenty four twenty three ... and shows your Twitter tweet at us somebody tried to steal something and it is the stupid of the day as much as this is stupid we'll talk about that straight ahead ... and show [noise]\n\nShed been to show [noise] now that have been slipping on my Casper\nMattress I pick it over every mattress of ever had it helps me get the best night sleep\nPeriod what'd you try to Casper you're going to love yours to Casper is a high quality mattress at an affordable price I sleep cool and comfortable every night that's to the unique combination of phones to provide the right pressure relief in alignment Casper ships right to your door for free in a small how do they do that size box\nA forty five year old man armed with a hammer has been arrested alarms were activated after an attempt was made to smash the glass box surrounding them by the card staff were immediately alerted and police were called in as to the actual document it's not been damaged\nIt's the best surviving copy of one of Britain's most influential legal documents dating from twelve Fifteen it's regarded by story and as the foundation of constitutional liberty and the English speaking world\nYes it is it is it is incredible and\nWhat they tried to do back in these days are in those days long ago a twelve Fifteen was essentially they were trying to broker a deal between the rebels and the royals and and it it kind of started setting up rules and it's one of just like our constitution\nThey you politicians site it today it's amazing there's I think there's four copies we got one\nCame on tour when we were celebrating one of our uh uh they loaned us one\nThe Brits that they learned this one is pretty amazing to see you know ... for a while you can use it if you lie and you know I was going on too but I was talking to producer Phil\nAnd I said\nLet's just let's let's play fun here for a moment right\nSo you managed to steal it or you managed to steal the constitution for whatever reason are more than you know let's go national was that national whatever it was such a movie with Nicholas cage national treasure\nClosest say for the sake of argument that you managed to now he wanted to use it for something else but let's just say you're not going to use it for something else so you have one of the most important documents in the history\nOf mankind nice of mankind get over\nWhat are you gonna do [laughter]\nThis is my question is okay so you haven't what do you do it because\nYou're not are you taking it to a pawn shop is that what you're doing probably not right\nAnd unless there's some evil person out there that wants to have this and put it in their basement for whatever\nReason who are you going to sell it to\nIt's like people who in Nineteen Ninety four the Oslo games Winter Olympics on on the opening ceremonies they broke into the Oslo National Museum and they stole the\nScreen right the great the great painting the scream and [laughter] I'm telling you okay now what do you do with it 'cause you don't want nobody is going to\nWant it to buy something right so let's just say for the sake of argument you buy a\n... a a painting and the scream at the time has value they couldn't even put a value on probably it ended up being worth well over a hundred million dollars\nSo you own this thing and I mean you get stolen so now it's in your possession now they held it for ransom and they got it back within three months but if what do you do with it like if you stole the Mona Lisa\nWhat are you going to do it was just curious like who's going to buy that\nGoing to buy that because if you buy it you want somebody to look at it now which yours right and people somebody's going to totally take a selfie with it secondly and this is vitally important nobody's gonna want that hey if you would have stolen the magma car to the U.S ...\nThe second leading this is vitally important nobody's gonna want that he if you would have stolen the magma car to the U.S constitution or any of the things out there that that have these values that are just insane\nWhat do you do that so I Do do you guys did great alright cool now a\nWe're kind of under ... and nobody here has any real connection so we've got one of the most valuable pieces of paper or art work in the world or how exactly are we going to get rid of this thing\nAnd I don't know\nAnd I I I think of that far through I just wanted to steal like money [laughter]\nBecause it was it\nOh my goodness see we're we're not the only ones we we think we're the only ones was stupid but I Will tell you we're not the there is stupid everywhere the global nobody has a monopoly on stupid not Florida right much I Love Florida come on now\nRight Europe has it's it's it's stupid\nDo three two three five three eight twenty four twenty three and she had been some shows your Twitter you can tweet us ... question up and\nI like Halloween close by and the question is a pretty simple who's your favorite monster movie horror villains who is your favorite one uh in modern times you've\nGot ... you know Jason friday the thirteenth got Michael Meyers from the Halloween you got Freddie Krueger or you've got the people are saying what's ... Frankenstein the wolf manner big Godzilla got several votes you can tweet us at\n... Benson show three two three five three twenty four twenty three a love to hear from you\nAll right let's take a deep breath had all this stuff going on how about a little ...\nLet me take you back to a time when you used to wake up on Saturday morning and you sit yourself in front of the TV and you turn on the cartoons joining us now and the minute is a couple of guys put together a book called it's Saturday morning\nAnd it it it talks about the golden age of cartoons from the sixties to nineties it breaks down from top to bottom I I don't feel I get a thousand bucks a year\nThis is one of the most interesting books I've ever read it is incredible they joined us straight ahead right here on the ... and Shia\nI'm Andy Solomon cybercrime is on the rise last year the FBI Internet crime complaint center reported more than three hundred thousand complaints according to a National University of Phoenix survey forty three percent of us adults that they have experienced the personal data breach in the past three years Dennis bunny or University of Phoenix\nPeople often trays security for convenience online while using the same passwords are ones that are easy to remember can be convenient it puts people at greater risk for having their passwords cracked by cyber criminals\nWith more personal information available online people must avoid habits that can leave them vulnerable has been the yeah\nThe silver lining of the surveys the U.S has also taken some precautions to limit data breaches like avoiding opening suspicious emails clicking on unfamiliar your elves and it's still in firewalls an anti virus protection unfortunately less than half of those survey of the security settings chase passwords frequently or back up their data\nFor more information visit Phoenix dot\nEdu or you fifth year older okay well I'm not going to ask you to raise your hand so don't worry but I Do want to ask you have you sign up for a Mac yet if your answer is no\nWhy it's a free membership for one year you don't even have to give them credit card information\nAnd just for signing up here's some of the stuff you're going to receive just some forty percent off movie tickets access the supplemental dental plans up the sixty percent off forty percent off theme parks like SeaWorld lego land Disneyland and more discounts for hotel bookings rental cars do that's\nRight you're going to receive all those discounts and more just for signing up for a free one year membership\nThe only requirement is you've got to be over fifty\nGo to a Mac ... us forward slash Chad sign up for free no credit card no tricks no cost nothing sign up for a free one year membership a Mac dot us forward slash radical eight eight eight three five five sixteen sixty eight eight eight eight three five five sixty sixty eight or online at a Mac dot us forward slash\nFolk today Ramsey here for my friends at imperial wholesale one of the best ways to keep your home up to date is upgrading your flooring and counter tops from my friends at imperial wholesale\nSince Nineteen Seventy seven the imperial family has been shopping the globe\nHand selecting first quality stone tiles flooring and importing right here to the valley and of course all at imperial low wholesale price on like right now imperial has the valley's largest selection of eight by eight deco tiles exclusively imported from Spain and Italy would does\nAnd it was the valley's largest selection of eight by eight deco tiles exclusively imported from Spain and Italy with dozens of pattern styles and colors to choose from\nThese trials won't be of any room or wall in your home a classic ... century modern design and it only three Ninety nine a foot that's an upgrade to fit any budget see the store for details the Mesa warehouses open to the public visit imperial wholesale dot com for hours in directions\nThat's imperial wholesale dot com\nStop dreaming and start driving I knew you\nKayla bacterial camel back half your back with zero percent a PR financing the\nPayments on the air clean and nice twenty Nineteen ... trying to find out why would the Nineteen eighty nine dealing planning for thirty five a month for lethal means twenty Eighteenth ... Seventeen\nNinety new assigning for just Nineteen and mine poorly need twenty Eighteen out back to point Sinai with sending teams forty Ninety when signing forgive you forty nine of mine had time to be on new\nComplimentary maintenance is included and I always tell\nTo be hoping healing at the next door in hospital came about\nLocated on Kimmel background sound gamble that the British downtown obviously\nWhen he teamed introducing the on the holiday tradition\nOr a truck by her speaking of trucks oh my goodness do they have some amazing trucks right now at Peoria for the rafters got more raptors than anybody else and we got to get rid of all let's go let's move them off the arms and I was in the show me the other day oh you're talking about over seven hundred horse power in a truck\nMaybe you're seeing a slowdown Cornell okay I'm not trying to win the ... and I just need to get down the street OK well guess what they've got amazing vehicles were used well should\nBe a scape V. expedition you can get an F. one fifty just regular wonders doing awesome truck was to do it now Peoria Ford online and Peoria for dot com or just west of the one on one on bell road that's Peoria for\n[noise] a A R FM Glendale, Arizona is Louis de da or\n\nTaught at a sigh of relief for federal authorities arrested a South Florida man brought in connection with the string of apparent explosives sent a high profile Democrats and their supporters this week\nCaesar say I may have been arrested here outside an auto zone in South Florida but he will stand trial twelve hundred miles away in New York\nThe case will be handled by U.S attorneys in the southern district of New York three of the fourteen devices were found in Manhattan but before say our heads north he will make his first court appearance here in federal court in Miami that will take place on Monday afternoon ... ABC News plantation Florida\nFor the Trump has been criticized for using attacking us that rhetoric and his political speeches on friday night Trump said most of that is the press unfairly spit in his words\nThe media's constant unfair coverage [noise] the possibility\nAnd negative attacks you know the [noise] only\nServed to drive people apart\nAnd to undermine healthy debate\nAs to drop out of political rally in Charlotte Brock Obama has words of warning for Americans the former presidents that America is quote at a crossroads right now but\nOffending on the sideline [noise] [noise]\nAre dangerous\n... democratic rally in Detroit friday the migrant ... has been worn by President Trump not to try to get up to the U.S and they've been offered work visas by the Mexican government but many are still pressing forward toward the American border the carbon consist of many families who are doing terrible hardship to make the journey\nThe migrants have been stopping a community has to take a break\nBe treated for medical illnesses or for any ... in which they may have and one of the things that you see are the children the many a mom and young families that are have been a part of this caravan\nTrying to make their way north\nSaid BCS markers more in Mexico on Wall street without fell two hundred Ninety six points you're listening to ABC News\nArizona's\nA TA are blonde hair Ninety two three FM online at ... dot com streaming live on the T. A. R. news after your breaking news in traffic\nIt's nine oh two I'm Cathy climate here's our top story Arizona votes almost one hundred thousand early ballots submitted today marks the most narrowed the gap between Democrats and Republicans this month Garrett archer with the secretary of state's office says women tend to hold onto their balance longer they begin\nTo early ballot month somewhere in the forty seven forty eight percent of the electorate and then gradually over time have climbed to that fifty one fifty two percent mark\nDemocratic ballots were full point higher today than yesterday and speaking of voting Katie our eyes on education Arizona Supreme Court it's not the old white blocked invest in added initiative from this November ballot it says proponents of the measure which seeks to boost taxes on the rich\nFailed to reveal it would also increase taxes for other taxpayers\nThe panel also said misstated how much the taxes and high wage earners would go up\nWe absolutely disagree that that was either the intent or even in the language this was something that the opposition an idea that the opposition through with this\nShow Thomas with Arizona Education Association Katie our eyes and immigration a group calling on the state to do more to protect migrant children housed in southwest keep ... speaking out about a recent settlement with the Arizona department of health services that is\nMerely just a first step Esther\nDo it on line with ... and reunite families coalition referring to the settlement that state south west keep authorities must temporary stop accepting new miners I'm close to ... is that they're missing a deadline regarding employee background checks\nNot all of our demands have been met and one of the most important ones is that the children still do not have twenty four seven monitoring also we the citizens want to be involved to ensure that the children are being kept safe ...\n[noise] now for check on traffic here as ALS if she live from the valley Chevy dealer traffic center\nKept safe greens now the now ...\nNow for a check on traffic here is al ... the line from the valley Chevy dealer traffic center\nThat's the way back to church in this weekend was about I tuned close between\nFifty sixty Seventy eighth avenue studying attempted until ... am Saturday\nWere spent time where it's all so close to twenty seven thirty to forty third avenues traffic accident at fifty first can determine the west wing I tend to access road or McDowell and been here in St alternate routes ... invest\nLike Seventeen traffic sponsored by in and out burger and now they're just finished my acting out mix hamburger patties daily with fresh premium beef\nThat is specially selected because fresh when it's all about\nI'm a C. K. E. T. R. news [noise]\nKatie and wonder if in the valley tonight clearing low sixty two tomorrow sunny in a high in Ninety Seventy degrees out by Cape creek whether ... by how ... how we're there and Kathy Klein on Arizona's new station PTA our news [noise]\nHey Arizona did you know your garage door represents up to forty percent of your homes curb appeal so basically if you're Raj doesn't look good it's bringing down your home's value call my friends or a one garage door one of America's largest manufacturers\nAnd installers of garage doors and service and here's the best part of new garage door for my one will provide nearly one hundred percent return on investment upgrading to accustom a one garage door like contemporary glass copper and would\nOverlay will produce even higher returns you can see for yourself what their simulator pro software\nFree at a one garage dot com you can get instant Rinder rings of your house with dozens of anyone garage doors and right now a one garages offering a single car garage door installed for only three hundred and Ninety nine dollars so schedule on line and a one garage dot com\nYou'll see why for over a decade homeowners recommend anyone to every one that's a one garage dot com [noise]\n\n\nLambs Ramsey show\nAnd she is getting in more than double your\nOn Dave Ramsey are hosts the show America thank you for joining us if you show because\nIt's all about you open phones a triple a eight to five five to to buy a AAA eight to five five two to five\nTrevor is whether it's in Greensboro North Carolina Hi Trevor how are you\nI'm doing great Dave thank you for taking my call\nSure what's up\nA well me and my wife were working on the debt snowball I'm In July I got laid off\nI'm kind of a blessing in disguise I Am working again\nI'm making less money but a lot less stress and so what is your input on a plan that we had to sell our house who to pay off all of our debt and and kick start us going in and being kind of start over\nHow much debt do you have not counting your house or fifty three thousand [laughter] and so on your home will clear that yeah and then somebody would a much more would you put in your pocket past that\nUh probably about twenty five plus thousand math or you know we'll defeated everything\nOkay and so um what's your household income today about eighty thousand okay so you just don't like the house\nWe're not in love with it or we bought it for and a half years ago um 'cause we want it to chase somebody else's dream and then we're realizing it's not our dream and\nIt was either a mortgage racing\n[noise] you're deciding oh I ... yeah um so we we don't we're not ... uh and we have different goals in our priorities have changed so\n\nOkay so where are you going to live\nA well that was kind of in the plan which we could basically jumpstart through a baby step three and take the money put some of the other money put it in as our emergency fund and then either rent for a short period of time what we built up more of a down payment or use the money and buy smaller property\nI'm and smaller house um that uh that we can you know they will enjoy\nSmaller property I'm and smaller house um that uh that we can you know that will enjoy\nMhm so I [noise] um\n\n\n\nThank you for joining us America was the lead you are with us this is the Dave\nRamsey show Marian is with us in New York City Hi Mary Ann how are you\nHi how are you trying to say I'm the fan and think you've got to show\nCertainly thank you how can I help\n[noise] okay [noise] so I've been following your plan for on as like a couple of months now I had the emergency finals and I'm working on baby steps too good on my issue and I had made progress not a ton of black eye it's on ...\nA night issue is idea of a chronic illness and I still work fulltime I Am not letting it take over my life is good\nAnd my question is is how do I I check 'em for my deductible and I'm at ... recently I recently switched health plans to lead stopped well started again I\nAlso have a chronic illness you're going to hit the adoptable every year\nRight um\nIt's ... thank God it's nothing on the go it it it's not they don't have and it's not life threatening\nAre you going to do it while every year\nNow okay so ... what what is the nature of this what was the nature of the illness\nI mean I don't want to go into detail that Iran is a it's a nerve pain condition and the doctors are unsure of war comes on okay God and so if\nIt was over there but I Do is I'm sure because it's relatively new got I got I yeah\nWell what I Would do is just try to estimate what you think it's going to cost you a year\nAnd the more experienced got to help you that you have with is the better your estimates are badly because once you've ... battle with it for five years you're you're going to kind of know a five year average versus five months\nYou're kind of guessing what it's going to cost you in a year right right and you just put that in as a budget items so let's just make up a number okay if you're the duck double was six thousand and you're going to run through your six thousand though the duck double every year then that's five hundred bucks a month if it's\nThree thousand dollars a year this is going to cost me out of pocket that's two hundred and fifty a month and I just put a you know a a whatever\nA line in your budget for medical expands on the ... medical\nWhen just call your call chronic or whatever just give it a name and money set aside so that so that every 'cause it's kind of like we know it's going to come up and leave a little while now someday hopefully you'll find a cure and you know it's not a lifetime\nOf this or something not yeah but for now for now you're saying it's predictable\nOr that you're going to have issues we just don't know how severe or expensive they are going to be up into your future and so so much for the next so many months we need to just be budgeting is if we think we're going to spend X per year divided by twelve in your monthly budget\nMm I mean my issue is is that I'm literally on\nLike penny pinching I don't like seeing where I can make that happen so what I've been doing is I mean I decided starting next month I'm going to kick out fifty dollars that you like it here right now on what I I'm I'm hoping overtime on the opposite you know pay out more\nSo why are we finally got an income problem a debt problem or a spending problem where\nI got minded that problem [laughter] I'm I'm sixty thousand I that I make I don't think a lot on the license social worker and because of my condition actually switched jobs had more flexibility\nOn Sundays fee for service division as opposed to salaries physician when I make anywhere from Thirteen hundred to Fifteen hundred ... a paycheck um\nI Do get paid twice a month ... you get twice a month okay and you said you're living with them\nBut I guess I'm I'm living with a roommate I paying nine Seventy five for rent\nOkay and you said you're living\nOn it I guess I'm I'm living with a roommate I paying nine Seventy five around you give us a lot um and I did that somehow from ...\n... and what is the nature of the debt student loan\nPratt is actually a credit card I often because they had said I was trying to ... stick thing I'm not a call ... student loan I Know that that is writing a check it out there that have like a total of six week out\nOkay show for the short term we're going to make sure you take care of the most important things in the food pantry\nNot eating not eating out free and you're paying\nYour life your lights and water and your rent and your transportation so food shelter clothing and transportation and utilities the eighth grade we used to call that a civics lesson lesson necessity necessity is only the debt you've got is not necessities\nYou take care of the debt only after you've taken care of the necessities and then you were just fill out into the debt as you can\nAnd here's the thing you're either going in preparing for these medical expenses or they're going to be new\nDebt right because they are coming\n[laughter] you're told me that that's why you're called yeah yeah yeah\nI mean it's not me declaring it I'm saying great actually I've I've got ... how do I prepare for it you're saving coverage so\nNow that's our short term long term we got to get your income up and you're out go down to knock this debt out long term but that has to do with your medical condition and has to do with your career and has to do with a lot of different things that you've got to face\nAnd so um but that's how I Would you begin to look at it get take care of the short term make sure you're taking care of you so that you\nCan you know be prepared to take on the long term which is get your income up\nBut uh we got to get past some of the medical stuff and you've got to really start looking at this career really hard chop up those credit cards it's time for a plastic surgery Tucker is with us in Atlanta Georgia Hi Tucker how are you [laughter] I'm doing well how are you better than I deserve what's up\nWell me and my wife I'm going through a baby step who right now I'm In fact we just paid off our second credit card the day that we are done like credit card and move around if they don't mind\nThat is good news um [noise] but um so we're working the babies that too and we're looking at our budget and yesterday at a after church we had a big argument about hiding\nI don't know if we want to ... ten percent and um I realized that we were not in a position to give right now we're trying to pay all that we can give later\nOn on what what I think what kind of new models that I'm kinda\nI thought the eighth of all want to get your input on it\nWe have our ten percent by it but we want to live without thinking about quitting data\nAnd giving back to the church and then having that extra five percent and kind of giving it to um other\nCharitable organizations that we believe in that are about it one day a ... you know when the crisis mission and so we're trying to looking at trying to give what we can to people who need it\nUm but and she's on the other hand walk straight ten percent take charge and being what we'd do what we can't give you know we're not in the media and she wants to give ... percent in ... we\nHad a big argument about either yesterday so it was\nI was on the the definition of dies the definition of the time is when you look it up in the Hebrew it's an Old Testament term and Jesus reaffirmed it in the New Testament\nIs tense it literally means chant the word means tent\nIt doesn't mean fear that doesn't mean twentieth it means to him\nNow you can decide whether you want to tie they're not you get to decide that um but if we're going to walk with Christ and we want to and we have an evangelical Christian which means I look for what the scripture tells me to do\nI'm doing my best to follow what the word of God says and so what ... opinion is God no matter what Tucker a plan is er Tucker's opinion is doesn't matter\nI'm looking for what God says to do in his love letter to me and he says Tucker and Dave I'm I'm you're my kid I'm Crazy about you\nI Love you and um you can give are not given all still love\nYou the best way to live your life is to to gifts\nAnd all throughout the Old Testament and Jesus reaffirmed does in the New Testament is a time of the tens of your income evangelicals are taught and believe for Fifteen hundred years at that time\nIs it ties a tenth of your income evangelicals have taught and believed for Fifteen hundred years that that private is your baseline minimum giving and it comes off the top before you do anything else and it goes to your local church [noise]\nSo if you want to biblical answer\nYour wife Wednesday argue [noise]\nThat's the biblical not your widely argument but she was correct biblical [laughter]\nActually both are probably true\nGood luck with that rather [laughter]\nOrder to be a successful business owner you have to be prepared for change as an example let's talk about the huge changes in tax reform that actually managed to make something that was already difficult to understand even more confusing\nSo one Osama includes cars yes it is 'cause the cars fifty on cars and what's the other fifty five on\nA thirty three thousand on student loans a little bit of the majority of my wife's ah about eight thousand on mine and a twenty two thousand is on other like credit cards and stuff like that\nGot it and what's your household income [noise] um well I got fired from my previous job that was there about five and a half years and um we're making about one one oh five one twenty ... a year where did you used to my old job\nYeah that that's what I was making before a yes before okay um what do you make now ... now\nI'm In real estate I'm actually I got my license in March in June ... June was my first day in real estate ... I've got to to the house has sold\n... things in ... by the end of uh the second week of November So\nWhat is your projected income for a vote that's six month period of time\nI'm I'm thinking maybe like twenty five thousand\nBy the end of the year and now what does your why didn't make of them want to find makes\nFifty a she made a fifty one dollars that\nOkay so basically it sounds like in real estate you're going to make as much as you used to make\nYes okay good good news All right\nI guess right now what she's worried about is that she's bringing in most of the income because of course it's low when you first start out I'm only selling to houses that between that long the span 'em and her thing is she wants to keep her car because she's saying she's making money to pay her car [noise]\nAnd that's not how it works when we're married that's how it works when your roommates\nYou get to do whatever you want when your roommates but when you're married it's for rich or poor and sickness and health and onto the all my worldly goods I pledge is what the old marriage vows sad\nAnd so it you know if you want to be divorced you get to keep whatever you want to create if you want to be married\nWe are doing this together in other words if she gets cancer you don't look at her and go oh you just you can handle that cancer thing there by yourself and those trips that came out you get to do that by yourself you're not going to do that to her right no no you would take care of her because we are now one\nWhen we're married and and it's in sickness and health and right now the house is sick and so we don't get to be a print system be selfish that's not an option\nSorry yes and and um that's what I was trying to explain to her is that we needed my my truck is for sale already have it on the market good home as soon as I as soon as I Do some of these qualities of course we'll have\nIf I Can't get what I was asking for what you what would I oh I'm going to pay the difference to get rid of it completely good um what these clothing and that's what I was trying to tell her to is\nGet a car cash in and she sells her car and then what have at least one quarter for now\n... well I don't know I ... I don't agree with that I Would get her a car and I'm not sure we're going to move down and out of her car if you can make fifty five thousand if you can get these closings and everything you've gotten the pipeline it sounds like you're pipelines pretty good\nIt's just it's been tough from the lay offs and other firing until now but here's the money that you've got piled the the business that you have coming should create the income they used\nTo have if I heard you correctly\nYes and and like I told her like she's she's worried that it's not coming in fast enough and I told her there are ending or clothing by then the second week of November everything should be closed ...\nTo ... and three weeks\nIt's not coming in fast enough and I told her to ending or clothing by then the second week of November everything should be closed do they\nGrow up to three weeks from now here I mean so three weeks from now all this goes away so here's what I Would I Would not sell her car today\nI Would show your trial today and I but I Would I Would say I would tear this this this ridiculous philosophy that she has all the ... I'm not putting up with that crap okay this idea that outlined make money I can keep my car and well that's of your roommates that's just BS okay I'm not going with that\nShow uh but but but the idea that I think she should keep her car and I think the two of you and I think you're going to be making enough money that then the two of you could work through\nA budget that has not a hundred and five thousand dollars worth about making about a little over a hundred but instead it has about Seventy five thousand dollars of debt making a little over a hundred if both of you are willing to roll up your sleeves and\nPay off thirty seven dollars an hour for the bet a year for two years we can keep her car but if you're not willing to do that as I household then you don't have a financial trouble your marriage trouble then\nShe's not willing to join armed with you and fight and outside enemy that has come at your house and instead she goes to her corner with her toys you have a marriage problem\nBut hopefully you guys can get on the same page when you back all for her car a little bit\nYou were in a restaurant so I'm almost cars not weigh a good way to get mom on board\nHello so let's try that other approaches I think it's reasonable financially to keep her car if your income goes right looks like your income is going to go\nThen you might be looking at a different career and she's going to be looked at us on our car through and you get her car to drive you drive a cheap car while we get this ...\nThis was the day Ramsey show [noise]\nI'm Tom Shane hey guys it's ... as a direct diamond importer shame company has the best value on diamonds every day but it's so much more than that we have\nBy far the prettiest diamonds in Phoenix that's because of how we select our diamonds we go to the three diamond capitals of the world and pork Tel Aviv andme Mumbai where the diamonds are caught\nPolished and been sorted by their G. I. grade we then hand picked only those diamonds with the most sparkle within each grade I tell my friends that how we buy is going to a farm in hand picking the best fruit right off the trees\nYou can examine the fruit from every angle and leave your rejects for the next guy\nBecause we eliminate all middle men and their mark ups that shame company you'll always get the prettiest diamond for your money pick just for you right off the cutting we'll come to shame company Phoenix is direct diamond importer now you have a friend in the diamond business shame company in shank oh dot com [noise]\nWow she was in your new place looks great [laughter]\nWhat was that the spots in the living room you have to kind of seen before in his bat [laughter]\nThose are bad we had that happened last year at our house a carpet cleaners showed up and it looks great when they left but I guess they left a lot of chemical resident right\nAnd then a spot ... back and kind of gets dirty air faster\nI ended up calling zero rats and they did it right those spots never came back and the carpet your dry and a couple of hours [laughter]\nI Can't live with that we're going to get the number of France zero as happy ended his addict\nIf you're tired of those screaming spots to come back after the other guys clean your carpets you're going to love to see what was different\nThis month to get three rooms of carpet or two rooms of trials you fight for only a hundred and thirty five dollars a call today for a zero five zero seven two for one nine for your appointment online at zero risk Phoenix dot com spelled Hussein forwards or backwards sumo wrestler right way to clean [laughter]\nI don't want to be pressuring him to find something I don't want to relate to that\nSo much easier when there is someone I trust helped me out just one person who actually knows what's going on is all I Need\nMy knees are hectic enough so I don't have time to play games [noise] please don't waste my time\nWhat's important is finding something that fits my family's needs not someone else's ... and you're listening to the cooking noise the guys\nAnd I appreciate being treated the same as everyone else I Will tell you that they had ever and science are different\nAnd believe that no matter who you are everyone should pay the same low priced receive the same amazing experience\nIn two thousand five bill Toyota created one price as one person an automotive bong Cindy where everyone pays the same one little price just one knowledgeable person to help you with your entire body inexperienced saving you time and money coming in today to see how the quality to lose\nKnowledgeable person to help you do your entire body inexperienced CPU time and money coming in today to see how each quality ... Peter located on June and Ninety nine avenue or ... I wouldn't build Toyota dot com that's avenue Toyota dot com\n\n\nDonate your car today with one eighty seven seven cars for getting near a recognized five oh one C. three charity organization so you'll receive a maximum tax deduction much more you'll receive a vacation voucher up three days in tonight also on the Web and cars for kids dot com well then\nDonate your car and remember ... cars with again\nArizona's news station is ... Ga our news not easy for you\nYou know ... or any of our local dignity memorial providers can help visit dignity the Knicks dot com to learn more dignity memorial life will celebrate\nOur government here for ...\nWe have over six hundred vehicles it must be so during our model your individual take advantage of zero percent for sixty much before interest rates go up\nBy age twenty Eighteen focus asked for only thirty nine Ninety nine twenty eight to ... you know only Seventy nine Ninety nine or save up to twelve thousand dollars off I knew twenty Eighteen at one fifty perch Ford bumping us sixty a major driver or at church for dot com save alive please don't touching Dr\n... kind of like [noise]\nA A R of him when he's Arizona's a TA argue we asked them\n[noise]\nFrom ABC News\nI'm Brian Clark at least ten people were killed in a shooting at a synagogue and Pittsburgh the Anti Defamation league says it's likely the deadliest attack against the Jewish community in us history now authorities have named the suspected\nShooter forty six year old Robert Bowers was himself shot and taken to the hospital after he barricaded himself inside a rabbi study powers lived in the Pittsburgh area and there are several firearms registered\nIn his name it's ABC's architects give half of the tree of life synagogue in Pittsburgh squirrel hill neighborhood President Trump earlier suggested it would've been a different result if there were armed guards in that synagogue but then he told a group of future farmers in Indianapolis\nTo violate field for Asian of anti Semitism must be\nCondemned and confronted everywhere and anywhere it appears\nThe FBI will take the lead in the investigation says Pittsburgh public safety director window historic\nFalls under a hate crime or being a Jewish synagogue so it will be basically a federal investigation with the assistance of the local county and state for east\nSaudis are also continuing their investigation into fifty six year old Cesar ... the man arrested friday who authorities say set in more than a dozen pipe bomb devices to prominent Democrats and their supporters Victor why we worked\nWith say oc at a nightclub and knew him from a gym he says was very political\nHe was very dissatisfied with the liberal direction because I think that was back one block Obama was president so obviously had an axe to grind with that\nA van that say I was living out of at the time of his arrest was covered in stickers praising President Trump and vice president Mike Pence there were also stickers that showed Hillary Clinton and former President Obama with rifle scopes over their faces ... ABC News Miami\nParts of the east coast today dealing with strong winds and heavy rains caused by a nor'easter areas running up through Boston could see wind gusts of sixty miles an hour you're listening to ABC News\nArizona's\nA our on air Ninety two or three of them on line to be a A R dot com streaming live on the news after your breaking news private\nKatie ironies time as one or two on ... on a court says a Native American tribes and activists can indeed challenge uranium mining near the Grand Canyon\nSo how the ... tribe and environmental activists\nSay such mining will not only blue water supplies the desecration sacred ground recently to court said neither had appropriate standing to challenge energy fuels incorporated claim an appellate court is allowing the challenge to resume energy\nFuels owns uranium mining claim near the cell to ... to the Grand Canyon in twenty twelve U.S Forest service at the company's rights to that claim were ballad ... or news\nTo family members of missing Arizona and say you should check out missing in Arizona de ... brother was found near tone upon Nineteen eighty eight are named John Doe until two thousand ten Kimber beings older sister may count vanished in Nineteen Ninety nine\nDon't be afraid to do it you'll be glad you did\nTry southern cases have been solved that's twenty seven families who have answer\nMissing in Arizona runs until four pm at ASU west campus in Glendale there will be supporting dogs personnel to process records and even a chance to donate your DNA\nPhoenix drug treatment center is planning to expand via a franchise program Christopher Riley would crossroads says the correlate programs should be starting soon franchisees will get all the support they need people who want to help crossroads expand can contact them directly and now for a get a check on traffic\n[noise] here's my Daniels life in the valley Chevy dealer Shafik center\nGot an interaction Bob your motorcycle ... del Webb boulevard ... just north of ... Seventy to better and Ben Van Buren to watch out for their support raunchy by this ... stock up and say with you\nJust north of ... Seventy to better and Ben Van Buren to watch out for their support raunchy by ace this ... stock up and say with deals on like Ellie be bulbs a sprint filters in east basic house keys now through an October twenty ninth\nAn eighth I might Daniels Katie a our news [noise]\nKatie I went there for the valley nice sunny day today with to hide eighty nine degrees two mile clear skies as well as the height of Ninety two degrees\nThe rest of the week we will stay in the mid eighties it's eighty one degrees in cave creek and eighty five degrees in Tempe when they're brought here by how or an air whether I please or repair call ...\n... an hour is on his knees station ... [noise]\n\nAre you digging up dirt on your dead one to find out how here the latest on new family history sources and websites with interesting and fun guests sent experts find out what other people have been learning about their ancestors from king to the inventors to farmers\nNothing that's been discovered shouldn't surprise us anymore but he always does find out what we mean great family history stories and information are on the line now with extreme Jean's family history radio hand extreme gene dot com\nBust all his first Eighteen Ninety two\nGrandma ... long and bloody thing\nEver read infringement [noise]\n\nAnd my gene aged to America's family history show extreme genes and extreme genes dot com\nAnd his Fisher here your radio roots loose on the program where we shaped your family tree and watch the nuts fall out\nThis episode is brought you by BYU TVs relative race and I'm very excited to introduce you to a guest we've never had on the show before ever she is one of America's great storytellers in fact there's actually a storytelling festival circuit around the country I first saw a couple of years ago sorry again\nJust a month or two ago and another festival\nAnd she is just a master of telling family stories and I'm going to talk to Kim white camp\nAnd she's going to explain some of the techniques to help you become a better family story teller I think you're really going to enjoy this that's coming on later in the show and then Tom Perry was some stories of his own late in the show are preservation authority of course\nTalking about stories from his store behind the counter with Tom Perry\nYou won't believe some of the things that have happened there and things that he's actually seen and found on some of the film but he converted so that's going to be a lot of fun as well just remind her if you haven't signed up for our weekly Jeannie newsletter oh you're missing all kinds of great stories you're missing all kinds of great links to interviews and shows past and present\nAnd my weekly blog so check it out it's absolutely free and no we don't sell your email address so get on a sign up now at extreme genes dot com or on our Facebook page right now it is off to Boston where I Know this man is just glowing\nIn the light of the Boston Red Sox and all that's going on in the world series David ... he's the chief genealogist of the New England historically the logical society and American ancestors dot org how are you sir\nOh for Red Sox nation were doing really good to be home for a couple of weeks before\nAnd I felt like city for doing some research or any it shifted our tour I just got back from the British Institute and I'll tell you it was a wonderful weaker twenty classes intensive on English genealogy and I could go next year and two Irish Scottish are Welsh which are the other three components so the British Institute for genealogy well worth doing\nSharpening your acts which is what good genealogist always do\nThe sixty minutes on Sunday and good friends he Seymour command performance they're talking about what went on behind finding a killer in Washington state that was a great episode\nFantastic Steve Croft interviewing her and she was showing everybody exactly\nHow she solve this case and works to solve other cases as well and she's got a bunch more in the pipeline and I'm hoping the FCC on the show here real soon so we can get caught up with her because it's been a few months so we will do that All right onto our family he used to our news for this week David where do we begin\nWell I'll tell you I think the story it really needs to start with Lisa Jensen who thought she was abandoned by her father in Nineteen eighty six when she was left at five years old left behind the damage to fingerprint sixteen years later the man or at least it was actually a restaurant and\nCharged with killing his own girlfriend well they did a little bit of investigating and history and begin to wonder if we was actually his kid after all turns out she's not trust\nOn charges of killing his own girlfriend well they did a little bit of investigating into the history and began to wonder if Lisa was actually his kid after all turns out she's not turns out actually leases kidnapper was the person who she thought it was her father she was kidnapped as a baby fish and why in his office it's a bittersweet story now she knows where she's from\nJokingly communist story ladies' so is this festival for kids and she said no\nIt's in the bay area San Francisco I don't think it's an action anymore I think it's the phone I could be wrong though and she said about a thousand adults come and people tell stories professional story tellers and I was like\nI'm going with it and she asked me where I live and I told her and she told me about the national stereotyping festival she's like that's the mother ship go and I did in my life was changed I can still remember\nStanding on the street with my backpack\nAnd in between tents there's about six answers about\nFifteen hundred and ten\nAnd I remember standing there thinking this is it\nYour own thing you've ... right mhm\nI vowed to myself that in two years I'd be on that stage [laughter] Ah yes innocent\nAnd um [laughter] I mean everyone's like you can't you have to do this this this because we all know you got to do this with us and I like that you tell me that I can only do something one way I Will\nMake short preview there's another way to secure the four\nAnd a little bit easier and faster so I did I work my tail off I mean\nLike a young group of guys in a band driving a man I Would tell anywhere for any amount of money to anybody or worked all my craft and I wrote and I traveled and sometimes I worked for gas money sometimes I Would take tickets and tear down chairs if I could open for a certain storyteller\nAnd a lot of festival directors were surprised I was willing to do all of that\nYou you might lose you pay my rent is yes you did it out and this is what people need to understand is the story telling Kraft really use a craft and and I know it's very insulting to some to call these tellers\nComedians because it's it is there a similarity to stand up but it's very different from bad it's long form it's a lot of detail and and I love the fact that you can really take your time with it [noise]\nYeah and you know what I'm there is a big difference to my friend and the opposite\nWhere when he says the difference between comedy and what we do a ... class storyteller\nThat you fall in love with other people or characters Jesse fault\nSometimes they die and sometimes things don't end well but you know in my piece is and I am long for him but I can I have a twenty minute pieces you know but I purposely used the funny very intentional and four months can find\n[laughter] it is the love you get first of all you're just one of the most time when people I've I've ever seen under these stages and and what you're describing started we started from the beginning you always have that gift there he is a gifted there is a challenge involved\nBut what I Want to do is spend part of this segment with you and the next one is talking about how other people can develop some of these skills what it takes because I think people going to reunions and having the ability to share stories about grandma and grandpa has got to be one of the great gifts that you can share with descendants\nRight [noise] you know if they're really serious about carrying these stories on to take a little time and tying homeless skills as valuable because the younger generation the tension held and we also have to remember that just because I'm a mom and I'm a grandmother\nAnd even though I Know all the stories of my parents and grandparents just because of oiling around my house and watch a lot we dropped the line or two\nWas ... children and grandchildren love them and I think sometimes people would sit down with their children and grandchildren and started asking only shocked at what we don't know something is very basic as you know how grandma and grandpa\nNot yeah yeah\nAnd I walk into a book that are going to actually have a whole lot of interesting ideas as well as ... as to how to make the passing on of the genealogy the stories of ego genealogy to\nFuture generations how to do it in a way but it's fun and inclusive of all three of us getting involved\nFuture generations how to do it in a way that is fun and inclusive of all sorts of getting involved and\nI'm really excited about what's going to work and now I Love this kind of stuff\nAs you analyze your ability to put the story together because obviously you create a lot of material not every story goes linear early ... and it works out in such a way the things come back around in it for you to understand the significance of what just happened that type of thing\nHow do you analyze the story and tied those threads that keep coming back around and make them so interesting\n[laughter] well it's a complex way our shop Scott yeah\nOkay let's take it down to the people that\nYou have to have the people which obviously in genealogy only do it that's what we want to focus on like we're not talking fiction and then there's the place you researched ... but the phone call I call it the accounting of genealogy not the people at the place of ...\nBut the problems and the progress that make up for sale McKay\nThat the part that makes it really goes yesterday I had a lot of the luxury of it was more than ... it was a luxury to present the BYU last afterwards we had a lunch between the\nProfessors and the people that are raised but on the conversation with Bob talking about the things I found out\nAbout her family's all out or eating out at ...\nOr there's a lot of interest stories\nAnd problem and ... and the local feet or what to build a great story a round with counting part of genealogy\nGovernment obviously the people down the place you have the problem with the ...\nOr whatever you hope will certainly cost Sheila ... out of the family with all that down to one unique parcel of possible try and go out and bought on your research of foreign of draw what what are they eating a lot when he joined or on a\nPond writes looking really want to turn it into a story of something that your family take over and over those little details added\nTo the arc of the story among the people in place all the time really fluff fill out I'll tell you who's a real mouse starts out as as a gentleman named Clive Romney and he's so\nGood at all shown stories of hope and saucers and even an ankle ... county from out of a real\nPeriod field to the story quitting information that may not be genealogy records but it's common knowledge about on that whole place really solid and now the Hubble shore\nSimple things to do well and I think a lot of really good genealogist understand creating a timeline around your ancestor not only of their dates their birth marriage death and places but also what's going on historically within their region their area within the country maybe even within the world because a lot of those things really inform\nWhat happened to that person throughout the course of their life\nIt can also explain thing that you find that you're shocked that or supplies or don't understand\nRight boy there's somebody there\nYes and it can bring clarity which then allows you to lay out the story like more and concern for more understanding and focus\nI'm Talking to Kim white camp she's a storyteller with the story telling festivals throughout the country and next year when we come back I Want to get an idea of\nHow much exaggeration you allow yourself when it comes to family stories and why when we return coming up in five minutes on extreme genes America's family history show\n[noise] [noise] mhm [noise] mhm\nToday the economy is strong politicians are looking for more money they want to impose a new tax on you and they're going to do it by taxing veterinarian services healthcare childcare and every service they can find if they have their way it will cost you more every day into stole the economy\nAnd small businesses protect yourself\nVote yes on one twenty six vote yes on one twenty six protect Arizona taxpayers before my business for beer tactful way to get a new\nPlan as you get closer to retirement\nPlan that will take you from where you are now the retirement you've always dreamed about the first on that issue and then he retire financially fit every Sunday evening at eight with Phyllis ...\nThe first step on that path is two and then he retire financially sit still is every Sunday evening at eight with Phyllis ... the founder of ESPN associate you only retire once but\nPhyllis help people retire every day don't miss we hire financially fit with Phyllis every Sunday evening an aid on Haiti a our news Ninety ... [noise]\nWhat didn't offer pat we're the new wave homes are still wear your online homebuyer over bet is the modern telling religion when the human touch their would skip all the traditional heading to offer pat means no showing you figure cloning day end will even be locally for free go to ...\nDot com and your basic information about your home and the next day we'll send you a great offer free and there's no obligation\nWe want to buy your home that we're glad you're operate today offer bed\nYes [laughter] so what I did was to build up to that I just talked about all of my research the hours at the computer\nThe amount of time printing things out following leads that I found chasing dead ends and I just built it up to the crowd and then I take it and I'm proud and I lay it before with mom and dad and I lay it all out to the home soon and then I get an accordion file with documents\nAnd I'm just waiting 'cause I Know I'm going to be the favorite child from one and I'm waiting\nTo see what they say an addict studying it and studying studying it and he stops him pointing at that guy right there he still owes money [laughter]\n\nAnd so it just makes a great joke is a great line now did he say that last did he say it that way no is it sound like my dad absolutely did he think that was a great joke a hundred percent sure\nSo I kind of took it and I hold it\nYou know when you're a patient of of the love and admiration for all your effort is exactly what you must have felt\nExactly\nYeah I Do and it doesn't always go well at the Thanksgiving dinner table you know it's like oh no fish has another story for [laughter] show as as you go through these things you really have to make some editorial decisions don't you\nYes especially because the story that I tell are going to be hurt by tens of thousands of people a year they're going to be put onto a CD which is basically a solid archive and it's going to be listened to by my great great\nGrandchildren yeah go ahead and wait there and people who have given up their time and they've traveled and pay the ticket won enjoyed ourselves so I really have to\nWorry about your girl guy come through all stressed out glass [laughter]\nShe's ... she's a nationally renounced the retail or you can see her on the storytelling festival circuit every year that where are you going to be anytime soon gym that people can see you\nOn the right now I'm In Utah but I'm leaving soon and I'm headed to Texas I'll be in Texas for the George west festival and then I go on tour for the holidays and then next year starts a whole new time but you can check all that out on my calendar on my website\nAlright ... website is Kim is funny dot com that's because white camp is really hard to spell that pretty much is funny dot com you get her CDs there as well two things so much for your time I'm looking forward to seeing you again next year and let's talk again sometime\nFor thanks for having [noise]\n\nLegacy three genealogist is a proud sponsor of extreme gene based in Salt Lake City Utah near the world's largest family history library we've worked a genealogist all over the globe since two thousand and four to track down records find your ancestors and the stories that bring your legacy to life we also analyzed DNA test result\nHealthy joined lineage societies and find missing cousins legacy trees and recommended research partner of my heritage dot com and as the world's highest plant rated genealogy from college toll free at one eight hundred eight one eight one for seven six more register online to get a free estimate right\nNow you can save up to one hundred dollars on professional genealogy researched that hurry this offer expires at the end of the mind even experienced researchers can benefit from our proven and experience specialists\nWho can bring new approaches to own problems learn from our free genealogy tips on our blog at legacy tree dot com slash slog legacy tree genealogy as we do the research you enjoy the discoveries\nEver wonder where you've got your rights\nI guess the tree dot com slash slash legacy three genealogy as we do the research you enjoy the discoveries\nEver wonder where you've got your bright green eyes for your infectious laugh thanks to technology discovering your family story has never been easier and we're bringing it altogether Edwards tax the world's largest family history conference registration for ... twenty Nineteen is open joined us February twenty seventh through march second for this incredible four\nDay event at the salt palace convention center in Salt Lake City Utah learn from over three hundred classes on topics such as DNA capturing family stories and preserving legacies for a limited time take advantage of promotional pricing purchase a four day pass for only two hundred and nine dollars if you register before January twenty fifth that's\nNinety dollars off regularly price pass\nExplore over two hundred exhibits and the expo hall and interact with the latest technology joined the excitement joined the fund and discover your family discover yourself discover roots tax February twenty seventh through march second at the ... convention center in Salt Lake City Utah registered today at roots tech dot org\nA gene nice fish are here with a shout out to our patrons club members at patriotic dot com slash extreme genes this is where friends of the show support extreme genes for as little as a dollar a month all the way up to the cost of a very nice burger each month I mean are really juicy one\nYou can support the show and enjoy various special patrons club member benefits\nSuch as acknowledgement on extreme genes dot com special bonus podcast from expert gas like Maureen tailor the photo detective Seymour your genetic genealogist great storytellers and experts on record sets from all over the world we even offer expert advice on specific questions challenging your research\nSo go to patriotic dot com slash extreme genes and get signed up we love sharing your genealogical journey with you on our extreme genes patrons club after all what would you rather have inspiring and informative content\nOr another greasy burger the choice is yours and thanks for supporting extreme genes [noise]\nWelcome back it's America's family history show extreme genes and extreme genes dot com and his Fisher here your radio roots loose\nAnd it's time to talk preservation with Tom Perry from TMZ place dot com here's our preservation sorority we've been talking a lot off air here recently and I I thought you know it would really be fun to share with you\nSome of the stories from the store you know Tom has been doing this digital position and helping people preserved their materials for for decades on and\nAnd so I asked him what what are the stories from the store what's happening behind the counter with Tom Perry and Tom some of these stories you've come up with her absolutely incredible\nOh it's amazing for instance we were playing some of the old candy bombers a movie that he may\nNot stop out who that is now that's colonel Gail Halvorson we've actually had him on the show and he's the guy that drop little parachutes with candy bars to those people trapped in Berlin right after World War two he's still around these Ninety eight years old and you did his ditches invasion of his own movies from that era right\nRight back ... probably been about Twenty years ago he brought in his old down that what is home movies and we try and sort of for him and it's just show called sea and these kids up against the fans and handing gum to on the other little parachutes and all these kinds of things and later planned a DVD in the store actually back\nBefore Blu ray was even big and they had a guy that was just captivated by it so he said oh yeah this is candy bombers how low the shot while he was over there and it was just really enthralled in it\nAnd said that's my grandfather who they are bad bothering pointed to one of the guys and they're building a little parents choose to go on the candy and it was just absolutely incredible he had never ever seen this before\nSo he was totally dumbfounded that his grandfather was asking the same squadron and he stopped district just ask Shelley so cool that you saw this\nIsn't that amazing well that's fun stuff and then you had this thing about the aunt in the park story and this blew my mind\nOh this was absolutely crazy we\nHad a gentleman in now starting to pick up his home movies that was from his mother and Diane is helping him and he gave his name et cetera and this other lady didn't start dropping off some fail said are you related to so and so and he goes well yeah that's my mother\nAnd she goes well my mother was showing show and he goes well yeah I've heard my mother mentioned her name and then she said they were best friends back in the day and high school and said that they remember being in the twenty fourth of July parade and he goes well yeah that's what I just transferred was a fun age that we had of that she goes you're kidding me\nThat's what I just brought in to get a copy of yours and he says can I have a copy of you [laughter]\nOut of that she goes you're kidding me that's what I just brought in to get a copy of yours and he says I have a copy of your [laughter]\nSo it just happened to me in a store and the same time it is such a small world\nWith the same footage basically from two different cameras from from how far back mid sixties I think you were saying\nRight lane like sticking to or sixty three the mistakes that they were in this big parade and they were both than at a high school and younger kids and they had several years on this footage and now they were going to be able to share with each other\nThat's amazing both moms are in it I mean that's insane\nOh exactly you know it's such a small world this is why I really recommend people when they get their film Strasburg they put at least snippets of it up on Facebook or on line someplace on YouTube because you never know who's going to watch your video saying hey yeah\nI was in this parade this year ... he had to watch the whole thing and maybe they were in the background or maybe you just happen to shooting Airflow going by and they have no video of it so it showed need to be able to have this kind of stuff to share it\nPeople around the globe you know you remind me of a story of a neighbor who told me about her dad playing on a college football team and then he was in a big bowl game back in Nineteen thirty nine just before the war broke out\nAnd before he went off to serve in the war\nAnd I went on to you too and I found footage of that football game and we found pictures of her dad playing and of course she had his number\nAnd like other diet you won't feel deprived because you'll be eating real fresh food like garlic in her salmon steak stir fry with fresh vegetables [noise]\nYou'll have more energy than ever before and you'll start to notice you're close to meeting better this patented medication is available only by prescription and you can only get it at red mountain wait in line when he had to lose [noise] losing weight is a lot easier than you'd think with Iran three go to red mountain weight loss dot com that's red mountain weight loss dot com [noise]\nA A R after him when he's Arizona's new is a TA argue we asked them\n\nI'm Brian Clark and eleven people are dead and six others hurt after today shooting at a synagogue in Pittsburgh the Anti Defamation league says is likely the deadliest attack against the u._s. Jewish community in history there was a suspect in custody\nIt was just before today and what a Robert Bowers armed with an assault style rifles and three hand guns entered tree of life congregation is added services were underway and immediately open fire the actions of Robert Bowers represent the worst of humanity\nU.S attorneys got pretty expected a file federal hate crimes charges after the FBI's Bob Jones said the shooter targeted Jews because of their fate\nSuspects for motive was unknown but we believe he was acting alone you said\nThe gunman was in the synagogue for twenty minutes before he was shot and taken to the hospital or an ... ABC News\nAnd bow are still in the hospital listed in fair condition President Trump suggested armed guards and that's in a God could have changed the result but later he told the future farmers of America conference in Indianapolis but it was a horrific event\nThis wicket act of mass murder is pure evil [noise] hard to believe and frankly something that is on a measurable\nTonight the president will be in Murfreesboro Illinois for another campaign rally with ten days for the midterms Caesar say ox due in court for the first on Monday he's the fifty six year old accused of mailing bombs to prominent Democrats and their supporters ABC's mark red alert has more from Florida\nThe arc has a lengthy criminal history including probation for making a bomb threat in two thousand two is attorney in that case Ronald blowing\nI Believe he's been mentally ill from the time I met him uh but I don't believe that he hadn't violent a tendencies at that moment\nMexican authorities have added a blockade allowing a caravan of Central American migrants to keep moving north still hundreds of miles from the U.S you're listening to eighty seat in\nArizona station\nThe AR blonde hair Ninety two three ap him online at ... dot com and streaming live on the T. A. R. news after your breaking news in traffic\nToo good Saturday afternoon on John roller Chandler police this afternoon saying they play it on increasing police presence should valley houses of worship\nGood Saturday afternoon on John roller Chandler police this afternoon saying they play it on increasing police presence of valley houses of worship\nFollowing this morning's incident in Pittsburgh now eleven people have been killed and several officers were shot at the mass shooting this morning at the synagogue outside of Pittsburgh\nMexican better Raleigh's carrying plastic shield slowing the role of thousands of migrants making their way through Mexico on their way to the United states Mexican president Enrique Pena Nieto offering the you are a whole plan offering shelter medical attention and jobs to the Central Americans\nThousands of those migrants have apparently turn that off as down Arizona votes immigration education and healthcare\nTop three issues Arizona voters are most worried about that from a new all age productive insights ABC Fifteen bowl she pulls during managing partner might noble breaks says immigration has trumped education what\nThe current on immigration that actually increase and higher priority among voters that actually education decrease which may show that the red red movement started\nThe poll also shows fifty nine percent of Arizona voters have already said in their ballots one million dollars that's how much the fiesta bowl is give it away to teachers this week McNeely the executive director says the teachers were chosen at random or granting\nTwo hundred teachers wishes for five thousand dollars each so we had a a program where we asked them to you know what would they do with five thousand dollars or four thousand of them applied for it and we randomly drew names\nHe says they want to do on her and appreciate teachers with the wishes for teachers program the teachers will also be honored at this year's fiesta bowl\nGames sell it is an absolutely beautiful day to be out and about in the valley let's get a check in the valley roadways ... has lived in the valley Chevy dealer strapped et cetera [noise]\nOr we have a new class working north Phoenix on seventeenth south on the one that crashed walking several lanes cigarettes if they're in ... new collision off right on this takes us about Saltsman wrote an author freeways we have a crash in Chandler on railroad west of except I drive\nThis report is sponsored by cc's new mediators ... pieces strangest five in the face for a limited time precedent participation very ... looted restrictions to apply I'm Patrick rhetoric is Sharon is\nCertainly a gorgeous Saturday afternoon we're heading for a high this afternoon of Ninety degrees overnight lows sixty three degrees and no rain in the forecast tomorrow's high Ninety One degrees right now eighty four degrees sky harbor was a ... job\nAnd you didn't ... registered investment advisor in the state of Arizona that he wasn't visors Damon Robert not even a TA are are not affiliated exposure to ideas in financial beagles discussion not be considered as ethnic or recommendation to buy or sell any financial vehicle information should not be considered a tax or legal advice individuals should professional to see if any ideas expressed would it\nThere's not a guarantee a future result security fluctuate and when we may be worth more or less and went over to invest in\nEvery champion starts with a goal a dream of finish line in mind so why not take the same approach with your finances David Robertson magic number two wealth advisors who wants to help you come up with a winning strategy\nAnd now winning with money with David Roberts\nAnd met the Phoenix for spending part of your day here with us on Arizona's new facing K. T. A. R. news\nHere with David Roberts and Matt Seaton\nI'm Jennifer Perry we'd love to hear from you today our phone number is for a zero\nSix to zero sixty nine seven if you have any questions for the guys our team members are taking those called off the air today again that's for eight zero six to zero sixty nine seven or visit us online at winning with money radio dot com\nQuestion for you right out of the gate today here guys there I don't want to be argue risk takers\nDepends on what part of your life I we were in Chicago and we went up to the Willis Tower which used to be the Sears Tower and they have like one of those the platform you actually let you step outside of the building you can do the through it yeah and I like no big deal ... and I was a total was\nOn that my cancer like laying down and taking selfies and pictures and I was like get me off\nBut I just had the ... in my stomach so I guess\nWhen I ask you this and that would have anything to do with your kids being out there\nNo I was just ... in a way\nBut I but I bungee jump and I've done a bunch of that stuff is standing there Matthew plastic wasn't plastic I get it feels like do I yeah I was just like give me out and not wanna fall through\nWe stopped at the the famous I don't know if you've seen it to down by the Grand Canyon the horseshoe you know it's a picture of the ... and the horseshoe river right there\nThe the famous I don't know if you've seen it to us down by the Grand Canyon the horseshoe you know it's a picture of the ... and the horse shoes river right there\nWe we stopped there it's right there by Lake Powell and we stopped there on our way back home from our our family reunion and I had the same feeling that I was sitting there it's the sheer drop off there's no guard rails there is nothing and now because of my kids were there and I just kept thinking of them falling off of that is\nWhere I had a sick feeling like I I got I got away with it [laughter] so a fear of heights Damon I've heard you are a risk taker behind the wheel sometimes get you in the right car and it might happen so\nHe borrowed my radar detector I just think hey I was traveling\nAt a good safe speed for all you officers out\nThere yeah yeah no laws broken at least not here in Phoenix anyway we're going to stick with that story but you know guys I think it's okay to be risk takers in certain areas of your life but it's another thing to take risk with your money and especially when you get closer to retirement money recently had this discussion about\nJust how much investment risk is appropriate how much should you be taking after you retire so how old are your clients with that question how much risk can they take with their portfolios\nWe talk about this extensively with clients on a lot of people come in and don't really understand\nHow to measure the risk or most of 'em inherently you don't know if you ask them\nYou know how much risk should you have at this stage of your life and and they'll usually kind of look at each other and and one of the other um usually it's the mail but not always will be the one well I like to take a little bit more risk but my wife you know says I Need to take less for you know they'll flip flop that way it's usually one one or the other\nBut you know they inherently know we need to be taking less than we have but then a struggle to understand\nYeah it has to be part of that comprehensive retirement plan thinking about both of you both together in retirement but also a possibility too that you could lose some income along the way and and Merrill Lynch survey found guys that are more than half of the couples who had lost a spouse recently\nHadn't planned for this but that doesn't have to be listening today and he sat down and had this conversation with your spouse\nWe invite you to do that with us today here on winning with money or having to do that comprehensive retirement plan for the next ten Koppel to call in today at for eight zero six to zero sixty nine o seven start that conversation with us today again that's for eight zero six zero sixty nine o seven\nGuys what other issues do couples need to consider when they're building that comprehensive retirement plan together to prepare for these possibilities\nI think one of the things that kind of throws people off as when you know the plan gets kind of turned on its head mhm and I'm working with a client right now\nThey became a client about six months ago and he was about ready to retire you're starting to have some health issues and so he's like I'm done and I'm going to clean my pension and I'm going to have my Social Security benefits and we should be just fine and they had saved up a decent amount of money in a retirement account and so we're all that money into just a regular investment strategy because\nBased on their plan his pension Social Security would be more than enough and they were going to be paying off some debt and they were going to be getting better prepared or the next five years\nSo that if something happened to one of them Social Security and the remaining part of the pension will be just fine well you know I just sat down with them a week ago\nAnd his health is turned even more for the worse on he was on oxygen when he was sitting in my in my office and he was really concerned he was actually pretty emotional worried about his wife\nIf his health continue to deteriorate and they didn't reached the goals of debt paying off that within the next five years that they wanted to have done and so he was worried that she was not going to be prepared ... and so at that point we had the opportunity to kind of go through their stuff and say okay we'll there's some things and tweak so we can make to your plan\nThey'll put you in a position that if something should happen to you faster sooner than you thought\nYour wife's going to be just fine and you could see the relief start to come across his face and across her face\nBecause again they're dealing with some emotions of bad health and potentially losing someone but we don't want to compound that with having her and him worry about the finances as well and so now we're working to do is put together some plans in place that some of those dollars that he saved up for retirement we're going to allocate some of that over into an annuity strategy\nWill lie in the world where we do that I've heard annuities are horrible\nWell in this particular case their pension and Social Security would not be\nShe will lie in the world who do that occurred in ... are horrible well in this particular case their\nPension and Social Security would not be enough to cover her income needs\nAnd so the one advantage than an annuity has over any other type of investment strategy and they've done all the white paper studies is an annuity will produce more income with less money okay so in their situation they're sitting there going look if something does happen to my husband I'm going to be about a thousand dollar short\nAnd if we needed to generate a thousand dollars a month every single month\nIt would have made them use most of their nest egg to do that meaning that all of that money would after remaining investment she couldn't spin from it or draw from it or take a chunk out for\nYou know to buy a car fixed the sea because she needed to be there so it could produce the next thousand dollar she was going to need the next month and the following month and what we said look let's carve off a little bit of that money let's allocated to an annuity\nAnd if something should happen to your husband we can turn on the lifetime income stream and because the annuity let you take money out faster it would generate that thousand dollars and we could allocate less money into that annuity\nAnd what that does is a freeze up all the rest of our money that if she wanted to spend it if they wanted to travel well he could still do that or something change they have access to money that they could spend quickly or slowly and it won't affect their paycheck or that thousand dollars that she's going to need\nWhen he does pass away nice and so now they're starting to put together a plan\nAnd so we didn't actually had a plan in place it looked like it was going to work based on their situation\nBut then some things change and now we're going to make some adjustments to their plan is going to fit their need so that if something happened before they have the opportunity to get their house paid off she's going to be just fine and so those are the type of situations that again having a financial advisor being able to go through those scenarios luckier different options\nIt brings a lot of peace of mind because you know you have the ability to move in to adjust based on what life throws out you\nAnd you're going to be prepared either way and so you know it's just important to realize that hey you know whatever we envision retirement to look like it's likely going to be something slightly different or largely different what's our ability to navigate that and adjust to that\nExactly and that's really the guys are coming in and sitting down as a cop all coming up with that comprehensive retirement plans together but I Know you guys work really hard with couples to to build in that flexibility too so that when life changes the plan changes with that couple to or the surviving spouse and\nThat's why I stay here on winning with money we are going to offer up that comprehensive retirement plan to the next ten couples who give us a call it for eight zero six to zero sixty nine o seven\nIt really does give you that added peace of mind your spouse has taken care of should something happen to you or you get those goals together on paper knowing that you have a plan that will adjust with you is your life changes together to retirement so\nIt's sort of on that kind of planning process with Damon ... today you can do that during the break here\nFor eight zero six to zero sixty nine o seven be one of our callers today to take advantage of that complimentary comprehensive retirement plan\nAgain that's for eight zero six two zero six nine zero seven or if you have questions for the guys drop us an email through our website this weekend at winning with money radio dot com coming up next a real life case study here on winning with money what ... wanted to learn from Damon ... six\nYears away from their retirement date we'll talk about it next is winning with money can [noise]\nBy winning with money and stuff\nYou see all these artists and Kathleen says make a ton of money and then they lose what have you done to avoid those kind of sick\nOf never been to for money if I stretch of plenty of suspected harder time more interviews on line and when he was money radio do\nAny big plans for the weekend maybe I'll check out that new restaurant even hearing about or how about a relaxing day by them\nWe all have a list of things we like to do if we only had the time\nThose are the kind of things that weekends on me for\nAbout all those things will be able to do after you retire when\nDay is a weekend [noise] the only problem is that you were to do list suddenly becomes more expensive instead of a dinner out maybe you want to bring in the kitchen or instead of a day at the pool you decide to buy a vacation home on the lake\nYour retirement dreams are demon Roberts and not eating of acute while they visors can help you make them come true\nAt for eight zero six zero six nine zero seven to\nThat helps you find those a never ending weekend it only takes a few minutes to get started at four eight zero six zero six nine zero seven or start online\nRadio dot com [noise]\nWe're out of the six nine zero seven or start on line\nRadio dot com [noise]\nHey Arizona Geico presents need to know information because you have to draw the line between what you need to know what you don't\nYesterday I did nothing but he potato chips and ice cream and listened to Eighteen or music\nThe need to know that but when it comes to insurance the more you know the veterans like knowing Geico is the second largest auto insurance in the country plus they've been around for over Seventy five years and have a Ninety seven percent customer satisfaction rating\nHigh only last nineteenth twice a year when the dentist as it for me\nAgain not really needed but knowing Geico offers more than just car insurance is important like motorcycle are being bowed insurance and the guy to insurance agency can help you and your your home apartment condo\nSometimes act like I'm texting someone but really just taking a bunch of cell faith\nAnd not needed but you should know local agents in your area could help you find even more savings with guys like military or federal discounts and guy go offers emergency roadside service switching insurance is an important decision you can never know too much about it so Arizona contact I go on line over the phone or at your local office for all the information you really need introducing the on the\nHoliday tradition\nHere this holiday season remember to shop less stress\nMore holidays scratch tickets from the Arizona Lottery\nDeprived of starting a bus driver supersized twenty dollar holiday down ticket with top ... five hundred thousand dollars down back to regular shift comer\nShake things up this holiday my\nMom was a guiding light light that some ... wearing bell bottoms under a disco ball [noise] I Know mom wouldn't want us to cry now she'd want us to dance\nWith me ... all one even\nLand on the ... or any of our local memorial provider asking how big ... big mini memorial life will celebrate\nArizona's station [noise]\nT. A. R. blonde hair Ninety two three have him on line Katie A. R. dot com streaming live on the T. A. R. news app your breaking news in traffic\nWanting to Saturday afternoon I'm drawn roller here he is what we are following this our\nSo love we love to do there is a we again he was pain in mutual funds some pretty high fees wasn't getting as good a performance as he wanted and wasn't diversified and so what we did is we roll those funds out\nAnd we actually put together a plan that would diversify his strategy give him some downside protection on his portfolio and actually lower seized by about one percent and so again you know the study that Ali on some Bernstein just came out with showed that if you can reduce fees by one percent over the life of your investment\nYou will actually add ten more years of income to your retirement oh wow that's so you know people are concerned about not you know have enough money you're outliving their money well one of the things that they can do that will help solve that problem a big factor is just looking at reducing fees and so that's one of the strategies we implemented there lowered as fees\nAnd then we also help them create a detailed income plan um so they could see where they would be when they got to that day of retirement and how that would look as far as generating income to be able to replace their paychecks so they felt comfortable about retiring\nBut as you looked at their plan they had a lot of money and that was built up an IRA accounts and this is kind of a moving target but what we suggest for them is what we think we get time to retire when we come to that day\nThat perhaps we delay her Social Security benefits maybe a year or two okay take advantage of opportunities to take money from the IRA accounts\nTo fund retirement fund their needs because there'll be doing it at a very low tax bracket so not only are they now taking money out of their accounts of lower tax bracket\nBut their Social Security benefit as increasing because they haven't withdrawn from those or she hasn't withdrawn from those and so this income plan they can now see and look at the spreadsheet and look at this report and see\nThat they have a plan of how they're going to fund retirements six years from now and what it did is it actually made their retirements look a little bit more realistic and\nThen it gets exciting now you're going okay we are prepared okay we have these things we want to accomplish over the next five to six to seven years we want to pay off the house want to do this and that\nAnd as long as we do that we're going to be set in retirement we're going to have enough money will be able to travel will do some of the fun things with the grandkids and retirements gonna look like what we wanted to be I Love that they're excited about that goal\nAnd I have enough money will be able to travel built do some of the fun things with the grandkids and retirement is going to look like what we wanted to be\nI Love that they're excited about that goal line now now that they have that target date in mind and they know how they're going to get there and that's the beauty of coming in one meeting in person with Damon ... what they did for this couple they can do for you to\nWe call it building a comprehensive retirement plan it really takes a look at what you're currently doing for retirement those steps you need to taking those final few working years\nAnd you start to see it takes shape on paper so you can get excited about your retirement as well so if\nYou would like that the R P today with us we're going to do that for ten callers here on the today show and for age zero six to zero sixty nine o seven will make a complementary for you and you give us a call here during the break\nAgain that's for eight zero six to zero sixty nine o seven or just go online today you can sign up there too at winning with money radio dot com\nThat coming up next to you see the ads all the time for things like ... but do they really makes sense for you and your retirement\nWe'll talk about it with Damon ... is winning with money continues stay with us [noise]\n\nHow much money do you think you'll have in your nest egg by the time you finally decide to retire I don't know your exact number but I'm guessing it'll be the most money you've ever had at one time right now how are you planning to protect that money from a market correction for taxes inflation and high fees\nIn case you missed it the key word there was plenty because you really do need to have a retirement plan a comprehensive plan that shows how to invest for this next stage of life a plan that helps you take control of your taxes in retirement and a plan that shows you how to get the best return but with the least possible risk\nIf you're one of the callers that for a zero six zero sixty nine o seven David Robertson net Dayton of acute wealth advisors will help you customize a free comprehensive retirement plan\nJust need to be retired or in the retirement red zone and have a nest egg you want to protect\nPaul Damon and Matt right now for a zero six two zero six zero seven that's for a zero six zero sixty nine zero seven or go on line to winning with money radio dot com\nI think government ... we have over six hundred vehicles that must be sold during our model undeveloped take advantage of the zero percent for sixty much before interest rates go up\nBy eight twenty eight teams don't ask for only thirty nine Ninety nine eight twenty Eighteen escape now only Seventy nine Ninety nine or save up to twelve thousand dollars off on their twenty Eighteen up one fifty perch for the U.S sixty and major drive or at church for dot com civilized please don't touch and Dr\nExperience legendary golf this November when the top thirty six players returned to Phoenix for the Charles Schwab cup championship tickets start at thirty dollars and convicting under didn't for you with a ticket to the door for tournament information and to get your tickets go through Schwab\nCup dot com I saw him waivers and I can't wait to see you at the Charles Schwab shepherds if there are some real every country for ... dot\nHi this is Patrick man I just got back from vacation in the Pacific northwest we said in bed and breakfast places and it was wonderful however there was often far more breakfast than bed\nYou know what I mean suddenly it's French toast and ... and more foods and you may have ever had several mornings at home but it is one of my vacation and it's not going to spoil my after a vacation because I had a friend waiting for me when I got home red mountain weight loss I knew that if I came into my red mountain location\nWith a little too much eggs Benedict on my body I get everything I Need to take it off including a lot of encouragement\nThat and ... three is already showing results see Iran three is an exclusive prescription product from red mountain wage laws that helps me burn off those breakfast and maybe even a couple of lectures to\nRMC ... or any personalized program is as close to you as any red mountain state wide and that's as close as red mountain weight loss dot com [noise]\nThanks so much refunding harm your Saturday here with us on winning with money here with daemon Roberts and met the Ninth Circuit from Harry tickets on line today at winning with money radio dot com you can find out more there about\nDavid ... upcoming community college courses on navigating the new retirement to again that's winning with money radio dot com\nGuys another somebody different shows commercials that kind of thing right now for annuities and I think sometimes it's an automatic turnoff for somebody with a new things have gotten a pretty bad rap over the years but according to US News and World Report they say for certain types of investors heading toward retirement annuities might be one of the best\nAccording to US News and World Report they say for certain types of investors heading toward retirement annuities might be one of the best options available today but what are your opinions on those situations when an annuity might work best for someone\nI think our opinion is you know tread carefully okay and I mean there are so many annuities out there I think when you add a variable annuities fixed index annuities fixed I mean there's so many different types that you have you know I think it's up to like seven eight nine hundred different options you can walk out on that and [laughter]\nAnd daemon I run into him all the time we've ran into some variable annuities that\nHonestly I Can't imagine how they advisors not in jail because our fees are three four I have a client that I'm working with right now\nThat they have a metlife annuity and a nationwide annuity and those two annuities combined the one had three point seven eight percent of the other one had four point six wow in fees every single year that\nMeans a hundred thousand dollars that they knew what he is charging them you know forty six hundred dollars a year in just fees\nWhether girls or not yeah so I mean let's say ... percent return they're going to take half you're going to keep half\nLet's say it had a minus five return you're going to lose five and then you're going to give them almost another five no they can be a a tricky situation but again people hear about 'em there's advertisements on the radio there's advertisements on the TV that are talking about um\nSo what's the draw and at the end of the day what's the draw with annuities is more and more people are retiring without pensions more and more people are retiring with smaller Social Security benefits they're covering less and less of their income needs and what an annuity does better than just about any other investment out there\nIs it can produce income and they can produce income at a higher rate\nAnd it can do it for a guaranteed period of time or for your entire life and so when you're building a financial planner and you're saying man I'm going to retire at sixty five and there's a good chance I could live to Ninety five how in the world am I going to make this money last for Thirty years I only have Social Security\nThen that's why people are considering the looking at a new these because they give the ability to be able to generate that income but again you have to tread carefully because if you buy the wrong time if you get the ones with really high fees or too much risk\nMan you're just shooting yourself in the foot and it's just not going to work out and so when we tell people is number one if you have an annuity you should call us because we can do what's called an annuity stress tests are annuity X ray and we can actually pulled back the curtain to tell you exactly how much your pain and fees\nWill tell you what kind of risk taking and what kind of features and benefits you have\nI had one client that they came in and they thought they had this great annuity that was going to be able to generate income for as long as they both live\nAnd when I got into the details they had what was called an income writer they're pretty popular these days and this income writer it was designed to build a guaranteed income for life but when we got into the fine print what they didn't realize they had picked up and do it ... that have a single life income writer so ended on there", "show_name": "The Dave Ramsey Show", "year": "2018", "city": "Glendale", "day": "27"}