{"month": "10", "state": "MS", "station": "WMPN", "content": "\nHarmonious society of tickle fiddle gentlemen played the violin concerto indie from Seventeen forty by yourself Antoni Gretzky\nSo they broke a supportive other Richard ... fun at Hartford foundation for public giving providing support institutions that are committed to enriching life in Connecticut including the Hartford Stage Company and the Connecticut guitar society\nThis program is produced a double usa chew in Fairfield, Connecticut but Julie ... with help from Rick address at WTC Cincinnati Hi Suzanne bona at this it's Sunday baroque\n[noise]\nSwedish recorder player Dan Lauren straddles\nThe century you regularly performance boroughs and renaissance music\nBut he is also committed to broadening the repertory in promoting the recorder is a legitimate concert instrument today and he is responsible for a number of contemporary work featuring recorder coming up in the next hour Sunday baroque\nYou'll hear Dan Lawrence playing are really in turbulent concerto by Antonio people all the [noise]\nThe globe is your home for the great American song\nEach week old showcase the best to local jazz in popular song Nineteen thirties today from Frank Billy Ella talks like curtailing Dianne Reeves and Greg reporter Marshall I spent some time with after glow Sundays that's it and be be music radio\n\n\nStations have been P. B. music radio R. W. M. A. H. Biloxi there'll be MA ... W. M. A. U. Butte there'll be impeded in Jackson\nW. M. A. W. Meridian W and maybe start for W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line\nDot org gee this is talk on tape around ... bono [noise]\nIn fourteen Ninety to ... the ocean blue and what did he and his fellow and venture Sam on besides the contestants enter Maria they see I'm On the water and today you'll hear some ... some of the George predator candles water music another musical discoveries for Columbus Day weekend [noise]\n\nGeared to the calamine was commissioned to compose music in celebration of the ... admiral tease one hundredth anniversary he fulfilled the condition with a sweet called ... ad and flood it's also referred to as much water music you'll fundamental plays the Sarah banned for re from it [noise]\n\n\nGood for you to go to ... broke workers get played that can trigger number twelve by Lorenzo get tornadoes other theory which has the nickname the camp best you're listening to Sunday paper route\n\n\n\n[laughter] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n\n\n\nThe quarter player Dan learned was the cello west with dropping home baroque ensemble playing on Tony of all these temp custody in Iraq or storm the concerto re I'm number four hundred thirty three\nGiovanni pier Luigi ... was born about a hundred fifty years before his Ali this is Palestinian snow kept by the rivers of Babylon Sunday voices of ascension\nOh\n[noise]\n\n[noise]\n\n[noise]\nOh [noise]\n\n\n\n\n\n\n\nOh [noise] oh [noise]\n\n\n\nOh [noise]\nOh [noise]\n\n\n\n\n\n\n\n\nOh [noise]\n\nOh\n[noise] oh\n[noise] oh\n\nNo\nUh\n\nDennis Keating lead voices of the century and singing by the reverse of Babylon by Giovanni during the week ...\nSunday baroque it's supported by their Richard peak are many find it hard for foundation for public housing providing support to institutions that are committed to enriching labs in Connecticut\nIncluding the Hartford Stage Company and the Connecticut guitars society this program is produced at W. S. H. E. in Fairfield, Connecticut by Julie pretty now and ...\nWith help from Rick Andreas at WG UC Cincinnati\nI'm Suzanne Boehner and this is talk on tape around\n[noise] okay what is the musical form detected sacred choral composition\nAnd you'll have to ... six of them one of them was composed in late Seventeen twenty nine for funeral service Johan Heinrich ... director of the school of St Thomas whereby taught the title of it is the spirit down our weakness help and coming up on Sunday for rescue here that I'm ...\n[noise]\nWell\nA great orchestrating full flight is the most amazing thing to cast let you experienced that thrill every week [noise] Hi this is Brian new house we touched down and terrific orchestra towns from Boston to San Francisco you the best of Europe and Asia\nAll captured my encounter sympathy\nFrom American media Sunday Morning at ten on MTV music radio\nStations have been ... be music radio R. W. M. A. H. Biloxi there'll be ... bimbo W. M. A. U. Butte\nW. M. P. M. Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood chicken ...\nOn MTV music radio and listen online at MVP on line duck board gee\nThis is Sunday borough I'm Suzanne bona\n\nIt's a holiday weekend both here in the United states for our neighbors to the north in Canada October eighth this year is both Columbus Day and Canadian Thanksgiving Day today you'll hear some music from Christopher Columbus his time as well as performances by some outstanding Canadian musician\nA [noise] a\n\nDog\n[noise] God\n\nQueen Isabella and king ... had a famous role as financial backers of Christopher Columbus his travels in fourteen Ninety two they also had an infamous son in law their daughter Catherine of arrogance was the first wife of Henry the eighth the king was a lousy husband but he was an avid music lover and he composed least ...\nPerformed by an ensemble called Siri no ...\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\nThe Waverly called so we're seeing anonymous music from Christopher Columbus is time sailors love letter to Sicily I have seen a map of the world and I think this will be the most beautiful long live the great king Ferdinand and the ... cross over the ...\nIt's very into any one place to music from queens is the bill is like ... like what do you see now in print the school day like today Mm\n\n\n\n\n\n\nNa na\nNa\nNa na\nNa\nNa\n... variant when the one ... music by to damage composers of Christopher Columbus is time appalled by now like one bill in ... and the ... well yeah my friend she's good de la ... you're listening to Sunday baroque\n\nThis program is funded thanks too generous support but the friends that they were real who's contributor including Barbara and Gregory jokes just a western Connecticut\nToronto based ... music chamber choir is the sister group to talk on music for real orchestra\nAnd tumble of twenty two singers specializes seventeenth Eighteenth century music and their leader is ... tour and this is talk of music chamber choir singing you'll have to master ... the spirit ... hour week ... ...\nNo no no no no no no\nNo no I'm a I'm a I'm a I'm a\nI'm On my own [noise]\nOn one of\nMy aunts and my wife\nAnd I\n\nKnow\nThat the man\nWho\n\n\nIs\nStill a a\nNo no no no actually I Am\n[noise]\n\nA nice guy and\n[noise]\n\n\n\n\n[noise]\n\n\nDeepens ducks directed already on baroque orchestras playing an overture by George Frederick handle if you're on Facebook I Hope you like I'd follow this Sunday brew page you can also look up more about the music read my block or here today show again later this week by visiting Sunday baroque dot org\n... [laughter]\nSome people talk about that [noise]\n\n[noise] [noise]\n[noise] but [noise]\n\nBut [noise] but [laughter]\n\nSunday baroque is supported by the John Moriarty Institute for ecology and spirituality at Sacred Heart university\nAnnouncing an eight day adult educational journey to Ireland cued force it through eleven twenty Nineteen John Moriarty Institute dot org\n[noise] maybe I don't do while we're at the ... are Canadian musical group founded in Nineteen eighty four by Bernard Law but deep when he was a student conductor in Quebec City\nThe kinks violence plaguing our cat's real overture by you'll have freedom I thought that was what ms attributed to his father Johann Sebastian\n[noise]\n\n[noise]", "year": "2018", "show_name": "Weekend Edition Saturday", "city": "Jackson", "day": "07"}