{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\nThe early music group had custody Monterey at champion music by Johan predicts posh and their second volume of for Castro music by posh temp custody Mari played one of his since he has\nSaid they broke us supported by the Richard ... fund at Hartford foundation for public giving providing support to institutions that are committed to enriching lied to Connecticut including Hartford performs\nConnecticut coral artists and theater works this program is produced a double usa chew in Fairfield, Connecticut by Julie for dino injure Welsh rock with help from Rick on dress a double duty UC Cincinnati I'm Suzanne Boehner and this is Sunday baroque\n\nSeventeenth century Dutch musician ... played below the gumbo moved in Oregon and his bread and butter job with teaching wealthy businessmen in public officials interested in music as a hobby one of his students with the future mayor of Rotterdam in the next hour Sunday parochial here is so not a ... court cater to the mail [noise]\n\nShallow me off I'm Andy motion hosted sounds Jewish every Sunday all present in quite the entertaining our Jewish music and usually comedy the jazz from New York to talk from Israel\nWedding dances from Europe devotional Jewish song marathon shower\nShower [noise]\nI Hope you join me on shelves Jewish Sundays at three PM on MTV music radio beyond wind\nThe stations have been P. B. music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. M. Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online duck or gee\nThis is Sunday baroque I'm Suzanne bona [noise]\nThe United nations was founded in Nineteen forty five in each year\nHad occasion celebrated on October twenty fourth in honor of un day Sunday baroque will offer a multicultural collection of musical ideas including charming English major bills flute sweet by a mystery Frenchman concerto by your Philip tell him on that was partly inspired by polish folk music [noise]\n\nGiovanni ... went to France as a boy and became ... to invest a demar a play some of the belly of nations from ... the Bush one gentleman\n[noise]\n\nCard to play around with no that was featured could Washington clean Michael Macron's Julia ... ... Charlie sticker played the sweet tempered nine my French been Francois shell\nSixteenth century English musician Thomas really worked as a church organist who was your music publisher John Rocker leads the keyboard singer is a two bedroom bill\nIt's more like fire fire and my Bonnie last she's violent\n[noise]\n[noise]\n[noise]\n[noise]\n\nAbout\nUh oh [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\nNo no no no no I'm I'm I'm a\n\nBig one [noise]\n[noise]\n\n\nUh no one was on a long long long long\nAh um uh\nMy son and I said my God [noise]\n\nWhen I'm On a um [noise]\nMy buddy and understand the Wednesday might not thank God I\nDon't know oh my oh\nMy God I Love the smell\nOf the mountain on a\nOn a\nLot of them a long long time but I don't know\nWhen they do that's my hobby [noise]\n\nAbout whether or not um [noise]\nWhat is your favorite or might not\nKnow about a no\nNo no\n\nNo no no no no I'm I'm calling from\nLa\nLa la\nLa la la la la some some I'm\nJohn rather like the Cambridge Singers in pairs magical sixteenth century English midtown is really has meant a lot of sickness fire fire and his son my Bonnie last she's smiling you're listening to Sunday baroque\n\n\nWere present Deborah confront the word Family Foundation Nineteen Ninety five providing are granted your community and across America\nIncluding gauge Academy of art in Seattle, Washington on line at ... dot org\nYour musician character ... was so impressed by the music and musicians he heard there that he tried to imitate polish idiots into some of his own music [noise] this is going to tell them on the polish concerto played by rebel baroque orchestra\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\nMm\n\nMm\n[noise]\n\nMm\n[noise]\n\n[noise] Mm\n\n\n\n\n\n\n\n\nJohn Halloween Stanley Ritchie and Andrew Nancy where the violin is playing so not pretend like ... ...\nIf you're on Facebook I invite you to light can follow this Sunday ... Facebook page with us interesting tidbits about the music and performers\nIt's a great way to connect with other listeners you can go to our website to see all the details about the music recording read my blog and here today show again later this week it's Sunday baroque dot org\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\nSo they were real cause supported by the John Moriarty Institute for ecology and spirituality at Sacred Heart University in Fairfield, Connecticut announcing and each day adult educational journey to Ireland June fourth through eleven twenty Nineteen online that John Moriarty Institute dot org\nLosing his comic finally recently released a terrific recording called the Celtic loot and that includes these two traditional Irish ...\n\n...\n...\n...\n\n\n\n...\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\nFlew to screen a Fisher cellist plus Peter Brand to the court is Leon ... played the ninth split sonata by Swedish composer you hadn't hadn't musher I'm On\nIf you're on Facebook you can find some deeper up there too you can also look up more about the music and musicians you're hearing or listen to the today show again later this week to visiting our website Sunday baroque dot org\nSunday baroque has produced at the Richard ... classical music production suite at W. S. H. E. public radio in Fairfield, Connecticut where the production team includes Julie for dino and Joelle struck we also had help from Rick undress WG UC Cincinnati and Suzanne Boehner and this is Sunday borough\n\nAnderson and wrote piano do you I was a collaboration between two exciting performers who met at conservatory classmate Anderson's mission is to make classical piano music relevant and powerful force\nIn society and the euro has documented many of their collaborations on video is coming up on Sunday baroque Anderson and grow played by [laughter]\nA great orchestra in full flight is the most amazing thing and simply can't let you experienced that thrill every week Hi this is probably a new house we touchdown and terrific orchestra towns from Boston to San Francisco and get the best of Europe and Asia\nAll captured life encountered sympathy from American public media Sunday Morning at ten on MTV music radio\nStations have been P. B. music radio R. W. M. A. H. Biloxi WMA bimbo W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening\nOn MTV music radio and listen on line at MVP on line duck or gee it's Sunday baroque I'm Suzanne bona\nMy district books to who they got the job and we're going to see Mary's church new deck his predecessor was from singer who died\nAs was expected to who to married hundreds daughter and near the end of his career there are a number of musicians visited doctor who did the scope out the job and decide whether they wanted a chance to be a successor\nDemand is exceedingly after his death was Johan cheaper decker and yes\nMary ... daughter coming up music by all three men as well as one of those other musicians who visited\nYou'll have Matheson was a writer diplomat and professional musician who worked his canter and organized Hamburg cathedral feel really play an excerpt from a sonata composed by ... percent [noise]\nAll\n\n\n\nAll\n\nAll\nAll\n[noise]\n[noise]\nOoh\n\n\n[noise]\n\n\n\n\nOh\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\nBerlin academy for each in music played the premier hunter my Johan Christiana she for decker you're listening to Sunday paper route\n[laughter]\n\n\n\n[laughter]\n\n[laughter]\n[laughter]\nCome to\n\n\nThis program is funded by the friendship Sunday brew who's contributors to include Dr Louis piper is Jeffrey Connecticut John Halloween plays a baroque violins with that string special ... you also prefers to use autograph manuscripts of the music he played so he can learn from the composers notation handwriting\nAnd he researches the historical context of the music so it can inform and influences like\nThis is John how we're playing a sonata by Dietrich books to who do\n[noise]\n\nMm Mm\n\n\n\n\nMm\nMm\nMm\n\n\nMm\n\n\nA\n\n\n\n\nSchool\nTo\n[noise]\n\n\n\n\n[noise] [noise]\n\nI mean the ... to\n\n\n\n...\n\n\nReally in a\nRural ...\n\nCounty [noise]\n[noise]\n[noise] [noise] Mm\n\n\n\n\n\n\n\nAlexander ... temple were bought out with counter tender Matthew White singing the cat here my savior by from there it's more about the music on our website Sunday baroque dot org\n\n\n\n\n\n\n[noise] yeah\n\nThey\n\nSaid the aerobics supported by Sacred Heart university helping students harness their full potential to become leaders in their fields flexible fooling part-time undergraduate\nThat you would ... secret hard do you\nLike and she doesn't she when they were students at the Juilliard School in New York began to CNN Elizabeth joy wrote forget piano do you make an animated performing can sure at the numbers music videos of their collaboration the nomination do you want to check out their videos there's a link to their YouTube channel I didn't think it was ...\nLet me see Anderson in ... playing their own suite for two pianos on you'll have the best you see ...\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]", "show_name": "Weekend Edition Saturday", "year": "2018", "city": "Jackson", "day": "21"}