{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\nThe second suite of ancient heirs and dances between about oh just two years before World War one about Nineteen twelve Nineteen Thirteen he was working on the first one\nAnd it was about ... I think about Nineteen thirty two that he was working on the third set of ancient ears and dance so it took up quite a bit of the early part of the twentieth century for rest biggie that was the chamber orchestra last time they were led by hate says Lopez ... I'm going well thanks for joining me\nShallow me off I'm Andy ... sounds Jewish every Sunday are presented with the entertaining our Jewish music and usually comedy the jazz from New York you talk from Israel\nWhen he dances from Europe devotional Jewish song marriage in South\nEastern shop [noise]\nI Hope you'll join beyond shall Jewish Sundays at three PM on MTV music radio ...\nStations have been ... be music radio R. W. M. A. H. Biloxi there'll be ... ... ... you may you Butte\nThere'll be MP in Jackson W. M. A. W. ... W and may be structural W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at ... be be online\nOr gee\n\nOften when you hear about ... symphony or read about it in program note somewhere they'll say well you know he was very very young when he wrote that desperately didn't want to be a school teacher\nAnd he was trying to avoid that as a living [noise]\nTrue he was sixteen in October of Eighteen Thirteen when he was finishing up his first symphony\nRight it because he didn't want to be doing something else he wrote it because he was finding his voice in many ways you listen to this one it sounds a little bit like hiding in a tribute to the past and certainly his teacher Sal year itch but it also looks to the future the first symphony coming up\n\nThis is the march from the tale of dark cell Tom by risky course of the constant Wellstone ... led by Andre private\n[noise]\n\n\n\n\n\n\n\nOh [noise]\n[noise]\n[noise]\n\n\nChallenge to Maria legal pianist Nina teach them in the end the ...\n[noise]\n\n[noise] you realize that most of Schubert music a lot of it wasn't published until well after his death in to the late Nineteen century when it was finally included in the complete works edition and they didn't publish it until almost you know on the cusp of the twentieth century really which is pretty amazing when you think about it\nWell this word dates from the fall of Eighteen Thirteen he was sixteen years old\nAnd this is a very polished symphony but you know what he was working on a lot of other things that were symphony like\nA before this he was doing some symphonic overtures and he actually did try a couple of times to write a symphony before he finally came up with the ideas in this one\nAnd the ideas for a sixteen year old brilliant not entirely original very influenced at this point in his life and career by his teacher Antonio cell Gary and by default also by most ardent heightened says oh it's a lot to the to the Eighteenth century\nAnd that was not published until nearly the twentieth here's the symphony number one indeed with the academy led by Neville Mariner\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\nMm\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\nNo no no no\nKnow [noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\nWhat\n\n\n[noise]\n\n\nMm\n\nMm\n\n\n\n\n[noise] [noise]\n\nWell I'm I'm a\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\nMusic vacuum outside sign the contract Easter hoarding orchestra with Herman dominate the like say ... ... ... ...\n... to date a reader tomorrow a leader is all about the power overeating and not do with twenty fifth we want you to celebrate that power as we read for the record for your support for literacy for every child in Mississippi didn't take the pledge to read the book menu something beautiful when October twenty fifth\nLogged on to our website can be be online dot org pool information in October twenty fifth let's read for the record\nThe stations been Bebe music radio R. W. M. A. H. Biloxi WMA ... W. M. A. you view W. M. P. in Jackson W. M. A. W. Meridian W and may be struck W. M. A. V. I. W.\nYou may know ... chicken what's happening on MTV music radio and listen online at ... be online or jeep\n\n... when\nWhen I\nWas about a certain generation of French composers but they certainly state extremely well\nConnected with childhood which I think it's a good thing Ken [noise]\n\nWhether it was children's quarters sweet by calling ... the er the deli sweet thanks for re\n\nWhich is these days contribution to childhood memories children gain [noise]\nComing up in ... [noise]\n\n\n[noise] he's at the London Mozart players led by the ts bomb right in the second movement of a gene minor symphony\nBy ... and composer Johan ... hall\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[laughter]\n\nWhat was your favorite childhood game I think most of the time I was pretending that I was a horse or I was riding a horse it was all to do with Roy Rogers mostly who was my hero at the time or any dog that was on TV like renting tenor lassie yeah that's where my games\nThose were these days in music children's games the Paris orchestra led by ...\nWell here's childhood from a Chinese perspective the children sweet as it's called children\nSweet by being Shonda and performed here by pianist each [laughter]\n[noise] [noise]\n[noise] [laughter]\n[laughter] [noise] [noise]\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[laughter]\n[noise]\n[noise]\n\n\n[laughter]\n[laughter]\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] [laughter]\n[laughter] [laughter]\n[noise]\n[noise]\n[noise]\n[noise] [laughter]\n[laughter]\n[noise]\n\n[noise] [laughter]\n[laughter] [laughter]\n\n\n\n[laughter]\n[laughter] [laughter]\n\n\n\n\nMm\nMm [laughter]\n\n\n\nYeah I\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nClarinet is Paul ... and the legal national park is led by your mackerel that was the first Rhapsody and the ... de ... Debbie see the breadth\nOf lily Madsen and if you'd like to tell your classical story you can check out that feature at your classical back to work a chance you can record your story in the piece of music played to match\n\n\n\n[noise]\nNo [noise]\n\n\n[noise] this is Ashley by chamber orchestra led by Thomas said play be a major symphony number four team by must talk\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n", "year": "2018", "show_name": "Weekend Edition Saturday", "city": "Jackson", "day": "20"}