{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n\n\n... says Montreal performed and instrumental sweet from Antoni oh there's all these opera about the long suffering wife and mother Griselda\nSunday baroque has produced shut the Richard ... garden many classical music production sweet ... SAG public radio in Fairfield, Connecticut where the production team includes Julie for dino enjoy Welsh rock we also had help from Rick I'm Krista WG UC Cincinnati I'm Suzanne thunder this is Deborah\n[noise]\nHalloween is coming up later this week so when the next hour Sunday baroque you will hear creepy looking shared oh by Antonio there's already some witches and berries from Shakespeare end in Oregon to Colorado that has become known as the key is to music you'll have to ask you if I ever ... [noise]\nHow do you know when something nor can is an overdose reversal drug vet save thousands of lives in Philadelphia every year but knowing when to use it can be complicated\nCertainly if you had somebody is you know six foot four and there's like three hundred pounds you want to be very very careful how you wake up purse it up you have to be prepared to protect yourself on the next MORNING EDITION from NPR News tomorrow morning on MTV big radio\nStations have been ... music radio R. W. M. A. H. Biloxi there'll be a may ... W. M. A. you view\nThere'll be MP in Jackson W. M. A. W. Meridian W and it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio\nThis is an online at him be be online duck or gee this is Sunday for real I'm Suzanne bona [noise]\nIs coming up this week is an ancient times the occasion was observed as the eve of the new year time when the world to the living in the dead overlapped tricks in our goody bag but we are handing out some spooky musical treats such as the density fury from Christopher looks opera about or fear to ventured into the depths of the inferno to rescue his eleven [noise]\n\nStay in touch with them is a musical group at the contours of ... the name has nothing to do with horror movies they chose it because they wanted a memorable name ... plays a pair of fantasies by sixteenth century English musician John Ward\n\n\n\n\n\n\nOh oh\nOh oh\nOh\nOh\n\nOh\n\nOh\n\nOh oh\n[noise]\nMusicians at the globe played tennis that's Lindley juniors oh don't which isn't very Shakespeare crystal feel about look stand at the doctors from his Don Juan was so effective if capturing the ... were meant to be under world that he recycled it at the dance of the fury and his brother for the U.S [noise]\nAcademy of ancient music played Cristo deal about looks dance of the few worry you're listening to Sunday ...\n\n\n\n\n[noise]\n[noise]\n\nOregon is Tony ... played the famously spooky took out to be monitored by Johann Sebastian Bach it mythology Cyclops\nWas an enormous a one eyed monster Cyclops is also the name of one of your kidney problems compositions a keyboard so low seared your direct not perform it onto guitars\n\nMhm [noise]\n\n\n[noise] [noise]\nMm Mm\nMm [noise] [noise]\nMm Mm Mm Mm [noise]\n\n\n\n\nMhm [noise] mhm\n\n[noise] [noise]\n[noise] [noise]\n\n\n[noise] Mm Mm\nMm Mm Mm [noise]\n[noise]\n\nMm Mm Mm\nMm Mm\nMm\nSarah Jill and do dire outside played the Cyclops like ... I Know\nIf you're on Facebook a hope you'll like getting followed this Sunday baroque Facebook page and you can see all the details about the music and recordings you're hearing on our website Sunday baroque dot org\n\n\nCindy baroque is supported by secretary university helping students aren't as their full potential and become leaders in their fields with flexible full in part time undergraduate and graduate programs information and applications online Sacred Heart dot E. D. U.\nFine arts brass ensemble plays music from the English courts by composers born in the late sixteenth century John ads in devil's dance Robert Johnson's comedians mascot the Mary Clark and none of us do you have to be [noise]\n...\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n\nWell when is Joshua Bell and hearts accord is John Constable played just sipping turkey needs to not in the minor opens one number for the devils shrill sonata\nSunday baroque has supported by the richer ... fun that hard for foundation for public giving providing support to institutions that are committed to enriching lies in Connecticut including Hartford corral Connecticut science center in the Elizabeth park conservancy its program is produced a W S H U in Fairfield, Connecticut but Julie for dino enjoy about Trump\nWith help from Rick Andrea WG UC Cincinnati I'm Suzanne Boehner is this Sunday borough\n[noise]\nAlthough the famous ladies' man Casanova was the nation\nAt the music used in the heath ledger film was by Eighteen century French composer he'll be coming up on Sunday parochial here the overture from Reynolds opera ballet the temple of glory which was used in the two thousand six soundtrack [noise]\n\nLarry more arts commission please turn this afternoon for the arts\nDetour receipts rich ... this week reporting an interview with a Jackson photographer James Patterson recently passed away\nPatterson has along with the commercial quiet according to New York times but you also many time to assist to promote other artists in central Michigan quitting posting art shows culture in the studio space that's the Mississippi our to our today at five it'd be think radio\nStations have been P. B. music radio R. W. M. H. Biloxi WMA boondoggle W. M. A. U. Butte W. M. P. in Jackson W. M. A. W. Meridian W and maybe start full W. M. A. V. Oxford W. M. A. O.\nCheck out what's happening on MTV music radio and listen online at him be be online duck or gee\nIt's Sunday baroque I'm Suzanne bono [noise]\nBritish musician Nicholas Nikki can plant to study contemporary music and compose but he's required class and acoustic met in the home of the professor who happened to collect Eighteen century would win the instruments begun already played modern flee to try that one of the teachers broke loose and it changed the patent is education and his career\nNicolas thinking recently announced his intention to retire as music director up till her ammonia baroque orchestras said today we're reviewing the remarkable career of the Buddhist tops the court is conductor and all around baroque music expert\n\nWhen Nicholas Nikki Kim was a student in the late sixties and seventies baroque music wasn't yet is popular unfamiliar as it is today but Mickey can attended modeling college in Oxford which has been around for five hundred fifty years and has a thriving choral tradition going back to the ... century\nThe choir of modeling college Oxford sings music by William bird [noise]\n\nOh\nOh\n[noise]\n[noise]\n\n\n\nOh\nWow [noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\nNicholas Nikki ... the our kid academy played a suite of errors seventeenth century Italian violin virtuoso Nikola ... you're listening to some ...\n\nThere's trauma this Sunday thanks too generous ongoing support provided by the friendship Sunday baroque who's contributors to Dr Louis keeper Stratford, Connecticut\nNicholas begun played modern flu but one of his professors collected Eighteen century would would ditch you mentioned let them try your ... which instantly appealed to him Christopher hardwood also happened to be an acquaintance he invited me to join the Academy of music [noise]\nThis is one of the recordings they may together ... concerto and see for two fleets played by food is Nicholas ... and Stephen Preston [noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\nMm\nThe court is Nicholas Nikki can play the sweet from your Sebastian bucks on a mock delina notebook\nNicholas Nikki can recently announced his impending retirement from his music directorship of the still harmonious ... at the end of the twenty Nineteen twenty twenty season you could see the press release there's a link to it on today's music playlist page at Sunday baroque dot org\n[noise]\n\nSunday baroque has supported by Sacred Heart University in Fairfield, Connecticut named him on the top colleges in America by Forbes information adapt locations online at Sacred Heart dot E. D. U.\nIn his decades as music director of San Francisco's feel harmonious baroque orchestra Nicholas sneaky get has initiated the samples participation in unique collaboration\nSuch as with the innovative mark Morris dance group and he always champion lesser known music this is still harmonious grew up playing a sweet from jumping brumbles opera ballet the chemical look glory\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "show_name": "Weekend Edition Saturday", "year": "2018", "city": "Jackson", "day": "28"}