{"month": "10", "state": "TX", "station": "KUT", "content": "Right I mean\nImagine there must have been more cocaine on those that\nThrough the day that was the track live [laughter]\n[noise]\nWell I got Jamie Farr stopped running [laughter]\nOf those people who are on those [laughter]\nEventually it must have been eighty six eighty seven that the new Star Trek uh started up and you were recruited by none other than gene Roddenberry was off yeah it sounds to me that the guy started Star Trek way back when\nIt was tremendously exciting I'm a huge science fiction fan and I'm Jean ... who was one that really meant a lot to me than when the future comes there's a place where you've seen the show Nichols on the bridge that ship 'em in that when the future got here there\nWas always for people who look like when you were like some day I Will be able to kiss William Shatner [laughter]\nWhich I have done\nWho joined us out of the networks\nI'm Wondering you for joining the forge chief technical officer I'm not quite sure that you can join me here who's you know\nAnd one of your specialties was delivering probably the most amount of what the fans go trekking though battle yes um and can you remember at the top of your head and he really you know\n[laughter] if I remember correctly half the time the problem was neutrinos and just fixed it was ... that\nThat was like I Would almost played Star Trek thing do like a book by brothers like it's going to attack Iran ... [laughter]\nA moment where you just wanted to save the jury report what's wrong you know [laughter]\nWell one of my favorites um raises a bed Jody did have occasion to order on more than one occasion was\nWell we're so delighted to talk to you but we're here to play a game we're calling welcome to George ... sure you're already [laughter]\nNow as you may know\nAlready which was the name of your character and start is also the nickname for the people from New castle a town in the north of England did you know I did you okay we did not know that we found that out\nApparently Newcastle the area is a lot like New Jersey because the M. T. V. set their British version of the reality show Jersey Shore in a house filled with ... okay it's called ... short so we're going to ask you three questions about that TV show\nCorrectly you win a prize one of our listeners Billie with love our Briton plane\nAdam Pedro Brooklyn New York\nAre on the cast members of the show has become\nMuch like their American counterparts are legitimate celebrities and Britain with endorsement deals and even products to sell what's your knees was a real journey shore endorsed product you could buy was it a dirty war\nA thirty pound chunk of wrought iron autographs by the cash [laughter] you know did Jody the world's first ever ... Bob center the perfume or see a soda called\nCola to Newcastle or not I'm going to go with the here to go see cola to Newcastle yes there was actually low did you already\n[laughter]\nPerfume that was that did like Bob's which apparently was their favorite thing to eat I\nSell to our chances some of the cast members\nHave gotten so famous or does it written memoirs including star Charlotte Church her autobiography was called what a behind the fake can be the diary of a shallow girl or see me me me [noise]\nGood choices all Charlotte\nI'm going to go with ... you're going with a behind the steak ... yes ...\nYou have to remember these people are sort of on TV because they are nurses is what I meant to say was seeing me me me\nThat [laughter] [noise]\nLast question\nIs you get this right here with many of the stars of dirty shore went on to star and other British reality shows including which of these a the prints and the ... which is a member of the actual royal family switches places for a week with a commoner\nMeat axe on the beach in which men and women tried to strike up a romance at a sunny resort while their exes are there to try to sabotage for them\nTo see the great British snake often which contestants compete to clear clogged drain [laughter]\nThat they hadn't been entertainment which ... yeah\nTo be you want me to see it [noise]\nYou know\nHow to how how does all of our Britain doing our quiz\nWell how did you get down to the roots of it\n[laughter]\n\nI could add this to your ... incredibly long list of achievement right to the top of the\nRadio like that doesn't just happen it happens because if you and your support without you imagine where we might have to get our money\nSupport or NPR comes from NPR stations and Volkswagen who's cars feed the world's plants with lots of extra carbon dioxide [noise]\nYeah that's a ... Volkswagen by one by one now or they're totally screwed [laughter]\nKombucha the drink you pretend to like show your friends at the ... yoga studio want this out [noise]\n\nPromotion can be found in the trash can where you just throw away a bottle of Cambodia and PBS chilling Ken Burns' new Eighteen part series on the history of PBS pledge drive [noise] PBS even worse than reading [noise]\nWe\nCare to but only a little\nWe're trying to point out that there is a better way and that better way as you here's how to help support\nThe station and they wait wait don't tell me is your favorite show support the station K. U. T. in Austin, Texas right now but I can only find one to four seven one six to nine what\nWe're going online to K. U. T. dot O. R. G. this is the un on the unofficial start of our phone membership Dr will will\nGet things kicked off in earnest on Monday morning at six thirty but\nA couple of hours did a couple of hours tomorrow or giving you an early bird chance to not only take advantage of some special incentives will be telling you about one of those in just a moment here but also give you a chance at our early bird special\nThat's right we have an early bird special with a pledge of ten dollars or more on line and ... or ... by one to\nFour seven one six to nine one will say thanks with the brand new K. U. T. public radio nerd T shirt and two of our cool new plastic eye glasses get all the information check them out online at K. U. T. dot ORG\nSupport comes from poor hands home celebrating its month long dining event underway now and then ends October thirty first open daily one mile eastern south Congress that twenty Ninety Woodward street and at for Hans ... dot com\nSupport comes from building to some south whisky you with for sports activity models from the narrow hybrid sub compact s._u._v. to the seven passenger syringe show all available with apple car play an Android Auto southwest kid dot com\nTwenty percent chance of showers before about one o'clock today otherwise cloudy with a hundred Seventy mostly sunny tomorrow with a mind near sixty eight that sounds great currently it is sixty five degrees that K. U. T.\nK. U. T. ball membership Dr officially started Monday but there's no reason to wait wait because we have a great day only deal for you with any contribution to sixty dollars in a Bob in addition to any thank you get to follow by more including the early bird special\nWe do wait wait don't tell me twentieth anniversary bashed a double album leg digital downloads\nThe speeches over two hours of fantastic wait wait material from its first Twenty years energy yours when you contribute sixty dollars or more\nMature to select it as one of your thank you gifts from the drop down menu when you contributed get Eugene data war G. or you can tell the nice person it by one to four seven one six to nine one\nThat you'd like to wait wait twentieth anniversary digital download as one of your thank you gifts that's today only so don't wait wait details at ... dot org aim banks [noise]\nFrom NPR and WNYC your your hour of puzzle word games and trivia I have been the other ... jobs in golden and here's your host\nOf fear I think Jonathan today we're revisiting some of the most memorable interviews and games we played with celebrity guest and if you like what you hear make a donation to your public radio station and if you don't like what you hear\nDoubled the donation first step is one of my favorite interviews you know him from Star Trek the next generation the X. men movies and no meal and Juliet CERN Patrick Stewart yeah I Love him you shall not\nIs in the drop down menu when you make your ten dollar amount legit K. U. T. or where gee\nThat's right it's it's like two albums it's a it's a double album it's a double album life [laughter] it's a digital will send you a picture of an album and this one yeah you can explain what it means to your kids a bank's\nThanks to your support in the past ... he's able to keep great shows like this on the air\nThanks for your support or you know we it's not just the weekend shows that give you a relaxation and enjoyment it's also the Monday through friday showed that sometimes get your little to tend to make you wish that it was a weekend so you can laugh again but it's you know you're not just able to catch up on stuff up through ah K. U. T. listening a nine point five you've got\nThe podcast the we K. U. T. weekend podcasts by ... to give you all the news of the week and a nice little\nUh a way a nice little audio version you can use or you know take in the morning walk or jog or you can go to K. U. T. K. U. T. dot\nOrg and read all up on all the stories of the past week and of course while their support what you're reading at a by clicking on the little donate mailbox that we have up there in the corner a that's a K U T that order five one to four seven one six to nine one\nSupport comes from the book museum presenting rodeo the exit mission with immersive multimedia interactive activities for all ages and photo ops to share on social media with hashtags Bullock rodeo on view now details of the story of Texas dot com\nSupport comes from the play that goes wrong a classic mystery with a twist murder mishaps and mad cat mania October twenty third to twenty eight part of Lexis Broadway in Austin presented by Texas performing arts tickets at Broadway in Austin dot com\n\nBoom NPR and WNYC and asked me another I'm John from coal and I'm all for your Eisenberg kissed this season for pledging to your public radio station so we're playing some of our favorite celebrity games and interviews and hope that you'll contribute\nNot only does this keep us on the air but it validates our fragile egos we are desperate for you to show us that you love us really desperate\nDesperate yeah anyway adjust your headphones buckle your seatbelt do whatever you need to fully enjoy our next interview it took place at Orlando show with award winning author professor and Twitter feed Roxanne gay take a lesson [noise]\n\nLooking to ask me and other things\nOn black men other rocks and you're a best selling author associate professor at Purdue the founder of tiny hardcore press you write about a lot of very serious things but you also write about a lot of very light hearted things pop culture stuff like your love of Sweet Valley high bucks you do\nHave a TV show out lander oh yeah I Do a new recently interviewed Nicki Minaj gosh you know how do these two sides work together I'm just a Libra\n\nI'm always thinking balance but you know I think that in order for me to be able to write about racism and sexual violence and inequality\nWhich is important work a\nAnd I'm privileged to be able to do it you also need to take a break like the struggle\nTo struggle needs time off and so for me\nThat time off comes by way of popular culture a that is like escape free is in some ways but you know unfortunately I have a brain and so when I'm watching are consuming pop culture oftentimes I might see this is why systemic racism is a problem\nAs there are no black people on television and\nYeah they are no perfect piece of the tunnel while they're there a couple of perfect pieces sir yeah what was the perfect the real housewives of Beverly Hills\n[noise]\nI mean if we were ever in doubt about gods exist and\nThat he doesn't exist [laughter]\n[noise]\nSo your latest book titled hunger and more of my body is an amazing book you had said that this is the last thing that you wanted to talk about the last story in your life that you wanted to tell [noise] so what happened that you decided now is the time to tell it um\nIt was right the book or give back the advance\nShock so I'd better write it you know when I was actually sold hunger before bad feminist even came out because I thought well if bad feminist flops I Want another book deal on the books\nUm which was a real miscalculation on my part but um when I thought about what I wanted to do next in terms of my non fiction I thought well the thing I Want to write about least as fat ness and that's when I knew oh that's the thing I'm going to have to do because oftentimes\nThe things that I Am most reluctant to do end up being the most intellectually satisfying and that was eventually the case with hunger as well\nAnd the narrative structure of this memoir is not the classic narrative structure in the sense that it doesn't end up with the chief mentor overcoming everything and accomplishing there's no pretty little though at the end which I actually love because I think that is realistic yeah\nDid you get any editorial push back where you can learn about that now\nDidn't you know I I said from the second page that this was not a triumphant book and I'm not going to be on the cover of my book standing in my formerly fat parents\nLike in half of them look what I did so I think they're forewarned is for arms so I think the really or knew not to expect that I have figured everything out and I think it's okay to be able to write a memoir where\nYou're writing toward the answers you don't necessarily have the answers that my editors were really supportive now you have\nSo I did and I got home after the first day of filming and she said I just looked at today's Russia's\nAnd your clothes are not good enough\nThat she said that to you and I just devastated\nI felt humiliated and just do I'd let the whole production down as you said you will ... I'm going shopping tomorrow you will meet me at a trailer on\nWest ... street or go to the Taylor\nShe pushes me into the dressing room and I start looking at the labels of things and I see a shirt that four hundred and fifty dollars in a suit that's for thousands and time that's two hundred and fifty dollars and I ... at her I cannot where these things I'm not going to do it my wardrobe we'll just have to do she said you're you're put\nSo I was obedience but the last straw for me was the pocket square because I have to tell you I've been a fan of pocket squares forever but I could never do it I Would experimented put my jacket all out on my ... and I think it's All right\nThen I put the jacket on looking at a mirror and say you look like an app [laughter]\nSo I said that you're ... you're pushed all my buttons you've taken me this or I'm not doing that she said you're going to do it so now I'm addicted to all this pattern mixing in the pocket squares and I would older reader\nOkay when you put the pocket square in now and you look you were the same person it is at the same pocket square but you see a different person well mirror I may still looked\nLike an ass but I'm hoping that [noise]\nI don't know I have\nTo say I am what I Am yeah\nWe live a Project Runway and now you Project Runway June yes so we have that the kids competing are under Eighteen is that\nThey're they're Thirteen to Seventeen\nThirteen and Seventeen so what's Project Runway junior I wouldn't change about the show to accommodate you know the the younger juniors\nI'll be honest nothing really the only thing\nThat has changed is the link to her work day because the child labor laws thank God\nI'm telling you getting home at nine o'clock at night for me is such a reward so we actually play the work day we have to play that his two days but other than that no it's the same I mean the first thing in the ... with the designers will be honest I was very repetitious I was walking around an egg shells thinking\nOh I don't know how much I can really say and how far I can go but within five minutes pow it hit me they wanted all they know when you're a pound ring\nAnd they're much more mature about it than the regular ... they they accept responsibility for their work and they were supportive of each other there are a joy if I had to choose between the two shows I'd take a junior in a heartbeat wow\nSays something I Want to throw out just for fun\nSome fashion trends oh and I just want to get your gut reaction overall what do you think about activity tracking jewelry like fitbit is an apple watches and\nI find them to be gimmicky\nTrying too hard gifts the wearer benefits from them fantastic but I'm not going to do it [laughter]\nHow 'bout pockets or flies that don't work well\nI'll say whatever works for you but I don't think about\nA ...\nFlies up on a woman's pound is particularly flattering and I think a man's parent without it is really ...\nHow do you feel about the drop crouch hammer pants unless you're packing of depends on\n[noise]\nYou gotta you're ready for you were asked me another challenge alright okay\nTim Gunn downing\n[noise]\nTim Gunn you are an inspiration for this game and because we love your famous catchphrase make it worth a it was that something that you've set of forever ever forever as a teacher but yeah it's very useful do your students say it back to you and perhaps like\nWell writer it on a pillow or they would begin to say don't tell me to make our work again\nWhy I'm going to be very important\nAnd that is a response usually because people are like no I Can't happen\nIs sort of just want to do especially in a in a in the classes were were students make things they just want to abandon it but it's not going well and I always say look\nSit down study as well for up to a diagnosis of what's wrong at a prescription for how to make it work because if you just abandoned everything that presents a huge problem to do then what are you really learn from it nothing yeah and you just are starting from over and over and over and over again to scramble to\nSo and this game uh we took that phrase but every answer is going to be a word that rhymes with war oh it's going to be the if you need him feel free to call in or ... or ...\nOr ... you\nKnow you'll do\n[noise]\nIf you get enough right Matthew Griffin from stony creek Ontario, Canada will win an another Rubik's Cube\nOr good I'm planning on moving to Canada I Need to make friends\nSo here we go\nI've got this troupe of French Canadian clowns and we want to call ourselves something something do still lay what do you think it should be making Cirque\nThat wouldn't be great if everyone came up to you with that question came up that this group of French Canadian\nClown given the way things are today on the ... joined them\nTim I Want to perform a popular dance where I shake my butt [noise] make it work [noise]\n\nListening audience there are no words to me to describe\nI just\nCame I'm trying to remember the name of the star trek captain played by William Shatner Kurt calling\n[noise]\nTim I'm trying to make some delicious Jamaican chicken rubbed with hot spicy\nJonathan make a jerk\nI was we were going to work for something else I'm going to make that my ring tone by the way\nThis is your last clue came I'm trying to remember the actress who played Suzanne sugar Baker on designing women make it builds a bird and he had\nThink I Would get a designing why why [noise]\nEasy ... you got ... it would have been a supportive environment\n[noise]\nCongratulations Sam Hugh and Matthew Griffin from Ontario, Canada had asked me another Rubik's Cube wonderful yes they really do much when more hand for a project\n[noise]\nElse can you hear Tim Gunn playing such a ridiculous word game we can only make it work with your help if you've already made a contribution\nDo you if not here's how to make a donation to the station\nAnd make it work right now that we've got to throw in there ah I'm hock Madden home and joined by Ben Philpott from K. U. T. news to encourage you to go to the phone\nIf I went to four seven one six to nine one or you can pledge\nSafely securely with your visa MasterCard American Express or discover card online at K. U. T. dot O. R. G. it's the unofficial start to our fall membership drive or we are trying to really when it gets right down to it five fold days Monday through friday\nIs the first time we've tried to do it all in five fold days and uh when we say do it all we mean\nPaper the programs and uh the content that you enjoy and count on a it is you were support that makes everything you hear on K. U. T. possible local community gives us well over eighty percent of our funding or we get another almost Fifteen Percent are from foundations and and organizations like that and\nLess than five percent from the federal government so you can see that a over eighty percent coming from the local community means it's up to you if you want a program like ask me another wait wait don't tell me are the Ted radio hour which is coming up in about twenty minutes\nTo be here for you every time you turn on the radio we are their K U T Ninety point five here in Austin and it's your support that's made that possible over the years go to K. U. T. dot ORG and become our new sustaining member right now\nOr five twenty four seven one six to nine one you know maybe you have been listening for a few years maybe you are you know started off maybe the your your entry drug was listening to MORNING EDITION you a kind of moved over to all things considered every now and then to check thing check out the how the day went but then on the weekend you get\nYou get your relaxation you get your wait wait don't tell me you get asked me another you get the shows that allow you to just kind of take a nice\nHot bath and radio and relax from the week that you just had a and you know you have you rely on the station you you listen to it a lot and so now we're relying on you to help support that programming at five one to four seven one six to nine months", "year": "2018", "show_name": "Ask Me Another", "city": "Austin", "day": "20"}