{"month": "10", "state": "CA", "station": "KALW", "content": "That's needed from the hearts of space next year and I wouldn't put seven K. A. L. W. San Francisco\n\n... comes at the end of October the very different celebration of the dark side of the human so it's the time we willingly martial art shows and stories of\nThe supernatural\nAnd rituals we create around\nCredit to the traditional generally goes to our ancestors\nCombined the old pagan harvest celebration of sour\nAnd the exciting nighttime bonfires which has three parts Christian festival of all how to\nHim more than ... commemoration the recently departed souls saints monitor\nWho spirits were said to wander the years that this time of year in search or\nThese traditions are rich creative field for musicians of the dark and being shown [noise]\nThey we've together deep drowned to somebody voices\nWailing frigid gloomy string with a dark galaxy powerful electronic an environmental effects\nTo create truly electro crew stick worlds soundtracks films you'd rather see are\nI'm Steven view on the transmission of parts of space\nGloomy stormy floating dark ambient journey on the program by Canadian Gus producer David J e can comb ghostly shadow\nWe began with some some stories from the environment series\nOn the music by the French ... dark sanctuary pretty lame and while\nThe magic music by the ghost between string Bush\nDark and being a ritual music by\nCounting\nFrom Norway we have a good piece by transfer phobia pronounced memory\nFrom Russian go streets down by the law from start to go see the ...\nMore from ... to\n... own future date\nFrom the u._k. music by based community ghost term magnetic tape\nAnd from finishing it'd be a musician Scott\nGhoulish nightclub orange\nFrom divine intervention\nNear the end just body voices from Los Angeles and be musician due to Benedict checks\nIt can be variation\nIn the primary meditation to do next\nIt took me just told me about the dark and being journey from our\nOn this transmission\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\nOr [noise]\nOr\n\n[noise]\n\nOr\nOr [noise]\n\nOr what\nYou were [noise]\n\n\n\n\n\nRoom [noise]\n\nAnd the world [noise]\n\n\n\n\n\n...\n[noise]\n\n\n\n[noise]\n\n\n\n\nWhoa [noise]\nJeeze\n[noise] ...\nWell ...\n[noise]\n\nLove\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n...\n[noise]\n\n[noise]\n\n[laughter]\n[noise] [laughter]\nTo the to the [noise]\nThe [noise]\nDid this to the [noise]\nThe the [noise] [laughter]\n[noise]\n\n[laughter]\nThe the [noise]\n[laughter]\n[noise]\n\n\n\n[laughter]\n\n\n\n[noise] [laughter]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nOoh [noise]\n\n\n\n[noise]\n\n\n\nEasy ...\n\nThe prehistoric days musical instruments we have the flipped the rational and drop\nLater primitive trumpets and ... and from ancient Mesopotamia more than four thousand years ago early members of the quarter some family plus string liars visitors harms and says it's\nString instruments of come a long way since then in Europe boats strings were refined into the violin family we know today why loops evolved into the guitar\nMusic for strings developed along with the instruments and western classical music is rich with variation\nAmong string instruments perhaps the most versatile the cello\nA virtual solo string orchestras\nI'm Steven Hill and on the transmission of hearts of space contemplative music for strings with us\nWe begin with two pieces by Santa Fe New Mexico base jealous Jamie's fever for my title inspiring album turn ...\nFrom England where music by jealous John ...\nLater music by keyboard is composer Michael\nFeaturing Swiss Joe is Martin ...\nIn the deep so Connecticut jealous David Darby with selections from prayer for compassion and does he see a classic dark wood all back plus more by Jamie ...\nThe space shuttle contemplative sounded timeless straight\nFrom the transmission of hearts of space\nMm\n\n\n\n\n\n\n\nYea\n\n...\n\nMm\n\n\n\n\nMhm mhm [noise]\nMhm\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\nMhm\n[noise]\nMhm\n\n", "year": "2018", "show_name": "Music from the Hearts of Space", "city": "San Francisco", "day": "29"}