{"month": "10", "state": "PA", "station": "WESA", "content": "Today's program and go supported by honeycomb credit a crowdfunding platform where entrepreneurs and small business owners can\nGrow their business by borrowing loans directly from customers fans have neighbors with an interest in investing in their community more information about small business crowd financing available at honeycomb credit dot com slash grow\nIt's a cloudy morning and you'll be needing the umbrella later rain arriving sometime around the lunch hour today's high a mild sixty five degrees rain tonight for all those trick or treaters and rainy tomorrow is well with a high on Thursday of fifty six\nBroadcasting from Pittsburgh historic south side this is Ninety point five FM W E essay and W. E. essay HD one Pittsburgh we are Pittsburgh's NPR News station it's nine o'clock [noise]\nNinety point five W we say this is the confluence where the news comes together I'm Kevin Kevin funerals she'll be held today for three more victims of the mass shooting at the tree of life synagogue on Tuesday the Rosenthal brothers when David and Dr Jerry Rubin in what we're more and I remember\nThey were very kind of been laughing uber to help and enjoy\nOur president and about age she even more of those tactics Jerry Lewis never\nOn today's show a conversation about what we tell children\nAnd how do we tell them about that so we're\nAlso walk through the vibrant neighborhood of squirrel he'll also mapping the brain how learning more about neural connections\nCould lead to treatments for Parkinson's and something during this disease and the confluence of follows this news updates\n\nLive from NPR News in Washington encore of a cold and there will be funerals and Pittsburgh today for three of the eleven people killed in the tree of life synagogue shooting last Saturday\nJoyce Feinberg Melvin wax and urban younger will be laid to rest there were three funerals yesterday President Trump visited Pittsburgh on Tuesday and paid a visit to the synagogue many protestors gathered near the building to voice their opposition to the president Pennsylvania's governor and Pittsburgh's mayor declined to join and\nMeanwhile President Trump will be in Florida Today as he continues his push for Republican candidates Adam next week's mid term elections NPR's winter Johnston reports\nTrump is scheduled to hold a lead in campaign events in the days leading up to the midterms today whole rally supporters and heavily Republican league county along Florida's Gulf Coast there he's expected to make a last minute push for Republican gubernatorial candidate rounded status and US Senate candidate Rick Scott\nTrump will also make campaign stops this week in Montana Indiana and Missouri\nWindsor Johnston teams are still searching for victims of the lion air passenger jet that crashed into the job at sea on Monday just after taking off from Jakarta one hundred eighty nine people were killed Indonesian authorities are inspecting\nFree ... free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nFrom manila\nWhy an air is under intense pressure to provide answers for family members of the victims of light six ten there are questions about the technical state of the three month old plane mechanics reportedly had just six and a half hours to examine why the bowling seven thirty seven max ate a sophisticated jetliner\nHad taken steep died as it send it on a flight from Bali to the Indonesian capital Jakarta the night before the airlines CEO so the issue had been resolved they\nShow the aircraft repeated the same unusual pattern the next morning before it crashed into the sea lion air has recently been removed from us and EU black lists but the accident has reignited concerns about safety in Indonesia's airline industry Julie McCarthy NPR News manila\nAustria says it will not sign up to a new United Nations packed on immigration carry sky ring reports from Vienna the right wing government sites sovereignty as a concern\nThe coalition came to power last year promising a tough line on immigration now they decided to join the United states in Hungary in rejecting the global compact on migration approved last July ... old un member states the agreements have standards for the treatment of migrants and supports country's hosting large numbers of refugees\nHowever chancellor Sebastian cooks claims the pact blurs the line between legal and illegal immigration and could restrict those streams over into Austria is money no position parties say the decision is a movie and irresponsible for NPR News I'm Carrie sky ring in Vienna\nYou're listening to NPR\nSupport for NPR comes from NPR stations other contributors include the University of Florida we're solving for next is power to buy land grants heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot UFO dot edu\nGood morning with a Ninety point five W E s I knew that and I know for ... more funeral services will take place today for victims of Saturday's deadly attack at a synagogue in squirrel hill Ninety point five W E essays Lucy parking has a preview\nServices have been scheduled for Wednesday for three of the eleven victims who were killed at the tree of life synagogue a funeral for Joyce Feinberg who is Seventy five is scheduled for ten am\nFeinberg was a researcher at the University of Pittsburgh is learning research and development Center for more than twenty five years Melvin wax was eighty seven and does remembered as a pillar of the new light congregation and to kind person\nHis service is scheduled for one PM Irving Younger was sixty nine and had a real estate business in squirrel hell he also coached kids in football and baseball he will be remembered at one PM\nServices for three victims have been scheduled for Thursday and Lucy Perkins Ninety point five W E s a news\nPresident Trump visited U. P. M. C. press B. in Oakland yesterday to meet with those injured in the tree of life shooting the president did not make any public appearances or comments during his trip which also included a visit to the squirrel he'll synagogue where the eleven worshipers were killed Saturday many staff weighted by a set of closed doors to try and catch a glimpse of him\nAfter the president first lady and Jared ... departed U. P. M. C. doctors took questions\nThey say they were proud to serve the community but did not want to get recognition in this way\nPeople protested in squirrel hail while the president was nearby at the synagogue the event organized by the Pittsburgh chapter of bend the arc of progressive Jewish social justice organization organizers say due to his reluctance to fully denounce white nationalism Trump is complicit in the depths of the eleventh ...\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program\nAt the end you dot edu flash I I I\nWas ... or ... or an acceptance\nA violence I'm a sense whatsoever that you know it's acceptable and it's not and we are here today to speak out against that\nThe president has condemned the shooting tweeting it with an act of quote evil anti Semitism\nThe Centers for Disease Control and prevention CDC has confirmed two additional cases acute blasted my light it's or a FM in patients currently being treated at U. P. M. C. children's hospital of Pittsburgh the Allegheny county health department says both patients are residents of Allegheny county\nThat brings the total number of confirmed a FM cases in the area to five for patients are residents of Allegheny county and one is a resident of Washington County\nA F. M. as a rare but serious condition that causes weakness in the limbs\nThe penguins honor the synagogue victims before their game last night with a moment of silence and with an honorary puck dropped featuring police officers Anthony bark and Mike Smith ... who were wounded in the attack\nThe penguins went on to lose to the New York islanders six to three and this is Pittsburgh NPR News station and with a Ninety point five W E s a news I'm Marie ... [noise]\nIt's confluence where the news comes together on Ninety point five ... years say I'm Kevin gather [noise]\nComing up later on the program as the city graves over the shooting deaths of the tree of life synagogue how do we tell our children what happened and why\nThat's ahead but first what are the connections between the brain and the rest of the body\nHow might a better understanding of the neural networks help with learning about diseases including Parkinson's and Huntington's Peter strict is the chair of the University of Pittsburgh department of neurobiology and as the founding science director of the brain Institute at Pitt Peter strict welcome to the confluence\nThat you you recently received a major grants from the national institutes of health and the Davis gave family charitable foundation to trace the nervous system wiring and also for a Magellan like effort to map the rights first of all congratulations\nMagellan joining you assume correctly that refers to the sixteenth century explore that we all learned about who's expedition was the first to circumvent navigate the earth\nThere's a we're really refers to is how little we know about some brand connections and that we have tools now to reveal brain networks and a lot like floors\nWell that's interesting you say explores some would say space is the final frontier was hurt others say no the depths of the oceans are final frontier for you is the brain innocence the final frontier\nOh absolutely the brain a is a still mysterious Oregon or when you think about it is a group of cells that produce behavior and that's really a mystery and also at the same time something that's very special", "show_name": "The Confluence", "year": "2018", "city": "Pittsburgh", "day": "31"}