{"month": "10", "state": "PA", "station": "WESA", "content": "And W. E. S. H. D. one in Pittsburgh we're asking you to give it for one to six nine seven to nine five five\nAnd if you haven't done it already considered becoming a sustaining member it's about the easiest thing there is you don't even feel the pinch\nWhen you set it up with us and we take out a deduction that you specify from their credit card account of your bank account whatever works best for you five dollars a month ten dollars a month a hundred dollars a month a thousand dollars a month or whatever you want to do is just so grateful for your support and all you've got to do to set that up is to reach out to us today\nFor one to six nine seven to nine five five is the phone number or you can do online W. E. S. A. dot FM go ahead start that today help us bring you the news in the future\nFor one to six nine seven twenty nine fifty five W. E. S. A. dot FM we're giving away tickets to see Hamilton and we're hoping that she'll take just a moment to make a contribution let me tell you about these tickets first of all they are not on sale right now so we've secured a some front row seats\nAre in the orchestra for a show on Saturday January twenty six\nYou don't have to pledge but we're trying to raise money to support you NPR News station so if you can we ask that you gave your name goes in the give away a and a\nAnd you might be the lucky winner Hamilton tickets they're hard to come by you get a chance to win and support your station here for one to six nine seven twenty nine fifty five\n[noise] and if you're not a member already please consider joining I'm new to the station myself this is an exciting time to become part of the W yes same mission this newsroom is growing we're becoming more ambitious we're about to go into the confluence\nA new program here that brings you news interviews feature stories become a part of that join us for one to six nine seven to nine five five or W E s said ... thank you\n\nLive from NPR News in Washington I'm core of a ... in the U.S southeast say at least twenty six people have died because of hurricane Michael\nOfficials in Florida say at least sixteen people were killed in that state following the strongest storm to strike the area in fifty years NPR's Greg Allen reports twelve at the ... were in ... county\nBay county in Florida's panhandle is where hurricane Michael made landfall with a sizable storm surge and one hundred and fifty five miles per hour winds some of the worst destruction is in Mexico beach or search and rescue teams have been combing through such destroyed homes with help of dogs and listening gear that's had been reported in Mexico beach it's not clear yet how many\nFlorida emergency operations center says twelve debts in Bay county plus one death ... Gulf county had been confirmed by medical examiner's under state law medical examiner's are responsible for confirming and attributing desk occurring and their counties\nThat's when the storm of all been confirmed and gas and county and clay county there were also deaths from hurricane Michael reported outside of Florida and Virginia Georgia in North Carolina Greg Allen NPR News\nDay after meetings and Saudi Arabia secretary of state Mike Pompeo is in Anchorage today\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation details on a master's program\nAt the end you dot edu flash I I I\nMr NPR's Peter Kenyon says Turkish officials believe ... was killed in the Saudi consulate in its tumble\nSaudi officials denied any involvement in ... disappearance Turkish authorities say they have evidence to show drew was killed a surge of the Saudi consul general's residence and diplomatic vehicles ... did not take place Tuesday as expected Turkey's foreign minister says the surge could be carried out today that constantly building research Monday\nBecause ... is the Washington Post columnist who's been missing for more than two weeks Russian officials say at least Eighteen people are dead and more than forty others injured at a vocational school in Crimea\nOfficials say the attacker was a student who later took his own life and the earth Lucy and Kim reports from Moscow the Kremlin first said the bombing could be terrorism\nRussian state TV showing images of rescue workers at a vocational school and the Crimean town of courage Russia's national anti terrorism committee says the blast was caused by an explosive device criminal spokesman said president flooding they're putting expressed his condolences to families of victims and ordered investigators to determine what happened\nApproaches known for being on the crime me inside of a new bridge connecting Crimea which Russia\nRussia annexed Crimea and twenty fourteen after occupying the Ukrainian province and holding a referendum that few countries have recognized Lucian Kim NPR News Moscow\nWall Street will open in about half an hour futures indicates stock prices may fall at the opening bell investors have new economic news the Commerce Department says construction on new homes dropped five point three percent last month\nAs mortgage rates jumped to their highest levels since ... eleven and this is NPR\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first learn more at Raymond James dot com\nGood morning with a Ninety point five W E s a news I'm Marie ...\nThe second to televised debates between Republican Keith Rothfus and Democrat Conor Lamb took place last night\nClimate change emerged as one of the biggest areas of disagreement between the candidates in the seventeenth congressional district lamb's hails natural gas for emitting less carbon than coal and driving local job growth but he also says the government should support developing markets in renewal energy\nThere are small towns all over western Pennsylvania right now I Want to put solar panels on the roof of their ... buildings and they want to make their buildings more energy efficient why can't the government provide financing to allow them to do that\nRoss warned against government involvement he says Obama era regulations achieved minor environmental gains at the cost of many jobs rough isn't lamb or running to represent beaver county and portions of Allegheny county\nA former Allegheny county prosecutor and current deputy state attorney general ...\nWho prosecuted acts Penn State president Graham Spanier for cover up in connection with the Jerry Sandusky sexually abused case has died\nGovernor Tom Wolfe praised it got for her dedication to public service and compassion for victims and their families they died suddenly on Monday the governor has ordered steak flags to fly at half staff in her honor\nThe state is adding funding to help families affected by the opioid crisis take care of children we get that story from W. I. T. S. Brett choked his\nOf Human Services secretary trees the Miller says for a million dollars in this fiscal year ... budget will be used\nFried ... read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nRooms such as early head start and healthy families America are not new but\nWith families torn apart by opioid addiction and parents lost two drug overdoses there's more need than ever Miller says home visiting programs provide families would supports and services needed to understand children as they grow\nAddiction affects different people in different ways and utilizing the services and supports can help families and children cope with emotional and mental challenges that may arise because of their family's experience\nThe funds will go to twenty groups across the state that provide services for families in their homes Miller says the effort will help about a thousand Pennsylvania families that have been affected by the opioid crisis in Harrisburg ...\nSoon approve a bill to get high school students more options to meet a graduation requirement Republican state senator Tom ... is the lead sponsor of the bill which gives students alternatives to passing the Keystone Exam\nIs the same way every child you know it's crazy\nFor example mechanical sense a child doing a trade apprenticeship probably wouldn't need to use biology in their career that they shouldn't have to pass the Keystone exams biology portion to graduate to measure offers alternative to the Keystone Exam including acceptance to college or an apprenticeship program\nAnd penguins locked in overtime last night to the Vancouver Canucks three to to within ... W E s a news I'm Marie ... capital into [noise]\nThe confluence where the news comes together or not he point five to say I'm Kevin Gavin\nIn recent years some counties have reduced store or sold their nursing homes because of cost this week that Cain system actually expanded with the opening of a new special unit at Cain McKee's port joining me as Allegheny county executive rich Fitzgerald\nSo who exactly is this new unit force her this is going to be a forty five bed unit that we call post acute care so for somebody that might have that has a substance abuse\nIssue that other facilities wouldn't take them uh and now if they're not being taken by another facility they would probably just remain in the hospital and the cost will be much much higher so at this post acute care forty five ...\nSomebody that has a heart condition but also have a substance abuse issue um would be getting the treatment cane for the cardiac issue and then we're partnering with gateway health or a ... on the substance abuse issue so it's a it's a kind of a collaboration of treatment that's going to occur at the ...\nYou said might not get accepted elsewhere and other canes or other facilities non county ... county and the other facilities are in in the region so a forty five bed unit is it only for patients at Cain McKee's port or Ken patients are at other Keynes maybe be transferred there how's it going to work\nIn this case it's fairly rare we're using really the best tools and research and diagnostic information epidemiologic information to drill email is down\nBut we also need to know that you know science is constantly being used to define and to answer these questions but right now we don't have the answer yet\nSo for now if parents are concerned what should they do\nSo if a child presents was cough cold symptoms we would tell them to treat those like we recommend for regular upper respiratory infections humidifiers are good to use um we don't really do too much with over the counter medicines fevers still should be treated with a fever reducing medicine um if the child's uncomfortable with that fever to forget fevers a normal\nWay that the body fights off infections so we don't recommend treating every fever but if your child's got a high fever and it's uncomfortable it's totally fine to go ahead and treat\n'em as directed than we have those resources on our website um as well under a doctor's notes um but again hallmark here is weakness if there's weakness notify your doctor right away\nThat ... is a pediatrician and CEO kids plus pediatric and the Pittsburgh area ... hey thanks so much and that can Harris you're listening to the constantly on Ninety point five W E s at\nE. essays supported by the natural sleep shopping cranberry township natural sleep shops infant department features organic written actresses and custom non toxic nursery furniture bill from a choice as six different woods and over Seventy finishes made in the U.S spy kids comfort nature ... more\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation\nInstitute details on the master's program\nAt CMU dot edu flash I I I\nI Am to ... but the news never stopped and find more stories conversation on our website at W. dot FM flush constantly on Twitter at W. complex and wherever you get your pod\nCaptain to conduct contain next on Ninety point by UPS thing\nI'm Katie black me with the Pittsburgh almanac\nThat we can hit St John F. Kennedy visit downtown beaver falls in Nineteen sixty forty three year old former president within campaign mode when he made the October ... meeting with hundreds of supporters and the blue collar town\nA real donkey symbolizing the Democratic party even took place and the Fifteen car motorcade riding down the city's main street\nAnd then he would go on to defeat Republican Richard Nixon one month later\nToday's Pittsburgh ... Wednesday October seven twenty eight\nToday's programming is supported by current library of Pittsburgh providing books literacy programs business resources and educational activities that encourage learning achievement exploration\nAnd discovery Carnegie library of Pittsburgh is dedicated to serving the origin through community support more information is available at Carnegie library dot org\nIt's the confluence on Ninety point five W E S H ... W E s seized full membership drive and it ends tomorrow it ten am please help pay for your W E s a listening by making a contribution right now at for one to six nine seven twenty nine fifty five\nOr join us online at W. E. S. A. dot FM Ontario Riley here in the studio with Nancy would\nWe really are in the home stretch of the fall membership Dr inviting you to join us to help pay for all\nOf news and information that you rely on right here on W E s they were looking to raise three thousand dollars by ten AM and meeting that goal ensure that we have the money needed to pay for programs\nLike the confluence in the months to come if you've not yet joined us even waiting procrastinating don't wait any longer for one to six nine seven to nine five five\nThe newsroom here W E essays been growing over the past few years and one of the reasons we've been able to do it use your support we're now able to do more in depth reporting than ever before good example is a series of launching this week called\nDividing lines the shape of education in Pittsburgh it's a series of beat him up stories from five different reporters all about we're Pittsburgh kids go to school and why\nWe've got stories about magnet schools diversity in schools discriminatory housing policies and a lot more it's it's a great series it begins today it runs through next friday and it's the kind of reporting that your membership dollars support so called us right now support this kind of journalism\nFor one to six Ninety seven twenty nine fifty five or give on line of W yes they do their family\nAnd if that alone isn't enough to get you to invest in public radio we had some great reasons for you get to get to date here he's going to tell you about one in a second but I also want to let you know that you give it right now you're going to get for great thank you get in one special package we're calling it the W E S a\nFree press pack and normally you'd have to get three hundred and sixty dollars to get all forget that today only you'll get\nThe sound of a free press stainless steel water bottle knew this fall are stand with the facts ... bad the wait wait don't tell me twentieth anniversary digital album and we're also going to toss in one of our new reusable straw all of that for just Fifteen dollars a month that's a total donation of a hundred and eighty dollars a year you can support the news and a big way and get some great thank you get for just Fifteen dollars\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nAnd five five on line W E s they die at the end and Terry as they say but wait there's more\nYes but wait there's more in the news business they teach us never bury the headlines so here's the headline\nHamilton tickets become a member W's USA Today and you could win a pair of tickets to see Hamilton and these just aren't any tickets to smash should musical is coming to Pittsburgh one lucky person who's going to win a pair of front row orchestra seats\nTo see it at the ... center on Saturday January twenty six you're entered a when when you give to this membership drive right now\nOn line to W. E. S. A. dot FM or call for one to six nine seven twenty nine fifty\nFive looking to raise three thousand dollars in the next thirty five minutes you can get as close to what your get ten dollars a month twenty dollars a month maybe you can afford to joined a hundred dollar a month club whatever that is joining us right now for one to six nine seven to nine five five on line W E S H ... FM\nYou've heard it from his before listener contributions make up about half of the total revenue will W E s say\nSo getting more new members just one or two percent more would make a huge difference in our ability to provide quality journalism for Pittsburgh your contribution now will ensure that W E s e remains on the air strong serving you\nJoined right now go on line that W. E. S. A. dot FM or cola sued for one to six nine seven twenty nine fifty five [noise]\nNew tech companies have more power over the economy then the president lots of folks say yes from American public media this is marketplace ... D mystifying the digital economy I'm Molly Wood\nMarketplace tax is supported by fresh works customer engagement software design to streamline processes and deal with the end user in mind more fresh works dot com\nAnd by Amazon Web services over a million customers use ... as cloud tools functionality and experience to dream big and build fast learn more had ... is how dot com [noise]\nEach year marketplace partners up pulling from Edison research to African Americans a few questions how's the economy doing are you worried about a downturn is the government handling the economy well things like that\nThis year though the poll included a new question asking people how much influence they thought tech companies had on the economy\nAt us and found that Seventy eight percent of Americans believe big tech companies like Amazon apple or Google have a good amount or a great deal of influence on the economy\nWhat's surprising is that fewer Americans more like sixty eight percent of people think the president or Congress have that much influence on the economy here to break it down at me Larry resin cofounder and president of Edison research\nI remember a survey from the Nineteen nineties that asked the question who gets more credit for the good economy Bill Clinton or Bill Gates and Bill Gates one strongly um I think\nThe American public definitely thinks the president has some influence on the economy definitely blames the president of the economy does badly\nBut I think they are savvy enough to understand that it's really these companies these entities you know outside of our government that makes our economy good or bad weather it's\nGo back to the auto companies of the early parts of the twenty century well through the twentieth century or any other sort of emerging kind of technology to change things electrification et cetera and now for the last twenty five years it's been the tech companies\nIs the first time that Edison and ...\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nIt to the kind of the conversations we're having right now about the influence of these companies\nWill not just these companies 'cause we asked about a lot of different things that affect the economy to get a sense for what people think is really responsible for what changes the economy you know people were very likely to say large financial institutions as well have an influence on the economy obviously people saw what happened\nDuring the global financial crisis about ten years ago and so they can see the influence that those kinds of companies have on the economy and in general they saw that all kinds of businesses have more influence than politicians are Congress or president or many other things that we looked at two\nAnd then obviously politics is very polarizing and divisive right now and yet the strong majority of Seventy eight percent who said tech companies and banks had a lot of influence across political age and gender lines what does that tell you is it are they unifying in a positive\nFree to explore read it for the Ninety five W yeah tae Pittsburgh NPR News station I have a free press [noise]\nWell let's find out from John Hayes is John as the outdoors editor for the Pittsburgh Post Gazette good to have you done good to be here again remind us what is the role of the executive director of the fishing boat commission well\nThe commission of was set up um about a hundred more than a hundred years ago to be a slightly distant from the women's or the shifting when so politics\nAnd and its job is um water quality management of a wildlife laws and uh they they have an oversight over a reptiles amphibians those kinds of things but the executive director sort of\nOversees all of what they do the commissioners decided direction they want to go and they bring in an executive director who will determine where money is spent what the focus will be\nIn his time here or a John our way has really championed I'm a uh a program that would a monitor all of the waterways in Pennsylvania there's tens of thousands of waterways in Pennsylvania that the game commission hasn't even been to\nThey don't really know what's there if they find populations of native brook trout\nThat is a an indicator of water quality has to be very good water to have a breeding population of them if if this program every time they find a stream with NATO brook trout\nThat is a a a signal to uh to the state uh to um a department of environmental protection to\nResearch that waterway and federal protections upstream um to to protect that price so then that means that upstream from those areas your farm you may not be able to do all that you want on your farm you may not be able to sell it and put on our hotels along the creek or something but\nThat's that's it that's I'm a big deal and protecting waterways in Pennsylvania are\nYou report that the John are way ahead a long running battle with the legislature over what are we are there multiple issues just fishing licence face it\nIt's even more narrow than that it's actually ... the point of the spear is one thing that John our way blurted out I'll get to that for a ... as I said I'm\nA fishing boat commission and the game commissioner our unfunded commissions no money from the state uh uh uh taxes go to their their their uh their funded by the people who use it\nSo they're ... comes from those fees or licensing fees\nThey and so the the money doesn't come from the state but the state legislature sets the license feed the license the hasn't gone up a at the fishing boat commission since two thousand and five that's a long time\nSo there are expenses have gone up for it and I just\nGo up but everything goes up and they're not allowed to charge more for a license the reason\nPartially it's because legislators don't want to have to tell their constituents I raised your fishing licence fee so it just goes on for years and years and years another part of that is inside politics perhaps I'll give you this license for you if you give me\nThat on a trading I don't know for ... yeah that kind of thing or efficient writing in this case\nBut the the big issue is funding or\nFree to explore read it for the Ninety five W yeah tae Pittsburgh NPR News station I have a free press\nWhich runs on a fifty three million dollar budget they also have about forty to fifty million dollars\nOr a ... in reserve that they use for emergencies such as this damn that was a recently damaged at a high point and I think that's Somerset county my point ... or\nA high point like had a problem with the damn it's it's the damages owned and operated by the fishing boats ... ... commission and they ... they're drawing from that reserved bill to pay for that\nOr or why the legislature says you don't need this exact Greece you've got these reserves\nAnd our way says yeah but if I wait for you to give me that for you guys should debate it it it gets worse so they and the game commission does this two sets up these reserves so that they can draw from it whenever emergency your car's\nA fishing boat hasn't been able to get the legislature to increase license fees are waking up with a lot of\nIdeas a ton of around that um and he added a voluntary youth license for a dollar and that might not sound like a ... a lot of money but for every license that the state's sells\nThe uh the uh a\nU.S Fish and Wildlife Service gives them back more than that I think it's four dollars or something they get for each license sold so you know so the the that that's a new form of revenue that fishing boat ah has since our way out here\nAre ways fight with them came to a peak last fall whenever our way announced that uh he he was given an order by commissioners to either saved twenty million dollars or raise twenty million dollars to keep the uh the agency uh uh in the black\nOr he told legislators that um if they didn't raise license fees he was going to close to trout hatchery Z and one warm water hatchery and he was gonna tell constituents which legislators were responsible for that\nAnd is that why they tried to force him out in March\nThe very next day or within days\nUh uh they they uh they introduced a bill that would a term limit the executive director position to eight years our way was eight years in three days or something at that point\nSo it's it's really a legislators who do this kind of hard ball time with each other they didn't want to hear it from an executive director so they're they're forcing him out he\nAnnounced his retirement at the end of July effect of November second and then the legislature all of a sudden not only agree to an increase in these licensees but also got rid of that eight year more ah a limit\nSon of a gun and what a good idea they had just after he made this announcement um they agreed to talk about it which they wouldn't even hold talks they wouldn't even bring bills that would fund fishing boat and the game commission to the table they wouldn't even talk about it\nNow they're gonna they agreed to talk about it and they immediately dropped this date you're a term limit\nJohn Hayes is the outdoors editor for the Pittsburgh post is that John thanks so much and it's really earth actual maybe here is the confluence I'm Ninety point five W. E. S. [noise]\n\nWhen you look at the map showing which Pittsburgh public school students are assigned to attend based on where they live there are a couple of areas that look almost like\nFree to pursue the re to explore we're Ninety point five W E s say Pittsburgh's NPR News the sound of a free press\nWestinghouse high school and Lincoln and saves on elementary feeder patterns are two islands where the cubes are assigned to mostly white schools that's part of our series dividing lines muggy points bonded over your face our Schneider reports that decades ago children who lived ... in those islands\nOr some of the first to be boss to schools outside their neighborhoods\nA warning this story contains strong racially charged language\nSevere Bush our lives on the same street where she was raised her house is just blocks from where a bus picked her up in the morning and took her to school outside of her neighborhood\nIn Nineteen sixty five the pits republic school's board decided to move Bush era and other black students to mostly white elementary schools to relieve the overcrowded mostly black lemming in elementary school Bush says the schools in her neighborhood where quality but there were differences\nIn you wouldn't notice when you were in a fourth grade but you know at the hospital taller and economic resources in your community so that was the difference\nRebecca tardy brown grew up in the same neighborhood she remembers writing a bus to a mostly white elementary school and feeling like she didn't belong there\nI remember being called nigger I'm having rocks and things start at our bus\nKids not being allowed to talk to us in the classroom got not wanting to sit next to us\nSome white parents protested the move for months telling the board they didn't want their schools to be overcrowded many said it wasn't a race issue but the two black school board members refuted that a large group of supporters gathered the night the board voted chanting freedom and singing we shall overcome\nMany of those elementary school is fed into Taylor older days high school in squirrel hill a mostly white school where ... and brown graduated in Nineteen Seventy one and Nineteen Seventy three respectively both say they received a quality education works both two opportunities but faced challenges\nYou know you're the minority you're an all white community your bus back and forth\nBush remembers parents from her neighborhood patrolling hallways because a frequent fights\nYou know a fight is a fight so they say but the fights are racially motivated\nBush's neighborhood del mar gardens is a housing cooperative thought to be the first in the country to be owned by all African American shareholders who had been denied mortgages by banks", "show_name": "The Confluence", "year": "2018", "city": "Pittsburgh", "day": "17"}