{"month": "10", "state": "PA", "station": "WESA", "content": "Going to take a couple of people who are helping us get to that contribution goal Cynthia and marine still Chelsea and each you an Aaron ... says I wake up every morning and I turned on the ... the what's happened while I slept I have been listening since I was a kid if you've been listening since you were a kid or if you just started listening and you like what you hear\nWe're asking you to give today we are in this challenge mode right now to if we can get six more contributions by the end of the hour we will earn an extra Fifteen hundred dollars and the John ... Family Foundation\nYour contribution will help us clean that extra Fifteen hundred dollars so we can put it to work for you you can get on line help us hit that challenge a W E S H ... for one to six nine seven to nine ...\nWith three people on the phone and maybe a couple or two on the Web site we're very close to the goal in fact if we can get just one or two three more contributions I'm sure we will make it yours in a couple of others and then we will have done it for one to six nine seven to nine five five on line that W E S H ...\nW E essay and NPR were connecting you to people and ideas that you would otherwise miss if it weren't for programs like MORNING EDITION and for the confluence which is coming right up if you love these programs we are asking you to consider becoming a member it's easy it's quick and you will you will not regret it W E S H ... them for one to six Ninety seven to nine five five\n[noise]\nFrom the point five double you say this is the confluence wherever news comes together I'm Kevin ...\nDoctors and other health professional say smoking is bad for your health\nFor city workers smoking is going to be bad for their paycheck\nThey'll have to pay more for their health care premiums are smoke\nThe children's museum of Pittsburgh is trying to expand its sphere of influence for the major edition designed to attract tweens and teens will visit with Jane Warner executive director of the children's museum you want your tech CEOs have confidence that vision three bold\nBut you don't want them to be a nurse assist why narcissism at the top is bad for the bottom line\nThe Steelers drama continues on the field at all will look at the good\nThe return of Ryan she's here to the scene where he was seriously injured\nAnd the ... [noise] the confluence follows this minute updates\nLive from NPR News in Washington I'm core of a cold when President Trump is scheduled to leave the White House this hour for a visit today to parts of Georgia and Florida hit by hurricane Michael\nAt least Seventeen people have died because of the storm in states from Florida to Virginia dozens of people are missing but authorities don't know if that's because people are unable to check in with their loved ones cell phone service it's spotty in some areas especially in Florida's panhandle\nFEMA director Brock Long toward that region on Sunday\nNo doubt about it for the tremendous some of the worst damage I say in my career\nMeanwhile teams are going through rubble and some Florida coastal towns with heavy equipment and cadaver dogs Saudi Arabia is vowing to retaliate if the U.S imposing sanctions over a prominent Saudi journalist who was missing and feared dead and beer is calling Dwyer reports there's growing ...\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free friends\nAre determined to some of the worst damage I said my career\nMeanwhile teams are going through rubble and some Florida coastal towns with heavy equipment and cadaver dogs\nSaudi Arabia is vowing to retaliate if the U.S imposing sanctions over a prominent Saudi journalist who was missing and feared dead and beer is calling Dwyer reports there's growing diplomatic tension over ... ... feet\nPresident Trump has warned that Saudi Arabia will face consequences if it is to hide from all showed the suspected murder is the Trump on CBS or sixty minutes we're going to have to say\nWe're going to get to the bottom of it and that will be severe punishment\nFor Saudi authorities didn't take long to answer with a warning of their own or government official pulled the kingdom state run news agency that they totally reject any diplomatic threats according to the official quote the Saudi Arabia received any action will respond with greater action\nAt a Saudi said the widespread allegations of murder are nothing more than ... ... they have yet to offer any official information about the whereabouts of been missing journalist college wire NPR News\nIn Germany the political coalition partners of chancellor on gal America have taken major losses in the very end state elections as we Nicholson reports the poor regional results may have repercussions for miracles federal coalition government\nThe Christian social union ... conservatives have such that was the result since Nineteen fifty and anything that apps and its majority in the regional parliament\nMichael's other federal commission pot and other Social Democrats also said pony flown in from second position to sit and gaining any Hoff as many voters as they did in the previous staged elections\nWill see a few is still in pole position the policy will have to follow the coalition to govern does area and they victims with environmental screens who came second the far right alternative for Germany policy and should the state legislature to sit assess time off to coming full for NPR News I'm Esme Nicholson in\nBerlin iconic retailers Sears is filing for bankruptcy the company failed to make a debt payment of one hundred and thirty four million dollars it's known for selling appliances clothes and cars Sears is also now known for its dead worth about five and a half billion dollars Sears officials\nSay they plan to stay in business you are listening to NPR\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service more ad campaign monitor dot com and Americans for the arts\nGood morning with a nine point five W E s a news I'm Maria ... into the state house and Senate are on track to clash this week over a bill to make it easier for child victims of sexual abuse to sue their abusers but W E essays Katie Meyer reports a split over whether to allow retroactive law suits may sink the proposal\nThe villain question would eliminate the statute of limitations on all child sex abuse cases and extended the cat for victims to file civil suits against institutions diversion the house passed but also open a two year window for lawsuits in cases on which the statute of limitations already expires\nThe Senate got rid of it and the draft of proposed changes instead of adding a compensation fund for statute limited victims and establishing a public registry where have you there can be named democratic representative mark ... county is the strongest backer of the house version of the bill is going to be\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program at\nThe end you dot edu flash I I I\nLeague and we were founded in the basement of the old post office building on the north side fits Burke wiser basement I actually most of us don't actually\nUh Pittsburgh history and landmarks had taken over the building so they had the rest of the building and there was a post office museum I'm In it and Pittsburgh it's er and landmarks I kind of a traditional historic them except that Senate\nSo oddly we were in the basement and then I'm In the Nineteen late Nineteen eighties they moved to the second floor leaving the first floor for Pittsburgh history and landmarks um and then eventually in the nineties they took over the entire building we took over the entire building yeah between\nTo Saturday light brigade to reading is fundamental allies for children were all kinds of coming together with Manchester academic charter school to really show how kids learn and to show 'em all the things that we can do kind of in an experimental mode\nUm to make things um to me to push education\nLittle bit further mentioned thirty five years the beginning of our conversation what's your hope for the next generation of kids in the children's museum\nUm we actually hope to change education by actually I'm doing these small experiments in in in for a world of the museum and then apply them to the formal classroom um so we're really hoping that we think differently about education\n[noise] Jane Warner is executive director of the children's museum of Pittsburgh Jane thanks so much for joining us thank you for the confluence on Ninety point five W. E. S.\nW. E. S. A. is supported by Carnegie Mellon university's integrated innovation Institute with its master of integrated innovation bringing engineers designers and business professionals together to tobacco industry and societies greatest challenges details at CMU dot edu slashed I\nAm a inherently the confluence airs live from nine to ten am but the news never stopped\nAnd find more stories conversation tomorrow on our website at W. E. S. dot FM flash constantly on Twitter at W. complex and wherever you get your pod captain think I'm going to have an id point by UPS thing\nI'm Katie black leave with the ... as we can hit street to North Martin the M opens in the north Pennsylvania in two thousand eight museum showcases artifacts from the Nineteen forty eight abnormal atmospheric incident known as the more smog that show twenty people and made about seven thousand second\nThought was caused by the combination of the mission from a nearby fields that in a severe temperature inversion trapping a pollutant in a layer of fog\nThe lawsuits and health effects after the event are often credited with influencing policy like the clean Air Act that today's the predominant ... October Fifteen twenty [noise]\nW. E. S. A. is supported by Carnegie science that are now showing the art of a brick by ... the lego art exhibition includes rendition of work by run out orders to including Monet indigo lifestyle ice sculptures and so while his own creations details at Carnegie science center dot org\nThe confluence and one aid to the reason\nFree to explore free to pursue the truth Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nSupported by Carnegie science that her mouth showing the art of a brick by night from where the lego or the exhibition includes rendition of work by run out orders to including Monet undergo life size sculptures and ... own creations details at Carnegie science center dot org\nThe confluence and one day two of the reasons why W E s as you go to radio station\nThese programs need your support so W yes they can keep them on the radio please give now during our fall membership drives W. E. S. A. dot FM or call for one to six nine seven to nine five five I'm is radio what Terry O'Reilly\nDitch your sustaining membership match dollar for dollar right now it doubled usa ... or call us at for one to six nine seven twenty nine fifty five\nCurrent sustaining members were encouraging you to join by offering double the annual value of your monthly gifts of give ten dollars a month and we get an extra hundred and twenty dollars things to the match joined or leadership circle level at a hundred dollars a month that's an extra twelve hundred dollars match we'd go\nAbout thirty eight minutes left to get in on this offer so call right now for one to six nine seven to nine five five or W he has said FM\nWhen you listen to the news on W. E. essay you stand with the facts you stand for political reporting that holds our leaders accountable for example we've been reporting on Kevin acklin who a year ago works for the city a aunt and most recently a\nWas chair of the you are a now is going to the penguins to oversee the lower he'll\nDevelop and a lot of questions there and we're seeking to answer them for you you stand for science news that enlightened as we cover all kinds of amazing discovery it's out of CMU and pet\nNow I'm asking you to stand with W yeah say as a sustaining member of the station support of just ten or Fifteen dollars a month and shares the news you trust is always available for one to six nine seven to nine five five or W E S H ...\nThere are lots of good things about sustaining membership number one your membership is ongoing you never have to worry about renewing you never have to remember when was the last time that you gave\nNumber two is a great way to support W E s say as part of your monthly budget the same way you do the other things you do every month third more sustained errors mean less time for on air fundraising\nAnd more news and information for you plus it's easy just choosing amount that works for you maybe ten twenty even a hundred dollars a month you can set it up to be automatic from your bank account or charge it back to your credit card than just sit back and no you are making a big impact\nCall us now for one to six nine seven to nine five five or W E S C I F F\nAnd what's really great about all this is that your support does go directly to news coverage but from NPR and from our newsroom here at W. E. essay\nOver the past several months we've been putting your membership dollars to work on a series that we're proud to launch this week it's called dividing lines the shape of education and Pittsburgh and it's a critical look at Pittsburgh public schools fear pattern which is the map that assigns kids to neighborhood schools based on where they live\nWe've got stories about the choices parents make about where to send their kids to school about desegregation about school closures and more\nIt's an eight part series that runs from Wednesday through next friday and it's a great example of work that's only possible with your support for one to six nine seven to nine five five are give on line that W yes they got ...\nSo give ten dollars a month and we're going to thank you with something that you always see in our fundraising\nFree to explore read it for the the truth Ninety five double you yet they Pittsburgh NPR News station the sound of a free press\nSchool closures and more it's an eight part series that runs from Wednesday through next friday and it's a great example of work that's only possible with your support for one to six nine seven to nine five five or give on line that W E S H ... fan\nSo give ten dollars a month and we're going to think you would something that you always see in our fundraising drives a tote bag this time or WCBS W E s a summer dreams tote bag by local artist Baron Batch\nThis artwork was so popular were used earlier this year on the W E S a ... this time we put it on a tote bag to on the one side the bag has batches brightly colored Pittsburgh city escaped with oranges and ribs representing the backdrop the city\nBackdrop splashes of blues and greens and the buildings are made up of negative white space that really makes them pop the logo for W E essays on the other side\nAnd the ... top so it's really really convenient and good use great to take to the market support the station get a great new tote bag with the original art from Baron Batch for just ten dollars a month\nNow it's your time to stop abuses standing member of W E essay and support this important work in Pittsburgh\nYou can reach us online to do when you you say ... or call us now is for one to six nine seven to nine five five and thank you for supporting quality journalism in Pittsburgh [noise]\nThe tech industry can't seem to stop picking narcissistic CEOs\nBut are they bad for business from American public media this as marketplace ... D mystifying the digital economy I'm only one [noise]\nMarketplace tax is supported by his Cox insurance providing customized insurance for small and medium businesses so they can do more and more more and hits Cox dot com or from an agent\nHip hop insurance encourage courage anti carbon night offering data protection solutions for businesses including automatic back up for servers and point protection high visibility and disaster recovery and data migration learned more it's ... dot com Silicon Valley\nLoves a charismatic founder story but there's a difference between leadership\nAnd nurses system and new research shows that narcissistic CEOs are actually bad for business Jennifer Chapman is a professor of management at UC Berkeley ... school of business her research focused on the tech industry and found that narcissistic CEOs tend to pay themselves more and pay their executives less\nThey get involved in more lawsuits because they take more risks than they need to and they tend to hire people more for their loyalty then their skills are judgment\nI asked her if the myth of the genius founder means a lot more nurse assistant tech\nWe hear a lot about CEOs who our founders in the technology industry adopting behaviors that appear high on the narcissism scale\nBut in the end there are as many founders who are not narcissistic as they're our founders who are nurses cystic\nSo it's not really a causal factor you don't have to be a nurse if is to be a founder\nIt sounds like it's hard though to disentangle those two things those two perceptions right\nVery hard to disentangle them particularly if you think about being a board of directors who selecting a new CEO and the c._e._o. is savvy enough to put his or her best foot forward\nIt's much easier to see the energy and division and the confidence\nDreaming on W. E. N. say it's supported by Carnegie Mellon university integrated innovation Institute details on a master's program at\nThe end you dot edu flash I I I\nTake your only if you think about being a board of directors who selecting a new CEO and the c._e._o. is savvy enough to put his or her best foot forward\nIt's much easier to see the energy and division\nAnd the confidence um and harder to detect how the person treats other people how much\nUm he or she will claim credit for success and so forth and so you know one recommendation is to really build into evaluation tools\nThe ability to get a much more nuanced understanding of these kind of the downsides of the narcissistic personality\nW E s I supported by the Senator John Heinz history center presenting destination moon the Apollo eleven mission the exhibition features Smithsonian artifacts from the Nineteen sixty nine moon landing mission including the command module Colombia\nAnd Buzz Aldrin so much information and tickets are available at times history center dot org ...\nW E S H celebrates Ninety neighborhoods Nineteen good stories weekly series about people who make the place they live a better place to live made possible with support from UP MC life changing medicine\nIs the confluence I'm Ninety point five W. A. yeah say I'm Kevin gap and today we meet Vanessa German a home would based artist was dedicated her life to using your talents and art to lift up her community Ninety point five W. A. yesterday's Brian Cook reports\nOn what's going on I don't want\nTheir its power and are\nThe Knesset Germans passion is rooted in her imagination\nWhich has led her to building elaborate sculptures and write and perform stage place it's also been the vehicle she's used to help ensure the tools or creativity or accessible to the residents in her community she says she began creating art by using materials she found a during her travels\nAnd one of the way that I did that was\nPick up stuff out of vacant lots than from the front porches and vacant houses and I would take this wood and take these caves and bottle caps and all glass bottles that I Would find and I would stack them and move them around a certain way in my studio and the act of moving the\nMaterials around then transforming them did something to my mind\nHaving struggled with depression German attempted suicide numerous times and found that art was her way to cope with the realities of life she attributes her ability to carry on as a catalyst for her artistic prowess I decided\nInstead of ending my life to sort of think about my life scientifically for six months and see if I can tap into the power of love\nA place she calls the art house sits on Hamilton avenue and home would outside is draped with mosaic decorations\nInsider paintings rooms filled with decorated shares bookcases and walls handmade African inspired statues of powerful women stand tall telling the story of with German says is the pain endured by generations of oppression I\nThink of it as like a hand down sorrow that my grandmother felt a little bit of this and her grandmother felt a little bit of this is connected to like their rupture that African people experienced being ruptured from your land and when you're ...\nRead it for free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free friend\nOr a of a German says is the pain endured by generations of oppression\nI think of it as like a handed down sorrow that my grandmother felt a little bit of that sent her grandmother felt a little bit of this it is connected to like their rupture that African people experienced being\nRuptured from your land than when you're wrapped in front of your land you're ruptured from the seeds that scare people felt in the ground to nourish your body\nChildren from the neighborhood or welcome to enter the house when the doors are open and encouraged to use our supplies to create anything that suits their imagination\nAnd Germans talents aren't limited to the realm of visual arts she won acclaim for her performance in ... black bottom written\nBy Pittsburgh born playwright August Wilson stage play director mark Clayton setters says Germans talent is on matched worldwide\nShe's type of person that I like to call the up and do it all person she knows she has a gift\nSouthern says despite Germans work being featured in museums around the world he's pleased to know that she has no plans of leaving western Pennsylvania she can\nGo overseas and become a\nFemale those grade is she decided to stay at home or\nGerman says her motivation to create as notch reproduce art for art's sake but rather she sees her art is an expression of love an opportunity to pay it forward\nThere is power in love love has literally saved my life I'm going to share it with other people because I Believe in this power\nI'm Brian Cook Ninety point five W E s a news\nWho's making a difference in your neighborhood share your suggestion for our series W E S H celebrated Ninety neighborhoods nine to good stories a W E s a lot of them slash Ninety you're listening to the confluence\nOn Ninety point five W E s say\nIt's the compliment I'm Megan Harris city employees may soon have to pony up if they continue to light up but it's back to the interview it's Bob ... is with us in Studio to explain a new fee policy that could affect about one third of the city's three thousand employees Bob thanks for dropping by thanks for having me Megan so Bob tell us about the tobacco the\nOkay I'm In twenty Seventeen the city announced that it was going to impose a tobacco fee on employees who smoke are you smoke was tobacco and the money will go toward paying a health care premiums for these employees\nDoes premiums will be fifty dollars each and ... exactly will this affect\nThe employees are that are effect there are about one thousand uh workers that are non union and members of two unions the asked me and sci unions\nThose union jobs what kinds of positions are we talking about\nPeople like managers supervisors who are not in unions and I'm clerks people who work in offices for say like a the department of public works um mainly clerical\nWith this approach split city employees there the various unions that for that the with imposed\nWell the city says it was a day informed employees and they've had Fifteen months now too you know either they have two choices they can either quit or enter into a tobacco cessation program that the city provides free or to all employees\nSo how are they employ themselves taking us well\nThey're not very happy I'm I talked to several employees are more than several I've talked to a dozen or so that use tobacco and um\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nFirst [laughter] All right so let's start with a positive I Would say the most positive thing that's happened to the Steelers and the last ten months\nI was the energy the smiles even the tears ones dealer linebacker Ryan shades here yesterday walked onto the field that he was carried off of last December with a severe spinal cord injury\nAbsolutely I mean it's it's ... that they feel that can happen ten years ago at at this point and it did seem it seemed like it happened so so long ago but it it was it was good to see\nA ... year you know he gets better by the day to by the way it as far as as far as his stride the the the ways walking just\nLast yesterday compared to the going across the stage at it the draft you know it it's been it's been a lot of progress with him in in\nYou know your your factor and that it did happen in Cincinnati which is where the injury happen in the first place yeah that's and that is undeniably positive thing and it's and it's a positive turn for ... for what looked to be a tragic situation and instill on some level is but it it's it's tracking about as well as I could", "show_name": "The Confluence", "year": "2018", "city": "Pittsburgh", "day": "15"}