{"month": "10", "state": "TX", "station": "KTDH", "content": "Foresaw the warring treaty Mr Gabriel ... Saturday evening at five central\n\n[noise] this is Ninety One point five Katie ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter up high plains public radio visit H. P. P. R. dot org and look under the support for details\nThere's this spring\nAnd the mountains of slows\nTo the\nRoom in the arm using in West Virginia Public broadcasting which is a more provided by Bailey and leisure and by the west Virginia tourism office do another mountain stage with your host Larry Gross\nThe loan leave me alone\nAround the world is\n\n\nThank you very much for once again the mountain stage live performance radio for the mountain\nState of West Virginia we are at our home at the culture center theater in Charleston West Virginia we got one heck of a show for you one of America's great guitar as one of America's greatest guitars and one of our great friends\nIn West Virginia we got one heck of a show for you one of America's great guitar as one of America's greatest guitars and one of our great friends with Julio cocky is back to visit with us [noise]\nTo see him again [noise]\nAlso a very special banned from over in Mali B. K. O. quintet from Mali will be out\nDuring our next hour also [noise]\nAnd we have three very fine singer songwriters each with a very different flavor later on during the ... going to be hearing from Mr Johnny Iranian you'll also hear from or a test\nBut just start us off a man who hasn't been with us for a good while now we've had him on a couple of times back when he was just getting started\nAnd one of the reasons that he wasn't back since that so often is 'cause he for a while I Lived in Spain and he played a lot in Europe like constantly played in America too but\nHe kind of split his time now he's moved back to Nashville and made a new record on yup rock called love in the modern age\nAnd it was inspired by the music he heard in high school back in the eighties or bands like the blue Nile and the cure and I really like it I Love the sound of it and uh like the uh the words also he's brought some friends with him please welcome back\nTo the mountains they matured Josh Ross [noise]\n[noise] [noise]\nMm Mm Mm\n[noise] Mm [noise]\nThe thing that was our\nIs independent\nThen maybe you\nNo longer be with us is being able to get into\nGame but you know then it became\nA nominal business plan to\n\n\nDay\nLaying down\nSee we\nIn the region day the\nGame but you know then came\nThe day the businessman has been in the ... been\nIndeed the business and\nDeep deep into the building and the danger and they do believe in the debate the\nBuilding ... and the dangers to the victims\n\n\nHer ... her ...\nHer\n\n... her\n... and ... and\n... really ... the Newt you don't deal with the ... well ... was do the do the old law school and um so\nDo\nMuch\nBetter to lose you lose ... ... ...\nNew winners and losers nod\nDreaming you\nIn the way this show the ... and I'm not ...\nBut I don't need to know\n\n...\nLetters and numbers\nHe's back in the U.S now after a little ... where he was living in Spain but going back and forth a good bit he actually won an award over in Spain is like the equivalent of Oscar she did a song or a movie there Josh Ross it [noise]\n\nYou're listening to mountain stage live performance radio for the mountain state of West Virginia major funding for mountain stages provided by Bailey and Glasser L L P A nationwide law firm born in West Virginia with all this\nMajor funding for mountain stages provided by Bailey and Glasser L L P A nationwide law firm born in West Virginia with offices in Charleston Morgantown wheeling St Louis D.C Boston Alabama Florida and Delaware details\nAt Bailey Glasser dot com\nAnd by the west Virginia tourism office there are places you visit and places you behold you'll find natural wonders and endless experiences in the mountains state West Virginia a place that's almost heaven more information the w._b. tourism dot com additional\nSupport is provided by hip historic Charleston West Virginia you'll find live music seven nights a week in West Virginia is capital city it's music from the hip your adventures starts on line at Charleston W\nThe dot com does this mountain stage on NPR\nSupport comes from Vinnie county CB reminding everyone that when they patronize businesses in Garden City and ... they are helping to keep the economy strong in southwest Kansas any county CBC dot com\nYou're probably up early on Sunday mornings anyway right most likely you're sinus practicing the sack\nYou know the one he didn't want to practice after school on Monday Tuesday Wednesday Thursday or friday will laugh it off with the little thoughts on the prairie at eight thirty five every Sunday Morning on high plains public radio during weekend edition or listen online at H. P. P. R. dot org\n...\nSupport comes from Amarillo symphony presenting concerto an F ... conducting and featuring Conrad towel on piano October nineteenth and twenty at seven thirty PM at the globe new center Amarillo symphony dot org [noise] if you missed part of the\nMountain stage show or you just want to hear part of it again or you know somebody who lives where it's not on the radio you can hear the shows at least the last few years at the podcast section of mountain stage dot org each of these broadcasts will include sons we don't have time to sit on the radio as well as our complete finale song\nThere was a favor take a moment to subscribe\nRaped and review the show on apple pie guests or wherever it is that you get your podcasts\nWell it's time to a welcome back a friend\nOf ours has been making music for over Fifteen Years now come to New York city and it's been a busy Fifteen Years he's just released his ninth\nAlbum called natural\nHe also done some eat peas and back in two thousand eight he did a project called fifty two which he wrote a song every week and put it on the Internet\nOr every week of the year\nLast time we saw him he was\nIn concert up in Morgantown with us with Judy Collins she did a record with her was nominated for a Grammy Award they wrote themselves together and they recorded together but now he's a back on his own please welcome back to the mountain stage the ... [noise]\nMm\nMm\n\n... ... ... ... ...\n... ...\n... we're ...\nWe're rebuilding petri anywhere we hear about one in a\nRoom before we know\nRange will be blue\nMoses Malone in Miami or ...\nSo no no\nThe news ... ...\nDo not very ... show me state can show\nSued\nYou owe\nDoing to do\nWe are ...\n... ... God or no deal goes through the ...\nI'm going to find new more there's some news this morning\nWe're in before we know\nChinese will come over\n\n...\n...\nYou\n[noise]\nLarry mentioned that my last record as\nIt came out recently ah last year a spy nights it's called natural there's a lot of songs on this album that have to do with forgiveness\nOr in this next song starts the record and it's about someone who are very much needed to forgive my life to uh to move us forward [noise] they're using something called hard on the line\nThat I'm only ...\nI'm going to say it'll do\nI don't want to bring you down\nWell I Want to do with the\nI just want to go ...\nJust want to go to Jean\nAre you from [noise]\nGoldsmith with him members of will go and uh the ramblers and he's got it got some great new songs are in a nice new sound is going to do some things so low but he's also going to ask our been and some are booklets to sing with 'em because you get some super harmonies on this new recording please welcome\nFor the first time so low to the mountain states Mr Johnny Iranian [noise]\n[noise] they [noise]\nHere's one off the new record I'm\nI'm thinking about happy anniversary the early and it's going to get cold pretty soon up in the ... and you guys I'm sure you get a little bit of cabin fever down years will\n... [noise]\n\nBreak\nReally\nName\nCabin\nThe woman\nYeah then uh\nIn the\n\nThe the notification\nThey were most men in their store\nRing ...\nGary mark little man\nA ...\nJust their room in\nThey just read lord no\nWell the ...\nThe day the\nOn big barrel a day and\nNight she runs wild\nThe movie you know they they yeah\nThis is hard to say\nI'm voting with me\nThen to\nThe\nI few [noise]\n\nGive them around the ... [noise]\n\nHotel accommodations for mountain stage guests are provided by the Charleston Mary ... town center hotel centrally located for the business and pleasure traveler in downtown Charleston is retail district there's this mountain stage on NPR\nSupport for high plains public radio comes from the work boots in Amarillo offering a variety of brand names and clothing and foot where more at eight oh six three seven to seven five one one\nI'm Bob Davis and since June I been the executive director of H. B. PR I remain impressed by the team working staff here and the strong community support that makes our work possible I'm humbled by the spirit of the people of the high plains\nOur members play a key role in age ... mission to gain knowledge and grow community now is your chance to join us please give today at H. P. P. R. dot org thank you for your support\nSupport comes from boot heel distillery in the historical district of dodge city Kansas a complete lifting of where to\nSupport support\nComes from boot heel distillery in the historical district of dodge city Kansas a complete lifting of where to find their soil to sip spirit is online at Boot Hill distillery dot com\n\n[noise] this is Ninety One point five Katie ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nIs you appreciate having public radio service available as a Web stream and pleased tank and patronize the community sponsors you hear mentioned on the air who helped covered their direct cost of operation thank you\n[noise]\nIf you're just tuning in\nThat she did that during this hour we're going to be hearing from\nOne of the finest bans in Africa from Mali be K O R here we're going to start the second hour\nAnd find style with the man who started coming to see us back in Nineteen Ninety or he started playing long before that and his\nFinger picking fiction twelve string guitar or is it really kind of a set the standard\nFor a whole lot of people that have been inspired by his music\nOver the years is west to records uh one was made with uh my boarding a fish called sixty six steps another is a solo record called try and stop me that's one thing we would never do please welcome back to the mountain stage Mr Leo caught key [noise]\n\nMm\nMm\nI just like you mentioned something that I'm running Scott\nSaid a one night when he was walking on stage in London was his saxophone no\nAt a club called Ronnie Scott she said I should have stayed in bed there were more people there\nIt's really nice to play in a place that you know\nI Can't say it's better to play than it does to an empty room matter of fact the item musicianship is the ability to play to an empty room\nBut much more difficult than an empty ... vision in different you\nThose are better if you're despise the new simply visible a\nJob here is to play the guitar and any minute now\nAnd just waiting you know you know you're sitting there and you're shaken while you don't think they feel like you know okay let's see why this is ... you you open your your eyes and you you know this has happened to me three times that I Know there may have been more\nWhere I opened my eyes and I had was drooling on\nSomething like my fourth Chief Bratton\nAnd drilled drool isn't just one and done that kind of a continuum it [noise]\nAnd there's lights at all and that kind of leverage\nThe enthusiasm lease dams that boy\nShe replaced a shame\nThat this was written by Frisbee boom boom full or otherwise known as for his dad to all his friends certainly his mother changed the attribution on his songs when he died to Robert Mueller\nIf you've earned a name for in your title to\nHis mother was Laszlo taught psyche\nPointing that out but\nLaszlo ... a little too forgotten and rightly so for that to mean anything\n\nYou bands gee in due to from the back of\nThe yeah\nThat was the beginning was dark that\nYou've been shaken a gym she'd love upon Josie after a while but don't you Jacob Jew hard though\nIt's been fine as long as she grounded strain that she'd go\nNow\n\nBut that was wrong or up in a\nLast name\nShe goes so good pie and in Rico goes to the\nOr did you speak Richard\nNixon and by that plane insanity do\nGel him have red lines on the last two months\nAnd say he tries you\nAre running shoe\nJust to watch\nTheir duties smile and they say he tries you\nRyan's shoe\nWas his body of lower your cell in\nThe the courage to Ben I'm Alone you since she runs a stranger G ...\nNo ...\nBut that was wrong Robin the last train from Jean ... and ... ... Mm\nIt's been five the long used since you were on the train ...\nBack of a drug\nThat was from Rob in that strange imogene show good blonde and in Rico good luck\nShould good well ...\n\n\nWhat do you get one you Rob a drain on you know I was wondering ...\nThis is a call for ... Mm Mm Mm Mm\nI don't know how long I've been out there now but I think I'd reached by\n... appointed our um Mm\nBy or left Missouri one year uh Columbia, Missouri and he hitchhiked out to Greenville North Carolina that up to a New London Connecticut and the thing about hitchhiking\n\nThe hardest thing is all the interesting people you've made mhm\nMm\nMm Mm\nMm Mm Mm\nMm Mm Mm Mm Mm Mm Mm\nMm Mm\nMm Mm Mm Mm Mm [noise]\nMm Mm Mm Mm\nMm um Mm Mm\nMm\nMm Mm Mm\nMm Mm [noise]\nMm\nMm\nMm Mm Mm Mm Mm Mm Mm Mm Mm\nMm Mm Mm\nMm Mm Mm Mm [noise] Mm\n\nMm Mm\n\nMm Mm\nMm Mm\nMm ... ... ... ... ... ... ... ... [noise] [noise]\nMm Mm [noise]\nI keep very much [noise]\n\n\n[noise] [noise] yeah\nSo great to see Leo again [noise] we get a chance [noise] to get a chance to go see him in\nConcert you fill out there he's still traveling around playing concerts all over the place was lives in\nUh Minneapolis like he has for many many years and I believe they told me downstairs that he and Mike Gordon or the bass player from fish are working on a new one they did that one sixty six steps and now they're working on something new so\nAlways a treat and a pleasure to be around Mr Leo cocky\nDa da da da\nDa da da da da\nDa\nDa da da\n\nDa da da da\nDa\nDa da da\n\nA little about what a you know oh\nWas a\nThe la la\n\nGruber for girls who were\nNews is good\nFor little nobody who would come\nThrough from your\nFrom\n\nYour duty removing\nSome\nOf these groups you\nTo build a new group\nThat number number one number wrong button on it and there were no\nNo no no but I was\n[noise]\n\n[noise]\nWhat am I Love to have money are we going to go on living rebel none of them\nEven\nThough you might need to and I remember reading about\nNo way to do with me\nThan I Am\nOne [noise]\nBut you know ... ... you know what I'm\nTo\nSay you know to the gym in [noise]\n... well the other\n\nThe name of the ban on gay or like he came to me\nLike right", "year": "2018", "show_name": "Mountain Stage", "city": "Dalhart", "day": "20"}