{"month": "10", "state": "TX", "station": "KTDH", "content": "Hi I'm Carol guy or [noise] and I listen every Saturday [noise] openly deranged I mean [noise] open range with Steven Johnson [noise]\n\n[noise] this is Ninety One point five KTLA ... eighty nine point three Katie da ... service of high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. at H. P. P. R. dot org or call eight hundred six seven eight seven four four four\n\nPercussionist local is walking tutor makes some of the most interesting sounds we've ever heard here on mountain stage one reviewer called his electric in beer a music electro Congo Bali blues whatever you want to call it it screws and textures are mesmerizing\nWe don't have many purely instrumental performers on the mountain stage but we make an exception for steel isn't the core of the band is American guitarists Jeremy ... and English pedal steel player Spencer column\nAnd the music they make has been influenced by spaghetti western film tracks Brian ... you know surf guitar jazz and much more\nThey finished that set but now walking scooter [noise]\nThat day day too\nYou know when when you\nDown and do they do good in\nKnow\nAll those who do that [noise]\n\n[noise]\n[noise]\nTold\nThe street people would\n\nWhat to do for women\nUm\n\nOh oh oh\n[noise]\n[noise]\nIn the ...\nThe gym [noise]\n[noise]\n[noise]\nAnd\n... well\n[noise]\n\n\n\n\nThat was still was from Nashville playing you know nothing preceded by southern Californian walking scooter with future much repeat you\nJust in the last several minutes we heard a group if you still guitar electric guitar and keyboards preceded by a trio featuring bass guitar electrified and bureau and an affects Laden saxophone we don't have to remind you that you don't get this stuff and other places or do we\nMountain stage with you right now because of the station who connects us with you if you were thrilled hearing that said as we are to play it for you then consider a pledge of support today\nI'm sure she is but that's about all she is she's also an old friend of mine [noise]\nShortage right here in my wallet Nineteen eighty two\nI think those are all but certain no offense again you have a good night to [noise]\n\nMm\n\n[noise] Mm [noise]\n[noise]\nMm\n\nWell it's a good thing we didn't throw this away\nThey turn the radio\nI'm pretty sure that happening what we move up to I guess he just decided to let us go ... make such a thing about that ...\nNot just some black cat\nThey don't get the policies that\nMen and women national haven't even to me a new name yet it by the\nTime\nJust like the whole time\nAgain during\nTheir lives who ...\nWho was always the same is nah\nYou didn't want to do your machine and in whom mainstream and you\nKnow in the\n... [noise]\n\nMm Mm\n[noise]\nWell there's a beautiful woman she walks with a lengthy calls her his print cards her head give she calls him are fat man called hip hop here she teaches first grade she got abused\nTill ... isn't a write\nA love grant\nShe charges just pray that he chose her\nMan isn't really isn't a grant\nFor years I've been married now why that travel\nTo have a boy and good luck that any job of love to dance with each other today that live\nIn a bubble go to church throughout the week not one day a job\nThere isn't a great ...\n\nAnd she charges his by ... holds her and\nLove right yes\n\n\nDo you not faster than I ...\nWhen the boys are as mothers\n\nTo that as a ... for a while\nWe're in the boys are at his mother\nOoh poo\n... doo for long\nWalks were living up to the dogs are going to cause Hi Jim she\nCalls him or her writings and got beautiful\nAnd love\nLove brown\nIn charge and just\nHold\nIt loves grown [noise]\nLove right\nAnd\nAs a lot of\nGround [noise]\n\n\nThan Baker and his band with isn't love grades and before Sam Todd Snyder with just like old times\nTaught Snyder and Sam Baker are great examples of artists to always be admired greatly here in the land of public radio\nAnd their music may never be mainstream but you already know that and that's why you turn to public radio for music discovery and that's why we're asking you to take a moment and pledged to the station that connects us to you each week the way to do\nThat is to call one eight hundred six seven eight seven\nFour four four [noise]\nSupport for mountain stages brought to you by Regan jewelers where quality craftsmanship have been backed by their last name for over a few years located in downtown Garden City Kansas\nThat was a lovely song that we enjoyed their by Sam Baker isn't love\nGreat [noise] and I ask you right now just to take a moment in and say to yourself isn't public radio great\nAnd if you benefit from public radio if you're one of those people who tune into high plains public radio on a regular basis perhaps you spend yourself spending a quite a bit of time with the service because it enriches your life through these music programs like mountain stage\nAnd maybe you listen to all things considered and MORNING EDITION as well because you want to be an informed citizenry and be up to date on what is transpiring around the world and also in our own back yard public radio as a community resource for our listening area for the high plains region\nAnd it is here and in a debatable ah to to be acceptable to so many different listeners over five hundred thousand people across the region can tuned to high plains public radio\nSo that they can be informed and they can be entertained\nAnd public radio is available on the high plains because of listeners who value that and want to become part of this team who supports public radio and keeps the servants alive and well in our communities you too can joined that team right now when you call one eight hundred six seven eight seven four four four\nWith a pledge whatever fits your budget and whatever ... reflects you're listening habits which is that that you take a moment and think isn't public radio great and how can you become part of that one eight hundred six seven eight seven four four four\nAnd that was a great set we just had a we started off with Todd Snyder and then it went right into Sam Baker both of these guys are living in Texas right now\nAnd uh I'm just I'm just curious how do you experience that music has to me that was the both of the songs were very literary they're very poetic they were telling a story and that that's kind of one of the great things about mountain stage they pick the it's a very disparate songwriter and you get to just sit back and relax and see what each one has to say and you could\nGreat things about mountain stage they pick these are very disparate songwriters and you get to just sit back and relax and see what each one has to say and you could really experienced the differences are Sam Baker he has a new album and it's just all these ... songs every third longest took this long instrumental\nAnd you just I was listening to it while I was driving to a producer springs for a music festival and having those mountains around you and and seeing this beautiful landscape we have in this country and listening to his music you just have such a great experience of it just it changes everything changes the chemistry about you and that's what I feel public radio does for me personally\nSo give us a call and let us know if if this resonates with you how is it that you experienced the music how do you experience having access to live performances from these fantastic performers that we don't normally get to hear from I mean these guys don't tour that much\nUm and a lot of the times they don't stop in our region\nSo one eight hundred six seven eight seven four four four is a number you can call and become a part of that and get in on a sponsoring these little free many concerts that we get on mountain stage every day one eight hundred six seven eight seven four four four I'm Jenny answer although I Am your host for high plains morning and the music director\nAnd uh I could not be more thrilled that we have mountain stage on our Saturday programming now and I'm here with Valerie Smith\nAnd Valerie you are part of the Saturday programming as well we have such a great line up on Saturday as a folk Americana and and lots of stuff on a mountain stage\nAnd this is your opportunity to change your chemistry by calling and making a pledge and feeling good about it one eight hundred six seven eight seven four for for this is your invitation to become part of the supporters of public radio they keep that service available in our region\nWhen eight hundred six seven eight seven four four four and thank you\nWe have another hour of favorites from the past year on mountain stage still to come I Hope you enjoy what you've heard so far and I hope you've made a pledge to support your public radio station if not take a moment and do it right now before the music starts mountain stage executive producer Adam terrorists is with me\nAnd we'll start this hour off with the high energy band ... made up of four women from the usa Brazil Columbia in Venezuela and after a little Dahmer\n[noise]\n[noise] because [noise] why don't you\n[noise]\nWhy don't you [noise]\n\n\n\n\n\nRight between vocalists Keanu parlor and before that was ...\nYou'll hear various styles of folk music world music original songs and many other alternative and in these sounds on the mountain stage and you'll hear it all in live performance is what we've always done and will continue to do with your help the same goes for all the programs you enjoy on this station\nHere's how to give that help\nGive us a call at one eight hundred six seven eight seven four four four one eight hundred six seven eight seven four four four thank you so much for being here on high plains public radio\nIt's a ... I Am the music director and I am a big fan of mountain stage that sat right there we had ... at the top they are a a Latina banned they've got\nFour members from Brazil Columbia Venezuela and the U.S we've got to see them at global turkey twenty Eighteen what an incredible performance there\nAnd of course reiki tank E I from South Carolina and are they do very specific jazz you know based from the west African beat of that goal area of the southeast\nWhere else can you find this type of music nowhere on the radio but high plains public radio is this a veil a ball and I this is this is your time to participate in\nCan you find this type of music nowhere on the radio but high plains public radio is this available and I this is this is your time to participate in it by calling eight hundred six seven eight seven four four four I live in the studio here with Valerie Smith\nAnd we are both big fans of the variety of music that is available on the dial on high plains public radio\nYou too can become part of the quality of sound that you and you have come to enjoy and high plains public radio\nBy making a sound investment this morning at a one eight hundred six seven eight seven four for for\nYour pledge of support right now we'll let your public radio station that this type of quality programming is valuable to you and chances are it's valuable to your neighbor and your community end over three hundred communities across the listening area who benefit from having public radio and viable on the high plains\nH. P. P. R. is member supported\nMeaning that it's these donations they keep the service on air you can become part of that at whatever level is comfortable for you\nWhen you call one eight hundred six seven eight seven four four for a Angie have fully is out there and she will answer your phone call and she really enjoys speaking with listeners and members of H. P. P. R.\nTell us what you love about high plains public radio let us know why your passionate about this service\nEngineer and I would love to be able to share those notes and with was the other listeners and encourage them and inspire them to become part of this community of listeners your sound investment can be made this morning at one eight hundred six seven eight seven four four four\nIf you'd like to make a one time donation right now sixty dollars you would qualify for the H. P. P. R. twenty Nineteen calendar that features Fifteen listeners from the area artists who have contributed these really beautiful photos of our region the one criteria for the photo contest\nThat was conducted last year was that it has to have the essence of the high plains in the photo [noise]\nSo you can sign up for one today at one eight hundred six seven eight seven four four four and thank you so much for listening\nFrom NPR Music and West Virginia public broadcasting was support provided by Bailey and Glasser and by the west Virginia tourism office welcome to a special edition of mountain stage with your host Larry Gross\n[noise] the world is turning\nHello and thanks for tuning in it's time to look back over the past year and bring you some of our favorite mountain stage performances and this year we enlisted the help of our band staff and crude to pick them Adam Harris our executive producer is joining me\nToday well here's some performances chosen by our whole team during the next two hours and you have a chance to make a pledge to your public radio station\nWill start out with a set of three songs that includes one written and performed by Molly total the first woman to be named guitars of the year by the international bluegrass music association and then another woman who's originals inhabit a world of sweet retro flavored jazz cat Edmondson but\nWe start with a man who's been visiting the mountain stage since Nineteen eighty seven he's one of America's most loved and respected acoustic singer songwriters and his latest recording is true in time along with the mountain stage band here's John Gorka\nIn in in in ...\n... ...\n... ... ... ...\nIt's a pretty new they are in a pretty new here how are you know\nWhere to go from here but it's easy to say the topic is ... ... ... since we\n\nWorry now is a normal summer comes to mind\nA runoff on whether or not germane losing her it's worse than west being a good thing my mom and them show\n\n\nGood news laws that a baby too hard [noise] did you do your day [noise]\n[noise]\n\nWhen you when you rent a common around them but not staying away now do not\nOnly young or skin and seen a movie where\nThey\nWere found bruises or not someone comes to mind no role modeling so Hi Louis Asian curse words [noise]\nWhenever feels good to see who um [noise] and you know you should\n\nSome of your carry on as best you can get out of man and and the ...\n\nDo you like to do when you have a debt\nBy about ... oh so many things I Want to say but how why ... ...\n... if you still think ... is trying to me my money\nIf you average still think Disney\n\nSupport comes from United Wireless providing coast to coast service with plans to fit your budget stores and agents across the region coverage you deserve service you expect details at United Wireless dot com [laughter]\n\nWho's who's Ninety One point five ... eighty nine point three ... of service of high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of age PBR Web stream is due to the long term financial support of individuals' all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n[laughter]\nIs next it starts with our guests from this past year who got the most votes from our band and crew the wood brothers singer songwriter and guitarist over is joined by brother Chris on base and friend John Doe rich on drums for can't look away from\nBrothers singer songwriter and guitarist Oliver is joined by brother Chris on base and friend John Doe Rick's on drums for can't look away from their latest album one drop of true\nThen comes Curtis Meg murder tree with one of his beautifully crafted songs wrong inflection Curtis it's the third generation of stellar word Smith said his family will hear his father James later on Curtis is joined by Diana Burgess on vocals and cello but first the ... brothers [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\nMm\n[noise]\nThere's a sweet little mom house in Virginia and one of the guns and ammunition [noise] in the driveway there are some pickup trucks and shot down racks and camouflage debate [noise] down a path to the river there little boys district in an efficient\nAnd when I hit the fan you know just the recall Buddha blade [noise]\nKnow what you can weigh [noise]\nUganda away [noise] you can't on the way that you can try what you pay\nThe ... [noise]\n... [noise]\n[noise] Houston to Denver died out about\nBarely covers up in a tower\nThat you get to the front of the [noise]\nThe College Board from up the street there to cut the grass about what our husbands away and\nThe the end because they know imams overseas may be lost in the orange juice fixes or hair up to ... live from Lebanon they\nKnow when you came liberal a\nYou can also go away [noise] the cat lover way you can say\n...\n\nSo there's a sweet little girl with a folded up ...\n... ... the black leads and dresses and the lights and Lorraine\nShe doesn't do the little white ... and the leftover last\nWild flower coming up from the dirt on the great\nIt's All right ...\n... ... ... do do do do\n... ... ... ...\n...\n... man they can ban them from the army I don't mean to be your grant them well in your home and you learn to read when I get it in your ...\n...\n... the ... and I tell you how do you think he's you know just me and I believe need you to buy\nAnd then they turn\n... wrong you\nKnow what\n... days per day\nIt's hard to know someone around ...\nNo [noise] with someone else around ...\nMain mainly known them now\n[noise]\n[noise]\n[noise]\n[noise]\nOn my very me ... me too far gone\nTake things on you know what he was just like it paints\nHe is now non Jews don't depend in pain and then when everything you have a hand in do you know very even had means [noise]\nHunted\nWith you but when I'm On Monday and\nI Am just said I'm not saying I like getting along the\nLawyer John Wayne oh well then bam bam\n\n\nAnd\n[laughter] [noise]\nWhat stands by the\nWay up above me we're both\nAnd\nDig the na na\nAnd I know\nThat if the Little Rock and\nGang banging died\nNovember y'all are\nMy number down well what\nThey\nDo in the\nMood\nMan [noise]\nWe know Robert de de\nDe dum la\n\nNa na na na na na\n\nLittle one\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\nWell [noise]\n\nSherman homes project with rock of ages song Sherman learn from leave on film and the first song and that's it was Jesus was a social drinker\nBy truck profit public radio runs on trust you trust the programs you depend on will be here and we trusted once a year you'll step up with a few dollars to keep them here but don't break the chain here's a number to call\nAnd that number is one eight hundred six seven eight seven four four four [noise]\nMountain stage is brought to you by western motor of Garden City campus offering Buick GMC and Honda vehicles family owned for over Seventy five years and doing business the only way they know how one way your way more a sharp western motor dot com\nAnd the panhandle planes historical museum celebrating archeology month with diner day Saturday October thirteenth one to four pm get connected to make fossils and more more information at Penn panhandle planes dot org\nGood morning I'm Valerie Smith joined in the studio this morning with your H. P. P. R. music director Jenny ... good morning thank you to all of the listeners who have tuned in to include high plains public radio and your Saturday morning\nWe've got some weather coming our way so that is a great time to hunker down next year fire and stay warm\nAnd enjoy the quality programming on high plains public radio\nWith some really beautiful songs I'm a big fan of rock of ages and this is your opportunity to become a rock solid foundation for high plains public radio with a pledge of support this morning at one eight hundred six Seventy seven for for for\nWhen you call that phone number you will be greeted by a staff member or a volunteer we have Carol guy are out there and wonderful member and listener an advocate for high plains public radio among other quality endeavors across the region she's here cheering her morning with us\nTo ah to welcome H. P. P. our members to the fold one eight hundred six seven eight seven four four four why don't you consider right now making your sound investment in public broadcasting and radio and educational airwaves\nThat ours to nominate with high plains public radio here that important number again one eight hundred six seven eight seven four four four\nA this is Jenny ... live in the studio with Valerie and we are just having a great time looking at the mountain stage it's it's a program that I think fits in perfectly with our son\nHello I live in the studio with Valerie and we are just having a great time listening to mountain stage it's it's a program that I think fits in perfectly with our Saturday line up on high plains public radio\nIt's so great to turn on the dial and have this variety we're going to have western swing and other things coming up next we've got a we've still got more music from mountain stage and uh it's it's for someone that has to play three hours of music every weekday\nI Am so thrilled to listen to these live performances curated a Larry Gross to such a great job he's been out of this for such a long time we just of course heard this Sherman homes project you might know him from the homes brothers and that was rock of ages and he did that song with Reverend Al meta Ingles Mila\nAnd she's just from the gospel family you don't get to hear this kind of rich music uh the folklore that goes back into some of these projects is just really inspiring to be able to tune in and hear such quality programming on high plains public radio\nHow is it that you listen how do you listen to public radio I is it just on all morning while you're catching up on short and the kitchen and around the house\nOr are you out doing something and listening to it on your on your phone give us a call and let us know how it is that you engage with the music on high plains public radio one eight hundred six seven eight seven four four four and Valerie Sherman homes he's Seventy seven he did this music ... Seventy seven years old\nI you'd still collaborating with you know people like Joan Osborne collaborating with a you know\nA ... it's just incredible to hear this music and Chuck profit of course a singer songwriter from the west coast I'm used to be in a psychedelic desert banned in the eighties and here he is he's a singer songwriter now and we have such a variety of music that we can listen to here on high plains\nPublic radio and keep it in rotation and be aware because again this is the only channel for this kind of music you just don't hear it on any other station on the dial\nHigh plains public radio is your one source for this music to support that music stand for stand for something that's really important and it's great art and there's great folk music we have here on the high plains one eight hundred six seven eight seven four four four\nHigh plains public radio strive to be a platform for musicians emerging musicians or musicians who have been around for a long time but are still looking for places to to share their their love for music and share their talent on the radio dial and they have found a home here on high plains public radio\nThat says a platform for musicians and you can become part of that solid foundation\nOf high plains public radio by calling with a contribution at whatever level fits your budget when eight hundred six seven eight seven four for for your public radio station and looking for one caller right now who will call and pledged their support and show their passion\nFor the quality programs that they enjoy that number is one eight hundred six seven eight seven four four four thank you\nVery grows here along with mountain stage executive producer Adam Harris was somehow I performances from the past year on the mountain stage chosen by her whole team the band grew and staff\n\n\n\nThe mountain go there with the grey king and the silver flame attuned mid preceded by Joan Osborne singing Dylan's trying to get to heaven before they close the door\nYou don't have to be a hardcore NPR listener to support your public radio station but if you're like me and have this station set to wake you up in the morning and program to come on and when you get into your car and in your ear buds when you walk your dog is it time to make a pledge\nYou can make your pledges support this morning at one eight hundred six seven eight seven four for for good morning I'm Valerie Smith joined in the studio with ... and we're celebrating a really beautiful day across the high plains\nPerhaps next morning you are spending some time preparing for the the storm and the cold weather that will be moving through\nOur area maybe you're doing some last minute cleaning and prepping for that and your public radio station that you just take a couple of moment to reflect about you're listening habits with high plains public radio in\nIn ... with the pledge of support so that next Saturday when you're going about your business you can tune into mountain stage and know that you are part\nOf the community that is bringing public radio to the high plains one eight hundred six seven eight seven four four four is the phone number for you to call to make a sound investment\nThis morning you know the process of of the high plains public radio is that H. P. P. R. seeks out programs that reflect\nThat the listening habits and and that the values of of our region and mountain stage it certainly\n... that reflect that the listening habits and and the the values of of our region and mountain stage it certainly one of those as well with the continuation of ... of folk and Americana and live performances\nAnd H. P. P. R. page for these programs have to be pure also writes out some pretty hefty checks to NPR so that that so that we can carry high plains morning ah pardon me we can carry all things considered and MORNING EDITION these these national syndicated programs\nThat are very very valuable in in or are steeped in information and events that are happening around the world and it's\nIt's ... opposed to next to these quality musical programs like mountain stage high plains public radio pays the bills and then comes to you\nKnow every so often a year and ask for your support so that this quality programming can continue across the region so as you're prepping for the storm tomorrow we ask that you do take take a moment and just step aside and go to that phone and call one eight hundred six seven eight seven four four four\nAnd invest in your public radio this morning that this how this service is able to continue into the future this is how that services been available for almost forty years on the high plains you can become part of that community this morning at one eight hundred six seven eight seven four four four and you know\nValerie this program is a public radio based program it's based in West Virginia they have a program down there they record it and they make it available to all public radio stations\nBut you're right it isn't cheap to be able to produce the type of music that's quality of music you've got to have extremely adapt to sound engineer is you've got to have the stage you've got to have all of the infrastructure\nBut high plains public radio found found the value in mountain stage an added that to our line up and my goodness I it is one of my favorite programs that we have across the entire listening\nA programming schedule on high plains public radio\nOr we of course just hurts him Jonah Osborne she did a deal in tribute album we've been playing that on high plains morning this is the kind of thing where we we play it but we don't get to hear her live version of it and you're those cracks in her voice and feel that we're right there with her and you get a front row seat when you tuned into mountain stage and uh I don't know about you but\nSaturday mornings we flip it on you get your breakfast you get to actually take some time in the morning and decompress figure out what you're going to do for your day get caught up on those chores and it's just really refreshing to have a soundtrack\nThat is a quite a variety I mean after Jonah or any of the mountain goats you know this this very new you know they do a lot of like kind of new folk it's almost like you know alternative folk and or was it with a name like the great king and the silver flame achievement off of there twenty Seventeen album gossips\nI mean it's just it's so different than what we had an Joan Osborne and they're they are side by side served up for us so that we get to have\nA variety of creativity in our space\nSo if this is something that you do every Saturday morning his tune into mountain stage\nGive us a call at eight hundred six seven eight seven four four four and tell us why tell us why it is that you enjoy this programming and supported support that programming 'cause it's all paid for with Valerie we pay West Virginia they're able to keep it going and that's why they've been on the air for so long\nUm you know and the mountain good they have a new album coming out now they decided they wanted to go back to doing eat peas and shorter things and it's got a really good name too it's called the hacks of the infinite binding I mean you gotta support titles like this\n[laughter] you know one of the things that I Love to do on Saturday morning says go for a swim I but I always have this internal struggle and if I go for a swim I'm not going to be able to listen to mountain stage so it is not uncommon me not uncommon for me to go and request a lifeguard\nAnd if I go for it swim I'm not going to be able to listen to mountain stage so it is not uncommon me got uncommon for me to go and request a lifeguard to [laughter] on high plains public radio because this is programming that that I value and maybe you find yourself to adjusting your Saturday morning routine to fit into the great programming that you rely on\nSo we hope that H. P. P. R. can rely on you within set pledging support right now like one eight hundred six seven eight seven four for for\nHis time to wrap up this special edition of mountain stage featuring performances on the show over the past year that are banned crew and staff thought were some of the best we hope you've enjoyed it and we hope you took the opportunity to call your station to show your support\nThis last it ends with rock and Roll Hall of famer poet and a true legend Patti Smith seniors only she co wrote with her late husband Fred sonic Smith reminds us where the true power in our great country always read\nThe set opens with James ... an abiding social commentary that he calls the state of the union I'm Larry Gross and I think mountain stage executive producer Adam Harris for being with me today\nAnd of course special thanks to you for listening we never forget that without you there would be no mountain stage and we hope you'll go out and here's some live music wherever you are just as soon as you can you been listening to a special edition of mountain stage live performance radio from the mountain state of West Virginia\n... brothers of fascist lives in ...\nFish is the ... it's\nWhole lot you know\nThese notes while we wait for\nHe don't like the Muslims they don't like the Jews\nDon't like the blacks and they don't trust the\nNews he hates the Hispanics and alternative views deal fill you up to the white\nMen there is a Christian she likes to go fishing she dome and my brother at all\nPut your own and redfish flounder and ... they share a Latin\nShe getting back to Dallas a sunburn sour\nWorn out from Lincoln was our after hours the spots when she closes or as in the shower\nShe don't stick in the middle\nOf the union again\nIt's always been the best\nAnd we're all in the family the Kirsten bless this is the state of the union or as\n... ... lady which occur at a golden corral\n... the yeast Rosen Bourbon Street chicken we know better but now\nTo me and my brother got into your child in the hips\nAnd ... and he's the dead oh was treated is Mexicans good I guess you'd think you'd better some\nUse the better cardigan sweater and snow like you know there was\nCardigan sweater snow like ... there was\n... to ... go way up there every day on the bus\nSister let out or the shit out and got worse Web the wisdom that rare that new Christian church where the girls on her neck in nine in her purse she might be the was the\nMiddle of the union or the\nChristmas dinner you know the play\nThe how 'bout those job or a blessed the the ... the year in the\nMiddle of the state or the union uh I guess\nWe're all in a number of them", "year": "2018", "show_name": "Mountain Stage", "city": "Dalhart", "day": "13"}