{"month": "10", "state": "WA", "station": "KWSU", "content": "The south and east Wenatchee before we going to go back to the news which we're going to do pretty soon but you have time to make your pledge to support it eight hundred eight four to eight nine nine one or it N. W. P. B. dot org I think that we can get to that thirty in the quake time that we have left to be the next one now one of the most\nPopular ways to support us to become a sustaining member but every single pledge that you can make in any amount is so helpful we really appreciate your support and think you are ready to everybody who is donated during super Thursday fund drive your support keeps us on the air\nThank you and we're going to the world right now\nNorth West public broadcasting K W su twelve fifty am pulling in Moscow also a Ninety three point three on the ... the one point three o'clock St Louis and and I don't care if a Ninety One point seven h._d. to digital radio northwest public broadcasting is a community service out of the added our morale College of communication at Washington state university [noise]\n\nABC new ways to Montgomery research that the Chinese economy it's going to have helped make healthy baby mine was to mother and father they use to substantial amount of genetic engineering to help producing offspring with things that parent hitching kind of like a\nStudy in the journal cell stem cell shows the DNA we inherit from each parents is subtly different I'm delicately balance\nHaving two parents from the same sex disrupts the balance and the baby kennel developed to the team that's precisely edit the DNA to make it possible the mice they created ... went on to have healthy pops a veteran\nSome experts think the study could in the very long time pave the way for same sex couples to make children together\nThe un miniature temporary grounded in time ... F ... fighter jets\nThey asked to find which uses down the technology to reduce it this ability to re dog it's the largest found most expensive weapons program at the time in the world a defense correspondent Jonathan markets were pulled\nThe temporary ground a newborn I suppose you find that cross pending the checks comes off the crush of a U.S Marine Corps 'cause you five feet in South Carolina last month depending cause was full ... huge huge crowd to be inspected and those were effective polls hunting limits\nThe mini being Bruce under control but the plane will be the centerpiece of us power for decades ahead\nClerics land for the most senior figure and orthodox Christianity have confirmed conditioned to ground independent to the church in Ukraine a move seen asking poets by Russia and\nThe decision by the ... to ... ... the Ukrainian church from the plane that Russian counterpart to an efficient anything cans\nUkraine's president Petro Poroshenko has been quick to hail this decision saying it consolidated the country's independence and designed to be integrated into Europe for several decades FBI official Russian Orthodox church has existed alongside breakaway Ukrainian trenches\nNow the main Ukrainian church which had previously being seen as a piece of them is that three recognized at its own distinct round trip also don't see\nRussia I counted manned missions to the international space station crime investigation that town into why the crew was selling things for for it to make an emergency landing minutes after liftoff\nThe decision means it's on like tens of the ... in both the station will be able to attend to us on Chenzhou in December the Russian ... than I can call me at that's being good condition\nAfternoon you're listening to the world on northwest public broadcasting thanks for joining us I'm Kerry Swanson and with me is Sandy billings and it's a pleasure to join\nYou on super Thursday to fall on drive you heard about it for a few weeks and now you're ready to be one of the new members that are going to make this one day find Dr successful I Know you are one ready contributed N. W. P. B. dot org and make one of the twenty pledges that will make this break successful N. W. P. B.\nDot or meeting that break goal is just another step toward a successful fund drive so called eight hundred eight four to eight nine nine one that's eight hundred eight four to eight nine nine one your contribution of Tanner or Fifteen dollars a month we'll take just a couple of minutes to do\nYeah donated at eight hundred eight four to eight nine nine one talked to a volunteer Susan Bruce Kelly Nancy Lindy they're all waiting for your call and twenty twenty of all you need to call right now so it's your turn to the amount that you want to give and how you want to pay it and talk tell that law\nNews that you depend on donated N. W. P. B. dot org you can search contribution to be an automatic deducted from a bank account a debit or credit card every month so that makes you a sustaining member and that's a real efficient way for you and for us\nYeah it's convenient for you and it provides ongoing support for the programs that you love to comment sustain her call eight hundred eight four to eight nine nine one or make the pledge directly yourself without even talking to anybody and W. P. B. dot org is where you can do that all by yourself\nAnd W. P. B. dot org or eight hundred eight four to eight nine nine one become a member\nNow twenty pledges we're looking for yours an W. P. B. dot org or eight hundred eight four to eight nine nine one from BBC News\nSupport for the world comes from legal zoom dot com offering a network of independent attorneys in tax professionals who can provide the advice needed to get through the daily grind of owning a business more as legal zoom dot com slash world\nI'm Carol hill and you're with the world a Saudi journalist is missing and presumed dead the details that are coming out about how Jamal ... may have died are both gruesome and something out of a novel\nA Saudi Government hit squad lying in wait inside the Saudi consulate in Istanbul the kingdom strongly denies the accusation but there's outrage around the world including in Washington\nWhere we're looking at it a very very seriously I don't like it at all\nThat's President Trump on Fox News this morning\nAt being very tough and we have investigators over there and we're working with turkey and frankly we're working with Saudi Arabia we want to find out what happened\nThe Turkish government disputes that us investigators are working with them and the question remains about just how tough Trump might be with the Saudis it's a key relationship for the U.S and follow us judges of the London School of economics says the consequences would be huge if relations become further strained\nWhat you have is on and I can either than who use the works for the land the business I'm proper prioritize money and resources or human rights it has made it very clear that this about the American relationship is very strategic what involved or hundreds of billions of dollars\nIs unwilling to break up relations with the crowd is that what you're going to see is a great push by the end I can pull all of the elite boat them\nIt comes to arms deal between the United states on how the eight yet and also probably vote in the U.S Senate against us support for the war in Yemen and overall and and the Saudis countrymen that permeates the automatic a critical and social establish\nA story is just kind of unbelievable I mean let's just say that you mentioned Congress and I mentioned Congress putting an enormous amount of pressure on President Trump\nWhat is so critical about this relationship to us Saudi relationship it just seems like this is true and unspeakable thing that's occurred that something has to happen\nKeep in mind that is the evidence is correct and it seems to be correct but at the Saudi authorities other kid not ... or killed them this is an act\nThat speaks volumes about the sound of the mindset that thing that the U.S president values\nMoney I'm often over human rights I'm the rule of law they're not really concerned about the response by the Trump Administration I mean even so far I think that either the American president Donald Trump has not acted a single negative would a single negative threat when\nFox News off Donald Trump about copying the arms deal with Saudi Arabia he said well we cannot do show what's involved a billions of dollars which are very crucial to the U.S economy but just to give your ... I mean listen as a kind of ...\nNot even nine eleven attacks\nWere able to solve one created any kind of Russia in how the U.S relations sound to us relations I'm not based on value whether you're talking about human rights or the rule of law the Trump optional and the relationship goes back\nTo the end of World War two and a relationship based on big business big money big arms deal I mean Saudi Arabia and producers up to ten million barrels of oil a day and you have a president who basically has turned business into a sacred effect is sacred to him\nThursday the one day find drive if you know the drill and you've been waiting to make your pledge don't wait anymore called eight hundred eight four to eight nine nine one and donate five or six dollars a month for any amount that's right for you\nAs successful fund drive means short drives continue on northwest public broadcasting so don't waste any time call now eight hundred eight four to eight nine nine one yeah joined Gregory in Vancouver and Patricia in\nBellingham Hi Patricia joined Robert in Port Angeles that's a very northwest if you're in Idaho let's hear from you now take up the car call eight hundred eight four to eight nine nine one er N. W. P. P. dot org where you can make your pledge\nThere's so many different ways to make a pledge ask your volunteer on the many ways ask about being a sustaining member that's convenient for you and really helps the station as well call eight hundred eight four to eight nine nine one or in W. P. B. dot org [noise]\n\nI'm Carol hill this is the world it's less than a month to limit terms and if it seems like the whole country is a ...\nCountries political agenda and Egypt Trump the whole world's watching\nAmong other things this election season seeing an unprecedented wave a female candidates and the trend expense to red states and less prominent offices the world's represent noise spent time with one candidate in Arizona where rapidly changing demographics have got both parties paying close attention\nI have never wanted to be a candidate\nJanuary ... swears she never wanted to be doing this shaking hands and raising money for a campaign\nEven though she says people urged her to run after she served as an advisor to Janet Napolitano Arizona's last democratic governor I think are many many ways to serve and it doesn't have to be as a candidate but last year with President Donald Trump in office\nAnd Republicans in control of Congress\nContrary says she felt powerless her son Noah remembers when he learned of his mom's plans to change\nThat we read a dinner table and\nThat that we talked this over and your mom's orange around to be the attorney general Arizona\nNo as a high school freshmen who still rubbing his eyes the Sunday Morning we're in a union hall after one country versus campaign\nOf as you remember what your first reaction was\nYour first question was what's attorney general that you're running for governor [laughter]\nWith me and get your number for older son Lucas is a high school juniors when it gets his first response was what are the commercials are going to say about\nYou he worried that political attack ads would target contrary for being Latino she's fourth generation Arizona and and pro immigrant right\nOn the way to another event a fundraiser in a gated community contrary says that was a powerful moment for her one son asking about the risks people face when running for office the other asking why she wasn't taking a bigger risk for a more prominent position\nThere are a lot of people who\nDon't know what the attorney general does but after\nServing in the Obama administration and creating a nonprofit that provides free legal services contrary us as attorney general may help decide things like whether Arizona will try to repeal the Affordable CARE Act or Obamacare\nShe wants to keep it the Republican incumbent mark bird of it doesn't and had Arizona joined other states that argued the Affordable CARE Act is unconstitutional controllers also supports DACA a program that offers some undocumented immigrants relief from deportation\nTo interview requests but just as him on Fox News in March\nI I'm a first generation American white families fled communism in Eastern Europe and the fundamental principle bought the rule of law is the federal government should not be telling Arizona who they can or can't use your driver's license to\nArizona's third let the you know with some of the strongest pro immigrant groups in the country Democrats hope that with Latino candidates like ... and David Garcia for governor more Latinos will vote\nAnd ... says she hopes that Latino see in her someone like them someone they can trust but she also knows that Latinos in Arizona don't see themselves as a single group\nWe don't always\nSee issues\nBut we certainly can see when others are trying to constantly\nMake issues about ethnicity from the other side\nIs I think something that we will stand up for it and reject because I think it's clear to a lot of people including Latino that\nThere are people in power right now who want to treat\nThe second class citizens\nThat may have helped spur a record turnout in the primaries last month with a big showing by democratic voters are loose drivers confirmed it will be one of them in next month's election\nAnd contrary confident as she had been to her fundraiser\nI think the rest of the country to watch Arizona and watch a wake up in\nArizona is a state going through big changes this'll be the first election after Republican Senator John McCain passed away\nSenator Jeff flake seat is also open he was openly critical of Trump and won't run again your support another longtime Arizona figure former Sheriff Joe Arpaio was in the running for ... seat she's well known for being tough on undocumented immigrants\nMany people fear going to\nPut our pile was knocked out in the primary Republican strategist Constantine card acknowledges that Republicans are vulnerable with some promises unfulfilled\nThey have not yet don't belong man not yet you know gotten rid of Obamacare and so you have a certain amount of frustration within one party's base and a great deal of energy in the opposition parties base and that's what can make these midterms are challenged\nBut ... says Republicans are entrenched in Arizona and they brought more resources into the states\nPlans for an expanded border wall or popular among GOP voters here including let the you know\nYou know the idea of the Latino beeping this monolithic boat that moves in a single direction really isn't true the highest ranking Hispanics Latinos in in Arizona the last several years have all been Republican and a lot of Hispanics in Arizona who are here legally\nTend to be some of the strongest advocates for border security so they don't respond to that knee jerk reaction that if you're secure borders that means you don't like brown people\nSo crowd scoffs at the idea that Latino candidates contrary to drawing up new voters for Democrats to win\nThis is a Republican state there's going to get crushed\nWalking I can persist fundraiser prescribe doesn't people\nControl the questions about mass incarceration children in foster care and immigrant families in detention contrasts responds that her role as state attorney general is limited but she'll do what you can and joined other attorneys general in their fight against the Trump Administration I think the bottom\nRunning for attorney general this is one line on your ballot but people in Arizona right now are choosing what version of Arizona they believe in\nIt will be in Arizona where we come together where we are fighting for one another or they're going to be in Arizona that adopted us versus them for a longer period of time [noise]\nSome\nPolls show the Arizona attorney general race as tight others give the Republican candidate a clear at if controllers wins she'll be the first Latina to hold the position if she loses she says she'll do what she's always done find other ways to search\nFor the world ... in Tucson, Arizona [noise]\n\n\nTheir last story on the world was brought to you\nThe world and all the programs that you value just make a pledge in any amounts and donate now at N. W. P. B. dot org that N. W. P. B. dot org\nGood afternoon I'm Kerry Swanson and joining me is Sandy billings and this is super Thursday the fall fund drive where we try to condense a whole fund drive into just one single day but we still need to raise as much money as we can to pay for the programs that you value\nSo today it's all about raising money to pay for those programs that you enjoy\nAnd giving is very easy just call eight hundred eight four to eight nine nine one and be one of twenty members who donate during this break right now eight hundred a quarter to eight nine nine one\nA legislation for protecting intellectual property\nBut over this period the legislation has improved\nQuite markedly now enforcement has remained a challenge but even enforcement is improving the big exception is in trade secrets for our companies that remains probably the biggest area\nOf ... intellectual property that is difficult to protect why\nBecause there isn't a proper legislation on this and uh I Know that the Chinese are working on it and the U.S or over the years have worked with the Chinese in capacity building\nIn other areas of I. P. and this one seems to be like the last frontier um but uh but we're all working on it still\nIs threats that comes with trade secrets theft isn't a security threat an economic one or both well\nI Would say uh in in the case that we are reading about this alleged the ministry of security person it's it's both um in most of the cases in which I was involved it was really most economic your technology\nHas been stolen and products like yours are being produced um and so your market share will shrink\nPresident Trump's been really vocal about China stealing us intellectual property and presumably this has been happening for a while I weigh before Trump ... is the problem getting worse or is it just the President Trump has decided to be more vocal about it than previous presidents\nI don't see that the problem is getting worse [noise]\nUh and in some ways I think this trade friction that we're we're now in the middle of the [noise] um I think that the real crux of this issue is reciprocal treatment\nA yes IP violations have been going on for a long time and the U.S has talked with China for years about that\nThis grand bargain with China for a long time in which\nWe knew these things were going on and we would talk with the Chinese about it and yet we wouldn't apply to leverage because we were also benefitting from the relationship we were getting less expensive goods consumers were happy companies were making money even political leaders\nTheir voters were getting a less expensive product and stretching dollars\nAnd it just came to a tipping point and and so now we're applying pressure uh so I think the approach or that we're taking we have to the U.S that is has to\nCome with the idea that OK you've been doing these things but we have been more or less complicit because we really didn't apply pressure until very recently\nWilliam Zarit is chairman of the nonprofit American Chamber of commerce in China he's been speaking to us from Beijing thanks so much thank you\nMore now on the strained business relationships between Chinese companies and the U.S only this story is mostly about the effect of tariffs on American workers\nA few years ago Massachusetts wanted to make a big order for new subway cars for the Boston area but there was one stipulation they had to be made in Massachusetts enter the Chinese runaway rolling stock corporation or see our our seat the company won the contract to build a factory about a hundred miles from Boston\nWell that was before the new trade war between the U.S and China under President Trump\nNow the future of the factory and it's a well paid workers is in doubt Adam Reilly from our partners here at W. GBH in Boston has the story\nWhen you pull off to the CRC plants in Springfield, Massachusetts the first thing you notice is the size two hundred thousand square feet sprawled over once vacant\nStuff inside and you see just a fraction of that space is currently a news though the activity there is intense\nRight now see our our ... workers are building six cars for Boston transit system\nBy twenty twenty there'll be sending eight new cars per month eventually delivering more than four hundred that's good news for riders to shabby decks even better news for workers like Eric Anderson I was a cook\nBetter cook for about seven years then CRC a massive state owned Chinese companies to open this facility Springfield size\nAnderson got assembly job significant pay probably double with a benefit\nBeat mechanical assembled perfectly honest them more than anything out of the water there currently that I'm aware of\nEspecially in this field\nThe coming years should bring more solid blue collar jobs like theirs to Springfield CRC built subway cars not just for Boston but also for Philadelphia and LA but now there's a hitch significant uncertainty linked to President Trump's escalating trade war with China\nSo far the new ... new policy has\nOn our manufacturing and also on the hours in the\nJob of who spoke with us to interpret her just a vice president of see our our seems Massachusetts operation\nShe says some of the perceived here are imported from China the Trump administration's\nTariff to ... million new cost there's also bipartisan interest in banning CRC from bidding on federal projects and even talk of labeling the company a national security threat\nCritics say CRC under bids to gain market dominance and the technology on its vehicles could be used for surveillance but shot instead the company\nIs a force for good hot ...\nYards at that point here in the United states\nHave a long time following planning and we're only framed for taxpayers here set aside from twenty twenty wise that job creation will plead from there if there is no additional new authors coming on board regarding to the new ... new restrictions on the company\nWhich is why politicians like Springfield mayor Dominic turnover in democratic congressman Richard Neal want the Trump Administration\nTo reconsider also hoping to president shift course ... ...\nYou know this day and age in Springfield we need the manufacturing we haven't had manufacturing here in the years\n... is the business for sheet metal workers local sixty three and she's real by the RCs embrace union labor\nThere's over a hundred and twenty union workers are you from Springfield American but now he says Trump's approach is jeopardizing that you're going to possibly put them out of work if they can't get contracts\nThey can't you know maintain his building and I do believe he wants to put people to work but yet I don't think he realizes the impact of what he's doing over here\nAgain the are RC now plans to circumvent Trump's terrorists by shifting production of certain parts for chime in to the u._s. which could mean more new jobs not last and convince the president's supporters he knows exactly\nAnother look at trade tomorrow only this story will be all about North America dairy farmers and President Trump Canada\nWhat they've done is ordinary workers [noise]\nTrump made good on his promise to replace NAFTA by drafting a new trade agreement with Mexico and Canada and the focus was on selling more U.S dairy products in Canada so tomorrow in the world we talk with a Canadian dairy farmer about how the new trade deals looks from up north\nYou said we were hurting their dairy farmers will Americans had a six hundred six hundred million dollar surplus with us but she got in just head that we were mistreating their farmers\nTurns out the big problem for America's dairy farmers is not Canadian tariffs our reporter learns about the real threat to American dairy industry that is right here tomorrow\n[noise]\nGood afternoon you're listening to the world on northwest public broadcasting\nThis afternoon I'm Kerry Swanson and with me is Sandy ... super Thursday to falsify drive and it's time for you to support the program that you depend on hearing everyday joined all those from Walla Walla it people of all the while I've been\nVery very busy supporting the station now it's your turn donated N. W. P. P. dot org be the next person to donate and we're looking for twenty pledges this break whether you're\nLiving in Wenatchee Shelton Olympia Bellingham help move this pledge drive one pledge closer to successful conclusion with your gift of five or ten dollars a month call one eight hundred eight four to eight nine nine one\nYou pledge just takes three or four minutes at most volunteers in the studio we'll get to contact information ask the amount of your pledge and how you want to pay it you make the decisions and there's lots of ways to do it\nYou've maybe been listening for a long time or maybe you're just discovered us but you haven't made your pledge yet on now is a good day to do it in fact\nToday would be the best way to do it one eight hundred eight four to eight nine nine one it's super simple it only takes a couple of minutes where you can do it on line at N. W. P. B. dot org but we will thank you", "year": "2018", "show_name": "PRI's The World", "city": "Pullman", "day": "11"}