{"month": "10", "state": "FL", "station": "WJCT", "content": "\nWell\nWell [noise]\n\nW. B. river ... due to the bill was first each district to explore the musical legacy people sit\nBut this approach was exciting in British not just with the listeners but for him all I Love\nThe music and I'm trying to\n... ... I've just been lucky that there's people that are sort of well willing to sort of watch me trying to figure it out because I'm just in the process of trying to learn about it myself\n... amazing ... kaleidoscope every\nBit of information just\nLegion ... Everytime bill picks up the guitar he says it's kind of like when he taught himself to play house with the ... and it was a teenager back and do it\nReally doesn't feel that much different from the very first time I picked up a guitar you know first time I picked it up it's like\nTell how old is your\n\nJust what do I do not wish this down okay well that worked in the Gulf Coast that down\nWhole but that's the way it feels today still\nHave learned something by now but\nIt always feels like\n... what the head ... ... ...\n... ... ... that's ...\n\nLet's go out with this final version of the house of the rising sun\nWell\nWell ...\n...\n... ...\n...\n... ... ...\n\n...\n\n\n\n\n... ... ... ... ... ...\n... ... ...\n\nA\nMm Mm Mm\nA\nOr\nA a a\n\nA oh\nA\n\n\nJazz man in America is a production of WB geo Jackson Lincoln Center and NPR News\nThis week's music was recorded mix by Rob ...\nAnd the episode was written and produced by Josie holds\nThe show's editor as ... car\nOur senior producer is Katie Simon\nAnd our executive producers are Amy Niles Gabrielle arm\nAre Christian McBride joined us next week for another jams made in America\nA\nReporter for jazz like in America comes from the wind ... foundation the argument on the door at Duke charitable foundation supporting the performing arts the environment medical research and child wellbeing\nThe national endowment for the artwork\nThe Robert Sterling Clark foundation to sustain NPR's coverage of Latin American cultural programming on all Latino and the Gilchrist foundation in support of NPR's commitment to coverage of the art\nThis is NPR\nOh hi I'm dean ... joined me for taste tests tantalize your musical fences with the new elections in urban pop culture have take every Sunday night right here on eighty nine\nOn the next radiolab how many people do which they killed by the police each year we don't know no one keeps accurate statistics on police shooting that then the next radiolab Sunday at noon on eighty nine\nIn age Steve from palm coast to the golden ... this is eighty nine W. J. C. T. F. M. Jacksonville listen anywhere on your computer or mobile device at W. J. C. T. dot ...\nWelcome to W. J. C. T. Dallas\nBeyond you\n\n[noise]\n\n\n\n\n\n\nI'm\nYo ...\n[noise]\nIt's common\n\nOh\nOh oh\n\nOh\n\n\nOh\n\nLa\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise]\nAll the things that make people\nTend to\nStick to the states\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\nOoh [noise]\nOn the road or a town she now to be too now going in eighty nine nine Tuesday Saturday Night\n... ... ... ...\n... ...\n\n\n\n\n\nIn the shadow of the contention confirmation process the Supreme Court started its new term a look at some of the contested cases coming up and Brazilians head to the polls to pick their next president the front runner a highly controversial right wing ideologue who had divided Latin America's biggest democracy Sunday on weekend edition\nSunday Morning at eight on eighty nine nine W. J. T. T.\n\nThe Proud Boys think feminism went too far and it's bad for men and women\nThe feminist mentality boats very well for guys who just want to screw women and then dumped them when they become thirty five I think women had their head screwed up properly they realize that it's your so called sexist have their best interest in like\nThe new male chauvinist him next time onto the best of our knowledge from ... are a Sunday at three PM on eighty nine nine W. J. C. T.\n\n\n\n\n\nWho\n[noise] who was going to be\nIn the\n\n\n\nLot of people\nWho [noise]\nWho [noise]\nBlue\nBlue but [noise]\n\n\nOoh or\nOr go\nLou\nLou\nWho do [noise]\n\nOr\nOr\n\n\nThis is Ira Glass this American Life and I'm coming to Jacksonville even talk that costs seven things I've learned is basically just an excuse to tell a bunch of stories like videos and I'm Talking about how we make a radio show and talk about stuff we have not been on the air and never will put in the air\nJust place at the same I Will be fun to play for a crowd it's Saturday November temp at Florida Theater sponsored by community first credit union\nTickets at Florida Theater dot com Marta theater done um\nHi I'm Kevin Driscoll host the ISI pee on radio we bring your insights tips tricks and habits from the city is leading artist influences pacemakers entrepreneurs Saturday that eleven PM right here on eighty nine nine W. J. C. T.\n\nBroadcasting from Florida's palm coast to Georgia and the golden eye ... eighty nine nine W. J. C. P. F. M. Jacksonville\nWas an anywhere on line at W. J. C. P. dot org [noise] [noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\nI ...\nThe show the whole\n\nDay\nIn my\nMom I feel much\nIn line you know what I'm saying I\nLive day\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\nThe [noise]\n\n\n\n\n\n\n\n\n\n\nMm Mm\nRead they\n\nMany places in downtown Jacksonville being considered for demolition or we develop that have had their history last\nHow can we bring you stories back to life while determining a future forty ... W. J. C. T. a partnership with modern city to present the Jackson forgotten space Tuesday October twenty third at W. J. C. P. studios the evening begins with a reception that six followed by a panel discussion at six thirty artists BP with is free of that at W.\nJ. P. T. dot org slash about sponsored in part by downtown investment authority\nOn the ... well a lot of money the United states of America had a pool of cheddar cheese we visit those genes caved in Kansas and explore how the U.S government tried to help American farmers in the Nineteen seventies by raising the price of milk and how I built this on the beach the ladder\nTook high end designers gave the low end price it's an hour of economics and innovation on a lot of money\nAnd how I built that permit yard", "show_name": "Electro Lounge", "year": "2018", "city": "Jacksonville", "day": "07"}