{"month": "10", "state": "FL", "station": "WJCT", "content": "I'm fresh air you'll hear conversations that you won't hear anywhere around you understand law\nWell I understand caring see most of my relationships are more into law and to me love is\nCaring posing questions to fascinating people at Temple Grandin and giving time to answer and fresh on\nWeekdays at noon on eighty nine nine W. J. C. T. your community your [noise] [noise]\nHi I'm mayor Lenny Curry you know six three oh city gets the familiar place you go when you need to know during severe weather conditions are six three oh city call center operates around the clock equipping citizens with information\nThey may need to make decisions and resolve issues the short at their number six three oh city to your favorites and remember to pick up a two thousand Eighteen\nHurricane preparedness guy from your neighborhood public\nLibrary be jacks ready [noise]\n[noise] well finally this hour it's called the void on vinyl eleven tracks from local musicians all pressed on a classic vinyl record and you can get your copy along with void lives arts and music issue both around now ... is the editor in chief avoid magazine good morning\nThanks for having me Melissa ... yeah good to have you okay so you brought a vinyl record with you for us to look at and yeah I still remember these are amusing director David Letterman has hundreds of them in his office\nAnd yeah I'd I hooked up with a copy you said he's gonna try to get it on your um Tuesday a virus ... out there yeah that's right about that\nOkay so this is a vinyl record with local artist how did you guys come up with this idea\nI'm so back in may a we start inviting a local artists into our office um\nAnd we're recording three songs sets of 'em then performing just in our office space and we had gone to indict from a really cool local band called boy toy she recorded a music for us mixed everything so it's a really good quality sound\nUm but also in like it's got an authenticity to it because it's in our space um and then we had a local videographer John ... who um just filmed a simple to cameras shoot and we'd been putting those videos up on her YouTube channel or watch void\nUm if you want to check them out will join slowly releasing on but we have like twelve or Thirteen and they can all local music but so as we were doing those we were just so impressed by the diversity in the depths of um\nUm the local talent here so we it was kind of just like a blue sky thing like we should make a record we hooked up with a vinyl record pressing which has in Atlantic beach\nAnd talk to them about the idea we got a couple of sponsors to help us out with it and I'm so here it is we're here it is ... that must have been fun to do really fun yeah we had a great time doing it and just um you know it's eleven tracks but we're we're hoping to do it annually now so we can just keep companies are 'cause\nAs we dove into it just the depth of as I said the depth of I'm really good\nAuthentic quality music being made in Jacksonville right now is is it's just impressive yeah\nIt's true now when people pick up their their vinyl records they've got to play it on a record player and I I think there's probably still a lot of people out there that have saved their turntable\nYeah and there's a whole movement right now just the last five to ten years a lot of people have been going back to um you know getting a turntable because ah not only that listening experience I'm Better the sound quality better if you have the right equipment ... um but\nWarmer and he's like ... full or\nThe other hand more um there's more data on a vinyl record that when you listen to a digital music files it's compressed and I'm just you just don't get everything that was you're supposed to be listening to 'em but also just like the physical I'm\nJust having the record cover and you know you get a whole piece of art and you get at the way that the artist envisioned it too and you get to have it and hold it and look at it and liner notes and all those fun things and they're\n... so people can go to your magazine or your website rather to pick up a to order their copier avoid on final and they need to pick up the new issue of wired magazine as well\nWe've got our arts and music is you out right now I'm ... I'm a arts and music stuff\nPutting a lot of stuff about some of the bands that I'm an artist that are featured on the record as well and they're\nSo you've been the editor boy now for wetter about a year or six months\nNot even a year or so in the magazine has taken off all so much in recent years it's just really captured not just the surf culture but uh other kind of sub cultures around the first coast yeah tell me a little bit more about your focus with the magazine\nUm well I think I really I I came back to ... about four years ago and I live in San Francisco for six or seven years and I'm just when I came back I really saw a city that um was really growing and had a lot of positive things to offer people in my\nAge group um but really kind of lacking I'm an identity that people kind of could could lock on a walk into\nAnd I think I'm Boyd magazine has has done a great job of creating\nA connection with a younger like ... the millennial generation here and so it was kind of um ... I was really interested in in trying to work with them and seeing how we could um can act\nUm all the cool things that are happening in the city with an audience those kind of hungry for that so I've been really happy to to be there it's been a great experience so far and we're having fun putting the vaccine out every month\nDefinitely in putting reckoning betting record that next t._v. shows you who knows um but go to avoid live dot com and it's a boy by dot com slash vinyl to get your final\nRound yeah you can check it out there you can also come by the office in uh on sixth avenue northeast inject speech and um and you could pick it up there as well\nExcellent Matt shy editor avoid always good to see thanks for the music\nYup Thanks so much Melissa that's our show thanks to all of our guests and callers are director is Michel ...\n[noise] to show theme is composed and performed by the Jacksonville Stephanie's ... check check and if you missed anything from today's show\nCatcher rebroadcast tonight at eight o'clock\nWhen a is up next time Melissa Ross and this is eighty nine nine we'll be right back you're going to nine AM tomorrow have a great day\n\n\n\n\nWho\n\n\nSupport for first coast connect is provided by Baptist Health and the north Florida TBO\n... magazine focusing on the arts business in culture then hence the quality of life and our community September October issue is arby's has twenty fifth anniversary and features the annual for our calendar orbits magazine in depth in touch artist dot com\nThe Jacksonville Symphony led by Matthew holes takes you through a program that spans the Eighteen Nineteen twenty first century the symphony brings you to works by genes Bach and Mendelssohn symphony number five October Nineteen twenty and twenty first information at jak symphony Donald\nCarty overnight low around Seventy three scattered showers and thunder storms Thursday hike in the upper seventies eighties eighty nine nine ... J. C. T. Jackson down your community your world\nWhere come to ... dollars\n... ...\nAnd\n[noise] good evening and walk into the electrolytes Troy Wednesday night we're going to go kind of Americana and roots tonight let's get started with the woman brothers would stormy Monday blues got some Aretha bb king checked will is Fleetwood Mac called blood\nLocals and hot tuna Janice Joplin banned all the great music that we kind of grew up quit so flashback tonight with is on the electrodes to some great American music\nIt's next to the electorate loud Joanne eighty nine nine W. J. C team that you can always send your comments and request to music at W. J. C. T. dot O. R. G.\nPeople who knew he\n\nOh\nNo\n\nKnow\n\n\nOh\n[noise]\n\n\n\n\n\nReally no\nNo no way you get\nThe thrill of\nThe three or ...\nYou know you know the time and you know some\nDay in\nLow\n\n\n\nYou know\nWhat do you like a ball game on ... or ...\nYou know like all ...\nYour dog gone moderate jak\nThe boy\nWe will\n\nNot go along\nThe way\nAlthough they did a good one and a name [noise]\n\nJohn\nAnd then one thing [noise]\nYeah John John Locke thing that\nWould\nLove\nDo\nThen and then in\nDay\nAnd they started\n\n\n\n[laughter] [noise]\n\n\n[noise]\nHe [noise]\n\nIn in in in\nThe\nNavy and the and the\nNa\nNa na na na\n\nNa na na na\nNa [laughter]\n[noise]\n[noise]\n[laughter] [noise]\n[laughter]\n[noise]\n\n[noise]\nWell\nYou're not no no\nNo no\n\nMatter how much\nI Love\nI\nA letter that\n\nNo no\nNo\nNo\n\nNo my new la\nLa la\n\nNo\n\n\n\nAnd\nThere are no no\nNo\nAway about a robot\n\n[noise]\n\n\n\nNo no no no no no\n\nMy guess your shame on my\nGrain Roman Gen twenty nine ... region but boy operating locally sourced crop Roman soggy under full contact bar open for lunch and dinner Tuesday through Sunday an offering Jake out and deliberate more information on clay Rahman dot com\nAnd and and on\nAnd\n\n\nNa\nWho who\nHad been that\nHad the\nReally knew\nAnd\n\n\nCloudy overnight low around Seventy three scattered showers in ... storms Thursday hike in the upper seventies disease eighty nine nine ... J. C. T. Jacksonville your community your world\nLooking back to the electric allows this hour we got some great music coming up first soup with the Nikola county ... Tokyo\nFollowed by the bell jar Kelly or we're just my imagination a nice rewind version of the temptation so we got to write Charles Milt Jackson together some ... some ... some ... say sure made even some sublime so stick around the star was full of great music\n\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\nI'm\nHoping\n\n\n\n\nLa\n\n\n\nLa la la\n\n\n\n\n\n\nAnd skiing and then when she\n... gin and then based in\nWhere are\nThe things you you know you can ... all\nThen you'll see it and he sees them\nJust just now where you'll\n[noise]\n[noise]\n...\n\n\nThem when you go then me and keeps you win but we're\nWalking on and\nDo the illusion na\nNa na na\nNa when some\nEagle them\nIll and you\nHole\nThe long haul\n\n\n[noise]\n[noise]\n[noise]\n[noise] [laughter] [noise]\nCollector allows playing ball go would get back the serenity more music and just sixty seconds don't go anywhere\n...\n...\n\n\n\n\n\n\n\nThe oil weekly best objects results are in and will be announced into Wednesday November seventh issue for oil and bites readers of influence to the best objects victory party friday November night at the glass factory details at polio weekly dot com\nThe last time the unemployment rate was this low America looked and sounded very different\nUm only man on the plane and\nSome states have serious labor shortages when jobs that are not getting bill today's boy in the economy needs a lot more than Peter Paul and Mary to stay afloat white good health is getting harder to mind next time on one at a weekdays at eleven on eighty nine nine W. J. C. T. ne ne yeah yeah\nI Am Andrew wicklund hosta blues arise in the best in classic and modern blue is now on twice a week and the blues arise on\nMonday and Wednesday nights at all I'm right here on eighty nine nine dumb Moon Jae in your community your world", "show_name": "Electro Lounge", "year": "2018", "city": "Jacksonville", "day": "18"}