{"month": "10", "state": "FL", "station": "WJCT", "content": "And the next fresh air Michael Lewis author of the best selling books the big short on money ball has about his new book this risk it looks at the federal government under President Trump\nThat focusing on Trump's departments with the energy agriculture and commerce I'm how unprepared they are now to deal with or can't risk join our weekdays at noon on eighty nine nine W. J. C. T.\nYour community your world\nAfter a sexual assault what the way forward with dogs have justice sessions allow the divide that to be in the ... the [noise] and so it's up to them whether they became not or whether they want to just met a guy a restored and justice approach to healing after sexual assault that next time on the take away from WNYC NPR I\nWeekdays it to one eighty nine nine W. J. C team\n[noise] well come back well finally this hour it wasn't very pretty but the jaguars didn't get a fairly easy when at home Sunday over the New York jets [noise]\n\n\nPeppers here now and go to Jack up to their best started over a decade this year the\nFirst time they've been three in one since two thousand seven wow that was a playoff season you may recall a easy win over the jets by and large the thirty one to twelve that this was not\nThe most satisfying thirty one to twelve victory you've ever seen for a number of reasons other were some very good things for sure yesterday oblique Wardle set a career high with three hundred eighty passing yards he was razor sharp especially early completed his first eleven passes\nAnd the owners twelve there was an incomplete pass made a great decision he was under pressure through the all the way a Andrew instead of losing twelve or fourteen yours on a sec\nOr they went back to the second in ten they wanted to first down and go on just were touched down on that drive so very good play there and a very good day for ... two receivers had a hundred yards receding Didi Westbrook nine catches for a hundred and thirty ... democracy five cases ... hundred nine\nIncluding a sixty Seventy yard touchdown both career days with the jaguars for those two players and the ... just a hundred Seventy eight yard so all around you start talking about he said well that's pretty pretty dominated the usual you like to see that\nOn the other side there were some things are really sticking in the ... craw after the game three turnovers\nNine penalties radio nine yards or injuries as well Leonard ... and Brandon Linder both left the game with injuries for net returning for the first time since he dreams hamstring in the opener now looks like he's going to probably be again on the foreign ... watch for the next several weeks\nAnd as I mentioned ... after the game not particularly impressed with ah what was a fairly dominant when\nObviously it's been a whim and all of a show called Austin finished a quarter which was our goal of three and one or able to do that obviously we had a penalty is mia turnovers um those are the things I told him that if we keep continue to play like that that's going to get us in trouble or we weren't able to come back and win a game\nI think what this tells us is that the expectations\nNot only externally but internally are very very high for the jaguars when you win the game by you know my my Nineteen point dinner never really threatened a and you're unhappy about it like this is not a few years ago\nAnd Nineteen point when we maybe three we would've had a parade down based right um now have it's not just about the point it's about how the team played and he's right\nWhen they start playing better competition competition better than the jets or things like being mind history and the turnover margin and committing almost a hundred yards with the penalties can cost you a game and that could happen\nThis week because they have a very tough test against of right now undefeated Kansas City chiefs play tonight\nI guess the Broncos on Monday Night football but they have to go to Kansas City arrowhead stadium which is one of the most difficult places to play traditionally the national football league at such a just a loud crowd or the sea of red and by the way the chiefs are really good they're often just fantastic just going to be a classic office of gives defense\nGotta match up this will be a real major reached a game for the job now that's your\nNeck of the woods eager up out there you go into this game I Am indeed a editor exciting for you I'm excited\nThe first time I will have gone to a game at ... stadium a since a night\nNinety five\nNinety probably January Ninety six and in the in the postseason um so uh I'm looking forward\nTo you Dan and pre game barbecue had and they used to be a whole pepper cute yeah that makes sense okay let's talk college football all local teams they all one over the last weekend\nGators several to bulldoze all having good Saturdays Florida when it second straight on the road at Mississippi State they're not foreign one on the seat and I think\nWe're seeing a gamble and make a real difference in the gators program it too early to start proclaiming good higher bad higher with these new coaches probably civil will do it any way or the gamble and it's been a terrific guy or for the gators and as he continues to build that program and be able to recruit players who sued the kind of\nA game he wants to play I think Florida is gonna be right back in the national picture before too long a this year I don't think they're ready to compete on the national stage but I Do think they can\nCompete to be you know second in the SEC east Georgia just chew good I think they're going to Wendy's going away\nUh either such thing as an unimpressive twenty six point when that's what the bulldogs turned in beating Tennessee Georgia rolled up two hundred and fifty yards rushing and we're never truly threatened but it wasn't the runaway that many expected the dogs and into the game is thirty two point favorite\nUh and still right number two in the nation behind only Alabama Florida State earning an ACC went on the road at Louisville it all came from behind a win\nBiggest one of the season for Florida State finally a little bit of energy and it looks like willy tiger to end that coaching staff starting to figure out how to best use their players always a big challenge for a first year coach is really understanding how player responds under pressure in a game situation they're starting to figure that out uh\nWe'll see though again talking about measuring stick games they have one on Saturday ah down in South Florida against Miami the EPA to Miami game always a a classic\nRock yeah sure and in the meantime hats I have a good trip to the heartland and we'll look forward to seeing you next Monday thanks ... and ... Twitter at coal pepper that's our show thanks\nTo all of our guests and callers our producer is Kevin ... Michelle ... board are shutting composed and performed by the Jackson ... check check one age that next and if you missed anything this morning make sure to catch a rebroadcast tonight at eight o'clock I'm Melissa Ross\nSays eighty nine nine we'll be right back here again at nine AM tomorrow had a great day [noise]\n\n\n\nWho\n\n\nSupport first first coast connect he's provided by Baptist Health and the north Florida\nTBO citizens property insurance whether recovering from Irma were preparing citizens is available claims can be tracked as citizens F. L. A. dot com or report it twenty four seven by calling alive citizens representative\nHigh a major wicklund hosta blues arise in the best in classic and modern blues is now on twice a week and blues horizon Monday and Wednesday nights at eleven right here on eighty nine nine dumb move your community your world\n\nYou're listening to eighty nine nine ... Jackson down your community your world bring continues helping I look for a low Seventy five partly cloudy Tuesday scattered showers and storms hiking to upper eighties American ... CPR Tyler's\n...\nAnd\n[noise]\n\n\nBang\nMain job\n\n\n... ... ... ... ... ... ...\nWill\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\nOh\n\nLa\n\nLeave the\n\nMe\nI mean\n\nAm a\n... and you're listening to the election now ... ... Eighteen pre nine in Jacksonville, Florida sending notes to the\nWe had no\nOnly people who may have\nBeen calling me\nAll the\n\nNo one can\nAnd\nThree dollars that's\n\n\nShow\nIs\n\nDistrict metal bother\nCalm [laughter]\n\nYour\nMom\nOn the next fresh air Michael Lewis author of the best selling book the big short and Moneyball has about his new book the risk it looks at the federal government under President Trump\nIs focusing on Trump's department of energy agriculture and commerce and how unprepared they are now to deal with the urgent risks joiner weekdays at noon on eighty nine nine W. J. C. T.\nYour community your world\nAbove the museum of scientists just to be present an audio visual experience\nJoined us on October sixth and seventh for world renowned ... Russian any special guest Jamie ... they performed the Brian good in an attorney custom animation the graphics\nCreated by ... Williams junior adjusted\nThe more information about the curious dog or\nCurious means you're smart [noise]\nSaid I did that [laughter]\n\nAnd I said it's not\nAs soon as she\nShe\nIn\nDay\n\n\nThen\n\nThey\n[laughter]\n\n\n\n\n\n\n\nOoh\nOoh\nOoh ooh\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nOoh\n\nOoh\n\nThe M A concert association presents Chris Thomas banned in concert on Saturday October six seven thirty PM in the Lewis auditorium song and dance man crystal this has been playing with various bands in Florida for Fifteen Years tickets available at Emma concerts dot com\nWG ACTs jaguars season parking is still available\nThe part of the coolest tailgating downtown\nIncludes have space\nAn indoor bathroom access contact Holly manual\nThree five eight six three one more\nOr log on to W. J. C. T. dot org slash barking\nReserves your space today [noise]\n\nYou're listening to eighty nine nine W. J. C. D. Jacksonville your community your world rain continues overnight look for a low Seventy five partly cloudy Tuesday were scattered showers and under storms hike in the mid to upper eighties [noise]\nShould we pay\nFor incoming Electra learned from eight to nine point nine exam that will you take the tea Jacksonville snowy\n\n\n\n\n\nNo\nNo\nNo don't worry\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\nBack\nWho\nWho\n\n\n\nIn the\n\n\nDa da da\n\nDe\n\nThe the\n\n\n\nThe [noise]\n\n\n\n\n\n\n\n\n[noise]\nThe\n\n\n[noise]\nBe like me being\nMinute [noise] right right [noise]\n[noise]\nAnd\nI\n\n\n\n\n\n\n\n\n\n\nFully a weekly presents the best object readers bowl and this year every boat is an entry into our sweepstakes they're over five hundred categories starting September nineteenth continuing dropped over twelve voting is open for a local celebrities attractions and merchant more fully a weekly dot com\nPresident Trump's celebrates a new free trade deal with Mexico and Canada we don't take it as a privilege is a privilege for them to do business with us and I'm not joking about Mexico I'm joking about everybody everybody but what does that mean trade wars continue how trade may be changing\nOr the next MORNING EDITION from NPR News ... starting at five or eighty nine nine W. J. C. T. your community your world\nHi I'm Andrew what's going to lose ride them the best in classic a modern loses Ellen twice a week and the blues arise on Monday and Wednesday nights it All right here on eighty nine nine W. J. searching your community your world", "year": "2018", "show_name": "Electro Lounge", "city": "Jacksonville", "day": "02"}