{"month": "10", "state": "FL", "station": "WJCT", "content": "That big brains they talk and they've been up to space in back I'm Ira Flatow on science friday primatologist the neatest stone because the chatter of our tree dwelling cousins the squirrel monkey [noise]\nAnd yes she is fluent in squirrel monkey it's all on science friday from WNYC studio\nFriday at three on eighty nine nine W. J. C. T. your community your world\nMany places in downtown Jacksonville being considered for demolition or redevelopment had had their history last how can we bring these stories back to life\nWhile determining a future for the ... W. J. C. T. in partnership with modern cities present the Jackson forgotten space\nTuesday October twenty third at W. J. C. P. studios the evening begins with a reception at six followed by a panel discussion at six thirty [noise] RSVP with his free of that had W. J. C. T. dot org slash about sponsored in part by downtown investment\nWelcome back and finally this hour it's a celebration of local offers and literary him illiteracy the jak spent jacks literary arts festival is coming up this Saturday in historic riverside Avondale\nBarreling ... is the festival director and Jim Gilmore is here to discuss this event good morning your money in running so I understand is the fifth and you write so tell us about what to expect from the literary arts that\nWell first of all I Want to thank darling kind of for a taking it off and I was here I I I'm organized it a with a lot of help um the last few years in the last year uh I just felt worn out and she's done an outstanding job with it\nUh you know I'm ... ... works is a there are a number of Venus a around um\nParking king street and riverside places like a cool moose coffeehouse injects magazine riverside liquor is a\nLots of others a and a writer's a perform their work or you know whether it be poetry or fiction or a memoir or creative non fiction or folklore [noise]\nUh so uh it's a it's a an opportunity to uh you know really enjoy the neighborhood and the city and have a good time and listen to the city's literary\nVoices well first of all the anything that happens in riverside avenue I'll always deemed to be cool [laughter] so ah ... Jackson that include that but uh so you were talking about local artist here man for local writers who\nAre here and they they perform their work um we're kind of uh what kind of a of\nAtmosphere to we have for that we have a lot of local artist here who I'm Sorry literary people here who write books write poetry\nBest best bet vibrant that they can take on in producer festival\nWe absolutely did and they are\nFrom all walks of life they ride and all the different genres and they're all ages we start the day as a matter of fact but the students showcase at the women riding for a change building and um that goes from one thirty two thirty\nAnd then from three to six we moved to that area near the corner of parking king straight and half the twelve they nice twenty four riders\nAnd then at six thirty were going to have an after party at yellow house are after party after party going to be great and we're going to have um further readings that we're going to have a flash reading put on by bridge eight press so that'll be exciting\nSo what does it look like to visit of is the writers and performers\nAre they in these particular been using it just their reading their word for this space or the one time or did their schedule throughout the day [noise]\n[noise] well um [noise] so uh you know two writers share of venue mhm [noise] and uh each writer will read or perform three different times for about Fifteen minutes so you can look at the schedule of events at ... dot com\nAnd uh you can kind of a you know I always think of it as as choose your own adventure and those of children's books that I I I personally love when I was a kid\nUm you know you can you can kind of figure out who you want to hear a ... and when you know and you can go here's someone at a comic bookstore or at three and then go down to a you know flare celebrations and and here's somebody at three thirty\nAnd a few miss somebody at three or that you really wanted to hear you can also catch them at four and five so on and you know it's a lot of um cross pollination you know in in the center of the neighborhood\nSo was it all local riders in December the new people come in from other areas of the country to showcase the network\nThis is Jacksonville riders riding Jaxton now and so what we do is we say you can submit to Jack's by Jackson it is curated uh we're we're taking the best of the applicants um\n... you need to be born here you need to live here now or you need to write about Jackson now you know set your fiction here or write memoir about it so they are all local and we hope that uh that will be an inspiration to people who say\nI Would like to be a writer but you know I I just live here in the little town where I was born and and uh I\nUh don't live in a big city and and maybe I shouldn't a aspire to be a writer but we want to show Jacksonville that there are people here doing exactly what you're dreaming of doing and they are making a success of it\nYeah before we hear today as a student showcases well of course not all grownups trying to you know people dabble over there by their students who are trying to find their way as well talk about what they bring to the to the festival\nWell so uh FSU days of Matt Laney or who is a wonderful writer a himself a you know select a from students applications\nAnd uh and as John said this will be a down at a woman writing for change in Osceola street uh and their students from uh we've\nGot students from ... CJ and a U. N. F. and we've got a force high school students from Douglas Anderson school of the art so we're very excited to hear from them as well\nThat's right All right so so it sounds very very exciting I mean I'm\nAlmost inspires me to want to write something that was a piece of paper and read right and what is\nThat this is another one of those events here in Jacksonville does a a ton of things to do here in this great city and it sounds like the jacks projects literary fast is one of those things yeah All right so thank you for ...\nI just wanted to mention one thing we will have a pop up book store San Marcos books and more is going to do a pop up book store right there on park on the street and you will be able to buy the books\nFrom one to six P. M. and take them with you to the readings that have the author signed them where they can find them at the after party All right thank\nYou very much a downy Kooning Jim Gilmore\nThanks for being here they appreciate it half hour show thanks to all our gift to the caller's our producer today in just a couple of limbo Michelle corn runs to board the show's theme is composed and performed\nBy Jacksonville symphonies beard or check check\nIf you miss anything this morning you can hear rebroadcast tonight in a\nWay as a mixed on Charles graves and thank you for being your\n\nSupport for first coast connect has provided by Baptist Health and the north Florida tea peel\nThe Jacksonville Symphony led by Matthew halls takes you through a program that spans the Eighteen Nineteen twenty first century the symphony brings you to works by James Bach and Mendelssohn symphony number five October nineteenth twenty and twenty first information at jak symphony dot org\nIs Ira Glass of this American Life and coming to Jacksonville even talk I costs seven things I've learned about your stories like videos waiting that never been on the radio Saturday you've ever attempt\nAt wired theater tickets at Florida Theater dot com\n\nIs she's eighty nine nine W. J. C. D. Jacksonville your community your world mostly clear overnight a low of sixty seven or friday sunny a high near eighty five for a weekend sunshine I see in the mid eighties well can to W. J. C. T. after hours\n... and\n[noise] and\n[noise] welcome to the electorate lounge every house David luck in here with you for the next two hours when you all kinds of music we've got some great music coming up we've got TJ shadow ... Nord salt water waves ski of dreams came garden quartet and so much more let's get started with some easy stinking music for Mr Marley [noise]\n[noise] bang\nBang\nBang bang bang bang and as soon\nAs he was a\n[noise]\nThe the [noise]\n\n[noise]\nThe\nKnow\nTo show that stuff that mesh\nYou\nThe\nBe\nKnow what I say [noise]\n\nDe la la\nThe love\nNot for you but by\nTime to show that mesh\nOn the part that show that fast mesh\n\n[noise]\n...\nBrooklyn Bridge bank\nDo with the uh the\nSweeter\nI'm just saying\nThe free\nWere [laughter] [noise] do\n\nWe usually go to John\nJohn John raining\nMy own view you\n\n\nA\n\n\nAnd\n[noise]\n\n\n\n\n\n\nMe and we get new genes\nBe here when\n\nI\nAnd then you'll see\nTo\nTell me\nOh you can do\nYou're listening to the electro language a Thursday night we started with\n... above early in the ... of course for type ... Seventy eight little sunflower my new favorite song from bird moved my decision the extended mixture Roberto saw the Swedish Spain for her to a gym mark king from their city called ... ... miles away from him do Herman from ... lounge by one New York Rio Tokyo\nPicks us around the world was spread that goes from limited from tourist chilled by to the E. pi can you hear the sound from all India radio from the slow like CD being you betray predicts Pearl from ...\nIt'd be understanding to take us to the break Caribbean Sunset obscene words in a much more music is on the way don't go anywhere we got some great music coming your way right up 'til eleven o'clock\n\n\n\n\n\n\n\n\nThe big brains they talk and they've been up to space and back I'm Ira Flatow on science friday primatologist I Need a stone decode the chatter of our tree dwelling cousins the squirrel monkey [noise]\nAnd yeah she is fluent in squirrel monkey it's all on science friday from WNYC studio\nFriday at three on eighty nine nine W. J. C. to your community your\nOn Fridays we welcome you to comment on the world as you see not just as you want it to be a Saudi Arabia\nKilled one of its own for doing just that I Am just but I didn't I Won a free environment to light and the St Louis\n... she'll disappear also women in Brazil say\nNot him and Bollywood me me too much time on one and weekdays at eleven on eighty nine nine W. J. C. T.\n\n\n\nOh\n\n\n\n\n\n\n\n\n\nThink in ...\n\nHere's what we've been listening to on the electrodes I don't you start with secret of life from James Taylor for itself and Jake T ... Seventy eight or so [noise]\nBuying with no wings from kindergarten quartet from hotel del mar labs late flight from the Knight talks from their metro ... finally tiny car from Rebecca Rubio will come back with much more music but after a break [noise]\n\n\nWaiting Hogan of the ... Oregon law for I'm Wayne Hogan a mini stroke or TI happened when blood is briefly block from the brain it often warns that blooming stroke and requires immediate medical attention or nor Wayne Hogan dot law\nMusical really straight on jazz at Lincoln Center\nAnd we pull back the curtain on the man\nMost of his personal life in the shadow of ... what about what to\nThat don't anybody ever do it the\nChristian McBride and that's when the next day I was a nightmare\nSaturday nights at eight an eighty nine nine W. J. C. she\n\nDoes she's eighty nine nine W. J. C. D. Jacksonville your community your world mostly clear overnight a low of sixty seven for friday sunny a high near eighty five for a weekend sunshine I see in the mid eighties\nHe's the he's the he's the he's\n[noise]\n\n[noise]\n[noise] ... ... ... ... ... ... ... ... ... ...\n... ... ... ... ... ... ... ... ... ... ... ... ... ...\n\nMan oh\nCheese\nAre made in\n... [noise]\n[noise]\nWell\nDon't know my\nCell\nPhone number ...\n...\n\n\nName na\n\nNa\n[noise]\n[noise]\n[noise]\nWho\n...\n\nNa na\n[noise]\nHe\n\nNo I'm\n\nA\n\n\n...\n\n\n...\n\n...\n\n\n... ... ...\n\n\nAnd\n\nAnd\nAnd\n\n\nThe ... [noise]\n\nYou know the\nAnd\n[noise]\n\n\nThe er into music from the electrodes you started this it was such a group for such a such an ...\n... ... some nice to be with you from your dreams from smiling voted to spy on salt water waves which are Rachel boy from afterlife morning some from whether tunes ... miles ... spikes in jazz\nGravity calling from solar bears based from ... in the store with Europe the cat like person will come back with much more music but after a break\n...\nThe little things\n\nMore men than women\n\nMe\n\n\n...\nPromotion I'm\n\nFully a weekly present the best object readers bowl and this year every vote is an intriguing are sweepstakes they're over five hundred categories starting September Nineteen continuing dropped over twelve voting is open for a local celebrities attractions and merchant more at Boulder Weekly\nDot com the wider museum presents Robin I'll be all cars are broadly October ... G A grand open house celebrating Seventy years at the light your museum but one hundred Thirty years of the aisle 'cause our hotel with music tours food and why the light your museum dot org\nMany places in downtown Jacksonville being considered for demolition or we develop that have had their history last how can we bring you stories back to life while determining a future for these sites W. J. C. T. N. partnership in modern city present the Jackson forgotten in\nSpace Tuesday October twenty third at W. J. C. P. studios the evening begins with a reception that six\nFollowed by a panel discussion at six thirty or to speak with is free of that at W. J. C. T. dot org slash about sponsored in part by downtown investment", "show_name": "Electro Lounge", "year": "2018", "city": "Jacksonville", "day": "12"}