{"month": "10", "state": "FL", "station": "WJCT", "content": "\nHi I'm Melissa rod\n... joined us brought it for the world around them where we talked about the biggest stories of misty from politics to education the environment and more if its news in Florida we want to hear from you\nLet your voices be heard joined the conversation on the order on Fridays at noon on W. J. C team [noise]\n[noise] [noise] [noise]\nThe Jacksonville area is full of entrepreneur who have grown businesses creating thousands of jobs on first coast success we highlight these leaders and the ventures they've created I'm Karen Bernie math is with the daily record joined me for first coast success the final Monday of every month on W. J. C. tease first coast connect\nMe also bought you you'll [noise]\n\nWelcome back well finally this hour everything from a prince tribute to a chicken give away is coming up right now [noise]\n\n\n\nHere she is every other Thursday to\nPick is all around the town we welcome them mistress of mayhem them even from earth the spectator dot com give\nGive her away from that and if I\nCould give them the way in and who gives the tickets I yes the ... of the ticket [laughter] me ... me me\nWhat what is a word that starts with T the not\nThe taker of the tickets but the transmitter of the tickets yes sets you\nI mean I'm not on impeachable however like Kevin\nOwner Sharon ... that's why you however are the spectator I Am we got to give away right now back right off the bat into orbit with Andy how is the inaugural fundraiser\nHer rented aren't jacks they're raising money for the development of more robotics programs in northeast Florida and Andy how I Believe he's a doctor Dr anti how he will discuss his research he's a Nobel Prize winner\nYou've seen him on that geo the History Channel et cetera et cetera\nHe leaves the supernova group at the Lowes comb race observatory\nI don't even know what that means [laughter] you know he's a very smart man but in other words Jacksonville turned out really okay I'm In west side I think you understand but he's going to talk about growing up and Jack's on what he does and he consults for a lot of movies but I'm this\nIs all about robotics and so the NBA again and space so you have two tickets to the suburban\nArea one twenty five each\nThat's a good ticket spectator ... coming up tomorrow night at space forty two and the cork arts district we have a pair of tickets valued at a hundred and twenty five bucks a piece a to come see Nobel Prize winner Dr Andy how\nWho leads the supernova group at the last ... observatory in California this is going to be a\nA ... I ... I haven't I don't even know what I mean\nI Know I Know of the supernova song by 'em away so [laughter]\nBut I get a ticket because knowledge now okay ...\nOr email us now at first coast connected W. J. C. T. dot org to win a pair of tickets this is a\nAlmost a three hundred dollar value to go the doctor Andy how at space forty two tomorrow night email us first coast connected W. J. C. T. dot org ... an impeachable Kevin ... short will the winner at random for that friday uh what else is coming up\nFriday the ... a ... or if you don't know what I asked means look it up [laughter] okay what it means mind why army radio land a Martin Lawrence will be hosting Iraqi smiling over their Adele given 'em it's going to be at the arena be a good old\nTime that'll be a fun one and then of course for the kids don't yeah that's adults only then Saturday and Sunday nights river city probably ...\n... anniversary of crazy I Know that is you know we just had curse a weight on the show yeah\nGrand marshal of the pride parade I Love her this is going to be a very nice weekend and\nI point yes but on the there's a block party that starts at ... five points and they have vendors entertainment um then we're going to have the parade which starts at ... branch in park um and it will we've around riverside until it gets to riverside park\nSo if they have a hundred I Believe entries into it and write people just like park their chair get their chairs or nothing\nI rode viewing spot but I rarely watch it from European straight you go to European history has it\nThat outside patio and a good idea they have ...\nOkay so wherever you go get out and enjoy that um and then over in Springfield at Saturday I'm enough to come to this too I Know there's so much fast is closing off main street in Springfield\nYes and they're going to have the vendors and live music dancing food um et cetera I Believe it's from three 'til nine\nOkay so uh you're going to have to toggle back and forth between Springfield and riverside this weekend for two really fun a celebration and\nAnd pride festival of on Sunday\nThat is under the solar warned bread correct right\nLive music kids on food vendors entertainment\nAll that jazz okay ah the jags play the cheese on Sunday there was a watch party at sunrise and when I have\nTo say it's one of the best places to why so I'm a huge like maybe screen yeah shirts awesome yes right\nThat is fun and speaking of music Saturday Night or if you're a fan of prince as I Know many of you are the Florida feeders got something going on with\nThe cold out it is the full or are you a symphonic celebration of print is the only one that has approved by the print state and it was curated in produced by quest love of the route\nSeen him on July found make it a point he will not be there yeah he was ...\nAnd he's one of his biggest fans and I'll hear all kinds of popular songs like why not sky also some lesser known gym\nSo low so there'll be a band on stage and then video yelling at me and I\nHave a lot of video that's never been seen before if you are French\nThan places that Saturday Night at the at the ... theater a get out and enjoy that\nAs a spectator dot com so never say that there is nothing today there's too much to do that's right it's\nAlways good to see you I'm always on the air somewhere this week I'm sure on Springfield on main street or earned five points yes or maybe both for maybe ... it's been a pleasure always a pleasure and an end in intervening [laughter]\nAnd that's the spectator dot com I'm Melissa Ross won a is up next we'll be back at nine AM from our with our friday round table that every day\n[laughter]\n\n\n[noise]\n\n[noise]\n\nSupport for first coast connect has provided by Baptist Health and the north Florida TBO\nMany places in downtown Jacksonville being considered for demolition or we development have had their history last how can we bring you stories back to life while determining\nA future for these sites W. J. C. T. in partnership with modern cities present the Jackson forgotten in space Tuesday October twenty third that W J sci fi studios the evening begins with a reception at six\nFollowed by a panel discussion at six thirty [noise] RSVP with his free events at W. J. C. T. dot org slash about sponsored and park downtown investment\nYou're listening to eighty nine W. J. C. T. Jacksonville your community your world partly cloudy overnight a low Seventy two sunny and hot friday and Saturday hides in the upper eighties the chance of rain in isolated thunderstorms Sunday welcome to W. J. C. T. after hours\nYou know ... ...\n...\n[noise]\n... [noise]\n\nOh wow wow wow wow wow wow\n\nOh wow wow well [noise]\n[noise]\n[noise]\n[noise]\nSee the full or is this a good use to ... to go over the\nLast ...\nThe\nSchool\nHe was ...\nThe most you know she could eat blood toll\nMost will change or ball group\nDay\n[noise]\n[noise]\n\n\n\n\n\n\n\nYou all ...\nThe Late Show who\nIs just jog ... blush toll\nThis is looking to show the view bluff\nThe\n... [noise]\nWhen the market because to me at all [noise]\nMama ... was the last ... plus school\nIs looking for fall to go to\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n[laughter]\n\n[noise] [noise]\n[noise] [noise]\n\n[noise] [laughter] [noise]\n\n\n\n\n\n\n\n\n\n\n[laughter]\n\n[laughter]\n\n\n\n\n\n\n\n\nWhen\n\nSee them\nWhich held\n\n\n\n\n\n\n\n\n\nPain maple\nLeaf\n[laughter] [noise]\n\nKind of\n\n\n[laughter]\n\n[noise]\n[noise]\n\n\nPain [noise] bam pain may [noise]\n\n\nWaiting Hogan of the turtle Hogan along for a while you hope in serious accidents first responders can now reached the families of over Seventeen million Floridians have you register your emergency contact information\nOr north Wayne Hogan dot law Ben Atkins music and Jacksonville University present time is up yes a tribute to the late and celebrated Michael breaker featuring renowned saxophonist Seamus like honoring records musical influence October seventh that Jay used Terry concert tickets at junior tickets dot com\nMORNING EDITION is everywhere else and you have to learn it's just not in our bureau and tell you one really compound the baby like reporting from bunkers his dream alleys jungle and deserts but most importantly\n[laughter] where wherever you\nAre start your day with the trip around the world and wake up one MORNING EDITION from NPR News\nTomorrow morning from five to nine on eighty nine nine dealt with your Jay Z to your community your world\n\n\nA\n\nOr a\nA\n\nA\nA\n\nA\nA a\n\nA a\nMan\nOr a\n\n\nA\n\n\n\n\n\n\n\n[noise] a\n\n\nYou're listening to the electorate lounge in eighty nine nine W. J. C. T. Jacksonville, Florida your community your world your chill out music we started tonight's program with marked down with the so called right control\nThan we played stay with me till dawn featured kept the ... from eBay see Fifteen\nIntoxicated men which church Ginsburg ... from ... from ... like trombone from search gates frugal so predictably unpredictable by urban species a woman who loves me get a little bit so discouraged me feel the pressure from their own it's All right from Nineteen sixty four\nComing forward we came up to Febreze eight with baby come down the ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[laughter] [noise] [laughter] [noise]\n\n[laughter]\n[noise] [noise]\n\n\nThey say [noise] everything's beautiful\nTo be a key piece [noise]\nA ground bill and stony\n\nAnd\n\n\n\n... ... ... ...\n... ...\n... the ...\nThe ...\n\nI was ...\n\nHe knew\n\n...\n\n\n\n\nSaid\n[noise]\nFully a weekly present the best objects readers bowl this year every boat is an F ... our sweepstakes they're over five hundred categories starting September nineteenth continuing dropped over twelve voting is open for a local celebrities attractions and merchant more fully a weekly dot com\nThe concert association presents Chris Thomas banned in culture on Saturday October six seven thirty PM in the Lewis auditorium song and dance man crystal this has been playing with various bands in Florida for Fifteen Years tickets available at Emma concerts dot com and\nAbove the museum of science it used to be present the audio visual experience\nJoined us on October sixth and seventh for world renowned trio Russia any special guest Jamie ... that they performed the Brian ... an attorney custom animation the graphics created by ... Williams junior adjusted\nThe more information about the curious duck or\nCurious means you're smart [noise]", "show_name": "Electro Lounge", "year": "2018", "city": "Jacksonville", "day": "05"}