{"month": "10", "state": "FL", "station": "WJCT", "content": "Way to always sort of resisted critical analysis he thought to sort of spoiled the works sometimes stray one served as a manger for the orchestra and arranged in the manner of as part of his role\nAs a member of the Ellington organization and he could do that really well he could sound like Duke if you want it and in fact\nI went to include sound like ... if he wanted but now the stream on family is doing all they can to reclaim street wants music and in a way set the record straight\nSo far we've published we have copyrighted added\nProbably close to two hundred titles that's a lot and there's more to be mind that street horns nice now my name is at least to about ... president of Billy strictly songs incorporated\nAnd my name is let's see do you miss it I Am president of the ... street when foundation she's another one on street wants nieces my cousin has this wonderful line ... was part of the Ellington organization the Duke was the Ellington organization he was the publisher\nRelease that even though do ... relationship was equal musically in terms of management skills were tipped in Duke street\nHe was the custodian\nOf all the songs that he had written if they were published pieces whether they only get credit for it and not even less life he was the custodian of mess like even the belief that was seen any belief\nIn Nineteen Ninety three Duke Ellington says state sold his publishing ...\nShortly after that the copyright law changed and open up the opportunity for history wants to reclaim believes music they did\nAnd it's been an exciting thing but we went from being your traditional heirs are collecting a writer share which to totally passive role you just have to be related to being publishers which is an active role so it's very different you are now in the business I\nKnew that it that game\nAnd with big artists like Lady Gaga recording must live\nThat means there are a lot of numbers around\nIt is a great responsibility particularly since we are talking about a catalog relatives we're not talking you know we do not publish God that cat cat love we published our uncles catalog self every one of those songs in addition to being great music is also you know it's a great memory for us it's a great moment for us\nThat great moment continued to jazz at Lincoln Center for orchestras costs honoring\nI remember everything but I tell you a jazz at Lincoln Center those cats oh that may that they played that music and they played it with such gusto Sherman every like he did it\nThe it's saying oh my goodness you know when it's good when the band\nIs you feel that they are playing\nAs much for themselves and for you because they were getting such a\nOut of what they were doing and each other and do you you were\nPart of what was going on there that's the feeling that I had that made it such a special event and it was intimate at the same\nTime it's filled the room or and and to be able to get that balance you don't always get that it was certainly a treat for\nClosing off this episode used the jazz at Lincoln Center orchestra was take the train\n\nDance night in America is the production of WB geo jazz at Lincoln Center at NPR Music\nThe music was recorded mix by gene feeding\nThis week's episode was written produced by now it's a\nBig shout out to be but they do the strain on families and\nOur senior producer is Katie Simon\nExecutive producers are Amy nah we yeah we are a month or a ...\nThe doors do charitable foundation supporting the performing arts the environment medical research\nAnd child wellbeing\nAnd National Endowment for the artwork\nRobert Sterling Clark foundation to sustain NPR's coverage of Latin American cultural programming on all Latino and the Gilchrist foundation in support of NPR's commitment to coverage of the art\nThis is NPR\nMany places in downtown Jacksonville being considered for demolition or redevelopment had had their history last how can we bring these stories back to life while determining a future forty ... W. J. C. T. and partnership with\nModern cities present the Jackson forgotten in space Tuesday October twenty third at W. J. C. P. studios the evening begins with a reception at six followed by a panel discussion at six thirty artists BP put his free of that at W.\nJ. C. T. dot org slash about sponsored in part by downtown\nIn age from palm coast to the golden ... this is eighty nine nine W. J. C. T. F. M. Jacksonville looks an anywhere on your computer or mobile device at W. J. C. T. dot ...\nWelcome to W. J. C. P. R. dollars\nYou um do ... ...\n\n\nLittle more more more more and more and more\n\n[noise] right\nI'm\n\n[noise] I\nI'm a big\n\n\nMakes sense so\nI just\n[noise]\n\n\n\nA for a\nLong time\nAbout\nMile\n\n\nWrong\n\n[laughter]\n\nOh\n\nBy a\nUm [noise]\n[noise]\nDo\nWe do\nWe\nDo we can\n\nDo\nThe\n\n\nDidn't think\nWe\n\n\nCan\nWe\n\nDo\nWe do\n\nYou're listening to the electro ... it'd be nine nine NPR Jacksonville, Florida your community your world which I was running away from Tara know by the Bob Marley song nicely done love solution for Sunday People run from snow patrols\nI still haven't found what I'm looking for I'm Still looking though from YouTube experience in jazz reaching Bello egg no for\nThe Bahamas so club wind and water loves this Elsie Morris from go a chill out by you seven we've been playing that one that's a nice one\nOn and on for America but do and I never\nMet shepherd Quincy Jones somewhere in the city and finally forget your thoughts from ... street just played from there should be called third way we'll come back with more music right after a brand\n\nThe catastrophe on the Florida Panhandle the latest on the clean up and recovery from hurricane Michael and well the storm scrambled from closely watched political races in that swing state before the midterms\nAlso a certified genius we talked with a new MacArthur Fellow who's bringing music under served communities all that and the latest news from Washington and around the world on weekend edition from NPR News Sunday Morning at eight on eighty nine nine W. J. C.\nT.\nOn the next radiolab crazy things happen when you translate crazy tax\nSo Yankees do we get lost in translation\nMarket fear of a BBC did you decide to take off a little longer to say about ... sounds like something that might happen to your\nCar with a little bit of translation on the next radio loud on Sunday at noon on eighty nine nine W. J. C. T.\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\nPeace up what's your favorite local teams with scores highlighted expert analysis to do first goes connect for a weekly segment for veterans sportscaster colpepper\nFirst coast connect to sports wrap up Mondays at nine forty five on eighty nine nine W. J. C. G. F. at\nThis is Ira Glass of this American Life in the coming to Jacksonville to give a talk that costs seven things I've learned to have a bunch of stories like video waiting that never been on the radio Saturday you remember ten\nMore at a theater tickets or at a theater dot com\n\nBroadcasting from Florida's palm coast to Georgia and the golden eye ... eighty nine nine W. J. C. P. F. M. Jacksonville\nWas an anywhere on line at W. J. C. dot org [noise]\n[noise] [noise]\n[noise]\nOoh\n[noise] [noise] [noise]\n\n\n[noise] hold\nOn [noise] [noise]\nWell it all you know\nAre some day\n\n\nTo day care\n\nOut and you\nLaw and cold [noise]\n\n[noise]\n[noise] blue blue\n[noise] blue who knew\nPeople who would be the people who can be deep deep blue\nBlue in the new law\nBoom boom boom\nThe long\n\nA lot of\nPeople who would\nGo to\nA lot\nOf people or what [noise]\n\n\nOr\n\n\n\nI ... and then\nThe show and\nThen she'll stay\nIn my house\nMom I now I'm On\nIn line down the\nLine you know what I'm\nA day in\n\nNo no no\nNo\nNo no I pay [noise]\n[noise] oh\n\nI'm\nIn\n\n\n\n... [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n... ... ... ... ... ... to\n[noise] [noise]\n\n[noise]\n[noise]\n... Raman Gen twenty nine parts region five points offering locally stores ... from a sock it to a full contact bar open for lunch and dinner Tuesday through Sunday and offering takeout and deliberate more information a crane Rahman dot com\nHundreds of accountable for milk drink radio this week reporter Krissy Clark and talks about the peanut butter grandma Nineteen fifties Washington homemaker who changed how the FDA regulates commercial food chain of Shelley takes milk street to a bus station Tel Aviv or Filipino cuisine surf\nWe cook a bright in fragrant yellow curry\nAnd we show your basic way to do your spices coming up this week on those street radio preparing\nSunday Morning at seven on eighty nine nine WG ACT your community your world\nThe great American song book and your favorite holidays on relax radio at midnight on the on eighty nine I found your community your world", "year": "2018", "show_name": "Electro Lounge", "city": "Jacksonville", "day": "14"}