{"month": "10", "state": "AZ", "station": "KJZK", "content": "Leading the quintet but also in\nThe album the amazing you're listening to the Arizona commute\nAn eighty nine point five K. GPA Drake Prescott valley Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven K Jay Z came came in Boulder City Nevada and our translator cake to one Seventy eighty Flagstaff month park in Ninety One point three FM\nI received a handwritten note this week from an old friend\nThere was nothing more to the message the day that they were thinking about\nI have to tell you that it made my day not only the thought that the fact that he took the time to write the note\nWas an email older posted\nWas written to me which so far I found myself really appreciating that small gesture thinking about it during the day and talking about it to my friends and family\nThis is a little touch society that we live in\nHas made it easy to reach out to people\nAnd so we see that we forget sometimes it's just that\nSo if we want to really touched on one\nMaybe an easy way to do that will be taken a couple of extra moments in the hand right\nPeople make their day to make your world a little kinder\nAt least more mature brought to you by the kindness revolution\nSupport for the Arizona community radio network is provided\nBy Grand Canyon deer farm eight miles east of Williams on interstate forty walk among the deer feeding him right out of your hand see hundreds of animals that elk buffalo girls camels collecting Mindy kangaroo llamas Rainier and more the Grand Canyon dairy farm near Williams support for the Arizona community radio network is provided by\nBetter result of the drawing through wildlife adventure park in Williams, Arizona view bites with mountain goats big orange she'd been black bear from the safety uncovered of your private vehicle or troubled go watch playful Barrett cubs up close at the end of your to Arizona like forty get highway sixty four in Williams, Arizona dot com\nI this is Dave letter your health for radio and like she joined me as the money while a beautiful field ... every week we put on the ground searching desperately music mix intimate under appreciated the bones and play you some of them you're on the\nRadio on tonight it ain't right here on public radio maybe nine twenty five ... kj great pride got ballet and Ninety pointed out that kj has got\n[noise]\n\n\n... the new ... played by food is Gerald back at the two written by a fellow smoothest or sloppiest Hubert Laws that's from Gerald CD colds flu vibes along with Gerald Steve ... tenor\nSax perk off trombone David noodles the pianist everyone germane on base Neal's mirror on drums and I'm Tony ... Davidson Goldman's with additional percussion Hi there you're listening to Jazz Age one\nPleasure to have you with us hope things are going well for you we have John Bailey up next trumpet player fluke award player composer this one step things from his release called in real time is too cold trip to listen to the\n\n\n\n\n\n\n\n\n\n\n[noise]\nMe the wrong\nMore\nYeah well you may\nI\nThink one of the\nThat no one\nReally\n\nDo I got rid of them to\n[noise]\n\n\n\n\n\nYeah I told you they were having fun pop that then Morrison singing and also playing ... joy deep friendships go on Oregon than what was going on guitar Michael load on drums them short Robert ... the too cold goldfish bowl\nFrom a terrific CD for van Morrison that joy deep gold you're driving me crazy you're listening to jazz with Dave Schwartz boy that whole foods blues refueling made me think of gene Harris so here's Jane my\n\n\nA\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\nGene Harris talk about school for playing that's exactly what you got when you heard gene\nNow that are released jibes ... they're pretty walk on Alto sax recorded at jazz alley in Seattle along with gene an early on drums pornographic Luther Hughes on base in Frank potential guitar\nYou're listening to jazz with ... on a lot more jazz coming up at least stay with us\nI Am deeply general manager of border radio thanks to contributors who called or don't either online during our recent pledge drive to support noncommercial music and student mission is on this station we're always encouraged to hear from our listeners that you value our community service so thank you very much for your support\n\n\nOr [noise]\n[noise]\n\n\n\n[noise]\nOh it's beautiful there watching\nMy goodness grant green and my funny Valentine use ... piece on flu jak McDonald's on the Oregon adding some wonderful background that company meant to the polls goings on there and our hair would on drums\nEverybody just complimenting everybody on my funny Valentine from grad greens grant stand classic early sixties released on Blue Note [noise]\nYou're listening to jazz with tape swan and we're glad you\nThe ... lights the trio up next the CD called good why Mr Evans\nWhich was a two by two words in respect to build weapons of course we're going to hear something written by Dave Brubeck here's cook on piano keyboard LA kept on base and farmers who don't boy on drums with Dave Brubeck it you're right we wait\n\n\n\n\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five FM kj ... valley Ninety point one ... Pete Prescott Chino valley Ninety point seven FM kj ... came in Boulder City Nevada\nAnd translator came to one seven ... pi Flagstaff month to park at Ninety One point three FM\nPicking the center for the arts is a nonprofit company committed to promoting the art scene king the group is renovating the Beale Street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network has provided by\nKeepers of the wild nature bark and animal sanctuary in Valentine, Arizona thirty miles east of ... historic route sixty six see over one ever jeopardy by rescued exotic animals lions tigers cougars dancers leopards monkeys in more open every day no divide except your day historic route sixty six\n\nRight it's undercurrents I'm Craig McGregor are welcome\nHere in store for some great music there's an hour from Mike snow Robert Mira boss T bone Burnett ... bio\nI'd rather see the natives are restless so here we go into a bit of the energy from march Marilyn and you know on this magic what it says new single this is the new radio I'm honored perhaps [noise]\n\n\nAnd they're not [laughter] ...\nGet the [noise] and when you\nMe\nWe mentioned there\nAnd you we have read on the Internet and the Chinese New\nHe\nAre in a\nA I'm a senior na na na na na na na na na na na na na na na na\nNa yeah\n[laughter] no no no there's no way and it's an honor as a child you know just as much\nAs a as\n\nIdea\nA a a fish in\nA year and\nLot\nNa\nNa na na\nNa and [noise] ...\n...\n... yeah maybe we ought to give him a zone like\n\nMy guitar\n\nThe lam playing\n\nLearn\n\n... ... s long\n\nThe ... kids who\nAnd there's three ...\n\nKnow na\n\nAround\nUnder\nGet it is\nAm going to have\nIt here at\nMan who want to do what\nWe can go\nThey are rare\n\nWay that\nYou plan to\nAir and Breyer and uh and pray and no no\nThat ...\n[laughter]\n\nThe scenes the geo\nDo you ever\nDo that one is a\nSan Bernardino ad and pray\nAnd pray\nAnd there was a\n[noise]\nI had a I tried I had a\nDream one in one of the people\nTurned away from Nineteen\n\nA strike when the ones\n\n\nI\nA tree last night I had an aunt ... when the lead to sort of the late Nineteen both cry and cry\nTo chase the full\nWho took care of people\nLike [noise] how\nDay\nWhen I you\nTeach I can handle all day\n\nAnd\n\n\n\n\n\n\n\n\nThere\n\n[laughter] [noise]\n[laughter] [noise]\n[laughter]\n\n[noise]\nBoy you know\nTo know\nCan\nGoing to\nDo all the ... the dam and the kids that they have the worms that's left behind the always talk on their mind that there is no which you can email or you know you\nIt was just some dog we choose\nTo be left alone but never got along the all the things I learned I guess I learned\nSon has been going on now you're going to know them most of the share something we can you\nToys day you know we're going to you know\nWhy do you have to\nGoing to you know\nI was just like you're out of ...\nI was raised in a while my mother got to be\nHumid into the machine the home\nWas not read the label to get my God I never knew you can change the overwhelming to change which was\nFun thing to\nOn the\nTime to\nTo\nYou know\nThe last word do the saw in the spring of oil that do worse you know that we share\nThe same water in the air\nPeople can't we be more mindful of what we put we can have the rise in the ocean\nYou'll be okay he's the tell yourself a\nLives and they get along you\nKnow in my mother's nature now to always for your\nTime you know\nBlind the can\nKnow about\nTeam and\nYou know who I'm joking bombers\nThat boys and he loved to Eric Clapton bad boy a long way from home Steve Miller would gangster of love and getting gifts con okay that was kind of a bad boy a two very controlling and they said he wasn't he was\nYou know a little jealous he's confused with his feelings everybody goes through it at one point or another even the bad boy gets kind of like snow\nIt's undercurrents Greg with you if you just tuned in welcome aerobics we would lose their on the way right now here's the man T bone Burnett witnesses zombie land [noise]\nCame to\nThe\nWeight of the\nChurch destroy the\nMan in charge there should be\n\nFrom your papers that came\n\nShe chooses to Trump's cancers [noise] shooting at him out\nThey could have done some senator man a man [laughter]\nTo\n\n\n\n\n\nNo\nDo you do today\nBut she was telling me that has been listening\nThan some of those and read in a\nWays you can see\nOnes you can hand them over then\nOn the dominant onto\nBlowing it is you are\nBe said about\nAnd this is needed voiced won the Native American radio network\nYou're listening to the Arizona community radio network on eighty nine points either than Kay Jay Z a drink Ninety point one of them kj BP Prescott in Ninety point seven at them K. J. C. K. king the king Center for the arts is a nonprofit company committed to promoting the artist in king the group is renovating the Beale Street theater\nWhich will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nBetter result of the drawing through wildlife adventure bark in Williams, Arizona you buy in bulk and go big orange she'd been black bear from the safety uncovered of your private vehicle or travel go watch playful barrack hubs up close at the end of your to Arizona\nLike forty highway sixty four in Williams, Arizona dot com by the public radio programs you enjoy that in for a middle aged editor Jane ... to June in radio dot com ... at the Arizona humidity radio network that lives in any time on your smartphone\nAlright it's under current some great vicar welcome for what lay low on the way the Kennedys Norman Blake right tutor and this is such a ...\nAlbum the latest from boss Skaggs says radiator one too [noise]\nTime I see\nYou can't just south\nHe's right\n\n\nSee a rise\n\n\nSee you\n\n\n\nAnd [laughter]\n\n\n\nNa na\nNa\n\n[noise]\n\n\nHi this is Chris would olive wood and John where the ... brothers and you're listening to under current yeah and\n\nHappy to were\nReading what\n\n\nGod\n\nGod\n\nLive\n\n\n\n\n\n\n\n\n\n\nMan saying\nAnd and make a shiny and and I lost\nHave a\n[laughter] [noise]\nDidn't ... they\nMan\nAnd my other half from now or are we bringing was weird\nAbout your job\nDo read or watch the show ...\nA great job to go now\nA ... I don't know what's\nA breach did but on the line Bob calling\nA low grade students\nDay\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\nWe're going\nThat the the the main\nEver got to be\nThe Iran and ...\nWe're doing the book store I'm just\nPackage of drinking mine up on\nA date you I Would not\nCreate jobs the nominee of the time\nGreat job do you want to keep my peace of mind\nBe the same song about their best shot\nNot know how to stop and that was bought\nCollege I went out\nA ... or whether\nA show is now the nominee me I'm I'm\nA great job do you go to Hugh Miles peace of mind during the\n\n... ... ... ... ... ...\nNo\nMm Mm\nMm\nMm Mm\nMm Mm\nMm\n\nMm\n\nThat'd be great to just be able to sit on the front porch and play like that ... that's one of those kind of bucket list thanks nobody Blake Chattanooga Iraq from would wire in words Norman Blake ... small band with Lucretia kitchen\nYes the biggest thing in a lean beer Helene de Wyoming I think it's a fictitious place but\nProbably a lot of places just like how do you do country it's like any need Starbucks and it was carrying mourns latest Winona Ryder case just before that hey it's under current and if you just tuned it no worries there's plenty more music on the way made a staples\nComing up we're going to take it back a few years now to an album ... put called my name is buddy\nEach of them has a theme of this was about to relieve labor organizers Communist Party and stuff like that\nYet it applies to these types one cat one vote one beer\nSet me up you don't pass me\nJoe you know I just don't think\nTo make it one cat\nMan said\nYou're listening to the IRS\nFor an eighty nine point five ... Jay Z a direct Ninety point one FM K. J. C. P. Prescott a Ninety point seven F. M. K. J. C. K. king the king the center for the arts is a nonprofit company committed to promoting the art sinking the group is renovating the Beale Street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five two to three eight support for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary in Valentine, Arizona thirty miles east of ... historic roof sixty six so you over one number jeopardy by rescued exotic animals lions tigers cougars dancers leopards monkeys and more open every day no divide except your day is do recruit sixty six\nBy the public radio programs you enjoy that and for middle aged editor date logo due June in radio dot com that church ... at the Arizona humidity radio network that looked at any time on your smartphone\nAlright it's under current and Greg quicker welcome we're going to get down to putting some music for you here near young coming up ... ... we're going to start off with a lot of protests are from two thousand ... Jackson Browne on ...\n\nMan and\n\nNa\nNa\nStuff though the\n...\nAnd ... they arrested a looking down on the\nFrom the beginning or\n...\nWay\nIt is these\n\n\nSo this is native voice why the Native American radio network\nYou're listening to the Arizona community radio network in eighty nine point five FM kj CIA director Ninety point one FM cage ACP rescue in Ninety seven F. M. K. J. C. K. king\nAnd we\nTo invite you to tune into the town every Sunday evening at six PM for great live music an in depth conversation about the world around him many evenings sick\nAll the bond that we saw in the old time radio hour with Michael jobs I mean you're going to do the humidity where do you think we're\nSupport for the Arizona humidity radio network is provided by God it was all wear chef's very barb and step prepared delicious lunch and dinner Andres\nAs exotic tapas for your body luxury enjoyed that you didn't go into a bar with happy hour weekdays like music Thursday or friday with jazz on Sunday three sixty was good when street in Prescott\nWe believe in family what's your immunity in ... modern garden center\nEntertaining enlightening informative and involved Prescott public radio\nAlright it's undercurrents I'm Greg liquor welcome let's get going here we got the white stripes coming up audience Alabama Shakes and ally but no recorded in Havana that's writer Ben ... just a couple of years ago this is the Rolling Stone control\n...\n[noise]\n\n[noise]\nNah\n\n\n\n\n\n\n\n\n\nNa na na\nNa\n\n[laughter] [noise]\n[laughter] [noise]\n\nMan\nAnd um\n[noise]\nGod\n[noise]\n\n\n[laughter]\n\n\n\n[noise]\nAnd you know\nIt was\n[noise] here's what we\nDo the army\n[noise]\n[noise]\nSee [noise] you know\nNeed to be\nThe [noise]\n\nThe right\nNot to\nDo this to my boy and my\nTo be done\nKnow me from getting\nThe\nMan\nI\nNo\nCouldn't [noise]\n\n\n\n\n\nAnd it was a um\nAway now\nOn day\nOne na na na na na\nNa na\nNa na na\nNa\nNa na na\nNa na na\nNa na na na\nNa\nNa na na na na\nHey I'm\nAnd a number\nOn that day and\nNa na\n\nA um\nMind and a number\nOn day\nOne na na\nNa\nNa na\nNa\nNa\nNa na\nNa na na na na na\nNa\nNa na na na na na na\nNa na\nNa\nSay no\nNot saying\nThe way I\n\nCan see a\nYoung you know he\nHe\nCan he can\nBe\nKept you bang bang when\n\nThe bank these take notes and you\nKnow I I Try\nOh\n\n\nThe golden rule I took some time\nUse yeah thank you\nYou're on\nTalk\nThe young\n\n[noise]\nShe uh\n\n\n\nShe does she have\nLittle thing in Bolivia no\nNo no no\n\nKidding you\nThe mall you\nNo no no\nNo no no no [noise]\nBad but you\nIn the same in the dirt\nOn and do\nThings on the air and oh\n\n\nThe time that\nMay may may may may\nI got out I Know now I'm Down in\n\nFront of me and I'm\nIn the [laughter]\nYou\nKnow nothing about\nTaught\nBy the door on TALK\nAbout\nThem\nIn the dark and done it for you or\nThat that\n\n\n\nAbout [laughter] nah nah nah\nNah I\nThe little ones around you know two three years old I Try to teach me dance writer James Brown I got the feeling because you don't need to teach it to bed at each other dance we know just go for it on the right music and those were\nWell not a long time from Nineteen Ninety ... song from their first album born to see and it was Alabama Shakes I Believe that's the first hour right boys and girls\nAnd lose an audience gave us Indian summer I consulted back in Nineteen Seventy one gets under current some great see Austin the head and right now that was stolen when the pollsters just from the new album look now Mr and Mrs hush\nBeauty is\nAnd then\nThe other hand you do you guys\nYou want to do this\nEvery single\nPayer health care and I got a rare\n\nThat you could know bam\nIs how about you know that\nI Want to do\nWhere are you hearing pray and pray and no\n\n\nAll the time\nDi di\nYou're listening to the Arizona community radio network on K Jay Z a painting I played by Drake K. J. C. P. Ninety point one press in Haiti the K Ninety point seven king ...\nThe kindness revolution it's football times players have been practicing hard\nCheerleaders have never looked better fans are geared up\nBut there's another group that's been working hard to get rid of\nThose are the coaches for both do\nSo I'd like to suggest that we give a little while\nYou know or scream or\nJob now to get to be nice if we don't like to play ball\nOr we don't like how much time our kids are just the\nCoach is not an easy job\nWho is in a great job making sure that these games are far to say [noise] and being talked to play hard [noise]\nTo learn more about the communist revolution\nCheck us out of the kindness revolution dot net [noise]\nSupport for the Arizona community radio network is provided by uptown United drug where you'll find friendly knowledgeable farm as it was more than eighty years of combined experience or important Health News discount coupons key medication information or to refill your mail order prescription log onto uptown\nYou not to draw dot com serving Kingman a golden belly\nI'm Tom you know each week on river city full we can go beyond the music or just\nBy foreign their careers is modern day singers and songwriter is a fascinating hour interview music and you can hear river city full right here Saturdays at three PM all the Arizona humidity radio network [noise]\nWe believe first year in my garden is good for you\nA lot of very Center You're reliable source for local news and sports Ninety One point three FM Flagstaff ... park near eighty three\n\nHello I'm Mary and motion where the b._b._c. news than us suspected of being Germany's west serial killers since the second World War I was admitted to killing a hundred if he's for my patients\nYou had a major concession started his trial I live in the city of holding back detected say he gave fatal days is a medicine to the victims to hospitals and Gemini no details from Jenny how\nCan you just say well never really know how many people he nodded because of course\nMany of the people he died I Hope that whole what cremated definitely way of thinking and testing that remains but secondly they hospitals which Hagel what experience significant increase it and the number of deaths the number of responses Haitians and in one case the amount of the ticket a medication that was being ...\nMany of us had said that by tightening a blind eye John and health authorities have an effect the Senate have had Hagel Nutter ambitions\nPresident Trump says he's considering ending bus ride citizenship in the United states in a televised interview you said the move would happen with an executive order\nA majority of low is beneath the White House doesn't have the pilot scrap the constitutional guarantee that anyone born on us soil has the right to citizenship\nYou'll soldiers in Copenhagen have accused Iran of trying to carry out an assassination in Denmark the Danish attended and said his P. E. T. says the target with an Iranian Arab activists resident in Denmark research ... report\nAmong Danish police carried out one of the largest operations in its history the controversial to a standstill as hundreds of roads were closed on trains unfair is canceled today the Danish intelligence service link to that Tony rainy an assassination attempt\nTo target is said to be known Iranian Arab activist residents in Denmark who is now under police protection ways to other people\nTo suspect who was eventually they paid nine days ago denies involvement the intelligence service described Iran's behavior is totally unacceptable the foreign minister and Sam most in Copenhagen was in talks with other European countries about further action\nThe United Nations Human rights chief which ... is pressing Saudi Arabia to lead independent foreign ... joined the investigation into the ... of the dissident journalist ... G imaging foods reports from Vienna\nMichel ... said international investigators should be announced full access to evidence and witnesses to Jim ... yes\nGiven the tiny little sounds the officials were apparently involved in his killing she said independent experts were required to issue or an investigation freeze political considerations she calls on the ... to review the we're about to his loyalty\nAnd yet the Turkish president demanded that Saudi Arabia is chief prosecutor establish who owe to the king inside that sounded confident in Istanbul\nBBC need for that were you seeing\nShe has been I did not seem a county public health that district is warning women to protect themselves been traveling to Mexico hey W seized all the reports the warning comes after the Mexican state of the report it any increase in locally acquired Zeke cases\nIn the county joined Maricopa County in cautioning pregnant women to protect themselves from mosquitoes when traveling to seek affected areas officials suggest protective clothing and the use of mosquito repellent as directed\nMaricopa County health officials tell ... easy in Phoenix there have been forty five cases of Zika in Sonora in the last two weeks compared to eighty four cases since twenty Fifteen\nThe county has diagnosed one case of travel related ... Huma county has not documented any locally acquired cases of ... and new mosquitoes trap politically have shown the virus Kevin ... county communications director\nWe're not to ... to ... to Yuma Kelly but we do one particularly uh women that are pregnant or that are trying to become pregnant it'd be sure if they travel to an area that might have a seizure again a shock to the border industrial area that they take the necessary precautions\n... spread by bites from infected mosquitoes that can pass from a pregnant woman to her fetus diversity is also spread through unprotected sex with somebody infected by the guy who may not be showing symptoms which include fever rash headache and muscle pain for ... a double you see News I'm Luke ...\nHalloween is Wednesday and its last day for Arizona instrumental in their early ballots for the November general election\nThere is on a republic reports the vast majority of Arizona in about Seventy five percent typically cast a ballot by Mel for those ballots to be counted\nElection officials must receive them before who's close on November ... when standing in a ballot don't forget just signed up front of the envelope and signed balance aren't accounted\nFor Kaine WC News I'm Jasmine I did not\nNew than her\nA\nThen you can find a\nA\nOr ...\nSee this one guy like there are more stole our\nWaits and\nYour brain and\nNa\n\nNa\n...\nFor a\n...\n\nDa da da\nHave played a lot of love songs this morning on the bridge or a border radio\nThat would suit John Stephen ... and the track mystery of love that he wrote for the movie called me by your name last summer and it's been a branch job board or radio we are Thirteen twenty am ...\nAnd we're also heard across the Arizona community radio network on FM transmitters at Ninety One point three up in Flagstaff Ninety point one FM in Prescott Ninety point seven FM in Kingman eighty nine point five and then ... Williams ... down\nBefore to John Stevens we heard the Kenmore ban with bad days the once was a bad the ... you don't love me that somebody who I'm called time and now and we started to set up with a pet and Galen Joey Ryan before they were milk carton kids we heard rock and roll or ...\n[noise] I've got some great reggae coming up after the break so hope you'll stick around\n... radio is supported by Dr Cheryl how go and the team at desert veterinary clinic who are dedicated to helping pets live long healthy and happy lives through regular visits and preventative care desert veterinary clinic nine Ninety five south Fifth Avenue and by phone at Seventy three five zero one zero\nWhen you can't get bored or are you thinking twenty eight and ... on your radio catches on line at border radio easy dot org or you can use it in in ... ... ...\nThis is folk singer Michael Johnson inviting you to tune in to this week's broadcast we have the Austin trio the trolls smash years and the son of the legendary John McHugh and Jonathan McEwen his son\nWhen he thinks\nArtists music in conversations among this week's broadcast\nBomb any any means\nRead me\n\nThat\nKnow\nThe\nYou\n\nLonger be\nTime\nI've got\nTalk about having to\nTo talk to your neighbors your\n\n[noise]\n[noise]\n[noise] [noise] in Oregon do the right to work and then you\n\n[noise] how\n[noise]\n\n\n[noise]\n\n\n[noise] oh\nOh\n[noise]\n\n[noise]\nShe was\nMy first show which has been going\nDo golf [noise]\nThey were\n\n[noise] [noise]\n\nThat then I found there from Steve Smith and the sneakers from there crying for mercy album came up back in two thousand led and that was mama likes as we continue to bridge here on board or radio before that dispense really bad has a new cell ad released we're river water\nOne of my favorite songs from Antonio land before that was collard greens in snail that's from her album banjo grandma's family album and we started that set off with new music from Joe pilgrimage ill a jury in the new album is called step out and we heard a timely tune called migrants\nHey we're going to take a short break and we'll be back we've got music from Emily failures starting our next step lesson artist out of the nicks who has a very French sound uh we'll hear more music in just a little bit so stay with us\nBorder radio is supported by Arizona west during college now offering extended hours as part of their ongoing commitment to putting students first and improving the college experience for our community students facing services on the campus are now open from seven AM to seven pm Monday through Thursday\nLearn more at ease the western dot edu\nVisit Thirteen twenty eight\nBay and border radio is the dog or a service to Arizona western college are more than ... five years\n[laughter] I Am you know one of\nThe whole new program called crossing borders on board or radio Thirteen twenty am in Yuma joined us every afternoon from three to seven for make the music from around the world or right here in Arizona they can be heard on the Arizona me radio network or you can stream with that key W the dot org or on the radio effects\nThat for the peanut at just ...\n\nWe will be okay go round\n... nah\nKidding wow bill\nThe big you know Mad Men\nUnder\nPowder nation\n\nWe done\n\nSame grade it all\nThe you know\nAnd\nDo you know and I'm\nBy the way\nOur\nIraq\nAnd carrying on me\n[laughter]\nThere are\nThe GOP things you know\nWhen you turn on your TV and\nYou have a huge deal you\nA lot\nAnd you\n\nKnow\nMy\n\nAnd you might want to\nIn key genes e K in Kingman, Arizona [noise] this is native voice ...\nYou're listening to the Arizona community radio network on eighty nine point five minutes and ... drink Ninety point one of them cages eat the bread and get in Ninety point seven MK Jay Z cake Kingman\n[noise]\nBy this is Tony Stark nor did I miss the host of the road house from New music to bury the classics new artist to the old favorites arch villain our every weekend the road house with the funniest blues you've never heard Mr to listen to the road house the road\nHouse on Saturdays I'd seven PM\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark and animal sanctuary in Valentine, Arizona thirty miles east of ... historic route sixty six to ... rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day now divided up Tuesday audience do recruit sixty six we believe in the golden\nMonitoring center community radio and the world news northwest Arizona Public radio Ninety point seven FM king\nAll right it's undercurrents I'm Greg vicar welcome to go and here we got the white stripes coming up audience Alabama Shakes an ally but now recorded in Havana that's right her Vancouver just a couple of years ago this is the Rolling Stones or out of control\n\nNa\nNa na\nNa\nNa\nNa\n\n...\n\n\n\nGuy that\nNa\nNa\nNa\nNa na na na na na na\nNa na\n\n[laughter] [noise]\n\nAnd [laughter] and um\n[noise]\n\n\n\n\n\n[laughter]\n[noise]\nWe don't have anything\n[noise]\n\n\n[noise]\n\n[noise]\n[noise] I don't\nMay you know\nMade to be sure\nThe guy\nGo\n\nJeez you then right\nNot to move\nOn to my blood and\nIn a\nWay to know me\nTo know why\nThat\nI\nKnow\nWanted\nCouldn't be [noise]\n\nNa\nNa na na\nNa na na\nNa\n\nNa na\nNa na na\nNa\nNa na na\nNa\nNa\nNa na\nNa na na na na\nNa\nNa na\n\nNa na\nNa na\nNa na na\nHey yeah before\nNa\nNa na na\nNa na\nNa na na\nNa na na\nNa na\nNa na na\n\nNa na\nNa\nNa\n\nNa\nNa\nNa\nNa na\n\nBar\nNone of the terrain\nGod and I\n\nDon't\n\n\nCan be\n\nKnow how you break in the day\n\nBy the bank is being done can you\nCan also as I can\nSay to young\n\nSaid I don't know\n\nThe not the rule I you know he'll come\nThe huge yeah thank\nYou're on a [noise]\n\n\n\n[noise]\n\nWho's the\nMan\n\nShe\nJust she was\nA young little John McCain in Bolivia no\nNo\nI\nMean you\nKnow as well\nYeah well you\nNo no no\nNo no no [noise]\nAh\nDie in the same in the in the\nIn the dark and deep on me I don't know\n[noise]\n\n[noise] Shaun Manhattan from the maternal\nMay they may may may may\nI got out I mean the independent from some of the time of the\nOther one book and the guy\nIn the [noise]\n\n\n[noise] no not a lot\nAnd my mom taught me\n\nFound\nNa na na na\n\n\n\nNa na\nNa na na na\n[noise]\nForget the little ones around you know two three years old that side of teaching me dance right there James Brown I got the feeling\n'cause you don't need to teach a kid that you try to dance they know this guy put on the right music\nAnd those were the hold on I haven't heard that one at a long time from Nineteen Ninety such you saw from their first album born to sing and it was Alabama Shakes I Believe that was their first album right boys and girls\nAnd lose an audience gave us Indian summer 'cause all the way back to Nineteen Seventy one hey it's under current some Greg ... is the Austin the head and right now that was ... when the posture just from the new album look now\nMr and Mrs hush\n\n\nDo it is\nI Am here in the junior guy you\nWanted you to\nGo\n\n\nWay is how\nYou're going to\nPray and pray at\nBeen there there are ...\n\nThen she also actually\nDa da da da da\nDa da da", "year": "2018", "show_name": "no_show", "city": "Kingman", "day": "30"}