{"month": "10", "state": "AZ", "station": "KJZK", "content": "Sometimes with all the noise going around us we feel the need to be hurt\nBut that's just not the case for the courageous among us\nSome may differ from our own\nThe many will also fit right into our personal belief systems if will simply open our minds or\nIf there was ever a time for listening this might be\nIt'll make our world a little kinder and a sitting down part is optional\nMore about checking us out at the kindness revolution\nNet support for the Arizona community radio network is provided by Grand Canyon deer farm eight miles\nEast of Williams on interstate forty walk among the deer feed him right out of your hair the hundreds of animals that elk buffalo girls camels collecting Mindy kangaroo mommy's Rainier and more the Grand Canyon deer farm near wins\nSupport for the Arizona community radio network is provided by\n... the drive through wildlife adventure park in Williams, Arizona you buy in bulk and go big or cheap and black bear for the safety uncovered of your private vehicle or travel go watch playful Barrett cubs up close at the end of your two or ... but I forget highways sixty four in Williams, Arizona dot com\nI this is Dave letter your health for radio unlike joined me as the wilds of beautiful the other ... every week we put her down to the ground searching the casting music ... at least some of your study it's radio enrich tonight at eight right here on public radio\nEighty nine twenty five ... kj ... valley and now you point out that kj D.C has got\n\n\n\nThe children's walks from John Bailey that's from the CD in real time John Bailey on Google or nurse Stacey Dilbert soprano sex John Hart guitar camera and brown bass and Victor ... drums\nAre you doing welcome you're listening to jazz ... it's a pleasure to bring you all this great American music that we call jazz\nAnd a pleasure to bring you to really terrific Tanner players Greg fishermen and dug Web\nAlong with Mitch warming on piano Kevin taxed on base and bench Nellie on drums the CD is called so you say that we're making up the great Fishman quintet with the dark Web to two fifty four west the second\n\n\nNa\n\n\n\n\n\nNa\nNa\n\nNa\n\nNa\n\n\n[noise]\n\n\nAs the great baseball announcer Mel Allen used to say now how about that [laughter] Kenny Burrell at the village vanguard\nAnd are joined by great trio James Williams on piano Peter Washington based ensuring burgers to non drums with Kenny to do what you got to do\nThe C. D. go midnight at the village and guard as you can see a cook and stuff but also a jury beautiful set some fantastic things on here like\nThey're rendition of Parker's mood and also little sunflower by Freddie Hubbard benches wing by the voting is once they get it done Kenny Burrell and that worked at midnight at the ...\nYou're listening to jazz with Dave's one and Ellis Marsalis L\n[noise]\n[noise]\n\n\n[noise] ...\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nAll well gee the name of the group the name of the two birds live written by the Alto sax player we heard in that group Jackie McLean\nWhy being granted Nineteen eighty nine the personnel are worth repeating Ron Carter on base Johnny Griffin on Turner\nRory Haynes on drums to Jordan piano jak in McLean as we mentioned on I'll do the baritone sax player Cecil pain and Don stickler dog tick learn Ron Carter the only two of that group never played with or new Charlie Parker you are listening\nHey one second salute do Art Blakey and Art Blakey and the Jazz Messengers\nThis group called themselves message and the CD called the art Blakey is the result all but two people in this group played with Art Blakey and the Jazz Messengers the only two who did not Ralph more on tenor sax here and the drummer Carl allowing\nEverybody else however Donald ... el do Brian Lynch on trumpet Robin Eubanks on trombone Jeffrey Keizer on piano when Peter Washington on base we're all part of the messengers\nAt one time or another\nAnd here is one of those cuts from the art Blakey a beautiful too by Donald terrorists and it's called afro so\n\n\n\n\n\n\nLa [noise]\n\n[noise]\n\n\n\nNo no no no\n\n\n\n\n\n\n\n\n\n\n\n[noise] or\n\n\n\nNa\n\nNa\n\nNa na na\n\n\n\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five FM K Jay Z a trait Prescott valley Ninety point one at ... Prescott Chino valley Ninety point seven F. M. K. J. C. K. Kingman Boulder City Nevada\nAnd translator came to one seven ... Flagstaff months park at Ninety One point three FM\nPicking the center for the arts is a nonprofit company committed to promoting the art and sinking the group is renovating the Beale Street theater which will be a Center for culture of creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com more call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark and animal sanctuary in Valentine, Arizona thirty miles east of ... historic route sixty six to ... rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day now divided up Tuesday historic route sixty six\n\nAlready gets undercurrents I'm Greg McGregor welcome quite as you with us we're delighted to be in your space Libyans coming up mountain man in your schools only boy [noise]\nI mean\n\n\nBut\nI mean\nOf mine\nMy mom we need to\nMan by\n\n\n\n\n\nNa I\n[noise]\n[noise] I don't know how\nWould I\nWant\nKnow\nLimit to treat the was the ...\nLay in the book but\nSchool to be another ... ... ...\nIn to me we moved\nDay was love the like he was a quick in the day\nHappiness is and there's a there's a hunters ...\nTo forward to this cat is going to get the green and blue mango is so smooth smoother than the devil you ought to slice it up to the ... main rebel\nWas going on around you think\nI'm In the way he was born\nHe's come and you know\nWe could do the\n\nThem and\nI told him only don't you\nI wouldn't be the same\nTo\nYou by email you read the bill\nWould do in New York\nBy the way he\nCan\n\nDo\nIs we broke the bed\nMen to me\n\nJust name Mm\nThey the way ...\n[noise]\n\nDa\nDa da da\nNa na\n[laughter]\nHad to go and not going to miss or the people you look into undercurrents radio alive and direct\n...\nHours to me gather\nYour mind you know ... you're\nThe baby boom in maybe you're making plans you love you and\nNa na\nLot of bombs in general you know\nAll they know leaving these brand\nUs then your mind\nBoat that the when you say oh\n... being Daniel\nAnd the navy and\nNa I'm\n... to ...\n... when the ...\nJust me and my job for a\nUh I see is really your mom\nThese ... ... con ... quiet\nThere the ... million dollar where there were years later she will\nThis thing were you in a lot of just about\n... ...\n... ... ... ... ... the the you know\n... when they're around\nThan they are now\n\n[noise] [noise]\n\nHe he he you\nKnees to\n\n\nMaybe I'm\nI go to ...\nAnd she read all\nThe norm in ...\nThey\nKnow they had at that and then I'm going to go out in the middle of an expert\nThis I bought it and say well look I learned I learned\nMore local bands and not the only thing I like when we come the millennium\nThis is Don call then you're listening to under current\nThe ... to ... you know the the only ... ... ... ...\n... ... where\nAre you ... you know one thing that you didn't just\nThe June\nJune\nThe show needed to be do need me believe me I\n\nMean the ... when the when\nWhen you know man\nIt's just my\nMade sure to my\nMind\n\n[noise]\n[noise]\n\n\n\nOh my\nNa\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\nBrunch and would that would that went back in Nineteen sixty seven Sean Coleman give me a little sign from uncovered from Columbia to see people do those but I don't know\nThe Beatles from the new expanded edition of that album well known as the white album\nBetween your team actually back in the USSR and it was an really touched young if not now where it's undercurrents were just rolling on here of course we're commercial free went on to his radio\nI Swear to be like I Know pretty soon coming up Jimmy grant and poll Kelly and truly over now to get used to fly\nSaying hey I Need you\nThey now make a\nBad I'm buying\nNa na na na na\n\nYou're listening to the Arizona community radio network on eighty nine point five FM kj da da da da de ... in Ninety point seven F. M. K. J. C. K. king the king the center for the arts is a nonprofit company committed to promoting the ... the group is renovating the Beale Street theater\nWhich will be Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nBetter result of the drive through wildlife adventure park in Williams, Arizona you buy into mountain goats bighorn sheep and black bear from the safety uncovered of your private vehicle or troubled go watch playful Barrett cubs up close at the end of your to Arizona like forty get highway sixty four in Williams, Arizona dot com\nBy the public radio programs you enjoyed that and for middle aged editor Jane ... to June in radio dot com that church ... at the Arizona humidity radio network that looks at any time on your smartphone\nCurrents I'm Greg McGregor welcome usually from Louis Price coming up nearly Pearl Justin towns are all and this is Rochelle said Duke\nThe day and [noise] [noise] Mm [noise]\nDone by not here understanding we may be there is a\nManhattan or how they\nMan there that are now you know\nI'm a mom\nThe and the other day\nI'm generally a lot in a in\nMean under the bed\nBelieve on the bad\nMidst of just you know she didn't she then\nYeah [laughter] yeah and\nYou just don't feel like I'm going\nYou\nNa na na\nNa na na na\nNa\nDe\nBush shame shame shame\n\nDe\n\nDe da\nSay he shame shame\n\nA you know\n\n\n\n[laughter] and do\nSad\nMad man you know\nWhat I Know that added to Iran and all that [laughter]\nYeah that\nGuy [laughter] an\n[laughter]\n\nDo\nWe go on the ...\nThe only thing is a boy and train you\nBegan to the\nWe a lot of them are so\n\n\n\nUh so\nUh\nA\n\n\nNo no ... Mm Mm Mm Mm Mm Mm Mm Mm\nMm Mm Mm\nLobbied\nI\n[noise]\n[noise]\n\n[noise]\n\nNa\nNa na\n[noise] no\n[noise]\n[noise]\n\nNa\n\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\nOr\nWere\nEverything ready and bring my big\nThan being a black beret and\nBe younger members and turn\nThe ...\nAt the\nBeginning you\nAnd I do remember\nHa ha let\nMe [noise]\n[noise] no\nShould draw a\nMy dream is\nUnder current American music with a passport\n\nMe and my\nThe\n... de\n\nDe\nOh\nJack Bauer did you learn doe ray right there for many ... Wonder Woman in sports in the machine with sky foresaw for my you're so related\nAnd Bob Marley in the way they should Maggie dread no woman no crime if you just do welcome to send your current music from the British slash New Orleans musicians John Cleary coming up he's our son\nCreating a rhythm would just\nHalf\nHe can make a\n\n\nAn na na na\n\nNa\nNa na no\nNa\n\n\n[noise]\n\n[noise] ... do you know we do well\nA ... nearby and they could do we know not only you know no no no no no no it's\nMy job I was wondering\nIf they were you know\nDo you mean not only\nAnd the only thing I knew we don't know where you know you do you know\nA\nTo read about that John John\n\nI see the real\nDeal\nI think\n\n\nYou're listening to the Arizona community radio network on eighty nine point five okay Jay Z a direct Ninety point one of them ... Prescott a Ninety point seven to ten K. J. C. K. king the king the center for the arts is a nonprofit company committed to promoting the ... the group is renovating the Beale Street theater\nWhich will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com more call Christina Mickelson at three in five three one nine five two to three eight\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary in ... Arizona thirty miles east of ... historic route sixty six to ... rescued exotic animals lions tigers cougars Panthers leopards monkeys are more open every day you know divided up Tuesday historic route sixty six\nBy useful information all the public radio programs you enjoy that inform entertain educate and didn't like it was a link to or lie Web stream at kj Z. A. dot O. R. G.\nO. right it's under current in some great liquor welcome from the periphery trio coming up a no mortal orchestra Ernest rank and this is the only\nNa\nNa na\nNa na\nNa\nNa\nWe drown\nNa\nNa na na\nNa\nNa na\nNa\nNa na na\nNa na\nNa na na na\nNa\nNa na na na na\nNa na na na na\nNa na na na\nNa\nNa na na na\nNa na na\nNa\n\nNa na\nNa na\nNa na na\nDing\n\n\n\n\nThey\n\nAnd nine\nHe can be\nVery funny\nThen and now they they\nThey\nChange are\nLooking for\nPull you mentioned that in the street\n[noise]\n\n[laughter]\n[noise]\n\n[noise]\nSee the thing that is to go see the the\nThe ... and she\nTold me you know\n[noise] [noise] I think just to get to the surface to surface\nTo surface\nAnd to be there to do that you took the\nDuring the boom in the mid to late ...\nGovernment can do to make sure you do in terms of their\n... to ...\nTo ... to ... just\n\nTo make it to\nDo do you think there could be winter can be the same thing\nYou need to take\nCare of the energy and the director of the ... the director there may be in the ... to drink tea during the\nThe the the the\n\nDish you ever\nGet to the gym to prevent the dirt they invented [noise]\nDown to the game to be made to be like\nIn the mid ...\nBe the\nKey to do with\nThe kids to be\nAble to get\nOr the ...\nThe ... [laughter]\nNow\nMay be named\nThe ... they be jumping\nIn the ... the main things that make the effort\n\nTo\nMake the ... the Beijing\nThere to be tending mainly in the ... the\nReason that we get to the\nGym thing to do dishes after you've been there ... there were\nThey just didn't get the main ... just like they need to be in the ... [laughter]\n\n\nHello this is Eric went down under currents American music with a passport\nThe toddler managed\n\nTo go can you walk in you\nDid you\n\n[noise]\nTo get what you would do what George di\n[noise] [noise] [noise]\n[noise]\nHere and we're\n\n[noise] er I'm In\nMy own\nLong run and [noise]\nUm [noise] in\n...\n\nDa\nDa da da da da da\nDa da da\nDa\nDa da\nDa da da da da\nDa da da da da\n\n\n[noise]\n[noise] [noise]\nI'm a saw\nYou know I don't have a chain that has you know Russia\nYou're talking\nTime\nChild in ...\n[noise]\nBuy a car crash a cry for a ...\nSo we're\nTo be back to\n[laughter] I Need a\n... a time\nOh\n... full\nName was named bound\nReading it and you\nTeach nine or\n... or you know\nA dollar a guy\nTries to me\n\n\nAround\n[noise]\n\n\n\nKnow we saw expansion\nTeam crime trials\nThe time they\nComments from the topic\nTrying to\nStretch [laughter] oh\n\n[laughter]\nTry to\n[laughter]\n[noise] he\nHe never\n\n\n\nRan out of\nA cold I'm not a\nAfter ... years back so you had a bad call\nCosts will hire you just got\n\nHow many times by [noise] on\nMan\nMan yeah\n\nNa\nThe great body scan is from his new album out in the blues new lives\nStumps and don't give us a year and it was me a dicey when we're older and gee bird uh-huh is it just didn't do welcome it's undercurrents I'm Greg and it's just a bum deal governor Buddy Guy and this is scrap of men gentrification\nShe [laughter] she\n[laughter] she [noise]\nWe [laughter]\n[noise]\nYou're listening to the Arizona community radio network an eighty nine point five FM AJC a direct Ninety point one at the end cage ACP rescue and Ninety point seven F. M. K. J. C. K. king\nRadio when to de do prayers this Saturday Pierre whatever you do\n[laughter]\nWhat does it it's\nThey're not funny they're not very bright\nAnyone ... Saturday they do not listen we weren't you\nSupport for the Arizona humidity radio network is provided by God it was all wear chef's very bar bench to prepare delicious legit deter Andres as exotic tapas for your body pleasure\nEnjoy the ... bar with happy hour weekdays live music Thursday or friday with jazz on Sunday three sixty was good when street in Prescott\nWe believe in family meeting in ... modern center\nEntertaining enlightening informative and involved Prescott public radio\nAll right it's a new currency agreement vicar welcome to North Mississippi all stars on the way Buffy ... Marie Christine and the queens from France but first here's Bobby Rush joined by blind dog smoking\nNa na na na na\nDown in\nWhen it comes to town and you can log\nCumberland [noise]\nShe'd been gone\nArises from\nA pound and you see in one way\nWriting [noise] hang on\nSign on and\nIn the\nI don't know how long will\nBy and\nShe\nIn [noise] and see in\nThe title of Colorado in a long\nAway [noise]\nHave a channel like\nPay him back\nIn the planning on\nVoting you\n\nIn the morning and\nNo cable TV didn't come I don't\nKnow anyone in law she\nHas\nAll the [noise]\nAnd long\nThing [noise]\n[noise]\nAnd [noise] I mean when\nIt comes on their own thing\nSame you know I'm a\nAll time low\nPay and\nNo no I mean the nine\nTo day long every\nNow\nAnd\nAnd and and now\nThat they've been\nOn it it can lead to come back we'll come back\nHome in time I mean can you know he's like\nDo do you know I\nThe\nBrave man\nOn Monday in\nMay\nLead\nBritain needs to be\nWith them and do\nThe\nMud\nThen I\nMaybe\n\nKnow who to vote\nMean\n[laughter] Mm\n\nYou\n\nDo\nDo\nCan you\n\n\n[noise]\nYou know\nYeah\n... ad ...\nDo know that at a bank and you've\nNews and the man\nIn\nAll the news during the boat leave but now\nNot out on is the\nAre you\n... [laughter] I Am both the St Marie and this is under current\nLaw I'm All right well I don't know\nI've been in many ways from cooperating women under ... around\nOne night investors that\nThe main road to read it on the bottom rung on like them say goodbye and on the line now\nNo guy and [noise] I [noise] I don't have the time I [laughter]\nWhen I got like I Would\n[laughter]\nGuy do back and I got on the television and the men that were twelve and can't say that NATO banned from South bend predicament as but things are preventing the tonic ... and then they enter rap\nNo long lines and [laughter] dollars during the guy and [laughter]\nWhen they found that I Would say no no no\nIn la [laughter] just to know and when that now that John Brown\nMen on the ball when I when I'm not dying every\nDairy and read and then again I'm older than very die by telling me you know\nDriving a tank we drive the banks you never need a new online\nKnow [noise] I Know yeah [noise] mine died in [noise] I'm not Amish\nYoung guy left them alone no\nHeard on the you know they just send them when they found it on the nano\nAre lining up behind a desk job than this dog and when that knowledge on the island is a no no no two\nDid I think that it's all over the day and writing at Comic Con matter is saying no no no\nAre now and I'm ...\nI'm a college town I end up getting mellow\nNo no no\n[laughter] no no no\nNo no no\n[laughter] no no no\n[noise] no no no\nNo no no no no one\n\n... the\n\nBoomers groups would be I'm Diane\nThe town ...\nThe brain\n\nThe man\nThe movies\n\n'em you served as\nEarly\nIn the\n\n...\nReason the plane jumps\n\nTo him\n\n\nCheese\nGoes out to get over that they want to you know what they beat him up on that amount that\nYeah yeah\nI think the adolescent\n...\nMy mom and my daddy I'm getting at the end NO NAME and then he asked\nThings that\nMy mom melon but not not what it's like when\nNear the end of the things\nVotes in the middle\nThe book and they said oh\nHave a job\n\nWell\nBeing\nMan\nSaying that they can monitor\nDon't know\n\nThe day the older\nI don't\nThey own that night\n\nThere are thirty in the market may need to\nGuy do their thing\nAnd all\nOh\nDon't\nAnd\n\nMy\nGuys do\nIt's to me is from the album sweet Jamaica buddy but you know that would seem you know group from Argentina two sisters and a best friend who has ... and his father John misty with the no from God's Favorite customer\nAnd groceries to mash and you're with Woodstock from the show to take you back to Nineteen Seventy okay doing okay wherever you are three or four years with the music recruiting men will go by coming up okay we're far Jim right now the ... brothers this is laughing or crying\n\nShe said she saw crews\nNearly terrain\nThere will learn\nMillion\nThings like that with a\nShe said she saw\nKerry and he\nBeing\nSad thing like that [noise]\n\n\n[laughter] [noise]\n\n[noise]\nThat suits on a you know with a cigarette to\nAnd that's that's not just the way they did that and what is it\nThen you miss the [noise]\nHe says stuff like that\nYou're listening to the Arizona community radio network on K Jay Z a painting I played by Drake K. J. C. P. Ninety One percent and kj became Ninety point seven king when [noise]\nThe AC already said are either up that that one hundred dollar bill you got an king but might be funny money Samantha ... Washington the state was arrested by the law they get a share of all those pepper allegedly paying for a meal will to counter read one hundred dollar bill cherub Japanese respond to do a business or the forty seven Hubbard block of highway Ninety five and kick butt\nIn reference to a reporter for fraud manager told responding officers that two subjects one male and female that purchase food and paid\nWith the counterfeit one number dollar bill to the editor indicated the employee gave a girl eighty eight dollars in trade contact was made with a girl and Japanese compared to build given to the restaurant with others found that the girls wallet sheriff's Barbara reports\nThat the bills had would have to be Chinese writing off limits being handed out there for bills examine at all the same cereal\nBought a county jail on charges of perjury and position for documents going from ... [noise]\nSupport for the Arizona community radio network is provided by came in regional medical center\nCare and see we wanted to make sure every woman in our community received annual breast cancer screening we provide free or low cost mammograms regardless of the income or insurance called the imaging center at six nine to two seven to seven K. R. M. C.\nSupplemental message was on the radio and said you know the Saturday pm that's supplemental you just said it right that the limit for sure yeah you have to do it like this [noise]\nAlso without limit on message\nListen to radio veto this Saturday him right here on the Arizona community radio network\nWe believe fresh air and garden it's good for you\nAt water very Center You're reliable source for local news and sports Ninety One point three FM Flagstaff months park\nHello I'm Mary in motion with the b._b._c. news the U.S ambassador to the United nations Nikki Haley has resigned she's to quit the post at the end of the year sitting next to the oval office President Trump told journalists except in Haiti is rising nation I'd had known if her intentions to six months\nHe's been a very successful you know governor of South Carolina\nThen she uh she did this and this is possibly even more and sort of gear just wanted to tell you\nWill miss you will be speaking all the time\nWill miss you number to listen to the job but I Want to thank you very well\nWith more his regime emerging often from Washington\nUses Nikki Haiti's resignation his comments a shock in political circles in Washington D. C. one of the most high point for women in his administration Nikki Haley was a trustee but sometimes vocal critic of the president\nHighly respected in Republican circles it's long been removed at the former governor of South Carolina have presidential ambitions\nAccounting is her resignation will wait question whether she's considering a challenge to Donald Trump today she said she wouldn't be running in twenty twenty I Will say wait behind the president\nThe south African president Cyril Ramaphosa has announced that his finance minister touched on many has stepped down he's been replaced by teach them but when he a former central bank governor who's already been sworn in the south African currency has strengthened countries appointment I'm some of the reports from Johannesburg\nCyril Ramaphosa said she received a letter of resignation from finance minister ... following his public apology last week in which he acknowledged that meeting with the embattled Indian BORN Group to read those costs the shadow on his conduct as a public office Berra\n... visited for my president Jacob Zuma controversial friends at their home and also says the group to brothers built an empire for themselves and the country\nBy acquiring highly critical deals from the government during miss deserve my nine year tenure as president Iran plans to issue coupon us we let a million of its poorest people to help ease the hardship as new U.S sanctions undermine the economy the electronic college would be used to buy staples including rice meat and cooking oil\nPrices have risen sharply as a national currency has plunged in value against the dollar President Trump reimpose sanctions opt he withdrew from the Iran nuclear deal in may the international Monetary Fund has food costs at the U.S embargo will drive around into recession\nNow I don't have democracy has taken a usual approach to recruiting men is this for the county new talk much\nHe set up a website and find any citizen the university degree to apply the how to indicate which ministry they would like to head I set out their ideas attacking the coup and it tasted so new to the latest round me from the BBC\n\n\nThat we know at\nMine and down but you know\nTo my mind was that the game you'll be\nTo do\nBack\nBill de\nWild land they don't\nRight here\nRight\n\n\n\n\n\nMe down and have that on\nThe other end up being a known\nHave you found the\nRight to burn in an hour and a half and all\nWay they are saying that and I'm a parent\nWhen we're in a bad guy down now I don't do the ratings are real\nBad and they have their own\nRight down to money around\nDon't\nI don't know\n[noise]\n[noise]\n\n\nYou're going to do wrong you're wrong right that's a double makes three for back in two thousand nine and a kind of a fun way to start another hour you're on the bridge on board or radio just the program or like the rich together blues bluegrass unfold could rock\nBuying a brand new song it was one of my knowledge on the\nBy than John the nightmare again on Monday\n...\n... ...\nThe ... no ...\nWas when I was gone the ...\nOwn days for a job\nA nice no one can I get a job\nWalk [noise]\nHow did you ever get a job\nWide and all but I don't know how they do\nWalking down the John again down a lot\nTerm in order to get a\n[noise]\nOr not I have [noise]\n\nDown\n\n\n\nNa\nThe\n...\nAre they na\nNa na na na na na na na na na na na na na\nNa na\nDa da da\nDa na na na\n\nA\nGo in a\n\nAnd I'm\nA I'm a a na ...\nBy their today and I knew\nDe yah ...\n...\n\n...\nNa na\nNa na\nNa\n\nNa\nNa\nNa\nNa\nNa\nNa na\nNa\nNa na\nHey\nThat's a new bad for me they've actually been around for about ten years now they're called the ... knots and that's a track called tried like my views as we continue with the bridge here on board or radio we are Thirteen ... am and you also heard across the Arizona community radio network\nAnd we loved discovering new bands we heard pure green before that would cowgirl deep Matthews band as a new album out called come tomorrow we heard summer I cop and we started that set off with my last may and Jeff hard with motor way hotel\nHe we hope you can stick around we going to take a short break as we do we promised they will be no commercials and uh\nWe had a wonderful pledge drive last week where people pitch tend to make sure we would never need that funds we would get from commercials said thanks so much to everybody who pitched in during our pledge drive it's not too late if you want to get involved you can always give us a call at eight seven seven eight three eight five to nine to\nAnd the seven Seventy three eight five to nine chore but securely online at border radio ate the dot org\nWe didn't take a short break and we'll be back with me she from green tea and Rachel\nBorder radio is supported by the human county chamber of commerce an advocate for human community businesses the chamber provides promotional opportunities including website directory and map listings as well as wide promotion networking and sponsorship opportunities learn more about the benefits of chamber membership at human chamber dot org\nThis is Thirteen twenty and border radio ... than border radio a seatbelt or a service of Arizona western college for more than forty five years\nWe've got new releases from Kevin\nSinger Katie bells\nAnd he'll rivers and lots more\nEasily than they\nReally are no\nThis is Brian do some inviting you to join me for a new release to the\n[noise]\nWhen the evening at I'm born and raised in their teens twenty and\n\nYeah yeah he\nMay\n\nWork on their own da de\nNa na\nAre now but when\nNa\nSaying we're over there on the day that uh\n\nThe money I\nWay I\nMean\nI Know\nMan oh man I\nAnd man made\nAs a\nI may have been on the\nOn the day that\nThere all day\nJunior in the ramblers choice with the story of the day that I died title track went out and they put out back in twenty twelve as we continue with the branch here on board or radio before that for life is fine now that came out last year from the Australian artist Paul Kelly weird rising move\nHunger is a track from Florence in the machines brand new release called high is hoping we started that set off a great scene Rachel and radio version of there's some go hey we've got to go take a break but we'll be right back I've got more music ahead including some music from Judith in the light so you'll stay with us\nWe're radio is supported by prison he'll Brewing Company a locally owned a restaurant and craft brewery on main street and you must historic downtown ... alike are invited to remain themselves to join the prison held population for a memorable lunch or dinner Stan featuring the wide range of menu options and craft beers more about prison held Brewing Company on Facebook\nVicious\nThirty twenty am border radio K O F F and order radio a beat out or a service ... Arizona western college for more than forty five years [noise]\n[noise] Hi I'm ... one of the ... program called crossing borders on board or radio Thirteen twenty am a new ...\nJoined us every afternoon from three to seven where do you make some music from around the world right here in Arizona but you'd be heard on the Arizona community radio network and you can stream of the cage WC dot org or\nOn the radio aspect\nJust search for Kenya west they\n\n\nAnd when they\nDie in\nBut they generally hang\nMan you can't buy yo\nThe case or what do\nWas an Avon came Jay themed only back no\nSkills\n\n\n\n\nFriends die well\nWhat what's going\nOn\nMe and my God\nThe I should not only do one\nDay to day here and there was the thing I Know how\nThey feel that the boy\nLittle bit\nWhat\nI'm\n\nNot sure I don't know I Do not\nHave a very\nYoung\nAnd\nLot about it\nFor\nOr what I read about it\n\nNa na na\n\nNa na\nNa na\n\nNa\nNa na\n\n\nNa na\n\n\n\nNa na na\nMore than men\nThe bad guy and\n\n[noise]\n[laughter] [noise] [laughter] [noise] I mean for me [noise]\nYou're listening to the Arizona community radio network on eighty nine point by that time cages EA Drake Ninety point one of them K. J. C. P. Preston an ID point seven F. M. K. J. C. K. can\nUse number on it I'm first [laughter] All right here's one\nWhat is radio in San Diego well skits saw satirical news it's been a whole lot more to join us for radio on Tuesday or Saturday at eight PM\nSupport for the Arizona community radio network is provided by\nMartin's funny Chrysler dodge cheap ram and key at twenty six twenty east anti divine in Kingman you can depend on ... mind selection of new and pre on cars trucks and SUVs or quality cars and trucks really do cost less see in the terrain shop online acumen dodge dot com we believe in the golden\nWhat is very center community radio and the world news northwest Arizona Public radio Ninety point seven FM king\nAlright it's on your currency Greg vicar welcome at the north Mississippi all stars on the way Buffy ... Marie Christine and the queens from France\nRush joined by blind dog smoking\nGun na na na na na\nPounds ... pounds and\nThey don't come in and talk\nCome down and\nYou could have been gone\nOr write\nOn a cat on Shanahan away\nWriting\nCan actually you know when\nAround and come back and\nIn back\nIn the last ... years election\nAnd women in law has been a lot\nAnd\nTo see a lot\nMine I'm back in time and seeing the hill\nAnd the caller I don't mean that would be along\nOr have somebody that you know I mean you\nIncome\nReally get down to the gym like\nPain he may have been looking back\nI mean in my in my lifetime or go\nBack home and and\nAll of the time\nOr even paying them and\nSee a stable way no period and come home and living in la poma\nAnd working in a pan and\nLast ... or anything I can\nIn and\nAre wearing their own thing and I'm going\nBe doing that work in the in the late\nOn and\nThey didn't say I'm a\nThing and\nCan say I'm about\nOn and on and\nDo\nAnd do you notice the guy\nCare and nobody in the long\nWe'll get\nBack on that\nDay she came to town\nAnd you know\nRelated to come back and review of combat looking and looking back from combat\nHolding on to me when I'm having trouble when I can tell like\nYou mean do do do you look at me\nThey may\nThat the\nBest man he\nWhen they need to be\n... into\nThe mud\nThey do that\nDoes\n\nI Know\nWho to vote\nMean you know\n\nYou want\n\nGo\n\nCan you\nShare\n\n[noise]\nYou\nYeah\nMarry a ...\nMan yeah\nNa na\nNa na na na na\nNa\nNa ve\nSays do not during the ...\nNot out on is\nYour your\n\nHi embassy St Marie and this is under current [noise]\n\n\nGuy bin ... Ron Paul bringing them you know and me when I'm Around\nLearn what night investors that I\nDidn't make rules they read it and not\nI like them to come by ended only lanes on\nThem and [laughter] you know [laughter] and [laughter] when I\nGot like I was\n[laughter]\nDie and go back and it got there they download and a man gets Britain where we can't stand in line for them in the end but things are going to be in an indirect\nLong lines and [laughter] dollars minded and [laughter]\nWhen men holiday times I Would say no no no\nJumped in\nAnd when that Ramadan ballet ...\nMen tend to do when I'm not I'm not\nIn your bag and even GM all been buried I I've been telling the girl I was driving\nA tank driver and the banks you never need you almost\nGuy and [laughter] I Know in [noise] in Bahrain and [laughter] and I\nFound I read that no no no\nJust to\nHow they found it on the nano\nAre lining up behind a desk job and this dog and when that knowledge on this thing not\nTo power in the middle of the day and Britain that John and John Madden said no no no\nOur ally may end up and then the um [noise] I mean when I finally found I end up saying no\nNo no no\n[laughter] no no no\nAll I don't know no no\n[noise] no no no\n[noise] no no no I'm just\n\nThe\nBeep\nBeep\nBeep beep groups would be I'm Brian\nWhat do you do I'm sure you mean being\nThe the brain to\n[noise] ...\nMe\nThe ...\nNa\nPast being\n\n\n\n... Bob\nThe plane and the bottom\nHow\nTo once in\nLong movie [noise]\n\n[noise]\nBeat him up on that a man you know that\nThey do they get they get on\nYeah yeah\nNot\nBeen but I'm not on your mind body I'm getting the yeah I Know I'm not out there\nThe mountains but not not like one\nI didn't they yeah they they they yeah\nDa da da\nDa da da da da da\nDa\n\nOh\n\nMy man\nFavorite thing in my\nKnow\nNow\nThe old that I don't\nThat's nice [noise]\nAnd done like he may have to learn\nGuy the guy in the\nOld\nGuy go\nOh\nNo\n\n\nA\nI Know\n\n\nIt's Mr Vegas from the album sweet Jamaica where do you but you know that would seem you know group from Argentina two sisters in a in a best friend who is who who do and it was rather John misty would be nice for God's Favorite customer\nAnd Crosby stills and Nash and you would would start from the show who take you back to Nineteen Seventy ... if you're doing okay wherever you are breeder for you with the music recruiter and then we'll go bug coming up ... far Jim right now the ... brothers this is laughing or crying\n\nShe said she saw crews\nNearly ...\n...\nMonday we're missing her\nDance things like that all the\nShe said she saw the\nHe\nHer\nLike that\nNa na\nNa\nNa\nNa na na na na na na\nNa na na na na\nNa na\n\nSays these arms angel ...\nAnd if that's not just the way that is that what is\nThen you listen [noise]", "year": "2018", "show_name": "no_show", "city": "Kingman", "day": "09"}