{"month": "10", "state": "AZ", "station": "KJZK", "content": "\nIt's this border radio K O F e Yuma searching twenty am and where do we do is eat that Oregon a service of Arizona western college broadcast on the Arizona community radio network at eighty nine point five FM change easy a drink William Ninety point wanted them to do the ... get\nNinety point seven F. M. T. V. C. K. king that\nYou're listening to the Arizona community radio network on eighty nine point five FM pages the trick Prescott Sally Ninety point one F. M. K. J. C. P. Prescott Chino Ninety point seven F. M. K. J. C. K. Kingman Boulder City Nevada and translator came to one Seventy five bucks a month to park\nAt Ninety One point three FM\nSupport for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feed them right out of your hand see hundreds of animals that elk buffalo boroughs camels Kuwaiti Monday kangaroo llamas Rainier and more the Grand Canyon deer park near William\nSupport for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of Williams on interstate forty walk him on the deer feed him right out of your hand the hundreds of animals that elk buffalo boroughs camel cool watching Monday kangaroo mama's Rainier and more the Grand Canyon deer park near William [noise]\n... [noise]\nThe same suit can\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise] [laughter]\n\n[noise]\nCould [noise]\nThey don't even try\nIt on the\nAir or read\nBest\n\nFor the most\n\n\nFriends\n\nAre there having fun or watch wow they come roaring ... too don't they they are Dan Morse than on vocals with joy deep friendships go on Oregon Dan Wilson guitar Michael load on drums and Troy Roberts on Turner with every day I have to blues\nThat's from the CD gold you're driving me crazy what a great combination than worse and enjoy the Francesco what they got together\n\nHi you're listening to jazz with Dave swan hope you're doing well with dark pleasure to bring you all of this great American music Bobby Watson and his sex stepped up next from a CD called jewel and the Tunis called calorie da\n\n\n\n\n\n\n\n\nNa\n\n\n\n\n\n\nAh ... ...\n[noise] [noise]\n... ... ...\n\n\nL\n\n\nMm\n\n[noise]\n\n\n[noise]\n\nPerforming in Vancouver British Columbia\nThe spike lunar trio and little girl blue spike on piano tiger Mitchell on base and Anthony ... drum spring the CD called ... do lease and before that\n\n\n\n\n\n\n\n\nDe\n\n[laughter]\nAnd are\n... ...\n\nFrom\nMarch twenty fours a Nineteen sixty in Copenhagen, Denmark Miles Davis with on green dolphin streak of course miles on Trump or dead John Coltrane on center went to kill a piano Paul Chambers on base Jimmy cop on drums no mistaking that muted trumpet is there\nThat is from before CDs that gold Miles Davis is John Coltrane the final tour the booth like Ceres barge I'm six three concerts included their Stockholm, Sweden Copenhagen, Denmark and her sprint\nYou're listening to jazz were they won the Johnny O'Neill in a tribute to the lawyer smoke it's too cold we mock\n[noise]\n\n\n\n\n\n\nNa na na\nNo\nI'm listening to the Arizona community radio network on eighty nine point five FM can't Jay Z a Drake Prescott Sally Ninety point one at ... Prescott Chino valley Ninety point seven F. M. K. Jay Z cake Kingman Boulder City Nevada\nAnd translator came to one seven ... Flagstaff month to park at Ninety One point three FM\nThe king the center for the arts is a nonprofit company committed to promoting the art thinking the group is renovating the Beale Street theater which will be a Center for culture creativity and\nCommunity if you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary and Valentine, Arizona thirty miles east of ... historic route sixty six she over whenever jeopardy by rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day now divided up Tuesday historic route sixty six alright\nIt's under current and Greg here it's a pleasure to be with you and I've been picking up some music I think you're going to love for mark ... trips starship\nAnd this from birds tree Benny\nIn the lead the\nAnd your brain\n\nYou said ...\n...\n\nNa\nNa na na na na na na na na na na na na\nNa na na na and\nBy you will ...\nNa na na na na\nNa na na na na na na na na\n\nNa na na na na na na na na na na na\nYou know\nNa na\nNa na\nNa na na na\nNa na na\nNa\nNa\nNa na na\nNa na na\nNa na na\nNa\n\nNa and\n\n\n\n\n\n\nNo\n\nSure\nNa\n\nNa na\n\n\nNa na na na na\nNa na\nNa na\nGod yeah na na\nNa na na\n\nNa\nNa na na na\nNa na na\nNa na na na I'm Wondering what was the main main crank trying I remember my mom died on man\nOn the way I Want to get married right after I saw\nAnd\nNa na na na\nNa\nNa\nNa na na\nNa na na na na\n\nNa na a\n\nI don't know I Want\n[laughter]\nNa na na na na\nNa na na\nNa na\nNa na\nNa na na\nNa na\nNa na\nNa na\nJust as we can end is what you end up your ... from the nominee they saw the goal of hundreds girls from Austin, Texas\nHi anywhere near as I said oh\nGirl and it's got her a little bit of a low low over the rural and you're listening to under God under current\n[laughter]\n\n...\nI'm\n... ... the ...\n...\nLet the young man the well\nWhile the\nSurvey and then you\nTo turn around the\nUm yeah they instill\nCalm\nWhen you when\nIn the fall is\nAm I mean you don't have\nA map you know I'm In my family the family\n[noise]\n[noise]\n[noise] [noise]\nWho\nDidn't get all of them turned us around featuring Steve Earle which has merit Marjorie both from his new album songs that resistance Nineteen forty two here on under current retirees with the uh\nHow's it going to see the eagles but really it's a gun handling piece that he does a solo album and Mickey Free Cherokee blues man angels in the room\nIt's undercurrents I'm Craig McGregor really thrilled to be with you and how we're going to enjoy the music of Kuwait Marty balance of the Jefferson Starship just an airplane\nMore than\nOh\n\nOh\nOh\n\nOh\n\n\n\n\n\n\n\n\n\nOn the old days the army\n\n\n\n\n\n\nChannel on\n\n\n\n\n[noise] sure I'll\nTell you that the coronary so that some of the parents out there to say hey kids\nI was in the way back in the day\nBefore everybody craft or work with trans Europe express remember that one yeah\nWith taste and it was just in starship Mardi balance on both coasts and he wrote disarm you as well as some other really profoundly beautiful blob socks like coming back to me today from surrealistic go right down\nThere just joined just welcome to send the currents and Greg with Victor indigenous on the way and this is Jake and get\n\n\n[noise]\n\nNa ve\nThe\n...\n... no\nThe the\nTeam and he\nShe [noise] she she told\n\nMm\nMm\n\nYou're listening to the Arizona community radio network an eighty nine point five ... ... Ninety point one of them cages eat the Prescott a Ninety point seven F. M. K. J. C. K. king the king Center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the Beale Street theater\nWhich will be a Center for cultures creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nArizona the drive through wildlife adventure park in Williams, Arizona view by should mountain goats bighorn sheep and black bear on the safety uncovered of your private vehicle or travel go watch playful Barrett cubs up close at the end of your to Arizona like forty at highway sixty four in Williams, Arizona dot com\nBy the public radio programs you enjoy that and for middle aged editor date logo due June in radio dot com that church ... at the Arizona humidity radio network that looks at any time on your smartphone\nWelcome got best girl athlete on the way and vocal sampling from Cooper Freddie eagle Smith Kurt Vile and just to collect to mix music coming up so I Hope you'll stick around Houston or otherwise noticed cat Stevens here right now with gold digger\nThen to go man\nDon't use the go man\nVe to them and\n\nCan join the body sci fi or not to the gym\nPaying those are\n\nAnd then the\nI Know Mariner Mariner\nMariner Mariner na\nNa na na\nOn the union who\nIn there and\nAnd cheese\n\n...\nUm\nHere that\nCan bring lily\nAnd I know what they're saying that they are in\nA yo yo\nDa da da da da\n\nDe\nDa de da\nDe\n\nLa\n\nDuring the day\n\nDe\nDa\n\nTrying our than anywhere\nIn the\nI'm\nIn June we're\nThe\nMean I have\n[noise]\n\nTeach teach teach history\nShould teach teach teach\nHe he\nHe he he\nHe\nYou know if you're you\n\nAdult\nCalled change your name again\nTo the young\nMan\n[noise] [laughter]\n[noise]\n[noise] shit ...\n...\n... ... if you move\n[laughter]\n\nGosh\n\nMm\nAbout ...\n...\n... [noise]\n[noise]\nYou found that we did you\nHear jogging\nOut from a\n\nHuh oh no no not a\nMan\nWay now\nI\n\n\n\n\nModel model I'm going to go down to own a gun or what I mean I Know don't get any hungry now among or not but he made up your\nOn that or not so on but I don't care about them and I\nBack to the man\nHumble\nOn so long\nOn on I\nOn a few man\nI don't\nNa na\nNa\n\nTry to strike here we're sitting here listening to honor courage\nRight tutor and that will go bond with each other they succeed for the Grammy Award winning album mambo Cindy window recorded\nIn Nevada\nAnd it was an American pop to guard just super catchy and beautiful commute come into with China\nAnd even though there was all over the airwaves especially in places like Miami\n... when I was in my hotel room in\nVancouver with my little tiny radio chemical station just going to show that that too is sharing is still going on musically these undercurrents were sharing music from\nColorado America and around the world in both directions that's why they call it American music with a passport was from the Native American nations back and forth with everybody wants to cross the influences\nGot a group of Canadians are one Native American coming up the band and right now Charlie muscle why this is a good one in fact it's finger licking good\n[noise]\n\n\n[noise]\n\nWe think of what can be enjoyed although there's a plane was waiting for you\nUnder current radio dot net sure number forty seven Seventy eight or if you like to just have the players come to you automatically every day you can just follow us on Twitter at on the couch and then we'll be right there on your feet each to\nWant to thank our team go the other costs along Christina honest that in general Yuri agreement bicker and support comes from the corporation for public ...\nYou're listening to the Arizona community radio network on eighty nine point five okay Jay Z a trick Ninety point one at Penn kj repeat Prescott a Ninety point ten minutes I'm K. J. C. K. king the king the center for the arts is a nonprofit company committed to promoting the ... the group is renovating the Beale Street theater\nWhich will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary in Valentine, Arizona thirty miles east of ... historic roof sixty six to ... rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day now divided up Tuesday historic route sixty six\nBy useful information all the public radio program that you enjoy that inform entertain educate and didn't like it was a link to or lie Web stream at kj Z. A. dot O. R. G.\nKaradzic turned to currents I'm Greg McGregor hey what's going on a new music from Mumford and sons coming your way father John misty Tim O'Brien and let's go back for years now and this one from John arbitrator\nOn CNN I Know\nIn a very right in my will be\nYou know\nI Need to call the ... hour was changed my mind and\nHang on my\n\nTell you what do you do that on\nMonday when the banner mouthing\nOn them and I'll never get everybody tell me\nAnd I'll never get it and I'll never get to\nKnow\nWherever they\n\nWant to get you\n\n\nOne thing you know let\nA ... year I\nDidn't drive you when I\nThe capital drawn from\nReading on edge revealing about\nHim and then my living on\nThe news on that was good in Alabama gets ...\nAnd now let's get\nBut she no no no no\nAnd they\n\nDon't want to get\n\n\nOne you know when when\nI Want to see when the new one day some looking right I Want to be when the dead of night then that Don and on\nAnd so\n\nAnd you know when when\n\nCome on man\nYou\nHe [noise] he he he yeah\nWell no no [noise]\nYou just\nWant to change you know when they show you\nOr do you have\nThese days but I can\nGoes on here [noise]\nMm\nBut do you\nThe\n... you know I'm\nYea\n...\nYou\nReally you know\n... do you know\nA young man\nNa na\n\n\n\nNo\nAnd again she\nYeah na na\nNa\n\n\nWhich\nMy mom\nAnd\nI Try to bond to bring\nSit down and we'll go down the\nGraves there during\nDream bowling may not\nLike\nAre nine and ... and her\nRan ...\nLast minute\nYeah\nThey play the jury is in the\nDa da da\n\nNa na\nNa na na\nNa\nNa\nNa na na na na na\nOr ... in\nThe world on jobs get the job\n\nScam learned as Dave tree and the\n\nOf the stand and began to deter them\nSame thing with the parents being being the only state in the studio\nOn and on\n[noise]\n[noise]\nWhat's gone gone gone up all night and maybe they want to know when you dig the\nBrother\nTo talk about the centerpiece of the guys coming\n[laughter] [laughter]\nI've got another and you won the big bang theory in Europe ... came to the doctor you\nOf changing the joy\nThat but thank God\n\n\n\n[noise]\n[noise]\n\n\nNo\nAh\n\n\nLeave when\nThink I don't\nShape\nKnow can you see the\n\n[noise]\n[noise]\n\nI'm James ... do you need a car\nBeing a man and na\nNa na\nNa na na na na na na na\nAway and I share\nYou know and\nGot around to\nThe last time around\nMe and I mean\nAnd I\n\n\n... ...\n...\nThey do now in\nKnight who's ... who's ...\nYou think God the ... the new learning gun but not for the\nWindows and then let\nJohnny ...\nLet's just do my ...\n...\nWithout ... as\nBad as though the\n...\nNo ... well\nThe the ball and then a\nGo ahead and\nDo my one dead\nEnd to the super bowl na na na\nDo not ...\nYou know need would get\nTo not be able to go\nUh the the ... but he\nDid in the mid\nWhen he sees\nThe people that he knew\nAnd they didn't know what we're\nMaybe the ...\n...\nKnow every country has music that speaks from the soil or that country in America probably be the balloons and\nEnforce it go farther\nMusic and that's what I was right there I'm Tony resemble wear a coat such a child though ... pretty bleak I don't know it's funny it's on the record label feet by profile though\nFootage on this is where that would be nice for God's Favorite customer his new album\nBefore that from the u._k. was a KUOW recently making appearances had the sasquatch festival in Washington and outside land\nIn San Francisco and he was elected go cussing was wondering if you just joined just walking was undercurrents I'm Greg and you haven't missed anything there's a lot more music to go from Carter brothers and this from Tim O'Brien with a Bob Dylan song on under current term\nThing is broken\nThe dream job they own\n... things broke ten\nNa\nNa na manager\nDollars I can\n\nIs broke\n\nJohn you may\nOn NPR\nOh God yeah we have a wonderful team cost a lot of trust you know understand when you're working hard behind the scenes or Greek McGregor and support comes from the corporation for public broadcasting and and the one station George W T I are\nIn Brighton Florida to chew GOP in Gallup New Mexico and is this need to voice why\nThe Native American radio network\n\nYou're listening to the Arizona community radio network on any nine point five FM okay Jay Z a trick Ninety point one of the cage ACP rescue and Ninety point seven F. M. K. J. C.\nK. can support for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feed them right out of your hand see hundreds of animals up close elk buffalo boroughs camels Kuwaiti Mindy kangaroo llamas Rainier and more the Grand Canyon deer farm near Williams\n... humidity radio network is provided by God it was you were shift very barb edge to prepare delicious lunch or dinner Andres and exotic tapas for your body blows you enjoy\nThe ... bar would be our weekdays live music Thursday and friday with jazz holds on day three sixty was good when street in Prescott [noise]\nCenter entertaining enlightening informative and involved Prescott public radio\nI ... a great music or how you doing music from ... years ahead my little green the option to Norway and we had to kick it off right now with an addition is Australian singer songwriter Emily ... na\nNa na na na na na\nShowing that the ...\nNo I'm\nNa na\nWell the main non God\nThat show the Saturday ah me\nAuntie I'm In San\nJuan maybe and and then the\n\n\n\n[noise]\n[laughter]\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise] ...\n\n\n\n\n[noise]\n[noise]\n\n...\n\n\n... well ... ...\n\nOr ...\n\n\nFollow\nHere and learn how to\nBut I think I've been married a\nAnd the dean of the day\n\n\nTo the East Bay\nHunting in east to\nI Do remember\nNa na\n\nNa na\nOr ...\nManaged dream in\n...\n...\nI\nDo not use\n... ... and I\nThen there\n\n\n\nNa\nNa\nNa\nNa na\n\n[noise]\n\n\n\nRecorded in New Orleans Ravi robbers story do when they were the album she does tell from the ... people in Mali Africa to Norway\nBefore after me up with my boss of cool\nAnd it was the honestly believe it or not all that sound just two people you need is playing bass with all kinds of circuitry on his doubles in ... the sound and placing blame the jobs\nAre nice see on some of the nation and then I can find a like a woman\nWhere else are you going to hear that was on the radio on all you want to hear it in the mall playing over the\nSpeakers near a ... year so we're really glad to be able to share it and everything else we do here with you on ... and thank you for listening you telling your friends about Wendy in your support will some sort of like some of the way right now let's turn the music of money on under current [noise]\nOut what's going on among not by working\nAnd not being game up as going over and bring a lot to be enough to make\nThe weather here we are not up down I'm from the people that you get ... I\nThe winner of Andy ... and\nTo be a number of legal greatly were not being mean\nAnd even the the down\nDon't do much now\nWe know please go to mark it down\nAnd be game up early in the ... the baby in\nDoes he mean and meet\nCame up late for me I\nAnd losing big down on\nYou may not come\nDown either Germany locked up in my own mind and\nLot to be in my PIN number ... ... a big\nDo you what\nMade whether or not calm [noise]\n\n\nAnd the scene is native voice won the Native American radio network\n\nThat made a lot of mistakes I made almost every mistake you can make it as a [noise]\nI'm Jeff Shaw so we need to use it\nMusic highlights ... question asked\nKnow\nYou're listening to the Arizona community radio network an eighty nine point five K. J. C. A. Drake packet valley Ninety point one K. J. C. P. Prescott\nChino valley Ninety ... salmon K. J. C. K. Kingman Boulder stating that and on translator K. two one seven ... park at Ninety One point three FM I'm\nThe guy English Revolution call your attention to a shrinking asset in this country can never be replaced and now they are our World War two veterans\nBut according to the U.S department of Veterans Affairs and the only about a half a million up to sixteen million Americans who served her alive\nThey estimate about three hundred and sixty two dying every day [noise] these brave events literally gave it all and they're often referred to as representatives of the greatest generation [noise]\nI'd like to suggest that we all take a moment\nA World War two veteran children thank you for asking your friends and co workers\nIf you don't have a veteran and your family\nThe message from the national World War two museums some [noise] there's no time ballooning we need to thank the members of the greatest generation their sacrifice and service to the\nShow the world what they mean to\nTo learn more\nCheck us out of the kindness revolution dot net\nSupport for the Arizona humidity radio that bridges provided by the yeah the humane society caring for over three thousand animals large and small each year and inviting you to be involved as a volunteer financial support or or a doctor it's many programs include a low cost ... clinic thrift store and at coin Center for\nAbandoned abused horses visit the website that you have a pie you made that work\nSupport for the Arizona community radio network is provided by Grand Canyon deer farm eight miles\nEast of Williams on interstate forty walk among the deer feeding him right out of your hand see hundreds of animals up close elk\nBuffalo boroughs camels collecting Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near Williams\nAnd it's been instance sometimes you know she reports the conference but was billed as the show to peace with the ambitious economic reforms of the Saudi crown prince Mohammed bin Salman is in disarray\nWill the photos of keynote speakers for three days have been removed from the events up stream of speakers and stones has pulled out in the past week despite the risk of losing Saudi business first major organizations and corporate cheap so now perhaps most significantly took government officials [noise]\nSo now the the U.S Treasury secretary Steve Mnuchin has not yet made his decision\nDonald Trump has threatened to close down America's southern boot if Mexico does not stop Central American migrants are making their way to the United states\nIn a series of tweets he describes thousands of people trying to reach the U.S to escape poverty and instability as an owns Lewis led by the opposition Democratic Party it's a Trump has already threatened to kind of aid to countries who fail to stump the migrants\nThe Ethiopian prime minister I'll be ... says hundreds of soldiers who much to his office now tweak intended to abort his reform program and posted they to kill him ground ferret reports\nWhen more than two hundred soldiers to end up in the grounds of his office and that has happened but last week demanding a pay rise the prime minister adopted a noble response he promised to hear that case but insisted they do tend press helps for not following normal procedures\nLaundry in question in parliament as I said what appeared to be a relaxed and counter could've punched Ethiopia into chaos if he hadn't handled it carefully he said lives could have been lost\nSince becoming prime minister and April is that these are the scene a range of reforms including normalizing links with a trivia and freeing thousands of political detainees\nIn do hardliners in southern India angry at and Supreme Court ruling allowing women to visit the famous temple in the state of Canada have clashed with police and the second day of funds from Denny has to be in a group that\nOne will try to end the template today in the morning she wasn't able to complete the Johnny because I thought that a lot of it is really just that the\nHave decided to the end for these women some of\nHave been afford it they try to help women find them see the stretch it so they can but the mindset that the man had challenged in court and one box now even the state bonuses not being able to control the mall which is just growing\nAnd that the mind is that it's up to ... and it should not be changed\nWell news from the BBC\nFor ... a double you see news in Yuma and can drown sent\nIn a small town just across the border from Arizona migrants hoping to cross into the United states have taken it upon themselves to build a shelter for rest in preparation before making the crossing from kj feces from terrorist asking Irma CEO senora Murphy what House report\nLast week several dozen mostly hunger and men held at work swinging picks cutting rebar in digging foundation trench is at the migrant shelter in some of the week the Sonora\nIt's the only one in town and outgrew the rented a house that served as the shelter several years ago now it's the migrants themselves building an addition for those that follow in their footsteps ethical man it's all in um it's called a bit in court\nOne of the shelter coordinators she says it started with just the fence sense than tents and trailers have added to the migrants have a good place to be on their way north\nRecently mess of groups of mostly Guatemalan men women and children have been turning themselves into us border patrol agents near soon will eat them in contrast to most of the hunger and men at the shelter will try to the border patrol agents\nFrom animal seal Mexico I'm Murphy what House\nFormer Maricopa County sheriff and Republican candidate for the U.S Senate chore pile has sued the New York times in one of its columnists claiming coverage of him hurt his chance at a future son of Ron\nLawsuit was filed this week in us district court in Washington Arizona Republic reports so pile seeking more than one hundred forty six million dollars in damages\nColumnist Michelle ... wrote the article are piled claim to fame salmon presented his record is Maricopa County sheriff you know false slight or piles says the article damaged his prospect\nWith the Republican National committee and damage to his ability to run for Senate began in twenty twenty four K. A. W. females in Yuma I'm Jim drunk\n[laughter]\n[laughter]\n\nJob I\nHad\nMan and then when I Am [laughter]\nI\nAm [laughter]\nI'm all\nRight\nYeah I mean you really see my\n\nGod oh\n[laughter] [laughter]\nAnd ask her dad [laughter] coming\nMy dad [laughter]\nAnd\nCome from\n\nMan who came\n\nThe time [laughter]\n[laughter]\nYeah yeah [laughter]\n\nThe millionaire now\nSide now [noise]\nAn avalanche long\nMuch on my\nWay or\nBad one\nAnti role\nAm\nNa na na\n\nNa na\nNa\nNa was the way I Am a key ally ...\nOh that's a fresh found out on a Thursday morning that's been out of Australia called sons of the east from their twenty Fifteen release already gone that was my repair as we continue with the bridge on the border radio K O F faith or ... am in your mouth and they very glad to be with you before\nThat the ban delicacy oh did anybody water we heard out of the rain that the ban that did since you've gone and we started that set off with I mean house and uh they're released from last year called and\nHe would like to mix you got a lot of different kinds of music because we're a public radio station we can we're not stuck to just one John rough and we're going to continue to do that as we move through the morning coming up after a short break we got music from Holly cook so stick around\nThe ... to ... will be presenting a performance by Scottish singer songwriter Jim Malcolm it'll be next Thursday evening October twenty ...\nAt trinity Presbyterian Church which is located at six thirty Park Avenue in Prescott it'd be like more information you can reach us that eight seven seven eight three five to nine to\nWhen you can't get bored or a youth Eighteen twenty eight and ... on your radio catches on line that border radio ac dot org or you can use to tune in at ... ...\nIn Flagstaff mostly sunny today high near fifty one east when three to six miles per hour tomorrow sunny near fifty four Prescott has sunny skies and the highest sixty three today some of these guys with the high near sixty six tomorrow\nNa na\nNa na na na\nNa na na\nNa na na\nNa na na na na I'm a\n\n\nHelp my no\nWhy they would not you can't let you know\nThat's an old time is out there from the ... de la may with letter from down the road as we can take it with the bridge I'm bored radio before that Ashley Monroe did wild love\nSmall towns talk is one of my favorite track that song written by a Bobby Charles and we heard the version recorded by Shannon McNally and she got some help from Dr John on that track are starting to set up with Holly cook her new album is that's a love love but we heard the tracks stay alive\nAnd hope you can stick around as we continue to bridge here a border radio I've got some Tom jones coming up and we'll start the next set with some Henry\nHope he can stay with that Arizona was in college will be hosting a CPR first state certification class with instructor Joanna Eliot\nIt'll be the Saturday October twenty from Ninety into one PM at the aid that we see Jim which is located on the east side of the ... if you'd like more information you can give us a call at night to wait three or four seven six nine zero\nThis is Thirteen twenty I'm bored or radio\nBorder radio is the dog or a service to Arizona was in college are more than forty five years\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and re beard publications in the world doing K. A. W. the and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five to seven and St Paul cultural center\nBring formation visit K. A. W. C. dot org ... made possible in part by a grant from Arizona humanities\nThat\n\n\n\n\n\nShow called on your name I'm\nTrying\nTo calm\nDown maybe not [noise] too much\n[laughter] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\nDay by day [noise] and then I\n\nTurned on the map [laughter]\n\n\n[laughter] na na na na\nNa na na na na na na na na na na na na na\nNa na na na na na na na na na na na na na\nNa na na na na na na na\nAnd they and they drink and na na\n\n\n[noise] [noise]\n[noise]\nNa\nNa\nNa\n\nNa na\nNa na na na na na na na\n\nNa and\n\nOn his\nAnd\nWhat no\nNa na na\n\n\nNo\n\nStretch out and I\nAm\nThe same time that the\n\nNa\n...\nNa\n\nNa na\nNa na na na na na na na na na na\nNa na na na\nNa\nNa na\nNa na\nNa\n\nNa\nNa na na na na na I'm Wondering how were the ... river Iron Man made great time to remind\nMe through a God or on on their wind down our\nNumber one on your guy\nCan\nNot get\nThem and na\nNa\n\nNa na\nNa\nNa na na na\nNa na na na na\nNa na na na na\n\nNa na\nNa na\nNa na\nNa na\nNa na na\nNa na\nNa na\nWith the Internet is what you end up being more well from the nominee they slogans all hunter was ... from Austin, Texas\nAnd the other hand I got all\nGr frame of cardinals are a little boy was the rural and you're listening to underground under current\n\nYou\nWhen\nI'm In ... in the ...\nNow\n[laughter]\nAll live on raising the well\nThe while the\nSurvey and in\nGermany around the\nThey instill calm\n...\nAnd then he follows\nAnd the ...\nRapid rate than the\nNa na na\nNa na na na na na\nNa na na na\nNa na na na na na na na na na\n\nAnd get all of them turned us around featuring Steve Earle what's his marriage that's Marjorie ... from ... new album so to resist the Nineteen\nIran under current retirees with the\nCars go see the eagles but really it's John Manley piece that he does on the ... and we keep free Cherokee blues man angels in the room\nIt's under current on pretty much richer really thrilled to be with you or we're going to enjoy the music of Kuwait Marty Baron of the Jefferson Starship just an airplane\nCosta Rican land left behind some really beautiful work that's coming up and just to\nYour to the border radio Thirteen twenty am in Yuma and border radio easy daughter we also broadcast on the Arizona community radio network\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\nOn the old days they used to the\n[noise]\n[noise]\n\n\n[noise]\n[noise]\nChance on stage in life and I said\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] sure just\nTell you that the court areas so that some of the parents out there to say kids I was in the way back in the day before everybody craft or work with trans Europe express remember that one yeah right\nWith taste and it was just the starship Mardi balance on vocals and he wrote the song as well as other really\nProfoundly beautiful Web socks like coming back to me today from surrealistic go right down there just joined just welcome to send your current some great with Victor indigenous other way and this is Jake and get\n... in\n\n... he\nHe\n\n\nIn\nUs he\n\n\nUh\n\nShe just she\n\nChannel you\nGood to me and my\nCan tell you\n...\nCollege does his border radio Thirteen twenty am kale at the human importer radio ac dot org\nWe also broadcast in Arizona community radio network at eighty nine point five that's engaging the H ... Williams now do you want to engage ACP Prescott Ninety point seven F. M. K. Jaycee aching meant in Ninety One point three ... you're\nListening to the Arizona community radio network on kj da ... like like Drake K. J. D. P. Ninety One Prescott and kj decay Ninety point seven can't win\nSupport for the Arizona humidity radio network is provided by cable was promoting the next generation of bitter ditch beat Duke award was but you talk to one thousand Meg don't load at fifty may go look\nBack about ... local support stay up to speed for all your Internet the edge and voting streaming video at all like gaming learned more on line that do go one dot net\nSupport for the Arizona community radio network is provided\nBy Grand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feed them right out of your hand the hundreds of animals up close elk buffalo boroughs camels cool watching Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near William which you would never\nDreamed that water starting center\nYou're reliable source for local news and sports northwest public radio Ninety One point three at them like death month part\nDon't need to go man\nI Do too much in the ground and\n[laughter]\n... the bank and fun about the the Joe\n\nThe nerve\n\n\nJohn you're\n\n\n\nNa\nNa\nAnd [noise]\n\n[noise]\nJourney yo\nTruly believe in God\nOf young\nWhen they\nSaying\nAnd train and\nDa\nDa da\n\nDa\nDa\nNa\nNa\nSaying\nA\nMillion to know\nWhich is the\n[noise]\n\n\n\nHe he he [noise]\nHe he\nWill go\nUp\nGoing out and\nSaid they\nTry to do\n\nSame thing [laughter]\n[noise] [noise]\n[noise] [laughter]\n\nThere you know\nIf you will\nYou\n\n[noise]\n\n\nMm Mm Mm Mm Mm\n\n...\n...\n... ...\nThere\nDrama where did you\nHere last\nHad a ... a\nDone shine\n\n\n\n\n\nModels I bought an intimate I'm going to go out to own a gun on one I don't want to me no no no no no no I'm a I'm On your body made I mean\nI saw on a family man\nGame\nI'm\nKnow you're not so long you're\nGod I don't\nTo\nHold on\nLa la la\n\n\nEight\n\nTry to strike here we're sitting here listening to under current\nRight shooter and that will go by with each other they succeed for the Grammy Award winning album mambo Sunni window recorded in\nNevada\nAnd it was an American poultry on good just super catchy and beautiful Camille Camille with and even though there was all over the airwaves especially in places like Miami\nI first started when I was in my hotel room in Havana Cooper with my little tiny radio Kim on the local station\nJust going to show that that to wish sharing is still going on musically these undercurrents wish your music from\nAll around America and around the world in both directions that's what we call it American music with a passport was it from the Native American nations\nBack and forth with everybody lots of crossing influences got a group of Canadians when Native American covered up the band and right now Charlie muscle why this is a good one in fact it's finger licking good\n[noise] [noise] [noise]\n\n\n\n\n[noise]\n\nNah\nThinking licking good\nMay\nNation but I have to\nMm Mm Mm\nBut I Do know near\nThe\n... what do you name\n...\nDidn't really you know\n... do you know\n... ...\nAnd I\n\nNo\nAnd ... cheese\nAnd na na\n\nNa\nNa\nNa na na na\n\nNa\n[noise]\n\nI Try to Bob in ...\nDay to to ...\n\nGrade they're saying\nDream bowling may na\nNa na na na\nNa na na na na ...\n\nLast minute\nYeah these are the\nPlay the jury is in the\nLong\nTime and the\n...\nNa na\nNa\nNa na na\nNa na na na na na\nNa na na na na\nNa around the world on jobs and they just\nLet's go bomb as grades they're treated\nDa\nDa da da da da da da da\nDa and the only thing they need\nTo model\n\n[noise]\nWas just gone gone gone up all night all day I Want to know what to do that\nIn the world is paying\nTo talk about talk about a centerpiece of the added telling me how pro\nThat in the middle\n\nWas gone and be God's\nView on the big bang theory in Europe you Jim ... tend to be you don't you\nChanging the joy on either but that guy\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[laughter]\nThere are times\nOf a\nThings you can see the\n[noise]\n[noise] nah\nNah\nJust trying to be\nTrained to do you need a car\nPaying ... na na\nNa na\nNa na na na na\nNa na na\n[noise] I Know I don't know I Am in\nAround as\nSt Diana\nI mean\nMan I\n\n\n\nRather a ... ... ...\n...\n... do night\nNight the man who's who my\nReal name thank God the ... the ...\nI mean you know one of those and then a\nBeginning a new buttoned up or\nThey just do my national ...\n...\n...\nMan who has been a\n...\nNo ...\nThere's been a\nEnded\nGoing to do my one dead\nEnd to the super bowl the na na\nYou know the same but the\nDo nothing in the Bush gave me the\nDomino was legal to get\nMiddle of the book\nOr the ...\nThe main thing we know\nWhen he sees\nThem because on the show\nAnd then they could no well\nWhich he made the ... they\nDidn't even know you're not both\nYou know every country has music that speaks from so a country in America probably be the blues and\nIn Portugal father\nMusic and that's what I was right there I'm Tony ... will wear a coat such a ... ... pretty bleak\nIt's funny it's on the record label feet by ... father\nFather John misty before that would be nice for God's Favorite customers ... new album before that from the u._k. was a cute little recently making appearances happy sasquatch festival in Washington and outside Lance\nIn San Francisco and it was electric cars and was wondering if you just joined just welcome was undercurrents I'm Greg and you haven't missed anything there's a lot more music to come from Carter brothers and this from Tim O'Brien with about doing soccer or not to ...\nYeah everything is broken and\nThis dude that bill\nYeah everything's broken\n\nHe's on he's on\nDarker environmental\nBroke\n\nThe little\nWere broken hands on\nAgain vowing to get\nYeah but the thing that broke down\nThe Native American radio network\nThanks for listening you're listening to the Arizona community radio network an eighty nine point five FM K Jay Z a drink Ninety point one F. M. K. Jay Z the press and get a Ninety point seven FM cage easy cake\nCan support for the Arizona community radio network is provided by\nGrand Canyon defined eight miles east of Williams on interstate forty lock them any deer feeding him right out of your hand the hundreds of animals that elk buffalo girls camels collecting Lindy kangaroo llamas Rainier and more the Grand Canyon deer farm near Williams\nHi Kim with the lights the week at our fire alarm read with a name like fire alarm you'd expect large red flags that take a fire has to put the growing pedals out this fire alarm mom comes back again for even bigger shadow next year waters garden center\nEighteen Fifteen ... springs road in Prescott who people who love\nThey love to shop we believe in the golden\nWhat is there any thinner entertaining enlightening informative and involved Prescott public radio\nDoing music from K. slang veers ahead my little green see us in ... and we had to kick it off right now with an indigenous Australian singer songwriter Emily ... na\nNa na na na na na\nSuing red the red\nIn\nThe navy and um [noise]\nHuge then\nThe same in a\nNutshell leads to the um the\nMaybe um maybe\nMaybe and and then gee\n\n\n\n\nDay [noise]\nThat they know and\nNa na\n...\n...\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\nAt each other\nStrange things\nDid you and I\nDo\nThese\nDays\nI Do remember the\n...\n\n\nOr ...\nYou dream in\nNation that you know\n[noise]\nI Do love\nAround ... am and\nThen\nAnd\n\n\nMan carrying around\nAnd\nNa na\nNa\nNa\n\n\n\n\n\nRecorded in New Orleans Rodney robbers story when he made the album she does tell from the ... people in Mali Africa to Norway\nBefore and after me I'm I'm a ... cool and there was CEOs believe it or not all that sound just two people do need as playing bass of all kinds of circuitry on his doubles in ... the sound\nAnd cohesion explained the jobs are released the Austin ... nation in the nation find like a woman\n\nWhere else are you going to hear that on the radio you won't hear it in the mall reporting over the\nSpeakers near a record year so we're really glad to be able to share it and everything else we do here with you on ... thank you for listening you telling your friends about us lending your support most and so by the way right now let's turn the music of money on under current [noise]\nWe know them only about ...\nDown in the journal locked up in a game up in ... where everyone can learn to be a mom and dad um equal now\nTo be now whether reason not to now be looking bull Rebekah crown\nLove to eat in\nThe winter of ... year old army the under\nBe came up and he made a legal greenery when a man being on my movie um do we know how to pronounce and losing the Dalai\nClown like do my duty now and then we will be totally muggy down I knew\nIt would be game up and he said oh me cool\nThe when I'm being being on\nDance we mean to me\nCame up to me I Do we know how to pronounce and losing being down\nTo be the um the last\nDown either jungle locked up in Indianapolis long it'll\nOkay not to be putting it into\nGee we were\nMe what to call their\nLot and I am right\nCat\n\nAnd to see this nasal voice won the Native American\nYou're listening to the Arizona community radio network in eighty nine point five FM cages EA Drake Ninety point one of them page ACP Prescott and Ninety point seven F. M. K. Jay Z cake king ...\nOf the kindness revolution a good friend of mine who was a terrific football player\nTold me recently that he owes his success to recall he got from his football coach that a young age the coach simply said I've noticed how hard you're working on the line lately [noise]\nThat small send us changed the way my friend played and he says it changed his life one small sent us from someone he admired [noise]\nOne simple statement of appreciation and encourage my\nAnd it can make your friends and employees and coworkers and family you get it\nTo be more aware of saying how much we noticed the hard work someone is doing it might just changed their lives and make our world is a little kinder\nInformation check us out at\nThe kindness revolution\nNet support for the Arizona humidity radio network is provided by uptown United drug\nWhere you'll find friendly knowledgeable farm as it was more than eight years of combined experience for important Health News discount coupons key medication information or to refill your mail order prescription log onto uptown United ... dot com Serbian king linen golden valley [noise]\nItem fires are nice summer absolutely fantastic quarters orange flame that dragon has been grown exclusively for the Prescott area dragons or a natural and mountain burdens with autumn blooms as snap\nInto bloom again in spring\n... center in Prescott regarding sour or snap Kathy clean fun to play with [noise]\nFind a public radio programs you enjoy that inform enlightened editor day and log on to tune in radio dot com and search for ... and the Arizona humidity radio network that lives in any time on your smartphone seniors\nHello President Trump has said he believes the Saudi journalist ... she is dead Mr Trump told the New York times journalist that he based his belief on what he called intelligence from every side Chris Tucker\nIs in Washington Donald Trump says he's waiting to get more information from a series of different investigations but he said the multiple intelligence reports suggest that your mouth has showed gee is dead\nThe president as being very careful in his criticism of Saudi Arabia saying the U.S feel we used to find out exactly what happened to the journalist\nAt one stage he suggested real killers could be responsible and so far he seems to rule that sanctions that could prevent new critical arms sales to Saudi Arabia however he insisted there would be severe consequences if proof emerged that showed the Saudi Government were involved the European\nCommission has won't Italy that its budget plans that twenty Nineteen would appear to constitute an unprecedented deviation from a new budget rules as it prepares to deliver a formal opinion the commission said that to the proposed Italian government spending was too high and the Israelis public debt who would not fall in line with a new rules\nThe U.S department of justice has opened an investigation into alleged child abuse by hundreds of Roman Catholic priests in Pennsylvania\nGrand jury report in August sound credible evidence that more than a thousand children were abused by three hundred priests across Pennsylvania and the church officials covered it up that the tools they can you you'll has more details\nUs attorney's office in Philadelphia has served at least for Catholic dioceses in Pennsylvania with ...\nIt's the cutest are demanding confidential files and testimony from church officials as part of an investigation into abused by priests several of the diet she said they are cooperating with prosecutors\nAlmost all of the cases are too old to be prosecuted and only two priests have been charged that the regulations have similar inquiries and other state\nA row boating God has killed at least two top Afghan security officials inside the governor's compound in the southern province of Kandahar\nThe provincial police chief general up too rosy and the head of intelligence was shot dead after a high level security meeting the Taliban says it was behind the attack speaking to the BBC and they ... ... ... pages condemned the assault\nWe we got the ... as a soldier who was committed to avoid towards the two the two reconsideration here in Afghanistan [noise] an understanding of about ... no\n... it's like these will only sprang from his all to enable the African national defense and security closest to bring his wish to circle too and and\nYou're listening to the world news from the BBC\nIsrael's Supreme Court has overturned the ban on the U.S student from entering the country over her alleged support for international boycott campaigned against Israel\nLaura ... who is a Palestinian decided was refused entry on her arrival in Israel on student visa more than two weeks ago since then she's been held in an airport detention center lawyers argued that she was no longer involved in any political movements and simply wanted to come to Israel to study\nHundreds of protesters marched in the Liberian capital Monrovia to demand action against the chain of schools founded by a high profile American charity work or object was revealed that some people were raped by a staff member this activist called on the ... has to do more\nWe can get out there we we determine what they think that when the ...\nIt's not just like they don't get caught and wonderful scene you paint a guy like that\nWe need not be the\nChief executive of the moon ... announced last week that she was temporary stepping down off the scale of the abuse was revealed\nBut finished ... sentence the founder the pro Russian website to touch two months in prison on charges of defamation and negligence\n... said the MB lefty a well known rightwing anti immigrant and pro Russian publication had published offensive contest or content about an investigative journalist\nEcuador has expelled the Venezuelan ambassador of the comments made about the country's president Marino officials said Venezuela's information minister Jorge Rodriguez had been offensive when he accused president Moreno of lying about the number of Venezuelan migrants\nArriving in Ecuador Mr Marino could told the U.N General assembly six thousand Venezuelans were entering Ecuador everyday BBC News [noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\nDoesn't pay enough\n\nYou like to watch really I mean one\nWay I\nIt or\n[noise] and\nI'm On\nMy way then [noise]\nThat I\n\nA\nBad\nBad\nOff and\nMy\n\nThat I Am too\n[laughter]\n\n\n\n\nWe're supposed to be in one\nThrown on your own one hope no water no\nI wouldn't know what are the ones you know what\nWill they don't like to do so much during the ...\nYou know what you mean the you know they're doing with local\nNot doing when he goes no much for me\nOn one of those ... you would have been there but when you're on the border where you're the one\nManager I Do not\nWant to be a\nWhen they were going to the ones you\nIn the middle of that then you\nJohn ... among the drone no it\nYou what do you\nOr bad name you know bad men\nYou know when the bill and new ways just knowing that it's another thing we do you know me\nKnow when I go to the ones you can learn\nShot and know what you mean the you\nMy name is ... D says\n\nThis is prompting borders I'm Thirteen twenty I Am in your mouth border radio just turned a Jamaican reggae artist named Jim meal he's single last year was called you need love before that another\nCatchy went from plain white teeth they should have gone to bed with that tune an album from two thousand and Thirteen if you're a big fan like I Am there'll be at the house of blues and Eli next month\nBefore that Laura's veers everybody needs you from her brand new album called the lookout\nWe started that set with Courtney Barnett and hurt by a lot of the lights was that album from last year and we heard continental breakfast coming up after a short break cold as I\nPrescribe to concerts use will be presenting a performance by Scottish the your soul mate or GMO gum it will be next Thursday evening October twenty at trinity Presbyterian Church which is located at six thirty ...\nIt'd be like ... ... e seven seven eight three by the nine to\nThanks for listening to radio Thirteen twenty am a human we also broadcast on the origin of community radio network in Prescott Kingman black steps and Williams\nIn Kingman studies guys in the highest Seventy two with north wind aid to fourteen miles per hour day to night clear lows around forty nine that's going to have some of these guys and the highest sixty three today in clear skies with a low of forty tonight in Flagstaff\nThe chance of showers in a high near fifty three today and I mostly clear those around thirty one Yuma sunny ice near eighty five today and tonight clear skies those around sixty five degree\n...\n\n\n[laughter]\nNo\nHey I\nJust bought a radio Thirteen twenty am in Yuma find us on the tune in and out just search for K. O. F. A. as your favorite station\nThat sat with the dedication to how cold it's been humid this week in the sixties hard to believe right so that when you make that call disappear by Amy street from that album in two thousand fourteen before that we heard Adele cold shoulder came out on her Nineteen album\nWe heard t-bone Walker cold cold feeling he released in two thousand Thirteen on the original blues\nWe started that that would be getting cold as I came out last year he's got producer and vocal credits on Kendrick Lamar damn album from two thousand Seventeen he's really blown up I Hope you find them as an artist or coming up next with in my mind from the sheep dog\nArizona was in college will be hosting a CPR Bruce state certification class with instructor Joanna Elliott who will be this Saturday October Twenty years from nine AM to one PM at the age that we see Jim which is located on the east side of the ...\nIf you'd like more information you can give us a call at night to wait three or four seven six nine zero\nYou can hear border radio Thirteen twenty am on the radio affects that download the app install it and so like K O at bay as your favorite station\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world doing K. A. W. sea and retired Arizona highways publisher when holding at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty seven at St Paul cultural center\nFor information visit K. A. W. C. dot org ... made possible in part by a grant from Arizona humanities [noise]\n\n\nI'm\nI'm a\nOn a\nMonday and I'm I'm you know not you know\nOn a warm na\nNa na na\nRight hand man a man who\nA\nNa na\nNa\nNa na na\nFor na na na na\nGrant for a while a\nA runner\nNa\nNa\nDa\n\nWho\n... ...\nYou can download the way the other man well not\nIn any ...\nHe was born and bred the big thing when\nWilling to do they even have you been hanging out\n\nNo no\nHe\n\nIs not going to dig up on the roof putting the na na na\nNa ve done that\nBelieve it was not ... well now see that is that the thing that that is a guy that you want to\nDo and then go\nYou know\nMaybe\nThis year he's done\nYeah yeah ... and\nNeed to come back\nThen\nThey do that to me and you already\nKnow knees and\nThere wasn't that\nThey are to\nYou're listening to the Arizona community radio network in eighty nine point five FM AJC a strict Ninety point one of them kj ... pie crust and Ninety seven at the cage a cake\nBorder and how many New Year's resolutions already been world whether it be the dining room\nOn our lots of coming up and we're already been postponed until next [noise]\nMaybe the most important work for us as non resolution but execution in any endeavor is the execution rather than the planning that is the key to success nothing happens without execution\nNo planned commitment a resolution is of any value without the key ingredient execution\nYou're losing coaches mentioned it all the\nWe had a good game plan we just didn't executed so resolve this year ... [noise]\nThat might be the most important resolution we can lead in a while you're thinking about it takes a cute resolution\nTo be a little time to learn more join us at the kindness revolution\nSupport for the Arizona community radio network is provided by\nMartin funny Chrysler dodge cheap ram and key at twenty six twenty east any divine in king then you can depend on science fair find selection of new and pre on cars trucks and SUVs where quality cars and trucks really do cost less the inventor and shop online at ... dot com\nSupport for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of William's on the interstate forty ... feed him right out of your hand see hundreds of animals that club elk buffalo pearls camels collecting Mindy kangaroo llamas Rainier and more the Grand Canyon deer farm near Williams\nFine public radio programs you enjoy that and for my life as an editor to log on to June in radio dot com ... at the Arizona humidity radio network that lives in any time on your smartphone\nUnderstood Macintosh with the b._b._c. news hello\nPresident Trump said he believes the Saudi journalist Jim al ... is dead he said allegations that the Saudi crown prince was responsible for what had happened to Mr ... raised questions about the u._s. aligns with three at ... ... in Washington says Trump's position is happening\nHe had had multiple intelligence reports according to the engineering and with the New York times\nThat suggest that demolish ... is not that a lot something about the White House is having to consider that very careful and very concerned about that relationship with Riyadh you've heard\nDonald Trump say time and time again that they need to try and tell relationship with a country that is a very important ally in the middle east and also won that spends a lot of money with America but at the same time there is growing pressure inside Washington and also globally for them to be thing to do something\nThe European Commission has wanted to leave that its budget plans for twenty Nineteen would appear to constitute an unprecedented deviation from a new budget rules\nAs it prepares to deliver a formal opinion the commission said the proposed Italian government spending was too high you can also warned that the country's structural deficit would rise the European finance and economics commission ... ichi reiterated the a use misgivings that\nComes to fail\nSailors that just for the commission in this case there's ... basically the commission works in the general interest which is in a way the referee on the field I knew the referees NATO was very popular but nevertheless it is to him that we turn to ensure that the rules of the game I respected\nWhich is true that we have never had such a gap in terms of structural deficit between what was requested on what is expected\nThe U.S department of justice has opened an investigation into alleged child abuse by hundreds of Roman Catholic priests in Pennsylvania a grand jury report and all those found evidence that more than a thousand children were abused by three hundred priests across the state ... reports from New York\nThe U.S attorney's office in Philadelphia has served at least for Catholic dioceses in Pennsylvania with peanuts\nFederal prosecutors are demanding confidential files and testimony from church officials as part of an investigation into abuse by priests\nSeveral of the dioceses say they are cooperating with prosecutors almost all of the cases are too old to be prosecuted and only two priests have been charged that the revelations have like similar inquiries and other states\nA robe bodyguard has killed at least two top Afghan security officials inside the governor's compound in the southern province of Kandahar the provincial police chief general Abdul arouse eat\nAnd the head of intelligence was shot dead after a high level security meeting attended by top us commander general Scott Miller [noise] world news from the BBC\nFor ... a double you've seen names in Yuma I'm can transcend more than one hundred fifty students from the union high school district are expected to attend this year's you my youth town hall meeting to discuss law and public safety ... county\nCannibal UCs jazz men ran off gives us the tale this\n... town hall will bring together students and ... from around you\nDoes the law and public safety students will have the opportunity to chat with exhibited about careers and internships the idea is to create connections with future employers and educate students on the opportunities available to them and the county\nDr Linda Elliot now Senate vice president for learning services at Arizona last year in college\nAnd so we see our students very engaged going up and asking companies what do you do what kind of jobs do you offer and learning something new about who the employers are are in our area so that they know careers are available here\nAnd well paying jobs are available here\nAt town hall is the collaborative and that's between a double you see you in a union high school district and southwest Arizona town hall event what they played on friday October Nineteen brigade that we see has been out in\nThe Metropolitan Opera if you have the challenge is holding auditions in Phoenix and they want all aspiring young opera singers to take part\nThe Metropolitan Opera National Council Arizona district Rocky Mountain region will hold auditions debris third from ten AM to four pm up the musical instruments museum in Phoenix auditions are free and they're open to the public\nFor K. A. W. see news in Yuma I'm from ...\nNa na na\nRight\n\nA man was\nNa na\nNa na\nNa\nNa na na\nYou know\nDa\nNa oh\n\nNa\nWe're starting our second hour of crossing borders on board or radio Thirteen twenty am in Yuma and on board or radio easy dot org my name is and whether it will be together for the next hour of music\nAnd what was\nOn the road\nThat now they don't mind\nOne I\nCould ruin our in\n\n\nOur\nOf the game\n[noise]\n\n[noise]\n\n... know that\nDo have a you know they're\nReally really you\nThey oh\n\n\nOh\nOh my [noise]\n[noise]\nNo\nYeah yeah\n[noise]\n\n\nAnd that was Christina Johnson bold is the single from her breakout E. pi this year called Guerra baldy we heard Sonia ... sharp came out in two thousand fourteen well I heard the whistle and the belt highlight reel was released on last year's modern plague\nWe also heard the heavy bon I've ever influenced a kilo to think what we heard was thin and its brand new this year stay tuned to Thirteen twenty am in Yuma border radio we'll be hearing James Bay right after a short break\nYou probably hear theme on a regular basis the border radio is listener supported so to those to contribute to border radio thank you for making everything you hear I'm distaste impossible especially the student internship program thanks for your support\nThanks for listening to board meetings Thirteen twenty and then human and we also broadcast in Arizona community radio network in Prescott ... Williams\nToday and you must bunny eyes near eighty five north when five to Fifteen miles per hour no clear low around sixty five ... some of these guys are the highest Seventy two today clear skies loads of forty nine tonight\nPrescott sunny with a ... near sixty three today and tonight clear lows around forty degrees Flagstaff chance of showers eyes they're fifty three today and I mostly clear lows around thirty one degree\n[noise]\nAbusing harder to hold the ... there are nine and a growing coal burning\nAnd where there are dying to know more when are we sitting around the\nAnd you know stand on moment turn\nAnd this is back to your son\nThey give me the Iraq\nUnder ... feet and wait and see what's going on I mean they could turn this guy\nBringing to wind up saying he\nOur next giant\nSeeing me to\nA no [laughter] [noise]\n\nI heard that on\n\nDo they agree or\nThey can't give me\n... and\nMan\nNa na na na\nNa\nNa na na\nNa na na na\nNa na hey hey\n[noise]\n\nNa na na na\nNa na na na na\nNa na\nNa na na na\nBroadcasting from the campus of Arizona western college for more than forty five years this is Thirteen twenty I'm bored or radio and border radio ac dot org you just heard last year single hurricane from the Chicago siblings called wild bell they've had a pretty quick rise to stardom they appeared on Conan and two thousand twelve\nPut out their first album in two thousand Thirteen and I've already appeared on Grey's Anatomy pitch perfect and vampire diaries before that we heard one of the states from the Nineteen studio album that Neil Young called harvest moon he released that Nineteen Ninety two\nWe heard Sarah Shook and then just armored their new album is called years we heard over you\nWe started that sat with another emotional tune by James Bay when we were on fire was released on two thousand and Thirteen the dark in the morning after a short break we're going to hear someone who won a Grammy lifetime achievement award at thirty six\nWhen black step in the ... village will be hosting their inaugural don't Boehner has been five gay it'll be next ... silver twenty six study got six PM with ... games on the campfire starting at seven Fifteen yeah this will be held appears in in order to village eight miles snowball lead up highway one eighty\nBroadcasting from the campus of Arizona western college for more than forty five years this is thirty twenty am border radio ... or\nAlso British guitars ... grew up with American music on radio against the u._s. to create a new ... Bruce rock\nI'm next to join me for American roots\nSaturday morning from eight to ten ... Thirteen twenty am\n\n\nThink you know a lot in general but\n\n[noise]\n[noise]\n[noise]\n\n\nWhy should we\n\n\n\n[noise] [noise]\n\n\n[laughter] I\nCan't think of how the how\nDo you say you know when they do this\nCall decide to do some of my friends\nWhen I ask you can go now right now would you say you gotta be cruel\nTruly kind of hard to prove to the car and I'm very honored their nuclear\nGarner can can you buy and\nThan me [laughter]\nTo me mom fatter do whatever it is to try and you can just fine how are you on a hill and dying trees are complaining about the book came out with the girls are we now have you know I mean bags to Montana\nOne afternoon and running but you know guys on the cruise\nRe time around it and prove to be kind of ...\nDo they kind of [laughter] but then you got in there\nLoving it [laughter]\nOh God\nI have a [noise] an Iran on our own country\nYou know don't just want to buy new on and on and you know why\nI think for them to get under an arena you know to me now to use a computer I murdered in ... new kind of money to charity ...\nCruise to be hiring or not there to the to the guy's name is ... and I'm sure you've ...\nRoom and he got hurt or I didn't know and I sure\nBe guarded carrier that every now and I and many here but in any in our area\nSure you got married I don't know very close\n... ... ... and really learn to read but he ...\nMe and our yard is critical\nThe ...\n...", "show_name": "no_show", "year": "2018", "city": "Kingman", "day": "18"}