{"month": "10", "state": "WI", "station": "WORT", "content": "The dominant dynamic to build meaningful sustainable community based institutions locally and in a larger level\nIf you're feeling a little bit depressed about the the state of the world right now than one very positive thing you can do to help the will doubt as to call us at two five six to seven zero one will go to W. O. L. I. T. FM dot O. R. G. and make a pledge to support to this wonderful radio station ... independent media station\nA station that is by you for you of you\nTo earlier on bought in ... I Want to ring the bell and thank you for pledging so please give us a call right now we need the pledges um for for this great radio station\nCosts about what eighty five dollars an hour you're already in every hour of ... I mean that's twenty four hours a day seven days a week that's pretty remarkable\nAnd we're constantly figure out how to build upgrade equipment\nAnd the capital purchases what are we going to do with this building we've got a lot of hard thinking to do to figure out how we continue\nTo metamorphosis ties with the times in technology of radio and pod casting an Internet based broadcasting in H. D. and all of the different technologies and attributes that are out there and we need you to be part of it\nYes ring a bell Elena she's running to get the headlines ready you are stuck with me for the last sixty seconds I'm going to ask you\nGently and kindly please six or eight to five six\nTwo thousand and one or W. R. T. F. M. dot O. R. G. if not now when if not you who it is us this is us we can do this we come together amid this moment\nIf this time in this place this wonderful community radio station and we're figuring out how we bring it forward and your ... give us a little bit of a nudge the right direction so six or eight to five sixty thousand and one W. O. R. T. FM dot org we're going to go to the local news in just a moment thank you\n[noise]\nAnd you're listening to W O O T H U nine point nine FM Madison [noise]\nThat China's now six o'clock welcome to the ... local news the Monday October fest I'm your hosts Helena white and I'm your host Jean do court and tonight the news today marks the first day of domestic abuse awareness month we'll\nHear from a linguistics expert about the differences in men's and women's speech it might have emotional Kavanaugh hearing last week\nAnd we'll do our weekly check in of local government on full but look out all these are more on tonight to [noise]\n\n[laughter] [noise]\n\nHello I'm Gary Smith who the b._b._c. news President Trump says his decision to threaten terrorism countries he believed were trading unfairly with the United states help them come to the negotiating table he was speaking of the White House from the new trade deals concluded with Canada or Mexico\nMr Trump said renegotiating the deal was part of his campaign to ...\nThe president throughout the campaign I promise to renegotiate NAFTA\nAnd today we have kept that promise we have negotiated this new agreement based on the principle of fairness and reciprocity to me it's the most important word and trade because we've been treated so unfairly by so many nations all over the world that we're changing that\nHis negotiator Robert Lighthizer said he believed the deal will be approved in Congress with a substantial majority\nPresident Trump also suggested India was came to his own trade talks with the U.S immediately just go and do you as the ... of king Mr Jones at the Indian alternatives one to the negotiations to begin as soon as possible to make him happy as being no immediate response from Delhi to Mr Trump's comments\nIndia has a trade Cyprus around twenty five billion dollars for the U.S\nPresident Trump is trust he wants the FBI to investigate sex suits allegations against his Supreme Court nominee Brett Kavanaugh\nHe said the FBI should interview the John shunned anyone else they want the FBI has any days to investigate before the Senate votes on his nomination later this week ... says Mr Kevin ... will already seen investigated during his career\nThere have been background investigations into Brett Kavanaugh when he became a White House employee when he became a federal judge you have to realize that these investigations are are to determine if there's any sort of national ... security danger by putting this person in a position of authority or or access\nTo information or what they were not directed towards any of the specific allegations in this case\nThe Bolivian president ... said his country will never give up its campaign to regain some access to the to civic ocean his comments came off to the international court of justice wrote in favor of chilly in a territorial disputes the dates back to Eighteen eighty four when Bolivia was defeated in the world the Pacific\nEach year but it was just a postal yeah what are you a little little yeah I Would like to take this opportunity to say Bolivia is never going to give up its prosecution\nThe Libyan people know the people of the world know go through an invasion we have been tonight so for an access for the Pacific ocean the words of the Bolivian president have him around us\nThe Chilean president Sebastian ... euro hailed the courts verdict and say the peace treaty signed by the two nations in Nineteen eighty four had to be on it\nYou're listening to world news coming to you from the BBC\nProtested have clashed with police in Barcelona as thousands took to the streets that end and other cities across Catalonia to ... the first anniversary of a controversial referendum on independence from Spain more than a hundred and eighty thousand demonstrators most in Barcelona\nPolice charged in to break up a demonstration in front of the council on regional parliament\nThe charity save the children says suspected cholera cases have almost tripled in Yemen's western province of who data since it's finding that escalated in June it's renew to call for all the warring parties to stop hostilities now me criminally has the details\nThe number of cholera cases in war torn Yemen is on the rise across the board but the situation in the western province of a day die if the ... grand save the children says it's health centers in the area have recorded a one hundred and Seventy percent increase in the number of suspected cholera cases\nThe chance he believes they sleep pain cases killing sites with asked strikes the summer which damage decide Haitian facility and will to station\nSeveral European ambassadors have taken the unusual step of publicly criticizing the British foreign secretary for comparing the European Union to the u._s. I saw Jeremy Hunter suggested the U.S like the Soviet Union and trying to prevent any members leaving the blog\nHis own is ambassador said she lived on the Soviet brutality and the comparison was insulting\nThe U.S navy says that the Chinese warship has forced us destroy the USS to cater to change course in contested waters in the south China Sea and us Pacific Fleet spokes\nAnd so the American ship is conducting a freedom of navigation operation on Sunday when the Chinese destroy approached in an unsafe manner knew the gave in brief encounter increasingly aggressive maneuvers BBC News [noise]\n[laughter] [noise]\n\nThis is Helena white ... with your local news coming to you live from the W ... studios in beautiful downtown Madison\nDidn't county is going to partner with Madison gas and electric to bring the largest solar installation to the Madison area beams delusion will take over forty acres near the airport and will be one of the state's largest solar power farms it's an ... anticipated to generate ... megawatts of power reducing the county's carbon emissions [noise]\nThey have good clean energy news\nOnline energy has stopped using its coal powered Sheboygan electricity plant this was one of the largest coal dining plots and the third to be shut down in the last three years the company plans to switch electricity production to natural gas power plant\nThat is currently under construction in the light that plant is expected to start operations in twenty twenty\nCounty executive job per recently unveiled his proposed budget for two thousand Nineteen today\nThat include over fifty million dollars for an airport expansion in over five hundred million dollars for an operating budget this year's budget would need the lowest property tax increase of ... tenure point three five percent eighty million dollars has been alligators to deal with the risk of flooding in a way to manage extreme weather events\nAnd I would like to be more helpful about the date and if I knew when mark judge who worked at the Potomac safe way than I Would be able to be more helpful in that way\nNow I'm just using um memories of when I got my driver's license I was Fifteen at the time and I I did not drive home from that party or two that party and once I did have my driver's license I liked to drive myself\n[noise] she did a lot of work to\nShow politeness and deference\nAh she'd say I'm Sorry or a she'd say excuse me or you know she'd ask if they were comfortable she was concerned about whether the senators were comfortable or you know what they wanted so she was just doing all sorts of work\nThrough her language but also through the actions that her language did it's not just the words in them grammar it's\nUm the act of taking care of other people and I'm so she did a lot of that\nAnd at the same time she was quite an amazing um person in mixing\nGather a in that setting that under so much pressure her intelligence her knowledge about psychology\nAnd um neurobiology and in a way hormones work and trauma and all that stuff\nShe spoke as as an expert and I'm so she was able to perform being a deferential female that doesn't put men on the defensive or other women and uncomfortable with\nHer present patient as a woman and at the same time she also was able to come across with authority\nAnd that's really a lot of work to do\nShe was obviously so you know as you said deferential polite and that's such a huge stark contrast\nTo the way Kavanaugh held himself it's really kind of a paradox in a way that you know we don't often see or even maybe we don't often noticed because people aren't paying attention so\nCan you talk a little bit about the way they Kavanaugh held himself and spoke to a Senate committee\nEspecially compared to to Ford yeah\nSo\nAgain I Would say that you know she could have\nPerformed just like he did and she's still could have been a woman and been in in her gestures and her facial expressions and everything that that they're both capable of this right he could have also been more deferential but as he\nActed I saw and I I could probably analyze it and tell you you know things he said but it was it was physically he was very rigid he sat down with um a lot of a\nPrecision and pounding you know he he did he opened his he opened his papers very um [noise] with a lot of noise and looked\nMad a lot of the time except when he was talking about his children and the friends he used to weight lift with um [noise] and ah so he was defiant angry just showing that it wasn't holding\nBack he was not edited he he let himself be free with his\nUh emotions other than differential is that he he was never differential I'd I'd I'd have that I'd have to look back to see whether he ever said sorry well he did say sorry to that one senator whom he'd asked whether she had blackouts though he was throwing the questions back\nAnd let's listen to that clip of cabin are responding to questions from Senator any publisher\nYou're saying there's never been a case where you drink so much that you didn't remember what happened and then I'd be far apart and what happens if\nYou're asking about the blackout I don't know you\nCan you answer that question judge it to you that's not happening is that your answer\nYoung I'm curious if you are I have no drinking problem nor do I thank you\nSo [noise] the idea of someone being in an interview situation where they are supposed to be convincing the ah interviewers that there are a good person for the job to be\nCountering with the same question so if I say a ... did you eat granola for breakfast this morning and you say well did you eat\nDuring our for breakfast [laughter] that's not answering that is is so much more than not and it's like challenging I mean I can get really mad [laughter] the strong things\nBut if I were to behave in that way and an institutional contacts so it uh a faculty meeting\nI Would be perceived differently\nThan a man acting that same way it has to do with what our society a put swimming in a double bind\nYou can be assertive and conciliatory and compassionate but if you're a direct and on modulated then you're considered too pushy and if you act so if you're more if you more direct you you're considered pushy and if you're\nAn indirect or polite or whatever [noise] uh you are a then consider oh you're a woman but that's kind of\nWeak and I'm not power\nSo you can't do it right where he can do it I mean he may have come up to you and me and many people as not someone who would be a very tempered careful judge but as a man have he fulfilled backing very manly masculine and the stereotype of a man's\nMan's supposed to be like\nThat was named ... speaking with you W professor emeritus Cecilia Ford who studies the differences and men and women during conversation\nAnd those are to disturb stores but before we bring you any more news Helena Andy would let the word review\nOf a ... call support local news six or eight to five six two thousand and one W. or tea after and dot org\nYou know the lies comb like raindrops until it's a true friend showdown poor you can't avoid them until you are so to wash in the ... of the subterfuge\nAnd somewhere you must cloth through and find a way to see the truth [laughter] so you can speak the truth\nTo the power that seeks to\nDiscipline and punish and manipulate and crush and seems to pray for lives that are nasty brutish in short but I digress I think it's time to really celebrate with this great radio station is it is about\nUs coming together to you need to experiment and community radio I Love this station it means\nSo much to me to hear somebody like Casey parks doing the music and you can feel the love that's going through captain analogs fingers as he puts the needle on the groove of the album or the kind of news that people like gene then\nHelen are are given us say they're they're they're the messenger they it creating the message but you can feel the power and the passion behind it give us a call or two probably six two thousand and one\nUh W. O. L. I. T. is the place where you can find refuge from the ... of lives that are out that we're going to give you good information we're going to give you hope we're going to give you the listens to the world's problems\nIt's with an interview people who you don't usually hear from we're going to give you analysis you don't typically here because we're an independent media station and we are independent because we have the support from you the listener\nSo please give us a call it to five six two zero zero one it is due out there who's listening to the radio not right now you are the one who provides us with the ... financial support that we need to run the station we don't have a multinational corporation who's breathing down our neck and saying things like\nNo you can't cover that news story or you can't play this song we get to do whatever we want because you support us\nYou know the reality is in these times of austerity so we can cut taxes for billionaires so that they can buy politicians so that they can rule in a kind of ... to track Rick Pluta critic nationalism\nThat's that's frightening it means we we need to do and figure things out differently\nAnd with the corporation for public broadcasting cutting our funding that means we have to find more creative ways to get you our listeners sponsors to support us\nIn it you know we do a chili contest and musical events and we bring in great speakers and we have our pledge drives and there is no one size fits all if you\nWant to put us in your will you could put us in your will but what we want you to do is give us a call it to five six two thousand one celebrate this great and amazing radio station well we're all here because as I said before\nWe may not have it altogether but together we can have it all and when I say that all it means all of us coming together\nTo define the community in the world we want to live at and then taking the actions to make it half\nAnd you may feel like wow I Love to be able to give W. I. T. a hundred dollars but I don't have a hundred dollars right now well you could just donate say five dollars a month\nEighty nine dollar or eight dollars and Ninety nine cents a month over twelve months we're going to get better they are like oh\nOkay and then on Wednesday the board of public works are given the dream about\nYes more flooding then we'll be talking about actually amending the budget to to deal with some of the issues that has arisen because of the flooding\nAnd rounding up the week on the county saw it on Thursday at twelve thirty ... urban forestry test scores\nAnd they'll be looking at some recommendations about a zoning laws and land use planning as regards to the urban foresee that we have\nAnother four thirty ... advisory committee so they're looking at fifty years of recycling and medicine\nYeah fifty years running the first US cities to be doing recycling they'll also be talking about flood damage um they're really going to be specifically talking about all the collections that they had to sue the picking up trash after the flooding\nAnd then it far fewer among Thursday the community development block grant meets to look at ...\n... a whole bunch more affordable housing project\nAnd capital projects that that that'd be funding for next year\nAnd then at seven PM lake rich historic district\nThey're doing a series of amendments to the different historic districts and having the means and them and they will be joining an overview of what the potential in the business will be and then having question answer session\nAnd then finally on the school's side of things today right now this is Mondays is when they usually do their thing be a special board of education beating\nThey'll be talking about the other for civil rights I'm resolution relative to dance learning in school and then at six they've got to work group as well yeah the instruction Margaret there'll be looking at the candidate for her she doesn't Eighteen Nineteen getting an early childhood update and then looking at the board of education cycles of interview for that as well\nAll right that well rounded up for the county the city and the school board for the coming weeks and the two years forward lookout checkout forward lookout dot com we're running out over here every week on Monday thanks Brenda thank you [noise]\n\nSpeaking at a news let's check in with Helen Andy for the latest [noise]\nSix or eight to five six two thousand and one you can be like Harry Richardson and support local news ... scary support local new team makes local news is a fine labor at the bit after he was in a stalwart\nMovie reviewer Harry loves the evening news especially Mondays are public affair especially ah the rough one and labor radio and he says keep up the good work you to our friend and brother we\nCan't do it without listener sponsors volunteers and supporters you can be one to six or eight to five six two thousand and one and W. L. I. T. F. M. dot L. I. T.\nV. like Harry and give us a call I'll be like an\nAnd a thank you so much and uh she's\nGoing to get the long sleeved T shirt it's gorgeous T shirt with a B ... will will have a custom ordered as soon as we are done with the pledge drive and we I don't remember if she's picking it up or we're sending it to you in Verona but either way thank you so much joined the crowd we got twenty more minutes yeah\nGreat programming Monday's news is an amazing way to kick off the week with the depth and breadth of understanding of everything's going up this way andme locally is well where's the endless march of local meetings where we can find ways where we have to sometimes come out of our\nOur shells and you will to add advocate in activity for better things here locally\nAnd if you appreciate what Harry does on Monday Night he does he's actually out of town right now but he ... he does all a labor party marijuana legal in that\nState though [laughter] he does a I'm a labor history this this date and labor history every month every Monday and he also does a movie review so if you're somebody who really appreciates\nHas a really interesting labor history um ... stories that he tells us every Monday or if you really appreciate his movie reviews like I Do then give us a call at two five six to seven zero wine and make a pledge of support for heritage\nIs little tried to hold his hand them a dark room you're back to a movie I ... I mean I remember from our six or eight to five six two thousand one I Believe here he's back if he's calling and pledging to be honest\nAnd then the rotary climbed that mountain I Want to talk about the teacher 'cause it's really beautiful it's got a blue background oh my God\nWhite fluffy clouds and it's a red tree with blue branches and growing the animals in the tree gathers squirrels and a dog and a cat and there are butterflies and bugs and there are a mushrooms mushrooms and woman is growing out of the trunk and she's holding a guitar\nA short cut to mushroom it's a really useful when I Would say that you most trends and the doors of perception as in order for them to a brave new world of illumination\nPat thank you so much have nation you rock\nOr the ... three favorite shows uh like the station completely wish I could give more well pat so much we ... we really appreciate everything you've done\nWe appreciate everything you've done pets so\nYou very much mishaps and she's in Deerfield so we're getting pledges wow Raul around the yeah I heard the black ... creek is flooding again to watch out all the rain like are there for a local update I have I Know the reins coming hard I don't know when where and how it's going or where it's going\nBut it's raining money right here so give us a call it to five six two zero zero one W. O. L. I. T. FM dot O. R. G. and be like Harry and Anna and pat and pledge\nYou can do this together my friend just great local ... like local news like the next story we're coming up as a very special and so yeah definitely need to listen to the kinds of stuff happens to perhaps not perhaps that shouldn't be happening in our community\nAnd it's a great example of giving W Archie giving an opportunity to somebody who may not otherwise get HUD letting a young woman a young African American Mexican women speak giving her her chance to tell her story and it's you don't typically hear\nFrom young women you W students\nOr ... times if you think it's going to threaten your future your livelihood your freedoms\nBut its hair on W. I. T. where we make a point to try and speak to people who are not typically hug from\nAnd you know you won't hear this on the mainstream media when multinational corporations running things that don't want you to ... ... they don't want these to speak so support if you appreciate all the different programming that you hear\nThe world war one diary that I've been doing the black hawk war radio show that we've doing that I did all the things that we have on the ... website being able to go to the archives being able to listen to shows again see pictures that go along with the shows\nThat if you appreciate all that give us a call it to five six to seven zero one go to W. O. L. I. T. F. M. dot\nR. jeez we want to night you're from the low we want you to find your passion in a W Arctic it'd be a small patch hurt\nOf the guide it's up to that path to challenging power to building community to creating art\nTo spreading joy to spreading love or just wisdom than than we are to start its job and if you can find a way to support this great radio station in any way shape or form whether it's a dollar ten thousand dollars it has the same\nValue the memories that are generated in this place the experiences the spirits that whisper within W. R. T. or an amazing thing and you can be part of this company\nAnd you can be part of the W ... family it feels good when you do it that give us a call it to five six to seven zero one I'll go to W. O. L. I. T. FM dot L. I. G. and provide your financial support to this wonderful independent media organizing\nForty three years were in your ears and we're going to go on Helen has going in to do her other double duty she did not run into the poll of his time I will report live real time reporting she smacked did earlier and coffee flu but six or eight to five six two thousand and one of the\nImportant thing about W. R. T. is there's nothing like it anywhere on your dial from labor radio till the hunter\nTo democracy now\nTo in our back yard you name it we've got it here and you know psycho acoustics you may have your favorite show in the middle of the night you made to classical music or the insurgent radio kiosk the diversity the power the passion\nComes in wide in clear through this radio station we can have it altogether by coming together it's you me us that are part of this community so six or eight to five six two thousand and one or W. O. R. T. FM dot ORG call now\nThe ... neighborhood of medicines east side as a diverse community that has a mix of residential areas and a strong commercial strip it's also the place where Madison please killed Tony Robbins in a bi racial young man in two thousand Fifteen\nIllinois Mel brings is an interview with ... Serena Florida ... who was in high school and told me roads and died talking about a recent experience with the medicine polish\nMany white people take for granted the ability to drive and walk around Madison without fear of being stopped by the police", "year": "2018", "show_name": "WORT Local News", "city": "Madison", "day": "01"}