{"month": "10", "state": "AZ", "station": "KPUB", "content": "This is MORNING EDITION from NPR News I'm David Greene and I'm Noel King\nMm\nMonday for Kagan AU comes from my family I have no therapy\nSince two thousand some helping people would leave their goals and dreams by using the power of a mind overcome stress anxiety and fear [noise]\nIndividual and group sessions available in Flagstaff\nFlagstaff you know therapy adopting\nSue Arizona Public radio with NPR News and talk on the you know you can't be you'd be Ninety One point in life that day and age the Ninety One point seven days in a gene Ninety point three Grand Canyon and can a cue eighty nine points repressed good listen online\nHacking into your dot O. R. G. a public service in northern Arizona university coming up\nOn nine o'clock now it is too that there were nine one a with Joshua Johnson is up next to Jim\n\n... McDonald an unarmed black teen who's killer a white police officer awaits sentencing when will this case I mean in the fight for police reform\nFrom W. A. M. U. and NPR in Washington DC is one egg [noise]\nHey there I'm Joshua Johnson today on one age the future of law enforcement Chicago police officer Jason Van Dyke could spend years in prison for second degree murder it's a rare conviction some activists considered it unlikely and some in law enforcement considerate heavy handed but what happens now in the larger push to rebuild trust between police and\nI mean and the fight for police reform\nFrom W. A. M. U. and NPR in Washington DC is one [noise]\nEither I'm Joshua Johnson today on one age the future of law enforcement\nChicago police officer Jason Van Dyke could spend years in prison for second degree murder it's a rare conviction some activists considered it unlikely and some in law enforcement considerate heavy handed but what happens now in the larger push to rebuild trust between police and the public especially in communities of color\nWe'll explore that today and we'd love to hear from you sure what you know if you're working to improve policing from the inside or the outside email won a a W. A. M. U. dot org comments on our Facebook page or tweet us at one day [noise]\nLive from NPR News in Washington I'm Laurie London President Trump says US ambassador to the U.N Nikki Haley is leaving his administration at the end of the year Haley surprised many with her decision to leave\nBut as NPR's Michele Kelemen reports Trump is holding out the possibility that she may be back\nAs she sat next to the president and the oval office Nikki Haley was playing down her political ambitions no I'm\nNot running for trying twenty I can promise you what are we doing is campaigning for this one so I look forward to supporting the president\nAnd like she was effusive into which Trump who calls Haley a quote very special person adding that she told them six months ago she wants to take some time off\nHe says he will name a successor in the next few weeks before being tapped by Trump to serve at the un Haley was governor of South Carolina Michele ... NPR News the state department\nEvacuation orders are underway as hurricane Michel heads toward Florida's Gulf Coast\nWe're trying twenty I can promise you what are we doing campaigning for that point so I look forward to supporting the president\nAnd like if she was effusive into was Trump who calls Haley a quote very special person adding that she told them six months ago she wants to take some time off\nHe says he will name a successor in the next few weeks before being tapped by Trump to serve at the un Haley was governor of South Carolina Michele ... NPR News the state department\nEvacuation orders are underway as hurricane Michel heads toward Florida's Gulf Coast officials say it's expected to make landfall as a major category three storm FEMA associate administrator Jeff ... says infrastructure damage in power outages can be expected\nOr k-mart was going to be a devastating storm a trip to Florida is not finished all of this magnitude in quite some time\nBuyer and says it is a fast moving high surge storm with very very powerful wins\nAnd it could also produce tornadoes he warns damage to the power structure could be more significant than Florence emergency officials across the Carolinas they're also warning residents to monitor hurricane Michael which is likely to move through the states after coming ashore [noise]\nThe death toll from an earthquake and tsunami in central Indonesia has topped two thousand as NPR's Lauren Frayer reports from ... near the epicenter the government is ending the search for more bodies and ordering foreign aid agencies out\nCharities have been ordered to leave the quake zone immediately from now on they'll only be allowed to distribute aid through local partners there's been a rash of foreign aid here in some groups have complained of having to get government permits to operate Indonesia does not want to be seen as having to rely on foreign help\nAnd officials have stressed that they have enough relief supplies within the country meanwhile there is a rush to recover body\nAnd as NPR's Lauren Frayer reports from ... near the epicenter the government is ending the search for more bodies and ordering foreign aid agencies out\nForeign charities have been ordered to leave the quake zone immediately from now on they'll only be allowed to distribute aid through local partners there's been a rash of foreign aid here and some groups have complained of having to get government permits to operate\nIndonesia does not want to be seen as having to rely on foreign held and officials have stressed that they have enough relief supplies within the country\nMeanwhile there's a rush to recover bodies before Thursday after which the government says up to five thousand missing people will be presumed dead prayers will be held in three ... neighborhoods emerged in mud which will be declared national memorials Lauren Frayer NPR News ... Indonesia\nOn Wall street stock indexes have been mixed in early trading as markets continue to absorb the shake out from last week's rapid rise in interest rates currently the Dow is up thirty points the S. and P. five hundred gained seven and not that composite up\nForty four this is NPR News\nThe rock and Roll Hall of fame has announced its nominees for the class of twenty nine teen from member station W. K. su copier body a report [noise]\nDeaf leopard available for the rock hall for over a decade was making his perseverance on this year's violent\nActs are released their first record at least twenty five years ago or eligible and several other groups are battling for the first time as well debo singer songwriter John Prine Roxy Music Stevie Nicks and Todd ... returning to the ballot or act ranging from Jim attraction to MC five to his armies who've been eligible since Nineteen eighty nine\nIn addition to more than one powers and music industry professionals brains can also vote for their favorite act on line through December night [noise]\n[noise] Jeff leopard available for the rock hall for over a decade but is making its perseverance on this year's violent\nActs are released their first record at least twenty five years ago or eligible and several other groups are battling for the first time as well debo singer songwriter John Prine Roxy Music Stevie Nicks and Todd ... returning to the ballot or act ranging from Janet Jackson to MC five to this zombies who've been eligible since Nineteen eighty nine\nIn addition to more than one thousand music industry professionals bands can also vote for their favorite act on line through December night the twenty Nineteen rock hall induction ceremony will be held in New York City in March\nFor NPR News I'm can be your ... in Cleveland\nSupporters of legalizing marijuana in the mid west are looking to the November midterms after a number of election victories in the west and north east Michigan and North Dakota will decide if it should be legal for any adult Twenty one or older\nThey would become the tenth and eleven states to legalize recreational marijuana since two thousand and twelve\nMeanwhile Missouri and Utah will be voting on medical marijuana which is currently allowed in thirty one states even if the initiative is defeated in Utah a compromise has been reached by advocates end opponents including the church of Jesus Christ of latter day saints\nThat will legalize the plant\nFor medicinal purposes I'm Laurie London NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include the law firm Cooley L P with offices and the U.S Europe and China Cooley advises entrepreneur as investors financial institutions in established companies around the world where innovation meets the law\nYou're listening to a pre recorded broadcast to one a with host Joshua Johnson on Arizona Public radio\nFor medicinal purposes I'm Laurie London NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the law firm Cooley L L P with offices and the U.S Europe and China Cooley advises entrepreneur as investors financial institutions and established companies around the world where innovation meets the law\nYou're listening to a pre recorded broadcast of one egg with hosts Joshua Johnson on Arizona Public radio can you say you good morning it's nine zero six\nFunding for K in a new comes from the citizens clean elections commission providing unbiased voter information out to register election dates and deadlines who's on the ballot and where to vote vote informed November six eight ... clean elections dot Gov for tools and resources\n[noise]\n\n\nThis is one day I'm Joshua Johnson in Washington on October twenty twenty fourteen a teenager named liquid McDonald was shot dead by Chicago police officer\nMcDonald was shot at sixteen times as he was moving away from police vehicles video of his death would go unseen by the public for more than a year and when the footage\nDid come out it sparked protests across Chicago [noise]\nOfficer Jason Van Dyke was charged with first degree murder that day last week a jury convicted Van Dyke of second degree murder and sixteenth counts of aggravated battery was a fire off\nWe signed up\nFor the fire first\nVideo of his death would go unseen by the public for more than a year and when the footage did come out it sparked protests across Chicago [noise]\nOfficer Jason Van Dyke was charged with first degree murder that day\nLast week a jury convicted Van Dyke of second degree murder and sixteen counts of aggravated battery with a fire off\nWe find him guilty of\nFire per se [noise] I don't know aggravated battery fires fan then they'll be aggravated battery fire\nThere's one\nBattery count for each bullet the conviction surprised many people Van Dyke is the first Chicago police officer in fifty years to be found guilty of murder diverted led some to wonder if this marks a new period of accountability for police officers\nAnd police departments [noise] use change on the horizon\n[noise]\nWhat does this verdict mean for police reform around the country\nJoining us from WB easy Chicago public media is it's criminal justice reporter Patrick Smith\nHe's covered the clown McDonald's case since the beginning and he is also hurting W. B. easiest podcast on the case called sixteen shots Patrick welcome to want to say thanks for having me\nAlso with us judge la Doris Cordell she is retired from California superior court system\nAnd is the former independent police auditor in San jose California judge Cordell welcome to be is also with us from WIP our public radio in Baltimore Neal Franklin is a retired major from the Maryland state police department currently he's the executive to\nPorter Patrick Smith he's covered the liquid McDonald's case since the beginning and he is also hurting WB easiest pod cast on the case called sixteen shots Patrick welcome to want to say thanks for having me also with us judge la Doris Cordell she is retired from California superior court system\nAnd is the former independent police auditor in San jose California judge Cordell welcome that did they also with us from WIP our public radio in Baltimore Neal Franklin is a retired major from the Maryland state police department\nCom [noise]\nHi this is Steve Inskeep with NPR's MORNING EDITION our goal is to bring your news that matters to keep you in touch with information that you need to make sense of the world in what can seem like a senseless time\nOver the course of a day a week a month the news unfolds and were there with your day by day listening to MORNING EDITION every day [noise]\nMORNING EDITION from five until nine on all those stations of Arizona Public\nK NA you coming up tomorrow night it's meet me downtown Flagstaff the free weekly social walk or run for all ages and fitness levels runs at five Fifteen every once\nIs to keep you in touch with information that you need to make sense of the world in what can seem like a senseless time\nOver the course of a day a week a month the news unfolds and were there with your day by day listening to MORNING EDITION every day [noise]\nMORNING EDITION from five until nine on all those visions of Arizona Public radio K. and hey you\nComing up tomorrow night it's meet me downtown Flagstaff the free weekly social walk or run for all ages and fitness levels runs at five Fifteen every Wednesday the one and three mile roots begin and end at heritage square\nLook for more events in your community on our website at ... dot O. R. G. this is one a from Arizona Public radio Kenyan at you and remember you can hear all of our programming on line at ... dot org it's nine twenty\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise in customer service contract to locate her and more information or at bona dot com\nAnd from that last scene that collaboration software company empowering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at Lausanne dot com\nWon a I'm Joshua Johnson we're discussing the verdict in the la Kwan McDonald's case that was a teenager who was shot dead in Chicago by officer Jason Van Dyke we'd love to hear from you whether you're in Chicago or anywhere across the country with regards to what this means\nFor the effort to improve law enforcement in this country comments on our Facebook page tweet us at one a ... or email one a at W. A. M. U. dot org let me get to a few of you\nWork better together more at ... dot com\nThis is one a I'm Joshua Johnson we're discussing the verdict in the ... on McDonald's case that was a teenager who was shot dead in Chicago by officer Jason Van Dyke we'd love to hear from you whether you're in Chicago or anywhere across the country with regards to what this means\nFor the effort to improve law enforcement in this country comments on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org let me get to a few of your comments before we keep going Nick is in Wilmington North Carolina\nMick rights I'm In North Carolina and the GOP state super majority pushed to bill through last year to not release any body camera footage to the public except for family members involved to view if I could make one law to increase mixed trust with the public this would be the one\nBe showing wrote on our Facebook page maybe the real issue here is that the criminal justice system in general and law enforcement in particular are being deployed to manage the effects of social and economic problems that they are ill equipped to resolve\nAnd Seth wrote on our Facebook page as a white person who works in an office that staffs mostly black people\nHearing stories of police shootings scares me that one day I might lose a loved co worker just because of their skin color when I found out they found this man guilty I was elated it's time for bad cops to stop being protected killers\nJust Cornell I knew I had to cut you short before we pause I Wonder if we could pick up with sets comment and finding officer Van Dyke guilty it seems rare that officers are convicted after shooting someone under questionable circumstances what's the legal reason behind that\nWell there is a decision from the United States Supreme court that really the key to all of this and that is\nThe skin color when I found out that he found this moon guilty I was elated it's time for bad cops to stop being protected killers\nJust go do I Know I had to cut you short before we ... I Wonder if we do pick up which sets comment and finding officer Van Dyke guilty you'd seems rare meant officers are convicted after shooting someone under questionable circumstances what's the legal reason behind that\nWell there is a decision from the United States Supreme court that really is the\nKey to all of this and that is the decision that the court made many years ago and the Graham case that basically said that when you are determining whether or not an officers engaged in the use of excessive force you must basically take be in the seat that\nThat the steps of the seat of the officer\nSo it's a very subjective standard what would a reasonable officer have done\nIn that situation so it is not an objective look is what is the officer feeling what is the officer seeing\nWhat is the officer experiencing so that's what the jurors are required to do and as a result you find\nVery few judgments first of all you know in in civil ensuing police departments are jurors have to again how hold the standard and prosecutors before they decide to to charge the officer\nHave to look at the standard and say what would\nAn officer reasonable officer in that situation have done so it is the Supreme Court that has set\nThis rule for all law enforcement agencies in the country\nAnd they were over Eighteen thousand separate police departments throughout the United states they all have different rules but they are all under the umbrella of whatever the Supreme Court set of that is the rule that is out there now\nCurators before they decide to to charge the officer have to look at the standard and say what would an officer reasonable officer in that situation have done so it is the Supreme Court that has set this world for all law enforcement agencies in the country\nAnd they were over Eighteen thousand separate police departments throughout the United states they all have different rules but they are all under the umbrella of whatever the Supreme Court set of that is the rule that is out there now\nYou were by the way referring to the keys is Graham versus Connor it's a case from Nineteen eighty nine and some of you actually commented with regards to what's going on and officers mines like Peter Peter emailed\nIt seemed like today was the mentality of police officers that their life is paramount beyond all else including their safety I feel like whenever they are threatened with any sort of possible harm to use deadly force in the new somehow justified\nThis is a career in which they signed up for similar to the military were they know they're going to be put in harm's way to protect and serve the are paid for this\nLet's add one more voice to our conversation before we get to some more of your comments joining us now on the line as Shannon ... the Chicago police officer who was also a whistle blower within the department who worked undercover with the FBI Shannon welcome to the program\nI think he Joshua\nNo I understand you had been working as an FBI informant within the department and as a result of what happened that caused some of your fellow officers not to be too fond with you what what happened that caused such a stern did it have to do with with corruption inside the Chicago police department\n[noise] absolutely dash law I was working as an undercover narcotics officer with the FBI and um I had discovered that some of my fellow officers were ...\nThank you Joshua\nNo understand you had been working as an FBI informant within the department and as a result of what happened that caused some of your fellow officers not to ... to fond with you ... what happened that caused such a store or did it have to do with with corruption inside the Chicago police department\n[noise] absolutely Joshua I was working as an undercover narcotics officer with the FBI and um I had discovered that some of my fellow officers were\nActually involved and the runny the narcotics trade with and the Chicago area and\nThere for I began and operation dubbed operation brass tacks against some of my fellow officers who\nI used the term officer loosely because if you are on the other side of the law you are really not an officer but they did have badges and ultimately that\nLed these officers one of them being a bus to go to federal prison and that made me very unpopular\nAmong the rank and file within to Chicago police department because before I came forward with operation brass tacks the code of silence\nWas unheard of you didn't talk about it it didn't exist\nA they tried to label me as crazy for believing that this was actually going on within the ... the department so it made me very unpopular and lead to a lot of police retaliation\nOwned a one vote is from your perspective I mean I Can't imagine I've never been a law enforcement officer have law enforcement in my family but I've never taken an oath so I Can't I'm speaking as an outsider but I Would think\nBrass tacks the code of silence was unheard of you didn't talk about it it didn't exist a they tried to label me as crazy for believing that this was actually going on within the ... the department so it made me very unpopular and lead to a lot of police retaliation\nOwned or one vote is from your\nPerspective I mean I Can't imagine I've never been a law enforcement officer have law enforcement in my family but I've never taken an oath so I Can't I'm speaking as an outsider\nBut I Would think you know if I knew that there were reporters who worked for my station who were lying in stories and they got caught I Would be grateful to see them go because of drugs all of us now why do you think it's not a similar mentality in law enforcement\nYou know honestly a lot of police officers get approach man they still talk to me and you are correct on us police officers absolutely do not want to work alongside with corrupt officers however the code of silence\nIs so strong within the Chicago police department and I feel that does go across departments nationwide that\nOfficers actually fear what will happen to them if they break this code of silence and\nWhat was interesting to discover during this journey of\nBreaking the code of silence is that there is this common misconception that it's a blue officers blue shirt common St officers going against\nOther officers when actually I learned that the retaliation came from the top down bosses were actually instructing the officers who were working with me\nCode of silence and what was interesting to discover during this journey of\nBreaking the code of silence is that there's this common misconception that it's a blue officers blue shirt common St officers going against other officers when actually I learned that the retaliation came from the top down\nBosses were actually instructing the officers who were working with me not to back me up\nOr they would be the next Shannon Spalding so out of fear of becoming me out of fear of retaliation themselves or putting their lives in danger losing their job what could happen to them\nThey complied because they it it's easier it's easier than going through everything that I had to go through and even though officers didn't\nWant to they thought they had to I had officers come up to me and say you know I Believe in what you're doing but I Can't be seen ... because I'll be next\nWe'll let me let me play a clip from the president of Chicago's fraternal order of police coven ground this what do you have to say after the conviction of officer Jason Van Dyke this clip comes from WB easiest podcast on the climate Donald case called sixteen shots here is Kevin ...\nWhat do I do believe when some of the bonuses\nDonald case called sixteen shots here is Kevin ...\nWhat I Do I Do believe putting some of the politicians I think that\nThey want to have training that goes well beyond sexual harassment you want it to cover discrimination and harassment based upon any protective category not just sexual harassment\nThat story but justice Brett Kavanaugh ... first day on the Supreme Court\nIn the afternoon on all things considered from NPR News [noise]\nFrom Arizona Public radio in Flagstaff meteorologist leave or in our most recent law storm system exiting the state today if you've been hearing showers across our eastern Arizona otherwise mostly sunny and ... and you're forecasting fifty five for Flagstaff today page high temperature of sixty four\nPrescott sixty five show fifty six and king in Seventy three similar again Wednesday Sergio is going to miss the state is going to move to our south and east but a little bit of moisture makes its way in for scattered showers and thunderstorms Thursday through Saturday\nComing up tomorrow morning the Prescott public library is hosting toddler story time at ten am for toddlers and they're grown up story time includes twenty to thirty minutes of simple stories songs plus finger plays with plenty of parent and child interaction look for more events in your community on our website at king you know you dot O. R. G.\nSupport for NPR comes\nSeventy three similar again Wednesday Sergio is going to miss the state it's going to move to our south and east but a little bit of moisture makes its way in for scattered showers and thunderstorms Thursday through Saturday\nComing up tomorrow morning the Prescott public library is hosting toddler story time it than I Am for toddlers and they're grown up story time includes twenty to thirty minutes of simple stories songs plus finger plays with plenty of parent and child interaction look for more events in your community on our website\nAt king you know you dot O. R. G.\nSupport for NPR comes from this station and from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself at visit main dot com\n[noise] from logged me in makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more it go to meeting dot com\nAnd from the William T grant foundation at double duty grant foundation dot org\nA quick heads up about our conversation on tomorrow's program about climate change the world is talking about a new report by some of the most renowned climate scientists putting a finer point on just how little time we have to do something about our warming planet\nThe report states that we have until about a year twenty forty before we reach a point of no return it also gives reasons for hope that we have the skills to do something if we worked together\nWe want to answer your questions about what it would practically take to fight climate change leave us a voice mail eight five five to three six one a one a\nWe'd also love to know what you're working on to fight climate change it a big way tell us your story eight five five to three six one a one\nThe report states that we have until about a year twenty forty before we reach a point of no return it also gives reason for hope that we have the skills to do something if we work together\nWe want to answer your questions about what it would practically take to fight climate change leave us a voice mail eight five five to three six one a one a\nWe'd also love to know what you're working on to fight climate change in a big way tell us your story eight five five to three six one a one a\nOr you can use our app won a vox pop to send us a high quality audio file and to keep up to date on future topics you can find one a vox pop V. O. X. P. O. P.\nIn the store and we'll share some of your questions and stories tomorrow on one day\nBack now to our conversation with Neal Franklin Shannon Spalding Patrick Smith and judge will Doris Cordell let's get some more of your comments before we start kind of looking forward at where the effort to improve policing in America might be going\nHey sailor tweeted the reasonable officer standard is a very easy standard to apply it's not that hard\nWe do need to eliminate the criminal justice college major and higher police with degrees in psychology or sociology too many cops have no business carrying a badge and the gun however Galvin had these questions Galvin writes\nThe question is what is reasonable\nDoes disobeying a police officer shouting orders constitute the right to use deadly force\nThere's a drug dealer running away from the police deserved to be shot\nWhile they may be criminals are the actions from the police equivalent to the criminals actions church Cordell maybe\nYou should respond a Galvin how do we suss out in a fine or sense what reasonable mess is less than they are they\nAnd the gun however delving had these questions and writes the question is what is reasonable does disobeying a police officer shouting orders constitute the right to use deadly force is a drug dealer running away from the police deserved to be shot\nWhile they may be criminals or the actions from the police glued to the criminals actions to Cornell maybe you should respond to ... how do we suss out in a fine or sense what reasonable mess use\nEnough is in the eye of the beholder it really has no one definition\nAnd what jurors are required to do is put themselves in the shoes of the officer and what was the officers being experiencing and oftentimes incidents happen and\nYou know just a matter of a few seconds so it's there really is not one definition of it but but I Do want us to\nGet to something you said Joshua about you know looking ahead I Believe it's time to we imagine policing in America policing in America today is is ... militaristic\nAnd police departments officers are seen as an occupying force especially in communities of color and in low income community if\nThat's not how policing started in this country policing started with individuals who lived in a community who knew everyone and they were people who were not seen as an occupying force there were people there to basically provide a service and help the individuals in the community and it has dramatically changed\nWe have police departments armed to the teeth with\nTanks and all kinds of of the equipment that uh are commonly used in the military and I think it's time to to change this whole thing we need to start thinking outside the box\nCountry policing started with individuals\nWho lived in the community who knew everyone and they were people who were not seen as an occupying force there were people there to basically provide a service and help the individuals in the community and it has dramatically changed we have police departments armed to the teeth\nWith tanks and all kinds of of the equipment\nThat uh or commonly used in the military and I think it's time to to change this whole thing we need to start thinking outside the box why do we need police officers to basically a patrol and and take care of traffic issues\nWhy can't that come from within the humidity why can't individuals' community members somehow ... ties to deal with with those\nKinds of things that the minor kinds of things that are happening in the community\nMuslim ... disagree with you just by way of politics or simply we're the lower level of sworn more informed off or worse when officer does deal with things like parking enforcement and traffic enforcement things that are less likely to required for\nSure but but but my point is that that our our whole attitude and this is even within police departments they see themselves\nAs this you know kind of a militaristic force\nAnd and they they do have a command structure and ... and and so what I'm saying is that maybe it's time now to say let's pull back from this whole image we have of police being occupiers and look at a different model entirely I'm not opposed to criminal\nTo criminal justice reform but look what happened we we'd get body cameras and what what happens while we have officers who oh don't turn their cameras on or we have places like Chicago where it takes more than a year and a court order ticket footage out on that\nThey do have a command structure and ... and and so what I'm saying is that maybe it's time now to say let's pull back from this whole image we have of police being occupiers and look at a different\nModel entirely I'm not opposed to criminal to criminal justice reform but look what happened\nWe we get body cameras and what what happens well we have officers central oh don't turn their cameras on or we have places like Chicago where it takes more than a year and a court order ticket footage out on for example in liquid shooting so that that's the whole lack of transparency\nPolicing for example has very little sunshine\nThere's very little sunshine and policing we don't get to know who these officers are their track record their history they're disciplined history it's very very difficult to get that information and state\nI think that those pills with the comment that one of our listeners left for us Reggie who lives in Maryland lift list in our inbox\nI talked to police both black and white and uh they seem to have this new look thrifty approach to the community I have had experiences where you know we just simply\nYou know would rather have conflict with a with community rather than actually serve it I really think that they should you\nKnow take away the guns for the first couple of months but leads to buy the inside of the community without guns make 'em stay in the community the force you may have a dialogue with community I think it'd be a lot better uh was serving a community\nWhere did you thanks for calling in and sharing your thoughts with us Neal Franklin I Love you to respond to that but if I could first\nIf we could contrast what Reggie said with another set of comments that we've gone from some of our listeners like what's ... Rhodes Scholar writes police put their lives on the line everyday protecting our society Ninety percent nine zero percent of the ...\nThe first couple of months but at least by the it's added a community without the makeup standup comedians are forced to have a dialogue with I think it'd be a lot better uh which certainly\nReggie thanks for calling in and sharing your thoughts with us Neal Franklin I Love you to respond to that but if I could first\nIf we could contrast what Reggie said with another set of comments that we've gotten from some of our listeners like what's scholar Rhodes Scholar writes\nPolice put their lives on the line everyday protecting our society Ninety percent nine zero percent of the cases put forward by activists as examples of police brutality involve people not complying why is the outrage not centered around these individuals' behavior that got them shot\nIf a cop breaks the law out convict him but if there's any doubt I'm siding with the police one hundred percent of the time\nNeal what would you say to folks who said that police work is inherently difficult inherently dangerous potentially deadly and then we as a public also have a role to play in easing the tension that officers feel about just being able to make it home at night\nSo I Believe it was Reggie that left a message yes um\nYou know that was such a brilliant comment because forcing the dialogue seat when you develop a relationship with those people you are serving the citizens who are serving\nAnd you get their support your job doesn't isn't as dangerous as it is today it you know going back to what the judge Cornell said um\nHow it used to be having relationships walking up and down the street talking with citizens talking with the neighbors when something happens they support you when you had those relationships but when you have this occupying force\nWere you know none of the people who are very few of the people the ones that you do know there's conflict when he under\nServing the citizens who are serving and you get their support your job doesn't isn't as dangerous as it is today it you know going back to what the judge Cordell said um\nHow it used to be having relationships walking up and down the street talking with citizens talking with the neighbors when something happens they support you when you had those relationships but when you have this occupying force\nWere you know none of the people are very few of the people the ones that you do know there's conflict on the under ... on the other end of that relationship\nThat's a problem this goes to community control policing that I mentioned before\nWhere the community sets the philosophy where the community sets the budget for those in uniform where the community\nDecides to the the leader is going to be whether you call them achieve for commissioner or whatever where the community decides what's important with the community decides you know what we can handle these issues that the ground level\nWe just want you to pay attention to people hurting other people and this is how we want you to do that\n\nComing up tomorrow afternoon the Prescott public library\n\nComing up tomorrow afternoon the Prescott public library presents a free writing workshop skim ... order from two to four elements of plots will be presented by Carol eleven to drop the ground plan for your story you can find more events in your community in the event section of our website at can you know you dont orgy\nFunding for Kagan ... comes from nomads global lounge at the historic motel do go in Flagstaff\nInternational beers and wine and eclectic world gnashing menu including Aussie meet in a pie and African peanuts to living room ... with a fireplace and private lounge were group gatherings nomads on south beaver this is Arizona\nPublic radio can a UK puberty Ninety One point seven five staff cayenne eighty Ninety One point seven page cayenne AG Ninety point three Grand Canyon and Jay innate you eighty nine point three Prescott\nListen online at ... dot org for Thirty years of public service of northern Arizona university where it's ten o'clock\nEmpathy or hardness vulnerability courage\nNoble traits for life\nFrom W. A. M. U. and NPR in Washington this is one egg [noise]\nHey there I'm Joshua Johnson today on one a working from the horse\nPoint three Prescott listen online at ... dot org for Thirty years of public service of northern Arizona university where it's ten o'clock\nEmpathy hardness vulnerability courage\nNoble treats for life\nFrom W. A. M. U. and NPR in Washington this is one a [noise]\nEither I'm Joshua Johnson today on one a working from the horse Bernie brown game to following for her research on shame and vulnerability\nHer latest book uses that to help leaders bring out the best in their team [noise] too many jobs demand perfection and obedience for not a safe place to just be ourselves or make mistakes but brown argues that wholehearted workplaces are not just more enjoyable they're more successful\nWe'll dig into her book dear to lead and we'd love to hear from you what's helping your employees bring their best souls to work\nFor what's getting underway\nComments on our Facebook page or tweet us that one day [noise]\n\nLive from NPR News in Washington I'm Laurie London UN ambassador Nikki Haley is planning to leave the Trump Administration NPR's Windsor Johnston reports in a surprise decision Haley announced chill resigned by the end of the year\nSpeaking alongside President Trump that the White House Hayley said it's been in honor of a lifetime and blessing to serve in the position\nI in fact you're lucky girl kind of an animal that lead to state that raised me and she served a country I Love\nMuch Haley had strong defender of the administration's foreign policy agenda is receiving some advance outgoing praise from Trump\nDone a fantastic job and we've done a fantastic job together we've solved a lot of problems or one of the process of solving\nSusan Haley announced chill resigned by the end of the year\nSpeaking alongside President Trump that the White House Hayley said it's been in honor of a lifetime and blessing to serve in the position\nI'm such a lucky girls have been able to leave the state that raised me and to serve our country I Love\nMuch Haley as strong defender of the administration's foreign policy agenda is receiving some advance outgoing praise from Trump\n... his job and we've done of it is your job together we've solved a lot of problems or one of the process of solve it a lot of problems\nTrump isn't ruling out the possibility of Haley serving in another capacity is expected to nominate her successor within the next several weeks winter Johnston NPR News Washington\nAs hurricane Michael approaches the Florida Gulf Coast governor Rick Scott is urging residents to take this one seriously\nDon't take a chat a hundred and twenty mile an hour winds\nWere going to have twelve inches of rain in some places but twelve feet potentially a storm surge do not take a trip\nHe says impact will start to be felt as soon as tomorrow so residents really need to prepare now it's a massive storm that could bring total devastation to the state especially the\nPanhandle hurricane Michael is forecast to be the most destructive storm to hit the Florida Panhandle in decades the storm will be life threatening an extremely dangerous\nMichael is expected to make landfall as a category three storm with the potential for twelve foot storm surge from Tampa all the way to Pensacola\nJournalists are protesting across Pakistan to demand an end to harassment and censorship NPR's dia de reports from Islamic bought the protests come after a prominent columnist was forced to appear in court on charges of treason\nJournalists gathered outside these all the bad press club\nThe storm will be life threatening and extremely dangerous Michael is expected to make landfall as a category three storm with the potential for twelve foot storm surge from Tampa all the way to Pensacola\nJournalists are protesting across Pakistan to demand an end to harassment and censorship NPR studio ... D reports from his Lama bought the protests come after a prominent columnist was forced to appear in court on charges of treason\nJournalists gathered outside the bad press club protest\nFor growing concerns that journalists are engaging in self censorship because they all their media outlets have received threats to cup reporting critical of Pakistan's security forces\nMost recently a lawyer demanded it investigation against a prominent Pakistani columnist he's seeking to have him charged with edition activists say the case of sending a message to other reporters to behave due date NPR News Islamic jihad\nMeanwhile turkey is welcoming Saudi Arabia's decision to allow authorities to inspect the Saudi consulates in in Istanbul as part of an investigation into the disappearance of Washington Post contributor Jamal ... Turkish officials believe the show he was killed inside the consulate and had his body\nWas later taken away Saudi officials adamantly denies\nThis is NPR\nA death row inmate in Tennessee says he'd rather die in an electric chair than the state's current method of lethal injection from member station WBUR Pete ... an Blake Farmer reports the convicted murderer is scheduled to die Thursday night\nHours of the Tennessee Supreme Court upholding the state's three drug method of lethal injection attorneys\nFor Edmunds ... they notify prison officials of his preference to die by electrocution\nLater taken away Saudi officials adamantly denies this is NPR\nA death row inmate in Tennessee says he'd rather die in an electric chair than the state's current method of lethal injection from member station WBUR Pete ... an Blake Farmer reports the convicted murderer is scheduled to die Thursday night\nWithin hours of the Tennessee Supreme Court upholding the state's three drug method of lethal injection attorneys\nFor Edmunds ... they notify prison officials of his preference to die by electrocution they call it the lesser of two evils describing the existing lethal injection process as tend to Eighteen minutes of drowning suffocation in chemical burning\nTennessee death row inmates have been unsuccessful enforcing mistake to adopt the one drug methods they argue would be less painful\nIn the last Fifteen Years Virginia and South Carolina have also used electrocution as the back up to legal injection Tennessee west electrocuted a prisoner in two thousand seven and afterward as attorney called the practice barbaric so that should never be used again for NPR News I'm Blake Farmer in Nashville\nAdvocates of taxing fossil fuels are feeling emboldened by a dire un warning about the urgency of combating climate change and a Nobel Prize awarded to to American economist to argue carbon taxes or the best way to address problems created by global warming\nCarbon taxes are designed to make users of fossil fuel such as coal oil and natural gas pay for the environmental damage they cause\nBut neither the warning nor the economists\nResearch is likely to break down the political resistance from Congress and the White House I'm Laurie London NPR News in Washington\nSupport for NPR comments from NPR stations or their contributors included ... makers have go to a meeting a collaborative meeting platform with over\nWarming carbon taxes are designed to make users of fossil fuel such as coal oil and natural gas hey for the environmental damage they cause neither the warning nor the economists research is likely to break down the political resistance from Congress and the White House and\nLaurie London NPR News in Washington\nSupport for NPR comments from NPR stations or their contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more at go to a meeting dot com\nYou're listening to a pre recorded broadcast of one essay on K innate you Arizona Public radio your source for NPR News and talk it's ten oh six funding for K in a new comes from the Native American cultural center at an age you\nEducating to enhance future Native American leadership and encourage strong communities and celebrate the diverse cultural heritage of the state and region surge NA you Native American cultural center on Facebook for more\n[noise]\n\n\nThis is one a I'm Joshua Johnson in Washington when you talk in at work are you still you or do you put on a different persona a kind of a mask just to survive the work day\nIf you feel very guarded at work you are not alone and it turns out how your boss behaves has a lot to do with your answer to that\n... brown has spent years researching effective leadership is a follow up to her groundbreaking findings on shame vulnerability and whole hardness applying those findings to the world of work round as a resource\n[noise] this is one a I'm Joshua Johnson in Washington when you talk in at work are you still you or do you put on a different persona kind of a mask just survived a work day\nIf you feel very guarded at work you are not alone and it turns out how your boss behaves has a lot to do with your answer to that\n... brown has spent years researching effective leadership is a follow up to her groundbreaking findings on shame vulnerability and whole hardness applying those findings to the world of work\nRound as a research professor at the University of Houston graduate College of social work her new book is called dear to lead during greatly and rising strong at work and she joins us here in Studio ... brown welcome to what I Am excited to be here so are many of your fans who've already shared some questions with us and we walk him more of your questions in thoughts\nAbout the world of work work bringing empathy in dealing with vulnerability in the workplace ... ... email us one a at W. A. M. U. dot org\nComments on our Facebook page or tweet us at one day I read the book and you say early in the book that it does follow up to a lot of your previous\nWork I imagine there was a point at which you wanted to take some of the findings you head Bruce you had your develop through your research and apply them were practically especially because you do speak to a lot of business groups across the country around the year\nI did I say I spend about for the past five years I Would say I spend Ninety percent of my time in organizations working with leaders and talking about leadership innovation creativity uh recently talking about an A R I and machine learning and kind of consequences of that that the rise of the machine\nSo you know for me it was probably I don't know six or seven years ago um we had this mission\nThe more practically especially because you do speak to a lot of business groups global cross the country around here\nI Do I so I spend about for the past five years I Would say I spend Ninety percent of my time in organizations working with leaders and talking about leadership innovation creativity uh recently talking about um AI and machine learning and kind of consequences of that the the rise of the machine\n[laughter] so you know for me it was probably I don't know six or seven years ago um we had this mission\nThat kind of where I work at our organization of making the world are braver place and it really struck me that if we don't change the way we work we can't change the world because we spend too much time at work\n\nSunshine returns today along with cool afternoon temperatures I meet her all just be born from Arizona Public radio in Flagstaff our latest all storm system\nExiting the region a few lingering showers across our eastern Arizona today otherwise mostly sunny at high temperatures around ten degrees below average for this time of year similar again on Wednesday hurricane Sergio way out in the Pacific now making a turn towards the United\nInformation on where to find whiskey debacle locally on line at Hamilton distillers dot com\n\nSunshine returns today along with cool afternoon temperatures are meteorologist reborn from Arizona Public radio in Flagstaff our latest ball storm system\nExiting the region a few lingering showers across our eastern Arizona today otherwise mostly sunny and high temperatures around ten degrees below average for this time of year similar again on Wednesday hurricane Sergio way out in the Pacific now making a turn towards\nThe United states in the southwest it looks like it's going to miss us to our south and east but enough moisture makes reinforce scattered showers and thunderstorms Thursday\nTonight the College of arts and letters film series presents the four hundred blows during ... owns the movie starts at seven PM in decline library assembly hall you can find more events in your community or post one of your own in the event section of our website at can you know you dot O. R. G.\nThis is getting you know you Arizona Public radio with one hey listen to all of our programs online that key in a huge dot org it's ten twenty\nSupport for NPR comes from the station and from bona with a bona certified craftsmen program a network of hardwood flooring contractor is committed to expertise and customer service contractor locate her and more information or at bona dot com [noise]\nFrom progressive insurance suffering it's home quote explore so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learn more progressive dot com and from the listeners who support this NPR station\nWon a I'm Joshua Johnson we are discussing empathy and vulnerability and how they can help make some of the best employees bosses and workplaces with ... brown her new book is called dear to lead we'd love to ...\nFactor locate her and more information or at bona dot com [noise]\nFrom progressive insurance suffering it's home quote explore so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learning more it progressive dot com and from the listeners who support this NPR station\nThis is one a I'm Joshua Johnson we are discussing empathy and vulnerability and how they can help make some of the best employees bosses and workplaces\nWith Bernie brown her new book is called dares elite we'd love to hear from you to share what you know about creating empathetic wholehearted workplaces or what's getting in the way comments on our Facebook page tweet us at one a or email one at a at W. A. M. U. dot board\nSpeaking of the world of work there's been some breaking news this morning about a woman who is choosing a new job and is resigned from her current position\nNikki Haley America's ambassador to the United nations announced her resignation this morning\nHaley is formerly the governor of South Carolina has somewhat international reputation for being willing to take on her boss from time to time she told the New York times she doesn't agree with the president on anything but it's on everything but says there was a right and wrong way to address that will pick up the phone call them or meet with him in person\nShe'll also be remembered in part for striking back at White House adviser Larry Kudlow who suggested she might have been confused regarding Russian sanctions she told Fox News with all due respect I don't get refused to go get confused\nShe and the president met today at the White House she lavish praise on him and his family he was part of what ambassador Haley said\nCan't say enough good things about Jared and Iraq I have I have\nNow I understand I mean can read and after the on again on what I'd done working with him on the middle east peace of mind it is so don't leave them\nWho suggested she might have been confused regarding Russian sanctions she told Fox News with all due respect I don't get don't get to see she and the president today at the White House she lavish praise on him and his family he was part of what ambassador Haley says\nCan't say enough good things about Jared Nevada guy Jared is such a\nGenius that no one understands I mean to redo the NAFTA deal the way he did um what I've done working with him on the middle east peace plan it is so unbelievably well done and an office in just a great friend and they do a lot of things behind the themes\nThat I Wish more people knew about because we're a better country because they're in\nUm this administration I also just have to say I'm certainly thank you to my family Michael at the same and um my two little ones I adore than entertain us she went you know they sacrificed a lot they put a lot of time\nAnd energy into it um but they have a lot of heart and really wanted to make America proud and so with that\nI'm not leaving until the end of the year my goal is that we make sure that everything is in good flakes and on for the next ... to come in but now I don't have anything set on where I'm going to go I think that um the main thing was\nI was governor for six years and we've dealt with a hurricane a thousand year flood or church shooting a school shooting there was a lot and then to come in\nAnd just a few years of Russia and Iran and North Korea it's been eight years of intense time and I'm a believer in term limits I think you have to be self let's enough to know when you step aside and allow someone else to do the job so thank you for the\nAnd I will say this I'm for all of you that are going to ask about twenty twenty no I'm not running for twenty twenty I can promise you what I'll be doing is campaigning for this went so\nFor six years and we dealt with a hurricane a thousand year ... shooting a school shooting there was a lot and then to come in\nAnd just getting years have Russia and Iran and North Korea it's been eight years of intense time and I'm a believer in term limits I think you have to the south was enough to know when you step aside and allow someone else to do the job so thank you that's\nAnd I will say\nThis I'm for all in here that are going to ask about twenty twenty no I'm not running for twenty twenty\nI can promise you what I'll be doing is campaigning for this one so I'll look forward to supporting the president\nBut his Nikki Haley the U.S ambassador to the United nations speaking just a few minutes ago at the White House announcing that she will be resigning from that post back now with our conversation with ... brown and maybe by way of a transition\nWe should get to an email from Hillary who says I've noticed more attention since the twenty sixteen election of President Trump how has that changed the work environment have you noticed a difference\nOh absolutely absolutely I don't think work I think this is the whole point work is not immune from the larger culture and I think we have seen just like we've seen\nIncreased polarization in our families and our neighborhoods among our friends at work too and it feels dicey or at work um I think that\nPeople have to be careful and especially when there's power differential Z and it it's I I actually believe it's become a pretty significant source of anxiety at work and home\nJust being able to talk politics or culture or any of these other dividing line\nYeah cause everything feels like it's one step away from getting into a cultural debate where we find other people's opinions and comprehensible\nWell see I Wonder if that kind of for people who are not inclined to kind of open up if that orders toward keeping the profession\nPeople have to be careful and especially when there's power differential Z and it it's I I actually believe it's become a pretty significant source of anxiety at work and home\nJust being able to talk politics or culture or any of your other dividing line\nYeah cause everything feels like it's one step away from getting into a cultural debate where we find other people's opinions and comprehensible\nTo see I Wonder if that kind of for people who are not inclined to kind of open up\nIf that ... toward keeping the professional and personal separate that at work I just needs to be this one person I Need to keep my head down and get to not make waves I Need to be obedient I Need to be efficient I Need to do the job and get the hell out of there\nAnd the minute that we started talking about emphasizing and being vulnerable looming urban and compassionate and knew that opens the door for me to say something about how I voted or you know whether I own a firearm or who I pray to or who I Love\nThat's going to turn into a gigantic wildfire at work like it almost feels like\nIt's an easy way to give yourself ammunition to put on more armor instead of less\nI think you're absolutely right and here's the hard answer I've never seen anything meaningful or significant come from mouth shut had down\nIn my career\nThat's just not how we make contributions and so what we have to do is learn how to listen talk here each other\nAnd rumble and we use the term rumble because it really feels like a rumble rumble with the vulnerability of seeing other people as people and being seen as a person and it's a muscle it's a foundational skill set\nI don't think spending what ... what do we spend about ... about a half of our adult lives at work I don't think\nThat's just not how we make contributions and so what we have to do is learn how to listen talk here each other\nAnd rumble and we use the term rumble because it really feels like a rumble rumble with the vulnerability of seeing other people as people and being seen as a person and it's a muscle it's a foundational skill set\nI don't think spending what ... what do we spend about ... about a half of our adult lives at work I don't think spending half of our adult lives in armor\nIs something that most of us are willing to do I think the psychological emotional spiritual and physical costs are too high\nAnd we're not solving problems I Need you to bring all of you to work I Need the combination of all of your experiences all of who you are to address the problems\nFrom reading your book and based on the research that fueled the book a lot of what you describe points to that kind of armor as an indicator of where something is wrong it's almost like a star yeah you know stars tough because the wind is tender right and so if there wasn't something tenders there'd be nothing to protect\nNo that's exactly it and I think one of the big ideas that came from the book that really it was actually voided my hypothesis going in so where did you arrive\nYeah it just it completely ... just shot out of the water and I and I'm usually pretty good at Jesse what I'm going to find but not in this case so\nWe asked a hundred and fifty sea level leaders that there is a lot of data that we use so interviews with a hundred and fifty sea level global leaders\nThree years building a daring leader assessments that people can see where they are and these were NBA and NBA students at Wharton Kellogg Rice University and then\nTons of data evaluation data [noise]\nTruly voided my hypothesis going in so where to drop off yeah yeah it just it completely ... just shot out of water and I and I'm usually pretty good at Jesse what I'm going to find but not in this case so\nWe asked a hundred and fifty sea level leaders that there is a lot of data that we use so interviews with a hundred fifty sea level global leaders three years building a daring leader assessment so people can see where they are and these were NBA and NBA students\nAt Wharton Kellogg Rice University and then tons of data evaluation data so I thought when when when it was\nClear that the future of leadership is about courage we need braver leaders and more courageous cultures I thought the barrier was going to be fear but then we went and talked to several dairy leaders and said so you're not afraid very often and they were like\nI'm afraid every day I'm afraid all day long\nAnd I was like so that blew my hypothesis of fear being the greatest barrier to dairy leadership the greatest barrier to daring leadership is armor\nIt's not the fear it's how we self protect when we're in the fear is the perfectionism the pleasing the defensiveness the anger\nThat having to be the newer and get everything right instead of being the learner um so really\nYou know and it's interesting what you said about scars intend to places not only does armor keep other people from seen us and sharing ourselves with other people armor protects the fear and less it faster and grow\nAnd metastasize so we need to create work cultures were armor is not rewarded or needed [noise] we\nAnd it's interesting what you said about scars intend to places not only does armor keep other people from seen us and sharing ourselves with other people armor protects the fear and less it faster and grow\nAnd metastasize so we need to create work cultures where armor is not rewarded or needed\nFor this time of year similar again on Wednesday hurricane Sergio way out in the Pacific now making a turn towards\nThe United states in the southwest it looks like it's going to miss us to our south and east but enough moisture make three and four scattered showers and thunderstorms Thursday\nTonight the College of arts and letters film series present the four hundred blows during ... the movie starts at seven PM and declined library assembly hall you can find more events in your community or post one of your own in the event section of our website at can you know you dot O. R. G.\n[noise] I'm used to ... a legal battle rages over a question on the twenty twenty cents as the Trump Administration wants to ask about the citizenship status of people living in the U. S.\nOpponents said that's unconstitutional and now justice Brett Kavanaugh would tip the balance and decide who wins that that all the latest from inside the divided Census Bureau next time on hearing now [noise]\n\nHere we are now begins in about twenty minutes on Arizona Public radio can you know you your source for NPR News and talk one eight continues its ten ...\nWhen the census the Trump Administration wants to ask about the citizenship status of people living in the U. S. opponents they that's unconstitutional and now justice Brett Kavanaugh would tip the balance and decide who wins that battle the latest from inside the divided Census Bureau next time on here in now [noise]\n\nHumor now begins in about twenty minutes on Arizona Public radio Kane you your source for NPR News and talk one it continues its ten forty\nSupport for NPR comes from the station and from his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nAnd from visiting angels professional caregivers assisting adults in bathing dressing meals and light housework nationwide visiting angels America's Choice in senior home care office locations ... visiting angels dot com\nMore with Renee brown and just a moment but first we love your help with the next installment of our special series the state we're in we're doing it on Mondays for the next few weeks the federal government is often deadlocked on passing legislation but there's a lot happening at the state levels this Monday we'll dive into trends on new state health care law's from\nLowering prescription drug prices to expanding Medicaid to fighting the opioid crisis what's being debated in your state house on health care or drug pricing or Medicaid expansion or something similar on the ballot next month\nIf so leave us a voice mail eight five five to three six one a one a what are your governors or your local lawmakers want to change about health care\nIt's often deadlocked on passing legislation but there's a lot happening at the state levels\nThis Monday we'll dive into trends on new state health care law's from lowering prescription drug prices to expanding Medicaid to fighting the opioid crisis what's being debated in your state house on health care or drug pricing or Medicaid expansion or something similar on the ballot next month if so leave us a voice mail\nEight five five to three six one a one a what are your governors or your local lawmakers want to change about health care and do you feel like these proposals would hurt or help you access to care you or your loved ones may need\nTell us your story eight five five to three six one a one a or you can use our app won a vox pop to send us a radio quality audio file and to keep up to date on future topics you'll find one a vox pop V. O. X. P. O. P. in the app store\nAnd we'll share some of your stories on Monday when our series the state we're in continues on one day\nBack now to our conversation with ... brown author of the new book dear to lead with regards to arm or Monday sold emailed can you address the differences between armor and establishing and maintaining healthy boundaries\nYeah any boundaries are actually a big part of this box because down trees are incredibly important um we defined it very simply as what's OK and what's not OK and so armor is not about\nProfessional management of south it's not about four going boundaries armor is about defense it it is I Am going to put the protection of my ego before\nDoing right by this business and the work that we're doing together I meant to protect feeling good about\nYeah I mean boundaries are actually a big part of this book because batteries are incredibly important um we defined it very simply as what's OK and what's not OK and so armor is not about\nProfessional management of south it's not about four going boundaries armor is about defense it it is I Am going to put the protection of my ego\nBefore doing right by this business and the work that we're doing together I meant to protect feeling good about myself\nOver moving our work forward\nTo the difference between so there's a difference between say armor an image\nSuch as kind of self that you portrayed other people to kind of keep bad things and it's it's ... it's on a deeper level now\nIt's on a day but I mean the one of the greatest examples of armor armored leadership versus daring leadership has one form of armor we see a lot and folks is the need to be right that it's that I've got to be the ... and I need to be right and that's more important to me than being the learner and getting that right\nWe got a number of comments from those of you about the way that race plays into workplaces and hope emailed can you speak about the ways in which racial power structures and broader society that manifest themselves in the workplace\nDisproportionately impact the contributions of people of color in their work and the extent to which they progress in their careers before you answer here's one example professor ... tweeted\nAs a woman of color an immigrant and an academic I've learned that showing vulnerabilities and even my own resilience can and will be used against me by those in power would love to hear professor brown talk about overcoming that distrust well here's one of the\nBiggest findings I think is that\nOne of the greatest casualties of trauma is the is the law says\nProportionately impact the contributions of people of color in their work and the extent to which they progress in their careers before you answer here's one example professor ... tweeted\nAs a woman of color an immigrant and an academic I've learned that showing vulnerabilities and even my own resilience can and will be used against me by those in power would love to hear professor brown talk about overcoming that distrust\nWell here's what are the biggest findings I think is that\nOne of the greatest casualties of trauma\nIs the is the loss of vulnerability and when I talk about trauma I don't just mean a traumatic and said that I mean racism homophobia poverty white supremacy I mean privilege\nDesert desert everyday traumas and it is real that ... that you know the armor that you need to survive those things Israel which is why if leaders don't work to create a culture where when you're here you can take that off and be seen\nThan we can't I mean gender as another you know I I think the kind of Anita Hill criticisms that happen after the for testimony where you know Ford was more compelling because she was more vulnerable\nAs opposed to Brett Kavanaugh who is just kind of fun during a way that we're more data all got your dad who was\nYou know but absolutely vulnerability can be used against us um and I think that is a that is in itself a form of systemic racism\nBefore we keep going I Would like to talk a little bit about something else you mentioned in your book you talked about core values and I don't think any of us has worked at a company that doesn't have some kind\nOf mission statement or vision of clarification or posters everywhere saying this is we're supposed to be and then it's really worth nothing more than the ...\nJust kind of fun during a way that we're more will eat all got to know who was\nYou know but absolutely vulnerability can be used against us um and I think that is a that is in itself a form of systemic racism\nBefore we keep going I Would like to talk a little bit about something else you mentioned in your book you talked about core\nValues and I don't think any of us has worked at a company\nThat doesn't have some kind of mission statement or vision or clarification or posters everywhere saying this is who we are supposed to be and then\nIt's really worth nothing more than the paper on which was printed I work at some companies wind been to some companies were the value statement was like Fifteen bullet points Laura I'm like well what what was even start\nYou suggest that we should limit our core values to to just to and there's a long list in the book I'm trying to find a because there's a lot on the list and I really struggled to Merrill down to my to why only two\nWell here's a big\nOperation allies values into observable measurable behaviors that people can be held accountable for demonstrating then you just really do have a cat poster\nI mean it really it just really a poster [noise] so ... reporting on my head but little tell yeah [laughter]\nYeah yeah yeah I've got a Thirteen year old son I Know it [laughter] you know and so what\nSo you know operation lies values into behaviors fewer than ten percent of the organizations we've worked with had actually done that had taken the time to say you know what I some assumption of generosity is our value and here are the behaviors that we will hold each other accountable for endangered in\nAnd so the two is\nReally kind of backing into the data the men and women who had the capacity to be the ...\nNo it [laughter] you know and so what was so you know operation lies values into behaviors fewer than ten percent of the organizations we've worked with had actually done that had taken the time to say you know what\nI some assumption of generosity is our value and hear the behaviors that we will hold each other accountable for endangered in\nAnd so the two is\nReally kind of backing into the data the men and women who had the capacity\nTo be the most courageous could identify their values\nThey had two to three values and you know I have you know there's a long list in the book like we talked about and there's hardly Fifteen things on there that are important to me\nAltruism collaboration curiosity dignity diversity independents self discipline patriotism vulnerability wealth wisdom future generations harmony health recognition there's it's a long long list\nYes so I there's probably Fifteen or twenty things on that list that are super important to me but when it comes down to it my two Corvette my to core values for me or faith encourage and I know that the core values because it's the place where every other things on that list is tested\nAnd so we really we have an we have a companion work buckets free it's downloadable it's on my website where you can do your own values exercise to figure out what your to our and an operational as an end to behaviors\nUm it has changed completely the way we all work together we all know each other's values we understand them we hold each other accountable for them\nAnd then we have our company values and that's actually how we assess you every quarter\nRecently values that you were to do with\nLike for example one of our values is take good care taking care of each\nWe have a companion work buckets free downloadable it's on my website where you can do your own values exercise to figure out what your to our and an operation allies and into behaviors\nUm it has changed completely the way we all work together we all know each other's values we understand them we hold each other accountable for them\nAnd then we have our company values and that's actually how we assess you every quarter\nLoose on the values that you were to do it\nLike for example one of our values as take good care taking care of each other ourselves in the community we serve and so one of the things that we measure is I don't talk about people I talked to people\nI mean you either do it or you don't and so I think it goes back to something we haven't talked about yet that as a real core finding which is courage is one hundred percent teachable\nIt's for skill sets each of the skill sets are behavioral and can be taught\nIt's learning how to rumble if on her ability living into your values which we're talking about right now it's braving trust understanding how to talk about trust and breaking it down so we can talk about the anatomy of trust and learning how to rise how to get back up on your feet after a fall or a setback", "year": "2018", "show_name": "1A Plus", "city": "Flagstaff", "day": "09"}