{"month": "10", "state": "TX", "station": "KTDH", "content": "Or\nFrom your favorite home grown as international art\nAs much as\nMonday through Thursday from nine pm to midnight central\n[noise] this is Ninety One point five Katie ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nThe availability of H PBR Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n[noise]\n\n[noise]\nHi there welcome to demons groups and other things that go bumped into night it's exploring music but it's Halloween we either it's for my last one [noise] you know a lot of the room doesn't celebrate the scariest night of the year on October thirty first [noise] for a lot of the world the scariest made is St john's night [noise]\nAnd that's the time and a lot of the old rituals and these are ancient rituals about getting rid of winter\nAre celebrities and there are fires up on the mountains and a lot of the Eastern European countries don't make a figure of winter hard on which will woman ... out in the ... boat and let her go down a river burning disappearing it helps bring forth the harvest\nThat's the setting for ... most famous shored scary piece night on bald mountain\nAnd it follows a form rather like that at the beach we heard from commute on science yesterday dust ... again it's a lot of ... up a storm and then once again when things could hardly get more terrifying\nComes the sun picking up of the income returns to the mountain and this performance Eugene Normandy leaving the Philadelphia Orchestra music ...\nNight on bald mountain\n[noise]\n\n\n\n[noise]\n\nWhat\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\nMm\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nUm\nNo\n\nNo [noise]\n\n[noise]\n\n\nOh [noise]\n[laughter]\n\n\n\n\nI\n\nGotten a\nFun [laughter]\n\nUm\n\n\nPhone call on this dog [laughter]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nHow\nOn the recording from\nA\nA or\nA\n\nBar\nOr a girl in a\n\n\n\nLot more [noise]\n\nUh uh you know\n\n... or\n\n\n\n\n... or\n... whoa whoa whoa\nWhoa whoa whoa\nWhoa\n\nWhoa\nWhoa whoa a\nA\n\n\n\n\nI'm a\n... a\n\nMonth that we're here to guard is\nGreat but it's hard on this ... this since it was coming down the hall growing up swings the nights where was dragging when passing by sleigh Mendelssohn that group they're having a little fun poking their finger at the town's folks must see over civilized compared to these druids\nFor the on the hurts remembers looking right on going now through to the conclusion the air's temple ... who's like a mental\nImage but when you ... you\nKnow all the way things\nAre better on my way of saying no no I\nDon't know what I'm\nSaying no no no no\nNo\nNo\nNo no no no\nNo no no\nNo no no no no no no no\nNo no oh whoa whoa\nFor twenty Eighteen JFK silver lie that H. P. P. R. Garden City Saturday November ten RSVP H. P. P. R. dot org the there\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or call eight hundred six seven eight seven four\nFour four support for high plains public radio comes from Dr Sean Milligan specializing in neurology at the essay Amarillo diagnostic clinics since two thousand five more information at a D. C. P. A. dot com\n\n\n\n\n\n\n\n\nSkinny music boys and girls from it marked Greek in the hall of the mountain king high there is no McLaughlin welcomed Hertzberg music hour's theme this week demons books and other things that go in the night including robes\nRobes sometimes go up and then like and we just make one rogue pure getting based on the character of every Gibson\nAnd we have another robot waiting for us at the end of the hour time Russia after the meantime let's go here's some ... ... Barton pine\nShe's playing a piece called romance of the ... or\n\n[noise]\nMm\n[noise]\n[noise]\nAnd [noise]\nAnd [noise]\n\nUm [noise]\n[laughter] that peace is definitely difficult but it doesn't seem to scare or were violinist Rachel Britain pine who just blaze through that with Patrick Symmes if it's at the piano music on Tony ... butts Seaney\nThe round dance at the goblins but Seaney born in ... in Italy and Eighteen Eighteen he used the next generation of Italian future wasn't by ... after they caught a bucket needy\nAnd following the footsteps of ... but you need like to make a lot of music about devils and goblins and speak to the devil sorry\nHe's a ... down the block from working Rodrigo or two peas are playing this is a twenty century devils that's\n\n\nIt was gene mine conducting tougher music wonderful artist or from Toronto the policeman period instruments music of Luigi ... their final moment of these two pretty minor cold like ... do the outlaw nature is a hundred house\nProtein Emily Dickinson but aren't aren't as a house that tries to be haunted\nHere's music I'm sure to be getting from the second ... ... ... ... the demos staircase you're on a Marr is a pianist\n[laughter]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nMm [noise]\n\n\n\n\nListen to that endless ring out\nOf those last brands bumps it's a little bit like we can from a dream you'll start to fix coffee but you can't shake the memory of the dream that's the way that ring out of that last um strikes me\nThe devils staircases the name of the ... to do ... there was a wonderful pianist be alone a mar\nYou're tuned into exploring music I've seen this week demons books and other things that go up in the night Trump is aligned insect suggest some more music I won't do this again sometime write to us via our website exploring music orgy\nSupport comes from chamber music Amarillo presenting classical concert last well oh crafts piano trio featuring works by ... and for a Saturday November third eight PM at the the notch you see it may it may dot org Mm\nClassical music allows you to take an internal look at other cultures and distant times it provides a sense of eternal beauty of history and a compassion\nExperience this great music on since ... each weekday at one pm central time on high plains public radio [noise]\n\nWe've been listening to a lot of music inspired by the devil even if it's playfully inspired by the devil but of course the devil is not the only spooky creature out there to inspire composers you find lots of other ... creatures if you go back into mythology folklore folk tales\nFor example in Germany is a terrifying character the Earl King who is the subject of a very frightening point bike or two and then even more frightening song by French Schubert listen to these first alliance\nSeattle it's neat though she knocked on the end it's just their father Mitch designing can\nWho's writing so late night that's terrific when why is the father with this child with a horse behind the Charles frighten keeps calling us father did you see what's running behind his\nDeath\nThis song takes four voices from one singer the first is the part of the narrator is telling us the story and this is on here in a high clear tone sort of like the evangelist at a passion that we had the father's voice these deep voice it's actually voice it's a mess\nHere in height your tone sort of like the evangelist and the passion and we had to find his voice these deep voice it's actually voice it's a mental a voice that we've got the child's voice and then of course ... late\nShe talked to you for I think Peter Laurie\nAnd here's a singer who can handle all of these sports voices\nBecause Britain turbo with no money no\nThere are a picnic\nMhm\nMm\nMm\nNo history jeeze ... Oscars [noise]\nBe able to\nFix\nThis man named Steve\nAnd he's he's a composer he told me one night is Michael ... and did some er marriage is Ravi Coltrane stupid piece so here's the rub equal treat your some of the ritual dances from the mid summer marriage typically composer conducting the English northern from ammonia\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nWe're bailing out there there's more music and wonderful check it out [noise]\nMusic were playing today not only an honor the feast of St john's day which of course I presume mid summer but also of my friend Ravi Coltrane this is his favorite music of Michael typically ritual\nDances from the mid summer marriage [noise]\nMy promise we would be one more robust before we were done with today's show or the Robie is indeed\nTime Moshe hunters his name a good natured but taking the drink here's the story\nIs market day and as usual ... it's a little bit of money in his pocket goes into the ... and ... so senseless when they get together and that little tavern near the town of air in Scotland they sing Scott students together you hear the Sudans almost right away it sounds like to hold drunks with their arms around each other trying to keep together\nAnd it's just about to leave at\nMidnight and his wife has told me to be home before midnight because you run into spoofs but old comes out shadows is horse maybe gets up on her show to shake Li and sets off his pass goes past an old abandoned church aisle away", "show_name": "Exploring Music with Bill McGlaughlin", "year": "2018", "city": "Dalhart", "day": "31"}