{"month": "10", "state": "TX", "station": "KTDH", "content": "For national Hispanic heritage month we revisit Sandra Cisneros tend to love novelty house on Mango Street\nAs she shares some of her fiance challenges in touch me to write and that ... throughout the world and I just feel like I'm pushing a bill could my forehead even if I just write one sentence let alone a book Sandra\nCisneros national medal of archery ... letters on the [noise]\nWednesday morning at three central\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da di di di ... point seven KGAN Hayes a service the high plains public radio\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to each BP are to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\nEither welcome to spring music it's McLaughlin our seen this week is\nAutumn leaves all sorts of a tumble music we're starting off today with music of the Norwegian composer advised the Greek on me to visit to England in Eighteen eighty eight forty five years old and he was coming to Birmingham conduct some of the famous try any old music festival concerts there out in the city\nYou but with my brand new piece for the English audience autumn an overture based on a time he'd written a little bit earlier cold autumn storms so let's see if Greeks autumn overture lives up to which the army inspiration\n[noise]\n\n\n[noise] [noise]\n\n\n\n\nMm\n\n\n\n\nMm\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\nAs that is it's a little bleak [noise]\nLet's put a couple of pieces together starting with a mostly from the American violin is the composer Merkel Connor [noise]\nComposed and um it's too soon you'll be bombed the she called the American seasons\nThat's your fault [noise] tickled to death [noise] little by way of Robert Frost\n\n\n\n\n\n\n\n\n\n\n\nMm\nMm\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\nOh\n\n\nLovely treatment by composer did we're I'm familiar Robert Frost text stopping by woods on a snowy evening that was metro Sopranos Susan Graham with my mom you know what the piano so lovely little pieces named\nSusan Graham told me that as a teenager growing up and brought to Mexico and Texas she used to volunteer at public radio stations\nDoesn't seem to have heard her career any wonderful singing from Susan Graham in nice piece from Denver on before that we heard Michael Connors\nFall the third part of his the American seasons that is the metamorphosis and cheaper just are connected by sky you and you may have noticed an extremely high note there at the end that's ... s\nJust by way of orientation guy so she was middle see on the piano\nThere's an effort here just for now it's about it\nAnd they said ... and I come back\nAnd then the next knocked on that all the way up to the top of the piano\nIncredibly\nHigh pitch cut my ear and made me wonder if I looked in the program that's an here's an email from mark what kind of thing normally I wouldn't do that to myself meeting hang onto that incredibly high after foreign lung measures but he says\nThe high note there at the end top s just by way of oriented ourselves here's middle see on the piano\nThere's an effort here just for notes above it [noise]\nAnd there's an that's an octave above that [noise]\nAnd then that's an octave above that and then this is all the way up to the top of the piano\n[noise] that incredibly\nHigh pitch cut my ear and made me wonder so I looked in the program nuts and here's a note from or what kind of sing normally\nI wouldn't do that to myself meeting hang onto the incredibly high after four more measures but he says the music took me there was no other way to write myself another direction lovely music for Merkel Connor and ... it turned into exploring music in our seen this week is\nAutumn leaves drop his mind write to us via our website exploring music dot O. R. G.\nHi I'm Jonathan bigger and I hope you find living on the high plains as fascinating and wonderful as I Do if you do and you're like hearing stories about this unique place we all live and go to each PBR dot org implied your support today\nI'm Michael so much and we're seeing ... talks about the story are good to complete Patrick Melrose novels adapted into a series on Showtime story of someone very\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nI Want you to hear the sound the when they signed the trees at the buzzer that peace we just heard for the daily is from his North Country sketches we got the first woman act by Charles my car is and the artist or the national opera\nDecor and second that that lovely iron someone at the world class as far as I'm concerned\nNothing music for English impression this composer born in Nineteen sixty two and now I Wish you hear from French Impressions was born that she near what we see\nFrom his second book a piano pretty strict peace with the unusual title for you bought the leaves\nGeorge ... at the piano\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nGuitar alive as we feature this hidden also music for two guitars by Argentine composer mocks him ... years ago poll this week on classical guitar alive [noise] Thursday evening at seven central [noise]\nThis is Ninety One point five K. C. XP ... eighty nine point three Katie da ... Ninety One point seven KGAN Hayes a service of high plains public radio\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles the H. P. P. R. to volunteer just email us at H. PBR at H. P. P. R. dot org\nSupport comes from the office products a phone line commercial offer solutions company currently serving sixty Kansas counties with locations in Garden City dodge city ... injunction city more information at key office products dot com [noise]\n\n\n\nHello there welcome to spring music it's bill McLaughlin are seen this week autumn leaves and we have great for music from ... from the opera Cecilia investors I hadn't known there was any dance instead to invest ... did you I mean it's a wonderful great medieval tragic story but [noise] yeah it came from the Paris Opera\nWhen vary from year to assist you invest prison there in the early Eighteen fifties the management of the opera company reminded them of the French tradition we will have valley in every act as so very wrote for bally's\nOne for each season here's the music radio ... with conductor Roberto abide though\nWonderful sort of mysterious music from Verde and then wonderful festive music\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nThat's a beautiful piece isn't it music I've learnt ash more and it was a composer from his four seasons we heard the third movement autumn\nThat was Richard spokesman the clarinet is but the goal string ensemble under Robert Salter fixed don't spend has an unbelievable quality to just diminished the sounds soft and softer told there's really no and beautiful music from Lawrence ash more\nProgram notes here contributed by Andrew burn told me that in the movement autumn we could hear the early Nineteen century ballad cherry rape\n[noise] I don't know that you do you do write in\nSpring music better where'd you let us know what's going on there well now let's explore two sides of the pianist Daniel burned by that point because my mom is very well known as a conductor of course\nI'm going to hear him first playing a piece which he must have learned means probably eight or ten years old if not younger from middle since Sunday without words we hear the younger lead which is the hunter sun\nEver go directly from that into a strip you told us\nWhat ... what Daniel is false tango\n\n\n\n[laughter]\n\n[noise]\n\n[laughter]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\nMm\n\nMm\n\n\n\n\n\n", "show_name": "Exploring Music with Bill McGlaughlin", "year": "2018", "city": "Dalhart", "day": "03"}