{"month": "10", "state": "TX", "station": "KTDH", "content": "And so what we need to do is we need to start meeting like I did with a mayor or city managers economic developers as many people as we can\nUh you know in these communities so we can hear what what they have to say about their community and the expansion and then a devised a plan and move on that plan so we can see Kansas move forward and prosper and a great away thank you [noise]\nI Would recommend to both\nAgencies to not\nBe to controlling I Would recommend returning the power back to the communities\nAnd allowing for local organizations to come together and fund raise along with working with their local elected officials in order to make something happen in their local communities I Believe that to peak of needs to shift the way that governs and it needs to allow for infant\nInformation should be brought back to the people of Kansas so that being said we need to make sure that you are aware of all of the things that are happening within the state government but then that also requires us to make sure that you are aware of what's going on in your local community\nThere is a disconnect right now between local city government and the state government and that needs to end there has been legislation that has been passed that helped\nPut a blockade in between the two so we need to work together and we need to return the power back to the local areas [noise]\nSenator hell I [noise]\nYou know over the past six years or so over two point five billion dollars has been taken\nFrom the Kansas department of transportation projects had been delayed or cancelled and maintenance is not getting done and all of that was taken without one dime being spent on Medicaid expansion\nWhat we need to do is to win the budget to stabilize look in a way to start restoring what we always promised a tour highly program that we would give you a percentage of the sales tax you could build your fun and you could create a ten year comprehensive plan\nA and go full of these projects that our community so desperately need and in terms of broadband\nThis is going to be tough you know there are a lot of competing forces in Topeka uh some who are interested in coming out and building the broadband a across the area are there others who don't want that to happen it's gonna take a governor\nWho can sit down with warring parties and bring them together reach consensus and do what's in the best interests of Kansas at the whole [noise]\nWell this question\n\n\nWell this question sort of UBS is at the intersection of two of the detailed plans that John and I put out first\nWe've talked about in all of Kansas plan that includes not only investing in rural broadband but making sure every Kansas citizen lives within forty miles of a co working facilities so that we can have people\nUh live the lifestyle they want to live and and and western in rural Kansas they can hunt and fish on the weekends\nThey can have their kids ride their bike safely in the neighborhoods and they can access jobs with the twenty first century\nThere's no reason why any job that's done in Kansas City can't be done in rural in western Kansas if we do this right\nOr the second thing as it relates to an F a structure we clearly need to get back to the point where we're investing in our infrastructure we've called for an additional eighty million dollars a year it's not the full amount that's been stolen from the bank of hate out but I think we have to be realistic\nAbout where we are and we're we're not going to be able to restore a hundred percent of that funding the roads and bridges right away without raising taxes and that's not something that I Want to do so we need to restore a another eighty million a year and get us back into the point where we're investing in that infrastructure [noise]\nKobach person who did governor is being honest with the people of Kansas and being willing to make a tough choice now when ... and Kelly just answered the questions you said oh we can don't worry we can we've been taking away money and we haven't got expanded Medicaid but which is also tells you is she's going to spend all the money that we need to spend on our roads all agree we need to spend that\nAnd she's going to expand Medicaid which will cost the projection is one point one billion the actual cost probably three to four billion so if you're gonna spend all that money and just say oh it'll happen\nThen where's that going to come from it's got to come from a tax increase you have to make a choice and I'd say repairing our roads and building a rose is more important than expanding the Medicaid welfare program [noise]\n[noise]\nI said earlier I spent fifty two consecutive days torn all hundred and five counties I Want to be a governor\nWho understands and promotes all one hundred and five counties wherever people choose to live in our great state\nAnd so we need to quit legislating so much ... that's why one of my platform point through which we don't hear much mentioned\nRight now is empowering local governments and the home rule I I Believe the folks that live in these communities that make their counties grade and the counties that make the state grade all hundred and five it's because people are working together and taking pride in their communities thank you\n[noise]\nIt's important that we'd be centralized Pico it is to concentrated with too much power we have legislative bodies that are being funded with borrowing money from other legislative bodies it's time for us to make sure that your taxes are being spent properly\nAnd responsibly and we need to go through the agencies and make sure that they're not wasting it and we need to audit them\nSo far I Am the first one to state that we need to audit the agencies and we need to make sure that we return the money that has been stolen\n[noise] senator\nAt some point tonight I Would like for Kris Kobach to tell us how he is going to fund our highways cut our taxes and fund our schools [noise]\n[noise]\nWell I think we've heard too fair questions asked here on the robot robot will I agree with Senator Kelly but secretary Kobach\n[noise]\nWell I think we've heard too fair question the last year and the robot robot will I agree with Senator Kelly but secretary Kobach needs to tell us\nThe math behind that how's he going to accomplish that but I also agree with that great Kobach that Senator Kelly needs to tell us how she's going to return to fully funding roads expanding Medicaid without a clear plan to do it in a way that doesn't cost the state of Kansas money\nI fully fund schools and do all of that without increasing taxes I think those would be both very helpful math question for all of us that the answer to [noise]\n\nLadies and gentlemen asking the question and answer portion of tonight's forum candidates we thank you for your time and your willingness to be a part of this event\nAt that time we will invite each candidate to provide a two minute putting thing again we randomly through to the order of that kind of think statement we'll begin with Mr Clinton\n\nOur next governor has got to be a team player\nA governor who's promoting and representing Kansas and everyday people one who connects with people\nI Believe that can be imperative if we're going to grow our populations in the economy that people will look to want to move to Kansas and keep Kansas home to keep our young people here I've been in public service\nOr almost all my life and I have an experience along with starting a nonprofit but if there's anything that it's taught me is you got to have that healthy balance and that perspective\nWe we have people we need the service and yet we have been able to take care of and I'm a ... and I chose raised my family's here and I'm here tonight because I did something different\nIran independent and you people and others gave me the opportunity to be here tonight I Am a pro life\nLike I said earlier frustrated Republican that went independent\nI get off the map swelled can I win and I believe I can but here's how and why because there's over a hundred thousand registered Republicans many frustrated\nWith myself five hundred and fifty thousand independent or none affiliated registered voters and there's a and that's more than the Democrats and libertarians combined there's five ten of it's one of us will be the next governor the divvy up the road the votes I Believe ... represented enough key voters\nEnough cheap voters I represent with similar values and policy and you don't even have to leave your party to vote for me\nBut I asked you to do something different this election look outside the box take a look at each candidate do something different and I ask you to consider voting for me recordings because I Want to do something different for ...\nYou could go to my website clues for Kansas look at our policy a Facebook post\nBut let's do something different folks let's keep our younger generation in mind thank you\n[noise] that\nI Will answer that math problem and you do a number to show you how\nWhen I was secretary of state during those eight years there we would use the budget by thirty four percent and we did so the natural attrition grad who was ... people retired as the baby boomers retired and the returning an eleven thousand a year nationally live because of the day nationally across the country\n[noise]\n[noise]\n\n[noise]\n\n\nI'm going to Maxine I Love that stuff either this is ... very music we were just listening to music or friends lay her music which is very definitely connected with the city of Vienna this comes from me album which is titled ...\n... ... which is ... but with a pre ... added just for starters the conductor on top Dorothy is on Gary and he was conducting the Ford Motor go home and got a guy and more importantly the composer friends lay heart was born in Hungary for all that he achieved enormous success in Vienna\nSo we'd hear a little more of Lehigh is genuinely Hungarian music right now this is Robert McDonnell the playing the violin with the Cincinnati pops art district conducted by ... here in the Hungarian fantasy was forty five friends lay are who was a violinist himself this is true my jar music\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[laughter]\n[noise]\n\n\nWe just heard the opening seven minutes um at one point by the young ... by talk it's called ... honoring liar who shoot the leader of the failed revolution of Eighteen forty eight forty nine and hungry this was a peace first performed by the Budapest put our money can a concert in January of Nineteen for any\nBudapest audience went wild with enthusiasm a little later\n... who is a combination of German and Hungarian conducted this before and English audience in Manchester, England and they're the reception was a little more mixed I suppose we should say [noise] although I have to think that the English audiences at that time would have been some Miller with most of the ... are because of Strauss\nAnd have to say that's a composer whom I hear most often and most vividly in his piece by the young ... and there was a problem for the young Gary and composers they needed to find their own music to these composers jumping Kobe and being a python there just to Europe part\nAround the summer of Ninety five percent to each other let's do\nWhat transmission proposed to do but never accomplished that's ... and go off into the countryside and collect folk tunes what they found surprised him\nA play you one which I took some it was a shepherd playing when his flute in ... [noise]\nStrong lonely quality to that you know there's been so much time and usually just trying to transcribe\nThese tunes as they heard them write them down and there were so scrupulous did they begin to carry extraordinarily heavy recording equipment now the challenge for these composers how could they begin to use it on their own and they suggested the idea of harmonizing riding in a compliment to that you\nLet me pleased that seemed to but now with by ... [noise]\n[noise]\n\n\n\n\n\n\nUsually a little the second\n[noise] [noise]\n\n\n[noise] no I Would be great for the pianist during their produce we would be\nI have never heard a recording will play a recording by great pianist especially some of my lord if I could have found my\nKennel music or being a ...\nThe music is my new margarine\nOr Trump is like right there was that exploring music at the F empty dot com\n[noise]\n[noise]\nHi this is Kevin Kevin I'm going to be some ... coming up next time on the program we legendary gospel star candy state\nPoliceman Guy Davis will also be returning with another installment Syrian pioneers and innovators of training the blues hall of fame that's all coming up next friday evening at seven central\n\n[noise] this is Ninety One point five eighty ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support jab at H. P. P. R. dot org for details\nSupport for H. P. P. R. comes from Tuscaloosa off machines in Amarillo serving the area since Nineteen Seventy eight with sticks locations in western Texas an eastern New Mexico more information on line at ... office machines dot com\n\n\nThat's a lovely wild bench isn't it\nFrom a very polite composer labeled vine or who is a native of Budapest was about four\nYears younger than ... born in Eighteen eighty five [noise]\nWe just heard the finale of his diverted meant to open twenty play by the Budapest strings either walk into exploring music this is no McLachlan end all week long we've been listening to Hungarian music and did they\nSeem ... there was magnificent mud jars what'd you as for the last time this week I promise is the proper pronunciation of what I said for many years as muggy are all music Hungarian composers and particularly noting their influence on the rest of us\nNow of course the towering figure of Hungarian music above all above ... is being ... by talk\nHe wrote a six string quartets which belong in the company of Beethoven and Schubert he wrote lots of staged pieces from the wouldn't prince true blue beards catch up with a miraculous Mandarin marvelous orchestra pieces music for strings percussion in last control for our history at the end of his life three piano concerto the violin concerto\nBy talk is the real deal and he's such a gigantic forget he could easily dominate this week and it's been difficult for me to keep it back but I think we have to have a whole we couldn't buy duck keep in mind that rather polite way nail biter used his study of Hungarian folk music and now compare that to the wilderness\nIn this finale of products concerto for two pianos percussion an orchestra\nMartha Irish and nothing ... or the pianist ... district elected by David ...\nMusic a bailout by talk\n[noise]\n\n\n\n\n\n[noise]\n\n\n[laughter]\n[noise] mhm\n\n[noise]\n\n\n\n[laughter]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\nMm [noise]\n\nMm\n\nMm\n[laughter]\n\nThat's what the name of the phone [laughter]\n\n\n[laughter]\n\nNo no no no [laughter]\n[laughter]\n[noise]\nWe've been listening to for winning dances of George Li ... and there's another composer whose name I recently started pronouncing differently it's spelled the G. Y. O. R. G. Y.\nAnd I heard everything from ... to I don't know why but it turns out to simply Georgia they get the\nAnd if that didn't sound like ... music from two thousand one or from eyes wide shut there's another ... somewhat use more of the goodies music this is because these are early settings of winning dances and they're very much in the style of transcription a folk tunes and now that we heard from dying by talk both [noise] let me\nQuote in the New York times obituary on the good the you said I'm In a prison one wall is the avant garde\nThe other is in the past one only to escape scooters ...\nHere are three of these six wind back into now this is rather early music too well look if he was still living in Hungary is another one who came when the west and lived in Austria for the rest of his life but in Nineteen forty nine he was doing hungry this is the ... of the ... went back and tell us\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nUh\n\n\nMm\nWe\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[laughter] [noise]\nSo [noise]\n\n\n\nAnd that's all he rode\nFrom the six pack it tells her when quintet of Georgia they get the we heard the first one market liquid ... spirit to the second piece\nRobot though ... total so that was that's sad peace in the center and the finale multiple be ... or that was the ensemble dean barely and made up of members of the the ... and Berlin fanatics plus my old friend Milan took about ... joining the on ... ... you're tuned into exploring music\nAnd we were in the final innings here of listening to the music of this magnificent mud jars agrarian composers and all of the influence they had on music of the west\nDrop us line can write to us that exploring music at W. F. empty dot com\nWell H. P. P. R. celebrating all of the contributing members who reached out we support over the past Mac there's still a ways to go to Nicole thanks very generous membership match from Amarillo your contribution is waiting to be doubled at H. P. P. I. dot org [noise]", "year": "2018", "show_name": "Exploring Music with Bill McGlaughlin", "city": "Dalhart", "day": "26"}