{"month": "10", "state": "TX", "station": "KTDH", "content": "For the finest ... passive presence classic albums hidden gems add\nFavorite home or on an international artist tune into the gym with John [noise]\nMonday through Thursday from nine pm to midnight central\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da da Silva supply planes public radio available everywhere on line at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter of high plains public radio visit H. P. P. R. dot org and look under the support tab for details\n[noise]\n[noise]\n[noise]\n\nHello there and welcome to exploring music this is bill McLaughlin and this week we are attempting to answer the question how do we get from box to Beethoven\nThis is a question which has taken us all across the musical capitals of Europe and the last couple of shows we've heard music from Madrid from London from parents from Berlin from my mind from Venice and in today's show it's time to go back to the fountain head of music in the seventeenth Eighteenth centuries Italy\nOr starting up in the north but the composer born near Venice sixteen Ninety two was the birth of ... teeny\nThirteen these parents that well you know young ... making nice priest so the enrolled him and the University of ... not very far away\nWhen he got to this famous old university who's graduates include no less than ... young ...\nCampus life much more exciting than he'd cast decided and quick order that in fact he did not want to be a priest took up fencing with a passion and fell in love so in love with and married a young woman called at least abate the climate Saudi\nHis marriage was secret but the word got out quickly and it brought down upon our teeny at his bride the wrath of no less than the archbishop of ... he said look you are supposed to be a priest it's too late to do anything about that now but you married a woman who is poor we cannot countenance that\nSome poor Thirteen his wife are split up for five years he went off to find refuge in the Franciscan monastery of a DC\nAnd in those years apart you learn to play the violin he made one quick trip to Venice where he heard the great violence that a teeny and he came back to his cell say that's it that's what I Want to do it's your piece written by ... which he performed themself we're going to hear the first movement of the country or two and a minor\nThe ensemble here's an sample for Fifteen that the the direction of key ought to be on ... or so left in a week ago got the\nThe subway you're in trouble for Fifteen to the direction of ... or so we go to the market your teeny for [noise] [noise]\n\n\n\n\n\nIt was wonderful lively stylistically beautiful playing from ensemble for Fifteen when I picked up this her Modi Monday discussion Thirteen Ethan journalism so beautifully played by this ensemble for Fifteen I Wonder if it's been about how they do their name and then I realized the joke was on me\nIt's the pitch at which this ensemble tunes nowadays the a above middle see here\nWhen you hear the ... give to symphony orchestra my breach of four hundred and forty cycles per second can't count them to take my word for it for my that's sharper a lot higher\nThan the components of the baroque or used to hearing their a what a vibrate in only four hundred and Fifteen cycles per second so instead of sending a guide our\nNew sounded like the sharp that a minor concern and we just heard\nIn order for me to\nMatch their pitch I have to ... minor not a minor this would sound\nUnbearably sharp to them\nThat's the modern a minor that stayed with his\nLovely ensemble for Fifteen for more music from northern Italy from the early parts of the Eighteenth century let's go to a composer born in Milan and Seventeen hundred\nThis is a man who did stick with his religious training and became a priest so we simply call him by Jay so martini boundaries on my TV to convince full name was ... summer teeny and he is in many ways the father of the Italian symphonic form three moments\nOn about six minutes on top of four Fifteen the symphony in the major of pudgy summer teeny [noise]\n[noise]\nMm\n\n\nRemarkable blending of powerful emotion of the early baroque disarming in a way a little bit like\nMatthew passionate box composed by an Italian composer to me this is ... stopped by modern we heard the opening stop by monitor and then the ... ... and final amen\nBarbara freed totally was a soprano Katrina on or not she was a controlled the orchestra of la scala bin Laden was conducted by Ricardo mood the\nRemarkable to me a picture lazy sets up that's tried emotion and the baseline and the voices just spinning out this beautiful long the law declined the two voices winding around each other such sorrowful and beautiful\nMusic music composed by young men from Naples who died at the age of twenty six Giovanni ... died in Seventeen thirty six\nLess than ten years later Seventeen forty ... to the birth of a composer in a new car rather nearer to Florence further up the coast again\nHis name was Luigi ... me and I've got a friend great cellist from Holland on those ... who thinks that\nWould you ... is simply the very greatest composer who ever lived was one time we were at dinner together and he said you know everyone talks all the time about Mozart's you said compared to a ball community I think really much of it is rather course\nOf course I had to challenge him to a doorway and ready to him to come to a concert where he ... he wanted and I would put up a little Mozart symphony and we would let the audience decide\nI don't think I convinced him on a bill was playing is so beautiful that or what did you hear a couple of examples I mean in the music of his favorite ... first here a stream content in a major we're going to hear Largo moment with a lot of solo cello\nAnd these ... performance will be listening to ... and all that food rope as the violinist ... is the view almost on her bills ... and ... are the two cellist musical book or we need the Largo from the major content\nAre the two cellist musical book or many of these Largo from the major content\n\n\n[noise]\n[noise]\n\nMusical Luigi ... the first one of the the major can turtle gee for eight three is was on her bills my our Charleston was playing with ... and early instruments group from Toronto conducted by gene ...\nBook Corrine was born in ... and then went down to Rome to study and while they're run into a couple of other composers are also excellent string players the violinist ... and our Deanie and together with a V. almost whose name I don't know sadly\nHe formed a string quartet which was perhaps the very first standard quartet as we've come to think of it to violins viola and\nCello and this ensemble paves the way for the great successes the frontiers of hiding Mozart debate the hundred problems by talking further on your tuned into\nExploring music and this week we're never going to answer the question how do we get from Boston to Beethoven\nWere almost halfway there may be a little bit further drop us ally and let us know how you like the show or address is simply exploring music at W. F. M. T. dot com\nI mean do you have like regional content director ... high plains public radio I injury each day that your delivered the news that matters most to you your membership makes that possible kill your support today by visiting H. P. P. R. dot org [noise]\nFor the finest in jazz [noise] past and present classic album kitten jumps and more [noise]\nFavorite homegrown asked international artist [noise] tune into jazz\nJohn shield [noise] Monday through Thursday for nine PM submitted by sensual [noise]\nHi I'm Jonathan bigger an every weekday I bringing you news stories about the high plains and I love doing it but I Can't do it without your support so call one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org to pledge today\n\nWell since we're in Italy all of the show so far it let's bring the German composer down for a little further education [noise] this is a German composer of a very distinguished heritage his name is Bob are you on Christian bucked the youngest of box many children\nBorn Seventeen thirty five and six and came to Italy and went native when he went nuts in fact he changed his name from Riyadh Christian to Giovanni he changed his religion\nFrom Luther in the Catholic and this horrified as folks because they'd been Lutheran Church musicians all the way back to the time of Martin Luther himself [noise]\nShe she bought love being in Italy absorbed all of the forms met all of the composers trying to be used in the air ate all of the food then went back to Germany where I'm not sure he got a ...\nLove being in Italy absorbed all of the forms met all of the composers ... we used in the air ate all of the food then went back to Germany where I'm not sure you got a very warm welcome because he didn't stay very long before taking his act in those footsteps over to London so Giovanni box becomes Jaycee box as we know in the London\nBox so let's hear an Italian symphony written by German composer living in London\nWe're going to hear the first two movements under symphony number one did you major from DC box was six this is the head of are banned under the direction of Anthony hosted [noise]\n\n[noise]\nMm [noise]\nIllustrated memoir that mind that dark topic for the inevitable humor that comes with taking care of one aging parents hear a new book by each week at H. P. P. R. dot org by clicking radio read her book club under the feature menu or kept them on air Mondays Wednesdays and Fridays during MORNING EDITION and all things considered\nWe'll probably up early on Sunday mornings anyway right most likely or teen forgot to turn off or alarm and today's greatest rap mix has blasted through the house they're shrink even the dog won't get the news a few extra minutes this weekend\nWell laugh it off with the little house on the prairie at eight thirty five every Sunday Morning on high plains public radio during weekend edition or listen online at H. P. P. R. dot org\n[noise]\nDeserves Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter up high plains public radio visit H. P. P. R. dot org and look under the support for details\nSupport comes from love lady Christie and associates and Amarillo CPA from providing accounting services and solving complex tax issues across the high plains with employment opportunities for accountants Elsie a CPA dot com\n[noise]\n[noise] [noise] [noise]\nAt one time or another in my life I think each one of the fires because I'm ... years has been my singular favorite [noise]\nOver the years I keep coming back there was one particular force ... major [noise]\nThe Boston severe shortages hour that was Rudolph circuit in a pretty good opening music [noise]\nDifferent from any country will ever conceived says music from your ... [noise]\nWelcome to exploring music which has been McLaughlin and this week all week long we've been trying to answer the question [noise]\nLooking to exploring music which has been McLaughlin and this week all week long we've been trying to answer the question how do we get from\nTo Beethoven [noise] but we just let the head about\nAlmost Thirty years now [noise]\nWe left off with music of the sixteen year old [noise] Mozart [noise]\nAnd now we're jumping ahead to be tied to your aid to sex and what a chump that is\nThat jumps across the American revolution starting in Seventeen Seventy six the French Revolution starting Fifteen Years later [noise]\nIt jumps across the rise of Napoleon jumped into a new century\nIt's a whole sea change taking place [noise]\nAnd we hear it in the music of Beethoven [noise]\nTake just for example that marvelous opening where we heard has it take to do this after we just heard Rudolph circuit but but just as the major music that they don't use this\nThe piano is all alone\nAnd it's soft its poetic it's almost a dream of vision when the orchestra comes in he puts it in the major far far away\nOnly works his way back\nTo the home team [noise]\nOf the major that's a completely different way of thinking about music than would have occurred to hide and or even the Mozart Beethoven only thirty six years old when he made this piece but he's in a new century in a new era\nIf we started with Iraq music at the beginning of this week with the music of Bach and handling scarlet the by now we are several she changes down the road\nThe composer starting to see himself in a whole new light not as an entertainer not even as an artist but more of a kind of like a high priest even a profit a hero leader of his people and the pilot\nAnd thinking of yourself and those ways changes completely they kind of music that you compose let's take a step back a little we were just hearing Rudolph stricken playing on a modern country grand piano\n... never saw or heard one of those you did at hiding their Mozart they played on an instrument called the for the piano which is sort of midway and the evolution if you want to think of it in those terms between the hearts according to climate accord and modern concert grab which doesn't really start to be up until about sea Eighteen sixty or so\nOn site I'd ... Bateman played upon early for the pianist and we have a recording now of heightened sonata\nThat she had a kind of keyboard sound these speak composers were used to it will be listening to Lola OD I'd gotten playing on the ... the piano this is the first bit of heightened piano sonata number thirty in the land enlisting just not it in the major marked murder I thought [noise]\n\nDoing things early for the pianist and we were recording no heightened should know that\nIt's really kind of keep which sounds these speak composers were used to be listening to ... what do you I think when the ... the piano this is the first little bit of heightened piano sonata number thirty the minded listing just not the major marked moderate\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nWell I warn you that that was going to be quite at temple Fritz writer conducting the Chicago Symphony that's an old recording is march ... finale of Mozart's Jupiter symphony the symphony number forty one she major when most brilliant examples of two things going together what'd you wouldn't think\nCould exist together a comic upper overture in style and feel and the Contra papa masterpiece worthy of ... or ...\nWe heard all of those conversations all those teams woven together and you don't feel like ... they're going to begin to Rebecca Melendez coming up for me to believe who could have pulled off that\nOh a recording is marvelous to hear the finale of Mozart's Jupiter symphony the symphony number forty one she major one of the most brilliant examples of two things going together which you wouldn't think could exist together a comic upper overture style and feel and the country pop a masterpiece\nWorthy of ... or ...\nWe heard all of these conversations all those teams woven together and you feel like I'm going to get to them we're back in the lead them to make up for me to believe who could have pulled off that act\nOnly Mozart I think that's an example from one of Mozart's great operas marriage of Figaro where we hear the same kind of sketchy characters seemed kind of counterpoint going on\nBut no sign to seniors characters in the upper ... the finale of act street picking it up from where they should do any of the contests Susana [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\nTalk to a former fed official about what the president that tax me for the institution is afternoon on all things considered from NPR News [noise] four o'clock central on high plains public radio\nWell\nAll week long we've been trying to get from the music of the by rote composer box to that of the classical slash romantic composer Beethoven and now in her final minutes here less than half an hour we have arrived\nAnd what to choose from this great body of work that Beethoven left is there are thirty two piano so not as there are\nFive piano concerto either are nine symphonies there are sixteen string quartets plus the great few and we've only time really for a short sampling of that\nI was trying to think of some of the things that made them and they were so revolutionary and far exceeded even that phenomenal accomplishments of his idol Mozart and his teacher hide and\nAre a Dodgers and Beethoven's work unlike any composer before him and really anyone after all the books and her mother she has to go which many others have tried their hand these are great transcendence slow movements there's nothing like that in any other composer beforehand there is also a kind of ... energy which was brand new\nAnd there's a kind of honesty even ... to even his most self indulgent moments\nSo for better or worse I've decided to pick two moments of one of the symphonies it's from the Eighteen twelve and which we of course had a war with the English again in ... later would write an overture celebrating the defeat of Napoleon in Moscow for beat them in the big story of Eighteen twelve was that he finished his seven symphony\nAnd we're going to hear just two movements to second moment where they might have placed a real slow moving and ... is marked in this case ... this is moving sort of a Johnny one theme given by the chosen loose strings that builds a tremendous head of steam out of seemingly very simple material\nIt's a nice it's from the you're Eighteen twelve in which we of course had a war with the Michigan ... leader would write an overture celebrating the defeat of Napoleon in Moscow for beat them in the big story of Eighteen twelve was that he finished his seven since ...\nEverybody here just to ... to ...\nWhere ... might have placed\nA real ... is marked in this ... this is a movement sort of a Johnny one ... seemed given for the children's loose strings that builds a tremendous head of steam out of seemingly very simple material no one could imagine this music but the timing and then for the third movement where I work\n... is from the early seventeenth century ... to even heightened mostly had made and then you went to ... that this provoked an\nOld fashioned Courtney dance and changes it into a dynamo scared so\nOnce again going back to Chicago since the recording what fits right a conducting the ... and the schedule I beat them it's seven symphony\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]", "year": "2018", "show_name": "Exploring Music with Bill McGlaughlin", "city": "Dalhart", "day": "12"}