{"month": "10", "state": "TX", "station": "KTDH", "content": "River girls southern girls Tokyo girls whiskey girls American girls\nMusic from guy Clark emulate Harris and mark an off color Harper Simon iron and wind ... much more songs all that girls on the next one vote here on high plains public radio\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da di di di point seven KGAN Hayes a service of high plains public radio\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nHello there and welcome to spring as it gets put McLaughlin here our seen this week is autumn\nLeaves and it's about time are getting around the front steps of hiding what you did know hide roads wonderful order music it came right toward the end of his life and the credit for introducing heightened to the idea of making an or throw you on the seasons\nBelongs to a certain Baron funds feet to\nA friend of both Mozart in hiding a little bit older than Mozart sweet and had been in London for a while and he noticed a tremendous success or three years of judge Frederick handled had with the English public and he thought themself we need or at three I was like that by German composers here in Vienna [noise] so ... years of hide and created first\nThe creation and this was a big hit so sweet and said now we have to press ahead heightened said I'm Seventy three years old I'm getting a little tired of this game and feed said no I've got one more big piece in you and he did the seasons the oddest site than\nJust jump right in the opening of fall [noise]\n\n\n[noise]\nWe\nJust heard from Jane well the three characters in heightens the seasons are actually given German named Honda my calling Jane and Lucas and Simon\nMothers Peterson is this a primer there and she has just told us which bring promised with its blossoms and what some are made rape by its worms\nIs now displayed in for the happy has been in autumn didn't see has been much in American English doing let's see the Germans ... my French has to do it by you switch the happy herder happy farmer and genius promising us find harvest\nThis turns hiding completely lose his one of the greatest senses of humor of any composer whoever lived which of these next three pieces they are like Peter Bruegel paintings in music we'll start with the I'm going to call it the hound dog are you there is a hunter in what'd you could actually get a dog sniff when the longing to pursue my\nQuestion is there any children or people like all the ... there is a very loud gunshots whereby our hundred brings down a bird off very vivid\nWill go from the ... are you to the hundreds of course they all get into the act including for orange playing and different keys and become the final great celebration you okay Darren ... is dodge like Whoopi the wind is here this is ... directed me fried burger idle orchestra [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[laughter]\n\n... ... s\nC I F R\nI thought I might be [noise]\n\nSign off oh\n\n\nThat'd be\n\n\n\n\nThat'd be good for you\nKnow\n... ... ...\nOh\nOh okay [noise]\nMm\n\nScale there hitched this\n\nFive tons of tonic could open up to a sharp\nAnd play it all in the black keys and the piano\nJump little kids they don't like to goof around to get them loose in the black keys you can't go wrong with like he's no harm here\nNot making the right keys we get stuff like that so to shut piano piece as autumn in a village\nFrom Japan and then autumn in Warsaw from Jersey and to get the\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise] we\nDon't have much time\nShe [noise]\nYou know the rules and\n\n\n\n[noise]\n\n[noise]\n[noise] Mm Mm\nHave you know\nTo me [noise]\n\nYou know\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\nPeople went nuts and you can hear it that was a live performance at Carnegie Hall a couple of seasons back marvelous French piano I'm more of a policeman was difficult music imaginable and we just heard of Jersey nicotine gum very opposed to the piece is called\nAutumn in Warsaw and it starts out just leave enough it becomes very very complicated before you through you tuned into exploring music I received this week is autumn leaves office like that it's no I think we're doing use our website exploring music dot O. R. G.\nWith H. P. P. R. O. membership campaign right around the corner you must support today will take H. P. P. R. that much closer to the eighty five thousand dollar goals for the month of October joined the nation today and support media that matters and H. P. P. R. dot org\n[noise]\n\nFor the finest in jazz [noise] passed me presents classic out to the gym and more\nFrom your favorite homegrown an international aren't as good as John\nFavorite homegrown an international artist [noise] jazz John\nShield [noise] Monday through Thursday Friday nine pm to like central\nSupport for high plains public radio comes from Amarillo wireless providing Internet connections for businesses with a variety of use each needs in Amarillo Bush went and watched bring more in Amarillo wireless dot net\nAll right no more nicotine maybe some [noise]\nFor the difference bother\nTo cold autumn in our town\nNormally would feel to it has\nTo perform it you know the first with the son of these ... Christian Brubeck at its power bill crew for a company in Frederica from starting\nAnd then we'll get a deeper backwards that seemed to\nThe original one in Washington Square [noise]\n[noise]\n[noise]\n[noise]\n... quickly made his way to New York city at the very first job he found was as a plug in music shop\nJust sit back before recordings music shop engage a very good chance to sit down and play through all of the sheet music they wanted customers to buy so there's ... sitting in the shop plugging away that these choose when one day a young composer windows to get through George Gershwin\nHe loved the ... he's probably going to be close friends but church that looks like the way this is not going to work this is the new world not ... I think you should be Vernon Jew\nAnd so he became or did you that's the name of the square this piece which we're going to hear now beautiful piece the words are by Britain do as well pretty good for a guy from English was his first language is is a beautiful work history by Jonathan to make up ... soprano\nLet's just looked at flew into two more versions\nDo ... and one more version I think you can get to to sing because when you hear them three versions now of furniture you autumn in New York\n[noise]\n\nAnd [noise]\n[noise]\n\n\nTo Wendy's looking you\nKnow I [noise]\n[noise]\n[noise]\n\n\n\nDo you\nMake me the ball\n[noise]\n\n\n[noise]\n\n\nYou're\nGood to know\nGood to\n\n\n\n\n\n[noise]\n\n[noise]\nYou\nKnow\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nToo with music from some of our best local musicians as well as the likes of Asia encroaching Tom brash and the grandfather Jones Family and of course I'll be heading down to the ball to see what Jim mark Jones has found forest [noise] all that this week on Ozark ... radio\nSaturday Night at nine o'clock central\n\n[noise] this is Ninety One point five ... eighty nine point three Katie da di di di ... one point seven KGAN Hayes a service of high plains public radio\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nSupport comes from United Wireless locally owned and operated with surface plans that provide coast to coast coverage stores and agents across the region coverage you deserve service you expect you to wireless dot com\n\nOh they're welcome to spring music it's bill McLaughlin our seem all week long has been autumn leaves and it's about\nTime to get through on Tony of evolved the ... the most famous set of four seasons of any composer who was ever lived there violin concerto is actually although we've all the publish them under the title the contest of harmony and invention I guess that has to do with some slightly arcane baroque philosophy\nBut the pieces are very easy to understand there are ones brilliant display pieces for the solar violinist an awesome tone paintings we can follow this story or at least it seems that if you have all these pending first first one was marked a lego and he tells us this is dances of the country people villages\nOr typing a keg of wind remember it's fall and harvest is and so that we use it becomes a little slower at the end I think they've had too much wine that'd be fall asleep that's the second movement\nThat Dodd geo marked for me in the ... hockey which translates into something like the sleeping drunk words it's a good chance for the hearts of quarters to get a few notes and then we have a hunting scene for finality\nMarvelous performance the solar violence is Simon Standage who's playing with the English concert driven picnic leading from their hearts according to\nWatch little the interplay between Simon had Trevor about midway through the first woman it's the first time we have an idea that the violence has had a little bit too much of the harvest wind it's great music and it's also very funny bought them from the four seasons of Antoni off evolved the\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nIt's a Chinese like long lines the\nPianist especially like to hear something about what he meant just technician still not Thirty years old he's one of the great fire breathing future wars that's up to the grand jury is like music is so sensitive any\nBrand new to me that this week for\nA little bit older than Eric ... I think for for just a little bit before the turn of the century ... for strings and it's called for which we\nDialogue lobster were not\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nJust to just printed and the middle section\nOn the last day plays a little bit of jazz\nJust to print it at the middle section\nThey don't take a little bit of jazz\n\n\nHow\n\n\nMm\nPretty isn't it hard sell\n... bigger like chocolate chip to her son [noise]\nAttempts to many versions of September so hard to pick among the reason that if you will pick it up at the end right on the trumpet so another trip it's fairly big band swinging version she gets the job but their age to ... percent once again [noise]\n\n\n\n\n\n[noise]\n\n\n\nFrom an album entitled feet dragging who's forty forty forty seven or eight years was Harry James bad with Mr james up front\nFrom an album titled ... feet dragging news forty forty forty seven or eight years it was the Harry James bad with Mr james upfront leading the bed and playing the jets do when his version of September so I'm just trying to be more versions of September ...\nThe great pianist girl gardener okay you know this June if his misty\nBut before he wrote this\nGirl going there was a great jazz pianist and he still is\nGenerally play golf is all new to just take him at his practice to perform and just so beautiful Earl garner piano jangle Reinhardt great French gypsy guitarist and then well just a little of the ... freshmen joined by history guest\nNo [noise]\nNo [noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\nMm\n\nMm\n\n[noise]\nMm Mm\n\n\nMm\n\nMm\n\n\n\nMm\n[noise]\n\n[noise]\n\n[noise]\n\nOh I'm I'm a\n\nI'm a ...", "year": "2018", "show_name": "Exploring Music with Bill McGlaughlin", "city": "Dalhart", "day": "05"}