{"month": "11", "state": "TX", "station": "KTDH", "content": "Way of life in me Liz decent stream moves in seven\nDays a shovel in the flu [noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie de ... uh service the high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. at H. P. P. R. dot org or call eight hundred six seven eight seven four four four\n\n\n\n\n\n\n\n\nSkinny music boys or girls from Ed Markey Greek in the hall of the mountain king\nHigh there is from uh Brooklyn welcome to spring music hour's theme this week demons books and other things that go bump in the night including robes rose sometimes go pumping it like that we just make one rogue pure ... based on the character of every Gibson\nAnd we have another robot waiting for us at the end of the hour time Moshe after the meantime let's go here some ... ... Barton pine\nShe's playing a piece called romance of the ... or ...\n\n\n[noise]\nMm\n[noise]\n[noise]\nAnd [noise]\nAnd [noise]\n\nUh [noise]\n[laughter] that pieces devilish sleep difficult but it doesn't seem to scare are were violinist reach a point in pine who just blaze through that with Patrick Symmes if it's at the piano music at my Tony ... butts Seaney the round dance at the goblins but CD born in ... in Italy an Eighteen Eighteen\nHe used the next generation of Italian future wasn't violinist after they caught a bucket needy\nAnd following the footsteps of his idol ... but you need to make a lot of music about devils and goblins\nAnd speak to the devil sorry he's a ... D is down the block from working Rodrigo are two peas are playing this is a twenty century devils dance\n\n[noise]\n[noise] [noise]\n\n\n\nIt was dean Martin conducting type of music wonderful artist or from Toronto the poison period instruments music of new ... new book Corrine defining moment I'll be sitting at the minor cold like ... do the outlaw nature is a hundred house protein Emily Dickinson but aren't\nAren't is the house the tries to be haunted\nHere's music I'm sure she can be getting from the second ... ... ... ... the demos staircase beyond a one a Marr is a pianist\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\nMm\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n\nSome\n\n\nLessons that endless ring out\nOf those last brown thumbs it's a little bit like we can from a dream and then you start to fix coffee but you can't shake the memory of the dream that's the way that ring out of that last um strikes me\nThe devils staircases the name of that ... to to George Li ... there was a wonderful pianist paranormal MR\nYou're tuned into exploring music I've seen this week demons books and other things that go bump in the night Trump is aligned insect suggest some more music going through this again sometime write to us via our website exploring music orgy\nOctober is your hat plains public radio membership not every place you can't please do your part for your ... planes public radio station games on line and H. P. P. R. dot org\n[noise] [noise]\n[noise] one year ago the me too movement drew attention to the widespread problem of sexual harassment now the movements power is tested at the ballot box [noise]\nI'm not willing to compromise like election time is up\nSome lawmakers have been accused now face voters or the next MORNING EDITION from NPR News [noise]\nThursday morning beginning at five central\n\nEnjoy listening to lap promotional advertising on commercial radio of course not that's one of the many reasons you've listened to H. P. P. R. and you're riding highlights your business without the hype more at H. P. P. R. down over\nWe've been listening to a lot of music inspired by the devil even if it's playfully inspired by the devil but of course the devil is not the only spooky creature out there to inspire composers you find lots of other spooky creatures if you go back into mythology folklore folk tales\nFor example in Germany is a terrifying character the Earl King who is the subject of a very frightening point by great too and then even more frightening song by French Schubert listen to the first lines\nSee how it's so neat knock on the and it's just their father Mitch designing can\nWho's writing so late at night and it's terrific when why is the father with this child on the horse behind them which I was frightened keeps calling us father did you see what's running behind these\nDeaths\nThis son takes four voices from one singer the first is the part of the narrator is telling us the story and this is on here in a high clear tone sort of like the evangelist and a passion than we are the father's voice a deep voice it's actually voice\nThe height your tone sort of like the evangelist and the passion\nAnd we had to find his voice he's deep voice it's actually voice it's a mental a voice that we've got the child's voice and then of course ... late she doctors evil sink Peter Laurie and here's a singer who can handle all of these sports voices\nBecause Britain turtle was not much you know there are all getting you\nKnow\n\n\n... [noise]\nYou know\nDuring that time in the name of it was [noise] it was a nice\nAnd he's he's a composer he told me one night is Michael ... and did some er marriage is Ravi Coltrane favorite piece so here's the rub equal treat your some of the ritual dances from the mid summer marriage depict the composer conducting the English northern far more\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\nWe're bailing out there is more music and wonderful check it out [noise]\nMusic were playing today not only in honor the feast\nOf St john's day what's your first occurs in mid summer but also of my friend Ravi Coltrane this is his favorite music of Michael typically ritual dances from the mid summer marriage my\nPromise we would be one more robust before we were done with today's show or whatever obey is indeed\nTime Moshe hunters his name a good natured but taking the drink here's the story\nIt's market they and as usual ... it's a little bit of money in his pocket goes into the ... and drink some so senseless when they get together and that little tavern near the town of air in Scotland they sing Scott students together you'll hear the Sudans almost right away it sounds like to hold drugs for their arms around each other trying to keep together right\nAnd it's just about to leave at\nMidnight and his wife has told me to be home before midnight because you run into ... but all the time comes out shadows is horse maybe gets up on her show to shake Li and sets off his pass goes past an old abandoned church should I'll away", "show_name": "Exploring Music with Bill McGlaughlin", "year": "2018", "city": "Dalhart", "day": "01"}