{"month": "10", "state": "TX", "station": "KTDH", "content": "[noise]\nThis is Ninety One point five ... eighty nine point three K. C. D. H. doll heart a service of high plains public radio available everywhere at H. P. P. R. dot org\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nHi this is Jenny ... music director at high plains public radio thanks do you remember listeners this shouldn't rocks and rolls and swings and it's because of you keep the music going give now at H. P. P. R. dot org\nI'm older and welcome to spring as it gets from McLaughlin here and welcome to the symphony\nSo wait a minute than I ever do that you know it when I look back on our records I found that we have done eleven shows with exploring this should be going all the way back to ... behind new invented the foreman Mozart Beethoven insured and Sherman and members with\nAll the way up well into the twentieth century so after all these years what made me decide on this particular week to go back and open the door this isn't funny for simple I go to great new record for the Boston symphony with her music director Andrew snow since together there are going through the entire shifts to coach cycle\nAnd we're going to hear today server moments of sympathy which was written in Nineteen thirty five and was unheard for nearly Thirty years\nHow could that be I mean just a coach from the age of twenty when he wrote his first year but he was he famous symphonic composer not just in Russia but people like ... author or conducting just that goes for somebody over Europe and the U.S within months of the time it was first heard [noise]\nWell that's your little of this music and then we'll try to discover why they're simply languished on a shelf for so long is this ... which is an odd sort of scared so it's more ... to ... to Boston symphony orchestra under ... usually go to ... from the you're Nineteen thirty five\nShaq a moment of the fourth symphony\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[laughter]\n\n\n\n\n\n\n[laughter]\n\n\n[laughter]\n\n\n", "show_name": "Exploring Music with Bill McGlaughlin", "year": "2018", "city": "Dalhart", "day": "15"}