{"month": "10", "state": "TX", "station": "KTDH", "content": "Favorite homegrown and international artist [noise] into jazz John she'll [noise] Monday through Thursday from nine pm to midnight sensual [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da di ... high plains public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any trouble stage Pete PR to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\n[noise]\n\n[noise] [noise]\n[noise]\nHello there and welcome to explain as it gets to McLaughlin here we're listening to the symphonies once again this is the first time we spend a week listening to symphonies and today we're going to start off with a composer\nI was what do you call those men at church composer composer for the Netherlands findings but ... was actually born in Nineteen seven in java and what was then called the Dutch West Indies\nBut eventually found his way home his father had been in the army over there\nFound his way home to Amsterdam study there and Hank ... a whole lot of symphonies Fifteen in total\nReally hear a movement of the final Seventy which is very charming piece for wind orchestra and this performance where you're in the Dutch national use wind orchestra which please very very well indeed to get elected as we are in devolve this little scared so finale is music and hang findings simply number Fifteen\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\nMusic of Hank ... number Fifteen subtitled conflicts and confluence is we're ... it was a very nice performance the Dutch national use wind orchestra under the ... music a bank findings will be from Nineteen seven to Nineteen eighty seven\nBusters time not in the west indies but listening to the opening in that piece in the ...\nI Wonder if findings pick that up when he was a boy and jobs\nAre moving now to music my French composer ... Des ... was born just a few years after ... Nineteen sixteen just outside Paris studied ... what a pre the room for heaven's sakes very interesting composer sort of follows the tradition of will to be seen rebelled perhaps and\nMost of our took his German ski [noise]\nShare a lot of the influences and I'm ready to use the second city which is called the ... to ...\nWe share a lot of the influences and I'm ready to use the second simply which is called the do the kind of concerto crucial\nFor some country so there's a band the front of us\nAt the opening of the ... not only the sick and these were going to be hearing now almost sounds like filing music but I Want to play one section earlier which is messy responses piece you see [noise]\nBit too\nI mean my my studio so [noise]\n... just a little bit at this moment [noise]\n\n\n\n\nIsn't that interesting music [noise]\nIt seems to be senator around that would be natural here\nAnd it gets to it so many ways sometimes it's\nNot right to me from above ... like\nWe use that music makes me dizzy\nBut I really don't like it it's YouTube us now from the second simply ... on me to do you're the second moving my to my ... studios and the finale or ... yeah it is fiery and then come my dog and then just very quietly\nAs you listen to this you really at the opening these peace sounds very much like that that will section I just played for you and your performance young was called ... da is going to the BBC from our money music up I mean to you from the year Nineteen fifty nine\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThat is it missed you free commenting after random fiery opening\nYour two bits of the symphony number two symptoms do do do you see along read the speech from Nineteen fifty nine beautiful performance from the BBC from our money under young I was going to be a\nVery interesting composer I think I have to devote myself to learning a little bit more of his music I Know a couple of the pieces which of a piece for Isaac Stern later on\nInteresting composer on me to do you\nDo new spring music and we're listening to all sorts of simply this week from ... to the nineteenth century or going back a little bit earlier in the moment\nThe new spring music and we are at least you know all sorts of sympathies this week from the sort of new to the nineteenth century Rebecca a little bit earlier moment traumas a lot and I just know like the show you can write to us as\nAlways be our website exploring music or junior\nHigh plains public radio in the way that keeps you in touch with the world while at home on the high plains disturbing is I direct result of listener contributions gain knowledge grill community gets today at H. P. P. R. dot org\n[noise]\nWas a fine mist in Jeb so\nPresident of classic albums gyms\nAnd more\nFrom your favorite homegrown an international art\nAs\nMonday through Thursday from nine pm to midnight central\n\nSupport comes from the ... hour bookstore in Kenyan text is offering a variety of new and used books for children and adults along with works by area authors and on regional subject burrowing owls books is on Facebook\n\n\n\n\nMm\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\nH. P. P. R. connect is radio for the curious\nFor people who want to know more about the wider world people who want to know about how things work why things happen and what's really behind the changes going on all around us\nWe offer the best informative enlightening and inspiring public radio programming to satisfy your curiosity visit us H. P. P. R. dot org to find out more about the services offered on high plains public radio and H. P. P. R. connect\n[noise]\nThis is Ninety One point five ... eighty nine point three ... of service of high plains public radio available everywhere at H. P. P. R. dot org we\nWant to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us ... H PBR at H. P. P. R. dot org\nSupport comes from from farmland sticks generation agricultural operation in North west Kansas improving lives improving the environment improving community information at from farmland dot com\n[noise]\n\nHello there and welcome to exploring music is bill McLaughlin here we are continuing with her exclusion of who symphonic for which is I suppose it's almost an obsession with me for years and years I was an orchestral conductor and\nThe symphony is the greatest and grandest of all the orchestra forms the symphony has been around for a long time the men who gets the credit for inventing the somebody's front pages of hiding the Austrian composer and he was composing some for this real Seventeen fifty on\nOf course it caught on like wildfire then can assert them Beethoven and many many others only up to the President's Day\nIt's a form which continues to fascinate composers\nAnd in our ... following the developed as a symphony we've arrived around the ... century I Want to play for your work though was composed the middle of the second World War given his premier by the Boston symphony in Nineteen forty four to ... David Diamond who was born in Rochester but didn't go to the eastern school study way to Cleveland for a while\nThen studied with ... [noise] diamond as good a really big success with his first symphony which was conducted premier by Dmitri metropolis the old Minneapolis symphony this isn't the early forties and so it was natural the diamond would turn to metropolis with his new shifting has somebody number two the ...\nI Love the piece I really really love it but I don't have an orchestra to play it I'm just about to leave Minneapolis but\nTeen forty four to composers David Diamond who was born in Rochester but didn't go to the eastern school steady weight to Cleveland for a while then study with ...\nDiamond head screwed really big success with his first symphony which was conducted as premier by Dmitri metropolis the Minneapolis symphony this isn't the early forties and so it was natural the diamond what turned metropolis with his new symphonies as somebody number two ... said\nI Love that piece I really really love it but I don't know the northeastern plate I'm just about to leave Minneapolis\nBut I can think of someone who could play it in fact I think disability delivers B. S. O. all over it\nBoston symphony orchestra why do you send it to lose if its anchors risky took a look at it and decided to give it a public reading\nWhen it gets the first reading the orchestra itself uploaded as long as the audience know how\nThat goes as you said All right I Will play is\nSerious George sports now leading the Seattle Seventy we see of David Diamond from the Nineteen forty for the first ... of the Sunni number two is that ... ... funeral march remarkably beautiful lyrical music from Nineteen forty four music by David time and\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBoston October twenty second like forty search Boston symphony orchestra diamonds diamonds\nReally contradict memory radio shack or Nineteen forty four\n... give us Appalachian string around the time to go which is the leading cause you some idea of a difference between their temperament forties and then the Russians\nAnd this week we're exploring phonics project which we caring for years now different programs the programs Charles sixty hours or we usually go to the ground but I'm sure our flesh out that you would like\nTo tell us what you would like\nTo\nJoin your name and the way to like you know our website exploring or aren't\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "Exploring Music with Bill McGlaughlin", "city": "Dalhart", "day": "17"}