{"month": "10", "state": "TX", "station": "KTDH", "content": "For the finest ... past and present classic albums hidden gems add\nFavorite home or on an international artist tune into jazz with John [noise]\nMonday through Thursday from nine pm to midnight central\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\n\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\n[noise]\n\nHello there and welcome to explain\nMusic gets built McLaughlin here we are continuing with our exploration of his symphonic foreign which is I suppose it's almost an obsession with me for years and years I was an orchestral conductor and\nThe symphony is the greatest and grandest of all the orchestra forms the symphony has been around for a long time it made it gets the credit for inventing the civilians friendships of hiding the Austrian composer and he was composing symphonies Seventeen fifty on\nOf course they put on like wildfire then came most art then Beethoven many many others all the way up to the President's Day it's a form which continues to fascinate composers\nAnd in our per great nations following to develop as a symphony we've arrived around the twentieth century I Want to play for your work now who's composed the middle of the second World War given his premier by the Boston symphony in Nineteen forty four\nTo compose as David Diamond who was born in Rochester but didn't go to the eastern school steady weight to Cleveland for a while then studied with Nadia ... [noise]\nDiamond has got to really big success with his first symphony which was conducted as premier by Dmitri metropolis the Minneapolis symphony this in the early forties and so it was natural the diamond what turned metropolis with his new shifting has somebody number two\n... said I Love that piece I really\nReally love it but I don't have an orchestra to play it I'm just about to leave Minneapolis but I can think of someone who could play it in fact I think that somebody has to litters B. S. O. all over it\nBoston symphony orchestra why do you send it because if it's the anchors risky took a look at it and decided to give it a public reading\nWhen it gets the first reading the orchestra itself uploaded as well as the audience know hall and because of his ... said All right I Will play it\nFears George sports now leading the Seattle Seventy music of David Diamond from the Nineteen forty for the first movement of the Sunni number two is that ... ... funeral march remarkably beautiful lyrical music from Nineteen forty four music by David\nOf the Sunni number tuition to dodge your full name brand ... funeral march we could we do the full lyrical music from Nineteen forty four by David Simon\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMusic which was first heard in Boston October twenty second Nineteen forty four was great search crews are good ski reading is Boston symphony orchestra music of David Diamond that's the finale or let go because of diamonds\nSecond symphony so there's really confident in American music written right in the heart of the second World War Nineteen forty four [noise]\nYear they'd Aaron coping gave us Appalachians spring source around the time they reach us to go which he was delivering grudge symphony which gives you some idea of the difference between the American temperament at that time mid forties and that the Russians\nTo tuned into exploring music and this week once again we're going to some funny form this is a project which we've been carrying on for years no twelve different programs twelve weeks of programs twelve tribes that sixty hours a musical symphonies and we've got a great deal of ground but I'm sure I've left some things out that you would like beer\nTo write to us tell us what you would like to hear my favorite ... is an a sign your name oh played a ... and the way to let me know via our website exporting music dot O. R. G.\nHi this is Jenny ... music director at high plains public radio thanks do you remember listeners just shouldn't rocks and rolls and swings and it's kind of you keep the music going get now at H. P. P. R. dot org [noise] oh\n\nFor the finest in jazz [noise] past president of the classic album hidden gems and more\nFavorite homegrown apps international artist [noise] tuned into jazz John\nShield [noise] Monday through Thursday ... midnight sensual support\nFor high plains public radio comes from Dr John Milligan specializing in neurology at BSA Amarillo diagnostic clinics since two thousand five more information at a D. C. P. A. dot com\nHang onto that American feeling of confidence in music do we just heard the music of David Diamond from Nineteen forty four and jump on man almost forty years later to California composer Lou Harrison was only two years younger than David Diamond he was born in Nineteen Seventeen but the music we're going to hear now is much later\nNineteen eighty two components for the brio music festival which is in Santa Cruz California marvelous festival let's hear the finale of Lou Harris's third symphony and his performance when you're the ... festival orchestra under Dennis Russell Davis musical\nLou Harris and you'll hear some similarities in spirit at least I think the music of David Diamond we were listening to her\nThe person you are some similarities it's your least I think the music the diamond were just like to earlier\n\n\n\n... is a very gracious man he said yes I Would love to come to put your ... I used to work for ... India\nIn Bombay what as a younger man I Would love to make a radio program so we keep and mesmerizing just for an hour and a half or you know it it ... type but should card for years I've been working on the composition\nForesee tier ... was ... and it was funny ... by his daughter whose name is a new\nShutting car let's listen to too much from the ... car to the second one was ... which is Marc Lynch does low and his ... got cold out here\nWe ought to his sitar so it was a good chunk car with the London for money or custard no less connected by David march we usually go Ravi Shankar the ... of the symphony\n\n\n\n\nOr\n\nMm\nMm\n\n\n\n\n\nTo be\n...\n\n\n[noise]\nMm Mm\nMm oh\nMm\n\n\n\n\nTo music is in chanting isn't it it's a slow movements lint of Ravi Shankar says symphony a newsgroup Shankar his daughter was the sitar soloist with a bunch of money that raw\nGuy which is a fancy word for some people like a scale it's more complicated than that but if you speak of raw guy in Indian music as something like a scale in western visit your go too far wrong\nThat burger I hear your voice sounds a little bit like the major to me sometimes\nShe has this no today\nOurs get whatever\nBeautiful\nBut she the next movement scared so in a different route got don't gossip columns ... hope I'm getting that a little bit close\nIndie music can be very complicated ... and the rhythm pattern that's underlying this movement is to St suited to what to do one two one two one two one two two one two one two sort of like a five eight doubled up\nSome very hosted by yours truly Mallory\nLet's forget about our cares for an hour and that's just enjoy embrace and let the song speak\nFeaturing acoustic music from our region and beyond joined me for songbirds Saturday the ... only on high plains public radio [noise]\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da di ... high plains public radio available everywhere at H. P. P. R. dot org\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nSupport comes from chamber music Amarillo presenting the gym Laughlin quartet for the jazz on sticks theories friday October twenty six eight PM at the Fibonacci more information at the uh may MA dot org\n[noise]\n\n[noise] hello there and welcome to spring as it gets from a clock [noise]\nWe've been listening to symphonies all week long and in fact throughout my life I've been studying somebody's I was an orchestral conductor for years and years and years it comes with the occupation I guess\nIsn't that he's the grandest of all we were casual forms and we've been studying from the beginnings videos of hiding them all the way up to now music we walked in his second symphony which we're going to listen to right now what was the first somebody was sort of ...\nWhen he wrote around the early thirties and a return to the symphony form after the second World War I think was Nineteen fifty seven he wrote a piece which was conducted the premier by the great John ... chard\nAnd then immediately adopted by George show a performed it but the concern about workers to in Cleveland and then took it home and used to tour this piece\nWas his own Cleveland Orchestra and that is the recording we're going to be listening to now three movements in funny is to get a little bit of the time the first mood of the group multiple wonderful flavors she what do you think there should be is not her very often but I really think it ought to be\n[noise]\n\n\nMm\n\n\n[noise]\n[noise]\n[noise]\n\nOr\n\n\n\n... well\n\n\n[laughter]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\nMm\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n... music you're the first two which of course on march ... news sticking symphony\nWhich was given this from here in Nineteen forty three by the Cleveland Orchestra under every line starts with Bryan Thompson ministry nice recording with the royal Scottish national or ... to ... to ... being flavor I don't really know reading music very much but it's sort of sounds a little touches of nachos quit\nMean ... I don't really know marine the music very much but it's sort of sounds like ... little touches of ... not ... not quite the mores have put something in that neck of the woods especially the winds in church and six and something real technical okay this is a certain\nYou're ... you use your hopes and when they're put over based on ... helps all go together that\nJust sounds like for music to me the most electro boy this was no to the final two ... Michel Martin host the second she'll be there's a book or leg room and then a real like once you get Bryan Thompson is leading the royals Scottish national work history in this recording which you can post in Nineteen forties free by post like marked in\n[noise]", "show_name": "Exploring Music with Bill McGlaughlin", "year": "2018", "city": "Dalhart", "day": "18"}