{"month": "10", "state": "WI", "station": "WTMJ", "content": "Take care of everything at the time she does pass away you're listening to the Clark Howard show [noise]\n\n[noise]\nAttorney Tom Nichols [noise]\nSmall businesses don't always\nWin planning your next software project would you rather work was programmers who live and work here in Wisconsin or programmers who are half a world away\n... technologies they'll meet with him in person and then write software tailored to you or specific Nate technologies can help drain the pain from business processes offering customize design and support when you talk to the professionals that I owe technologies\nVisit them online I owed techno dot com that's ... ... dot com\nWent out your\nWay forward as one central tighter around the ride rule walked job or is just getting started crying as much long either be able to celebrate like us right now\nMuch every post season cashiers news radio WGM Jay\nO'clock is fifty two degrees cloudy with showers overnight lows around fifty one from the WTO O. J. breaking news center I'm rusty Miller burg about [noise]\nHave you with the cold the one allow him to the teams win over the tigers today however they will need an extra game Monday at Wrigley Field to determine whether they are the cubs win the national league central division manager Craig council says it will be fascinating to face up to a million ...\nMiddle men from the atmosphere and interesting game and [noise] and a strategic game for sure and and you know what are some interesting choices throughout the\nDumps manager Joe ... says it's a sign of just how perfect again baseball is\nOne hundred sixty two games just started ... no it's it's pretty crazy stuff it really is tickets are on sale online than we have a link at our website W E n J dot com to get them at first pitches set for twelve o five tomorrow afternoon our coverage begins at eleven thirty\nThe U.S and Canada shake hands on a new trade agreement it's designed to replace NAFTA W. W. J. Radio's Jason Scott has more from Detroit\nThe new deal offering more Gary access to us farmers as Canada demands protection from the Trump administration's tariffs on imported steel and aluminum which may potentially be extended do automobiles from Canadian factories\nMeantime Washington has already reached a deal with Mexico the third NAFTA member Jason Scott for CBS News Detroit\nSports traffic and whether or next W team genius times ten or eleven up to [noise] to go\nFind out what she's very\nFor the ... year selling new GM\nGetting some yard work when I notice my neighbor looking over his land\nWas God Harley Davidson accountable walk is hosting in October fest you don't want to miss this festival favorable featured German here with all your October fest favorite\nBe throwing delicious freshly grill barrage prepared by the title walk by and take part in the hammer slogging tournament and stay for live blogging entertainment was new this year\nDress up for the best leader hose an internal contests ma'am this dying holding competition is not to be missed admission is free to make Wisconsin Harley Davidson a common Milwaukee or October\nFest at national Saturday October six\nBy more info and free registration with a hammer slugging German Guy holding competition and the best leader holes in their little contest at W. I. S. H. D. dot com that W. I. S. H. D. dot com October fest at Wisconsin Harley Davidson by Ninety four on highway sixty seven thousand accountable walk Saturday over six\nThree admission were more W. I. S. H. B. dot com [noise]\n[noise]\nCan get for me to be by driving luxury automobile or a basic level if your goal is just to get for me to be there's no need for the expensive vehicles in regenerative therapies themselves or the Rolls Royce while parole therapy is the efficient productive model\nIf you want to solve the problem is there's no need to pay excessive amount because ... therapy is just as effective as themselves but much more affordable I'm Dr Neil calling with Milwaukee pain clinic dot com [noise]\nAs a board certified neurologist and mosquito skeletal pain specialist I've worked with numerous regenerative therapies and I found ... therapy\nTo be just as effective much more affordable safer\nAs natural and easier to receive\nThis themselves to schedule your appointment today because rule therapy solving problems\nFor one for four or five three Seventy seven eight now\nThink this afternoon but they'll take on the cubs at Wrigley Field Monday to determine the division winner our coverage begins at eleven thirty first pitches that twelve o five and the Packers shut out the bills that level feel twenty two to nothing today to improve the to one and one they'll take on the lions on the road next Sunday\nWGM Jay pillow W. I. dot com time saver traffic no incidents no major delays out on the roadway that this time to be careful with those wet spots due to the rains out they're not even her up for the market to highways sixteen will take you Seventeen minutes forty five ... due to the zoo interchange Fifteen minutes\nThat you have your down payment in mind and you're ready to buy your new home you've taken your monthly payment adding your taxes and realize hey you can do that but you forgot the six percent commission that you'll have to pay your real estate agent\nWell six percent that's a lot especially when will not your home for as long as three point five percent and no higher than three point nine percent and that's one hundred percent both survey with no friends the I'm Angela Kelly with benefit realty where will make your ... simple and affordable\nAnd if it ... back and do the term discount real estate agent throw you I mean that will give you the same experience expertise and know how is the big name real estate firm but we'll do it for life\nAnd when you wait six percent commission against as low as three point five percent and no higher than three point nine percent or a full service real estate agent including marketing with no upfront fees you'll realize there's no reason for you to pay more it's an answer like Kelly with benefit ...\nWhere will make your most simple and affordable benefit dash real T. dot com\nPolitically lows around fifty one for Monday cloudy and damn good afternoon showers in thunderstorms some of those storms may become severe especially cell lines around sixty\nIntroducing mostly cloudy and cool highs around sixty one the barometric pressure is steady the lake Michigan water temperature is sixty two degrees right now in Madison it's fifty degrees in Green Bay forty seven and walk up at the one\nAnd the Milwaukee it's fifty two degrees follow every pitch a brew October right here and get the latest breaking news traffic and severe weather I'm roasting Albert news radio WGM Jay\nTime to take charge of your ... your future missing them and it costs to try to avoid getting ripped off Clark Howard\n[noise]\nMy pleasure to have you join us here on the Clark Howard show where it's all about your empowerment with knowledge that you can save more in ... and don't let anyone ever rip you off and coming up in a few minutes today's car for a moment and we are ripping off our children [noise]\nAnd I'm going to tell you\nWhat we should be doing about it that's right we are the rip off artists and coming up later\nI got so many questions about using a robo are investing a robo adviser\nI Want to put some meat on the bones about what a lot of them are doing bringing the human element back in because it turns out a lot of people aren't happy with just the computer\nHow do you mix the computer and a human well speaking of that\nIn food prep robots\nAre becoming more and more part of the picture is a technology developed by an Israeli company robots now have the ability basically to see\nAnd robots are now working in a food processing plants and\nSoon to appear as smaller units Graham available in restaurants\nPreparing food there is either dangerous\nOr causes repetitive injuries or whatever\nOr causes repetitive injuries or what ever think about things like processing poetry or whatever and I saw an item and the wall Street Journal\nWhich one should we dumped and or is there any other websites like give them more competitive or accurate estimation street\nSo I recommend you know you could look at Kelley Blue book you could look at Edmond see who could NA da Vinci general range here that the older vehicle is worth more than what remains oh there's a balance the newer vehicle you'd be upside down and you'd have to write\nA check for about what you owe on the older vehicle\nSo we're trying to big swing here Fifteen thousand or no eleven thousand dollar swing\nYou said you said a it's worth four thousand more than the aid that so so what I Would recommend is that you sell the older vehicle\nBecause the one when you have on less you hate the car that you owe twenty five thousand on\nYou know it's it's a it's a nice cars that actually measure our than most the other one\nShow that someone who had may because otherwise you're having to come out of pocket with potentially seven thousand dollars\nRight by the ... over the long term maintenance costs are up keep them the more luxury car would offset those expenses but to say that I Love\nYeah I think when you look at the money you'd have to play out in cash no not so much that there is one factor where in the northeast are you going to be moving\nPhiladelphia\nSo the only factor I could think of it might be an X factor is to talk to your auto insurance see\nIf there's a massive difference in the auto insurance premium on the a luxury car that you still owe twenty five grand on versus the older car that you are just the eight on\nWill test and that might cause he things up might make it more confusing\nBut just at first glance with the numbers you laid out\nOr you're going to probably want to sell the older one\nThe one of the things they're maybe put towards the ...\nHave either have you lived in the north before I have\nOkay so it goes without saying that she's going to have a learning curve with driving through winter driving conditions\nAnd city driving conditions okay\nWell [laughter] she's got to be really careful out there you know I when I Lived in the north I've grown up in the south and when I Lived in the north driving was quite an experience for me through heavy snowfall you're listening to the Clark Howard show [noise]\n\n\n\nHey I'm Andy if you don't know me it's probably because I'm not famous but I did start screaming company called Harris the idea for Harry came out of a frustrating experience I had buying razor blades most brand for overpriced over designed and out of touch at Harry's our approach is simple here's our secret\nWe make sharp terrible blades and sell them at honest prices for as low as two dollars each we care about quality so much that we do some crazy things like fire world class German blade factory obsessing over every detail means we're confident in offering a hundred percent quality guarantee millions of guys have already made the switch to Harry's so thank you if you're one of them\nAnd if you're not we hope you give us a try with the special offer get Harry starter stuck with a five blade razor waited handle shaved Joe and a travel cover all for just three bucks plus free shipping\nJust go to Harry's dot com and enter five one five one at checkout at ... dot com codes five one five one enjoy\n[noise] here's the cold hard truth about hard water in our home nearly Ninety percent of America is the\nSecond die hard water contains harsh mineral that can try out human hair hard water can raise our electricity bill by up to forty eight percent\nIncrease he'll napping pipes that can lead to pathogenic bacteria and stressed out yet don't be self paced wider softening can solve all your hard liners he's get the full scoop up a little salt battling\nNoted author former chief medical correspondent and foreign policy user Dr Bob are not\nThe human body has billions of pain receptors block those receptors with the anesthetic spouting salon ... plus and you'll have relief\nSalon ... plus contagious to anesthetics including the maximum strength light again available that prescription they numb aggravated nurse for affective lasting relief parolee try one I use salon pause light again bless in silver box with a blue wave [noise]\n[noise] [noise] ah no matter\nModern your family might be here paddling around that rock and a gas engine vehicle you're living in the past [noise]\nMe the electric vehicle has arrived in celebration electric cars are more fun to drive and more affordable than ever electric cars are here again to the friend and learn more plug into the president dot com or something like ... group of America\nMuch think about estimates Haitian presented by liberty mutual insurance liberty mutual customize your auto insurance so you only pay for what you need so why aren't more things in life customize\nTwice in a burger cheaper when you ask for no one\nTo ... to duck the price of the onion right otherwise I'm paying for the onions but I'm not receiving any\nSort of liberty mutual dot com for a couple of my book and you can save\nEnergy and\nCoverage has underwritten by liberty mutual insurance company with illegal housing ...\nDouble duty I'm Jane news is there and when you want it with the Amazon Echo simply ... and the setting then you she slashed briefing chancellor WGM J tell all access to both a shovel U. T. M. J.\nSay listen life it was awful weather for some hot cash choice checkout direction\nWGM Jay ... slash collective uh [noise]\nCan you trust when that roof needs replacing or your sightings outdated and wouldn't be nice if your family having to have highly skilled designers and craftsmen\nHi I'm Randy Miller from alright home and remodeling we're a family owned business and we treat customers like in a section of our family you can trust in All right home remodeling to provide quality roofing signing an replacement windows are award winning local family business has built a reputation I'm doing it right\nThe forty nine years citing moving and windows should laugh at least Thirty years and so does our guarantee our signature eleven point home improvement process insurers at last after installation if you want it done right call All right All right home and remodeling that the L. L. E. R. I. T. E. remodeling dot com\n[noise]\nI'll\nTell you the today's park rangers moment is really something I'm twisted and not about high am\nVery very agitated I'm very upset that we're looking at a trillion dollar budget deficit the federal level this year and trillion dollar plus deficit sets a thousand billion plus dollars a year after year going forward\nAnd that's in the midst of a very strong economy\nWe make ourselves weaker as a country when we add on more and more and more debt\nIn our own lives we know that to be true right and we as Americans used to care about this but for some reason doesn't matter where people are on the political spectrum nobody seems to care about their continual stabbing in the back\nOf our children and maybe future grandchildren were doing by running up these massive deficits and there's always been my belief\nThat we should pay the taxes for the government we're willing to have and if we are not willing to pay for it there's no tooth fairy who's going to do it so we either need to reduce the involvement of government in our lives\nOr we need to pay more attacks we need to grow up my preference course always used to have government do less and have less tax but we right now as Americans we want our candy\nWe're right now as Americans we want our candy we want to get the cavities in our mouth but we don't want to have to even brush our teeth I mean this is crazy\nWe need to have national discipline\nAnd whatever it is we want government to do for us if we want government to do it we got to be willing to pay for it\nBecause it's not bright it's not fair for our country's future our position in the world but especially not fair to the next generation you're listening to the Clark Howard shows\n[noise]\n\nAnd Trump charges point to wait for ... percent again very small percent forty three five to point to eight traditionally hiring somebody for advice costs you one percent of your money\nVanguard has where they go personal advisor services point three per se but you have to have fifty thousand dollars in order to have access to the humans and those are the big three\nOf the low cost firms so fidelity if you're just starting out you still want the humans but these were you want to go since both Schwab and vanguard or going to require more money from you and then there are the independence\nRipped provide advice six figure uses a completely different model sick pig is free till you hit ten thousand dollars you have to have two thousand to open for the advice for humans is free to hit ten thousand after that point two five\nAnd betterment his point for oh for premium services but the point is they're all cheaper than the traditional they're all cheaper than the way it used to be a one percent\nAnd it's a combination\nOf potentially very good marriage of robotics building a portfolio for you and the human guiding you through the larger issues of what your goals are helping you plan and help you when you freak out\nAs a financial term freaking out\nEvan's with us on the Clark Howard show Hi Evan\nBayh or how are you\nGreat thank you haven't so you're a renter right now and you really hadn't been ready to buy but now you're feeling pressured tell me about that\nWell I think I don't know how to pressure but I think it's just it's becoming more convenient let anything I'm basically our landlords are told us that they ... to\nUm allow renting they'd like to sell the property at the end of our lease and so my wife and I a lot of leases on the first of January and our uh our first child is due in the middle of December so\n[laughter]\nWow that's a lot of life change all on a couple of weeks\nAnd you're not kidding you are not kittens um\nCongratulations to both of you by the way\nThat you that you created um so we're we're in a position now where the next move all our plan was to buy now for more than ... edition of by um obviously ... another year would have been great you know when now that we're\nFacing this fish in a sense they were were faced with either find that are in place that we're in the landlords that all us first does and then it's not I don't choose to go that route and the other I Want\nTo find a a another property and buy a size thing we saw the same deadline which is January first\nStory or your rent something else 'til you got through with the first year of uh living in baby my on let me tell you it's a special lay on do you go with that first year but um\nIt often can be a very attractive thing when the landlord says I'm Out or being away on the horn you're here we like for you potentially to be the buyer so much get to specifics do you like the neighborhood\nOf the property that you're renting we do and do you like the actual individual unit or home that you're running\nWe do yes and you've lived with it how long have you been attendant there\nAbout nine months\nSo that's enough time for you to know if it's a troublesome property\nRight I think the only\nThe economy we see which might not have been a factor\nUh you know nine months ago was that obviously now as a child on the way the school district or in is not necessarily where we'd like to be it's okay um so you know our fault was saying what if we buy this place and then when times\nOn farms for our you know our child of the school you might you might just say why don't we just you know start with the end in mind in line you and the district we'd like obviously there's a lot of factors there but that's the school district as he only only on everything else we liked the love that you love the neighborhood\nYeah a lot can happen in the next five years before school district becomes really paramount\nAnd if it's a great place to live right now is the owner been specific what kind of a price sell sell it to ya and are they willing to finance or do you have to go get your own alone they address things like that [noise]\nSo they have essentially for us to make the first offer so often you know in my own work with a more ... in getting the fruit in such a I mean I've gotten a CNA so I Know a little bit of a range I Know the\nDifferent people Claritin market analysis right yeah right so and not Batman appraisal\nFrom the from the county assesses office so I Know a little ... heart goes out of what his price\nSo you by preventing certainty to the seller they don't have to worry about it being vacant for any period of time they don't have to worry about uh doing showings or anything like that paying a real estate commission you should be able to buy the property from them at ten percent below what the market average appears to\nBe that's the target you want to look at what what\nWe're going to think about it they have a day of the uncertainty they of the the period of time that it may go unsold they have a commission to an agent depending on the place in the market six or seven percent and much of the country maybe five\nSo you provide a real certainty an advantage to them that it creates a win win\nAlthough skiing I mean I guess yeah I mean especially with the the stress of potentially moving out is just outweighs fall in the last stress obviously at the same quality and just phones procedures\nLater don't but don't be so ... sold on that that you bargain at a week in position [noise] so you got to say strong and be willing to move because when you're when you're like oh we really really really want to say here\nYou don't pay too much and it sounds like it's going to be a friendly transaction the best kind and this kind of circumstance Angie's with his own again congratulations on your baby Angie's with us on the Clark Howard show hello Andy\nClarke Angie you have a difficult dilemma to figure out don't you\nWell we do and it's driving us not unlike today\nOh hit me with it\n[laughter] well I had and that could pension benefit with the tiniest employer found several years ago\nAnd like many companies right now there are ... and early one time a lump sum buyout [noise] and I need to respond to them by next week [laughter] so basically my tree choices that they have given ... are\nOne I can take a lump sum now and the form of that one time that they should be about Twenty one thousand dollars\nAt a second option is to still take the lump sum offer now but in the form a monthly annuity payments at a reduced rate\nOr am I going to be now\nA ... hour it would be if I get that straight annuity ... south and didn't give any type of survivorship things on the day that eighty three dollars and I I did that one now so\nThat's a thousand dollars a year or right okay and then what if you wait till they sixty five\nAge sixty five and it would be two hundred and twenty five dollars\nRight and it would be two hundred and twenty five dollars per month\nOkay ... were twenty six hundred you know my normal preferences for you to wait to take it as a monthly payment but why are we ever guy who\nContributes to court dot com as a writer who is a financial expert and particularly one on pension payouts\nAnd we've just posted a new item from him on how you compute based on your individual pension you can plug in numbers and it will help you calculate whether you're best off\nTaking the lump sum in a situation like this where they want to get rid of you or your best off taking the monthly payments for the rest of your life\nThat will be awful new go read that the writer of that article is a guy named west moss\nMOS 's okay and it's simply headlined should you take your pension and the lump sum or monthly payments okay your ... that that couldn't be more perfect for what you just asked me credit\n... and I feel like a lot of people are going to be in that situation is companies trying to help them liability sounds\nAnd how solid financially is the company\nBest possible thing I can recommend go to Clark dot com look at my investment guide to set up a raw there'll be really easy you own it and then you and I both know contributions are what are we going to go to her tax free you're listening to the Clark Howard show [noise]\n[noise]\nYou know you might just because your homes window I retire\nWisconsin Harley Davidson accountable walk is hosting in October fest you don't want to miss this festival favorable featuring driven here with all your October fest favorites be delicious freshly grill brides prepared by the title walk alliance\nTake part in the hammer slogging tournament and stay for live polka entertainment plus new this year\nDress up for the best leader has an internal contests and the sign holding competition is not to be missed admission is free to make Wisconsin Harley Davidson and the kind of Milwaukee or October fest nation on Saturday October six\nBy more info and ... with a hammer slugging tournament\nTime all the competition and the best leader who is in their little contact at W. I. S. H. D. dot com\nW. I. S. H. T. dot com October fest at Wisconsin Harley Davidson of Ninety four on highway sixty seven south accountable walk Saturday over six free admission were more W. I. S. H. B. dot com [noise]\n[noise]\nOh Wisconsin's radio station news radio WGM Jay Milwaukee\nFrom ABC News\nI'm Richard cancer too much\nUser number three speaks Julie sweating they took her allegations of sexual improprieties decades you go against Supreme Court nominee Brett Kavanaugh to the circus on Showtime\nI don't know whether he has a battery moral man maybe I don't know how he has an eighty when he was younger he didn't have a ... or ... I think it needs to be anything to ask me to come out separately\nFBI agents interviewed Deborah Ramirez accuser number two source tells ABC News she provided a list of her alleged encounter with Kavanaugh who denies all allegations by these accuser should say she brought a list of witnesses to her religion encounter with Kevin I'll\nBe with us and Canada are trumpeting what they have reached agreement on the basis for free trade pact that will include Mexico the two countries say the newly named U.S Mexico Canada agreement will result in fewer mark a fairer freer markets and fair trade\nInvestigators in Allentown, Pennsylvania still trying to figure out the car explosion that killed three people on Saturday Night\nWe had the explosion so we ran around the corner and we've just seen fire\nFighter pilots everywhere else already say they have a high degree of confidence that one of the three people killed was the perpetrator almost immediately after California Governor Jerry Brown signed the nation's toughest net neutrality measuring the law the Trump Administration sued to stop it\nNet neutrality is a progressive Montana and dust popular in California but according to the department of justice the state's law designed to force Internet providers to maintain a level playing field on line violates federal law the Trump Administration says individual states have no right to try to police the Internet ABC\nNews legal analyst royal oaks Iran's revolutionary guard announced it launched missiles into eastern Syria targeting what it said were militants Tehran blame for a recent attack on a military parade without elaborating the Iranians say the attacks killed and wounded militants used the phrase river you're listening\nNobody is going to ... to get on you know how many headaches wealth management studio his heels radio WGM Jay\nCan get for me to be by driving a luxury automobile wake up with all his literally happened moments before I was driving through the market interchange was getting morning king yeah that rain storm last night it was coming down these bad news candidates for the brewers gene news radio WGM Jay [noise]\n\n\nWe ...\nWe got ourselves an extra game and uh that's how we're looking at how we're excited to go down there\nBrewers manager Craig council speaking after Sunday's game about the team's time breaker against the cubs this afternoon he adds it's a testament to how the team's efforts in September got them into the position\nYou know we just finished a you know we feel pretty successful very successful late run to get us again we won seven Rona put ourselves in that game that's that's pretty darn good\nThe winter of today's scheme will host a division series starting on Thursday the loser will play in Tuesday's wild card game game one hundred sixty three is left for fans altering their schedules today\nFans laugh Miller Park trying to figure out there Monday plan\nMean like\n\nThis guy says he'll just come in Fox he's not feeling well I think it's going to\nTake off and whether they're at regularly or not everyone seems to be very confident but you\nProblem at all or part Eric built that W ...\nBaseball tie breakers are nothing new to the sports sixteen of them have played in major league baseball since Nineteen forty six there had been those memorable moments such as the shot heard round the world in Nineteen fifty one that sent the New York giants to the world series\nThen there was Nineteen Seventy eight when the Yankees Bucky Dent homework to help defeat the red Sox when the American league east and get them on a path to a World Series when there's even been tie breaker baseball in Milwaukee in the past thinks the Braves in\nNineteen fifty nine to ... have said the Dodgers but the Dodgers one the best of three series at two games to none will another memorable moment or run to a championship come from today's game well that's why they play them\nMadison police continue to investigate the circumstances which led to the shooting death of two people in east side home Saturday they were called to the residents by family members then after forcing entry they found the bodies of the thirty nine year old man and thirty four year old woman along with a gun police believe there is no threat to the public\nNo word from Kimberly Clark after their self imposed deadline from hearing from the states regarding a tax incentive package to eat their clocks crossing paper plant open past Sunday and that happened with no action state assembly majority leader Jim ... says his biggest concern if the plant closes the ripple effect it would have across Wisconsin\nA number of suppliers number ... ... ... I think really hard for their whether they would be a factor as well so whatever trickle down effect that could be damaging to your\nGovernor Scott Walker is hopeful that a tentative deal will be announced in the near future\nUsing my day forecast cloudy damp temperatures in the lower fifties I rain showers are likely to review brumbles under\nMore Monday morning showers and then have the news for more showers and thunderstorms and develop\nSevere sometime after three or four months in the afternoon hype sixty Tuesday most cloudy sixty one Wednesday Hi you're eating windy and human would that be under storms Thursday and friday we move back down [noise]\nI mean you're all just gone to some people were kept\nIn sports the Packers shut out the bill Sunday twenty two to nothing and the brewers shut out the tigers eleven to nothing Sunday again our coverage of the tie breaker game between the brewers in cubs begins at eleven thirty I'm rusty ... news radio WGM Jay [noise]\n\n\nWas one of the ... with with one radio where what eight six six five oh jumbo one eight six six five oh five or six to six online by the jumbo had a job dot com you\nMe on Twitter at jumbo talks and so\n... ... jumbo talks and so here we go with another delay but nonetheless some progress for those pushing the Supreme Court nomination of Brett Kavanaugh Christian homes has the latest from Washington [noise] trying\nThat Brett Kavanaugh one step closer to taking a seat on the Supreme Court I let them Republicans on the Senate Judiciary committee voting in favor of Donald Trump's controversial nominees\nBut the critical deciding alleging note from Senator flake coming within the last minute stipulation and plenty of drama\nI think it would be a proper to delay for a vote or for up to but not more than one week or in order to left the FBI um continue to do an investigation and I'm\nAt the White House green GOP leaders request to conduct an FBI investigation into quote right current credible allegations that investigation will conclude no later than next friday us move flake possibly feeling the pressure when earlier after announcing he would vote yes in committee but\nSexual assault survivors fronting him in a Senate elevator after learning about his decision\nLike all eyes will be on two female Republican Senator Susan Collins and Lisa Murkowski considered swings even Collins and Murkowski vote against Kavanaugh he could still be confer with a yes vote remember red state Democrats like Joe Manchin of West Virginia or Heidi Heitkamp of North Dakota\nIn Washington I'm Christian homes\nAnd so there we says and we'll see just where this all goes what eight six six five oh Jim ... is our number one eight six six five oh five four six to six on the jumbo had a show and goodness knows it would be great if we if somehow got all of this uh\nIt is something else again to start yelling hysterical nonsense about nobody cares about what happens to me and do automatically equate charges involving to other people these women have never in their lives match\nAnd location they've never been to and there's I mean that's the basis for public policy with the uh implied assumption well all men are pigs anyway so it was just proceed we cannot allow ourselves to be governed by hysteria on the one hand again I repeat\nIf these women suffered abuse my sympathy I Hope that the person involved is prosecuted and convicted if convicted is punished but that's no way the conduct public policy and this notion that uh that we'll just go out of hand somebody because I Want got molested is absolute insanity brother exactly\nCorrect and also from the very start or the headaches you get your committee hearing when I send bystanders are onlookers with in the Senate Judiciary committee room began to shout and scream and chairman gladly tried to remove them but I don't think he'd get fast enough\nAnd they did not do it fast but I've although there there could have been a method to his magic is professor of that is to simply show the world the level of the opposition here I'm Sorry but the Syria is no way to conduct gladly right\nAnd and and that bothered me from the very start we do not get those kind of hearing with people shouting and screaming like they did know\nA ... in any event to continue our our our calls here are just go to Russell in Union City tend to see good evening Russell\nJumbo to you and your guest is a this morning Lindsey Graham a raider quote it says that if people really want to be something that this is not about the truth is just about\nPolitics if they really want something the state of Maryland does not have a statute of limitation on any sex crimes that can take this relation and go there and filed charges and have the police they're investigated\nFilms are conclusion if they arrested Kavanaugh convicted him then you know it could not do any further than that would be the end of it right there but when they said if\nThey had that I Would have sacrificed for playing with the NBA\nAnd what they say that again\nThey say they did that but hey hey would be playing basketball or the NBA\nUh well I I Would agree the odds of either a occurrence happening are are pretty slim but to say the least the professor\nAnd there's just no there's no there was a\nBrilliant Maryland when when they committed the statute of limitations but they had eliminated it ... years\nOkay but then again you could not limited for crimes before the day right of the elimination it would be that goes back\nTo want to go back to the law which is unconstitutional so again that would not apply in this particular case it would apply to all crimes subsequent to to the passage of that change in the Maryland state law All right to Linda in Saint Augustine Florida good evening Lyndon welcome\nType think too much I just want to say that we have seen how deep the swamp is and how involved the F ... has been in it\nUm I'll be glad when this is all over because the level of trust so they've sent all time low\nYes my hand and my thoughts with a cat now and his family because he's been taken to that swamp that have never should have gone down and I believe goodness but when [noise]\nWell I'm I'm highly hopeful that it will lead to I mean we all share your are your hopes that in fact that that will be the case\nUh so we we have a timetable now or I suppose that ah if you go through all of the uh the procedural maneuvering as we could get to a vote or a week from today or would that be where we stand up ...\nShow but I have this this fish or something else is going to happen again they're saying that if Mr candidate or does it get on the Supreme Court and I believe me will there talking impeachment and that could really go to another level altogether\nWell but there's there's no way they can pull that off for ... sake like reason a lot of people don't realize is of course of that is that impeachment only takes a majority in the house so many Democrats take the house or to a de dah du Seventy and it would be I guess a race to see who the beach first the president or justice Kavanaugh\nIs correct addiction requires two thirds of the Senate sixty seven votes their own way in the world is the right to get sixty seven votes convict anybody in the Senate and it was just so much thrashing around and and and gnashing of teeth\nIf it would sure make everything more bitter and more divisive I think all the divisiveness all the\nInternet I came to play in the Judiciary Committee it would not get the holding a steady Judiciary Committee gets people on the committee\nThat want to run for president namely a center Booker Kamala Harris they want to run for president do all kinds of things that are playing out their\nAccept or Feinstein I Believe the reason why she direction nobody knows for sure but I think it's because she's up against and strong opposition in California\nFrom the more extreme left wing of the Democratic party\nVery much for the party refused ... rice or for reelection\nTill she wanted to show ... yet so we had a whole bunch of people on the committee failed that have all kinds of agenda and they're using this I think to a play out their own political lives\nAnd quite frankly I Would agree with you I think that a a to a considerable sent a Brett Kavanaugh is just so much ... and all of this and do almost they totally extent proceed forward is Shaq simply upon in this entire activity and and one of the thing is we continue our discussion here\nThe the look on her face when she found out apparently for the first time I don't think she's a an Academy Award actress\nBut she found that for the first time the Judiciary Committee had agreed to go out there and interview her in private\nAnd apparently her attorneys\nAre selected by the likes of Dianne Feinstein decided it would be a lot better for their cause to drag this out in public and in other words the people who were charged with representing her we're doing anything but representing her that we're talking about some attorneys who could dicey just be disbarred\n[laughter] that's interesting an interesting interesting conjecture and I mean\nOne six six five oh jumbo and take a call from a a Maria who ah let's see here where we are uh are right there we go to Maria Dallas now the bull headed Joe next pillow Maria\nHi how are you fine thank you for taking my call\n'em and what I wanted to talk\nAbout a duck the Ford and and that all the\nAll the holes that was the testimony but particularly\nUh when she was talking about going to the bathroom and her that was when they were only the boys and they go a little closer to the amount of people that were there\nThat was the only the boys and the other question so yeah ... ... people that were there and uh the way that they are so that that's a I was wondering you know they have the Boston downstairs or why they have to go there\nAgain of course if we can only do which house it was we we might be able to answer that yes see\nWe don't even know what yeah or even again it's hard I Know or the\nDate or do we were getting people saying that uh that including Kevin O's that I I never associated with this woman we do we we didn't go to the same school we didn't go to schools which regularly interacted with dancers ... and this sort of thing as a V. just never knew were and I gather that a lot of the other\nVoices that we've heard from so far presumably people who will be\nInterviewed by the FBI or could curve\nSo I think the Republicans may have bad mistake my own to scan it when they allow it\nThey would get a prosecutor a woman who was a ... so to speak to ask the questions at the Democratic and ask questions Republicans could not they want to be seen as a quote white men\nOld white men asking questions that are bored and I think they made a bad and they can do in the ...\nThere were too many concessions are made for far too many concessions\nAnd uh I I Would totally concur with you we have more to come and of course the your ... calls welcome as well that the one eight six six five oh Jim boat so where the cabinet nominations for the Supreme Court said is he has passed the committee the Judiciary Committee on eleventh attempt boat the eleventh vote\nRetiring senator a Republican Jeff Flake of Arizona demanded end or does he was in a position to to get it got this one week time for an FBI investigation which is we have noted that\nIt has an awful lot going against it and they will be very interesting to see just what they can come up with because it doesn't sound like much\nBut then perhaps by a week from today that is to say that the Supreme Court term starts Monday or so he's not going to be there certainly for the start of the term we'll see what happens after that more to come in a moment\nWhen you just need to be her and when you just need a royal\nSean Mercury's working hard while you are we know you don't have time to keep up with the news in the day while you're at work we've got you covered on your way home it's guns afternoon news with John McHugh news radio WGM Jay [noise]\nRaised the issue of Lyndon Baines Johnson Bill Clinton President Kennedy you know outside the assassination that terribly fascination that outside of that ah the joke was about President Kennedy but he was White House when did he have time to become president\nThis but we can truly understand why or why that view by be expressed to a ... bill Pennsylvania good evening Carolyn welcome\nCarol is Carol there well uh\nWe can go back or are you there Carol yes oh good when you're on the radio go ahead [noise]\nYes I listen to the radio yesterday just about all day and I heard there's already been six FBI investigations and somebody has just sort of demand that the other one\nThat is true supposed to be done within a week or something\nThat is correct you you are right this man has been investigated six times before and let me let me do an FBI investigations for those who are there have been through uh uh I I was investigated ... above a top secret clearance of the army\nNot as high certainly as as you are dealing with the terms of judges of the like but I was the best to get it\nAnd I had calls from people that I haven't heard from grade school and and then after ... you know they they would say hey how're you doing that and uh after a while I got caught on and I said you\nYou've been taught to do with the FBI rivals said yeah are you in trouble and I said look just tell them the truth to every question they have they dug up people in my past I had even forgot never existed let me tell you about these FBI investigators they are very very thorough\nI that's the I occasionally come by talking my my office at the university\nThat get nothing dramatic that they're trying to clear some die for up to take it or at federal position a federal job and they'll ask me questions and frankly I don't know the answer they'll say you know did he had any ah Hillary Haitians with people and stuff like that you know when I Try their best to answer that question\nBut you're right they are very very thorough and very very good\nAt all of those previous of Asians girls took longer than a week so what exactly and we were supposed to imagine will come out of line this is strictly window dressing it designed to to make a few people a feel good feel warm and fuzzy and ... I think nothing but diverted prevents besides\nBut then we're going to have other political leaders come that a centrist Collins and co ski and\nA lot of uh Murkowski\nYeah there then there's the other question was how are they going to vote and that was driven and those are the issues it and I think they said you're violate today said that he\n... a bit of a crab from Indiana said he will vote no yes\nThat's right that's correct It's gonna be a very close tough though\nAnd there are any of my parents will certainly be beyond ... tie breaker that may be needed\nAnd the beaches the speeches that will be made on the floor of the Senate I thought that Lindsey Graham speech was just outstanding agreed and what and and what are they now have to I was remembering a I think it was a Joseph Welsh I remember correctly you caught the committee maybe you're a lawyer\nAnd he said that memorable statements and that you remember\nHave you know ... or ...\nYou know shame shirts yeah it was just like they have to send in those days everybody was called the communist today you're called a racist\nOr and or Iran as her or or or you're over ... over ... ... ... there are many many choices more to come back with more calls in just a moment and now\nI found from Geico motorcycle to Fifteen minutes for you to choose the fun for the time to have your girlfriend's name Tara a bus tour early one\nBegin to enjoy and get a break up text from terrorists as you finished the last day\nCan you make it ... or something to add insult to injury you could've used those Fifteen times who managed to switch your motorcycle insurance to Geico\nGuy got fifty\nFifty percent or more on motorcycle insurance I'm Jay Garner CEO of Quicken Loans America's premier home purchase lender\nWe've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then it rates go up your rate stays locked but you've rates go down your rate drops either way you win call us today at a hundred quicken or go to rocket mortgage dot com\nRacial upheaval only on certain prettier Trayvon's cover confirmation conditions causing wider like it's not that you think family member thirty thirty conditioners which is\nI used to take a job ... only the ... tons of resumes to find a female candidate for myself the my hair salons that whole process was not smart and I went to a different effect now these games resumes for me to find the right people and practically invites them to find the rocket qualified candidates that smart\nDifferent groups rated number one by employees in the U.S try now for free at ... dot com slash higher that typically the dot com slash high\n... the smartest way to higher because of the rating hiring I to the radio\nSaying no matter\nHow modern your family might be if you're pedaling around that rock and a gas engine vehicle you're living in the past\nMay yard the era of the electric vehicle has arrived within celebration electric cars are more fun to drive and more affordable than ever electric cars are here again to their friends and learn more plug into the president dot com or something like ... group of America\nFrom our urban centers first of all your beautiful outdoor\nWisconsin has something for everyone discover all the amazing adventures waiting in the hat on travel Wisconsin with John with your\nWisconsin radio station\nWanting to Jay\nAnd the perfect one and the good feed arch support for what gave me the relief I Need at\nCornell for one for five for five three three three eight this is a good seat store across from ... mall in the northwest corner et cetera and major road or in Appleton across from Fox river mostly\nBecause of the Jews also either in such a decision to medical conditions visit our website it good feet Milwaukee dot com pain relief and comfort to fit any budget come in for free test one today the good seats door helping Milwaukee walk better for Eighteen years\n\n[noise] [noise] for about\nSix or five oh jumbo and the Cathy in ... Wisconsin joins us to see the good evening Kathy welcome\nHello Jamal I'm I was a a rate that that one but\nI Do believe that a person is innocent until proven guilty and I do believe um judge Kavanaugh should be on the Supreme Court and the one other thing is they say that we're always supposed to believe it when a woman says she's been raped or assaulted\nWell you know there is a role the weight and that was when I remember getting up\nIn front of Congress and she told a story I heard the story of being raped and many of the senators and those had tears they were very moved by what she said and the years later\nShe said that it was a lie and that she was not rate it was a consensual one night stand\nAnd I guess I just wanted to bring that up as an example because it\nWas an issue is part of the reasons some of this is going on and the foundation of the legalization of abortion was foundation was based on a lie by a woman and believed by many many people and we're very very moved by her story which in turn out to be a lot of\nLike you for your call a cafe and we are very sorry for what you are under ... and uh I I Hope that she got some measure of justice at some point or ... or ... are you still on the line or a Kathy\nYes I Am yes\nI just before we go to the next call drifts did the person who is also do get tried and convicted\nNo they did not\nWhere I Am I'm very sorry about that anyway are but yes ... sorry I have I have\nVery strong faith and um I have also do that forgiveness and the lord did something in my life pertaining to this man that um [noise] show him for what he really was as a coward and it it it it's something for me to to\nTurn they may be able to go on and be stronger and um\nSo I I feel very blessed by something that the word for me in that situation\nWell I'm Glad that the your faith has been able to sustain you in the in that regard to that will be back with will be back with more calls in just a moment\nI just save hundreds of dollars by switching to go I was happy I\nWas going to go go cannot guarantee you will be quote unquote legal drinking I really don't know if I climbed even experience with complex human\nEmotional state known as having a housing and part of a modest living somewhere on the ocean floor with no arms legs wireless access what's there will be happy about applying I'm like oh I'm so happy I didn't get turned into New England did I pronounce originally I was taught all called off by saying what are we talking about him\nAnnex management we're about home Green Bay Packers GM's [noise]\nNothing you can accomplish your nose and runway in one another\nIn there are a lot of little things you should do to avoid\nUnintended pitfalls\nHelping new this containing extremely sensitive to how it can affect your bottom line\nMy integrity and earn respect him in homework some are from for quite some time we've been representing businesses here in Wisconsin for older one hundred and Seventy years and will continue to be important to us is making sure that he gets a new way success of your best\nTo clients deserve good lawyers mice and their tyranny fishery mikel M. T. F. N. dot com\nWorthy of life was the slogan used to justify our Wisconsin's ... news radio WGM Jay ... [noise]\nFrom ABC News\nFBI agents interviewed Deborah Ramirez\nThe second woman do accused Supreme Court nominee Brett Kavanaugh of sexual improprieties a source those ABC News Ramirez provided a list of witnesses to encounter with Kevin all she alleges\nSeparately accuser number three Julie sweating it went on the circus on Showtime she asserts she witnessed Kevin are consistently engaging excessive drinking and inappropriate contact list of a sexual nature with women in the early Nineteen eighty\nThat's not the type of behavior that anybody at any age should do\nI don't think women should be treated that\nAnd I don't think that anything in the\nCabin all denies all the accusations us and Canada say it'll mean freer markets in fair trade the two countries announced they've agreed with the basis for free trade zone comprised of the U.S Canada Mexico Indonesia's president as authorized the country do accept international is a ... help for the earthquake and tsunami catastrophe on the central I owned a civil way see\nI didn't didn't Asians raise the death toll from friday's earthquake in ceilings you know what I mean they won't it with crimes by the spill as remote areas have still being beyond the reach of rescue teams and national section rescue agency has said that the desperate need for heavy machinery to lift concrete and shipped debris but that equipment it's almost impossible to transport\nABC Julia McFarland the current death toll eight hundred thirty to the Trump Administration is suing the stopped California's newly sign net neutrality measure\nAG sessions says it's simple states are entitled to regulate interstate commerce that's called the fans get to make the department of justice thinks California's new law promoting net neutrality is illegal and they've sued the state and federal court\nABC News legal analyst royal oaks investigators in Allentown, Pennsylvania say three people were killed when a car exploded on the street we hike county district attorney Jim Martin says there is no further threat to the public\nWe have a high degree of confidence in the perpetrator was probably over this\nYou're listening to ABC News\nNobody is going to set on CD ... how many addicts wealth management studio here news radio WGM Jay\nSavings really do at out last I checked we take our clients over seven\nIt's evolving clamoring for this is Jeff wake up and now you can get my show on demand and straight to the phone with the all new WTO O. J. mobile subscribe today on high to hit your hand of course on WGM Joe dot coms mobile apps\nRecapping a week before and looking ahead to my next guest [noise]\nGame plans right from a Packers head coach Mike mccarthy shall we run off so we're going to be ready to go every Thursday morning at six twenty five I'm Wisconsin morning news Regina ... good morning ... sponsored by a wiccan contractors supply and the fact that my whole store here at home with like\nGreen Bay Packers since Nineteen twenty nine PM\nBreaking news weather and traffic in the morning on your way to war times\nThings happen overnight worth reading in the morning that's what we are here for to help you get up to speed on what's happening in your world and and the winds options morning news when he was running out jogging gee I'm Jay [noise]\nPoints on ... we got ourselves an extra game and uh that's how I look in our excited to go down there\nBrewers manager Craig council speaking after Sunday's game about the team's tiger acre against the cubs this afternoon he adds it's a testament to how the team's effort in September got them into the position\nYou know we just finished a you know we feel is a pretty successful a very successful late run to get us in that game we won seven Rona put ourselves in that game and that's that's pretty darn good\nThe winter of today's ... hosted division series starting on Thursday the loser will play in Tuesday's wild card game game one hundred sixty three of us are fans altering their schedules today\nFans laugh Miller Park trying to figure out there Monday plan noon\nAnd part\nOf our [noise]\nThis guy says he'll just fell in philosophy is not feeling well I think it's\nA cop and whether they're at regularly or not everyone seems to be brimming with confidence or you\nFrom heart Eric ... W ...\nBaseball tie breakers are nothing new to the sports sixteen of them have played in major league baseball since Nineteen forty six there have been those memorable moment such as the shot heard round the world in Nineteen fifty one that sent the New York giants to the world series\nThen there was Nineteen Seventy eight when the Yankees Bucky Dent home or to help defeat the red Sox when the American league east and get them on a path to a World Series when\nThere's even been tie breaker baseball in Milwaukee in the past thinks the Braves in Nineteen fifty nine the Braves face the Dodgers but the Dodgers one the best of three series at two games to none will another memorable moments are run to a championship come from today's game well that's why they play them Matt\nTom from today's game well that's why they play them\nMadison police continue to investigate the circumstances which led to the shooting death of two people in east side home Saturday they were called to the residents my family members and after forcing entry they found the bodies of the thirty nine year old man and thirty four year old woman along with a gun police believe there is no threat to the public\nNo word from Kimberly Clark after their self imposed deadline from hearing from the state regarding a tax incentive package to keep their costs crossing paper plant open past Sunday and that happened with no action state assembly majority leader Jim ... says his biggest concern is the plant closes is the ripple effect you would have across Wisconsin\nA number of suppliers number ... ... ... really part of it they would be a factor as well so whatever trickle down effect that could be damaging to out here\nGovernor Scott Walker is hopeful that a tentative deal will be announced in the near future\nLies a forecast cloudy damp temperatures in the lower east side and rain showers are likely to be here if you run under Monday morning shower and then have the news for more showers thunderstorms\nSevere them after three or four months in the afternoon the Newsday most hobbies sixty one Wednesday Hi you're eating windy and human with under storms Thursday Friday we moved back down [noise]\nI mean they're all just going to be more careful\nIn sports the Packers shut out to build Sunday twenty two to nothing and the brewers shut out the tigers eleven to nothing Sunday again our coverage of the tie breaker game between the brewers income begins at eleven thirty I must you know their news radio WGM Jay\n[noise]\n\nHi there good evening and welcome to the jumbo head of the Westwood One radio with one eight six six viable Jim both one eight six six five oh five or six to six on line and you'll find as a jumble of Joe dot\nCom you can follow me on Twitter at ... Botox [noise] man and woman does not live by Kavanaugh alone and so we're going to be talking about something else in this hour and yes will return to the uh Brett Kavanaugh saga in our final hour\nBut tonight there was a very interesting book out and it just so happens that the subject of this book just had a major moment\nRather uplifting ball but and that's something I think we could use a lot of right now and so we're talking with Jeff Benedict in New York Times best selling author special feature writer for Sports Illustrated television and film producer and co author with armored get tired of the book\nTiger Woods published by Simon and Schuster and to thank you for joining us tonight Jeff\nWell thank you for having me I appreciate it\nBut boy talk about Sarah ... due to the timing so perfect after ... after five years tiger winds of the dirt with players championship last week he uh he looked to me very much like the tiger of all your thoughts\n[noise] I did definitely look like the tiger wall and I think you you chose a good word when you said it's something uplifting\nUm I I thought it was really interesting that last weekend I meant to all the other things that are going on in our country and even in the world that uh it was Tiger Woods that were there a unifying factor last weekend or people around the world watched him win his first PGA golf championship and five years\nUm and just sixteen months ago Jim I I don't think you'd be hard pressed to find anybody who thought that he would uh play golf again never mind when\nGoes all the whole my ability if you're just one of the time and space\nGeico Fifteen minutes could save you Fifteen Percent or more\nNo matter\nHow modern your family might be if you're pedaling rent that rock and a gas engine vehicle you're living in the past [noise]\nMe the era the electric vehicle has arrived in physics celebration electric cars are more fun to drive and more affordable than ever electric cars are here again to the president learn more plug into the president dot com or something like a group of America\nAttention all authors page publishing is looking for authors have you read the book and want to get it published he's publishing look at your book into bookstores in Brazil on line at Amazon apple I do in other outlets they handle all aspects of the publishing process for you\nFor any ... publicity copyright and editing ... eight hundred fines or one thirty six eighty nine now for your free authors of Michigan that's eight hundred lines or one thirty six eighty nine for your free author submission get again eight hundred bonds or one thirty six eighty nine\nAs a small business owner you make every dollar count so what can you do with ten dollars\nGo to this a print dot com today and you'll get five hundred high quality customs business cards from nine Ninety nine that's less than two cents for cars and added to print view satisfaction is absolutely guaranteed she'll have never been easier to turn five hundred strangers into connections just moved to this to print dot\nCom and use promote code two thousand and check out that it is to print dot com tunnel code to zero zero zero\n[laughter]\n\n\n... one of these six six five oh jumbo one eight six six five oh five four six to six if we take a break\nFrom the intense\nKevin media do which of course will be returning\nNext hour in for night after night after night to come but this just struck me as a great story and the sort of the book out of the time it came out of course we're thinking well\nGreat story is just going to be sort of like the\nThe the obituary of his career and then a lamb and a wonderful tournament victory but it's interesting to note to jump into that he had shown some rumblings before this there were signs that may be finally after all those surgeries and all the coaches and all the swings when all the clubs\nThat finally tiger headed back together\nAnd there's no question I mean if you if you we wrote the last chapter this book in January of this year and it at the same month that we were writing the final after\nHe made his first appearance back on the PGA Tour after its course back surgery in a long long absence from competitive golf and um you know he he looked like a player who hadn't quite a long time but the fact was\nHe was out there and if you watched or the trajectory of his performance from January through this summer he got consistently better and better and better by the time the British Open came around where they hold to\nPlay on the final day he was in the lead and at the PGA tournaments he finished two strokes behind or two shots behind the winter I mean you could see that he was on the cost of something great it was just a question of when and ah last weekend\nWhen it happened I think that that scene with you know what amounted to thousands of fans really stand painting onto the Eighteenth fair way\nIt was it was almost identical to what happened back in Nineteen Ninety seven when he was a centrally a rookie on the tour\nAnd he won the western open a cog ill and and there was this massive is you know the people that stormed out of the fair way with him it look like a scene out of a Hollywood movie and when we saw that repeated last weekend to me part of the reason that that's happening down is because\nThis is a guy who we've seen go through everything from infidelity scandal to a very public and humiliating divorced two debilitating injury as two addictions to paint until\nAll of this played out in ways that no one would would ever want to have played out it if it was you\nAnd I think the fact that we've watched him go through so many of these things and yet still come back and fight through and he's corrected all those things if you look at him now he's a he's a forty two year old man who's been through a tremendous amount\nAnd I just think people want to see him succeed and uh people are rooting for him in a way that that really do transcend sport\nI mean you're right he's forty two or he is in fact old enough to be the father of that kid we just talked about a moment ago I was doing some of the stats from the last weekend's a play and uh\nUh he he no longer olds long drive me still drives far but he's certainly not the king of that anymore how else says his game change\nFrom the the tiger who uh came on so strong as a as a kid\nWell it's changed a lot of ways I mean when he came on the scene really ended up in the fall of Nineteen Ninety six\nUm he was driving the ball with more distance and power and\nReally ended up in the fall of Nineteen Ninety six um he was driving the ball with more distance and power and frankly at a more violent swing than anyone had ever seen in the history of golf\nUm he was like a a comment\n... who came into the tour and he was instantly dominant I mean that's the thing that was so stunning everybody was\nHe actually lived up to the height or he won the masters in Nineteen Ninety seven by so much distance that people were thinking I mean if this is the future if the kid who essentially laughed at Stanford after sophomore year can win the ... the masters by that much distance\nWhat is it going to be like a play against this guy because the next Twenty years and in fact what we saw was a guy who was so good who who was\nA comment that he really would be people often times before they actually competed he he was that much mentally tougher and better what we see now is in ... as a guy who who is much older\nOr we've had nine surgeries including for on his back who's who's gone through probably more injuries and come back for more injuries than most professional football players\nAnd he had to significantly modify his swing um he's now in an old an elder statesman on the tour and yet he still I'm now in the top twenty of world ranked golfers and that I just think that's going to stay or go up from where he is\nHe's he's um we describe him in the book as a genius and that's a term that we don't use lightly and it's not one that I've ever applied to any other athlete I've written about and I've been writing about athletes for over Twenty years\nBut tigers different he he's he is genius he's a prodigy child who became a genius who does things with a golf club that have never been done before and we'll probably never be done it yet\nHe has been through the course of the coaches so many swings and the white powder is or the like it and it always struck me again as a casual observer only of of the pro golf but it always struck me [laughter] if it ain't broke don't fix it was it really necessary to go through all of those changes he made\nWell he he has changed his swing I mean depending on how you define that and count at\nLeast five times in his career and in the early parts of his career he was changing his swing and I mean technically painting as ... when he was at the top of the world of golf\nAnd I think that that when I when I mentioned he's a genius or and I you know call him that is because if you think about it that would be a ten to someone like Michael Jordan\nI'm deciding while he was the best player in the world to only shoot left and it I mean it it's like ... retraining yourself to do something that's counter to what you've been doing to become the best in the game and I think that\nWhat it says about tiger the ability to\nBe the number one golfer and change your swing like overall it's like remodeling your house I mean he started over and when he would do that you know it would look like he was in a bit of a slump he will neither at a slump this was him you know remodeling a swing and and as he did so once he got it\nHe was right back to the dominant golfer that he was before a overhaul the swing of the fact that he's done that periodically at different points in his career\nI just think speaks to how much how much different how different is that everybody else\n[noise] one of these six five oh jumbo our number one eight six six five oh five or six to six were coming come back and talk more with the special features writer for Sports Illustrated jets Benedict\nAbout Tiger Woods the person about the special people in his life\nAbout how his career developed over the years comparisons with other big name athletes and ah a thorough look because that's exactly what this book is it is called simply Tiger Woods is a boy you lead say nothing else to cover of the book is a close up shot\nOf tiger's space and the end of the staple of desserts it truly is one eight six six viable jumbo our number one eight six six five oh five four six to six we'll be back with more on the Bullhead a joke in a moment\nAnd the party saying before I met Michael Jordan that would be unfair to suggest that Michael introduced him to all that but the fact is Michael and Charles spent a lot of time and I guess they like to gamble\nOr they were full blown adults and they did in a you know sort of take tiger under their wing and there were things that started happening in Vegas that we're certainly not\nHealthy um for tiger in terms of those marriages family um we document or there's a chapter book about baggage called in the bubble um and it talks about really what what tiger was doing in Vegas and that part of his life um which was a pretty critical part of his life\nAre looking at a at the this there was a period of his life he was I guess at one point actually treated for sex addiction is that right [noise]\nWell that that happened uh after his crash in two thousand nine or in late November of oh nine um there were a lot of things that resulted from that crash\nI'm One of which was a an infidelity scandal that came out it was unlike anything we've ever seen\nFor a professional athlete before and one of the consequences of that was it it it ruined his marriage um and he did take treatment and I think that\nI think if you're if you're honest and fair you have to look at the way he dealt with that issue I I thought he did it was incredible dignity\nAnd character encourage 'em he stood up uh after completing treatment and did a public apology from the PGA headquarters it was televised and watched by people around the globe and he did not duck it did not deny he acknowledged\nHe admitted hum conceded\nCan fast or he did things that most men who get caught in a different situation is similar to that um would never do um it was part of his process really of dealing with a situation and I think most people if they are being honest with never want to\nHave to deal with it but he did um [noise] and uh I think is it's one of the reasons that uh people feel the way they do about him today\nWhile he's six six five oh Jim ... number one eight six six five oh five or six to six this is quite a trail and uh it uh it is just remarkable and it's a it's magnitude of all aspects of this man whose name is the title Tiger Woods\nCoauthored Jeff Benedict our guest one eight six six libel jumbo back to the moment\nI'm In ... so I have one job I grant staff sounds high for being a guy\nWho got a ton more like if you twenty four seven thousands of life is agent always been around for over Seventy five years in Ninety seven percent fashion raining five just mediocre and he's a scale tackle off what winning\n\nGeico expect great savings in a whole lot more\nI used to place a job lined only to sort through tons of resume to find a female candidate for myself the my hair salon that whole process was not smart and I went to a different reason it took ... resumes for me to find the right people and actively invite them to find the rocket qualified candidates\nSmart different groups really never won by employees in the U.S right now for free at different ... dot com slash free dot com slash free typically the smartest way to reading hiring cyber went up three of\nYou or someone you know is struggling with addiction please call this toll free number right now eight hundred three nine zero nine five to eight eight hundred three eight zero nine five to eight by calling your addiction team you're taking the first steps to recovery to help you need to be one called the way he'd hundred three nine zero nine five to eight make the\nRecall now eight hundred three nine zero nine five to eight your addiction teams are third party advertiser for every street centers in places networks individual results will dairy because you were in different teen dot com forward slash turns for more information\nSaying no matter\nHow modern your family might be if you're pedaling around that rock and a gas engine vehicle you're living in the past\nMake the electric bill has a rise in celebration electric cars are more fun to drive and more affordable than ever electric cars are here to their friends and learn more plug into the president dot com or something and I hope so I can\nImagine how you can you do now that I'm living in limited accent you're recapping the week before and looking ahead to my next guest\nThat game plans flight from bankers head coach Mike mccarthy shall we want to also be ready to go every Thursday morning at six twenty five responses morning news\nWith Gina Miller what's good morning go wandering wandering by looking contractors or why they were like general store we're all home of the Green Bay Packers in Nineteen twenty nine GM's\n\nGoing to find the material in concrete or an outdoor kitchen to get to cover their two\nWow I'd like to see how we're living in limited handiwork are you going to end might mean\nSure you're all was invited to check out outdoor living unlimited unique outside in the show\n... sixty five movies gorgeous you\nMeant just click outdoor living a limited time to find out more about him\nSome great what's your address but not to go the way that was a great and pay 'em right\n[noise]\n\n... when they six six five oh jumbo we're talking with Geoff Bennett coauthor with arming the tail end of the book Tiger Woods tell us a bit if you were about ... woods the father a talent scout a very interesting man in his own right\nHe's a fascinating man and uh we we dedicate a lot of the early part of this book to Charles uh tigers parents um it's an area that really hasn't been minded that much Pearl got a tremendous amount of press coverage a when tiger was younger um\nAnd and rightly so but that coverage will never got to what was really about and I think uh we we tried to go as deep as we could but basically he is\nHe's a central figure and tiger's wife and if you look at his upbringing or and the way that oil and coal pita tigers bomb\nUm who got even less coverage um and who had and our mind and equally a sizable role and tigers are bringing the way they raised him he was an only child um [noise]\nOnly child Earl had been previously married you have three children from his first marriage\nUm he did not want to have more kids when he married for the second time ah but ... his wife did she was a Buddhist she wanted to have children\nThey had one uh they gave him a very unusual name or when he was born elrick which was a composite of from the letters of their names um when tiger went to school and he in kindergarten and he had a speech impediment he was super shy\nHe was the only kid in this class a ... who had a different color skin\nUm he really was different in many ways and one of the things that teachers\nWere wandering from the beginning was what was the situation at home because they were seeing oil at parent teacher conferences which in those days or pretty unheard of but we do things like on the show and tell and first grade and bring tigers miniature clubs and they take the class outside in\nBasically a tiger with the show and Earl was Patel it was a it was a pattern that played itself out all the way through tiger is a you know junior career and even on through as amateur career where oral was with him all the time and he was much more talkative our\nTiger Woods always inward and playing um it's a fascinating relationship there was the love that you saw between them when a when tiger won his first masters and\nThere is that iconic scene where they're hugging and crying on the Eighteenth hole that's genuine awe it's real it's a scene that repeated itself many times\nUm but Earl did things when tiger was young that um you might describe as tough love I think he did things with tiger that many dads would probably be uncomfortable doing in an effort to make their son great as a sport\nOr where to get some calls here but the quick follow up is it true\nThat a a a\nURL woods who died I guess twelve years ago still lives in an unmarked graves why\n[noise] um we open our book with that scene that's not really a spoiler it's a you know the first page of the book is set in a cemetery in Manhattan, Kansas and it uh it is a very very strange scene\nI'm we interviewed the Sexton who actually dug grave um and\nWe were able to confirm that in fact a URL does not have a gravestone there is not a marker there um it was we would not have been able to find where he was buried without the federal defense of maps and why not I mean obviously tiger can afford one\nCan serve it even if you bought mine we'd be happy to mount installed and found\nSome for you then remember the safe all up and have always make sure you got to try it on your tires I'm right match you with Richland yard\nThe same time money and frustration every Saturday morning WPN Jay is on demand with the Amazon Echo simply plug in your Amazon device and download the election apt to your phone or tablet when you're done be sure to enable a WPN Jay skill online\nOr simply say Alexa enabled WGM Jay skill once you're enabled say Alexa open WTO O. J. then you're all set my welcome to six twenty dollars for GM Jay for more information head to WGM Jay dot com no for an instructional video\nOr Wisconsin's radio station news radio WGM Jay Milwaukee [noise]\nFrom ABC News\nI'm Richard cancer\nFBI agents interviewed Deborah\nRamirez Gail classmate of Supreme Court nominee Brett Kavanaugh and the second to free woman accusing him of sexual improprieties in the past a source those ABC News Ramirez provided a list of witnesses to her allegation Kavanaugh exposed himself to her\nThe fact is that judge Kavanaugh's behavior back then is being called into question because if she had a drinking problem where if you had a number of drinks to where he blacked out then the question is when he blacked out duty forget the fact that he may have committed some kind of sexual assault former FBI\nSpecial agent Steve Gomez is an ABC News contributor saying it'll mean free markets in fair trade to us and Canada announced agreement on the basis of a free trade zone including the U.S Canada and Mexico\nTrade friction with China and Europe will be a drag on the economy University of Colorado chief economist Richard Wilbur can lead the survey for the national association for business economic fifty\nPercent lowered their GDP Growth forecast for this year based on the trade situation and eighty percent lower their GDP forecast for two thousand and Nineteen\nIndonesian officials expect the death toll from friday's magnitude seven point five earthquake in subsequent to nominee currently at over eight hundred to swell as the thousand\nEspecially with the thing when they desperately need at the moment it's heavy machinery them to move some of that rubble away and with power and communications line down it's proving very very difficult and B we've had reports of looting motivating scat it seems like an extraordinarily difficult situation the typically in how to town and so the way they want something like\nThree hundred and fifty thousand people a of a B\nC James long that Iran's revolutionary guard and now she launched a ballistic missiles into eastern Syria targeting would've called militants believed to have attacked a military parade in Iran last month killing at least twenty four people you're listening to ABC News\nNobody is going to see to hit on you know how many ... wealth management studio his ears news radio WGM Jay [noise]\nAttorney Tom Nichols\nSmall businesses don't tell was Sean Mercury's working\nHard while you are we know you don't have time to keep up with the news of the day while you're at work we've got you covered on your way home\nIt's guns in the afternoon news with John McHugh news radio WGM Jay [noise]\nFrom our urban centers bursting with festivals door beautiful outdoors estimates Wisconsin has something for everyone discover all the amazing\nAdventures winning W hat on drama Wisconsin with John with your Saturdays\nWisconsin's radio station wanting T. M. J. O.\nTwo guys that love talking\n... valley way some of the players that may or may not be on the scene going forward yeah you know this is a pretty important ... Greg ... all things Packer\n[noise] Monday morning at eight thirty five [noise] holiday\nMorning quarterbacks these any by heart I Want to my hotel and casino we're about home of green\nPackers Nineteen twenty now you see I'm\n... ... and we got ourselves an extra game and uh that's how I look in our excited to go down there\n... manager great council speaking after Sunday's game without the team's time breaker against the guns this afternoon he adds it's a testament to how the team's efforts in September got them into this position\nYou know we just finished the you know we feel like it's a pretty successful a very successful late run to get us and in that game we won seven Rona put ourselves in that game that's that's pretty darn good\nThe winner of today's game all hosted division series starting on Thursday the loser will play in Tuesday's wild card game game one hundred sixty three is left brewer fans altering their schedules today\nFans laugh Miller Park trying to figure out there Monday plan knew\nPart\nOf our [noise]\nThis guy says he'll just selling Fossey's not feeling well I think it's getting\nHot and whether they're at regularly or not everyone seems to be brimming with confidence that you\nRob Miller Park Eric built that W came to do\nBaseball tigers are nothing new to the sport sixteen of them have played in major league baseball since Nineteen forty six there have been those memorable moments such as the shot heard round the world in Nineteen fifty one that sent the New York giants to the world series\nThen there was Nineteen Seventy eight when the Yankees Bucky Dent home or to help to beat the red Sox to win the American league east and get them on a path to a World Series when\nThere's even been tie breaker baseball in Milwaukee in the past thinks the brains in Nineteen fifty nine the Braves face the Dodgers\nBut the Dodgers one the best of three series at two games to none will another memorable moment or run to a championship come from today's game well that's why they play them\nMadison police continue to investigate the circumstances which led to the shooting death of two people in eastern homes Saturday they were called to the residents by family members then after forcing entry they found the body and some of the thirty nine year old man and thirty four year old woman along with a gun at least believe there is no threat to the public\nNo word from Kimberly Clark after their self imposed deadline from hearing from the state regarding a tax incentive package to eat their Fox crossing paper plant open past Sunday and that happened with no action state assembly majority leader Jim ... says his biggest concern in the plant closes if the ripple effect it would have across Wisconsin\n... number of suppliers number ... ... ... really hard for their living they would be a factor as well so whatever trickle down effect that could be damaging to the economy up here\nGovernor Scott Walker is hopeful that a tentative deal will be announced in the near future\nClimate forecast cloudy damned temperatures in the lower video and rain showers are likely to hear if you run under\nOr Monday morning showers and then have the news over more showers thunderstorms and develop\nSevere time after three or four months in the afternoon the Tuesday most cloudy sixty one Wednesday Hi you're eating windy and human with under storms Thursday and friday we moved back down [noise]\nI mean you just got to see more capital\nIn sports the Packers set out to build Sunday twenty two to nothing and the brewers shut out the tigers eleven to nothing Sunday again our coverage of the tie breaker game between the brewers incomes begins at eleven thirty I'm rusty ... news radio WGM Jay\n[noise]\n\nEither good evening and welcome to the gym do have a joke from Westwood One radio we were one eight six six five oh jumbo one eight six six five oh five or six to six online you'll find as a jumbo had a show dot com you can follow me on Twitter ... jumbo talks with talk some more\nAbout Brett Kavanaugh and where this is all going of course for the record Kavanaugh has by the slimmest the margins passed the Senate Judiciary committee eleven too with the Jeff Flake vote coming from the Arizona Republican who is retiring after this term\nWho gave his vote only on the condition\nThat there'd be an FBI it investigation\nWhich is like ... ... last to\nKnow more than a week [noise] you have to wonder what the FBI can find out that they haven't found out in six previous investigations all of which by the way we're much longer than a week [noise]\nWhen they don't have a location for the alleged crime they don't have a date they don't have from names of those who were there [noise]\nI mean what are they going to do\nThrashing out for a week I guess and make everybody feel like well we got an FBI investigation well we'll see I suppose assuming that we don't go with something else now uh the the\nBrett Kavanaugh as the litter bug or or that he has unpaid parking tickets I mean it's hard to know what is in fact next year\nBut in any event\nIt's been a very interesting bit of testimony I found particularly the documentation that was offered by cabin ought to be very compelling a combined with the the lack of that from Ford who was was rather an focused\nAnd see if in fact they were telling the truth and then the much hype penalties to these people because quite frankly I think it's totally a you know this has gotten out of hand\nIt never should have been public can never shit but it should've been a public hearing\nAnd that's that's my final point and that is I think that Congress of the United states or the government as a whole Riyadh insist\nThat there'd be some\nGroup together and it might be retired US Senators and retired uh uh representatives\nTo find more civil ways of handling these things and and and you know putting constraints on them and putting ... constrict restrictions on them I and especially as far as the public appearances are concerned and you know let's not make it a circus anymore and give\nBack to some type of a\n... instead of having to be the head filter McCoys having it'd be a government being run\nWhether it would be certainly nice if in fact we could do that I Would keep in mind that most of what you were talking about our institutional changes that would require a constitutional amendment doesn't even have to change the advise consent role of the of the Senate as it now exists more to go back in the moment\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchased wander we've\nCreated a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate up to Ninety Days then if rates go up your rate stays locked but you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about a hundred and thirty year fixed rate moms are crossing permission ignition housing winter licensing often do you think's analysts number thirty thirty initial conditions are solutions may play\nLiberty mutual insurance knows your focusing on the road right now so we'll just describe our new billboards to you\nKnow horizontal rectangles with yellow background the headline reads liberty mutual customize your auto insurance so you only pay for what you need and while that might sound like a lot of words or a billboard that all fit perfectly overall pretty great advertisements go to liberty mutual dot com for a customized quoting you could save\nEnergy covered is underwritten by listening to insurance company ... lounge or noted author former chief medical correspondent and Columbus user Dr Bob are not\nThe human body has billions of pain receptors block those receptors with the anesthetic found in salon ... plus and you'll have relief\nSlump ... plus contains two anesthetics including the maximum strength line again available that prescription they numb aggravated nurse for effective lasting relieve parolee try what I use salon pause light again plus in the silver box with a blue wave\nResults very non solicitation for legal services you owe the IRS taxes payroll taxes were I'm not filed you return the IRS will get you they can take your property take you to court even put you in jail with one call to wall you'll never need to talk to the IRS again our average\nClientele is for about ten percent of what his old we offer free face to face consultations in your local area called eight hundred Seventy seven zero for three three that's eight hundred Seventy seven zero foreign three three\nWhen posting on most job sites you get candidates I'm the sales are reading the latest round of anthrax that you're looking for but when you posted in the dot com you get the candidates just right for you\nAnd in fact there was an MBA over ten years on and on suffering from Japanese\nWithin even as screener questions for a less time consuming to your shortlist of qualified cannot\nTyrants better when you got your time of hiring when you lose the job was\nStarted today and indeed dot com slash\nMatter\nAnd it today and indeed dot com slash\nNo matter\nHow modern your family might be here paddling around that rock and a gas engine vehicle you're living in the past\nMe the ... the electric vehicle has arrived in celebration electric cars are more fun to drive and more affordable than ever electric cars are here again to learn more plug into the president dot com or something like ...\n[noise] [noise] [noise]\n[noise]\n\n... what eight six six ... jumbo as we look at the cabinet situation he's passed committee\nBut by one vote margin it'd be conditioned for that vote from Jeff Flake another week given FBI investigation so there might be a vote next friday\nBy the full Senate or not we'll find out All right uh to a a call from but Travis I'm Sorry ... comes from Charleston West Virginia was go to Tommy in Charleston other will tell me what's on your by denied\nThank you for this opportunity there is a I Will fast go backwards to Nineteen Seventy four in North Jersey I register as a Republican because they told me I was Irish and I should be a Democrat\nSo we loop leap forward to Nineteen Ninety nine and import Bill Murray those Mexico just south of can't code at a red hot restaurant and I mean everybody was there I saw senators eleven\nOf Michigan and Lieberman of Connecticut\nI gave up my table to them and I gave them a nod they knew I did it I said no you guys go\nNot because they were perfect senators to me that's between them and the states they come from they were honorable men there were dignified and I happen to love the Democratic republic they were credit to it you know what I saw the Democrats do this cat and off thing [noise]\nThe fact that Feinstein sat on that information for so long and share it with Grassley made sure the media got it before Grassley did and if she wants to tell you a lie go ahead and believe it\nOr I Am and what I saw Cory Booker who even ... years I don't know him a little bit Ralph him a little bit but [noise] I just lost my respect for him\nSo I I did have not made a convincing case for becoming president of the United states I must say five side of course for the record says she was not the one who leaked the the letter a okay maybe not a travesty and add to lose your Alabama's good evening grabbed\nHis name in the ... are you doing\nI'm well thank you\nAll right I'm I'm kinda young whole this whole rate [noise] um [noise] we all know what it's about [noise] you know\nThis boss [noise] just like you said only ... [noise] everybody\nWalk on eggshells [noise]\nWill be political [noise] hoard record all or do they call [noise]\n[noise] well\nI I Do agree with you and your calls it a little weak they're the lion the little tough to understand driver so I'm going to move on but I understand the executive point you're making [noise] there's no doubt about I think Dr Ford has been used as a pawn and I think that that's a despicable given that what appears to be heard testimony that somebody\nDid something bad to her she has really has made a case it was Brett Kavanaugh but that somewhat did I have a good seems to me pretty clear Todd ... washing the below Tom\nHello jumbo thank you for taking my call no sex before marriage ladies and gentleman we do need to get closer back to that but\nMeanwhile back at the edge Elizabeth Warren is log air is launching a piece of legislation that for businesses over a billion dollars a year and colonel gave me given year is going to get government oversight\nAnd it's the beginning of the socialization of large corporations\nBut I I I Am Mr Pitts I'm not entirely familiar with what a good companies who are worth more than a billion do more than a billion in sales but but anyway big companies [noise] ah what kind of government oversight or you're talking about murder she taught right has\nTo do it it has to do with the board structure and uh they're going to mandate or government representation on the orange structure\nWhere she's going to try to do it I I really don't believe that will get past the a Donald Trump veto so anyway nice try no cigar\nAnyway yeah are you still work to jumbo yes your brief okay uh that sport relates to Kavanaugh in that regard that this was a smoker or a smoke screen so that everybody's looking at this\nWhile you were talking about something that's going to like it inhibits your the engine of commerce and\nWell except for the fact that you'd never get that through a\nA I don't think either houses of Congress quite frankly and he certainly would get it passed the Donald Trump veto so other than that Elizabeth Warren again looking a little bit that did see a I'm not sure what you believe the cockroaches certainly is going to become law or more to come stay with us on the general had a job one eight six six by boat jumbo\nWell I I certainly couldn't sit back and just flat out say you're not right I I don't know that it is I mean I I have a tendency to give women who claimed that they were\nWere the victims of abuse the benefit of the doubt or when they need victims but did they there was so much compelling evidence to the contrary about this particular a person a allegedly abusing her than there are serious questions that are there are certainly as far as that goes but\nUh it it could I suppose being set up from day one goodness knows or the Democrats have apparently treated her as a pause or if we are to believe again I don't think she's Meryl Streep or the chief certainly looked very very genuinely shocked when told in front of the committee that\nShe'd been offered a chance to testify in private in California\nAnd and she had to like it was the first few do about it now there would be no benefits to her a fading ignorance there is [laughter] it was it it looked as though the lawyers who had been quote\nA employed to represent her are representing anything bought her they're representing a political viewpoint aimed at getting judge Kavanaugh and if in fact they have to have to drag locker forward through the dirt to do that well then that's a small price to pay that is what it sounds like to me\nOne eight six six five oh jumbo and as we do on a friday night we check in with our man mighty John Marshall of money music dot com\nI every one this is my job not record jibe with our money music minutes but first William seller for the fame Motown record label which shop around by Smokey Robinson and America and featured on their debut album by word of the film work today and the answer right after this\nLiberty mutual insurance no who is your focusing on the road right now so we'll just described the advertisement we email you\nThere she is the statue of liberty printed on a premium sheet of paper the message read liberty mutual customize your auto insurance so you only pay for what you need you'll think wow this is top notch marketing that makes me want to reconsider my insurance provider\nGo to liberty mutual dot com per customized coke and you could say I am very very coverages underwritten by liberty mutual insurance company with illegal housing ... or\nYou can take a job lined only to sort through tons of resume to find a female candidate for myself the my hair salon that whole process was not smart and I went to the reader is technology games resumes for me to find the right people and actively invite them to find the rocket qualified candidates that\nSmart different groups really never won by employees in the U.S trying now for free and typically dot com slash higher that typically dot com slash high\nTemperature smartest way to higher rating hiring I can never went out three\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments Quicken Loans we created a new way to protect you from unpredictable interest rate so you can buy a home with certainty it's called ... and here's how it works with the ratio you can lock your interest\nThat works with Rachel you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get a lower rate with ratio we really have you covered\nHere more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation in customer satisfaction for primary mortgage origin nation and for the fifth year in a row they've also rank the highest in the nation for mortgage servicing ratio\nAnother way we can save your money on your mortgage policy that eight hundred quicken or go to rocket mortgage dot com\nBasin right and what you said in comparison to deter records original approval and balance earn thirty or just turned ... confirmation and conditions equal housing wonder licensing office he said I don't want for thirty three additional conditions virtually may apply like\nTom Nichols with mice Tierney Fisher and Nichols hill UT and Jay is on demand with the Amazon Echo simply plug in your Amazon device and download the Alexei apt to your phone or tablet when you're done be sure to enable a WPN Jay skill on line\nOr simply say Alexa enabled WPN Jay Hill once you unable say\nAlexa hoping WTO O. J. then you're also always welcome to six twenty delicacy I'm Jay for more information head to WPN Jay dot com no for an instructional video\nYou fight\nThe integrity and earn respect him in home or to my friend for quite some time we've been representing businesses here in Wisconsin for over one hundred and Seventy years and whether he or independent or a plane of what what was the most important to us because of cost effective positively resolve more business\nClients deserves good lawyers\nMinds new Tierney Fisher in their goals empty up then dot com [noise]\nI agree\nThere's no more political than most I'm a Smokey Robinson with over yes he is\nOf success stories their first album five million dollars worth of five or something you can find the values any records money using [noise]\nHad to go back to bull headed shows we get some reaction to where we stand to be a bread Kevin uh saga one eight six six five oh Jim both but I have six six five oh five four six to six or Patricia cause in Zanesville, Ohio hello\nYeah Hi there and carry a\n... ... ... schools all my [laughter] [noise] and he mentioned God ... back at\nA fairly and I think I Am I able to take care of every woman's testimony that ... she was pushed into the light of day or less at night and she ever\n...\nI always sort of assume that it was night but I'm not really sure\nWhy the dark and then I understand they ... and her friend a woman\nAnd whether there were differences apparently it in the people on hand she's given two different stories so\n... ... ... I ran down the stairs and you know he needs help them I have a girl come up or whatever you know this sounds\nIs our that everybody had around like this I have to do that yeah there there are areas question how can you know there are several\nOther things that when you take all that kind\nOf you know it's fine to uh I I appreciate your thoughts and obviously maybe with helpful if you'd asked some of those questions as well so did you ever uh you'd never know thanks for sharing those they're pretty good Kayla in Tennessee good evening Kayla\n[noise] ... oh I'm fine thank you go right ahead\nI Can't speak to that kind of now the doctor for it yeah um I I don't mean to attack her but\nUm I and then then the actual idea and I think it's ... act in LA like ... or ... ... ... make this up or\nYou want to say about it a ... you know how she even had Dr Karen fight uh-huh she talked about that have a camp like trying to put it that like I did and they keep calling me stupid you know\nWell I I don't I founded the amazing differences between her lack of specificity on so many things would have happened where it happened who was there but she's Abdullah I certainly wouldn't read [noise] I Do find that rather interesting it was\nA one eight six six five oh Jim bode one eight six six five oh five four six to six and we have a call from a Henry in Baton Rouge Louisiana hello Henry\nHey Jim Lloyd doing I unlike a color but we'll go go the or earlier Larry King days of that is something like this happening in college I was a sophomore in college I was a college athlete\nOr it's a small school Catholic I'm Catholic ... let me put that out there I consider myself a common sense person when it comes to politics now Republican or Democrat I voted for Reagan I voted for Bush number one I voted for Clinton I go to sports number two I voted for about a year ago so um\nAnyway and I was very fortunate that you know the girl was said something that happened between me and her I was with my teammate actually on the road so ... you know when it happens it it it's a real shock to you know what I mean I'm here's what started about this whole situation I think\nI think the I think that doctors credible I think Kavanaugh's credible\nAnd I think this is what happens when you involve alcohol and this is what disturbs me about Kavanaugh's knows this lady is not going on the Supreme Court catalyze is abusive alcohol\nFor quite some time is evident\nAnd he was really a lot of the least evidence frankly Henry drag a little more than he should have there's no others as well lately and I don't know how are you on a whole different views alcohol I mean I well he described assuming he was accurate in what he described would hardly amount to abuse of alcohol at least in any meaningful sense\n\nThat depends on the person who thinks this is um I don't know what you're saying because too many drinks but I'd probably have a different opinion on that I mean when you put\nIt this way I did not believe every person every person I've ever had a ... of another beer or two more than they should have had is automatically going to engage in such a behavior a sexual lasagna or why the ... circuit a high position of responsibility I don't buy that\nHigh end in Compton for over Thirty years you know the truckers America's most rent trucking business\nNow every week and watch me and my co host grows as they need the only weekly show creative just joined us for all the breaking news affecting the trucking industry along with an awesome regularly pull up a\nPerimeter dot com is the one you're not going to want to have you traveled down the highway\nSo do we watch the news channel my going through the dot com\nWisconsin's radio station news radio WGM Jay Milwaukee [noise]\nFrom ABC News\nI'm Richard camps who\nAccuser number of free speech Julie sweating it took her allegations of sexual improprieties decades ago against Supreme Court nominee Brett Kavanaugh to the circus on Showtime\nI don't know whether he had that are immoral and maybe I Am the halls in eighty when he was younger he didn't have a famous or by I think it will be it and I think we need to come out separately\nFBI agents interviewed Deborah Ramirez accuser number two source tells ABC News Ramirez gave investigators a list of witnesses to her alleged encounter with Kevin Kevin ... denies all these allegations are us and Canada are trumpeting that they've reached agreement on the basis for a free trade pact that will replace NAFTA\nCanadian and us ... came to a deal Sunday night that everyone including Mexico sounds happy about prime minister Justin Trudeau was mobbed by reporters in Ottawa\n\nCanada the new deal was it a priority for President Trump will deal opens candidates dairy market to the United states farmers all Canada tapes its dispute resolution process they Schreiber ABC News\nAuthorities in Allentown, Pennsylvania say they have a high degree of confidence that the perpetrator was one of three people killed in a car explosion\nPolice the neighbors standing just feet away Saturday Night\nAs the vehicle erupted in flames residents describe a thunderous blast miscarriage ripples throughout the neighborhood investigators revealed few answers about the explosion in what may have caused the men's identities have not been released and authorities are calling the blast a criminal incident ABC's\nZachary ... the Trump Administration going to legal war with California suing the state almost immediately after governor Jerry Brown signed the nation's toughest net neutrality measure administration asserts the federal government and other states regulate the Internet you're listening to ABC News\nNobody to send incidents eating at ... how many addicts wealth management studio here is news radio WGM Jay fingers come in different sizes it's one of the first things you learn as they do\nIt's evolving clamoring for this is Jeff wake up and now you can get my show on demand and straight to the phones the all new WTO O. J. mobile subscribe today on high tune pitcher handle course fund WTO O. J. dot coms mobile apps\nBreaking news weather and traffic in the morning on your way to organize things happen overnight worth first thing in the morning that's what we are here for to help you get up to speed on what's happening in your world in ... when times in the morning news with Gina Miller who's writing out jogging gee I'm Jay [noise]\nWGM Jane uses them when you want it with the Amazon Echo simply launch the Alexei ... have been in the setting that you choose slash briefing searching select WPN Jay ... to open WGM Jay say listen\nLive it was all say whether for something I can go choice\nMore information head to W. TMZ dot com no for an instructional video\nBy a female very there will be one more game for the brewers before post season play and that is to break it tied with the cubs for the national league central division title that gain taking place at Wrigley Field this afternoon\nSunday's game at Miller Park did make the performance of those who hitched in the game less likely to play in today's tie breaker manager crate council speaking after Sunday's game that their work will help them get their full pitching staff in great shape for the postseason\nGot some guys to rest which is a ... was critical to that really I mean we were there were certain guys are staying away from that I kind of regardless but um those sort of it's such a PR um [noise] tomorrow better\nBe gained gets underway it's well they'll find our coverage begins at eleven thirty and there will be some fans headed down to the game today\n... fans are scrambling to check their Monday calendars he wants\nTo go to Iraq and Iran were\nLooking for looking to take the train down right now\nFor gay one sixty three is high\nWill take him down at the ground\nI think we have a really good chance that the division when they're winning in Chicago which area of the fact\nThat we don't want to so much better that way at Miller Park Eric ... W if you have\nA new report detailing the confusion regarding evacuation orders following the explosion at the husky energy refinery and superior in Eighteen page report by Douglas County bonding social media postings caused wrong information to be used making the evacuation area larger than it should have been\nThey are suggesting in future events to use one spokesperson to pass along official information\nThree people recovering from injuries due to their vehicles spinning out on I forty three north of Milwaukee is downtown early Sunday Morning the sheriff's office says wet conditions causing a car to lose control in the north bound lanes near keep striking another vehicle just accident also caused another two vehicle accident one person was arrested for a probation violation\nThe W. J. forecast for your Monday cloudy damp with accidents showers and thunderstorms likely do those storms could become severe we'll see how he's around sixty for Tuesday mostly cloudy and cool highs around sixty one\nWednesday mostly cloudy it will be windy warm and humid and a chance for afternoon thunder storms highs around Seventy eight for Thursday partly cloudy remaining breezy and cooler highs around sixty four\nFriday morning shower then mostly cloudy high around sixty three\nIn sports the brewers sweep the tigers with an eleven to nothing when Sunday that forces that division tie breaker game against the cubs at Wrigley Field this afternoon again our coverage begins at eleven thirty the first pitch at twelve all fine and the Packers going to win over the bills that level field twenty two to nothing\nSunday there back in action next Sunday hosting the lions ... news radio W. A. T. M. J. [noise]\nOf these media network\nThe the first news\nThis morning when you're with\nTwo point oh good morning I'm Jordan deal along with Jennifer ... on this Monday October first Roger with us here what we have for you this hour\nThe lesson Canada have reached that last minute deal to replace the north American free trade agreements in accord that already includes Mexico\nPresident Trump says the FBI has free rein to investigate allegations against Brett Kavanaugh but opponents say the White House is restricting the pro\nThe earthquake and tsunami that struck central Indonesia have killed more than eight hundred people there are warning that the count could go much higher\nThan on the tech front how will the new iPhone stand up when submerged in liquid\nIPhones at least a dating back to the IPhone models and certainly many rivals tone including Samsung Galaxy than others have been water resistant while now apple is now pushing though is not only that the new phones are deep water resistant but that they can withstand accidental spills\nCoffee soda beer whatever\nHad begun USA Today on his brutal iPhone tests he's here in about twenty minutes\nTo us and Canada have reached a last minute deal to rework the north American free trade agreement last night spending agreement will allow Canada to join in accord reached in late August between the U.S and Mexico more from this morning's my job in\nBiggest impact is expected to be on the auto industry requiring it\nThe wall Street Journal says one of Canada's last minute concessions was a pledge to curb protection for dairy industry a policy President Trump has frequently criticized that unfairly\nRestricting American exports the U.S intern compromised by dropping its demand to get rid of these special NAFTA courts that allow members date to challenge trade restrictions opposed by the others or in\nMy age President Trump told the journal that the revised NAFTA marks a significant turning point in trade policy showing Mr Trump's ability to craft deals noxious threatened to rip up old ones or otherwise restrict commerce with terrorists\nHave met Mariel of earthquake and tsunami\nVictims began today in Indonesia the toll of more than eight hundred dead is largely from the city of Apollo and it's expected to rise as areas cut off by the damage or reached the magnitude seven point five earthquake struck friday and created a sue ... said to been as high as ... when the feet in places\nA government officials are the mass grave being dug will be thirty three feet by three hundred thirty feet and can be a large needed officials say it is needed for health and religious region of the reasons\nAnd that's how we got from what we have today\nKim Kim Zetter cyber security journalist Nineteen Minutes after the hour\nOr so before I was brought through my head you know not Martin making the lottery\nThe centerpiece of your retirement plan but you know what is smart going to zip recruiter dot com slash Gordon\nTo hire the right person recruiter doesn't depend on candidates finding new strip recruiter finds them for you it's powerful matching technologies skins thousands of resumes then identify people with the right skills education and experience for your job and actively invite them to apply\nSo you get qualified candidates fast that's why the recruiter\nIs rated number one by employers in the U.S just reading comes from hiring sites on trust pilot with over a thousand reviews\nAnd right now our listeners tries or recruiter for free at this exclusive Web address zip recruiter dot com slash Gordon that's zip recruiter dot com slash Gordon four to five companies say they find a qualified candidate with one within one day using zip recruiter\nSip recruiter the smartest way to hire again the free trial begins a recruiter dot com slash Gordon\nTwenty minutes after the hour on this morning Jennifer ...\nIs here with more of America First news Canada is that going to revamp the north American free trade deal with the U.S and Mexico after weeks of bitter high pressure negotiations\nHad brushed up against a midnight deadline and a joint statement us trade representative Robert Lighthizer and Canadian foreign affairs minister Christian ... said the agreement will strengthen the middle class and create good at well paying jobs and new opportunities for the nearly half a billion people who called North America home\nThe new deal reached just before midnight deadline and posed by the U.S will be called the United states Mexico Canada agreement or us MCA\nFBI agents have interviewed one of the three women who have accused Supreme Court nominee Brett Kavanaugh of sexual misconduct as Republicans and Democrats battle over whether the bureau will have enough time and freedom to conduct a thorough investigation before a high stakes vote on his nomination to the nation's highest court\nThe White House insists that is not micro managing the new one week review of Kavanaugh's background but some democratic lawmakers claim the White House is keeping investigators from interviewing certain witnesses senator Mazie Hirono of Hawaii tells ABC's you can't understand why Kevin I wouldn't want the FBI to clear his name\nWhen he kept saying that I didn't do it\nThen why wouldn't cheat calm for an FBI investigation fly when people do that\nPresident Trump tweeted that no matter how much time and discretion the FBI is given it will never be enough for Democrats trying to keep Kevin ... off the bench\nBody bags replaced side by side in a freshly dug mass graves today is a hard hit Indonesian city began burying the dead from a devastating earthquake and tsunami killed more than eight hundred forty people and left thousands homeless the death toll is expected to keep rising as areas cut off by the damage our reached\nPay back and the Ryder Cup belong to Europe for two years after the American thought they had their Ryder Cup problems figure it out\nYou're reminded them yesterday why it practically is owned the trophy for the last quarter century British Open champion Francesco Mullen already became the first European to win all five of his matches he was to happen safely on the green at the sixteenth and when Phil Mickelson hit into the water removed just kept and conceded the match\nJordan his gracious for this is a tale kicking now what is called the the European Cup I think it's their cheese baggage in twenty three minutes after the hour long this morning Americas first news [noise]\n\n\nYou don't often find the words business and friendly and the same sentence let alone the same state\nUnless of course you're talking about Michigan Michigan's business friendly practices help them become a leader in industries that range from\nAgriculture in cyber security do aerospace and advanced manufacturing\nIn fact Michigan is ranked among the top ten states for major new and expanded facilities which makes Michigan more than business friendly it makes Michigan business smarts to learn more visit Michigan business dot org capital one is building a better bank one that feels and ... nothing like a typical bank\nIt's why the reimagining banking and building something completely different they offer accounts with no fees are minimum they also offer one of the best savings rates in America and you can open a capital one account from anywhere in five minutes capital one this is banking re imagined\nOpen an account today inexperienced banking re imagined for yourself\nCapital one what's in your wallet capital one in a\nSame time money and frustration every Saturday morning to you where do you where every Sunday [noise]\nUsed to go to what happened all over you all for it and do you believe it was to have gotten this done as nice as they did you feel better about it as well\nAlways hikers Wayne Larrivee on Wisconsin's afternoon news with genres your days at three twenty\nFive ... fear of all home on the Green Bay Packers or Nineteen twenty dollar WGM jak\nWake up with our eyes literally having moments before I was driving through market energy Israel was\nGood morning Jean yeah that rain storm last night it was coming down so these values candidate for the brewers genes news radio WGM giants [noise]\n\n\n\nBreaking news weather and traffic on your way home for a long hard day at work the last thing you want us to get stuck in traffic and you have in your car were there to help get you always\n... radio WGM Jay [noise]\n\nRecapping a week before and looking ahead to about ... [noise]\nGame plans voice from a Packers head coach white but we're also for the ... Rouge every Thursday morning at six wanting fall on Wisconsin wanting me it was when she Miller will tree morning water sponsored by contractors apply have regrets general store here of all home on the Green Bay Packers are\nTwenty dollars GM's\nTribute without a king size mattress in bars brain to save a hundred and eighty dollars in tax religious employee free beauty arrest and suey posh repeating mattresses are already priced way you'll save even more than three next day delivery but wonder if I'm not a left handed world banjo fan\nNorthern gimmicks other mattress store you fail for everyone know coupon require no need to ask for\nDetails because there's nobody in our stores so why not call it the instance savings event because ... rugby players named John the sale is so much more fun now through October ... Mansour a vocation or shop online at ... dot com employee fried guaranteed\nFor re plumbing kitchen bass complete source for all your money and\n\nHe went by phone doesn't mean a dead iPhone anymore with the iPhone tennis tennis max that its doors friday apple promises something more these days models that can resist accidental spills of liquid from busy soda to bubbly alcoholic beverages USA Today personal technology\nDo what you do\nDrop that I found a cat\nInto a bucket or both actually I guess a picture of the various like what we wanted to see if we can get the iPhone a drunk with beer and we have a bubbly wine and coffee and and and Coca Cola\nAnd guess what I work for the phone continue to work after each each fail what what did you find that there were any kind of limit to that's\nNot really I mean I mean technically there are limits I mean you know there's something called ... which is basically a standard which which basically means that the phone that meet that standard can be submerged in freshwater for up to two meters for up to half hour\nNow you know we didn't keep the iPhone and the coke for example the beer for more than a couple of minutes really not even that I'm so in that sense I guess\nYou know think about it and real world terms but if you are sitting on your desk and Easter coffee on it you know what are you going to do even to dry it off immediately and that's what you're supposed to do by the way it's not like he wanted to\nLinger and apple even cautions that if in fact this happened to the spill something on it you should try it immediately and certainly dry before you charge it up\nFor speaking with big at USA Today he drowned the iPhone and a bunch of liquid to see how it would hold up it's an important distinction to make because water resistant does not mean waterproof\nIt sort of like water running downhill encountered a barrier to try to find a way around it and and we hear happening now some of the risky types of loans have been banks will make like ... companies [noise] those are being made by other companies like an investment banks are private equity funds [laughter]\nSo you some sense you'll have risk out there is just informed that we're not used to and we can't have a lot of confidence about whether the system will be safer as a result\n... chief economics commentator at the wall Street Journal reminder by the way we can connect on social media you can find us on Facebook you can follow us on Twitter with the user name at this morning show some cynicism and sarcasm and you think you can handle it\nYou can follow me directly on Twitter with a user name at Gordon Deal twenty minutes now in front of the hour palm this morning Americas first news [noise]\nStaples knows very business every fingers or\nYou can put off until tomorrow what you need to do now you don't need to prince sometimes you have to be able to reject any time [noise] which is why it's Naples your income donor is always going on and always ... during staples sprinting event prices are reasonable\nRight now is getting twenty five dollars off any do they treat her which is good because right now is when you're making restrictions met my store socio staples ...\nPretty tales capital one is building a better bank one that feels an ax nothing like a typical bank it's wider reimagining banking and building something completely different\nThey offer accounts with no fees are minimum they also offer one of the best savings rates in America and you can open the capital one account from anywhere in five minutes capital one this is banking re imagined open an account today inexperienced banking re imagined for yourself\nCapital one what's in your wallet capital one in a\nSmall that you're making your passion your hours your reputation all ... partnership even\nWorkout melody in fact it you'll get a ... and one on one partnership to help your business ground\nWith a reliable down the basement and chemical and contractors you can focus on what matters now getting down\nBy down to the current events [noise] having having I doubt\nWhen a state ranks among the top ten in the country for major new and expanded facilities that's pure growth\nWhen it tops for four straight years that's pure Michigan long known as a world leader in the automotive industry Michigan is also a leader in advanced manufacturing cyber security agribusiness an aerospace\nInfect CNBC rates Michigan and the most improve state for business to learn more visit Michigan business dot org\nHi this is Doug Russell kind of walk dental care is Dr James Michael's as my dad\nRecapping the week before and looking ahead to next [noise]\nThat game plan supplied from a Packers head coach Mike mccarthy shall we run for re route go every Thursday morning at six twenty five hundred Wisconsin's morning news with Gmail or what's good morning ... sponsored by a wiccan contractors apply have said they were like models store we're all home of green\nBay Packers Nineteen twenty dollars LDC um [noise]\nThis gene so it's time to go to a kind of walk dental care for my check up and cleaning if you're like me I used to be nervous about going to the dentist but not anymore after Michael's understand your apprehension that's why you are their first concern during any dental procedure\nWhether you're there for a simple cleaning an exam or something as complex as a root canal or if you need implants you can rest easy knowing that Dr Michaels in his great staff will make you as comfortable as you can be\nKind of Milwaukee dental care affordable quality dentistry is no longer a dream it's the reality\nDr Michael staff can help you with a no interest payment plan ... dental care and Dr Michael ... is the dentist for anyone who's ever been afraid of dentistry you like me you know it's time to go to the dentist so don't wait go to Mike guy Dr James Michael's and I'm kinda more central care\nCalled the friendly and caring staff that I'm kind of walk capital here today and make an appointment before the snow lies\n[noise]\nMakes for being with us is broken into Monday some wish it were September thirty first as it is not new does not come October beyond the headlines now this morning's might gather this year with a look at some of the other stories are we talking about this morning it's\nMorning well there was more on the line them pride parade chargers fan and a forty niners fan during yesterday's NFL actually and it was a winner take all for the right to their unborn suns fan do any twenty nine twenty seven victory by the chargers means that the son of salt and lives that Gomez of Compton, California will be brought into the world and blue and gold\nAccording to ESPN this is all part of an elaborate gender revealed for the couple's baby yesterday morning was that posted a picture to Instagram with her innate chargers Jersey and saw and he's forty niners gear along with a sign which read we have a lot riding on his game future fan of question mark\nThe board then tease the impending arrival their son who was due march twenty six full disclosure this deal was worked out a couple of weeks ago before forty niners quarterback Jimmy ... below suffered a season ending injury but dad kept the vet anyway the forty niners jumped out to a fourteen nothing lead giving saw some confidence but the chargers none of the scored Seventeen and a half\nAnd held on to win you know at least the forty niners have some trophies yes\nThe chargers not so much and not really\nNot at all yeah I mean here's what I Know you can try all you want to sort of ... your children and to fight you don't hear from you being fans of the tea do you want them the bands up they're just going to do whatever they want any right\nI mean I Know a die hard I mean die hard eagles fan who's a who's kid as a giants fan and he and he's he's really good about if you take some the giants game you know he's he's do about it that way but no matter what you do no matter what kind of stuff you're hanging up in your house they're going to do what they're going to do anyway my\nDad used to bring me to a jets game is when I was little because he had season tickets yeah there was a period where hanging out with different friends at one point I like the Vikings then\nI happened to acquire a cult helmet you know so I thought that colds who are cool I don't know I think I like the raiders for periods up but I just came back to the jets came back to the jets that winning tradition as we ... we are just so high [laughter]\nYeah yeah so it's magnetism there and here's a story that's likely to make Gordon Deal take notice said Pennsylvania man I Love Chinese food may have recently won ... million\nName Ronnie Martin drive to New Jersey every day for working regularly stops at a gas station on the way to make a lottery tickets\nOn the evening of july's massive five hundred and forty three million dollar jackpot drawing Ronnie bought three mega millions ticket hand picking numbers that were on the slip of paper and a fortune cookie he opened ... years ago according to lottery officials running really like those lucky numbers and has been sticking with them but\nHadn't won any big money like this Romney and his wife surely say they'll use the prize money to pay up their house and bills before\nPutting the rest toward their savings billion dollars playing lucky numbers meant that's unbelievable now of course we know that you know you're a big fan of his food even have to be more than a few fortune cookies probably sitting in a drawer and your house right now so it it\nIs I I don't know I don't eat the fortune cookie zone\nI should just back off on the fortune ... many millions of dollars have you lost out on by people around your fortune ... either way you think this guy had chicken made fun of my ... perhaps that I'm ripping off the page from his playbook you worry that right now I just need more investigation\nBegging my Thirteen minutes in front of the hour dawn this morning Americas first news [noise]\nThere's nothing small about your your passion your hours your reputation all huge\nPartnership even\nWith the technology advisors you'll get the ... and one on one partnership to help your business ground because with a reliable down PCs would end up going processors you can focus on what matters most getting done\nA seventh heaven by down the cars and invited today the eight seven seven I doubt\nDidn't clue season one long green sleeves I can make a world of difference so you can protect yourself and so you're close talking coworkers how\nFiving neighbors two month old and he's like Walgreens especially three and pharmacists provided over sixty million police onto the thousands and for your flu shot today with a zero dollars would last discern because protecting the world starts with protecting your plug dreams Trump is nice you know one\nSubject to availability stages health related restrictions may apply\nSean Mercury's warning hard while you are we know you don't have time to keep up with the news of the day while you're at work we've got you covered on your way home\nWhich guns in the afternoon news with John Mark your news radio WGM Jay you've hurt or up to them in a traffic object now how many of them happened to be ... traveled all the\nCallers on the WGM Jay ... for one for two or three eighty one hundred I Want to report an accident thanks for calling what's your name breaking news traffic and whether he was radio WGM Jay there\nSome scenes\nSingle\nYou ain't cleaning out your gutters wish you had guards on your daughter's just said you paint Boehner's\nIn the ... dream store ... thousands of both parties and supplies just about everything you ever need easier vote up and running\nWhether it's common or something you might be discontinued you can bet on Saturday So don't be surprised when we had just where you need I Need the oil and voters and they know exactly where to go Kendall or Marines fifty seventh and Ryan road and frankly\nBoehner's\nMarine dot com Boehner's\nSome ... so we call them a huge part of our inventory stay\nIndoors here from Kendall marine with thousands of hearts and supplies that right here in our store you won't have to look elsewhere if you needed chances are we getting along with expert advice to get your job done right hey voters and then now in LA exactly where to go Kendall or Marines did these other than ...\nMarine dot com if you're buying and treating advertising your small business but you're not sure how to make it work then I Want you know we tend to agree to your TV advertising worked for you\nBoth a very powerful media in both can be affordable we have a long ... long term clients will ...\n... you have an interest in increasing the chances of your small businesses advertising who enters the dash meant dot com contact on button send you a quick email and I'll call you in short order that's Anderson dash ... dot com we help small business advertisers get better results [noise]\nNowadays you never know when you need some cash\nWhen you make a trip to the ATM\nYou don't want to be analyzed for it and how we get [noise]\nThat's why we created in total access checking with total access you can you ATM nationwide and you won't be shot for it\nWhether you're eating out downtown came ...\nYou always have access to your money when you need it without the ... ... ... us slashed ... number FDIC ...\n\nThat was his first official Lambda Legal Jimmy grandma\nWelcome to Monday morning quarterback just felt Coney of joining me on the phone we are presented by ... hotel because you know if you went away and you have a question or comment for Jeff or myself for one for seven nine nine west ...\nMorgan's talking tucked science so just if I'm going to pick a driver the game's only to drive I'm going to go to a gym in ... grams driving the first quarter because it gets\nJimmy Graham in the end zone something that I think hackers fans have been waiting for\nSince they announced that uh that pick up what do you think\nNow that was that was you know at that point you were about ten minutes into the game and you know you're still kind of feeling it out here but I think you've got to ... even then that you have an opportunity to to start building something here I go with the the drive we were talking about in the last segment\nThe eighty three hour drive is the longest scoring drive of the year so far for the Packers and um you know Aaron Jones and\nTo get back at us and its presence I meant you had fifty out of the eighty three yards on that drive and and I wasn't all running and he did have a Seventeen year old reception on that Dr as well but yeah the boat touchdown drives were were solid um you know no no question about that unfortunately um it was it was field goals and punched and then turn over the rest of the way for the Packers\nSo let's talk about the often so we haven't seen that uh has struggled Aaron Rodgers talked about it after the game was ailing this ... you know obviously really part of the season Rogers was injured you seemed yesterday to move pretty well what's ailing that's Austin's\nNow I think I think he's still active you can't dismiss Rogers and\nAnd where he is with his mobility he definitely look much better um yesterday than than we've seen him since before the injury and and I think that's that's going to help but\nUm I I just think it's this is a team that that just can't get into a flow they can't get into a rhythm and I just think it's a number of things that you know you talk about Jimmy Graham nearly three reception so for the entire year and he's not just an end zone guy and I'm just a red zone guy\nHe's the guy that you should be able to use all over the field I'm not having rental car but I think just specifically for yesterday probably hurt this team or a little bit and you know going back to a week three called didn't play particularly well but he was getting open\nAnd obviously you want your full complement of wide receivers as often as possible but you know when you look at it I mean third downs they were eleven of Nineteen so you know it's not like they weren't having problems picking up your niche and sustaining drive they just don't seem to have\nReally the kind of urgency that you were hoping for when they get inside and opponents you know forty yard line or so and to me I thought it real telling sign was you know end of the first half ... throws an interception the Packers turn it into a field goal\nAnd then they get the ball to start the second half and you think okay this is this is old school here this is Aaron Rodgers edits that you know getting a point on the board at the end of the first African and getting a touchdown to open up the second half you get it you know ten point swing or maybe even a fourteen point swing\nAnd now you feel like you're really in control but the only got a field goal to open up a the third quarter so you know yeah OK Nineteen or nothing at that point in Buffalo it was pretty much a one dimensional team\nA offensively so again you felt like okay this is you know going to lead the victory by against buffalo you can get away with it against some of the better team the Packers going to be facing especially after the by week or they're going to have to get a lot sharper I think there's a lot of it it just finishing drive and they just haven't been able to do that\nLet's get Mike from Chicago's taking joining us on Monday morning quarterback what do you think might\nOh yeah I still are still very disappointed in the football team I think are very ... and I think at this point in time they have in your head coach Mike mccarthy I'm the coaching staff and I think\nThe shut up like defects yesterday it was more of a byproduct of the buffalo off so having a look at quarterback and you're really didn't know where you have a grasp on the handle on their office and he ... says his comments he really found that really distraught and um\nI think it's a bad side because we're all going for it I didn't have to go without going to qualify for the playoffs and I will feel outweigh and\nAs far as he is a great player ... ... but at this point in time or Jeff since he got the best quarterback in the way I can name for quarterbacks at this time will now that are by her young and and that doesn't bode well for the Packers are really truly dogs I'm\nSurely slowly so quiet and use what ball team I really enjoy 'em and I recall years the season for the last week but I don't expect much from this came I hate their little football team and they'll let me just the collapse it will not qualify for the playoffs too short guy\nAll right well thanks for the call Michael Michael little negative on on the phone line we last year for a second here are going to have two of them we've got to just yes I'm here\nAre you how much of that you heard he he wasn't a calling my calling from Chicago was not an armored with DVD player Aaron Rodgers a he said he could probably name for black quarterbacks and you know so we're probably playing at a higher level which is probably true I mean just look so to Chicago a ... you had done what six touchdown passes yesterday\nYeah that was that was referred to watch a you know I I I don't think he's wrong um you know again this is a different Aaron Rodgers and what we're seeing it every time you spent off the rhythm has been off the flow or has been off and again you know you can get away with that with it seemed like buffalo but\nWhen you start looking at the heavyweight that you have on the schedule to think like the rams hatred for the a lot of off yesterday\nI wouldn't count the Viking era despite what we've seen here the last couple of weeks um you're going to need the events and be solid obviously but but I couldn't either\nThe finish off your eyes and you know you can beat buffalo with field goal but rams hatred fighting falcons things like that you can't beat them with the Hubble he'd score top staff\nJumped on Coney adjoining on Monday morning quarterback present on my part of one of the hotel casino let's talk about the uh the ... the bears yesterday actually rolled over Tampa Bay ... fans were looking for a some truth to this quarterback was worse was high draft pick yesterday I seem to play out pretty well for him\n[laughter] yeah I did and I you know look I think it's it's gonna be a work in progress I mean for this coming out of college is pretty raw or didn't have a lot of experience but everybody knew how how is he is going to be so we're probably going to take some time to do\nMy thing with with the bears and watching them for the first two weeks of the season was obviously they avid defensively\nBut to me the big question was going to be the quarterback play and ... and you know is he a guy who can make the money throws you know can he do the things in the fourth quarter that there'll be elite quarterbacks can do and and I didn't really see it from him\nOr in their wins against Seattle in Arizona and I didn't see that game but obviously you just take a look at the box store you know he had five ... something like two hundred and eighty nine yards in the first half um so you know obviously he had a huge scanned against Tampa Bay maybe that says a little bit about the bucket here still everybody felt well they got that magic\nYou know while they're putting up a bunch of all kinds of the first couple of weeks of the season but I think it's going to be interesting when the bears faces some of the same heavyweight for the actors have to face\nOut as Mr ... performed because her as much as you want to talk about ... you know having the impact player like ... the fact of the matter is and this kind of fell you have to have a quarterback and you have to have a good quarterback but when football games I think Mr ... either I don't know if they're just yet but\nYou know at least in the early going you have to give some credit to Chicago they play some good football\nNearly two years of experience my dad Jim allowing has taught my cousin mark everything he knows it's cheapest don't so much expertise to mark it my wife in New York to compete against the furniture finishers in the country and you\nKnow so if you're looking for the finest your furniture finishing an heirloom restoration by golly it's melancholy Malawi furniture finishing and repair everywhere quality counts and you out A L y finishing dot com\nYou can find a great deal from a mile around here the term great deal with them and they know it really does I men's women and children climbing joins furniture house where you ... bucks gains in more\nCan you hear something now you'll find it's like it's pretty nasty they think in a conference joined highly one hundred and lightning Greenfield and twenty Lincoln in Milwaukee\nSort of really careful here so it only got one more time\nOn seven roller ... does pretty darn good\nDay to go on the jobs are tight budgetary fondue gr has the calls drawing a lot of [noise]\n\nWalk job or happens here he was ready O W n J don't walk\nFifty two degrees cloudy with rain could see nearly an inch of rain and high of sixty today more rain again tonight from the double duty object breaking news center\nI'm Eric bills data busy morning at the train station and on the interstate is brewers fans flock to Chicago for game one sixty three this is for the ... fans skipping out on work they've got\nBrewers fever\nCough again one sixty three stars in just a couple of hours first pitch around noon and the people are confident filtered yeah they're going to have done the cubs outfielder Christian yell at says the team in braces going into hostile territory like at Wrigley anytime we we play the cubs as\nA as a hostile environment especially in Wrigley Field and to me all fun like I said we're looking forward to it and we'll see how it all plays out\nMe while this is considered a regular season game which means yell at you can continue to beef up his stats for his MVP season including his quest for the triple crown he needs one on running at least to RPI is to make that happen\nAnd then there is the forecasts the game at Wrigley couldn't be sandwiched between two thunder storm storm the barbecue relatives just\nStart off twelve o five sixty three down in Chicago with mostly cloudy skies east southeast certainly when around five to ten it will be dry and let's just cross our fingers per no extra innings because by about five six o'clock\nWill be watching us pretty strong cold front sweep across the area and that's and bring a good chance for showers and thunder storms so I think by about four or five o'clock Seventy five degrees in Chicago and again with storm is moving in from the ...\nThis is a new one sixty three winner gets to host the LDS starting Thursday loser plays tomorrow are covered starts at eleven o'clock ... live in Chicago now Milwaukee using unfamiliar with playing a tie breaker for baseball\nYear is Nineteen fifty nine and the Milwaukee Braves finished with an identical record as the Los Angeles Dodgers in the national league a best of three series was needed to determine who would play in the world series the Braves may have been in the past to fall classics but the Dodgers took ... county stadium three to two\n... two at Dodger Stadium six to find than twelve innings\nFor Milwaukee it was the last time they were in playoff contention until the brewers made their first runs in the early eighties let's emailed her W TMZ new\nPresident Trump will make a statement about a revamped North American free trade deal this morning he'll do it one hour from now the deal between the U.S Mexico and Canada came together late Sunday just before the midnight deadline imposed by the United states\nThis new record will be called the United states Mexico Canada agreement it replaces the twenty four year old north American free trade agreement here do not work from Kimberly Clark after their self imposed deadline from hearing from the state regarding a tax incentive package to keep the\nPaper planted talks crossing open deadline pass yesterday with no action state assembly majority leader gyms panicky says his biggest concern is if the plant closes there's a ripple effect that would go all across was go somewhere\nSuppliers the number is ... really clerks or they're living they would be a factor as well so whatever trickle down to damage to your\nGovernor Walker says he's hoping that recent talks will lead to attend to deal that can be announced\nAnd finally rescue teams are trying to dig up many victims believed to be buried in mud in the in an Asian cities that were hit by friday's earthquake and tsunami so far has killed more than eight hundred people disaster agency\nSays conditions in one neighborhood of publicity are particularly bad because the quake costs ... ... it caused a liquid ... liquid faction excuse me which occurred when Lucy water filled soil near the surface loses it strengthened collapses into the ground more for maybe ...\nHerring is a desperate search and rescue operation now underway but there are a growing fifth of the death toll will go ever we seem harrowing images of this massive wall of water surging hundreds of miles an hour ripping into this large Indonesian island\nWishing people scrambling for their lives and from the sheer scale of destruction it's clear after home life after life is being destroyed\nSports traffic and whether next W teams are new time now for [noise]\nWhether he's on my way off [noise]\nWGM hey\nJohn work here here if you want safer softer water throughout your home you needed your home\nRely on\nThis was calm face when they leave information about siting I called sky for crying over Jay and be construction provider of high quality exterior home improvement products and services since Nineteen fifty eight\nI'm Scott climb if you're tired of painting or you're citing as beyond repair it may be time to look at the advantages of a new study system additional inflation along with type ... patients with some can significantly improve your homes energy efficiency for protecting them from water and air infiltration\nWe offer a radio citing products polished all by GM be certified employees which will provide decades of performance and beauty\nOr complementary citing evaluation call Scott ... for three seven zero five three seven or visit Jay and be construction dot\nMom\nRely on the hands of the [noise] [noise]\nAnd you're on much down the ... or a classic green and go to the right time\nAnd change now when I said I Can't have that are Thirteen points\nFor four dollars cause I like many eight ounce package Ninety nine county meat you eat the gate a twenty four on Fridays she for five\nTo have you seen my lucky shirts the one you where every game day I needed to fill up the century foods dot com entry forms of ally to land will give away chances to an autographed football ZZ Packer hall of fame tickets for the green and go ... tickets for for to see Green Bay Packer land on this\nYou almost want to sell the luck out of a planet\nWasn't you're lucky socks\nBush is necessary full details at ... dot com every season there's always a reason to shop central\nDo one thing just as the cubs hold served by beating the cardinals tend to five both teams finished the regular season Ninety five and sixty seven that forces one game playoff today at Wrigley Field our coverage starts at eleven AM first pitch on WGM Jay and the associated ... radio network is set for twelve o five\nFrom football the Packers bounce back last week's loss and Washington linking the Buffalo Bills twenty two to nothing ... sealed Aaron Rodgers twenty two for forty for two hundred Ninety eight yards one touch down in one interception Packers will play the lines this coming Sunday duck Russell WGM tasteful\nNinety four north town are going to get a little bit more complicated we had an ad can't write about at the beginning of the national avenue off ramp\nThe right wing it blocked that ramp down the land that goes into that ramp so you need to move over to your left to get around that give them plenty of room to work with because there are some injuries involved and we are going to have mercy cruise pulling up on this thing will stay on the plane now downtown is going to think about twelve minutes that is an extra five\nForty three around here relative to Marquette Eighteen it that is an extra eight till they had the ... east on Ninety four Fifteen minutes to make it on something to do in a downtown\nAnd in an extra eight minutes [noise] getting off PM can't tell you why dot com\nBoom Jay five eight\nFour cats showers in a good chance for afternoon storms mainly between four and ten pm stomach could bring heavy rain falling additional happening to an inch of rain this day with a high of ...\nHours racked up overnight then ... on Tuesday Morning sprinkle then mostly cloudy and the highest sixty killed Wednesday mostly cloudy windy warmer and say you was showers and storms like Leah Hi of Seventy eight Thursday we had a cold front will be partly cloudy breathing cooler down to sixty three and products\nThat he wished showers and storms again in the highest peak for I Need and I'll give you rent kept some ... what happened to see the ...\nMore detail the interactive Catholic Mass right now like W ... dot com and other WGM Jane mobile apps W ... time Nineteen\n[noise]\nThese pretty with you on this Monday nine Eighteen we're joined by James winter soon as we are every Monday morning James\nIt wouldn't be talked about the Kavanaugh hearing Christine Blasey Ford took place last week the FBI investigation shifting it back to Wisconsin over the weekend the governor has said something I think he needed to say just to assure those voters that this will be it into I think highlight how important this election is\nFor the future leadership and direction of the state you announced over the weekend is with his last run for governor your thoughts on that\nAnd where that race stands right now\n[noise] well it it's not a new because Walker said several times in the past but he would only run for one more term um\nAnd to the effect on your hands on the race that seems to be some Walker for the out there that\nThat people are starting to notice that um people are just tired of of the battles in the fighting and merits and the irony is Tony gets elected it's just going to get worse not better\nUm but where I see the race right now is I think the governor and said that he's slightly behind him\nAnd I think that's realistic to say right now that he's the underdog going into this\nAnd he needs to figure out a way to energize those Republicans\nAnd get those independents back I mean the problem with Governor Walker is that so many people are already here are locked in Burma opinion of them but there's very little margin the play where if you're dealing with a very small sort of\nOdors that he's trying to appeal to this\nPoint is where do you think the biggest issue is with with the independence to who I have to decide between ... and Walker what's the biggest issue\n[noise] well I think the biggest issue is is that the rhetoric over the years about flashing education and education has been card I mean we're seeing there and in different polls I mean different studies that people who actually believe that we're spending when I started the education that we're not spending enough on education\nAnd I think that that's one of the factors that are certainly a\nPlace to the uh suburban mom the college educated women in the in the suburbs so what are the swing lowers the phrase a there's a you know just the general issue of security and ...\nAnd all this and then of course the\nThe beam of their lack the roads and things like that\nUh people certainly believe that we're just not spending enough on the roads I'm hearing Janet's told me that that they're hearing that after the doors away just shake their heads and say you know who have have you seen all the construction cones and everything yeah we're we're spending money on the roads believe it or not um\nAnd so all those factors the just general prying too it was only so long that a public figure can can remain in the public eye before you just get bad ...\nRemember that you know you just him after the after a while or I can hear the beaches one word on and are there happens to politicians to\nJames wages and joining me as he does every Monday morning I'll give you the last the last uh hit here while the weekend for conservatives the obviously have a cabinet FBI investigation what else should consider it to be looking for this week\nWell one thing that ... that conservatives should be looking for is this there are so far to Amy boggling has been very effective caring or any uh attacked by ... beer\nHopefully the the eating wind funded group ... will come in on the lives be happening start really campaigning in Wisconsin otherwise pretty soon here is just going to become too distant for a leader makeup backgrounds of Tammy Baldwin\nOne of the things I noticed about both Uber's ads and the ... they they very rarely speak in their own ads and it and I think this is something is going to be highlighted during the debates that are coming up this month is their inability I think to think on their feet if the the moderators ask the right questions\nAnd I think they've done and I'll I'll give them credit they've done an effective job of of taking over the airwaves with their with their election ads I think it's gonna be tough for\nA both Governor Walker and the other ... states there'll be a booth rent to kind of fight back against that they have the money but so far I think\nThey've been ineffective in the ads that they run he joins me every Monday morning James witnessed an editor right Wisconsin how can folks find out more\nThey can visit right Wisconsin dot com\nAlready joined the cubs brewers games bring home a when James\nPower to try\nTo change the way to sort of course joins me every Monday morning it's a it's a big day for brewers fans are going to a lot of brewers coverage throughout\nOur show today as well we got a great piece that they'll send it on on Bob euchre that you heard a little bit earlier today we're going to play that again for you will jump in with Greg Matt sick\nAlso the president is scheduled to speak in the ten o'clock hour this morning about the new deal between United States Canada and Mexico called the U. S. MCA or what that might mean for the future of training for those critics of the president's how 'bout that he got it done he said he was going to do and he got it done\nFor all those folks that don't like the president's carved out a better deal on trade you have to give them some credit that's next right here in ...\nWisconsin changing seasons than the fact that\nWe're the lady family and do it yourself bathroom center near state fair on sixty second and green power beautiful shower doors are now covered with a ... type coating the soap and water from showering just sheets right off it leaves a glass nice and clean for you remember a slogan\nI did it myself to do it yourself\nThe awesome resource it's your place a little late for meetings conferences and retreat spring elegant meeting space ... TV service station sweet\nCombination a spirit of cooking school many other premier amenities plus one group activities in professional teams all the programs there ten thousand square foot grandma bell ballroom brings the total functions face to thirty thousand square feet and with our seasons and experienced staff the sufferings delivers a successful meeting time after time\nCentrally located just an hour from Milwaukee in Green Bay and not even a tremendous of the U.S up resort most beautiful five hundred people privately run on the shores of el ... family reunion retreat meeting conference or convention let their dedicated staff and the only plant a memorable event at one of the mid west premier meeting places in the south resort in\nThe combinations that activities they won the space to support you need is good to do business as your placed on the lake\nCall and ask me incentives and more and more than ... meetings dot com\nThat's tough meetings dot com\nYou can get it\nWay all the way\nThe NFL says the reason was on the line at the Ninety four rivalry Caesar Milwaukee Brewers traveled to Wrigley Field for a winner take all matched up later today ... we're live from the north side of Chicago starting at eleven am this morning Greg magical lead us off [noise] lots of our\nCoverage will have throughout the show today as well want us to just a couple of minutes talking about this uh this trade deal the president scheduled to speak to about a after ten o'clock hour United States and Canada now agreeing to some terms for a deal that was also about Mexico and and if you remember\nThe north American free trade agreements or have something that the president has wanted to revamp since the campaign\nSo just hours before the deadline over the weekend the United states and Canada agreed to do allow us farmers and then Wisconsin farmers including that are not mix greater access to Canada dairy markets\nAnd an address these are just these concerns about this a potential terrorists for us automobiles some both countries now states Canada and also adding in Mexico that earlier agreement that was done a couple of weeks ago\nThey have a new agreements will besides the United states Mexico Canada agreement the the president using the U. S. M. C. uh\nInitials to a brand this thing here is what the us trade representative Robert Lighthizer said it will strengthen the middle class and create good well paying jobs and new opportunities for nearly half a billion people who called North America home\nAs I said the president ... praise the agreement early this morning it was a great deal for all three countries that would expand markets both for farmers and manufacture as you said on Twitter\nUs MCA is a historic transaction\nAnd I said all along although he's unconventional and how he does things getting this promise and that's what it was made in the campaign made throughout his early tenure as president is something that um I think you have to give them credit for\nAnd boy if you're a marine you got to be happy about the new name of that the u._s. MCA\nIs good news is good news for the country is good news for farmers in Wisconsin\nAdditional markets opening reopening that markets to our dairy products and credit all the folks who worked on this and at some points although it's much easier said than done and also on us for the next half hour talking about why\nEmotional she held it together I Can't even imagine the pressure that woman with feeling that in front of the critics that I hear from when I hear from a lot every day she has a right to say these things\nBut judge Brett Kavanaugh also has a right to defend themselves we can we can argue about the way that he did it and then the recent a spate of columns on the just the overlooking\nSeem of of what that sounded like and and what it looked like is that she overreacted she was just perfect so I asked a question for one for seven nine nine one six twenty how would you act if someone\nChallenged you one that you rapes somebody even some of the extreme allegations he was involved in a rape gang and again this is a justice who has led an example easily and simple re life since\nThat time\nWith no real evidence that anything happened let's go to Rick in Franklin you're on WGM taken morning Rick\nGoing on you know and when he um which I think you how they're going to be a great judge or if you get for I guess um the thing about having sex in my school and college I that bothers me I just don't believe that uh it was true blue for all out\nDo you think that he was lying about what he said uh in his relationship with Christine Blasey Ford if even had one\n[noise] um\nYeah I don't know\nThanks for the call Rick I mean it's really hard to ascertain facts so many years later now the FBI's is of course during a destination and and I said this would happen I treated us out last week the reality of the situation on the ground here is\nOr in Washington DC\nDemocrats Democratic senators on that committee Judiciary Committee who are advise and consent determinations will will decide where this goes and Republicans have the votes\n\nThere requesting an FBI investigation for reasons one way to they say\nThey want to get to the bottom of this I Want to play something for you this is true\nOf the members of the Judiciary Committee I'm gonna play Lindsey Graham first and then after the break down and play Mazie Hirono as both senators one from Caroline and one from Hawaii and then I'm going to ask you what you think about what they said 'cause I think it's it's something as up in a really clear way\nWhat Democrats and Republicans are saying about this the first Lindsey Graham before we go to the break\nIf this was a democratic nominee and had to change or came to Lindsey Graham's office and somebody now has recommended a conservative activists lawyer if anything they need a lawyer\nWhy don't you tell the committee about it that I did what was done here had the ball disclose it after the fact I Would be destroyed [noise]\nRyan Grim who first wrote about the letter says that it did not come from dying find times office [noise]\nI don't know all I can tell you is it came from somebody with a political motive\nThere were three people who had the letter things on fire size office the congresswoman from California\nOffice recommend the cats as a lawyer why did this for not know that the committee was willing to go to California\nTo release the anonymous letter them into too many by a Cory Gardner a work on a bill wholesale full scale investigation of what I think when a despicable process to deter it from happening at the end do you accept the guy and find science denial she says that I Do\nTo her ... her she says that are ... somebody in her office let's put it this way\nThat this was a democratic nominee and had to change or tank to Lindsey Graham's office in somebody in my office recommended a conservative activists warrior if you think they need a lawyer\nWhy don't you tell the committee about it that I did vote was done here had the ball disclose it after the fact I Would be destroyed\nA Senator Lindsey Graham senator from South Carolina after the break him in a play you the other side Mazie Hirono senator from Hawaii and how she interprets some of the comments of Senator Lindsey Graham that's all coming up next right here in WGM June [noise]\nIf I don't watch as\nMuch for the average here selling new GM\nDid you know that there's a hidden time bomb and your portfolio there\nYou're a home loan made\nJay and\nThis is from the south when they need information about siting I call Scott crime older Jay and be construction provider of high quality exterior home improvement products and services since Nineteen fifty eight\nI'm Scott climb if you're tired of painting or\nYou're citing is beyond repair it may be time to look at the advantages of a new citing system\nAdditional inflation along with type ... system can significantly improve your homes energy efficiency while protecting them from water and air infiltration we offer a righty aside he products fallen stalled like Jane be certified employees which will provide decades of performance and beauty\nFor complimentary citing evaluation call Scott at ... for three seven zero five three seven four visit Jay and be construction dot com\nMom\nWhen you can be [noise]\nThe proof is in the pudding advertise that hire a stick with us for years and years\nBecause they trust us because we always promptly respond the customer needs and because the bottom line we get results quota ... dot coms our clients page to see we trust us and check out a long list of real advertising success then hit the contact us button you know me and I'll call you on short or\nBecause it's time we grew your business ... dot com\nBusiness owners are faced with a million decision some or what kind of pencils and some are harder now I get kind of ... no matter what the question ultimately did your phone and they found things went from anything that the banking should be another thing you have to worry about\nWe provide support to make those decisions\nWere proud to be with a tough thing to learn more at ... dot us like to eat these last Monday\nThe roads are sober go through a winner take all brewers cubs showdown at Wrigley Field Greg ... poly or live in the north side of Chicago all day and Bobby euchre is on the call board game one six three our coverage kicks off and eleven I Am this morning ... again you can't be too excited this is like an amazing day\nFor brewers fans and cubs fans to be honest and\nAll the marbles for the ... of course this was going to do or die game you get to move forward in a different way if you lose but for the brewers is the chance to host that series at Miller Park and how could that be right now we're talking about Brett Kavanaugh his nomination a lot of taxes lots of callers I get as many as I can\nI'm Sally nothing will change will get us position on the Supreme Court after we do investigations from the two six to no Democrat will vote for him at the end of the week and I have Pakistan will continue they receive their investigation they were still not vote for him I've been saying this since last Thursday\nThis is all of a ... a charade they're not going to change their votes\nIt's just one of those things have postponed delays you know we'll see what the FBI comes comes out with and presents to the Senate Judiciary committee and the White House\nIf there is truly something in that investigation then of course Brett Kavanaugh should not be confirmed I think most reasonable rational people agree with that\nBut there's another piece of this that the ugliness of America right now and that's\nThe condemnation of a of a jurists was done to exemplary job in the appeals court position he served in for quite awhile\nMattress thrown aside because of the me too movement and the rush to judgment on a on a a candidate for the Supreme Court I think is not warranted let's go to Mike on the north west side you're on WGM say good morning Mike\nHey good why if you if you're if you're a alive back in the seventies and eighties had gone to high school or college parties\nIf at some part time um you know there was drinking going on if you're going to happen to touch a woman or a woman talk demand fine you're like the kind of work out all these guys are having done that and then she always buying if they have done it\nYeah I mean my ... points thanks for the call Mike I'm there is nothing uh nothing excuses\nBad behavior whether you're drunk whether you're on drugs whether you're in a under Eighteen\nNothing excuses that man does not have permission to touch a woman must she says\nNo I'm I Am old enough to Mike's points to have lived through those parties I understand the dynamic than it was a lot of alcohol involved in the parties that I went to\nSo I get that nothing excuses bad behavior though but the problem with this which ... is that there's been nothing put forward other than testimony that says this actually happened and the the ... the cooperating\nEvidence has not also not been there no matter what the FBI will sort out that's what we'll tell us where the story goes Alan from ... W teams iGEM morning Alan [noise]\nI'm On it what do you think [noise] I\nThink when you're like your character and I have a daughter that had been brutally raped\nPsychiatric help never know like I never get over there you cannot give you an accurate unless you get you know [noise]\nAfter the break moron Brett Kavanaugh the FBI investigation got some brewer stuffed as we a\nHurdle towards the broadcast time are we gonna joined Greg Matt sick from Chicago and a half but Russell jumping studio to talk to us about all that that's all coming up before at ten right here in GM's or\nDo you hate cleaning your gutters wish you had guards on your gutters just\nMentioning the printing community has a thousand for seniors and their families with the planning needed to make the right move into a senior living community appreciates devoted\nTo providing for an supporting the independent lifestyle was older adult friends probably that it seems okay ten throughout southeastern Wisconsin every campaign designed to natural comedy seniors but to provide for all their need so they can thrive\nAnd enjoying this incredible ... just like\nWellness programs state of the care restaurants have dining setting a recreation community signed\nAn activity at all I mean at the heart of everything we do to learn more about our service or to explore different communities and find them back home for you or your loved one in the ... community that term that's country communities dot com\nOr call us at two six to seven nine eight twelve twenty four please come\nJoin the conversation to six to seven nine eight twelve twenty four ... in your community not just my time in my home to\nReally tough on the air so the only thing that we got to do\nMuch to do it one more time\nOn seven role to put ourselves in that game that's pretty darn good\nDay as they go on the job on a tight budget every ... has the calls that a lot of [noise]\n\nWalk job or happens here he was radio WGM Jerry\nFifty two degrees cloudy with rain maybe even some storms could see more than ... come down a highway sixty today from the double duty I'm Jay ... new center I'm Eric filth and let's start with WGM Jay\nW. I. dot com time saver traffic forty three north bound near national avenue there's an accident there in the right lane just been there while it's crucial to clean it up and you are seen some significant delayed because of it right now from late in the downtown it's going to take you almost thirty minutes\nAnd you're seeing delays back up all the way even past south of lake right now so be prepared for that about a thirty minute trip\nFrom the Mitchell interchange all the way up to the market right now because of an accident near national avenue will give you an update on the traffic situation\nThroughout the entire grid coming up here in about five minutes that the trouble spot right now seeing delays across the grid though because of the rain and the weather today are you ready brewers fan as you nervous\nFans are confident as they head south ... one sixty three a tie breaker against the Chicago Cubs will take him down winner host the ... divisional series starting Thursday loser holds the wild card game tomorrow night manager great count\nWe got ourselves an extra game and uh that's how we're living our excited to go down there and we do\nHave the line up now for the game council going with starters released shot scene he will take the ball for the crew hose that can kind of get the start for the cubs other notes Jonathan scope will be your starter at second base traffic Sean not in the line up\nTo start the game are breweries game day coverage starts at eleven o'clock right after the news first pitches just after noon today on WGM Jay baseball tie breakers are nothing new to the sport sixteen\nOf them have been played in major league baseball since Nineteen forty six there have been some memorable moments such as the shot heard round the world in Nineteen fifty one that sent the New York giants to the world series\nThen there was Nineteen Seventy eight when the Yankees Bucky Dent home or to help defeat the red Sox when the American league east and get them on a path to a World Series when will another memorable moments or run to a championship come from today's game\nWell that's why you play them ... W. A. T. M. J. news\nHarley Davidson is partnering with Amazon and Milwaukee business journals says hardly will begin selling apparel and writing gear on the retail site\nThe move is part of the motorcycle maker strategy of reaching a new generation of writers President Trump calls it a great deal the president expected to address the country momentarily the U.S Canada and Mexico have salvaged a free trade deal to replace NAFTA\nIt was announced just before midnight last night there was a deadline imposed by the White House and CBS used corresponding polar Reed explains dismantling NAFTA was one of the president's signature campaign promise founder\nDale Canada will ease protections on a dairy market and provide greater access then was once guaranteed under the Trans Pacific partnership training which Trump withdrew from last year\nIt also makes it harder for automakers to build cars cheaply in Mexico that required a higher proportion of the park in a car to be made in areas paying minimum wage at least sixteen dollars an hour\nJammed the commander in chief expected to address the new deal from the rose garden this hour the earthquake and tsunami dual disaster in Indonesia is quickly spiraling into a humanitarian crisis more than eight hundred people were killed by the quake in subsequent tidal wave on friday\nThey weren't the death toll now could be well over one thousand ABC's gyms long individual carts\nSeven point five on the Richter scale just something odd into sort of way that a large Indonesian out and bought nine hundred miles to the north east of where I Am now hit in the closing assume ... in some places twenty feet high wiping out everything in its ways you can imagine this part of the well some of the buildings\nAre not particularly well built so that would easily washed away and on top of that the U.S quite frame buildings down we've had reports of dozens trapped on the building still\nAgain the death toll around eight hundred to eat is expected to go up sports traffic and whether next double duty introduced on penalty for [noise]\n... fighter listening of orange playoff as\nAs you can\nFind more rewarding and blamed farm employing and now you can tell you when to be cool if you could\nBuy something and then if it turns out later you didn't need it you get your money back okay not all of your money but some of it\nA little bit at least that's exactly how it works with your west men home and I we policy\nWe send you some of your money back if you don't mind look claim all year but everything is covered with one major one policy one bill and wanted to [noise] turns out even your bank account and I have a silver lining west bend the worst brings up our best to visit the silver lining dot com\nIt doesn't get more flexible than a line of credit meat ongoing working capital needs and tap into your line again and again\nBut for a wide range of seasonal business needs including working capital trade discounts receivable financing and more contact your hometown commercial lender and learn more at TC envied dot com tri city national back your hometown bank member FDIC equal housing lender\n\nIt's time it's time to read dollar reach far more than you thought possible\nTime you read message me that dramatic impact on your bottom line the results we brought our small business clients are significant and there's no reason we can't bring you the same success no matter what you write budget is so going to enter ... dot com hit the contact us by email me and I will call you a short order because it is tied\n... dot com we help small business advertisers get better results\nEleven and nothing just as the cubs hold served by beating the cardinals tend to five\nBoth teams finished the regular season Ninety five and sixty seven that forces one game playoff today at Wrigley Field the brewers will send you a leash obscene to the mountain and it was just announced about a half an hour ago or so or the content of will do the rubber for Chicago our coverage starts at eleven AM just under an hour from now first pitch\nOn WGM Jay and the associated bankers radio network is set for twelve o five also the Packers bounce back from last week's clunker against the Redskins the final four twenty two to nothing as Green Bay blanks buffalo\nComing up this coming Sunday the Packers will be added choice to play the lions that Russell WGM Jay sport\nWPN Jay how I dealt with your eye dot com times ever tried to trouble spot right now it has been forty three north ... near national avenue has been causing some significant life not crews have made a lot of\nProgress clearing that but you still going to see some delayed have not yet been made it completely right now from Leighton into downtowns about a Fifteen minute ride so about an eight minute delayed but it should get better and better if they continue to get that\nOut of it away elsewhere Ninety four in down from highway sixteen through the zoo in downtown looking good at the moment Seventeen minutes\nForty one forty five ... phone from highway cue to the zoo is Fifteen that's on timing forty three thousand found from brown dear to downtown also looking good at that moment eight twelve minute ride the court or you are seeing some delays as you head toward the state line south on north bound some typical delayed in slow down\nThrough that area especially south on right now especially when you're seven miles there in that area you might\nBe on the brakes as you may be perhaps are heading to the brewers game [noise]\nWe only station in Milwaukee staff for breaking news weather\nAnd that just on the ... highest sixty degree first\n... minutes around midnight tonight we're generally a happening two inches of rain expected I kind of ... please come through\nWill have lots of wars and have lots of ... and the rest of the show today as well before we ended up to ... from Chicago now where we're waiting for the president to speak on Iraq you're listening in on that he's\nHe is now addressing of folks have done these guarding the rose garden they're discussing the new deal with Mexico and Canada\nBut this is maybe more important than all of it put together a journey so I Want to thank you for being in a\nCongressman holding congressman row congressman new house and congressman meadows thank you all for being here we are very much appreciate it you've been very instrumental thank\nTo speak to the American people to share\nTruly historic news for our nation and indeed for the world I Want to thank\nVice president Pence for joining us this morning my great honor to announce that we have successfully completed negotiations on a brand new deal to terminate and replace NAFTA\nAndy NAFTA trade agreements with an incredible new U.S Mexico Canada agreement calls us embassy a sort of just work and [noise]\nI don't mean the name I guess that Ninety nine percent of the time we'll be hearing us MCA has a good ring to it I have long contended that NAFTA was perhaps the worst trade deal ever made\nSince NAFTA's adoption the United states racked up trade deficits totaling more than two trillion dollars and it's a much higher number then that\nWith Canada and Mexico at last vast amounts of money and lost four point one million manufacturing jobs and one in four or do jobs lost about twenty five percent of our order jobs even more than that\nThroughout the campaign I promise to renegotiate NAFTA\nAnd today we have kept that promise but for twenty five years as a civilian as a businessman I used to say how can anybody have signed a deal like NAFTA and I watched New England\nAnd so many other places where I was uh just the factories were leaving the jobs while leaving people were being fired\nSo we have negotiated this new agreement based on the principle of fairness and reciprocity\nTo me it's the most important word and Trey because we've been treated so unfairly by so many nations all over the world that we're changing that\nWould just signed a much better deal with South Korea we had a horrible horrible deal and we just signed that at the United nations and that worked out well and they're happy we're happy it's good for jobs good for a lot of things when I deal with side they said two hundred and fifty thousand jobs\nWill be given the by signing this transaction and they were right I've said it before they were right two hundred and fifty thousand jobs to South Korea not that the United states so that's changed and very much for the better and this one is a brand new deal\nThe agreement will govern nearly one point two trillion and track which makes it the biggest trade deal in the United states history I Want to congratulate us trade representative Robert Lighthizer who has worked nobody understands how hard\nNo matter when you called it was in the office or he was in somebody else's office doing the same\nThing a bottom line is there's great\nI've heard it for years I said if I ever do this I Want to get allied hired to represent us 'cause he felt the way I did and the entire team at the U.S are standing behind me and some right here in the audience I Want to thank\nYou [noise]\nFantastic group of people they love our country I also want to thank secretary minute ... secretary Ross secretary Nielsen\nSecretary produce Jared Kushner Peter Navarro and the United states ambassador to Canada Kelly craft thank you thank you [noise]\nWant to thank president and yeah\nThe act of Mexico we had a few disagreements but I really like um a lot\nI think he made like me I'm not sure but I think he's a terrific person and he'll be leaving a soon but he's really done a good job and\nWonderful wonderful person and the Mexican president elect Lopez Obrador who has given his support of this agreement and\nWe're developing a really good relationship which I think is very important for our country frankly and from Mexico\nAnd uh so they work together on this this was done by both I said look I don't want to sign an agreement and then a new president comes and they don't like it and we have difficulty ah they work very much together on it and I appreciate it from both a\nTo certainly give my highest regards to prime minister of Canada adjusted to do a lot of stories came out about adjusted and I\nHaving difficulty together do we did over the trade deal but I'll tell you it's turned out to be a very very good deal for both\nAnd a very very good deal for all three it puts us in a position that we've never been in before it's very good when you look at the world and what the world is doing and what when you look at the unfair trade practices\nThat countries are using against the United states and this is a terrific deal for all of\nThat is the president speaking at the White House on the new deal with Canada Mexico us MCA Canada Mexico agreements big news for trade gotta give them some credit that's number two of our for it\nLook it's tough to do the things you need to do if you're not getting ...\nIs your insurance company easy to deal with\nThousands of independent insurance agents rank west bend all the time when it comes to ease of doing business that's because we step up when you need us\nWith your agents knowledge and experience westerns commitments\nProviding innovative products and services we can offer policyholders the best in home auto and business insurance west bend the worst brings up our best visit the silver lining ...\nDo you have a clear advertising message that assures your potential customers would choose your business over others when they need your goods or services when you have time to nurture it so it stays interesting can you buy a media effectively and cheap enough so that your business day's top of mind\nYour business owner and we understand how busy you are and that's why we do these very things to help our clients gain market share and grow their business Anderson dash ... dot com we help small budget advertisers get better results\n[noise] Wisconsin changing seasons thing of beauty at bat\nFor that I like going to eat them high that's a stereotype and Boehner American window into our company you know you have to make give your money to the utility company all winter or make a remodeling investment now that cuts heating and cooling costs more years to come\nOut there that are still room I met one rally in Germantown I Can't do indoor cats and two the two to five five seven\nEstimates are free well if you haven't heard me say goodbye now we're darned good\nActually my dad has no qualms about saying we're the best and if you're skeptical I understand right oh you have to do is go to Malawi finishing high alert why we're great at what we do see lots of before and after photos that show off our friends at work you're looking for and then you can trust\nGolly it's Somali Somali furniture finishing it repair everywhere quality town and U L L Y finishing act um it was alright apparently he's got a little\nAs evidenced by the job description repair he'll marks on conference table you have to take care of his party a few too many drinks and I felt compelled to use the top of\nConference table as far as you expected we showed up on site and they can't look as good as you smell Ali Ali furniture finishing every every where body count and Hugh L L L Y finishing a\nSeventh street with you on this Monday as we get ready for number three of the Fort Sam went to the president on talking about the u._s. MCA that new trade agreement with Canada and Mexico\nI spent a lot of the show talking about your Brett Kavanaugh a hearing last week and the follow up and and the FBI investigation that continues this week Eric has that kind of churn through some details of the candidates past\nYes they have less than a week to complete the FBI investigation of sexual misconduct allegations against Brett Kavanaugh this after the testimony last week so where will they go well they have any time they get any real work done years for your time is from ABC one\nPossible league could be Kavanaugh's own calendars July Nineteen eighty two gathering cabinet are lifted along with a number of people forward claims were president of the night of the assault\nBut sort of direct to the FBI to focus specifically on allegations made by Ford and Ramirez it's unclear if the bureau with the permission from the president to follow up on the other part witnesses and evidence gathered\nHe doesn't hide from much\nWe can argue about transportation and I call them out on it but he's not afraid to be big and bold that's why I was I looked at it with some humor when I saw his opponents\nUber's and Barnes throwing the bold coming out there to kind of maybe neutralized some of the governors bluster or what he's done it and again measure by what's done not by what's said\nBetter tax climate in Wisconsin more companies growing\nYou mentioned the big ones horrible Foxconn other companies who said you know what even even the growth of Amazon now talking about a second and third plant potentially\nThose are ah hang your hat or so those are things that are any governor the Democrat or Republican to be happy about\nThat's why I've if you've noticed says you cover the or as we cover the the raise [noise] the Foxconn deniers the naysayers have kind of slowly slowly gone away they dilute occasionally they'll talk about it\nBut because of course what happened shovels underground building walls coming up jobs\nPotentially Thirteen thousand jobs it it it doesn't the gates what always was a kind of a silly talking point that Tony ... and some other folks on that side had been thrown around what for this governor this is a line in the sand moments\nIf you want me to continue what I've done here's November go vote\nRepublicans have a lot of reasons to vote I frankly been disappointed with the enthusiasm\nAnd the the measure of excitement about this race and these races coming up in November but that has to change\nYour being about candidates Tammy Baldwin Tony Evers Randy Bryce all have flaws or not what I Would call great motivators\nIf I Do I say that because I see the ads they run and I mentioned is the James earlier notice the ads they run and notice how little of the ad is the candidate actually speaking themselves it's other people don't testimonials are great and I and I understand the\nPower of an ad and integrate ad agency and they're they're hiring the best\nBut look to see what they say that's why the the critical pieces and and juncture in this campaign and these campaigns is the debates\nAnd if we have the moderator moderators ask the right questions listen to the responses and look for specifics not talking points are Democrats are really good at talking points there are so good\nAt a day off enroll him out year after year after year the same ones remember the tax reform package bread crumbs didn't do anything in the middle class nonpartisan reviewers of that tax reform package that that's not true so it's a false it get they'd been parlaying that out for the last year\nLook to the specifics but for the governor he's in all in last race for governor in the state of Wisconsin Governor Scott Walker we shall see\nI think it was a smart call ... draw the line in the sand tell people where you stand what this means why this is your last opportunity to vote for me if you're the governor that's a smart play that's always a good idea [noise]\nAfter the break we're going to play a piece that my radio partner bill said did on the legend himself that's coming up next right here in WTO injure\nThis is hot and we all work for the homeless the growers\nWGM Jay last year the Dow Jones industrial average was up just over ... ...\nYou\nAnd did I oh shut up\nJourney caring for aging parents caregiving tiring and it can be emotionally exhausting strain burden and get wrapped around ... lifelong\nMarriages and ... our company in your community family of carrying professional have been sending southeastern Wisconsin family since Nineteen Ninety two when your conversation turned to knock down or\nWho need help to preach in your community in living memory care professionals are ready to help you find the ... going to answer you let our family\nHave more to learn more about our our tax money for the community and find my long term for you or your loved one was a complete community dot com or call it and to take too long on twelve twenty\n\nNine oh\nWhat's the worst thing about running your own business [noise] how about workers' compensation insurance well at West bend our team of specialists will you do your needs and even recommended called the loss prevention programs that can help reduce accidents and injuries will\nIncreasing production of Roman because business owners have enough to worry about without having to worry about workers' comp\nWest bend the worst\nBrings up our best to visit the silver lining dot com\n\nEither one\nWho sets it up for me to do when he needed to Ryan Braun over beyond the feel of course for the brewers game one sixty three brewers cubs calling that game Eric will be legendary broadcaster\nBob euchre Bob euchre did you know there's there's only been one\nSeason and now we get to hear Mr baseball call playoff baseball again later this week on Thursday right now tomorrow we wanted to pay homage to Bob euchre hill forever be woven into the fabric of course the brewers baseball I caught up with many of his current and former partners who just learned more about what makes you so special\nHello again every one of her along with my breathing and Ken Somerville set to bring in game one action is jumping\nIn doubt listening to Bob [noise]\nIt just makes you feel good he believes brewers base\nBut once again the heroes Joe Block\nThanks you had the unique experience of being able to learn under both an established major league player and the hall of fame broadcaster list is Bob euchre along with Cory ...\nIs sharing a booth with him is truly one of the better jobs not just in sports but I think that one could possibly\nHave once again here's Jim Rowe undoubtedly the greatest honored my career is that I can say I was Bob Uber's longest tenure partner Thirteen Years and the brewers radio booth alongside the great Bob euchre\nHistories lend Caspar the brilliance of Bob ... can can never really be overseen this was banned you\nTake great man is someone who never reminds you of anyone else and that's certainly applies to your\nBaseball broadcaster mechanically he's got the great home run call\nAny of the signature homeless\nAnd it came from such an organic place great homerun calls\nFor you when he took over a full time calling the gains of Seventy eight and all that Susan B.\nOn opening day grand slam ...\nThinks I'm going to great\nGod and\nYell three thousand [noise]\nI was there for ... six hundred see how does the [noise] the one I went to look at the field I just got back to my right\n[noise] [noise] [noise]\nAnd then to be able to blend in the stories and the humor in between pitches\nYou don't mess around with Tony downs either I've known Tony a long time former boxer not much of a punch are pretty good dancer hears them all down low and it's doing what else can\nWe even a story about Andre the giant choking him or how Johnny\nCarson didn't believe it was a baseball player or how is TV son burned a stake in the oven and then somehow related to Domingo Santana [noise]\nCame about how his old catchers equipment was so bad and how to use to get beat up all the time\nWhen another catcher comes up and takes a full swing at you and you know he's not your power\nBeing at the park in broadcasting brewers games is simply one of the most enjoyable aspects of his life\nHis being retrieved by Prince Fielder it's or something from the upper reaches of another part slipping really major it's four or five hundred pound beach [laughter]\nHis favorite hobby unfortunately\nWas trying to find a way to make me laugh uncontrollably preferably when I'm drinking\nA soda these are the kinds of days I used to lay out and cover my body was hunting and let the ants run all over me outside of all there was stimulating [noise]\nThis is Vince Scully probably the most difficult time I have ever spent\nIs there are fewer fires but the nice homes are still get multiple offers so put yourself in the cellar shoes for a minute which offered you choose typically those that are contingent on the sale of the buyers current home get tossed\nBut that's where I can I can help out with a bridge loan so you don't have to shell before buying of course prices important but then there's the strength of the pre approval letter and the reputation of the winter\nThat's where I can is rock solid guarantee pre approval really helps real estate interest you know they can rely on an accident rock solid pre approval because we tell the seller in writing we've verified everything about not just your credit score like most banks and credit unions and then we guarantee in writing that if we can't make good on our pre approval letter will pay per view and the seller a\nThousand bucks each no other letter stands behind their pre approved buyers like actor that make your offer the best offer was a rock solid guaranteed\nPre approval from accurate that's ACC U. N. E. T. dot com they\nRetire so the only city and I got to do\nTime on seven roller put ourselves in that game that's pretty darn good\nDay jobs hold on tight budgetary von ... has the calls coming out a lot of [noise]\n\nWalk job or happens here he was radio WPN Jay\nO'clock fifty three degrees cloudy with rain maybe even some thunderstorms later on could see more than an inch of rain coming down the highway sixty from the WTO ... new center I'm Eric bills that it's been a busy morning at the train station downtown is\nBrewers bans flock to Chicago for game one sixty three some fans skipping out on work currently they've got brewers fever\nCough and the faithful are confident that taking the cubs down ... making the push across the Illinois border to make Wrigley Field Miller Park south\nBy them I don't want the train to Chicago or a hundred in the morning there were about six hundred fifty on or about Seventy five percent of them stand heading to Chicago or game on sixty three the train was quiet or most of the right now but\nThe chairs of let's go for it to be heard calling in to Union Station in Chicago Jonathan look we're WGM changing\nManager Craig council this morning on catching the perennial division winning\nCubs is harder to knock him off\nReally busy so\nIs the biggest challenges that we put ourselves in a position to accomplish\nA so this is\nYour only shot scene we'll be your starter for the crew hose that can turn to get the ball for the cubs also a lineup note Jonathan so\nWe'll be your second baseman traffic Sean not in the line of our coverage starts right after the news live from Chicago Greg Mexican ... poly in just a moment no more NAFTA now there's a new North American trade deal President Trump announced the accord with Mexico and Canada just moments ago\nOnce approved by Congress this new deal will be the most modern\nUp to date and balance trade agreement and the history of our country where the most advanced protections for workers ever develop\nThe new deal is called us and see a candidate came to the agreement a head of a midnight deadline late yesterday Harley Davidson is partnering with Amazon the Milwaukee Business Journal says Harley will begin selling apparel and writing you're on the retail side the move\nIs part of the motorcycle maker strategy and reaching the new generation of writers and the man from Milwaukee will be charged with making a false bomb threat that led to the evacuation and temporary closure of a Wal Mart in Franklin police errands ear texted his sister telling her that he had bombs strapped to his body while he was at a Wal Mart\nPolice responded in after a thorough search they were unable to locate any explosives few days later last month the returned himself into policing admitted that he never had a bomb sports traffic and what the next W team to do sound eleven up three\nCats at home [noise] by the\nLegendary Bobby is\nJammed and indeed\nKnows find the right higher takes time away from your business hiring the\nWisconsin Harley Davidson accountable walk is hosting in October fest you'd wanna miss this festival favorable featured German beer garden with all your October fest favorite be delicious freshly girl barrage prepare by the economy will walk alliance take part in the hammer slogging German and stay for live polka entertainment plus new\nThis year dress up for the best leader has an internal contests and the sign holding competition is not to be missed admission is free to make Wisconsin Harley Davidson a kind of Milwaukee or October fest that nation on Saturday October six\nBy more info and ... with\nA hammer slugging tournament time all the competition and the best leader who is in their little contest at W. I. S. H. D. dot com\nW. I. S. H. D. dot com October fest at Wisconsin Harley Davidson of Ninety four and highway sixty seven thousand accountable last Saturday over six free admission were more W. I. S. H. D. dot com [noise]\nHi this is Nick ... one of the larger independent insurance agencies in Wisconsin would you believe me if I told you I was psychic no well I bet I can guess what your current auto liability insurance limits are two hundred and fifty thousand ... per person and five hundred thousand for all bottling injury or lower\nFreaky right okay it was just a gas but this is actually true for nine percent of the people that contact us for other options and choices most consumers don't realize these coverage limits are extremely low relative to Wisconsin's wrongful death statutes\nAt the start room we take the time to learn about our customers to pinpoint limits on the line with their exposure do fall victim to the industry norms call the star group today to learn what limits are necessary for you\nAnd remember the starter promised if your premium exceeds the industry average on a renewal our team ... actively evaluates other options for you\nThis star group sta do our group dot com\nTends to be the cardinals tend to five votes clubs finish the regular season was identical records that before so one game playoff today at Wrigley Field\nOur coverage from the windy city starts at eleven AM first that you're on WGM Jay and the associated bank brewers radio network is at twelve o five also today there will be to gain one sixty three for the first time in baseball history as the Dodgers in rock he's will play for the western division crown\nTo football the Packers bounce back from last week's last of the Redskins by beating up on the Buffalo Bills twenty two to nothing Green Bay\nAnd you're on much down the ... or ... that right Tom\nNow too when the nine year has about ...\nReady to for four dollars how many eight ounce package and continues Mr potato twenty four and two for five dollars\nHey have you seen my lucky shirts the one you where every game ha ha I needed to fill out the century foods dot com Andrew formed for the light of land will give away chances to an autographed Football Hall of fame tickets or the ... tickets for Florida the Green Bay tackle Atlanta on December and I live in limbo did you check some laundry no no no no\nYou almost lost all the luck out of it\nThat it wasn't you're lucky socks\nHooper just necessary full detail the dot com every season there's always a reason to shop century\nIs asked one of the cold front sweeps through later today between about ... pm and ten pm highest sixty degrees a chance for the showers wrapped up overnight generally adding a half an inch an inch and a half of rain in our gain overnight temperatures down to fifty four\nOn your Tuesday at sprinkled just start off today than mostly cloudy highest sixty two when did they mostly cloudy windy warm and humid was showers and storms lightly I Seventy eight\nThere's maybe a nickel but partly cloudy cooler and breathing dived sixty three and friday rain returns with a gun or something to hide things equal I Need her I'll just checking recap but it's only ... WPN jak\nHeavy rain has prompted a river flood warnings for Milwaukee County this runs until Thursday right now the barometric pressure is falling to Lake Michigan water temperature is sixty two degrees in Madison fifty one Green Bay fifty five Waukesha fifty three and in Milwaukee fifty two degrees follow every\nPitch of rue October here I'm here it feels that he's radios WGM Jay [noise]\nThe hunt for Red October continues today from Chicago welcome to wheels north woods in\nWhat's called the ... bar near Wrigley Field where the brewers will take on the cubs in game one sixty three yes it is a regular season game but it certainly feels like a playoff game\nThis afternoon number I may have to go on with Matt Pauli got few till our pre game coverage begins with the network broadcast about eleven thirty first bit set for just after twelve o'clock and map the already some fans here at will north would then I see a lot of people walking by brewers fans cubs fans walking to the park\nAnd I know the Amtrak is oversold a standing room only on the Amtrak getting down so Hiawatha Service\nIt get friendly with your neighbor because it's going to be a a path full of brewer fans sort of deal but this is really what it's all about just a great atmosphere already developing it absolutely is and the fact that the the two cities are so close\nBrewers and cubs experience because it's probably not going to be a lot of people on that flight this morning from Denver to Los Angeles just to catch that game and the fact that these two cities are so close to each other this is really a special thing to be part of that for one for seven and nine\nThat maybe a month or so it seems like the common praised as well he he really had to battle is way through and he's a veteran pitcher who can do it\nBut I it it it is a big question mark and was expanded rosters you get to move on quickly if something is going right that's a plus but what do you think about him where he's at right now in the season against this one\nOf his numbers in the month of September were not bad here he had a three point eight or ... you know a lot of people get locked in on the win loss record because he was one in three in the month of September he only had one game where he gave up more than four runs and only two games right give us three or more in another game they gave up three more there was only two are grown so he's actually\nTypically he's pitched fine in the months to September but I think\nAnybody who has watched him can say\nAnd there were times middle of the season he was flat out dominance and it seems like he has backed off that a little bit in the month of September I don't know how much of that has to do in the month of September he's gone for two thirds five five four and five innings nobody in the starting rotation has really been given\nOption to go along because every single time there's a chance to maybe go for runs and go for a pinch hitter and the fifth or sixth inning council is absolutely going for that I [noise]\nI'd be lying to you if I knew what was going to happen when you least sassy today I Am I have absolutely no clue he's been trained in a little bit in the wrong direction but the numbers are not really that\nBad well and and again with expanded robbed as you get to move on quickly if you should do you feel the need to now we were talking about this on the ride down and you know kind of curious to see how they would play it would they do a damn Jennings dark because we have Daniel Murphy is the lead up here for the cubs and then go to ... to\nMy only hesitation and that was the environments are doing it away from your your your whole part in this sort of situation um [noise] I wouldn't be surprised to see something interesting like that tomorrow or I guess we'll cross that bridge when we come to it but\nThe decision to start sustained today it was all going toward encounter starting against the brewers [noise] I I feel like if you give up three runs in the freezing Jose and Tania is history will tell you that that's a challenging asking for the ...\nWhat is the magic number today I think that five or something the over under a fire can get a five runs you're looking at a whim\nMaybe four I'll go for I'll take it down at one level I mean you look at what\nCan town has done against the brewers this season it is he's only had one last he's only had one game where he hasn't played especially well this year against the brewers for and want to point one Seventy IRA and six starts and twenty\nFive start to get the rest of the baseball he was nine and ten with a four point six forty alright for whatever reason he really gets after the brewers\nDoesn't get after anybody else and from brewers fan standpoint you just got to be hoping that you know that one game that they had where they got after him a little bit uh or just figuring them out that the wind is not going to be blowing in the ... not going to be blowing out it's going be blindly from\nLeft to right so maybe that helps out a bit that the ones not blowing in but bottom line is if I was in town it goes out there and go six seven innings gives up one two maybe even three runs the brewers are going to have a really hard time winning the scan\nGot to find a way to get to a vet bullpen absolutely you got a few more phone call to get to on the other side will get you said for brewers baseball here on WGM today as a hunter borough October continues from wells northward Danny in Chicago we're back after this\nAnd you're on match you up machine operator experience are you a go getter that's exactly what in the escort team they are now hiring experience nighttime machine operators and nighttime maintenance technicians herring bonus now offered they'll come within apply today at NPR dot com that then the escort dot com\nWisconsin's best governing for replacing your homes windows is called citing unlimited\nUnlimited years ago they expanded from just citing in the windows and roofing decks and the whole lot more and became Wisconsin's best contractor for all of those things that name citing unlimited was already established trust and\nBut they do great at all of these jobs here in Wisconsin citing unlimited is the best and windows\nAnd the best that roofing and of course the best that citing\nCiting unlimited as the best that everything on the outside of your house citing unlimited as the only power windows them certified contractor in Milwaukee citing unlimited does an L. P. smart side mastering stronger citing unlimited platinum timber tech and Asia ... built in\nWhen you need and want the best for your house\nCiting unlimited\nStarted shouting unlimited dot com [noise]\n\n[noise]\n\nHoping for some civil or action today from yellow jazz rivers go for a winner\nAnd not only defeating the cubs and shorten themselves a spot in the LDS but home field advantage Robert Boyle sing the national league also on the line today as the winner this game would have the best record\nIn the national league this is the count to brew October the hunt for Red October I should say wrapping things up from wheels northward then I'm going to go on with math Pauli check in with Troy from Cheyenne, Wyoming brewers fan out west checking in ...\nHey I was\nGreat thing for the call yeah I was just curious um you know\nWe've been giving her a little bit along release in the middle of the game on his way way why don't we are here today and\nSee how are you going\nWell because you've never done that before throughout the regular season now here's another thing you you start hater today and I don't know where this is coming from but for whatever reason people want to see just hated it started get bad city in game one sixty three of a season it doesn't make a lot of sense to me and I think ... is in desperate need of another day off to be honest with you\nWhy try something that he's never done it number one and number two if he breezes through the first inning and then the next guy gives up five and you'll lose\nWhole then they got to play another game tomorrow maybe that's the title of the building where you'd want to use our theater so ah the hater idea to start a game at at this juncture of the season it just doesn't make any sense to me at all\nWhat is made Josh hater so incredibly valuable to the team is every single one of his ... this year has been really vital really important any ... you start them\nYou're giving them some Endings That potentially could end up not mattering depending on what happens over the course of the game so I Would not I I Would not start Josh hater but your your point is the most important what\nYou did things that sort of way for a hundred and sixty two games and you're tied for the best record in the national league why would you ever do something differently on the final day of the regular season yet you\nDon't trust the guy who's had some pretty good numbers against the cubs and Josh hitters in in the eighth inning and the ... to one lead that's where I Want to see John ... used to have the cubs number of late\nBut I Will say this is Josh haters Venus and used in a different way and more this year than any other year in his professional career I like the home runs you give it up as a coincidence I I don't think he's on films but I think you could use another day off that's for sure it wouldn't hurt look there's a reason that he's been used so carefully this year\nAbsolutely well we are just about out of time here for ... north woods in and just as I say that the sun picking out here on the north side of Chicago as the birds get set to take on the Chicago Cubs a reminder we'll be back with an extended brewers extra inning following the game and then we'll continue sports federal will be all brewers tonight until\nNine o'clock midday big day maybe if I were just absolutely so uh I'll be with you following our network coverage which begins right after this on WGM Jay [noise]\nWhen you are actually in Germany ... ... ... fine and you can do the mobile easier I think that's kind of positive story you're ... maybe a route that\nRewind brand new car they\nHave a lower rate down you can't get a lot I\nHave a mind hungry that lightning Green Bay out in ...\nWhen you're living space hands right there at your patio or you are wasting the great outdoors living opportunity wet outdoor living on limited show you how to turn that great space into our door living room attack patio even an outdoor kitchen\nDining area to living unlimited is a company that designs and instructs things out there in your yard outdoor living unlimited would use the design and transformation of what is waiting outside those patio doors of yours\nFavors and damp concrete player pitch for Gomez underwater features Greek Greek wedding stays\nOutdoor living unlimited banks make you have\nContact I don't believe in living on that\nEither the jurors that I was living in a more just come on in Missouri unique outside in show ... near these foreigners in the field at six sixty five record\nI sent a typical of a a privilege to me yeah ... ... ridiculous to me I think you're not young you represent a moot point that I think a lot of people have that\nA if the Republican anger if they are the Republicans understand that their base will not tolerate them backing down at this point I think that there's a good chance he'll be confirmed\nJames weakest an editor right Wisconsin thanks for jumping on the line for me quickly James\nOh You're welcome to the\nAfter the break them to take some more callers mark Larry Sam you're up next we're we're talking about the cabin up lousy Ford hearing yesterday in that and now the Judiciary Committee is discussing the votes today which will send us the full Senate more than likely next week see somebody with you on this Friday regimen WGM Jay\nZ or playoff bound other back home like cancer vicious title on the line to the play by play man Brian ... joins got worse to break it down a seesaw reformed Wisconsin's afternoon news used to be with you on this Friday so we get the friday foreign today\nTo different people student wants to like we might be short one today but we're going to spend a lot of time of the hour talking about the cabinet\nChristie lousy Ford hearing yesterday and as as I look on the monitors there the senators in the Judiciary Committee or discussing the boat to potentially that's coming fairly soon I wanted to take as many of your calls as I could do let's go to mark internal show you're on the team say good morning Marc\nMorial thanks for at least yeah what do you think\nHonestly I Believe both of them\nAnd I believe that they both fully believe the testimony that they gave yesterday I watched some of the whole hearing the the thing that really stand out clearly\nArlen doctor for that defied a exactly how the chemicals in the brain react when former marine and it would make them the cabin I wouldn't remember that the ... it was just any other night and the other party and when he got really hung out they\nStarted asking that senator that with alcohol and questions about what she has to elaborate blacked out while drinking or ... ... he had an ad in the lead that swims around and try to ask her about her drinking that lately to believe that he did drink forget something\nSo I Believe that either I think he did but that is that little that he did not do it and if we don't have an FBI investigation to at least try and put the law in fact we can't look at that judgment and if we can't make that judgment the option of getting all the law there now and not the forest through other potential sexual predator that and I'm not there and that's what yeah\nBut I think that's what Dr Ford has testified that he is\nAnd you can't put someone like that on a on a judge state for a life on the court\nOr am I calling from LA John Maher 'cause we've got a lot of lot of other callers but I Am I appreciate your point of view let's go to Larry in Milwaukee on WGM Jay\nMorning Larry how's it going\nGood what your what are your thoughts on yesterday for\nUp until yesterday I thought that the Democrats are given like a a quick they are trying to get them out there what changed your mind\nOr until about law enforcement family on a couple of the Texas family law in fact he doesn't want the FBI investigate\nThey a lot of time with my uncle Tommy everybody know the bottom and nobody was talking about me after a while just anything because nobody asked me a lot of people are buying stuff but they're not going to clean up after I left that specifically at\nYeah thanks for the call or is it a little bit on the FBI some people are bringing that up one these past six FBI background checks to all these witnesses that you'd be by referencing we're we're we're a submitted sworn statements\nAnd those are felonies if you lie to\nThis community and so the government so there's consequences for their behavior if they were not telling the truth and the other big piece of this is the nominee Brett Kavanaugh even though he was asked numerous times he doesn't and he can't demand an FBI investigation\nAnd go back to this I got one more call but I I just want to make his points all this information was known in July\nIt's September\nAnd the reason we're having this discussion and the reason that Christine lousy Ford was forced to testify\nBecause Democratic senators one or their staff leaked information did not protect her identity which as somebody who cares about victims of sexual assaults thinks is probably one of the most critical pieces of this story that or is not being met are represented properly by the media\nWas the Republicans are their staff of weakness the Democrats and shame on Dianne Feinstein who frankly the center from California who lives in San Francisco area she should know better\nAnd the fact that she held this information throughout the first set of hearings on Brett Kavanaugh shame on her let's go to Sam and McHenry, Illinois you're going to be changing morning Sam\n... you know how you doing today Steve good what do you think\nWell first of all before I make my point though and like to commend your previous guest Mr workers some for reminding us of the two hundred plus years of civilized process to this country is now being challenged by a mob rule which will take you know where else to uh other than a ... hour throwing in a\nState uh ducks just where all this garbage it's taken us with my original point was you know we should of the stuff that goes because Bill Clinton came out many years ago when you were ... in the White House and he was very clear he so we're not going to win this ... we're going to win this fight the courts\nAnd this has been a long term goal of the Democrats to get a bunch of people in the courts are going to argue about what the definition of the word is in so I've seen this coming for years Steve\nSo in all the services are trying to quit a few judges or they're gonna start coming up with this crazy stuff the ... the process and the sort of a clue what we're all watch from now and they you know the three feet it for their last chance now to flip this country\nAnd are not going to give them up easy\nOr a military go there Sam a great points as always um you want to know how they know the process of screwed up because right now I'm a monitoring in the studio Debbie Wasserman Schultz is talking to the media\nDisgraced Democratic National committee chair somebody's you should be embarrassed but yet as not being held front and center as a\nCommentator on this issue that's how screwed up Democrats are on this issue half are out there disgraced congresswoman from Florida who's now being tried it out there is somebody knows anything about this issue\n\nThe last thing I'll say on this and we're going to be will cover it throughout the show say even including the friday form\nThis was an embarrassment to our country is one driven by politics not reason not evidence not facts\nMotives in the morning in all this give me a chance to bring our for an fantasy the fathers and yet in the last four stories later this morning then you'll be hundreds of the past ... Modi right on down to the house through the forest send the four biggest stories has received\nAcross Milwaukee state in the world I think the last time I saw this guy was state fair Brian ... joins me in Studio morning Steve good to be on\nSo I have to ask you about the news of the other day and then in the week I'm really a month is the cabinet nominations your thoughts I don't know how much is that you watched yesterday but the incredible moment in our nation's history a Supreme Court nominee accused\nOf sexual assault thirty five years ago Christine Blasey Ford testify about cabinet passionately testified in his defense your your takeaway from yesterday\nYou know you is a real and it was heartfelt testimony by both doctor for an by just Kevin or the more than anything you get frustrated with the process that's going on I mean there's this evidence is sitting there for weeks maybe months uh and it comes forward at the end and it becomes a Washington DC at times is becoming a circus\nAnd when I was talking to people that's what they are more frustrated with than anything is Washington can't function like adults and get stuff done on the half the American people\nWhat's so frustrating is how you just watch this process play out in Washington in the Senate it's just a mockery of some of these you know men and women that are out there so frustrating\nSo those of us who have talked about this issue for well maybe even before I was on the radio [laughter] what do we do about it\nYeah I mean you know you got to get a better process out there you got to get people working on behalf of the American people less focus on grandstanding giving themselves on cable TV more focused on getting policy Don\nPutting a qualified jurist on the bench and you know getting work done on behalf of the American people is what we should be focusing on in Washington knocked people out there ... trying to get themselves on you know the latest soundbite on TV or radio darn frustrating\nRyan styles kenner for the first congressional district joining me this morning so let's talk about your race or Randy Bryce as your opponents I understand he's finally agreed to debates\nYeah we're going to be debating on first debate going to be October Nineteen sign Oak Creek a city you know well very well I Will be there at seven thirty I'm excited we're gonna be talking about the issues and social locations people did it will be a city hall creek seven thirty pm friday October nineteenth\nWill will like congressman Michel can be there to speaking\nWe'll see we'll see right I mean\nYou look at who is a liberal who's who are coming into the first district or they tried to support my opponent you build a ... or in town supporting him to know Shia yet Bernie Sanders\nOf Madison a congressman mark poke can coming in you know let's talk about the issues I that's why it's so exciting about this debate is it's going to be my opponent and I one on one having a conversation about the issues that matter to voters about how we're going to grow the economy how we're going to lower health care costs\nAre going to make our community safe\nAnd I got a list of questions I'm excited to ask Randy Bryce uh we get the chance to talk one on one\nSo he has his campaign in ... and Randy Bryce have accused you of the ... of of falsify your background are not representing your your work experience I Want you to comment on that\nAnd the passion and Senator Lindsey Graham yesterday was said enough is enough people\nAnd his comment was was perfect because it shows how divisive this process becoming who do you think it's going to be willing to next time an opening comes up in the U.S Supreme Court to put themselves or their family through this\nI saw people that I respect\nThat I Know very well say things on social media yesterday calling for revolutions\nAnd you know shaming anyone who who supports Brett Kavanaugh's nomination because we disagree with them I saw family members on Facebook attacking each other over this nomination\n\nWe've got to be smarter than that we got to understand that there's a process it's a political process is a cultural process if it's at some points\nIt can't be about just the label behind you name it can't be about that you can be upset as a woman about what happened that Christine Blasey Ford you could be upset as a man about what happens for as I Am\nAnd you should always listen and I I I capitalize the word always and I was shattered if I could listen to what women are saying about sexual harassment sexual assault for too long in this country that has been the case\nBox\nIt doesn't mean that doesn't have to be facts evidence eyewitness testimony something\nOtherwise it rises to the level of a witch hunt which I think all of us decent honorable rational reasonable people understand is how this country works\nI Can't make her pain go away but it's pain that didn't have to happen yesterday and it didn't have to happen because of Dianne Feinstein or staff democratic leadership who said you know what we're going to attract you out here we're going to make this is ugly as possible\nAs ugly as possible for you\nSo you can suffer even more than you suffered thirty five years ago and wanted to do it for a political purpose she asked to be protected she asked Senator Dianne Feinstein a democratic senator from California\nOf all places and they couldn't do the decent thing I protect her identity that's who you should be mad at that's where you should point fingers\nAnd even after that Republican leadership on this committee Chuck Grassley\nSaid you know what we can do is a closed session and you know what those Democratic senators said no we want her to be out there out front in front of the cameras to tell her story point the finger is where they need to be pointed here it's not that difficult doesn't mean women should be listening to of course they should always be listening to\nWhat is a country\nStill\nHas a presumption of innocence and if you don't believe that maybe you're living in the wrong country\nAfter the break the forests have the four biggest stories as we see it across Milwaukee to state and the world no surprise lead off with the controversy in Washington DC the latest on that I saw ...\nGood morning Wisconsin's set on I see somebody with you on WGM jails see in a [noise] a bit of a this is my voice\nWas on a little better and I was thinking of a rough morning ah thank you for listening as always fifty four degrees of Radio City a little rain coming very up as nice where you are thanks for listening as I said they don't forget friday forum coming up an eleven o'clock hour but of course the ten o'clock hour as the\nFour at ten the four biggest stories as we see it across the Milwaukee the state and the world and a number one has to be the Kavanaugh lazy afford hearing from Washington\nAnd he has been emotional at times already today for the Senate Judiciary committee Steve got together earlier today they were going to discuss whether or not\nThey would have voted than they have decided yes there will be a vote today in that community it should be around one thirty this afternoon but before that things have been heated even before they made that decision Democrats not happy\nHigh drama inside the Senate Judiciary committee meeting on Supreme Court nominee Brett Kavanaugh several Democrats walked down if Republicans started debate on Kavanaugh's nomination one day ever fiery hearing on sexual assault allegation one of the Democrats who walked out and protest Senator Richard Blumenthal\nAll of America is watching the United States Senate today and\nThey should be deeply disappointed embarrass a shame\nDemocrats the mainly the FBI reopen the background check into Kavanaugh Kenneth ... ABC News the Capitol\nSo right now there is debate this could go as long as forever but they already have a vote scheduled anyway Senator Patrick Leahy helped me voting on\nJudge Kavanaugh's nomination is not ever asked me for a month for a lifetime appointment to higher score\nThan nation Senator Orrin hatch we've had enough time on this the ah such a course on I just have to say let's be fair but this let's vote whichever way we want to and that's a that's a lot of on this\nSo one of the key senators in all of this is the senator from Arizona the one who is not running for reelection by the way Senator Jeff flake he\nIs voting yes and there are a lot of protestors on Capitol Hill you as you can imagine demonstrating upset with this many of them who have been assaulted in their past and they confronted the senator as he got into an elevator [noise]\nAny shots point where he\nCould not shot the elevator doors so actually the hearing was delayed because he sat there and listen to some of these protesters this back and forth actually there's a transcript of it\nThat's been posted on line already and he he was very cordial and and respectful about the whole thing but clearly could not move from where he was that bad the door jammed open they were talking to him and he couldn't have move he was very pretty much stuck in there but\nThat is a big vote knowing that flake is voting yes one can assume that some of the others the generally vote in a block and yeah there will also vote\nYeah Murkowski Collins Jeff way right and the other one that does the ... I've heard some news about is the the Joe mansion from West Virginia might also be a useful as he lives in a very conservative state loom there's a there's a good indication that the vote once it gets to the full Senate maybe in the favorite Brett Kavanaugh or just to the point that you raised about the disturbances in the elevators expect more of this\nThe tantrum politics happening this country that's just gonna escalate this isn't going to the whatever happens with Brett Kavanaugh's nomination up or down that's going to continue to escalate and and I said earlier in the show if there is another opening during the president's tenure you think this is something\nWait to see what happens with that one that's number one of our for us and the four biggest stories as we see across the Milwaukee the state in the world coming up next brewers Doug Russell let's make the connection between those two U.S next right here in the ...\nPlus the growers hey their their heads of the playoffs will find out this week and what that might mean whether it's one game or a series\nAnd joining me now is like Ross I Would say my favorite sports guy but that would make great magic man that I Want to I don't want an upset Greg magic I totally off the air that I'm your favorite [laughter] okay we don't have to solve that was a private conversation [laughter] as long as we approach this week and there's all kinds of scenarios we can go\nWe could wrap ourselves in a in a matter of trying to figure it out and you can see I'm losing my voice I'm so excited about it it's not that difficult or not as hot as late as I said all a sports fan okay so you want the brewers are when obviously\nOne down into you root for them and many root for the cardinals okay\nIf the brewers have more wins then the cubs do by Sunday evening and the brewers are champions of the division and then the cubs would be the wildcard or against either the Dodgers I'm Rockies or cardinals and they all have to play their own games ah but the brewers are are ...\nThese are are definitely in as we know as are the cubs right now as are the Braves those are the three things that we know at this point are and so you root for the brewers against the tigers the tigers seven thirty games hundred five hundred the cardinals applying for their playoff lives they're not in yet and they're you know they need to win in order to get in\nThe cubs they need to win in order to stay in the lead for the division so that that series at Wrigley Field there's a lot of juice that's going into those those games which actually start this afternoon a ...\nIt's like pre playoffs really I mean all these two weekends series are are are for the whole ball of wax nano central very cool stuff so let me ask you about the pitching staff as as the managers Madden and comes to approach this weekend\nThey also have to think about next week as well and how how to figure out whether they have a Monday and Tuesday and whatever you play for ... honestly I mean this is you have to set up your pitching rotation to have your best pitcher ready to go on Tuesday you may not have to play on Tuesday if you're the wild card\nWinner though you will have to play on Tuesday um but whether it's way Miley whether ... he's got to be ready whoever credit counseling is number one has to be ready to pitch on Tuesday period and the story because you're already in\nBut now you got to win that game on Tuesday to advance of the division search so and Miller Park this week and I'm guessing is going to be a full house if not you know they're pretty close yeah so what what is it you know you've been around sports for so long what is that going to be like the energy they're just the excitement of of this this chase to see what can happen with the Chicago and Milwaukee had to have well it was\nLeave is is a science position as a representative government went on to tweak this representative Brooks comments are offensive and disrespectful they have no place in our society and are inconsistent with the highest it has it must be held by those in public office he should resign from office period\nNo different from the from the governor's take was assembly speaker Robin boss and majority leader just on a key frequent guest on the program they issued a statement Wednesday as well\nFollowing Governor Walker's call for a bookstore resigned said they condemn the offensive remarks and they felt the issue of inappropriate resolve and said yesterday they did not call did not call for books to leave his leadership post\nSo the women affected the women lawmakers were sending do ... Amy loud and back with Clinton and Jesse Rodriguez of Oak Creek\nOn base that this is their statement jointly we were satisfied with the assembly response to the summer and it fully accepted representative Brooks apology wildly respected his decision to resign as leadership position and appreciate the seriousness with with what you take the issue\nIs beyond what we expect or even wanted we put the incident behind us we would kindly ask others to do the same so that's the statement from the three women\nWho he made those comments about\nAllegedly what happened in July they were at a restaurant it was after it simply GOP caucus in the Dallas area of books that he would buy drinks for everyone\nBut the steps you some are represented Rodrigues because she says Hispanic she wouldn't buy one for her for a for her um any but he did indeed buy drinks for other people's but not Rodriguez and and to Jesse Jesse use credit she is taking the high road on this which is to be lauded and and I appreciate it [noise] so what do I think about this\nFirst of all I should know better and you can say that there isn't involved in a situation of alcohol or just bad judgment but lawmakers elected officials have either party need to know better\nAnd really it's it's the public's right to say the law makers you leave we recall you\nKnow that's their call really like get where he's gone with his decision to stay on but at some point you make bad decisions like this when questions your integrity on anything else because if I Know one thing about the climate in this country right now and and this happened in July of this year\nMiddle of the me too movement any comments to women like this unacceptable not there's no grey area\nNo confusion though uh I just said the wrong thing you should know better you're elected state representative you should have more smarts than that\nWhile I applaud him for resigning his leadership position you might want to take the next step I agree with the governor here there has to be some measure of consequences for bad behavior\nAnd you may think some Republicans in ... and do you think that just stepping down from the leadership position is enough I say no\nYou've got to be smarter than this\nAnd if you want to win elections if you want to the big picture and grow your party which\nI bang my head against the wall when I think about Republicans and some of the decisions some of the things they say some of the things they do not understanding why these types of stories hurt their party both in Wisconsin and nationally\nAnd you wonder why we have the political discourse that we have in this country because of nonsense like this you made it worse not better\nSo representative David Brooks Roberts I should say as not stepping down but a stepping down from his leadership position will maintain his position as a state rep that summer for of our Fort Sam we got a good way those ... tickets to assess the tickets right Jordan\nLet's go to caller number eight and color number ten the Fort won four seven nine nine wants to be one of the African Americans ...\nGood luck to Jordan enjoy that concert a he's a great trumpeter and that that will be one heck of a cost to see but you got to get our rights hopefully wrote them down before at ten in the four biggest stories as we see a ... walkie state in the world more next year they'll be the ...\nAll the birds are in the post season play off plans are nowhere near ... what kind of impact on the weekends series with the tigers sprint Greg Matthew goes through all the playoffs scenarios that I'd have six or seven of words central you've really with you on this Friday hoarse voice you can really but I'm plugging along thanks to all the folks\nWho are\nTalking about there's a lot of cures of pets are\nThat people are putting forward that summer frankly I've never heard of I Want to spend a few moments talking about the er the cabin are hearing I Know that that was a a a big discussion point early on on the show and it it will continue to be there's a vote scheduled for twelve thirty today our time on the or at least moving the nomination for it to the full Senate or early next week\nAnd I know ...\nAnd I know people have um a lot of opinions and feeling strong feelings on both sides of the time don't discount either one my anger and my\nI think my the trust of the of the narrative years that's a one side\nIs evil on one side is on the side of right now we can argue about the presidents and what he does and parties and what they do an ... all of those things are are well and good that's politics twenty Eighteen style no one's disputing there\nBut when it comes to this issue there is a process elections have consequences presidents pick Supreme Court justices those justices go through their process with the Senate Judiciary committee and then to the full Senate you don't have to like the results\nBut this call for revolution which some friends of mine I call them friends put out on social media or the\nRidiculous attacks on family members because they have a different opinion on this issue\nStrikes me as going too far look at the facts of the case we have in the accuser\nChristine Blasey Ford said something happened thirty five years ago we have the accused Supreme Court nominee Brett Kavanaugh who says it didn't both have the opportunity to testify in front of the Judiciary Committee yesterday\nI thought it was handled appropriately I thought both sides\nIn the morning hearing handled the questioning appropriately\n\nUnderstanding how delicate that situation was not wanting to re traumatized Christine Blasey Ford who whatever she experience deserved to be listening to\nNo question but please don't indict people because they disagree with you\n\nAnd just another note on this I saw some commentary and I even through the body after the fact that the an actress Alyssa mulatto was in the audience I I got some clarification she apparently works as as a victim's rights advocate but when you're sitting\nIn a hearing room in the Senate office building don't hold the Blinder that has some message on the back of your diminished the process\n\nThat's not your role you were I guess in that chamber act like it's\n\nThankfully we didn't have the disruptions we had in the first few days of the cabinet hearings\n\nMay or may be a civil war in this country on issues like this but it doesn't help when level and level headed smart people advocate violence which is what rebel\nIt's violence\nJust because somebody disagrees with you and frankly it's gone on too long\n\nWill it be changed by anything that happens in the next two years probably not probably just get worse and as I said earlier in the show you think this is something\nGive president Donald Trump another Supreme Court pick you've seen nothing\nCompared to what that would that race and the fight would be about\n\nI'm One guy saying this but\nI think at some point commonsense needs to prevail and while you may be passionate about politics\nEven despite of Donald Trump love him or hate him calmly goes on families are raised\nPeople do their jobs kids are kids are educated for the most part\nDon't promote something that's an extreme in your mind\nAnswer to what's happening in Washington DC not helpful and frankly\nBecause I talked to a lot of folks are witnesses witnessing this play out on social media\nIs not flattering to the people who follow you and our friends with you and our family members with you it's frankly discouraging and you want to have a war in this country separate families families are the bedrock of what this country's about families and say\nYou blow it up over politics the end result is not going to be good seats WGM jak\nChristie biology for emotional mhm gut wrenching mhm I sat on the show women always need to be listening to they don't necessarily have to believe that at some point it has to be about producing some piece of information or a witness that says this is what happened that's something we can agree with\n... yeah absolutely and I I mean we ...\nThat you can't separate what occurred yesterday from two big elements of contacts and the first is that we've known since before since the moment Anthony Kennedy retired\nThat the entire Democrat's strategy is predicated on getting this confirmation vote beyond the mid term elections every second of every decision has been predicated on that\nThe other thing we can't escape is the fact that we are in this a reckoning of this me too movement and we have seen powerful figures brought down by\nUm allegations by a corroborated stories from many many years ago and we know we we\nWe've heard the testimony of of\nMillions of women in this country and I think a lot of men are cheering women in their lives for the first time to your story that I they didn't know existed that they didn't know that women are kept these things up that they they didn't they weren't believed at a time and that's that's a big thing for this moment in this culture and that's all feeds into that\nI Want to ask you after the break could this be a victory for women even if Kavanaugh is nominated because the fact that her voice was heard a comment or off from the Wisconsin is to allow them to join the on the friday form presented by the Medical College of Wisconsin more next right here to be the answer\nThings were full of Facebook professor of Israel is a funny but if he and his Facebook page\nYou can send us questions are a lot of comments on the Colorado joining us from Wisconsin is to prolong liberty on this Friday and we're short one just because she is out sick but we'll we'll go along as we can\nUm so before the break we were talking about Christine lousy forest testimony let's talk about red cabbage out during the break we were talking about what that looked like what that sounded like what did you think of his testimony how he delivered at his style\nReally as anger at what was happening to him and his family\n[noise] yeah I was prepared after watching a lot of the the Ford testimony in the morning I was prepared for Kavanaugh\nTo uh to go down I ... you know there's a high minded affect you start reading people on social media and you think those of us and what can you do to get to a to change the dynamic here and again\nUh accepting that this of this of optics versus theater this was his practical or he did the one thing that I think he had to do absolutely had to do\nAnd what he did was you sounded like he gave righteous indignation he sounded like an innocent man and I think a lot of people ah we're looking to see you know ... ... if if I were innocent how would I react\nAfter you know ten days of having his name and his reputation dragged through the mud things his family has gone through or how would you react and ah yeah he he he brought the fiery dial up to ten I think some some might wish in certain places he would have dial to back to eight but I'm\nDirectly challenge some of the senators yeah they didn't appreciate\nRight right and I as highly unusual but this whole thing has been highly unusual inner city was in the fight for his life and I think uh what he did was he showed spying and I think it's given Republicans the spine that is likely going to get approved\nOne of the things that I are are flooded on the show this morning and I bought it on social media yesterday was the comments of Senator Lindsey Graham I thought that was a singular moment in this in this testimony and they're hearing that stood out because he was calling out his colleagues some has he said that he had been friends with for a long time\nI see that as a potential rallying cry for Republicans other people see it differently what do you think\nIt was an extraordinary moment I it was it was extraordinary because if memory serves that was the very first Republican uh besides Grassley to really take their time that they use the first one not to defer to the special counsel and I mean he took out the flame thrower I and I described it as a sham\nAnd I think he voice a ... you know Lindsey Graham of all people not a hero to many conservatives not a hero to many ah [laughter]\nWho who are out you know activists and pay attention to this stuff um uh for for Lindsey Graham of all people to to deliver that message I think it was very very powerful what does he writes\n... Ah yes yes he's right in the fact that this is a circus there is there's absolutely no way in which um this was a fair process can be a fair process going forward I think there's some serious question going forward\nBecause of that you're talking about the fair proud processing in Grand even brought this up the year ... year book talking about an old high school yearbook Kevin from thirty plus years ago\nThat likely is the new normal Illinois has been I assume in some respects where you\n... these nominees over and over again or candidate for president or whatever now that we're moving\nInto the digital age that we have everyone and we talk about digital footprints imagine ten or Fifteen Years from now on Monday with the digital footprint that they are leaving right now I don't know how we ever go back to any type of normalcy when it comes to the\nYeah I saw somebody post a jokingly you know ... say say good bye to any funding yearbook post right like I mean from now I Know I it's an extraordinary question I think it extends beyond Supreme Court nominees on on what is\nYou know everyone has a digital footprint ... you'd be able to geo cash where people were our location wise or you know probably some future Supreme Court justice is tweeting something right now that could you know blow up in their face that it's an extraordinary saying something that we were not prepared to grapple with\nAnd um yeah I mean I said it's more than one person I mean\n... ... ... we're in for more things like this especially in a partisan atmosphere\nI Want to read from a lot of comments on Facebook and if you want to catch you can go to a news radio six twenty WTO ... Facebook page Denise ass or she says what scared me while watching this unfold and total on hinged war are men I fear for my husband's brothers and nephews\nThis proves that you can say anything with no proven our men will be found guilty before they can possibly defend themselves do you worry about that do we shouldn't be worried about that audience and I must say Christine by these accusations are not true I have no idea and there was no evidence provided to suggest that is or isn't\nIs there 'cause there'll be a backlash against men as part of this meat woman at a hearing like this\nWe're we've seen things like this right when we do come across the Rolling Stone saying at the University of Virginia we have seen false accusations that people jump to conclusions of they looked at a certain culture and they said yeah that sounds right that sounds true those guys are ... those guys are prep school guys\nThat sounds true and people jump to conclusions before there was evidence and and in both cases those were found to be false\nBut we are in this moment of reckoning we are in this moment in which there are a lot of real authentic stories coming forward about a powerful man and not powerful men or women are feeling empowered to speak\nAnd uh this is really a test of our principles those are the test of of um not not believe any accusation but um are we going to defend the presumption of innocence I mean that is\n... ... we we we cannot move forward in a society which any accusation without any corroborating evidence or results in the destruction of anyone ...\nUh this is this was going to be a real real test going forward and I'm worried that that in in search of political gain in search of power in search of what have you that we're going to cost a lot of those principles suicide\nCounter off in the Wisconsin It's super long there'd be joining me on the friday forum flying solo represented by the Medical College of Wisconsin after the break Cato ask you about the political realities\nJudiciary Committee voted twelve thirty full Senate vote next week we're that story's going\nThat's all next right here to be the engine eleven forty six needs to be with you on WGM Jay the friday form usually to people today just common rough in Wisconsin is super law than liberty or to play a little bit of a a piece of are the ones that are addict or before Congress will ask you for your comment that\nStops the clock this committee is running this here is not the White House not Don McGahn even it was a nominee we are here today because Dr Ford asked for an opportunity to hear I Know you didn't do as well in fact maybe even before she there\nFor here because people wanted to be heard from chargers that they all thought for unfair for activities like sexual assault was unfair\nSo I Want to assure regardless of what you said as Don McGahn weren't not sustain this fearing a\nLittle bit of a the or German or start Grassley commenting on the request by Dick for the Durban too he actually asked the candidates are but Kavanaugh to endorse FBI investigation before I get to the reality is what's this all means your thoughts on the FBI investigation piece of the story [noise]\nYeah I I think it's given a lot more weight than than what it should um I I don't\nI don't know if people realize that that are at a Senate committee has investigators they can take subpoena testimony and they they appear to have taken subpoena testimony and I don't think it would be that much different from what the FBI would do the FBI would take testimony from this person this person this person and they would deliver it to the committee they would not\nCome up with a recommendation they would not come up with a conclusion this was not a police investigation and the guy is\nKind of a dirty word now inclusive but more and bracing to other people that don't look like you and I look\n[noise] yeah it's really it's really hard because I think the incentives are such that ah that we're ... we\nYou know elections now are just base elections you know I just got a rabbit my base there isn't much of an appeal to the middle anymore you might notice that\nAh that that the incentives are such that um you know if you're not in my coalition that I don't need you um and I think it was something that uh that was mentioned that aren't gala last night that you know part of it as just a simple respects I mean you you can't you can't earn someone's owed if you don't ask for it and part of asking for the showing up\nUm and I think Republicans and conservatives need to start showing up in places that they're not expected to show up and maybe it'd be put in some uncomfortable situations show some courage show some ... some confidence in what you believe if you believe\nThat your principles and your policies are good not just for a certain people but for good for all people in all places a proven\nWell said calling Ross in Wisconsin for a while they'll be thanks for doing that to people's job today on the friday foreign presented by the Medical College in Wisconsin shuttled to all the folks on Facebook and there were a ton of Maryland Diane can Sandy Mary Kay\nJohn as well we always do this every Friday one o'clock hour the friday for two different people usually when she was all walks of life\nYou have a suggestion or I guess the idea of seven today I'm always looking for new panelists we ever think about twenty four thirty different people and we kind of mixed him to the equation talking about the events of the week what's happening in our states or community in our country\nAlways one coming up next we do every week as well you're just a week in review\nSeven fifty wants to be with you on WGM Jay thanks a collar off in the Wisconsin It's for law and liberty doing humans duties going in for my other guests on friday for me to present it of course by\nThe Medical College of Wisconsin appreciate those folks doing that for us and uh it's always fun to kind of you're talking about the events of the week what Eric those are great teacher as well and this week brewers postseason birth confirmation hearing a sexual assault allegations and a five year old Myrtle ... murder trial all part of ... a week in review\nThese\nRight celebration for the crew about area on the first [noise]\nA lot of every let's go [laughter] copy down there in a minute I'm having a fit ain't got no alcohol ah you're wrong real hard to\nMove the scheduling got it right when they gave you an off day after the night right yeah absolutely absolutely I'm just so much the champagne seeing the eyes\nThings a little bit for feel pretty good um I like to have I live\nHere and has a brewers fever made us would agree man anyways exciting time ... in the state of doing where else great for\nThe deputy attorney general Rod Rosenstein the official who oversees the special counsel's Russia investigation was some into the White House today expecting to be fired\nDay at the United nations is the president got a very different reaction my administration has accomplished more than almost any administration\nAnd the history of our country\nFor America's censored [noise]\nDidn't expect that reaction [noise]\nHad a hard trying to ferry any created [noise]\nActually going to rate\nWith what degree of certainty do you believe ... Kevin assault [noise]\nOne hundred percent\nOne hundred percent this confirmation process has become a national disgrace I'm innocent of his charges you're prepared for an FBI investigate don't reach conclusions you reached that conclusion oh they do investigate questions this is going to destroy the village you got the full time ports because of that crap [noise]\nHigh school yearbook I Hope that the American people in the\n... day two of the trial of Chris ... started the jury visit the apartment where he is accused of killing former girlfriend ... Dwyer and the place in Jefferson County where wires body was found less\nThan twenty four hours after two Oak Creek high school students were struck by a van while heading the class the same as happened in ...\nWas a teacher who hit two students did stand scene and was visibly crying pretty surprised Netflix\nWill really tend to episodes of making a murderer king crabs with the special prosecutor in case for since ...\nEvery court in the U.S has rejected\nAny claims by either ... or gas that professor interests here comes come on to everything\nThat they work in manufacturing\nFour years demolition crews were on hand Tuesday to start tearing down the backstage area of the American family insurance amphitheater\nIt's a little bittersweet in that or this building has served our community and and music fans worldwide [noise] for the last thirty one years Fabio\nSoldiers in order to yes no I haven't been avoiding new [noise]\nI've been busy\nAm I really got cold on us [laughter]\nLet's say you do are scheduled\nAnything he says that does not make me a great way to end\nIt on that brewer story and we're all going to be looking at Miller Park this weekend as a birthday card tigers hoping hoping hoping they can get that animals central titled Jeff White and you're in the building in the studio up next\nWelcome to the WGM Jay dot coms live streaming feature right now WGM Jay is broadcasting play by play sports or syndicator programming we do not have the rights to stream these broadcasts please check our website for the program scheduling upcoming games\nAnd of course you can hear live play by play and syndication by using a radio and turning to six twenty WGM jak\n\nWelcome to the WGM Jay dot coms live streaming feature right now WGM Jay is broadcasting play by play sports or syndicator programming we do not have the rights to stream these broadcasts please check our website for the program scheduling upcoming games\nAnd of course you can hear live play by play an syndication by using a radio and turning to six twenty WGM jak\n\n... whether it's WGM Jay we are live streaming the first couple of segments of the program Facebook Live fateful dot com slash when he he MBA you can watch us as we make radio magical key ...\nYou want to go on the record with the production of what happens with the brewers in the playoffs or the weekend\nI Believe that there will be a game on my\nI I feel like they are going to tie with the economy and they'll play or a tie breaker and no central championship game on Monday to friday or for that\nSo for example you think brewer sweep and the cubs win two out of\nYeah or or yeah one out of three jobs and then throughout history which would leave\nThem tie abs and then you would have a game on Monday to determine who is the champion of division right that person then gets off until Thursday the team that loses on Monday\nThen has to turn around and play on Tuesday I held on to see this ... they didn't give it a little thing about baseball and being in it I mean you know you ... and you know you can certainly make the case I mean I\nI think I\nI don't think the cubs you're going to win all three I don't think so either you know in St Louis has sent in St Louis is a game out of that second wildcard spy there there again behind Los Angeles they're playing at Chicago so I mean their arch rivals St Louis has has every incentive in the world to try to win and um\nAnd the other interesting thing I think about what's going on is St Louis plays\nThis afternoon and they play tomorrow afternoon to get Chicago the brewers for better or worse or going to know what the cubs did ... I mean again\nI mean so the brewers for example if the cubs were to lose this afternoon they'll know that going into the gay guy energy tonight if that happens ... who's this afternoon the energy tonight will be free and somebody who is this this is so I you know we bought a my buddy evident I bought a twenty game package of season tickets\nAnd this is this is the last game we have to have this is you know we're we're going tonight and I'm\nI I just ... I actually my wife gave me permission I I have a lot I'm people tuned into Facebook Live and we're one of my similar Packard stuff today\nBut I got a lot of brewer stuff and I got permission them allowed to I'm allowed to buy new brewers Wagner night so I I I've been given to normally it's like All right\nYou know I Need to have approval before and it's and it's actually good I don't complain about that 'cause I've got lots of T shirts and stuff but I have been given permission to go buy a new brewery swag then I started with that also you know if you want to understand how big this isn't and we we have been announcing this\nUh the the brewers game on Sunday is going to be on WGM Jay ... that\nI won't say it's never happened in the Twenty years I've been here but it rarely happens the Packers game which is going to be ... going on at the same time contemporaneously with the brewers game that's going to go to our sister station W. K. TI um which I again underscores the importance of this game and how cool that is because\nUnder penalty of perjury saying what happened do you think he's going to ... if I'm the lawyer for mark judge and the FBI comes knocking I just take that same sworn statement that he's already given to the Senate investigators I gave it to the FBI and say here this is what my client has to say I mean\nIt's you know look I maybe people are frustrated and maybe people wish you could go into the way back machine\nAnd figure out are I was there anything that was there but right now based on the evidence you have you don't know when this occurred you don't know where it occurred the people that she says we're there said that they have no recollection of it and it didn't happen so so what what more investigation are you going to come up with\nFor one for seven nine nine one six twenty let's talk to Carlton and Milwaukee Carl's junior there'll be camp J\nUh yeah I\nThink this whole issue I mean is this good man ... it was like oh man I I've been in time to time about this thing right I I didn't know that the process of willpower\nThanks a card for well I mean you know he he he's got the calendar and you know I mean he to the extent there's any sort of specificity if\nIt's coming from him he's saying I'm not in town on on these kind of we can mean at some point in time I Do think it is fair to say to somebody who's going to make very serious accusations of so much and then let's take it beyond the realm of sexual assault I mean if if you're going to accuse somebody\n... of this type of reprehensible conduct and there's really no pattern and practice\nYou can see this happen Thirty years ago don't you think it is right to at least require that accuser to have some sort of shred of of proof or some sort of cooperation and it can take it outside the range of sexual assault imagine how you would feel if somebody comes back into thirty five years ago\nDue this person did this to you is this is this is what this guy did to me and you know I I I don't think he should be able where she should be able to get a job and you say it's not true [noise]\nHow do you disapprove at art back was more of your calls in just a moment if you're on the line please hold on but I understand this is a difficult situation and nobody comes out of this looking good and it's unfortunate that the timing it's unfortunate that this has come out but [noise]\nAgain for the reasons I explained if I'm In the Senate I vote for him absent any sort of cooperation over claims twelve twenty seven Jeff ... there'll be tempting [noise]\nOn to your friends are going to be very you know he should not be confirmed\nHouse is different than the leash a baseball player who assaulted is nice when he was Seventeen everybody should he should not claimed to make some major league baseball is the difference is the guy who was convicted of assaulting\nIs nice I mean it that that\nIn that case he has a felony conviction for assaulting his knees he's a registered sex offender\nThat's not what we have here are I'd tell you what I'm going to take a quick break for this we had a lot of great calls in the library to do this for one more segment we're going to keep the Facebook Live process going for one more segment as well um the vote should be coming within the next few minutes as well\nHow would you vote if you were in the Senate yes or no it is a difficult call I can see that\n[noise] ... ... pm Jay we are continuing to monitor the Senate Judiciary committee the headlines are there's drama something going on behind the scenes who knows All right Lisa in Milwaukee Lisa thanks for waiting good afternoon\nHigh highly refined I Would vote to confirm him and I watch a lot of that hearing yesterday and I really don't know I really I looked at him and I felt like it was like when they destroy everything at work or for really really hard for and what I was thinking is\nWhat they can only that every time a girl that's your story ... ... some of the corporations always how true and you can do that either don't have a good market luckily and everything else but your potential sexual predator\nWell and you could have lived a very good positive life um to keep in mind that's the other thing is happening thirty seven years ago it's it's not like she's saying he did it a year or two ago\nAnd I know [laughter] it should have one here well what if what we hear every darn rabbit or don't have to write\nHim and again I mean if it's an ... you know into frustrating to me ... I don't know what happened I mean I I I don't know I don't know what happened if anything did happen but at some point in time I guess I say thirty five thirty six years ago\n... unless you're able to provide corroboration can you and and you said that the guy was seen by frustrated like his life has been destroyed in many respects that has he's never going to get his reputation back and even if he's confirmed the U.S Supreme Court he's\nAlways going to be the guy that in the minds of at least a lot of people what was a rapist when he was Seventeen years old\nOn line for me it would you want someone that coming your job tomorrow and fired from a job you know for Twenty years 'cause somebody that high school\nAnd we have already 'em knowing that no no and I think about people have bothered that there are a lotta lotta that wouldn't hurt anyone\nRight yeah and I think I Know I Do to make the call and that's and I think that's the thing that I Do I think\nI mean look I I mean I understand I I I think there's a lot of positive stuff that comes out of that the me too movement I I I Do and you get down to fight a number of people who have been the serial sexual predators Harvey Weinstein being a classic example of that\nBut that's not correct capital I mean and and nobody says it is Brett Kavanaugh Harvey Weinstein dean had a casting couch that was a mile long did it for years and years and years and both men and women\nAnd members of the media looked the other way because he was powerful and I think in large part because he was a big donor to the left and he was a champion of women's rights at the same time he was abusing all these different women\nWell okay they look the other way on that but there was proof for somebody like a Harvey Weinstein let's talk to Greg in West Alice Gregor until we team Jay\nOh they're like Greg my mom and I would not going to burn is that right now ...\nYears and he will always be damaged goods no question about all you can do right now\nIt's their problem already and I did I deliver Henry or Hillary okay then I'm going to stay in it though and you know\nOkay tell me why you tell me why you think that\nIs that because I I Will tell you the the contrary the flip side of that argument will be among a lot of Republicans given the lack of corroborating evidence if if the if the Senate failed to confirm there's going to be a lot of Republicans who are angry because they are going to think this guy got railroaded\nOr I or not I hear a lot that\nWeren't sure what the party on issues where when and where you're writing from\nWhere you know I actually do it knowing when to\nPeople and that was just\n... I don't know right\nBut it was it like you said that and it's already declining and they really do I think that there would be have come together they were going to die for now and now my thought out\nYeah what's that mean that that's the ... they make sure that that is the court and I I where I agree with you is that is the course of least resistance I mean it it is because you're right Brett Kavanaugh is damaged goods that whether he's confirmed the scream court or not\nHis his life he will ever be identified as being a a guy who leasing the mines like I say if some people are tempted to sexually assault or a woman and and that's that that's going to haunt him for the rest of his life and I think\nSome of the frustration you saw when he testified yesterday was a recognition of that and\nI again I understand that there's some people who don't think he's lying who believe he's like but imagine if he's telling the truth\nIf he is telling the truth imagine if that was you for it let's take a side the gender imagine male or female if you were wrongfully accused of something no corroborating evidence from thirty five years ago and you recognize that it was for ever going to tarnish you in the most public wake imagine how you would feel about it\nBut I I Do agree with you grade the course of police cars here here's the course of least resistance\nHe steps down and he said he's not going to step aside course of least resistance is he's voted down\nPresident Trump nominate somebody tomorrow my guess is if I were making recommendation\nYou find find a woman so that might to diminish any sort of allegation cause you know the next guy that gets nominated it's going to be the same sort of thing people are going to go back saying is there anybody in fifth grade that says something about this nominate a woman maybe even somebody arguably more conservative\nAnd then you know put it on the fast track\nThat's the easy thing to do that's the course of least resistance it gives the left a win and you know then you say okay can the gear up and provide the same energy and towards trying to stop whoever the next nominee yes that's the course of least resistance and maybe that's the politically expedient thing to do\nIs it the right thing to do though it's twelve forty four we're continuing to monitor\n'em as soon as there was a committee vote will let you know top forty four let's take a quick break this is Jeff Wagner WTO O. J. [laughter]\n...\nAnd and you're sitting and you've paid your money and you're sitting at the game and you you have somebody child or adult who is behind you and if and who who's been doing this and ... for the last half hour or hour hour and a half if that were to\nBe the case is it completely unreasonable for somebody to kind of turn around and say hey can you dial it back\nFor one for seven nine nine when six twenty but the accident mortgage talking text line I like I say the way this is presented is whoever this unnamed person is is the worst person in the world for having the audacity to ... to ... you know the the the kid who's cheering and [noise]\nI understand and if you just look at it and the snippet the kid is going to have a better better better swing\nAnd the woman turns around and asked her to be quiet I get all that my only question is if this had been going on for a prolonged period of time\nRight now is is it completely out of line to live said hey can you can you knock it off are falling for seven nine when six twenty but do you think let's start with Jeff and Fox my Jeff you're on WGM J. lo\nAs long as she didn't threaten the kids get would earn with MERS for 'em or something like that I think she's perfectly within our right to calm down\nRight if it if it had been going on for a if it had\nBeen a prolonged thing going on for a long period of time like the story I was telling about the guy who just screaming wife theater at the top of his lungs\nFor four quarters and the baseball game and the basketball game\nI don't even need that long I was on our three for you in situation where kids are jumping on a rickety cable I was trying to eat on and I I ask that for about five minutes very quietly and I'm very appreciative of their mom did not make me publicly public enemy number one\nGot to take a call here for one for seven nine when she's twenty mortgage talking ...\nLet me take a quick break rules lining up to call us at ...\n... is it possible that theory is a second side to this story and that is if this had been going on for a long period of time with the lady who have been completely you know out\nWhich she had been at least a little bit of justification and saying hey can you dial it back a little more ... is it is it's sort of like heart\nFlush and did anything she is the kid wants to do the kid gets to do for one for seven nine nine one six twenty back with more calls in just amended twin twenty five Jeff wetter WTO O. J.\nWas funny the M. J. friend they firmly says registered here for news [laughter] Hi Brenda what do you think [noise] I Would have said anything\n[laughter] [laughter] [laughter] mhm [noise] I don't think they were doing\nI think he should have had quite\nA bit and then again I nobody knows what does this have been going on for an hour or an hour and a half hour and ... at some point in time at some point\nAnd the dad said the gals dad said the girls that said hey you know we we we know she's loud we we come to the games because we we want to get loud you know that whole idea at some point in time\nTo do if your city if you pay for the ticket and you're sitting in front you have a right to kind of say hey you're affecting my enjoyment of the game or is it just as long as she's not being obscene and she wasn't she just got to do what she wants to\nWell I think mhm [laughter] right\nRight yeah I understand yeah\nYeah I don't know [laughter] not ever [laughter] special little little girl well there were only knows how to do [laughter] you know they don't actually when I\nWent to I guess she was like if you're\nRight you have to say that you see that that's I mean that's the difficult thing I mean obviously you don't want to be that cranky old person hey kid get off my grass at the same time and I I just saw this out there if\nIf it was going on for a lengthy period of time and you paid money in your in your seat\nAnd you you've got somebody to me does it make a difference if the special needs child where it's a Seventeen year old or it's a thirty year old I have a text here\nAre the ... version of this happened to us in the brewers game in the nose bleeds grown man was nursing his one beer for half a game yelling at the top of his lungs to various people in the stands my pregnant wife got up got in front of him and Rene came out for being obnoxious All right\nI mean I I guess out all I'm saying on this particular one is maybe there's more to maybe there's more to the story sometimes there is\nYou know when the weather's really favors in the playoffs and now they are in the hunt for the vicious title every game of a final regular fury season series right here in the NBA with Bob you for under false ... starting seizing at six thirty\nFive I Will be there meanwhile you can catch Sundays Packers game on Ninety four point five key TI country\nAnd our coverage kicks off at nine o'clock Sunday Morning sponsored by Catholic financial life yeah that's kind of interesting\nMelissa Barclay sunrise you realize there's nobody here today I like it it's like a wins roaming the hallway they ... out everybody management is going on everybody just gone I don't know exactly what's that is for us except for us absolutely which means you know we can we can get away with more stuff All right\nDon't don't you try to cruise Lucy shows you've tried to get away with stuff I I did this shows you probably are and I am the authority figure here now so that shows are aware of travel new are okay so here's the deal Melissa I Know you rent now but let's assume for the sake of argument that you own a home\n... sure right and and a lot of homeowners will be able to relate to this in the spring\nYou've got the house and in the spring you want to start your gardening you know you want to plant flowers and all that sort of stuff so one of the things that people commonly do is they'll contact lawn services or whatever and the order like like giant piles of\nFor example or or or dirt or you know right there you see that and they deliver it right you know like a dump truck full of things and then what happens is you go out on a Saturday afternoon and all the wheelbarrow full of the the dirt and you do the flower beds and stuff right right okay so let us assume that you are that homeowner and you have\nOrdered a big load of dirt poor mulch or whatever from the launch ... ... and they delivered the one and you've gone out and you know you've you've done all the work in the flower beds south and then you get the bill from the company\nAnd they build you for two truckloads of dirt instead of one oh okay okay All right so you've been built you got one truckload of dirt but you've been billed for to\nWhat do you do\nLike how they're not going to say let's say you only unload Edwin piling dirt and you charge me for ... I think a normal\nPerson than we do right and then you say you're you're you're you're not find yeah thank you well you're not going to say oh yeah like I pay car or whatever okay alright\nSimilarly let's say that you call up the lawn service or wherever and you order the truckload of dirt and they never deliver it they they just blow you off so you never get the dirt but a couple of weeks later you get a bill and they're charging you for the dirt what do you do that\nWell you call them and say they never show that I'm not paying the Dell\nOkay now group who's producing the show same situation for you are you with Melissa that you know you get one truck load of dirt you get billed for two you pay for the to\nKnow you pay for the one right All right you order a truckload of dirt they never delivered the truckload of dirt do you pay for that even if you get filled no\nOf course nobody in their right mind would do this right that's right no right no way that you know it would make no sense to pay for something\nThat you didn't get or to pay if you were built for two of something and you only ordered and got one you would make no sense nobody in their right mind would do something like that right\nRight and the unfortunate part would be if you prepaid he wouldn't want to do that and saying yeah you would\nBe starting to sit down and you didn't bottom line like you didn't get it you are being built for something that you didn't get and nobody and sometimes it might be that you don't catch it\nAnd so you inadvertently pay for it and then you have to try to get it back but but if you knew in advance that you were being built for something that you did not get\nNobody in their right mind would pay for that correct\nRight mhm alright Melissa grew and I are on the same page there which brings me to a story\nInvolving the Wisconsin department of transportation and I will tell you that story and we will discuss in just a moment it's one forty in such a quagmire W. A. T. M. J. [laughter]\nForty four or five of the the um J. are\nLucky Journal Sentinel has an ex suppose a up on their website now it is absolutely outstanding mark the tape I said that\nAll right story by ... ... now by by way of background\nI Know there's some people say we need to have a gas tax we need to have a we need to have total ways we need to have all this money roads are an awful shape my point four years has been I think tax increases need to be matters of a last resort and I am convinced that there is such incredible waste\nAnd below king and miss spending in the way we throw money at roads and give to road builders now that you could", "year": "2018", "show_name": "no_show", "city": "Milwaukee", "day": "01"}