{"month": "10", "state": "NY", "station": "WABC", "content": "And I W J Barnabas how\nWe offered the latest in Congress to breast health services\nIncluding mammograms ... grams genetic testing and breast surgery [noise]\nNot to mention peace of mind [noise]\nBreast health centers located throughout New Jersey [noise] finding is for\nMe the most the breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash manner\nMaking excuses is easy\nOur W tape of this house\nLet's be breast cancer together [noise]\nHealthy together\n[noise] feel younger with advanced bio identical hormone replacement for men and\nWomen I Am Dr slaves and and I am certified in advance by identical hormone replacement and my goal is to improve your energy help you live longer and feel great less dementia federal cardiac health and better sexual health lose weight and feel younger with advanced bio identical hormone replacement\nTwo oh one eighty two Fifteen hundred that's two oh one eighty two Fifteen hundred for n J hormones dot com\nOn election day millions of Americans will cast their ballots many for the first time it marks the beginning of a new era an era where we proudly participate in ... to\nThe check to check your voter registrations signed your polling place or get election information that the head count down at ... at the nonpartisan resource for voters of all ages background\nThan to leave the future is now and the future is Sonia ... H. E. A. B. C. L. U. N. T. T. I. O. R. G. today\nMost respected us force sunny so you have these [noise]\nYou know football baseball fantasy life\nFamous [noise] [laughter]\nSo [noise]\nIf you plan on selling or buying a home listen to this important\nMessage rex real estate is selling homes in New York for two percent total that's right only two percent not be outrageous six percent traditional real estate agents charge saving sellers on average twenty five thousand dollars as\nFully license brokerage rex lists on top of real estate website slugs Zillow truly a and string easy rex uses advance digital marketing strategies to find qualified buyers for your home to see if you qualify\nCalled five one six to one seven eight five nine nine\nFive one six to one seven eight five nine nine your dedicated rex team handles everything from photography and open houses all the way to negotiating offers and closing paperwork\nIf you want to pay just two percent you've got to sell your home with rex to see if you're qualified golf five one six to one seven eight five nine nine five one six to one seven eight five nine nine which is like this book which must have never wants to what they want to see what's going to fight\nThe winner of the Tour de France it all depends on the bicycle it depends on their vehicle\nBoth in a ten speed in the ... gonna win every time but but the race around the tray circle and the eleven year old winds every time you see it's not the driver it's the vehicle\nWhen it comes to generating revenue it's exactly the same if you have a job or a small business you are writing a trace it all you can only go so fast if you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race\nWhy do many people with no schooling and no advanced degree often become very wealthy simple they choose to only right ten speed\nWhen it comes to helping people create their next revenue model both for joining recommend income store as a can't miss when it comes to putting people in it tends to be\nGood your household or business using additional revenue model that doesn't solely depending on you if so\nYou need to check out income store dot com that's income store dot com [noise]\nReally\n\n\nCheese\nI've told you this before but you know if you have a car that has five thousand two hundred and fifty thousand miles you don't really have to pay higher repair bills even though you might do so if you don't get what I'm about to tell you\n... they are paid out close to two billion dollars in claims and they're ready to help you and so if you take your current and all of a sudden they say oh it's got metal filings or tomorrow or the carburetor shot\nOr worse yet you're going to pay thousands of dollars that's why you gotta get extended veal protection from car shield right we know what these things and of course today a sensor alone can be a thousand dollars or more but you also get twenty four seven roadside assistance a rental car or yours is being fixed for free\nSo you can save yourself thousands and future car repairs get covered by the ultimate extended vehicle protection\nAudio school age every car sixty one hundred eight hundred cars sixty one hundred\nAnd pleased bench and coats average or go to car shield dot com again coach the average annual saved ten percent on their policy you can't do without it that's car shield dot com coached average or call the eight hundred car sixty one hundred and mentioned coach average any doctor will\nMay apply\nAnd the news now I just got an email\nWhen you said about the bomber ... was ... we should have empathy for someone so beaten down being called a deplorable he lost hope you know that's an important point to remember I don't think anyone in the media is going to have any sympathy for this guy the standard line as oh yeah yeah well yeah we all agree this shouldn't happen well of course we all agree they shouldn't happen\nBut I Want to put you in the mind of a guy on the bottom if he is actually the park let's say you have nothing you have nothing to lose and the left wing is flooding America with illegal aliens who was going to steal the few remaining threads of social welfare the remains for you\nYou're a strong guy in your own heart but you really insignificant that society and your calls every name under the sun you're left that\nYou're you're like a warm towards your guy like George Soros they all think you're some on wash Nazi you start to build up your hatred you know how many movies do you have to see about people on the bottom until you finally understand that if you know what ... said the great nineteenth century German\nA poet when he said if you take a man as he gives you make them worse\nIf you take a man as he could be you can make him better I never forgot that\nWhen like you know I Try to raise children and children will ACT UP and do terrible things sometimes take your car for joy ride while you're sleeping you know races on sunrise I weigh and bring it back with the Koch slipped\nYou can get mad at you kid and you could scream at him and call them every name under the sun what you're going to do is going to get worse he's going to get us back up and become even more rebellious\nSo I'm warning you left us especially Maxine Waters she doesn't listen to the show she's got to be told to shut her mouth and stop provoking hatred towards everyone\nOn the other side of the aisle all of you on the left to think that you want to victory today it's a short one victory you didn't really when a victory here in this situation what you've done here is expose yourself\nFor the provocateur tours that you are and the more you put down people on the right by calling them names deplorable and whatnot\nThe more you're going to provoke people like this\nOnly the next one's may be a a little more potent than him which is a terrible terrible thing to imagine and as I said to your flashers don't rape\nAnd there are a lot of people in this country who are so fed up with the machinations of the left with dissolving our borders was betting on our culture\n[noise] with the ... version\nThat is offered as normalcy in our schools for the filth in violence coming out of Hollywood [noise]\nDon't trigger them you should not triggered them five ... enough they're very dangerous [noise]\nJoy ... feet by ... four hundred and Seventy five for seven due to [noise]\n\nHi it's Rena Cosby from Curtis and Cosby did you do the best time to love your family\nAnd group holiday travel is now\nFor all of your hotel need look no further than hotel plan or ... pounds a day or number one and group travel plus they have a free event planning service to\nMake sure your trip his seem less hotel minor dot com is sure to get you the best rain during the busy holiday season color didn't dare travel planning experts that hotel plane or dot com today to ensure the death rates around the world\nBalance of nature's fruits and veggies in a capsule\nI spent years studying how to make this the best I didn't make this because I wanted to make a company\nOther companies are starting to catch on to this and I buy every single other product that comes out so I can look at it and see it in test it and I fear that people will buy some counterfeit don't be fooled this is the real stuff we have absolutely the best process and I can say that because we purchase every single one check 'em out\nI don't mean that was that I'm walking nothing ever worked for the first thing that's really what nothing compared to what the benefits of balance of nature\nFor a limited time use discount code W. A. B. C. and we'll take thirty five percent off your first preferred set of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nUnjust civil booed and I've always believed in the quality in service of the great men specialty stores or the past and now you can experienced that first hand with distinctive one of ... shootings impeccable tailoring and luxurious fabrics from the finest Italian meals and while you're at it\nBe the man who makes the suit and try a custom made offerings of tuxedos suits and cashmere jackets from our black label collection so meet me at the corner of quality in style or if it's easier forty ninth and Madison Avenue\nPapal ... Rosenberg from burning and sit in the morning which are the Joseph Abboud flagship store at forty nights and Madison Avenue inexperienced exceptional quality style and service out it's very best\nOr telling people with their health care plan that he was going to kill Republican Congress people Bernie Sanders has been the prior month saying that the Republican health care plan was going to actually tell people this is something that Bernie Sanders that with Bernie Sanders responsible for the crazy guy\nNo Bernie Sanders was not responsible for the crazy guy now and you want to say it's a minute let let's say that a President Trump supporter wet and just punch the protester I Would say OK lot closer linkage between the rhetoric President Trump has used\nAnd that particular action just as I say there is a lot closer lately who linkage between Maxine Waters taken from people in public places and Democrats going in confronting people in public places\nIn St Louis one activity is not necessarily incitement to sending bombs in the mail or shooting people up on a rational baseball field but media have let the particular conclusion Bernie Sanders in two thousand Seventeen was completely in a sense of what the guy did agree\nAnd then they say well a crazy person like an obvious crazy person is president from responsibility what happened here and that is absolutely a bunch of crap\nAnd dangerous crap to it because there's a lot as well as the climate of polarization the climate that June ... in this country it's just a bad mark the climate of one of the nation\nAnd we have here in the United states and that's all President Trump's fault so maybe we ought to censor what people on the right or say maybe one claimed that people on the right are uniquely evil they understand that claim actually radicalized yourself at the best thing is they were there were two sided about this they were objective about that\nAnd what they said why wasn't everybody needs to tone down the road reference standards and you can turn down the rhetoric\nDemocrats need to tone down the rhetoric Republicans need to tone down\nRegardless of whether it incentivized violence we do all those things you can have a country if not then we are in serious\nSerious trouble now speaking of\nNonsense that's being pushed by the press the the press coverage of the caravan is is really quite astonishing\nSo NBC News I mean speaking of media bias when president from person to media bias and then folks in the media to say there is no such thing as media bias had there he attacked media NBC News made their head or on Twitter an actual picture an actual picture of the Caribbean the migrant caravan\nThat as simply propaganda that is not news that is propaganda that is these are victims\nThese are people who are approaching the border and this is President Trump's fault and then you see the the rhetoric on the caravan issue obviously being being exaggerated on both sides\nSo here's President Trump tweeting about the caravan issue yesterday and I'll explain what's wrong with it because when I first read ... I didn't really know what was wrong with it\nAnd then I looked into it a little more and there's a problem with that we in sort of effect it's correct but in but in practice it's wrong\nTo President Trump's weeds out to those in the Caribbean turnaround we're not letting people into the United states illegally go back to your country and if you want to apply for citizenship like millions of others are doing so people pointed out that the people who are trying to get to the southern border of the United states are applying for asylum\nYou can't do that unless you're already in the United states or us more you can actually apply for political asylum from the country of origin however President Trump to actual suggestion is that these people are not actually looking for political asylum instead they're looking for economic opportunity which means that they would be Raj won't be filing papers if they were seeking political asylum", "show_name": "The Drive at 5 with Curtis Sliwa", "year": "2018", "city": "New York", "day": "26"}