{"month": "10", "state": "TX", "station": "KTDH", "content": "Payment is made possible to listener contributions\nFrom citizens too concerned themselves with media that matters is the phone membership campaign print you please remember the value of your support the knowledge grow\nCommunity gets today and H. P. P. R. data lurk think\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie de ... uh service the high plains public radio available everywhere on line at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support jab at H. B. B. R. dot org for details [noise]\nHello and welcome to classical guitar alive until you more as classical guitar alive is broadcast worldwide thinks that the generous supported the ski foundation in Charleston taco Parker only foundation in McCain penny Morgan can't thanks to gift in living memory of Adam branch or [noise]\nThanks for joining me for this week's\nEdition of classical guitar allied with music by the ... ... T the new guitar concerto titled keep calm and carry on by Portuguese composer Patrice he'll just sealed but we'll start with music by remote performed by ... even still guitar duo ... only one though\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\nOh my God [noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] ... na\n\nNa down there that day\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\nA\n\nLot\nOf people that\nBe eaten still guitar duo up in this week's edition of classical guitar along with the arrangement of ... the promos ... will do will continue is more music from the baroque is the Oregon guitar ... they're performing the arrangement of the all these ... D major oh\n[noise]\n\nNo no\nNo no no no\n\n\n\nIn New\n\nYork\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n\n\n\n...\n\n\nNa\nNa\nNa na na na\n\nNa na\n\n\nNa\nNa ... and\n...\n\nNo\n\nNo\nNo no\n[noise]\n\nJak Marshall's and the poor guitar featuring guitars Chris for parking in the studio orchestra\n\nYou're listening to classical guitar\nAlive I'm Tony more ... more information about this week's program you can visit our website classical guitar alive dot org you can also find out about some of the other work\nWe do including our music and medicine program which presents classical music performances at no cost to audiences in hospitals in hospice says you can also find out about our exciting new public television program for PBS stations nationwide that's called American Classic that address again is classical guitar alive dot org\n[noise]\n\nDo some period performs parties know CNN number one [noise]\n[noise]\n[noise] [noise] [noise]\n\n\n... ... ... ...\n... ... ...\n\n...\n... ...\n... ... ... ... ... ... [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\nKeep calm and carry on the title of a new guitar concerto by ... Michael ... was the guitars with the watch next ensemble directed by ... by ... an excuse music for solo guitar by Spanish composer Antonio Garcia brio prince whose ... performs his Mediterranean fantasy\n\n\n\n\n\n\n\n\nNo no\n\n\n[laughter]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]", "show_name": "Classical Guitar Alive", "year": "2018", "city": "Dalhart", "day": "12"}