{"month": "10", "state": "TX", "station": "KTDH", "content": "Public radio is a great way to receive and perceived information that matters that the power of the spoken word that's the power of public radio\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie de ... uh service the high plains public radio available everywhere at H. P. P. R. dot org you're listening\nTo high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find an occasion to thank them for their support [noise]\nHello and welcome to classical guitar alive I'm Toni Morrison classical guitar alive is broadcast worldwide thanks to the generous supported the ... foundation in Charles and taco Parker elite foundation in my ... Morgan in thanks to give to loving memories of Adam brasher [noise]\nThanks for joining me for this week's\nEdition of classical guitar live this week's program has devoted primarily to one large work the Carmen ... by Peter bringing are based on the famous ... we'll start with music from Brazil John Williams intimacy can perform jungle bipolar ability\n[noise]\n\n\n[noise]\n\n\nJohn Williams and Tim Kaine open this week's edition of classical guitar allied with the ... go by Brazilian guitars composer polo Delano T\nThe music of yours BJ's opera Carmen continues to thrill audiences ain't inspire other composers slow what composer Peter brain or rather guitar concerto based on the sperm besides Carmen we'll hear the Carmen\n... performed by the polish national radio symphony orchestra with guitars Norbert craft Peter brain or is the conductor\n\n\n\n[noise]\nMm\n\n\nNo no that's one of the day [noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise]\n...\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nMm\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\nMm Mm\n[noise]\n\n[noise] Mm Mm Mm\nMm Mm\nMm Mm Mm Mm\nMm\nMm Mm Mm Mm\nMm Mm no no no\n... ... ... ... ... ... ...\n[noise]\n\n\n\n[noise] Mm Mm\nMm Mm Mm\n\n\n\n\n[noise]\nNo no no no no\nNo no no\nNo\n\n\n\n[noise]\nNo ...\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n", "show_name": "Classical Guitar Alive", "year": "2018", "city": "Dalhart", "day": "21"}