{"month": "10", "state": "OH", "station": "WCPN", "content": "[noise]\nThis is jazz after hours from public radio international the freshest new jazz on the radio here every weekend on P. R. I. with two nights of the jazz being played in recorded all around the country this fall\nAnd I have some great music to share with you this weekend my name is Jeff handily\nAs you probably know pianist Ethan ... has left the bad plus and striking out on his own one of his first projects is a duo album was saxophonist marked Turner it's coming up this hour also John ... eastern Randy Becker I'll play their new music and tell you about a couple of shows where you could see them play live\nAnd so much more we're just getting started one quick note before we roll some music\nNo matter where you are later today as long as you have a connection to the Web you can enjoy a rare New York city performance by drummer Jerry Gibbs and his group Suresh or people they're playing live in the village tonight it's small and the show will stream live from the club\nIt's a fun and free way to visit one of the coolest New York city jazz clubs and immerse yourself in some great lived jazz just browse through the smallest website\nOur first new music tonight comes from a bunch of friends of the show nine friends to be exact they comprise the no net non that led by Lucas piano ... been together about ten years\nAnd this is the third album from the known that knowing that we'll begin with a tune called horse of a different color it's a reference to the wizard of Oz and the tune got its start with a request from Lucas ... to the members of the band\nWhich key they prefer to solo in and then Lucas wrote the tune the spotlight each member of the band in the beginning\n\n\n\n\nDay\nA\n\n\n\n\n\n\nJust as\nBad for ...\nAnd ... and ...\nHad never heard of\nI should\nOn and and\n... and\n\n\n\n\nUnder the direction of match home Quist will listen to one of three ... Korea tunes on the record this is crystal silence and the soul of us are Randy broke her on ... on piano Randy\n\n\n\n\n\nMm\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[laughter]\n\n[laughter]\n\n[laughter]\n[laughter]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\nNo\nKnow the answer to the teachers and students are ...\n...\nFor the people\nWho were from the ...\n\n[noise] [laughter]\n[laughter] [noise]\nI can tell\nHe was ... me ...\n\n...\n\nHas been\nMaybe ...\nTo be\nThere to be in love\nThe\nFood no\nNeed\nTo tell them oh\nThe street\nJury\nAnd some time\n\nI both the ocean\n\nIdeas [noise]\n\n[noise]\nWell come back for another hour of jazz after hours on public radio international this is our weekly new jazz feature on PR I in this hour of the show I've got some new music from in demand drummer Rudy roasted\nListen to the Count Basie jazz orchestra still performing after all these years guitarist Bobby Broom pianist Sullivan for dinner\nAnd we begin withdrawing bonus John fed chalk who has a new quartet album called reminiscent and he also has several shows coming up in the next few weeks I'll tell you about a very important one with the wind in search of jazz orchestra after his first set of music you'll\nHear John fed shock on trombone John to me a piano Jimmy masters is the bassist and they'd rather check the drummer the John ... starts off this hour of jazz after hours\nI'm sure that\nAnd the\n\n\n\n[laughter] whoa\n\n\nRead\nThe\n\n\nBallot\n\n\nTo just about\n\nThen\nWere\nIn\n\n\nThe ...\nTerm will do a\nNa\nNa\nNa na\nNa na na na na na na na na na na na\n\nNa na na na na na\nNa na na na na na na\nMm\n... ... ... you\n\nUm\n\nDoing my arm\n...\nDay\nMm Mm Mm\nMhm mhm\nMhm mhm\n\nMm\nMhm mhm\nMhm Mm\n\n\n\n\n[noise]\nYeah John Ellis on that track played bass clarinet you also play saxophone on several other tunes on the record thank Robert just the cellist and Joe Martin the bassist on the album flatbed\nPianists ... has a lot going on these days he's not only teamed up with a seal McLaurin cell bond on a new album\nBut he's also got a new record of its own called moments preserved it's a piano trio record basis I mean ... and drummer being climate this pep talk new music from Sullivan for their next up on jazz after hours from public radio international\n\nA person to to\nTo to to\nThem to\nMe [laughter]\n\n[noise]\n\nUm\nDay\n\nMany men\nWho\nHave money\n\nBang\n\nAnd\n[noise]\nThanks for hanging out so late to hear the new jazz on P. R. I. you've tuned in for jazz after hours on public radio international my name is Jeff handling there should be a very ...\nYou're Davis great Diaz Antonio adult Christian McBride coming up in this hour the show\nWe begin with a band called from terrorists imaginary\nAnd their record Colombia Brazil this is ... ... ... Benjamin top cannot be oh joy out top cannot base and Sergio read that drives the gold from terrorists imaginary as the show is jazz after hours\n[noise] [noise]\n\n[noise] Mm\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise] nah\nNah\n\n\n\n\nDa da\n\n\nDa da da\nNa na na\nNa na na than\n[noise]\n\n\n\n[noise] [noise] do you live\nClose to that\nCame to man you'll raven tennis well he'll opinions span your condition she can last a little bit [noise]\n\n\n\nTo the U.S [noise]\n\nYou're not a bad guy\nAnd you know ten to nine and ... ...\nThe\nSame time many Chad\n...\nNa na na\nNa\nNa\nNa\nNa na na na na na na Demi Moore do go\nTo your last caller cage when we'll re didn't have to have to give your opinion then no\nOne could come and then\nPut in the ... the\n[noise]\n\n[noise]\nThat's been a long term thing\nOrder\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\nHa ha ha\nDa da\n\nNa\nNa\n...\n\n\n\nTo\nBe\n[noise]\n\nGoing\n\nMan\n\n\nKnow\n\nTrying\n\n\n\n\nTank and\nOr\n\nDa\n\n\n\nDa\n\nDo a\nBang bang bang\nBang bang bang bang bang bang\nBang bang bang bang\nNa\nDa da da da\nDa da\n...\n... [noise] [noise]\n[noise]\n\nJazz through the night on public radio international business jazz after hours of PR I\nThis is our our for NIH dolls who are staying up late to hear the best new music on the radio I've got lots of at this hour I'm going to jump right in I'll tell you I've got Mike Freeman ... I've got ... plow and mark Turner coming up in this hour of the show the new one from Cecile McLaurin sell bonds and Sullivan foreigner\nTrombone player you've heard before on the show JT ... and Ben window begins it with more of his season's project with Aaron Parks and piano glad heck swimming on guitar Matt brewer on base congratulations mad on being the newest member of the S. F. jazz collective and Eric Harlan is the drummer\nMay starts us off here from Ben window and the seasons on jazz after hours\n[noise] [laughter] [noise]\nMhm mhm\nMhm [noise] mhm [noise]\nMhm [noise]\nNeed\nTo those\nDo\n\n\nFirst thing you need a new day\n\n\n\nBird\n\nNa\nNa\nNa na na\n\n... ...\nThe ... who who who\n\nWho\n\nWeekend and\nNa\nNa na na\nNa na na\nNa\nNa na na\n\n\n\n\nNa\n\n\nNa na na na\n\nNa\n\n[laughter]\n\n\n\nNa\nNa\nNa ...\n...\nHerd Francesca that girl the featured as vocalist basis was milk Russell the drummer Carlos Cortez Diaz ... in\nSan ... which has the second album called people in places and the tune pitch the rich the dedication to his mentor and inspiration and special guest artist on the record rich Perry\nSam ... jump piano with rich on tennis\nStage at the blue note jazz club in New York City and Marshall jokes and the w._b. are big bad did switch back that comes from their latest release together called always for\nOr moving forward through the hour here in fact toward the end of the show I've got toward Gus just a pianist and a new record called the other side he's currently out on the road with a very busy schedule touring the u._k. and Ireland\nFrom the other side will start up this next set with the tunnel toward on piano secret whole base and you are like ... on drums is this new music from toward ... a jazz after hours\n[noise]\nAh\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\nMm\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n\n\nMm\nMm\n[noise]\n[noise] [noise]\n[noise] [noise] [laughter]\n[noise] [noise] [noise] [noise]\n\n[noise]\nOf them are\nGoing to be the loser and you're\nAnd just to be a good thing [laughter] [noise] do\nDo do you\nThink [noise]\nIf you're a\nAll that\nThey have been going", "show_name": "Jazz After Hours", "year": "2018", "city": "Cleveland", "day": "27"}