{"month": "10", "state": "GA", "station": "WUWG", "content": "To members supported G. P. P. we're in Eighteen station radio network you can listen online or TPP dot org and you can find us on Twitter at my GP beep and Georgia Public broadcasting on Facebook thank you for listening\nIt's an online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nMORNING EDITION and on second thought ...\nSplit their support make everything you hear on the ... fault if we didn't hear from your during our fall fun tie your contribution now will still make a difference [noise] please take just a couple of minutes to support the programs you rely on them enjoy on ... and do your part now at whatever level is right for you\nGood at ... dot org and click donate and thanks so much for your support of Georgia Public broadcasting\n\nFrom the University of west Georgia Ninety point seven FM Wu WG paying W W G. H. G. Carroll that part of Georgia Public broadcasting radio network\n[noise] [noise]\nHalloween is just around the corner [noise]\nDo you have a costume picked out\nIf not this music by Sergei Rocky Mount enough might inspiring you\nGet to pick so gloomy evening next to the shores of a dark body of water in the distance as a small rocky island from which both men is traveling back and forth it's the ... of the dead [noise]\nYou and I are going to travel there musically in about six minutes I'm Garrett McQueen rock mono style of the dead and more coming up on music through the night\n\nLive from NPR News in Washington I'm Jim how\nHurricane Michael slammed into the Florida Panhandle with winds of one hundred fifty five miles an hour on Wednesday splintering homes and some merging neighborhoods before continuing it's destructive church inland across to south east\nFranklin County sheriff VJ Smith ordered a curfew from sunset through sunrise to give 'em urgency cruise the chance to clear the debris\nCatastrophic damage here there's trees everywhere\nDrawn to water a day or two National Guard they have a hard time getting there to some of these roads are\nSesame seed can even travel across\nYou're on your water a day or two National Guard there would have a hard time getting their tail on these roads\nWe assessments eighth or you can even travel across\nThe storm also knocked out power to hundreds of thousands of homes and businesses are again Michael has we can do a tropical storm as it moves across Georgia and heads northeast word in the Carolinas NPR's Rebecca Hersher reports warm water in the Gulf of Mexico fuel the storms initial category for intensity\nAnd the hours before it hit the Florida Panhandle hurricane Michael got more and more intense it's wind speeds got higher its core got tighter and the barometric pressure inside the storm dropped lower and lower Michael is the most powerful hurricane to hit the panhandle since recordkeeping began in the mid Eighteen hundreds\nHurricane Michael's increased intensity was driven by hot water and the Gulf of Mexico\nThe surface temperature and the Gulf water in the mid eighties is warmer than usual and that's part of a trend global climate change is causing our oceans to heat up and that helps fuel major hurricanes Rebecca Hersher NPR News\nI'm Chinese intelligence official has been arrested in Belgium and was extradited to the United states to face economic espionage charges according to an FBI indictment NPR's Rob Schmitz reports\nThe extradition of ... is a major escalation of the Trump administration's effort to crack down on Chinese theft of us technology\nShoe who went by several aliases belongs to China's main spy agency the ministry of states' security sixteen page indictment details or dramatic sting operation to lure him to a meeting in Belgium to obtain proprietary information about Jack fan blade designs from a GE Aviation employee\nAnd said he was met by Belgian authorities and put on a plane to the U. S.\nG. ... was a ripe target because it builds a jet helicopter ... for the Pentagon shoes apprehension is the first time a Chinese intelligence official has been brought to the United states to be prosecuted and tried and an open court Rob Schmitz NPR News Shanghai\nUs stocks plunged Wednesday as investors fearful but rising interest rates and trade tensions good her company profits ramped up their selling of high flying technology and Internet stocks\nThe Dow Jones industrial average fell eight hundred thirty one points is worse loss on eight months apple and Amazon to most valuable companies in the U.S on the five hundred each have their worst day in two and a half years [laughter]\nThis is NPR News\nWell companies and they have some ... five hundred each have their worst day in two and a half years so this is NPR News\nNew study is suggesting that for women giving birth and the United states the risk of having a life threatening emergency during or after childbirth largely depends on their race and ethnic origin NPR's Rhitu Chatterjee reports\nEvery year over sixty thousand women experience life threatening emergency requiring a blood transfusion or other life saving procedures jarring or off to try to buy\nA new study looked at women who underwent that procedure between two thousand and twelve and two thousand and Fifteen steady all the ... the ab ... is an obesity land at the University of Michigan\nOur data show that racial and ethnic minority women are more likely to be a fact that\nFor example healthy non Hispanic black women have Seventy percent higher risk of complications than white women and that address is even higher for women with chronic health conditions like diabetes or hypertension the study appears in the general that tricks and gynecology read their tragedy and can you\n... have charged a New York man with building a two hundred pound bomb in his basement prosecutors say he planned to detonate the device on election day on the national mall in Washington\nFifty six year old bull Rosenfeld was charged Wednesday with unlawfully manufacturing a destructive device and interstate transportation and receipt of an explosive\nThe FBI said in court filings that Rosenfeld confessed ordering large quantities of black told her over the Internet and that he constructed smaller explosive devices in order to conduct test that nation's [laughter]\nI'm Jim ... NPR News in Washington\nSupport for NPR comes from Americans for the yards committed to transforming America is communities through the art and art education supporting the nonprofit art industry which employs four point six million people nationwide learn more at Americans for the arts dot org\nToday's classical music is supported by T Rowe price suffering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nCigarettes modern off with confidence that death would come for him and all of us and he wrote this next work with that idea in mind this is ... ...\nIt is to get really monitor what's called ... that that would come for him and all of it and he was just next work with that idea in my ... I Love the good\n[noise]\nA\nKnew who\nKnew\nYou can do anything and everything they\nIn a nearly ... ...\n\nFor a\n[noise]\n\n... once described it work is six feet in two inches of Russian ... that was the eye of the dead by ... ... ...\n... ... alongside being a brilliant composer was the piano ... she was so well he never wrote a large chamber work steady looted the piano and those are Robert ... did and you'll hear it next\n\n...\n...\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n\n[noise]\nOh\n\n\n\n\n\nUh\n\n[noise]\nI'm Garrett McQueen good evening [laughter]\n\n\n\n\n\n\n\n\n\n\n", "show_name": "Classical Music", "year": "2018", "city": "Carrollton", "day": "11"}