{"month": "10", "state": "AZ", "station": "KJZK", "content": "\nYou're listening to the Arizona community radio network on eighty nine point five FM kj see a drink any point on FM cage ACT Prescott in Ninety point seven that sounds K. J. C. K. king the king the center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating veal street theater\nWhich will be the center for culture creativity and community\nIf you'd like to contribute time or money please visit meals street theater dot com or call Christina Mickelson at three eight five three one nine five three eight\nSupport for the Arizona community radio network is provided by\nArizona the drive through wildlife adventure park in Williams, Arizona view by mountain goats and sheep and black there from the safety uncovered of your private vehicle or travel coach watch playful Barrett cubs up close at the end of your two or Arizona\nOn I forget highway sixty four in Williams, Arizona dot com fine the public radio programs you enjoyed that didn't for ventilation editor today and log on to kill in radio dot com at church or kj ca and the Arizona humidity radio network that listen any time on your smartphone\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five FM kj see a ... point one of the cage ACP rescue Ninety point seven F. M. K. J. C. K. king\nThe king of the center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the veal street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit meals street theater dot com or call Christina Mickelson three five three one nine five three eight\nPoint for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary in Valentine, Arizona thirty miles east of England or historic route sixty six see over one hundred Seventy five rescued exotic animals lions tigers cougars Panthers leopards monkeys and more open every day no divide except you today holidays do recruit sixty six\nFind useful information all the public radio programs you enjoy that inform entertain educate ... plus a link to our live live stream at kj Z. A. dot O. R. G.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou're listening to the Arizona community radio network nine point five FM cage a drink and you point one FM cage ACP crash in Ninety point seven F. M. K. J. C. K. Kingman\nRadio when do you know from years this Saturday PM it's a funny show you like funny it's also full of valuable advice forget limit and try and\nFill your morals\nDo not like a moving train [noise]\nVoid all sense of existential ...\nJoin us for radio in San Diego Saturday at eight PM\nSupport for the Arizona humidity radio network is provided by a guy who was who will\nWear chef's theory bar ban staff prepared delicious lunch and dinner Andres end exotic tapas or you're done enclosure enjoy the heated patio and the whole bar with a ... hour week days five music Thursday and friday with jazz well someday three sixty was to go to in St in Prescott [noise]\n[noise] [noise] [noise]\nLotteries you're reliable source for local news and sports Ninety One point three FM Flagstaff amongst park\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nS\nYou know\n\nKnow man I'm\nI'm trying I'm at the Mayo\n\nClinic day\nAny animal in a no\nThe\n\nI'm ... I'm a new\nHobby when they died\nNa na\nNa na na\nNa no\nSee it in two and three\n\n\nDonaldson now let me I'm yeah\nI'm trying my God thank God\nI mean I'm In my day job\n\nA fever Darnell Guthrie's song says city of New Orleans from ... lullaby\nDennis ... he gave us a song that was used in the descendants and the and in front of that lake street dive by this shame shame shame from their new album free yourself uh he's ... and if you're just joining us welcome here's ... school by with\nI cannot escort team on the reality that we didn't choose\nHand though man let's\nGoes can down the multi over\nYou know and then\nRound holes the health care\nThing is I suppose they let\nIt but in the\nWhen he was going on about\n... yeah you really want\nAnd then they gave him all the\nGold mom\nThat day again and then go and you\nAll the ...\nOh\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five K. J. C. A. Drake Prescott valley Ninety point one cage ACP Prescott Chino valley Ninety point seven K. J. C. K. Kingman Boulder City Nevada\nAnd on translator K. two one seven eighty Flagstaff month park in Ninety One point three at them [noise]\nUsually are I news editors euro sixty seconds up to a batch\nElected from the bottom of the Grand Canyon as tested positive for revenge or commercials showed that visitors ever recorded\nAn object can bats along the Colorado River no one is known to have come into contact with the rabbit that it was taken from the federal grand jury in late August although her she'll say rabies is preventable in humans that they seek medical treatment ever being exposed to a rabid animal it can be deadly otherwise visitors at the canyon are told not to approach or touch wildlife\nReport any animals that looks sick or acting strangely to show one hundred sixty animals have tested positive for rabies around the state of Arizona so far this year both of those will match gumption imported from the news editor at your six to Jack it up\nSupport all the Arizona community radio that brings provided by cable one you're dependable local source for digital cable TV ONE Hubbard Meg high speed Internet and unlimited phone service within the continental United States when you get all three cable one services you get a bundled advantage to learn more\nGo on line to cable one dot net table one in yellow by county\nSupplemental message was on the radio and Cindy to this Saturday pm that's not the luminal you just said it right that limb mental pressure yeah you have to do it like this [noise]\nAlso but out women on message listen to radio in the Saturday they ... him right here on the Arizona community radio network [noise]\n\nHello I'm married last year with the b._b._c. news the authorities in China have legalized to use it re education camps in the western region if she young saying they want to transform people have been influenced by religious extremism that's been growing concern about the disappearance of weekend listings and she and John\nUn human rights committee recently had that China could have locked up a million people his age ... Michael priests\nThat cold vocational training camps which makes them sound like people that are going to get woodworking skills or something like that but there's also a components in them about re education is quite clearly about that it's about transforming religious extremists thinking the way people act\nCorrecting behavior change in psychology so this is really the first time is up until now the Chinese authorities about me today being doing something in change and but not getting as real details he sees it this time we've had real details about what's going on that\nChina has gone away to campaign against Islamic practices across in GM wants to stop the use of how long the products that are not food we regulations also make it clear that most women up on for wearing veils\nTigers media of shame video images that they say may shed light on what happened to the missing Saudi journalist democracy well gee Saudi Arabia denies that he was not it was because she don't she hasn't been seen since the end of the Saudi comes soon as he is ... more than a week ago\nIn the first age sixteen Saudi officials and see that rising McLaughlin reports\nCc TV shows their arrival in Istanbul by private jets hours before Mr ... g's disappearance the scene checking into two hotels and they the Saudi ... that booking with for several days but they left early\nBlacked out vehicles are shown around the ... moving to the consul general's residence around Ninety minutes off to Mr ... did they contain his body\nTo two planes flew back to rehab that night one vi do by the other vi Cairo\nA quote in Britain has identified the highest spending why should they jailed international banker I sometimes talk to the new anti corruption law\n... whose husband was convicted of defaulting millions from Azerbaijan ... spank spend more than twenty million dollars at the time it's over a decade\nDonate ... county has more details under the terms of the case ever unexplained welcome to Mrs ... but most now tell the national crime agency how she and her jailed husband became so rich they both deny wrongdoing\nBut if they fail to get a clearer account the agency will apply to these that property this is a test case with investigators planning to seek knowing more or just in the months to come\nIn a statement his ... his lawyer that she intended to fully engage with the judicial process and that had been no funding by colds that she had acted criminally news from the BBC\nFor K. A. W. see names in Yuma I'm can transcend\nThe city of humor wants you to imagine a day without water today goes this is my fourth annual national imagine a day without water\nA day for people nationwide to understand the role that want her place in their daily lives city of ... assistant director of utilities Jeremy McCall says the days man to raise awareness about the importance of a vital resource that you may barely remember even using\nYou know you don't remember brushing your teeth although you did it kind of take it for granted we really pride ourselves as the the local utility company providing that level of service you turn on the water you know it's good you know it's clean you know it's their\nSusanna Hitchcock is more water quality assurance supervisor she says imagine a day without water is also about infrastructure\nThat means our treatment plants and our distribution system to get the water to the homes businesses and industries and then also the lines to take the waste water down to our\nFor treatment city officials\nSay it said twenty four hour a day job providing city residents without reliable safe clean water as you may not even think about today though they hope you do northern Arizona university\nScott British students had rented out a dorm room on air BNB Arizona daily sun reports so university spokesperson says the school contacted the vacation rentals site add\nThat listing remote student remains rolled at the university but it's facing disciplinary action for violating school policy the room had a single bad and and attach bathroom student gay renters access to the residence hall\nHow'd you get fish will soon university police recently told the unauthorized gas to me\nI'm Kevin Johnson gay double you've seen a ...\nMillion\nA long\n\n[noise]\nShe told me a little more than\n\nMean you\nMake you\nWhat I Do not\n[laughter] and I don't\nNeed to\nTo me [noise] law\nWhich\nWas nice [noise]\n[noise] [noise]\n[noise] no I\nActually got an\nNot move\nLaw\nLaw or to try to shake down in\nBattle and I\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\nNa na\nNa\nNa\n\nCall you know\nDream when\nStreet and the ...\nThe ball and parents\nDo you know you're you're worried\nDa da da da\nDa da da da da da da da\nDa da da da da da da\nDa da and\nFrom there to be a\nI mean McCain does\nNew Jersey I\n\nTime [noise]\n[noise]\n[noise]\n\nAt the time they were\nTo\nTake\nA pay the bills\nAnd I don't\nDa da da da\nDa da\nDa ding\nDing\n\nNow that\n\nThe job you\nCan tell you what\n\n\n\nDo you let me go in and it was when I saw\n[noise]\n\n\n[laughter]\n[noise]\n\n\n\nNo no no I don't think\n\n\n\n\n\n\nGod\n\nWell that's a band called the tune yards from their new album I can feel your creep into my private life that with heart attack as we continue with the bridge on a Wednesday morning before that the bond brothers with to talk from their family style album\n... forty seven and we started that set all with automobile attract a Duke and the drivers we got a lot of music to squeeze in his hours are not going to do a lot of talking you're listening to border radio Thirteen twenty K uh what they knew it was a program called the bridge I've got music from no Gallagher coming up in just about a minute\nToday's border radio days sponsors ... art center announcing the Eighteenth annual tribute to me this award ceremony this Friday evening October twelve at seven o'clock in the historic human theater\nThe words will be followed by a VIP black tie reception with live performances hors d'oeuvres and silent auction at the ... center tickets you must show tickets dot com\nBroadcasting from the campus of Arizona western college for more than forty five years this is thirty twenty am border radio and border radio a easy ... or\nWilling to St Louis ... generally\nI\nThey got their first real bad\nAnd they have a a dirty shoes they're out in June ... stone and they are trying to you\nNeed to just bash regionally there and they don't\nBring him too much going\nVisa worse to buy\nHim a\nWhere she has she\nDoing the right for joggers they are dabbled\nBut\nAnd have a bad man back in\nArea and saying\nLook back now but it'll guide and I\nWe were to buy [noise] you\nBetter than they are under the only job dollar jobs you can buy you know\n\nBad guy\nAnd and now we're going\nTo be very embarrassing to go out and do\nBank I don't know why do you rent\nPlane attack on\nThe\nOf school and I'm I'm a city channeling\nGallon you\nOut and I and\n\nKnow\n\n\nI can\nThey did when he left over from\nKids to do is you and\nIn the job for\nAmish Tom and Tom ...\nRight to know how\nAm no no and the way they are very limited when a when they've been\nDown there is no no no you\nTerms of that\nLining up\nSome on out there that\nMet ...\nThey\nDid that yeah\n\n\nThey might\n\nOf the show\nEach any Franco there with the title track from around that came out last recall Biden area and you're listening to bridge a Thirteen twenty A. M. K. O. F. A. in Yuma\nAnd we are border radio before that no justice to bend but don't break chip speaker did know DVD that's when his thinking and textures album and we started that set off with no galleries I fly birds that are no Gallagher's project after I'm awake just broke up we heard if I had to go\nAnd we're going to take a short break and then I've got a lot of track with Dale Watson and Lone Star so stick around\nBorder radio is supported by young sounds of Arizona a nonprofit Utah Jazz program helping make the show easy music five eighty six possible every Friday evening so I've been on board or radio young founder sponsored in part by the Phoenix federation of musicians local by they need to\nLearn more young sound dot org and young sounds of Arizona on Facebook\nThanks for listening to border radio thirty twenty am and you and border radio is he going to work we have been a service of Arizona western college for more than forty five years oh\nOkay it's American roots lie than words and music from ... trucks Pam Randy Newman engage in fiddler Doug ... and the meter\nWill be on the rock and roll road onstage at the house and we'll\nHeritage but I'm the bits are joining for American roots live\nThan a morning from eight to ten on board or are you thinking Tony am\n\n[noise] and\nA\n\n\nOr a man or\n\nDry but that was kind of a\nDry I live in a\nI don't know\nDrier [noise] and I drank a lot\nAnd I asked a beer\nSays Alana [noise] at this time the white ...\nI heard\nIn the area to budge flight delays the man's [noise] I Know you're\nA\nA dry or drank a lot\n\n\nAre wearing a drawing or na na na na na\n\nYou're listening to the Arizona community radio network on kj da ... point I drank cage ACP Ninety point one Prescott and kj decay Ninety point seven king when [noise]\nUsually I read news editor Hoosier uptick hurricane surgery oh continues treating as a large category three storm of the Pacific but\nIt's what Sergio was for cash to do is a ... or late this week that have forecasters keeping an eye\nOn the store they latest forecast models on storm productions have surgery and making landfall grows Baja California at tracking up through the desert southwest forecast models show that the storm a move across California Arizona and New Mexico as rain Baker was flooding potential possible to Southern California San Diego area and into the Phoenix metro area by mid week serve\nUsing density is not likely to change much during the next day or two although forecast models show is weakening later in the week on Wednesday or Thursday and more definitive pattern is anticipated by been\nWeak and the national weather service that they will update the forecast directors a week of Russia's from the new show that you're up to [noise]\nSupport for the Arizona community radio network is provided by\nMartin slimy Chrysler dodge cheap ram and key uh twenty six twenty east anti divine in king then you can depend on ... find selection of new and pre on cars trucks and SUVs where quality cars and trucks really do cost less see in the shop on line that Kim and dodge dot\nCom\nThey usually are in ... county area mostly sunny today daytime Seventy three crushed crushed at all that you know about eight other sunny day ... and ... Williams likes it and the ... valley mostly cleared daytime odd that you know and the weather's shuttered you forecast\nWe believe our old too busy\nIn the garden waters garden center\nYou're reliable source for local news and sport northwest public radio Ninety One point three FM Flagstaff month part\nHello I'm nine marshal the b._b._c. news\nDeal foreigners in China have legalized the use of re education camps in the western region she's young saying they want to come from people who've been influenced by religious extremism that's been growing concern about the disappearance of weak I must ... inch in John Michael ... report\nUn human rights committee recently hit that China could've looked took a million people in ... perhaps more\nAt the time the Chinese spokeswoman said the allegations were not true\nThose are the the show to be more nuanced reaching the authorities would clean extremism inching jak now when you log introduced by the regional government that makes you clearly the local authorities have the right to establish we education comes\nThe legislation sees the image provides vocational training but also to correct behavior and to carry out ... transformation\nChina has launched a wider campaign against Islamic practices across in John it wants to stop the use of hello products that are not food when newspapers at the use of the tab ... allows you describe items such as toothpaste let the line between religious and secular life [noise]\nTurkish media have shown video images that they say may shed light on what happened to the missing Saudi generalist Jamal casualty Saudi Arabia denies it needs to show he was not did he hasn't been seen since the end of the Saudi confidence in Istanbul more than a week ago\nThe footage shows were said to be a fifty member team is Saudi officials Long Island in Istanbul\nCc TV shows their arrival in assembled by private jets hours before Mr ... g's disappearance\nThis scene checking into two hotels NATO Saudi ... that booking with for several days but they left highly black down vehicles are shown around the country let's move into the consul general's residence around Ninety minutes off limits to how shall be banished did they contain his body\nTo two planes flew back to rehab that night one by Dubai the other by Cairo\nA coach in Britain has identified the highest spending why for the jails international ...\nAs the first talking to the new anti corruption law and the idea that whose husband was convicted of defaulting millions from Azerbaijan ... largest bank is being told to explain to suicide how well she denies any room doing I'm going to catch Shawnee is following this story\nThink everybody's jewels messed park to drill team colds when the scale is became care I mean it works out so it's about four thousand pounds a day over ten years suspense inherits ...\nBoth her and go train jets for forty two million dollars when the stance you have to try to call ... within Howard's Carl Caulk as well but at the national crime agencies okay this in in terms of the bigger picture because this is ...\nThe law about what's a cost to talk to a person they can talk it not just ... minutes that it now becomes clear but also the family's all officials in broken steak tend to ...\nWell news from the BBC\nFor K. A. W. B. C. names in Yuma I'm ...\nCity of Yuma wants you to imagine a day without water today goes this is the fourth annual national imagine a day without water\nA day for people nationwide to understand the role but water plays in their daily lives to to give you my assistant director of utilities Jeremy McCall says the day is meant to raise awareness about the importance of a vital resource that you may barely remember even using\nYou know you don't remember brushing your teeth although he did it kind of take it for granted we really pride ourselves as the the local utility company providing that level of service you turn on the water you know it's good you know it's clean you know it's their\nSusanna Hitchcock is sema water quality assurance supervisor she says imagine a day without water is also about infrastructure\nThat means better treatment plant and our distribution system to get the water to the homes businesses in industries and then also the lines to take the waste water down to our\nFor treatment city officials say it said twenty four hour a day job providing Sunni residents with back reliable scraped clean water that you may not even think about today though they hope you do\nNorthern Arizona university says it recently discovered student had rented out a dorm room on air BNB Arizona daily sun reports a university spokesperson says the school contacted the vacation rentals strike and add\nBack listing remote still remains enrolled at the university but it's facing disciplinary action\nFor violating school policy the room had a single bad and and attach bathroom student gay renters access to the residence hall how'd you get fish will soon university police recently sold the unauthorized gas to me\nI'm Kevin Johnson K. A. W. CNN\n\n[noise] [noise] Mm [noise]\n\n\nPay a\n\nBiopic ah\n[noise] no\nAnyway my\n[noise]\nDollars in\nJoined in just cut\nEven than slow\nOne guy he does and\nTake place in the non\n... that show\nDon't they call them on\nMan\nBy the shears than than race and\nThey're very very Asian\nThe action to the\nTwo for you and\n\nAnd that's you know what is known as Gordy up her real name is Sophie painting but nonetheless he performs that forty the album she put out last year it's called reservoir that was on my side as we continue with the bridge Iran border radio Thirteen twenty I M K O F a in Yuma\nBefore that Mary cheap and carpenter did transcendental reunion\nWe heard the ... when he gets home and started that set off with John it ... and ... girl\nHey you're listening to the bridge and we're glad you're with us we were just to get the blues and folk and rock bands you've heard of before and folks we just discovered or take a short break and come back we're some blues and I got a great collaboration a sunny Terry and Leadbelly together to start the next set the hope you'll stick around\nToday is border radio days sponsor is the ... art center announcing the Eighteenth Daniel tribute Academy Award ceremony this Friday evening October twelfth at seven o'clock in the historic human theater the words will be followed by a VIP black tie reception with why performances hors d'oeuvres and silent auction at the ... center tickets that you must show tickets dot com\nThank you for listening to border radio at Thirteen twenty am in ... we also broadcast on the Arizona community radio network in Prescott Kingman Flagstaff and William's on\n... ... ...\n... ... ... ... ...\n... and you are\n... ... ... ... ...\n...\n... ... ...\n... ... ...\n... and all\nRed and the\nThe best\n\n\n\nAre\nBombing\n\nAnd her\n\nFather\nBall\n\n\nA\n\n\n\n\n\nMob and right\n\nNa na\nNa where I'm a maintenance\n\n[noise]\n[noise]\n[noise] [noise]\n\nOh we have to celebrate the blues here on board or radio that Jimmy duck homes would all night long as we continue with the bridge\nBefore that David Robert ... world a fool's we heard Charles Brown with ... the danger is it over and started that set off the track of this is blues wonderful anthology or that teacher to how long blues before by Leadbelly sunny Terry [noise]\nHe took her out that we've got a more music ahead and do we don't just play the blues you play all kinds of music on board or radio Thirteen twenty I Am ... and that border regulates eat out or you're going to start our next set with the old blue eyes so stay with us\nWe're radio is supported by prison he'll Brewing Company a locally owned a restaurant and craft brewery on main street and you must historic downtown ... alike are invited to remain themselves to join the prison held population for a memorable lunch or dinner Stan featuring a wide range of menu options and craft beers more about prison held Brewing Company on Facebook\nThinks we're listening supporter radio Thirteen twenty am in Yuma and border radio easy dot org we have been in the service of Arizona western college for more than forty five years\nIn Yuma sunny today with the highest eighty seven south when five to ten miles per hour tonight mostly clear\nLows around sixty eight England has sunny skies and I are Seventy four today and partly cloudy skies in a low of fifty five tonight in Prescott sunny today\nEyes near sixty three and tonight partly cloudy with a lower forty four Flagstaff mostly sunny eyes near fifty five today partly cloudy and a low of thirty five nights or\n\nThey call\nIt a lot\n\nAt the time you have\nAm I\nAnd before\nMy ...\nMy mother and\nIs pray [noise]\n\nI'm Sorry\n\nTonight and I\nReview lady\nTalk to Tom tom I'm not\nLet us turn do the same\nLike on a day in your campaign\nYou've been around\n\nAway and then later on those edit them down\nA lady the other one the\nGuy I Know\nMy side were raped by a guy\nTo game\nThe young lady and\nTo find some some talk show he he survived na\nNa na na na na\nNa na na na na na\nJohn do the\n... to ...\nYour ... to me\nAbout a mile\nAway not mentally\nVery nice\nLady the other one\nAnd then\nWay\nKnow\n\nA guy in\nTo a lady\nThe na na na na na na na\n[noise]\nNa na na na na na na na na\n\n\n[noise]\n\nYou're listening to the Arizona community radio network on eighty nine point five FM cages drink Ninety point one of them teachers e P Prescott in Ninety point seven FM cages e K king [noise]\nNumber on the way I'm first [laughter] All right here's one what is radio incendiary wealth skits song for the recall news spend a whole lot more join us for radio when Suzie Saturday at eight PM\nSupport for the Arizona community radio network has provided by\nThe by the humane society caring for over three thousand animals large and small each year and inviting you to be involved as a volunteer financial supporter or a doctor it's many programs including a low cost ... neuter clinic thrift store an acquaintance Center for abandoned abused horses this is the website that you have a bike humane dot org\nWe believe in seeking peer pressure from the tree water certain center\nEntertaining enlightening informative and involved Prescott public radio\nUnder ... here with you with some great turns out the had including tunes from the tree taught flyers Eli keen leaks\nAnd our ... Guthrie let's start out with van Morrison from these two thousand sixteen release keep me singing the Penn is mightier than the sword ...\n... can\nThe men\nWomen are\nMany of the man is you can't tell you what you've got\nHuge\nFan for many of them are still\nBeing rather than\n...\nThe man\nCan't tell you what do you have\nGot to live by the damn business mind here so is\nFans\nBetter than\nThey would ...\nI may never landed near\nYoungstown would those be man\nThey're gone you learn to live\nJuan\nThere was a lot of them\nHighly thought to be checked by Martha ... bone and you're listening to under current\nAngry he we didn't mind we're in\n\nToe and dance\nAnd the\n\nHim\nFor\nHave here that he was\n\nMy\nWe end\n\nMaybe a\n\n... D\n...\nStreet the ball ...\n... ...\n...\n... ... ... the ...\n...\nThe the some\n[laughter] [laughter]\nNo no\n\n[laughter]\n\n\n\nGreen man than\nYou'll\nShame shame\nYou know\nJust by\nShame shame\nA\nRow\n\n\n\n\nReally ... ...\nOpinion [noise] [noise]\n[noise] [noise]\n[noise]\n\n\n\nWe're\n\nWe're\n\n[noise]\nWe didn't hear that million you\n[noise]\nDon't I don't know how they feel well\nYou know [noise] and I didn't ask him were blown up but then the there's a little less dam\nDo stand up play [noise] gift in the dark magic show you know\nI'm Still believe in\nJuly and then that's God I have [laughter]\nOh [laughter]\n\nOh yeah\n\n\nHa ha ha\nHa ha [noise]\nDo you know [laughter]\nOh\nThey deal\nWith um\nTo ... if\nTo him you know\n\nIt can be anywhere\nI\nKnow\nHiring saying\nThat they are\nThink my my dad died\nMan the\nMan that he\n\n\n\nI Try not to let them\nHow the planet die\nChanging na na\nNa na\nNa no\nIt isn't too bad\n\nI\nDon't know\nI'm trying my God I Know\nI'll be on my day job\n\nOne of my favorite Arnold got three songs a city of New Orleans from ... by Dennis ... he gave us a song that was used in the descendants and the and in front of that lake street dive brought us Shane Shane Shane from their new album free yourself a\nCenter currents I'm ... and if you're just joining us welcome cues I make school by with reality that cannot escort team on the reality that we didn't choose\nBe done though man let's\nGoes down and down the multi over\nBut I don't see\n... you\nDo a lot\nPretty bold statement\nKind of\nYeah yeah well we all know\nThat they go all the new\nOrleans\nThe new\n", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Kingman", "day": "10"}