{"month": "10", "state": "AZ", "station": "KJZK", "content": "You're listening to the Arizona community radio network in eighty nine point five FM K Jay Z a drink Ninety point ... Jay Z Pete ... an Ninety point seven F. M. K. J. C. K. king the king Center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the Beale Street theater\nWhich will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nArizona the drive through wildlife adventure park in Williams, Arizona view by should mountain goats bighorn sheep and black bear for the safety uncovered of your private vehicle or travel go watch playful Barrett cubs up close at the end of your to Arizona\nLike forty at highway sixty four in Williams, Arizona dot com by the public radio programs you enjoyed that didn't for middle aged editor Jane logo due June in radio dot com that church for ... at the Arizona humidity radio network that looked at any time on your smartphone\nAlright it's undercurrents agreement Ficre welcome music after the first day care Eli king shovels and rope first off the heavenly states\nMm\nI Believe the Taliban and those are\nYou know\nNa\n\n...\nOh\n\nOh this is mostly from the blackout his buddy and you're listening to under ...\nAnd change the\nLeadership issue the the the street\nWay you\nKnow\nI was ...\nJob\n\nWe do have a a\nN and cutting na na na na na na na na na na na\n\n\nNa\nNa\nNa na\nNa\nNa na na na na na ... and ...\nThing\n\n\nSo she understands da da\n\nDa\n\n\n... age we are to be hot then I'm sure you've missed and I can eat and we are one of the way if I understand the radio [laughter]\nMarry him it was the\nChange that why\nWhy are so well\nGet go on the ...\nThere is a bum than\nYou know me any day you know ... years does by law to keep\nEars no no not really lying\nA lot to do they die down blah\nArea then\n\nNa na na na na na na na na na na na na na na na na na\nGreat you know\nAnd are you giving\n\n[laughter] [laughter] [laughter]\n[noise]\nBut they had\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nA worst shovel the rope and you're listening on the current\nGuy I Know ... ...\n... the\nCan da da\nDa da da\n\nDa na\nNa say bad\nAre on a I'm\nYou get\nA job\nThe ... they just\nA lot but on the ball the loan\nThen my way\nA day\nDa da da da\nAnd though\nNa na\nNa\nDay and\nI\nBy a\n\nOh\nOh your wife team sure who's in a row\nThere's some from there I'm suing the ... most recent single record day the fear and there was only king with Shane from the new one shake the spirit how's your spiritual should get out [laughter] we're we're a\nLegal in her hips here and enjoying the music ... coming up with the great one right down the music from ... well this is Peter\n... who ...\nWho ... who\nTo ... to ... ... students do\nDo do do you mean revenge to more than ... you know what your\nNever know you do you go you will\n\nShe did\nInto some kind of\nWay shape\nThings don't you can see the\n[noise]\n\n\n\nNa\n\n\n[noise]\n\n\n\nNight that then they would you think about what\nReally there they are the New Yorker just quick weekend thanks torching already all across the line\nI'm Greg recur and support comes from the corporation for public broadcasting\nFrom the fringe of under current and from in the one stations like W why you do when you're in Warsaw, Illinois in ... in peach springs Arizona and Mrs native boy swam the ...\nYou're listening to the Arizona community radio network in eighty nine point five cages EA Drake Ninety point one F. M. K. J. C. P. Prescott a Ninety point seven F. M. K. J. C. K. king the king Center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the Beale Street theater\nWhich will be the center for culture of creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson that three eight five three one nine five two to three eight\nPart for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary in Valentine, Arizona thirty miles east of ... historic route sixty six to ... by rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day not divide except here today about historic route sixty six\nBy useful information all the public radio programs you enjoy that inform entertain educate added like there was a link to our live live stream at kj Z. A. dot O. R. G.\n\nAlready undercurrents Greg Victor welcome got some pretty epic music coming up from skating Polly Paul McCartney Jason is ball and\nYou know in a world where a lot of things are a house of cards this dark seems appropriate next card default this is ray bonded on under current\nA menu which\nTo the\nOther day there's no\n\n\n[laughter]\nI like they're going to hold and hot and things and start them when\nOddball doll who wow we'll all get a good\nReason to seize in nine\n[laughter]\nThe only way at all it's all on the ... then pack up and the doctor had both and\nGood memories and try to be ... by\nThe name oh\n\nI've got no go novel aimed at the ... mall\nA guy\nI lock than do about that this was back I mean you welcome wrong there you're just for the land but on memory you then your travel I could not [noise]\n\nAh counted on\nThem they do get the game is the way that she did during the day but I got a job I could\nBe used in ... [noise]\nOn in the Andes loan\n\n... hold\n\nThink I Do know\nWill know\nA God\nI Lived there your whole\nBody by the way I Do all these I won't get\nFined and and I figured\nI thank God those oddball\nOutlaw the fine men\n\n\n\nFrom ... ... ... ...\n... ... ... ... do do do do that didn't know can you make the Big Bend but she told me in the ... and Dr Tom jones building it but\nBanning and blah blah blah you know the food and then it ended up by your pie dough that don't get to the ball in then and then not adding that to be the rent a lumping Danielle bump into your\nYou don't\nAbout you know than a man of true oh gee I don't know but now they do count\nYou don't\nNow than they can [noise]\n\n\nGet a comment when you when I get you in here to\nOut and say well they didn't\n\n\n\n\nDa da da\nDa\nWe\n\nWhat are your paper and bring\nNamed Mike Barrett or\nRun for every member or\nThese\nDays\nI Do remember\n\n\n\nThey were angry three\nNations that you\n\nAround and I do\nShare my view\nMan and iron oh\n\n[noise]\nSay he he\nThe the ... and\n[laughter] ...\nTo\nMe you know and\n\n\n\n\n\nYes\n\nAnd ... and ... ... ...\n... ... ... na\nNa na na na na beach and dragged me me me me\n...\nNa na na\nNa\nNa na na\nNa\n\nNa\nNa na\nA\nOf money I can ... ...\n...\nDon't you know ...\n\n\nKnow and then she'll\nGo\n\nAnd come\nIn\n\n\n\n\nMichelle Branch with Cory radio headstrong heroine under current skating only from the album the big fit for a couple of years back\nProtective boy and it was kind of power between who either do right with a woman from wander thanks for two years and if you just joined us welcome to turn the currents are great and we'd richer\nMost locals coming up and right now while from his new album bottom line is is nice long track\nWith some of that back were the kind of stuff that John beetles Jimi Hendrix discovered back in the day\n... ... ... or\nLooking into some\nHurting feeling in my chest the\nVery within the ... so\nI was standing down\nThat well\nKinds of streaming to throw anything in the Twitter\nThinks door team Gabrielle Acosta long trusting to understand the jury\nAre great McGregor and support comes from the corporation for public broadcasting from the French Laundry corrupt and from envy one stations like can you be up in Morrow bay California and keeping your gi money while Guam\nAnd this is needed boy swamp the leader of America\nYou're listening to the Arizona community radio network I mean nine point five FM cages the trick Ninety point one of them K. J. C. P. rescue in Ninety seven F. M. K. Jay Z cake\nRoll usually are in weathers veteran or go ... mostly through southern data on the free like we'll get arrested bothers you about like solving a clear mind you're eighty four degrees at Burr when he was wiped up there the rebel a closely something today that got much somebody's sick from the weather's other let your forecast\nShe'll or will the arrows older humidity radio network is provided by God it was all\nWear chef's very bar bench to repair delicious lunch or dinner on drugs and exotic tapas or you're not a luxury enjoyed the ... bar with ... hour week doing like music Thursday and friday with ... three sixty was Goodwin street in Prescott\nWe believe you're going to be\nThe water center entertaining enlightening informative and involved Prescott public radio\nOutrageous undercurrents I'm Greg my recur welcome music for America and star on the way globally yeah as we found right wing talk and we're going to pick it up right with Steve Earle\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise] well [noise]\n[laughter] [noise]\n\n\n\n\n\n[noise]\n\n\nI Know [laughter] [laughter]\nAnd all that kind of short of straw when I was going to be there to greet me nobody in the battle dome and all of them not open balloting deal going\nThere to cook is my new who can be a bad\nDay [laughter]\n[laughter]\n\n[laughter] [laughter] [noise] I honestly\nDon't know how to build all\nNot at all and you were wrong you prompted out emails\nFor a very small\nAnd large can be had by which\nThe mall we walk away\nFrom me but yeah\nI Know [laughter]\n[laughter]\n\n\n\n\n\nYou\n\n\n[laughter]\n[noise] [laughter] [laughter]\n[laughter] they're running\nAll around the shortest route busted out to be here man he belonged to the breeding nobody ever told them oh yeah the ... hour drive\nBy the\n\n\nI Am I [laughter] I Am [laughter]\n\n\n[noise] [laughter]\nOh\nMy God oh my God\nIt's the job to do\nSome ... ...\n... they don't believe me\nIt's a whole new\nDid they try to\nThe drought is they they you\nI Do a long\n\nNah\n\n... ... ... ... ...\n... [noise]\n\n\n\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] I [noise]\n\n[noise]\n\nOn my way\nUm [noise]\n[noise]\n[noise]\n\n\n\nIsn't that phone number just like folks from ... to nine year old woman from Southern California during the song regimes by the Riviera really right\nAnd center in Washington from Santana three and New York from harvest moved you know what you can join the flow what's under current agreement quicker stick around\nWe're going to pull you something that in a recent interview oh McCartney pointed out there and he has been one of the most outstanding strong shovel time we'll play back and just\nThey are then me\nNot ...\nMan they\nBut in the new the\nNew landing in the\n\n\n\nThat joke\nNa na\nNa na\nNa na\n\n\nI\nAnd\n\nNa na\nNa na\n\nNa\n[noise]\n\nRight well that's Liberians I've ever seen they just keep getting better and better now that was recorded in two thousand six hundred\nA few months ago and they even take a richer more sublime level most lonely boys my way from the album sacred twin flames with mama from single fire\nAnd then did you do from June the\nStreets of Laredo and New Zealand do this row\nAnd it was the beach boys God only knows the stereo version\nOf that so ... ... what he saw was just it was wonderful song of all time the beach boys and of course Pence founders of the things that inspired the Beatles to take it to the next level was\nEspecially peppers kinda them across the pond rivalry\nPay you to know undercurrents I'm grading it'd be just joined us welcome to creep toward is Derek I'm start coming up but first this is a collaboration of some big shots Justin Vernon I'm Boehner their and their desks none of the national\nThe comb so big red machine [noise]\n\n\nWell this has been a lot of fun and you know what you want to grab the ... list\nIt says undercurrents radio dot yeah sure number forty seven sixty what she means don't get ... weekend we have it in the arcade right there just quick weekend thanks to got to be on the cost a lot of trust you know understanding jewel Yuri I'm grading the vicar\nSupport comes from the corporation for public broadcasting from the fringe laundry corrupt and for me and the one stations like W where you are in Rochester New York in ...\nYou're listening to the Arizona community radio network an eighty nine point five K. GPA Drake packet valley Ninety point one cage ACP Prescott Chino valley Ninety point seven K Jaycee came came in Boulder City Nevada\nAnd on translator K. two one seven ... park in Ninety One point three FM [noise]\nUsually are reduced later here's your up they got to go to Europe jeopardy is arrested twenty five year old Bradley partly from subsidy Arizona numerous felony charges including a shoulder to resolve a circus or with a weapon vandalism position\nA burglary dual among other things why so yeah so dark out extra jak is received information that partly was driving is still to be a lot of the subsidiary probably was located at the brush to a country club what officers attempted to take him into custody he pled had led Japanese all the change that I Wish sixty nine or they lost control of his sold them vehicle and crashed into other cars in the vicinity of Bradshaw 'em up and drive a brush\nAs far as the yesterday or the alleged attempt to deplete the was abused by several ... witnesses and detained until jeopardy has arrived\nBarley was taken into custody used suspected of committing several residential birds are raised in Prescott valley that Europe they deserve it was a show that whole museums will music festival this weekend [noise]\nSupport for the Arizona community radio that brings provided by Charlotte\nFolk music festival in Prescott forest ages now do you defer to X. two hundred musicians perform all the beautiful forager campus will show that whole museum details on line at Charlotte ... for great music food and fun for the entire family is the big folk music festival this weekend it's out John Prescott\nRelieves the Iran whether said or who your work out for payment of ... county area today mostly clearance outta daytime high Ninety three like when I was getting rescued ... valley Saudi unclear daytime hide your eighty four degrees at Burr Williams lives that they had already valley closely sunny today daytime high seventies today from the weather's that are that you forecast\n[noise]\n\nThis is the b._b._c. news hello I'm Jonathan eyes out\nInto the easiest disaster response agency has concerns to the BBC that none of the country is the nominee detect the boys was working before all the on and so the way she was struck by an earthquake and tsunami on friday with an eight hundred people are concerned that but that figure is expected to rise or Asia Pacific as as the Manhattan as multi tiles\nAfter when he was struck by a devastating sitting out in the in the south and in for this isn't the gate detection boys were donated by Germany the United states and Malaysia\nAnd then in twenty sixteen another earthquake reveals that the system wasn't working the government promised to repair over the place that the following friday six meters the now me wave a disaster agency spokesperson told the BBC Venetian service that is an army detaching boys were no longer in operation\nAdding to systems Twenty one floating detection unit had been damaged by vandals or had been stolen\nInto these is dishonest agency has appealed for more heavy lifting equipment and try and rescue workers to help and the search for survivors on so the way I see many parts of the coastline of being destroyed and the number of areas outside the main city upon who have yet to receive any help a hotel in er in ... said screaming could still be HUD company the rubble Rebecca ... is that\nForeign travel if we have the same side in the hill without a part remain closeted\nAttract found found phase\nNow all I Know this had shown in ... which is all my friends to think oh seen him in that same pony fan my faith travel people still hate the cold now thinking holiday than forty they sound like\nAnything else is doing anything about it\nBecause he ages from the United states and Canada have concluded talks on reforming the north American free trade agreement which also includes Mexico it's the outcome of the guys the actions initiated by President Trump to consider the original arrangement on fat to the U.S every walk reports the\nUs into Mexico have already agreed a new trade deal now Canada has to there are several changes it President Trump wanted it will be more difficult for carmakers to use components in materials from outside the area from China for example if they said friends for vehicles tardy free into the U.S\nFarmers in the U.S will have better access to a candidate is highly regulated dairy market\nFor it to ... Canada has assurances that it will be protected if the U.S imposes new tariffs on ... impose too grave and we'll have to be approved by the U.S Congress before it comes into full ...\nThis is a Nobel Prize the medicine has been awarded joined the to James Allison from the United states and ... from Japan that research on how to fight constantly using the body's immune system the Nobel academy in Sweden said immune checkpoints therapy at revolutionized kinds of treatment BBC News\nFor ... for a double you've seen news in Yuma I'm Jim Johnson hurricane row so weakened to a tropical storm Sunday\nAs it headed toward northwestern Mexico and the southwest us but it seemed any thing but we early yesterday afternoon here in ... county\nStarting with a dust storm an outer bands from the hurricane hit the area with extremely heavy rain and strong wins the rain caused street flooding in a number of locations and the winds caused scattered damage in your mind power outages throughout the area\nOr us National Hurricane center says Rosa is expected to hit the Baja California peninsula and then senora coming up today as the tropical storm was still potentially flooding rains\nIt's than expected to move quickly northward as it weakens but still bringing two to four inches of rain to the ... area of Arizona and one to two inches to desert areas in the state\nSome isolated areas in the deserts could receive more\nThe national weather service announced flash flood watches through Wednesday for areas including southern Nevada southeastern California south western and central Utah as well as the western two thirds of\n... the ... area too strong water officials are investigating how our treatment plant sent water contaminated with chemical compounds to more than sixty thousand residents city they were on a Daily Star reports the chili officials mistakenly\nThought that I'm contaminated water was coming out of the plant which has long treated water pollution on two sons stopped Scott for K. A. W. see news in Yuma I'm Kim ...\n\n...\nTrainer who\nMan you know more\n\nRole in the U.S\nI had\n[laughter] oh\n\nWhy did you hear the lander mail from ... Ohio\nLearn\n[laughter]\n[noise]\n\n\n\n\n\n\n\n\n\n\nAnd that's the Scottish pedal blind dogs with cycle palm subtract from their twenty ten release wherever yet may be and it's been a bridge on board or radio Thirteen twenty am ... before that soldier lurch or did I Know something that's going to break your heart that's a\nTrack they came out earlier this year on an album called solo pleasure\nJoey Bainbridge before that did not afraid of nothing and we started that set off with six week old down by the new bad press there called hot snakes\nWere to take a short break I've got the Tucson band Calexico coming up in the next hour and we'll start the next fed was some Aaron Lee as jet so hope you can stay with us for more of the bridge a border radio ac dot org\nToday's border radio days sponsors are Holly and Martin Jordan who shared this poem precious ... is five today we can't believe it's true please wish her a happy birthday she'll giggle when you do now do you think it's great John ... to we're going to celebrate in Disney World from mom and dad\nTo you you can hear border radio Thirteen twenty am on the radio at at at that would be I install it and so like K O FA as your favorite the send you\nA chance of showers eyes near eighty six degrees southeast when ten to Fifteen miles per hour today tonight showers possible\nLow around Seventy four game and has a chance of showers in the eye of eighty today showers likely and loads of sixty two tonight in Prescott showers likely I near sixty eight today tonight showers likely low around fifty three\nBlack staff showers likely ... near sixty five today and tonight showers likely with a low of forty eight\nAnd he's the guy who\nAre you ... to\nThe case on\nOne day at Harvard\nHas been in that water\nTo ... to\nMan in\nMuseum in bed and\n\nWere getting fat\n\nAnd ... you\nMe know\n\nNo\n\nHow\n[noise]\n[noise]\n[noise]\nOh man that maybe that satisfy the way I ever heard that she was told by radio\nAnd imagine somewhat stealing a radio that we should make a Copeland from a wonderful out and they came out about ten years ago now called the sole true\nAnd a great way to continue our Monday makes music you're on the bridge on board or radio before that the Tucson band Calexico did under the wheels that's what my new album that came out earlier this year called the thread that keeps us we heard calling from the wreckage from a deep Edmunds that's from a live album called a pile of rock\nAnd we started that set off with Aaron Lee has Janet ready to die\nFrom the silver tears out and they came out of twenty sixteen and I still shut out to Hank Williams on that album on that track any way I'd be very glad to be with you this morning kind of a crazy morning here in Yuma we got dumped on hard yesterday by the early uh uh\nOuter bands they called it a bad as hurricane rows of that's going to bring a lot of water to Arizona Welcome water I should think a very wet here in ... we got a call from the commander out of your ... there are shut down today telling folks not even bother going out there um so uh some important information they're going to take a short break we'll be back\nI got my door locked him coming up in the next set and also we'll start the next several detract from everything is recorded so stay to\nBorder radio is supported by doctors Cheryl how go and the team that desert veterinary clinic treating all types of pets in animals as family members desert veterinary clinic offers true pet pet wellness plans designed to help them live longer and healthier through regular preventative care\nMore at nine to eight seven eight three five zero in zero\nSt Louis high school offers a college career and military fair it's a chance for students to learn about opportunities available to high school graduates Wednesday morning October third at nine thirty at the St Louis campus\nMulti purpose room twelve fifty north eighth avenue in San Luis for more information you can contact K. A. W. see [noise]\nI like to explore here [noise]\nUsually people trying to block out the noise in the city but it's actually interesting turn it off [noise] everything has it in the city itself cling\nTo listen to your\nNext time onto the best of my knowledge of\nIn the morning continue on key I mean you see any ... oh\n\nThe man who\nMan\nNa na na na na\nBall\nVe bondi\nNews on the on the\nLong term\nNow she no\nDon't know why they\nThe meat of American radio network\nThanks for listening to K O F ... Thirteen twenty I Am and border radio easy dot org a service of Arizona western college we also broadcast on the Arizona community radio network at eighty nine point five FM K. J. D. A. Drake Williams\nNinety One of them kj VP Prescott any point seven if\nYou're listening to the Arizona community radio network on eighty nine point five FM Cajun da Drake Ninety point one of them kj ... rescue a Ninety point seven of them ...\nFrom the age they are in weather's better here or ... counties scattered showers a thunder storms today daytime I ate meat or Russia Russia valley in Chino valley ... sixty eight ever women's lives by Liberty Bell showers ... keep rebuilt the winds jazz great eighty percent of the ... the up their\nSupport for the Arizona community radio network is provided by came in regional medical center K. R. M. C. is pleased to welcome Peter Piper physician assistant to the team that guarantee cardio thrashing surgery\nPeter provides care to patients with a range of conditions including diseases of the valves coronary artery disease an omen airy disorders K. R. M. C.\nWe believe in picking apples here on the tree water center\nCommunity radio and the world news northwest Arizona Public radio Ninety point seven FM ...\n\nAnd then\n\nIn nursing homes are men around them and I know and\nAnd then and then the men\nWomen in\nDay and [laughter]\nAnd I was younger and around and saying yeah you hear all the radar on\nI I Am sure that you already know\nNa na na na na na na na na na\nNa na na na na na na na na na na na na\nNa na\nWithout there being\n\n[laughter]\n\n[laughter] I Know [laughter] [laughter] [laughter] and\nLooked on the short straw who knows how to be much better then they go into ... thinking about it now looks as adults down below pin bowling\nThere to ... ... ... new who can be\nBad too [laughter]\n[laughter] [laughter]\nHa ha ha ha\nHa ha ha ha ha ha ha ha ha I have\nTo come into your ...\nThose old you are Romney prompted out the\nWe live to be honest I Try to be full speed walks\nFrom me and I am out on the way you\nKnow I'm a mom who goes [laughter]\n\nHa ha ha\nHa ha you\n\n\nMm\n[laughter]\n[laughter]\n[noise] [noise]\n\n[noise] you know\nAnd all the time to join us from now but not to be he said that they\nI Need to read about in Middletown yeah because the ... down you know and the [noise] you\nKnow the\n[noise]\nI Am now [laughter] [noise]\n\n[noise]\n[noise] [laughter]\n\n[noise] oh my God\nAnd\nGet the job that\nWhat good ...\nThey don't believe me I\nDidn't know who\nThe drawn to them you\nWhen they tried to they say you\nI don't belong\nNa na na\nNa\nNa\nNa\n... ... ... ... ...\n... [noise]\nThere are\n[laughter] [noise]\n\n[laughter] [noise]\n\n[noise]\n[noise] [noise] [noise]\nDa\nDa\n\n\n\nDa\n\n\nWhoa\nAnd\nIt was mayor\nAnd hang on\nOn\nHand you know that even if\n\n... and ... and ...\nAnd\nIn an enemy [laughter] you know\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nIsn't that phone number just like folks from global\nTwenty nine year old young woman from Southern California during a song made famous by the ... really rock\nAnd Santana ... when I hear from Santana three and New York from our just moved to this unknown watcher Adrian joined the flow what's under current term grading the quicker stick around\nWe're going to probably something that in a recent interview oh McCartney put your daughters and he's been one of the most outstanding sons troubled time we'll play back and just a minute\nThis is Thirteen twenty am order radio or your wife and order radio eighty dollars a service of Arizona western college for more than forty five years\nTo the border radio days bonkers or Holly and Martin Jordan who shared this poem precious ... is five today we can't believe it's true please wish her a happy birthday\nOr bad day and then me\nTell me is a ...\nThey they\nBut he and\nThe and I'm standing in the ...\n\nEh eh\n\nJust er I\n\n[noise] and then you should go with children\nAn\n[noise]\n\n\n[noise]\nDon't know but\n\nAnd\nAnd [noise]\n\n\n\nWhen there's Liberians I've ever seen but just keep getting better and better now that was recorded in two thousand six hundred a few months ago and they've even taking a tour more sublime level most lonely boys my way\nFrom the album sacred twin flames were Loma from single fire\nTwin flames and indigenous duo from Canada\nStreets of Laredo out of New Zealand gave us rose and it was the beach boys with God only knows the stereo version of the trial McCartney ... while he was just the most wonderful song of all time the beach boys\nAnd of course pet sounds or is it the thing that inspired the Beatles to take it to the next level was\nSwitching peppers kind of um across the pond rivalry\nHey you're tuned into undercurrents I'm Greg it'd be just joined us welcome ... creek artist Derek I'm start coming up but first this is a collaboration of some big shots Justin Vernon I'm Boehner their their desks none of the national\nThey call themselves big red machine [noise]\n\n", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Kingman", "day": "01"}