{"month": "10", "state": "AZ", "station": "KJZK", "content": "This is border radio K O F ... Thirteen twenty am and vote or radio ... or a ... a western college we also broadcast on the Arizona community radio network at eighty nine point five\nFab kj the age ... Williams Ninety eight point one FM Jay Jay's the beep Prescott Ninety point seven\nKj decay Kingman and Ninety One point three a famine Flagstaff\nMostly sunny in Kingman today hide your sixty eight a bit\nYou're listening to the Arizona community radio network on eighty nine point five cages a trick Ninety point wintertime kj repeat Prescott in Ninety seven is I'm cages decay king the king the center for the arts is a nonprofit company committed to promoting the arts the king the group is renovating the bill street theater\nWhich will be the center for culture creativity and community\nIf you'd like to contribute time or money please visit Bild street theater dot com or call Christina Mickelson three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\n... the drawing through wildlife adventure park in Williams, Arizona you buy the book and go big or cheap and black we're from the state the uncovered of your private vehicle or troubled go watch playful Barrett cubs up close at the end of your two or ... or like forty at highway sixty four in Williams, Arizona dot com\nBy the public radio programs you enjoy that and for middle aged editor logo to June in radio dot com the church ... at the Arizona humidity radio network that looks at any time on your smartphone\nAnd I know\nHey\nNa\nNa\nNa\n\nHe's been close to home\nI'm John I came\nThe year\nA letter by\n\nDon't know\nBag\nAh the\n\nReagan na na\n\nNa na\n...\nDean of the ... na na na na\n\nGoalball\nThen on to win in a way to get\n... na ...\nA\nGod\nAngry\nI'm a\nUm\nPhone\nOh and\nI'm\n\nAm right\nDa\n\nOf data and ...\nHour and younger\n... to\nThe ... now I'm On a ...\nNa\nIn ...\nNone of them in ...\nMe\nIn his marine man to be here\n... all\n\n...\n\nWell\n[noise]\nThe leash than\n[noise]\nYou know ...\n\nNa\nNa na na na na na na na na na\nNa na na na Andrews\nAnd to do the by his youth group ...\nNa na na na na na\nNa na na na na na na na\nNa na na na\nNa na na na na na na\nYour ... and\nNa\nNa [noise]\nNa\nYeah I'm\nA I'm a\nI'm a I'm a I Know\nLonger a um\n\n\nMany who knew what they\n\nA lawyer\n\n\n[laughter] I no\n\n\n[noise]\nThat's ... Taylor featuring leaf feels on this song road is to prop ... case gave us last line of Albion\nBrigitte ... formerly of lake street dive gave us serenity and it was the smithereens with it don't come easy you're listening to undo currents and if you're just joining us welcome\nHere the new one from Steve corporate he grew up in Mississippi and then moved to a big city to pursue his music teaches published his memoir in which he reflects on the specific circumstances that brought him into the other guy ... deep for Bert on under current [noise]\nThat are the\nTo read\nIs\n\nBuddy Miller you're listening to under courage American music with a passport na\nYou know\nDay you know right\nYou sometimes\nThere is um\nNa na\nA star\n\nDing ding to G O F ... Thirteen twenty am and border radio easy dot org service of Arizona western college we also ...\nI mean any radio network at eighty nine point five of them have Jay Z a drink Williams Ninety ... K. J. C. U. Prescott any point seven ... kj the cake Kingman and Ninety One point three of them like a\nSlight chance of showers in Prescott throughout the day was sunny skies non you're fifty eight partly cloudy and they gave me a low rump thirty nine and\nYou're listening to the Arizona community radio network an eighty nine point five minutes and ... drink Ninety point one of them ... ... ... a ... point seven to ten K. J. C. K. king the king the center for the arts is a nonprofit company committed to promoting the art the king the group is renovating the Beale Street theater\nWhich will be the center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five two to three eight\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary in ... Arizona thirty miles east of ... historic roof sixty six to ... rescued exotic animals lions tigers cougars dancers leopards monkeys in more open every day no divide except today called historic route sixty six\nBy useful information all the public radio programs you enjoy that and for entertain educate and didn't like it was a link to or lie Web stream at kj Z. A. dot O. R. G. [noise]\nAh\n... [noise]\n\nNo no\nNo\nNa\n\nNa na na\nNa\nNa\nHa\n\nHa\nHa Hi this is Joe craven and you're listening under current\nBoom\nBoom\nYou think's\nGoing to take me to do\nMain guy handing it takes time and then they can they can do ... do you think he and\nHe thought\nHe didn't get an admission\nIt takes more than they knew where they ... they found that there was a guy\nDi\nDi di di di\n\nDi di di\nDi ... broke\nThe law but maybe I don't know\nThat now the the\nBig ball and\nHe was he was\nThey do you know to make sure they can get on\nNew ... new book\nNeed to know\n\nDo\nAnd\n\nScience\nAbout ... do you think they can\nDo to make you may\nYou been in the\nHe did was\n\nIs and you know\nWell\n\n\nDuring when you do\n... the guy\n\nNa na na na na\nNa na\n\nNa na na na\nNa na na na I and I'm Mary where I Am ... and\n...\nAnd\nAnd\n\nNa\n\nNa\nNa ...\n\nIn\nDay\nCare and I'm\nRenee in may\nThe the the\n\n\nYou\n\nYou\n\n... ... ... ... ... ...\n[noise]\n[noise]\n\n\nDegree\n\nNa na\n\nNa na na\nNa na na na\nNa ve and that may\nBe\nNa na\nNa\nNa na na\nNa na na na\nNa\nNa na\nNa na\nNa\n\nNa na\n\nNa\nNa na\n\nDa da da\nNa\n\n\n\nMindy misinterpret the Beatles the word Tom Petty give us keep a little hole for him he had an American treasure box that\nFrom two thousand Eighteen and re Bonneville has a new album out at king electric and we heard until such a date from that album and we heard legally downs with ... which means it's important\nYou're listening to under current and if you're just joining us welcome here's a new one from Mike Barrett\n\nDo a\n\n\nNah\nNa na\nNa\nAn election college does his forty radio Thirteen twenty am kale at ... dot org they also broadcasts an Arizona community radio network at eighty nine point five FM K. J. C. H. treat Williams Ninety One F. M. K. J. C. P. prince get Ninety seven ... and Ninety One point three ...\n... chance of showers in Prescott throughout the day was sunny skies behind you're fifty eight partly cloudy and the evening a lower I'm thirty nine and Kingman mostly sunny or hide your sixty eight some northeast winds up seven\nYou're listening to the Arizona community radio network an eighty nine point five pages a trick Ninety point ... ... in Ninety seven F. M. K. J. C.\nK. can support for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of Williams on interstate forty walk among the deer feed them right out of your hand the hundreds of animals up close elk buffalo girls camels Kuwaiti Mindy kangaroo llamas reindeer and more the Grand Canyon deer park near Williams\nSupport for the Arizona community radio network is provided by God it was all\nWear chef's Barry Barnes ... prepared delicious legit ... addressed as exotic tapas for your body blows you enjoy the ... bar was happy hour weekdays like music Thursday and friday with jazz holds up to three sixty was Goodwin street in Prescott I hate\nTo leave your garden she'd be natural thing and organic\nGarden center community radio and the world news northwest Arizona Public radio Ninety point seven FM can\nIt early days\nBut it's not all down the hot\nWay you could buy a new our dear\nTo me that\nMan\nCan I say\nMean do you mind we're forced me to play now\nGive you a three\nOnly\nThat\n\nYeah\n\n\nUm the bomb\nThe other\nSome people I'm\nStaying fantasy and can\nUnderstand that increase the planet in season now um [noise] this well this well\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI\n\n\n\n\n\n\nI'm In the night\nDown there you go down and [noise]\nTo read three million\nPeople have been dreaming up you\nShow I think about\nIt and then I\nThen I well nice\nA nice a nice well\nI Can't\nThey say well this is on money\nKnow it ain't got no\nI Know that I went to the world\nThat I'm sure\nWhen you die\nI say even\nThough when nine eleven Ninety\nNine\nDo they not do\nMeant all those\n\nAnd\n... thanks so that the undercover in American music with a passport\n[noise] [noise]\n[noise] [noise]\nOh\n[noise]\nYou know when I'm In a while\nYou\nKnow\nI'm sure that may\n\nWell be that way you know\n\nNo no no and then they go through the normal and we know about the number of great power and the call came in\nWe make and make sure no\nI read no no we're\nPaying homage\nI\n\n\nA game\nWhen he and I think there is you\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\nI'm\nGoing\n\nTo\nAnd\nI can even\nWith me and\n[noise]\nYou're listening to the Arizona community radio network on eighty nine point five K. J. ca Drake Prescott belly Ninety point one cage ACP Prescott Chino valley Ninety point seven K Jaycee came came in Boulder City Nevada and on translator cake to one seven eight the black death ... park in Ninety One point three of them\nTime this rover so this is the season of fighting\nI Wish that our listeners they don't want\nListeners diesel upset the loneliness showing\nEspecially when we're out among people\nThis is actually important\nRussia will be in such a shopping\nMeasurable gross\nAnd joy from a bird like their lawyer\nUs out at the kindness revolution\nDot net the board or the Arizona community radio network is provided by cable one you're dependable local stores for digital cable TV ONE Hubbard Meg high speed Internet and unlimited phone service within the continental United States when you get all three cable and services you get a bundle advantage to learn more go online to cable one dot net\nCable one in ... by county\nSupport for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of William's on the interstate forty lock them any deer feeding him right out of your hand the hundreds of animals up close elk buffalo pearls camels collecting Lindy kangaroo mammoth Rainier and more the Grand Canyon deer farm near Williams\nI don't know this is David Olsen with the b._b._c. news more unconfirmed and gruesome reports of a period and the Turkish media about the suspected kidding of Jim ... G and pro government Turkish newspaper\nAt times it has had access to multiple recordings that convey the extent of the torture which was to show was subjected McClellan has more details\nLines coming out for example that he was caught up into pieces inside the Saudi comes to let that it was performed by a forensic sex but who\nHad previously given an interview saying that he could do an autopsy ... seven minutes if the guy who did it said that he put headphones on to obscure the screams of ... but I have to stress that these old lines that source to named individuals and\nThey're coming out in the next publications because the tax and not giving public press conferences about\nCrime is Russian appointed administrations says Eighteen people are now known to have died in an attack on a college in the city of catch investigators say a bomb was founded in the cafeteria many victims appear to have died of gunshot wounds Steve Rosenberg reports\nRussian officials say the border you have the suspect to the ... was found inside the college building he's been named by investigators as Eighteen year old and plenty slough roughly called a fool few students of the courage Polytechnic\nIn his attack on his college he'd killed at least Seventeen people and wounded dozens more and then investigators believe the gunman kills himself\nPresident Putin has expressed his condolences to the families of the victims and his older an investigation three days of mourning of being declared in Crimea\nViolent protests to taking place in the Indian state of Canada as one of Hindu is ... most sacred sites opens its doors to all women officers centuries old bad\nAbout a single female deputy has been able to make the journey to the Saudi monarchy shrine says a name that have been able to get through a lot call the Base Camp for the hill to climb riot police doesn't charge protest is fighting pitched battles several people were taken to hospitals\nAnd on for the simply order has that been introduced to try to control the situation [noise]\nA prominent candidates in Afghanistan's parliamentary elections has been killed in an explosion in Helmand Province to box cutter law was meeting supporters in his campaign office in ... when the bomb went off\nAs a kind of mine was a top talk to the Taliban militants who said they carried out the attack he paid a pivotal role and weakening the group and hound ... a spokesman for the provinces governor said the bomb had been hidden secret what\nJob exploited replaced in a sofa blew up as a result of the blast unfortunately Mr Khouri man was killed and seven other people with seriously wounded fruit news from the BBC\nFor K. A. W. see news in Yuma I'm Kim transcend\nReservoirs along the Colorado River are at their lowest point for this time of year since they were filled some forty years ago from the Colorado River watershed initiative Luke Runyon of station Katie UNC in northern Colorado gives this details\nIf you add a key reservoirs that store the Colorado River water there at forty seven percent capacity that means collectively the system that provides water to forty million people and irrigate five and a half million acres of farmland in the southwest is less than half full\nThe previous low point within two thousand four when the reservoirs where at fifty percent capacity\nFor nearly two decades dry weather and warm temperatures have reduced the amount of water flowing into these reservoirs but demand for water from the Colorado River have also outstrips the supply over the years\nWater managers throughout the seven states that rely on the river are currently trying to sell cities and farmers on so called drought contingency plans which are meant to cajole water users to conserve more instilled the rivers reservoirs I'm Luke Runyon\nA bill introduced by Arizona Republican Senator Jeff flake and North Dakota Democrat Heidi Heitkamp has been approved unanimous\nThe bill seeks to improve border security by strengthening the workforce\nIn recent years US Customs and border protection\nHas struggled to recruit higher and retain border patrol agents to secure the border and officers to staff trade facilitating missions CBP hire act would allow the organization to speed up the hiring process offers special pay rates\nAnd educate employees about opportunities in order to increase recruitment\nHeitkamp says the bill will help the agency attract and retain the best workforce possible I'm Kim transcend K. A. W. see new\nMeant started by\nYou know the state to run\nGotta feeling a\nMe again and again\nYou know we've got to get a lot out of it sister got mad boats are you gonna do it again I can get\nThe way it is a little\nKnow about him you know they don't\nHave to let you\nGot all the women out of here probably read your way\nThe teenage years\nThe federal that if you want to get out like little tiny call and we'll get high life\nBecause if you don't want to leave out of waiting for the right thing to do it alone\nMay\nEven na\nNa na\nNa na na na na na\nNa na na na\nNa\nNa na na\nNa\nNa na\nAm a mayor ...\n... no no I\nIs that I Know\nI Want to thank\n\nAh nah nah nah\nAin't no I didn't know the job my name is ...\nThat day and\nThank you my name\nIs Alan ...\nAnd then the other than that I Am God God of the day\nYeah mind back to me why don't you\n\nYeah no\nMan God\nDid God\nGod\n'em Dan may\nThank\n[laughter] yeah my mom\nYou know\nAnd how the hell\n\n\nIt's been out of Chicago they're called wild bell and they're funded by a couple of siblings Eliot mentally Bergman\nAnd that was an taint heart track that came out last year as we continue to bridge on board or radio before that Johnny Winter from his courtroom blues album that he may\nHere professor long hair as part of the alligator records twenty fifth anniversary collection with crawfish fiesta and started that said I Would keep it simple a bomb um who's artist kept mo\nI'd be glad to be with you bring you knew the bridge and we were together blues and folk and rock an artist that have been around for a while some that are legends with a new artist as well we're gonna take a short break and we'll be back I've got some December is coming up in the next set\nAnd we'll start the next set with the band they called themselves up by\nToday's border radio day sponsor results in your taco de Tijuana, Mexico offering tacos case it is torches in more prepared with fresh ingredients and traditional ... cooking techniques they'll send you talk to be thirty six east thirty second street Monday through Saturday open for lunch and dinner information at el senor taco dot com\nThanks for listening to border radio Thirteen twenty I Am in Yuma we also broadcast on the Arizona community radio network in Prescott came in Flagstaff and Williams\nIn Flagstaff a chance of showers a high near forty six with east north east wind seven to nine miles per hour today tomorrow what chance of showers and hide your fifty for a good chance of showers are near fifty eight today\nTomorrow it's funny I near sixty two in Kingman mostly sunny with a ... near sixty eight today and tomorrow sunny with a high near Seventy one you on a sunny today are near eighty one Anthony tomorrow\nThe five degree wow\n\n\nYears and so are you\nOur show\nIn the ... and ...\nNa na\nNa\n[noise] down here are\nAdd ally ... job and\nHe knew he was\nA wild turkey on supply will\nBe\nA ... year\nOld\nAnd I don't know what to do that when you get\nTo do I mean you have a five day but I\nDon't mean new on Leno\nThe movie I\nOne way or the\nAuto\nRage in in the eighties or the\nBody you know or\nIn the navy yard named having bones\nDa da da\nDa da da da da da da da da da na na na na\nI\nMean if you are in the mid ...\n\n\nHalf hour\nTwo in the shadow or\n[laughter] I\nAnd their whole lives how\nIt's all the\n[laughter] ha ha ha ha\n[laughter] ha ha [laughter] [laughter] oh you are ya know na na\nNa na na na na na na\nNa\n\n\nAnd that's really from the December as their latest release was called I'll be your girl and that track was severed as we continue with the bridge on board or radio\nYou're on a Wednesday morning before that we heard minus the bear with excuses\nLost at sea was a track from duty but meaning and we started that set out with the ban Huck pie in the future is where we belong\nHere we hope you can stick around we've got a lot more music coming up as you continue with the bridge era border radio and uh I Do want to take a quick second to say thank you so much everybody who's got involved with the station especially during our recent pledge drive up folks who chipped in a few dollars to help pay for the programming it really helps\nMe take a short break we'll be right back with an artist she performs as Bedouine\nArizona was in college will be hosting a CPR first state certification class with instructor Joanna Eliot me be the Saturday October Twenty years from nine to one PM oh do you do we see Jim which is located on the east side of the game a cap is if you'd like more information you can give us a call at night to wait three or four seven six nine zero\nBroadcasting from the campus of Arizona what's in college for more than forty five years this is Thirteen twenty ... radio ac dot org\nOn the next thirty mile world needs the gallery to party with Latin sounds like salt that remember Lou and Colombia\nNo Bill Gates look I'm\nRelatively Howard joined us on the dance floor around Latin party on the next mile world near the gallon Saturday evening at seven on board or radio Thirteen twenty and [noise]\n\nOh I can\n... times ... de\nDe ... de\n\nSeeing do it one time and he's saying passes thing\nBut it's not enough and in the ... that the new ...\nWay man that\nA day\nYou know the name ... to me it's done in Manhattan and asked her when you say because one of these things\nGot like tiny thing that\nAwful and Indian minister who's been accused of sexual harassment by more than a dozen women has resigned and Jay act or said he was stepping donors Judea foreign minister in order to contest the allegations of which he denies will use from the BBC\nFor K. A. W. see news in Yuma I'm can transcend\nReservoirs along the Colorado River are at their lowest point for this time of year since they were filled some forty years ago from the Colorado River watershed initiative Luke Runyon of station K. U. N. C. in northern Colorado gives this details\nIf you add a key reservoirs that store the Colorado River water there at forty seven percent capacity that means collectively the system that provides water to forty million people and irrigate five and a half million acres of farmland in the southwest is less than half full\nThe previous low point was in two thousand four when the reservoirs where at fifty percent capacity\nFor nearly two decades dry weather and warm temperatures have reduced the amount of water flowing into these reservoirs but demand for water from the Colorado River have also outstrips the supply over the years\nWater managers throughout the seven states that rely on the river are currently trying to sell CDs and farmers on so called drought contingency plans which are meant to Joel water users to conserve more and filled the rivers reservoirs I'm Luke Runyon\nA bill introduced by Arizona Republican Senator Jeff flake and North Dakota Democrat Heidi Heitkamp has been approved unanimously in the U.S Senate\nThe bill seeks to improve border security by strengthening the workforce in recent years US Customs and border protection has struggled to recruit higher and retain border patrol agents to secure the border and officers who staff trade facilitating missions\nCBP hire act would allow the organization to speed up the hiring process offers special pay rates\nAnd educate employees about opportunities in order to increase recruitment\nHike camp says the bill will help the agency attract and retain the best workforce possible I'm can transcend K. A. W. see news [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\nThat's red smiley and the blue grass cut up helping launch new another hour of the bridge here on board or radio Thirteen twenty eight with a in Yuma that they nobody gonna miss me when I'm gone\nAnd you're listening to an excellent mix of a bluegrass and Balkan rocket jazz and everything else here on board or radio or public radio stations that we don't have to stick to one style of music coming up later this hour I've got new music from the board rocky is also a attract them Buddy Guy\nAnd I'm Robert Finland right now this is Ray Davies you might remember him he was one of the apartment for the kinks back in the sixties and seventies and eighties\nHe put out an album last year and this is the title track it's called America\n...\n[noise]\n\n...\n... year old man [laughter]\nSo\nHow do you [laughter]\nYo yo\nSooner\n\nNo\nThat's Robert Finlay with medicine woman from the album that came out last year called going platinum as we continue with the bridge on board or radio Thirteen twenty yeah\nCan you say you went across Arizona community radio network\nIn light of border radio ac dot org before that it was Jim Malcolm the Scottish singer songwriter sparkling flash of when we heard American accent and uh she Mack was going to be spending some time in Arizona later this month on Thursday October twenty fifth so we've warming in Prescott as part of the\nPress kit that kill the concert series at trinity Presbyterian Church has to seven o'clock show\nAnd then on friday to twenty six there'll be peace in on Saturday and Sunday the twenty seven twenty eight he'll be in Tucson so a lot of gigs for Jim Malcolm in Arizona and get full details that Jim Malcolm dot com just look for the concerts tap\nBefore ... Malcolm we heard lonesome river bad with the old man in the shanty and we started that set off with America ... the title track from the album that came out last year from may ... the kinks and he was working with the band the J hawks on that apple\nWe'd take a short break and then when I go back a little bit of a history lesson if you will and we've got a classic track from mount big time Sara for you to start to ... and just a minute to stay with\nToday's border radio day sponsors el senor taco de Tijuana, Mexico offering tacos case it is torches in more prepared with fresh ingredients and traditional Baja cooking techniques el senor taco\nFifty eight thirty six east thirty second street Monday through Saturday open for lunch and dinner information at el senor taco dot com\nYou were tuned into border radio Thirteen twenty in any ... a C. dot org we also broadcasts an Arizona community radio network\nOn the next mayor world needs the gallery party with Latin sound like salsa member who can do and Colombia\nI Know and I think a little\nMilk it well you know I'm\nRelatively Howard joined us on the dance floor for a lot party on the next mile world music Allen\nSaturday evening at seven on border media Fifteen twenty and [noise]\n\n\n\nAnd they may\nThen you\n\nYoung\n\nLittle man oh\nOn the\n\nNa na na na na\nNa na na na na na\nNa na na na na na na na na na\nNa\nHey\n\n\n\nDa\n\n\n\nDa\nBy the Buddy Guy would sit and cry from the red or blue collection and you're listening to bridge on board or radio before that edit James did board on the by you\nWe heard indigenous with seven steps away we started that set off with serious treater better known as big time Sarah she passed away back twenty Fifteen we heard a million of you were going to take a short break and the way back I've got new music from board refused coming up next so stay with\nThe great thing about border rages supporters is that they're willing to pitch and whenever he needed to think you to two fifty one downtown towards the kitchen president ... Brewing Company and elsewhere taco for providing food during our we supplied stripe we appreciate your donation to make our fundraising possible\nBroadcasting from the campus of Arizona western college for more than forty five years is is Thirteen twenty am order radio and border radio easy don't work\nIn Flagstaff a chance of showers a high near forty six with east north east wind seven to nine miles per hour today tomorrow which has to ... hours at a high end you're fifty for a good chance of showers are you're fifty eight today\nTomorrow funny I near sixty two in Kingman mostly funny with a high near sixty eight today and tomorrow sunny with a high near Seventy one you a sunny today I never eighty one\nAnthony tomorrow with a high here eighty five degree\nYou wouldn't yeah na na na na na na na na na na na\nNa\nNa\nNa na na na na na na na na na\nNa\nNa\n\nNa na na na na na\nNa na na\nNa na na\n\nNa na na na na na\nNa na na na\n\nI um am yeah really well yeah\nHe says I'm a I'm a you\nKnow [noise] [noise]\n[noise]\nOh\n[noise]\n[noise]\nThe [noise] the\nNa na\nNa na\n\n\n... na na na na\nNa na na\nNa\nNa\nNa\nNa na na\nNa na\nNa na na\nNa na na na na na\nNa na\nNa na na\nNa na\nNa\n\nNa na na\nNa\nNa\nNa na na na\nNa\nThanks for listening to what a human in Thirteen twenty am ... radio a C. dot org and service of Arizona was in college we also broadcasting the Arizona community radio network at eighty nine point five FM K. J. C. H. Drake Williams Ninety point one FM kj ...\nNinety eight point seven ... in Ninety One point three ...\nYou're listening to the Arizona community radio network of eighty nine point five of them cages drink Ninety point one of them could you repeat a Ninety point seven of them cages e K\nCan support for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feed him right out of your hand the hundreds of animals up close elk buffalo boroughs camels co watching Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near William support for the Arizona community radio network is provided by\n... by humane society caring for over three thousand animals large and small each year and inviting you to be involved as a volunteer financial supporter or a doctor it's many programs including a low cost ... neuter clinic thrift store in ... Center for abandoned abused horses visit the website that you have a bike humane work\nWe believe we're the ones\nWater during dinner you're reliable source for local news and sports Ninety One point three F. Flagstaff months apart [laughter]\n\nWhen\nWe are doing anything\nBut it's not on down the hot air\nWay you could buy a two hour do you ...\nHere recently and\nThen\nHim out of the\nMean you ... when I was forced me playing now\nAnd now they're building\nYou can you really have\nThen\nMan tiny\nThey are and\n[noise] [noise] [noise]\n...\n... ...\nSaddam ...\nHussein the plan is things can now I'm\nNo no no a little while\nUnderstand them clean and translate into a season now a ... ... ... ah\nMm\nWhy\nIt's\nThe man out I'm\nMighty cold\nAs his fiancee still\nMan has been the same issues you know that's a small\n\nNa na\n...\n\n\n\nDay is this is real child and you're listening to undercurrent\nIt's me one kid to each one\n...\nNa na na na\nNa ve parents\nPlane and I don't want to come\nOh yeah ...\nHave to pay a\nAnd\n\nNa\n\nAnd on\n...\n\n\nHey this is mark ... also known as Nadia one on under current American music with a passport\nBing bing bing bing bing bing bing bing bing people\n[noise]\n\nWay out there and\nThe ah day\nYeah you know\nNa\nAway I said\nThat hot recoup lonely road I think\nAbout it they deny\nThey say well nice\nA nice um\nThe NIH and well\n\nDo all this money go\nI Know that how we can do well\nAnd now I'm going to\nWhen you die\nThing you do then nine oh no no he\nWas then I thought it was in a way through the night oh\nMeant\nI'm\n... thanks for listening to on the Korean American music with a ...\n[noise]\nI spend all your parents\n\nYou know mom well\nAnd I'm\nSure we're going to be [laughter]\n[noise]\nWell we know\n\nTo be you back on\nNo no just the normal and we\nMay recall I Can't even have\nWhere we may and encourage you\nParrot no no we're\nPaying two day oh\nI\nTo you know\nI had\nDay ... and he goes you\n\n\n[noise]\nThat on our\n\n\n[noise]\n\nYou know\nYou know\nWhen\n\nA very close\n\nWay\nI even had\nWe me and because you\n\n\nWhat a great one from Trombone Shorty that's long weekend in front of that the the war give us a domino he'd with a new one from father John misty date night\nAnd Peter ... and ... meant give us meditation song it's under current I've got the law and if you're just joining a welcome here's Kerry rose ... and the Sacred Heart on under current\nAnd\nIt'll then brag in it they\nNo no well led mama took me out though I gave way and I'm\nThey're older you learn\n\nWhole year who ran my hand on I mean like like I don't\nDoes that went and I don't\nNeither one of\n\nAnd on", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Kingman", "day": "17"}