{"year": "2018", "station": "WVYA", "show_name": "Music from St. Stephen's", "month": "10", "state": "PA", "day": "07", "content": "[noise] we've been exploring what's new I Hope you've been entertained [noise] and that you'll stay tuned here for more find listening [noise]\n\nI'm Michael Barone this is pipe dreams from American public media\nA visit W. V. I. eighty nine point nine a pound W. V. I. H. D. one Scranton Wilkes Barre have golden ... eighty nine point seven MTV why each T. one Williamsport WTO eighty eight point three ... Mansfield and W. P. A. U. Ninety One point five at ... township\nStreaming live at W. V. I. N. dot org\nWhere there was ... one hundred point one and in ... while five point seven your oxen information station listener supported public radio W. V. I. S. [noise]\nFried ... rather than the six three great if I found that those are hardly have cell contribution to vocal music\nGretchen Wilkes Barre his building goldie ... several of M. W. B. Y. U. R. H. D. one Williamsport WTO eighty eight points ... Mansfield and ... are you not one point five of them ... township\nStreaming live a W. B. R. A. dot org we're in Lewis ... one hundred points one and a ... point seven there are some information station listener supported public radio W. V. I. S.\nFrench Schubert wrote some of history and the greatest arts on but those are hardly his soul contribution to vocal music on the next Chicago Symphony orchestra broadcast because ... conduct Schubert intimate math in each flat nature\nAlso music my neighbor and Wagner next time with a CSL ...\nDid not a turn on W. B. R. A. up [noise]\n\nMusic from St Stevens is made possible by donations from parishioners contributors unless there's like you in addition music from St Stevens presents lied year round concerts at St Stevens Episcopal Church in downtown Wilkes Barre learn more at S. T. S. T. A. P. H. E. N. F. W. B. dot org\nToday on music from Stevens we features selections from September twenty eight teams ... Stevens day service at St Stevens Episcopal Church\nWilkes Barre I'm Erika funky on the program music of saves off wrong Healy willing and more as service marks the return of the repaired and restored Berg house pipe organ\nAccording to kind of mark loud Bach organist and choir master at sea Steven parts of the Oregon and the ceiling and walls of the main organ chamber sustained water damage from Ruth leaks\nThose repairs to the organ and roof began in April and concluded only recently would begin today's program with the music of Haley women\nAnd Anglo Canadian organist and composer willing to compose more than eight hundred works including operas symphonies chamber music a concerto and pieces for band orchestra Oregon and piano but he is most likely best known for his religious music\nWilling was born in England in October Eighteen eighty and began his musical training at the age of eight studying at the sea saviors choir school in east burn\nHe continued it sent saviors until Eighteen Ninety five\nWhen he began working as organist and choir master at several London area churches he would emigrate to Canada in Nineteen Thirteen and he became organist and choir master of Toronto's largest church St Paul's blue streak\nIn Nineteen fourteen ... was appointed a lecture and examine or in music at the University of Toronto in Nineteen twenty the Toronto conservatory since Nineteen forty seven the royal conservatory of music appointed\nWilling as head of its theory department you would later become vice principal he passed away in February Nineteen sixty eight ... performs the fans there of really willing now on W. the I think\n[noise]\n\n[noise] Mm\nNa\n\n\n...\n\nMm\n\n\nMm\n\n\n\n\n\nIn\n[noise]\n...\n...\n...\nNa na\nNa na na\n\n\nNa na na na\nNa\n\n\nA ... a\nMan a\nOr\nNa\n\n\n\n\n[noise]\n[noise]\n[noise] [noise] [noise] ...\n...\n\n\nNa\n\nNa na na\nNa\n\n[noise] or [noise]\n\nUh\nNa\nNa na na na\nThe him go forward or gone on WB I ate before that the him by all your state still striving\nAnd we opened with the setting of some one fifty five days off from we've been listening to selections from September twenty eight teams St Stevens day service I think Stephen's Episcopal Church looks very will feature more selections from this service next week on the program\nThe recording engineer for music from St Stevens is Earl or cut the producer for W. B. I.\nA. is ...\n... a I\nA funky thank you were listening\n\nI'm Mark ... book the organist and choir mistress Stevens church and what's buried\nWith the return of our repaired underscored Burke else pipe organ we begin a full season of special about that will celebrate that return\nCoral even salt will be some buddies of St Stevens choir on Sunday October twenty first toward the em [noise]\nThem on Saturday November's bringing the chamber music society of northeastern Pennsylvania will have an eight PM concerts\nHello I'm Mark ... book the organist and choir master at St Stevens church and Wilkes Barre\nWith the return of our repaired and restored Berg house pipe organ we begin a full season of special events that will celebrate that return\nCoral even saw will be some buddies of St Stevens choir on Sunday October\nTwenty first four pm [noise]\nThen on Saturday November three the chamber music society of northeastern Pennsylvania will have an eight PM concerts [noise]\nAnd then on Sunday November for at ... pm the choral society of northeastern Pennsylvania perform [noise] and then the ... dedication recital of brick house pipe organ trail performance\nWill happen on Sunday November Eighteen\nLike hope you can join us for any or all of these special events and more\n\n[noise]\n\nMusic from St Stevens is made possible by donations from parishioners contributors in states like you in addition music from St Stevens presents light year round conscious Ted Stevens Episcopal Church in downtown ... expand right learn more an S. T. S. T. E. P. H. E. N. S. W. B. dot org\n... W ... not FM W. B. I. H. D. one scratching Wilkes Barre ... W. B. Y. eighty nine point seven that Williamsport WTO eighty eight we ... that means Bert Mansfield at lake while the pomp at W. P. ... Ninety One point five FM ... township\nVery Hazelden W. B. Y. U. eighty nine point seven five and Williamsport WTO eighty eight points ... Mansfield at lake woman pomp at W. P. A. U. Ninety One point five FM Palmyra township\nThis broadcast to the San Francisco symphony is made possible with the general support of red live in an Nancy Livingston of the ... foundation in memory of been an age of ... and\n\nThis was W ... W. B. I. H. D. one scribes Wilkes Barre handled and W. B. Y. ... Williamsport WTO eighty eight points ... um W. P. or you know the one point five of them ... township streaming live a W. B. I. I. dot org\nWe've translators and ... point three an east Strasburg ... three you're arts and information station listener supported public radio W. V.\nI. music from St Stevens is made possible by donations from parishioners contributors unless there's like you in addition music from St Stevens presents lied year round concerts at St Stevens Episcopal Church in downtown Wilkes Barre learn more at S. T. S. T. A. P. H. E. N. S. W. B. dot org\nToday on music from St Stevens we features selections from September ... teens ... Stevens day service at St Stevens Episcopal Church in books Barry I'm Erika funky on the program music of seeds are frog Healy willing and more\nThis service marks the return of the repaired and restored Burke house pipe organ according to kind of mock allow Bach organist and choir master ... Stevens parts of the Oregon and the ceiling and walls of the main organ chamber sustained water damage from Ruth leaks\nThose repairs to the organ on roofs began in April and concluded only recently we begin today's program was the music of Healy women\nAn Anglo Canadian organist and composer willing to compose more than eight hundred works including operas symphonies chamber music a concerto and pieces for band orchestra Oregon and piano\nBut he is most likely best known for his religious music\nWilling was born in England in October Eighteen eighty and began his musical training at the age of eight studying to see saviors choir school in east burn\nHe continued its saviors until Eighteen Ninety five\nWhen he began working as organist and choir master at several London area churches he would emigrate to Canada in Nineteen Thirteen and he became organist and choir master of Toronto's largest church St Paul's blue streak\nIn Nineteen fourteen ... was appointed a lecture and examine or in music at the University of Toronto in Nineteen twenty the Toronto conservatory since Nineteen forty seven the royal conservatory of music appointed\nWilling as head of its theory department the would later become vice principal he passed away in February Nineteen sixty eight ... performs the fans there of elite women now on W. V. I. okay\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nMan\nIn\n\n\n\nNa\nNa\nNa na na\nAnd\n\nIn ... and\n\n\n\n\n\n\n[noise]\n\n\nNa\nNa\nNa\n\n...\nOr or or\n\nUh\n\nI'm a [noise]\nThe him goals were were gone on WB I ate before that the ... by all your state still striving\nAnd we opened with the setting of some one fifty of stays on from we've been listening to selections from September twenty eight states Stevens day service I think Stephen's Episcopal Church looks like we'll feature more selections from the service next week on the program\nThe recording engineer for music from ... Stevens is ... ... ... the producer for W. B. I. A. is ...\nPutting engineer for music from St Stevens is Earl or cut the producer for W.\nB. I. A. is on those are\nThe ones that when he was he I ate I\nFunky thank you were listening\n\nHello I'm Mark Lubbock the organist and choir master at St Stevens church and Wilkes Barre\nWith the return of our repaired and resort Berg house pipe organ we begin a full season of special events that will celebrate that return\nCoral even saw will be somebody the St Stevens choir on Sunday\nOctober twenty first four pm [noise]\nThen on Saturday November's three the chamber music society of northeastern Pennsylvania will have an eight PM concerts [noise]\nAnd then on Sunday November for at ... pm the choral society of northeastern Pennsylvania will perform [noise] and then the ... dedication recital of the brick house pipe organ\n... performance\nWill happen on Sunday November Eighteen were\nI Hope you can join us for any or all of these special events and more\n\n[noise]\n\nMusic from St Stevens is made possible by donations from parishioners contributors in ... in addition music from St Stevens presents light year round conscious at St Stevens Episcopal Church in downtown ... learn more and S P S T e P. H. E. N. S. W. B. dot org\nThis is W. V. I. eighty nine point nine about W. B. I. H. D. one scratching Wilkes Barre he's written W. B. Y. eighty nine point seven am W. B. Y. each the one Williamsport WTO eighty eight point three up at ... Mansfield and W. P. I. U. ... one point five of them ... township\nScreaming live at W. B. I. I. dot org where Lewis ... what a hundred point one and his son very what\nAnd W. P. A. U. Ninety One point five ... township screaming learned the w._b. I ate dot org were Louis ... what a hundred point one and his son very well I don't buy point seven you're arts and information station listener supported public radio W. V. I. S.\nO. C. cloudy this evening with the thirty percent chance of showers in thunderstorms lows in the lower sixty partly sunny on Monday with the thirty percent chance of showers in thunderstorms hides in the upper seventies ... Monday Night with the thirty percent chance of showers lives in the lower sixties", "city": "Williamsport"}