{"year": "2018", "show_name": "Music from St. Stephen's", "day": "14", "month": "10", "state": "PA", "content": "We'll translators in Allentown that Ninety nine point three and in Bethlehem at one point seven\nListener supported public radio W. V. I. S.\n[noise]\nNext time with the Chicago Symphony orchestra and after a or divine nature of a second Antony Tex Mex turning and invented scored according to try to number three and the ... most ... and they have much time to Chicago and New York and I mean just any I\nTo night at ten music from St Stevens is made possible by donations from parishioners contributors in this day it's like you in addition music from St Stevens presents light year round concerts at St Stevens Episcopal Church in downtown Wilkes Barre learn more at S. T. S. T. A. P. H. E. N. S. W. B. dot org\n\nThe ... church in downtown Wilkes Barre learn more at S. T. S. T. E. P. H. E. N. S. W. B. dot org\n\nThey own music from ... Stevens we continue to feature selections from September twenty teens ... these days service\nI think there's a couple of church in were ... Hi I'm Erica funky on the program using ... W ... data good no I'm more but first music of William science\nScience was born in November Nineteen thirty four in Wales\nChild prodigy you began playing the piano the age of three and composed his first work at the age of five\nHe later attended ... with university where he was a member of the Elizabethan Madrigal seniors in Nineteen fifty four he would and the Gloria in X jumps each day oh for them\nTo science would also attend the royal Academy of music where he was elected the fellow in Nineteen sixty five in Nineteen sixty eight he was aboard the box society prize\n... Cohen international music awards he was professor of music and head of the department in the University of whales bankrupt from Nineteen Seventy until Nineteen eighty eight in Nineteen Seventy two he founded the north Wales international music festival and say gosh\nI Would serve as its director until his death in Nineteen Ninety to\nHis compositions include large scale works including an opera the servants three symphonies and three piano concerto as much of his music was written for the Anglican choral tradition most notably the anthem let the people praised the oh God\nWritten for the to lie Nineteen eighty one royal wedding of the prince and princess of Wales which had a television audience of an estimated one billion people worldwide\nCannon mock Lubbock organist and choir master I think Stephen's in Wilkes Barre along with the Stevens choir performed the Gloria in X Chelsea's of whether you must science now on your arts and information station [noise]\n\n\n\n\n\n\nAh\n\nAnd then ah and\nOh\n\nOr you know\n...\n\n\nOn the line between\nOn the bottom line\nIn ...\n\nThat was raised in\nOr who\nNa\n\nNo law ...\n[noise]\n\n... yeah\nMy mom yeah you know\n...\nYeah\nOh\n\n\n...\nAh no I oh\nYeah oh\n\n\nA\n\nLast\n\nNa na\nNa\n\n\n[noise]\n\n[noise] ooh\n[noise]\n\nOh\nNo\nAnd Oregon improvisation by ... I'm W the I hate before that the fanfare of John Cook and we opened the SAT we see him let us break bread together on our knees\nWe've been listening to selections from September twenty eight teams say Stevens day service at sea Stevens Episcopal Church in Wilkes Barre ... Stevens they service marks the return of the repaired and restored brick house pipe organ according to ... organist\nAnd choir master Stevens parts of the organ and the ceiling and walls of the main organ chamber sustained water damage from roof leaks\nThose repairs to the organ and root began in April and concluded only recently we hope you enjoy today's program the recording engineer for music from St Stevens is ... or cut the producer for W. V. I. A. is polling lives are\nKind of ... is the organist and choir master Stevens Episcopal Church\nBut W. B. I. A. I. now ... thank you for listening [noise]\nHello I'm Mark ... the organist and choir mastered sing Stevens Wilkes Barre\nInviting you to join us next Sunday October Twenty one at four pm\nForest Service of coral even saw\nSome by are seen Stevens choir [noise]\nEven song is one of the most beautiful the church of traditions and Anglican Church music [noise]\nService of Sunday evening prayer\nIn which spoken prayers and scripture readings are combined with prayers son responsibly between the fish and and the lawyer\nSaddam's sons to anger to ... [noise]\nThe ... and ...\nSong in very coral settings\nHandsome hymns and [noise]\nEven song is some throughout the world and to the evils chapels and churches\nA grand tradition that continues to inspire millions weekly throughout the world\nWe hope you can join us next Sunday the twenty first it for\nGrand tradition that continues to inspire millions weekly throughout the world\nWe hope you can join us next Sunday the twenty first at four o'clock at St Stevens for our version of continuing this tradition [noise]\n\nMusic from St Stevens who's made possible by donations from parishioners contributors in ... like you in addition music from St Stevens presents ... year round concerts at St Stevens Episcopal Church in downtown Wilkes Barre learn more an S. T. S. T. E. P. H. E. N. S. W. B. dot org\nThis was WB ... W. B. I. H. D. one scratch and we'll very hateful to W. B. Y. eighty nine points evidence that Williamsport WTO eighty eight points ... that means ... Mansfield at least one of the combat W. P. A. you not to one point five of them all my retail ship\nAnd translators W to want to eighty seven to eight nine ... son dairy W to zero seven eight Williamsport end up to Seventy eight wells borough listener supported public radio [noise]\nOn this week's broadcast the San Francisco to use the director Michael do and how much brings out all the colors of the orchestra stolen and whole sections of the company get a chance to shine individually and collectively by bars on Mozart's and Samuel Adams that next time with the San Francisco to thing\nThank you for listening and hope you'll join us for the next broadcast covered by the San Francisco so [noise]\nThis broadcast of the San Francisco symphony is made possible with the general support of friends\nLive in an Nancy Livingston of the ... foundation in memory of Ben and a Jess ...\n\nThis was WBRC eighty nine point nine of M. W. B. I. H. D. one scrounging Wilkes Barre eagles and W. B. Y. U. eighty nine points that whatever Williamsport WG audio idiot going three of their means ... Mansfield and W. P. I. U. Ninety One point five and ... streaming live a W. V. I. A. dot org\nThe puck spilt translator at Ninety four point nine of them is made possible with support from the Richard el ... junior charitable foundation\n\nMusic from St Stevens is made possible by donations from parishioners contributors and listeners like you in addition music from St Stevens presents lied year round concerts at St Stevens Episcopal Church in downtown Wilkes Barre learn more at S. T. S. T. E. P. H. E. N. S. W. B. dot org\n\n\nThey own music from St Stevens we continue to see just elections from September twenty teens safety these days service I think Steve is a global church in with just behind the funky on the program music of re W. or when David good enough anymore but first music of William science\nScience was born in November Nineteen thirty four in Wales\nChild prodigy you began playing the piano at the age of three and composed his first work at the age of five\nHe later attended ... with university where he was a member of the Elizabethan Madrigal seniors in Nineteen fifty four he would ban the Gloria in X Chelsea stale for them\nThe science would also attend the royal Academy of music where he was elected a fellow in Nineteen sixty five in Nineteen sixty eight he was aboard the box society prize above ... Cohen international music award\nHe was professor of music and head of the department in the University of whales bankrupt from Nineteen Seventy until Nineteen eighty eight in Nineteen Seventy two he founded the north Wales international music festival in say ... I\nWould serve as its director until his death in Nineteen Ninety to\nHis compositions include large scale works including an opera the servants three symphonies and three piano concerto as\nMuch of his music was written for the Anglican choral tradition most notably the anthem let the people praised the oh God written for the July Nineteen eighty one royal wedding of the prince and princess of Wales which had a television audience of an estimated one billion people worldwide\nCannon mock Lubbock organist and choir master at St Stevens in Wilkes Barre along with the St Stevens choir performed the Gloria in X Chelsea's of whether you must science now on your arts and information station [noise]\n\n\n\n\nNa\n\nNa na na\nNa na na na na na na\nNa na\nNa na na\nOh\n\nOr ...\n\n\nI I mean\nThe online\nIn ...\nKnees and\nMan oh\nWho\nNa\n\n\n\n\n... yeah\nMy mom yeah you know\n\n[noise]\nYou know\n... on the on the line\nKnow\n\n\n\nA\nLaw school\n\n... a a man\nA\n\n\n[noise]\n\n\nOoh\n\n\nOh\nNo\nAnd Oregon improvisation by ... um W. V. I. he before that the fanfare of John Cook we opened the ... with the him let us break bread together on our knees\nWe've been listening to selections from September twenty eight teams say Stevens day service I think Steven ... church in Wilkes Barre distinct Stevens day service marks the return of the repaired and restored brick house pipe organ\nAccording to ... organist and choir master think Stephen's parts of the Oregon and the ceiling and walls of the main organ chamber sustained water damage from roof leaks\nThose repairs to the organ on roofs began in April and concluded only recently we hope you enjoy today's program the recording engineer for music from St Stevens is ... or cut\nThe producer for W ... and he is Paul lives are\nKind of ... is the organist and choir master ... Stevens a prescription trench\nOr W. B. I. A. I'm Erika funky thank you for listening [noise]\nHello I'm Mark ... the organist and choir master at St Stevens Wilkes Barre\nInviting you to join us next Sunday October Twenty one at ... pm\nForest Service of coral even saw\nSome by our St Stevens choir\nEven song is one of the most beautiful the church's traditions an Anglican Church music\nService so Sunday evening prayer\nIn which spoken prayers in scripture readings are combined with careers son responsibly between the fish and and the lawyer\nSaddam's sons to anger Tim ... [noise]\nThe ...\nSong and very coral studying acquire in some ... in Oregon [noise]\nEven selling his son throughout the world and to lead roles chapels and churches\nA grand tradition continues to inspire millions weekly throughout the world\nWe hope you can join us next Sunday the twenty first at four o'clock at St Stevens for our version of continuing this tradition [noise]\nMusic from St Stevens is made possible by donations from parishioners contributors in ... like you in addition music from St Stevens where you can slide year round concerts at St Stevens Episcopal Church in downtown ... learn more at S. T. S. T. E. P. H. E. N. S. W. B. dot org\nThis is W. B. I. eighty nine point nine a pound W. B. I. E. cheap one scratching we'll ... we'll W. B. Y. it'd be nice point seven up that Williamsport nobody TI eighty eight point three up that means ... Mansfield and W. P. A. U. Ninety One point five FM ... ship streaming\nI'm going to have enough in Williamsport nobody TI eighty a queen three up that means ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live a W. V. I. A. dot org we'll translators in Allentown at Ninety nine point three and in Bethlehem at one of my point seven\nListener supported public radio W. V. I. S.\nProgramming on WB I have made possible by our members and by auto bookstore", "station": "WVYA", "city": "Williamsport"}