{"month": "10", "state": "PA", "station": "WVYA", "content": "Streaming live a W. V. I. A. dot org we have a translator and collect so much at Ninety point three up in your arts any information station listener supported public radio W. V. I.\nS. uh\nSome of the opioid epidemic using a men's public health crisis of our time now WBRC as a proud partner with families service association of northeastern Pennsylvania for the ninth annual national family we conference a community built to conquer opioid addiction\nFriday October twenty six at the best western plus genetic hotel in conference center in books very\nTwelve workshops focusing on different aspects of the opioid crisis details in registration at\nBest a and E. P. A. dot org\nThey were the sounds of recent Oregon projects from the shops are normally Dobson Reuters parking at churches a custard hose home and abroad with shorter was Jonathan Brian ... Peterson\nAn orderly option Voyager and parking and churches and concert halls at home and abroad ... Jonathan Ryan\n... Peterson ... Rick Scott fun to watch the news this week on ... from American public media or Michael Barone religion [noise]\nSunday Morning at six on W. V. A. F. [noise]\nProgramming on WB I made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nLive from NPR News in Washington I'm core of a cold and the FBI has wrapped up its supplemental background check of Supreme Court nominee Brett Kavanaugh but questions have been raised about the scope of the investigation NPR's Ayesha Rascoe has more details about the probe\nA White House official confirmed that the FBI interview nine people during its latest review the White House asked the FBI to reopen the background investigation after Kavanaugh faced accusations of sexual misconduct from decades ago\nKevin has strongly denied all allegations against him some of the people interviewed by the FBI includes having a high school friends and one of Kavanaugh's accuser Deborah Vermeer as\nChristine Blasey Ford the first woman to publicly accuse Kevin not sexual assault was not interviewed Kavanaugh also did not face additional questioning from the FBI\nDemocrats have argued that Ford Ann Cavanaugh should have been included Ayesha Rascoe NPR News\nThe Justice Department is charged seven Russian intelligence officials with computer hacking\nThey're accused of trying to destabilize the world anti doping organizations and officials who exposed Russian state sponsored doping a Russian athletes\nThe west charges come after Dutch officials alleged earlier that Russian agents try to sabotage an international chemical weapons watchdog agency fits all over guard has more\nThat's intelligence forces stopped the cyber attack on the organization for the prohibition of chemical weapons as soon as it were discovered back in April according to the country's defense minister who released the information today for Russians on diplomatic passport were immediately expelled from the country and she said\nAt the time of the attempt in cyber attack the OTC W had been investigating a nerve agent used in the poisoning of a former Russian spy in England official say the same Russian intelligence unit and also expected of trying to steal information about the investigation into the two thousand fourteen Malaysia Airlines crash over Ukraine\nFor NPR News I'm a little regard in Denmark\nOfficials in Indonesia plan to reopen an airport in the city that was worst hit by last week's earthquake and tsunami NPR's Lauren Frayer reports from Jakarta the facility will now start accepting civilian flights\nThe air traffic control tower at the ... airport toppled in last week's earthquake baggage carousel there strewn with debris computers are down boarding passes a written by hand\nSurvivors have been camping out waiting to escape getting the airport up and running is critical for evacuee ease and also for incoming supplies food clean water fuel and mosquito nets\nLauren Frayer reporting from Jakarta, Indonesia and officials say more than fourteen hundred people have died on Wall street the Dow Jones industrial average is down nearly two hundred points at twenty six thousand six hundred thirty to the NASDAQ is down Ninety five points Seventy nine hundred and thirty more than one percent the F ...\nPoints at twenty six thousand six hundred thirty to the NASDAQ is down Ninety five points Seventy nine hundred and thirty more than one percent the up and the five hundred is down Eighteen points this is NPR\nAuthority than Florence South Carolina have identified the suspected gunman in yesterday's shootout with law enforcement officers they allege Frederick Hopkins is the man who killed one police officer and wounded six other law enforcement agents\nThe gunfire was so intense official sent in a bullet proof vehicle to rescue those who were wounded\nSome public beaches in Miami Beach Florida and have been closed due to the spread of toxic algae known as red tide NPR's Greg Allen reports a year long red tide bloom in the Gulf of Mexico has now become affecting Florida's Atlantic Coast\nIn high enough concentrations red tide algae emitted talks and that can affect fish dolphins manatees sea turtles and humans beach communities on Florida's Gulf Coast have struggled with red tide now since last fall moving tons of dead fish from beaches dozens of dolphins and more than a hundred manatees have also died\nNow state and county officials say red tide is migrated from the Gulf to the Atlantic carry bi coastal currents in the Gulf Stream\nFish kills had been reported in St Lucie in Palm Beach county because it causes respiratory irritation most beaches in Palm Beach county had been closed red tide is now also been detected in Miami Dade County officials have closed beaches on the northern end Miami Beach Greg Allen NPR News Miami\nWon Romero the former Los Angeles busboys scene in an iconic photograph of the assassination of Robert F Kennedy in Nineteen sixty eight has died the Los Angeles times reports that Romero was sixty eight in the photograph Romero it's seen kneeling next to Kennedy cradling him moments after he had been shot\nEncore of a Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nProgramming on W. V. I. is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nGood morning America funky it will be partly sunny late this morning becoming mostly cloudy through the day with a chance of showers and a slight chance of thunderstorms this afternoon highs in the low seventies chance of rain forty percent\nMostly cloudy overnight with a chance of showers and a slight chance of thunderstorms in the evening it will be less humid with Lowes overnight in the upper forties and wins out of the north coast in up to twenty miles per hour\nFriday calls for mostly some of these guys and ties in the mid sixties\nSupport comes from the semi art museum the Democrat museum invites you to explore art from an evil manuscripts to surrealism with two locations to serve one on the Bucknell campus on another in downtown St Louis bird all events are open to the public more museum dot ... dot edu\n[noise]\nI grew up on a pool table claimed Philip Marcus I Lived on the streets practically all days days and nights both [noise]\nWe used to sneak into the burlesque houses or early all night places I'm ... Madison Street in sleep they're the only trouble was that the ashes would come around and throw the flashlight in your face to see if you were awake\nStreet in sleep they're the only trouble was that the ashes would come around and throw the flashlight in your face to see if you were awake you wasn't supposed to go to sleep sometimes they threw us out\nBill up markets didn't really grow up on a pool table when he was eight he ran away from the ... where he lived with his mother and two brothers he supported himself I selling newspapers [noise]\nFrom the award winning study kids on strike by Susan ... a writer and teacher who lives and works here in northeastern Pennsylvania [noise] even short see and then she sketches out that\nScene in a compelling way and it would make a wonderful episode in a movie or a play we can see the light shining on the eyes of the sleepy boys\nBut that's not all that often Letty as let flow from her and she has a passion for bringing young people young people together with the history and she's created the fictional character Finn Reardon who is as we're told by Maria Johnson Gruber in a review from two thousand three\nOf the diary of been rewritten a news the New York city Eighteen Ninety nine by Susan Campbell marital Eddie [noise]\nBeen written is a clever boy the kind of boy who get good grades without having to study all the time he also has a job that he loves when he isn't in school in the afternoon and evening spin is a news he he sells newspapers that he buys from the newspaper company\nIn his case he sells the journal a newspaper put out by Randolph Hurst a multi millionaire", "year": "2018", "show_name": "ArtScene", "city": "Williamsport", "day": "04"}