{"month": "10", "state": "PA", "station": "WVYA", "content": "Fresh air with Terry Gross jazz tonight with George and Paul bizarre and beyond Apollo keep you informed the w._b. eyeing his desk good reasons to stay with us enjoy this day enjoyed the music and we will catch him one day\n\nThis is W. V. eight eighty nine point nine a pound W. V. I. H. D. ones granted wheelchair he's holding in Williamsport W. B. Y. eight eighty nine point seven event in Mansfield WTO eighty eight point three ... fan and at lake well and pop back\nW. P. A. U. Ninety One point five FM streamline the W. B. A. dot org we're in Allentown Ninety nine point three any Bethlehem at one of five point seven\nSupportive public radio W. V. I. S.\nThursday October Eighteenth as your last chance to vote for your favorite novels in the great American read until the end you can vote everyday details or W. B. I. A. dot org slash great American then joined WB I Am the Lackawanna county library system for a grandson\n... and at lake while I'm pop back W. P. A. U. Ninety One point five FM streaming live adult V. I. A. dot org we're in Allentown Ninety nine point three and in Bethlehem at one of five point seven member\nSupportive public radio W. V. I. S. [noise]\nThursday October Eighteenth as your last chance to vote for your favorite novels in the great American read until the end you can vote everyday details or W. B. I. dot org slash great American Reid joined WB I Am the Lackawanna county library system for a grand finale parties\nWith prizes refreshments in ... as we watched the final episode counting down to the announcement of America's favorite novels Tuesday October twenty thirty seven thirty at the ... library collection Halloween costumes are welcome for this free family events with W vi a\nWait wait wait don't tell me gives you what you've always needed a break from the news astronaut Scott Kelly tells us why you need to double check your eminent as when floating in space ... reveals for most challenging role in months during the day and we hear often go be terrible ... of the exploding lasagna\nBitter said will join us for a mini vacation for your soul and the news quiz from in the U.S [noise]\nTo borrow morning at ten Sunday evening a seven on W. V. I. A. F. M.\nSupport for WBAI comes from the ... valley corral\nPerforming heightens creation Saturday October twenty seven thirty and Sunday October twenty first at three at designed Lutheran Church and so I'm very profound and playful heightens creation plans elements of handles baroque oratory of with features of heightens Newark classical style\nFeatured soloist our listener Rocco Brian next door and Lucas leddy for tickets as the sea music dot org and at the door [noise]\nMine from NPR News in Washington I'm core of the Coleman authorities in the U.S southeast are still assessing damage from hurricane Michael they say at least eleven people have been killed because of the storm Virginia officials reported five of the deaths this morning\nMichael came ashore in Florida's panhandle on Wednesday is a very powerful category for hurricane FEMA director Brock Long says the site of its landfall Mexico beach is devastated\nAnd so when you look at this uh the damage in Mexico beach that is where the ocean rows potentially fourteen feet with wave action on top and just shove buildings out of the way\nEmergency responders in North Carolina reported flash flooding in Charlotte and Raleigh teams and to rescue motorists from rising water it's estimated about a million customers lack power in the south east the path of destruction included a direct hit on the tend to air force base near Panama City Florida\nNPR's Greg Myre e reports the air force was prepared\nAirplane hangars where shredded roofs were peeled off buildings and retired fighter jet that was on display at the Kendal base was torn from its foundation your forces still assessing what it calls widespread catastrophic damage the personnel into hugely expensive planes were evacuated before the storm hit\nThe window bases on land the jets into the Gulf of Mexico in his home to more than fifty after twenty two stealth fighters which costs more than three hundred million dollars apiece\nThose planes are now safely parked at the Wright Patterson air force base in Ohio\nGreg Myre NPR News Washington\nNational Hurricane center says tropical storm surge was crossing Baja California\nThat storm is expected to break up as it passes over Mexico today the storm's remnants will move into southern Arizona New Mexico and Texas over the weekend bringing heavy rain Hurricane Center is warning of the chance of life threatening flash flooding\nA Turkish court has ordered the release of an American pastor held for nearly two years NPR's Peter\nOr enough safely parked at the Wright Patterson air force base in Ohio Greg Myre NPR News Washington\nThe national Hurricane Center says tropical storm Sergio was crossing Baja California that storm is expected to break up as it passes over Mexico today the\nStorm's remnants will move into southern Arizona New Mexico and Texas over the weekend bringing heavy rain the hurricane center is warning of the chance of life threatening flash flooding\nA Turkish court has ordered the release of an American pastor held for nearly two years NPR's Peter Kenyon reports winning the release of pastor Andrew Brunson has been a top priority for the Trump Administration\nAccording western turkey convicted Brunson on terror related charges and issued a sentence of more than three years in prison but the judge is also ruled that because of time already served Britain should not have to serve the rest of that sentence and they lifted restrictions on his movement clearing the way for him to be returned to the U.S\nRugs and was arrested and late twenties sixteen as part of a massive roundup of suspect following a failed coup attempt against the government of president reject type baritone want\nThis summer the White House believed it at one agreement from here to wander released Brunson but he was simply moved from Britain to house arrest us sanctions on turkey followed and analysts say hunker it will be hoping those will be lifted now that brings in his cleared to return home Peter Kenyon NPR News Istanbul\nOn Wall street the Dow is up two hundred and eighty five points then that decades up one hundred fifty two points you're listening to NPR News\nThe Vatican says Pope Francis has decided to accept the resignation of cardinal Donald Wuerl of Washington D. C. world who turned Seventy eight next month is involved in the church is sexual abuse scandal\nA grand jury report in Pennsylvania has alleged that world while the bishop in Pittsburgh helped shield some praised accused of molesting children\nA new analysis of dietary supplements finds more than seven hundred supplement products have been found to contain unapproved pharmaceutical ingredients that can be harmful NPR's Allison Aubrey reports the most common adultery and send over the counter supplement include drugs for weight loss and synthetic steroids\nOver half of adults in the U. S. report using some dietary supplements and this study researchers eat food and Drug Administration data to analyze warnings sent to supplement manufacturers when products were found to contain unapproved ingredients\nOver ten year period the authors identified seven hundred and Seventy six adults are rated dietary supplements\nPeter how I end up Harvard Medical school\nConsumers should be aware\nWhen it comes to soften the FDA doesn't that the supplements before they appear on store shelves but the FDA is responsible for removing dangerous off once once they're detected\nThis study is published in the journal jama network open Allison Aubrey NPR News\nThe Saudi Arabian ambassador to the U.S is returning to Riyadh as the controversy grows over the fate of missing Saudi journalist ... the state department says it wants to know any information the ambassador may have about the case when he returns I'm corporate Coleman NPR News\nSupport for NPR comes from NPR's Beijing\nOther contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nSupport comes from the semi art museum the Democrat museum invites you to explore art from an evil manuscripts to surrealism with two locations to serve one on the Bucknell campus and another in downtown St Louis bird all events are open to the public more museum ... Bucknell dot edu\nGood morning America funky it will be parts\nTributaries include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nSupport comes from the Senate art museum the Democrat museum invites you to explore art from an evil manuscripts to surrealism with two locations to serve one on the Bucknell campus and another in downtown Lewis bird all events are open to the public more museum dot ... dot edu\nGood morning America funky\nIt will be partly sunny today was highest in the mid fifties wins out of the northwest gusting up to thirty miles per hour mostly cloudy overnight showers likely after midnight and those around forty and chats rent Seventy percent\nOn Saturday cloudy with showers likely in the morning they come and partly sunny through the day with eyes in the low fifties and chance of rain Seventy percent\nOn Sunday mostly sunny hides in the mid fifties but there's this note on Saturday Night partly cloudy in the evening mostly clear overnight with a possibility of some patchy frost and lows in the mid thirties\nArt scene now with W. V. I. A. stealing a power\n[noise]\nThe new season for the Williamsport symphony orchestra begins on Tuesday up to the sixteenth at the community center\nIn Williamsport when maestro ... Rondo Edelstein in his ninth year as the symphony conductor\nLift his best to conduct the opening concert which has been cold passion and nature [noise]\nOutta Edelstein came into the Wu the IRA William ... me to talk about the upcoming season [noise] I'm the first concept [noise]\nThis is my ninth season believe it or not you know times goes extremely fast for all of us unfortunately but an incredibly rewarding and fantastic journey because I I feel like on every season we were a keeper bow to\nBring to our wonderful audience is great music and performed at the very high level\nAnd performed with passion authenticity and honesty I'm very grateful for that I'm very grateful for silver tuned in for the results and for these community for being so supportive\nAnd I would like to invite everybody one's more to to come to our\nNews is on to our concerts that will feature fabulous\nSoloist in again incredible music\nI think I mentioned every year or the way we put together to these programs\nAre not by accident or not by just okay ... with these other peas or you know whatever to come to our minds we seriously think about uh programs that will appeal to different people always having in mind that we want to bring new audiences to our concerts you know younger audiences", "show_name": "ArtScene", "year": "2018", "city": "Williamsport", "day": "12"}