{"month": "10", "state": "PA", "station": "WVYA", "content": "Good reason to stay with us nice weather staying with that's a little uh on the on the warm side but Erika will have a full whether rundown in just a matter of minutes\nEnjoy this day enjoy the music will see tomorrow\nThis was WBRC eighty nine point nine of M. W. B. I. H. D. one granted Wilkes Barre ... and we're in Williamsport at W. B. Y. U. eighty nine point seven FM your best to build a W T I O eighty eight point three of them were like well I'm a pack a W. P. A. U. Ninety One point five of them\nStreaming live a W. V. I. A. dot org we have a translator and Clark so much at ... three of them you're arts and information station which would have supported public radio W. V. I. S.\nJoined us for a celebration of one hundredth anniversary of the birth of butter\nOn Sunday afternoon at three Gary a bird at all with Richard McDonald's\nWork and the west Side Story as one of the early ... I read up on the w._b. I ate\nW. P. A. U. Ninety One point five of them streaming live at W. V. I. A. dot org we have a translator and Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I. S.\n[noise] joined us for a celebration of one hundredth anniversary of the birth of letter\nOn Sunday afternoon at three Gary and burn it at all with Iran is Richard McDonald's\nStage where you can do to west side\nStory as one of the early on WB I ate out of the Dietrich theater invite you to enjoy this concert in the theater make reservations double the eight or ...\nOr so seven zero six five five to eight\nTonight at seven and all that jazz will be spotlight he knew jazz recordings including one from bassist Christian McBride the mixed bag starts to date with this at a recent rock singer songwriters that eight thirty it's mixed bag new releases then at night it's homegrown music with an encore featuring singer songwriter young close thin\nUnhealthy ways well then you know your attention\nThat this is George Graham joined us tonight starting at seven on WB I\nThe Williamsport simply conducted by maestro Edelstein opens October sixteenth with works by ... and Brian Grammy nominated in chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nSport symphony October sixteenth at the community art center five seven zero three to six twenty four twenty four or Williamsport symphony dot\nOrg sponsors who the capital group at my coming college\nLine from NPR News in Washington I'm core of a Coleman United Nations ambassador Nikki Haley says she is stepping down NPR's Scott Horsley reports Haley it's expected to leave her posted the world body at the end of this year Haley's departure\nTook the international community by surprise that President Trump says Haley told him six months ago but she wanted to take some time off\nTrump praised Haley service at the United nations man said he hopes she'll return to his administration in some other capacity in the future Hayley the former governor of South Carolina is thought to have political ambitions beyond the EU and she told reporters she won't be mounting a presidential campaign anytime soon\nAnd plans to campaign for Trump's re election in twenty twenty Scott Horsley NPR News the White House\nThe national Hurricane Center says hurricane Michael tops sustained winds of one hundred ten miles per hour it's\nGetting stronger as it moves toward Florida's Gulf Coast NPR's Windsor Johnston reports that strong category to storm is expected to make landfall tomorrow along the panhandle of Florida as Big Bend area as a major hurricane\nResidents in the path of the storm are boarding their homes and preparing to evacuate federal emergency management agency spokesperson jets fired says Michael will bring a life threatening storm surges and all warnings should be taken seriously\nThe main thing that we ask you to do is to evacuated asked to do so that is the most important role you can play or to protect yourself but also to protect the lives of our first responders we asked if you do not put the our first responders in harm's way ah if they have to come and try to rescue you and you've been asked to evacuate\nForecasters say Michael is expected to make landfall on Wednesday states of emergency had been declared in thirty five Florida counties Windsor jumped in NPR natives\nResearchers say they've identified another Russian spy accused of trying to poison former Russian double agent Sergei Skripal in England Matthew bother reports from Moscow is another high\nYour self but also to protect the lives of our first responders we asked if you do not for the our first responders in harm's way of if they have to come and try to rescue and you've been asked to evacuate\nForecasters say Michael is expected to make landfall on Wednesday states of emergency had been declared in thirty five Florida counties Windsor jumped in NPR natives\nIndependent researchers say they've identified another Russian spy accused of trying to poison former Russian double agent Sergei Skripal in England Matthew Bodner reports from Moscow at least another highly publicized issue for Russia's military intelligence service\nInternet food that bell in cat have identified the second suspect industry Paul investigation as Russian military intelligence officer Alexander Michigan but the Kremlin told reporters in Moscow today that it will no longer engage with journalists on these mounting allegations\nTwo weeks ago battling cut identified the first thoughts back is decorated military intelligence officer and it totally ... Russia initially explained that the two men were simply sports nutrition salesman on holiday in the u._k.\nThe Kremlin at since facing mounting wave of allegations that had military intelligence service is conducting offensive operations across the west for NPR News I'm Matthew Bodner in Moscow\nOn Wall street the Dow Jones industrial average down sixty three points at twenty six thousand four hundred twenty six thirty at Seventy seven sixty six [noise] this is NPR\nNASA sent the renowned Hubble Space telescope has shut down into safe mode that's because the piece of equipment a gyroscope failed last friday scientists are not able to point the telescope in the direction they want to look on science observations have since been suspended in\nA federal judge in Texas has declared a decades old law unconstitutional the Indian child welfare act gives preferential adoption placement to a native child family tribe or other Native Americans need hedging of Yellowstone public radio reports on the case that seeks to overturn it\nLast year at Texas a couple of tried to adopt a native toddler they we're fostering over visions within the Indian child welfare act requires the government place that child with an indigenous family instead intervening on behalf of the couple of the state of Texas sued and now a federal judge says the law is unconstitutional\nDavid Simmons is with the national Indian child welfare Association He says the ruling has a chilling effect on at risk native families\nAnd our concern is what does this do to those families what kind of days or does it pushed them and what additional trauma well they have to receive\nThe law was first elected in the Nineteen seventies after studies showed nearly a third of all native children were being forcibly removed from their families and communities and placed in state welfare systems for NPR News I'm hedging in Missoula, Montana\nTo Brazilian presidential candidates are campaigning for that country's presidential runoff election October twenty eight far right candidate and former army Captain John ... so narrow will face former Sao paulo mayor Fernando ... of the leftist workers' party\nI'm core of a ... NPR News in Washington\nSupport for NPR it comes from NPR stations other contributors include the University of Florida we're solving for next is powered by its land grants heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nSupport comes from the semi art museum the Democrat museum invites you to explore art from an evil manuscripts to surrealism was two locations to serve one on the Bucknell campus and another in downtown St Louis bird all events are open to the public more museum dot ... dot edu\nMorning America funky there's some real breakthrough it will become partly sunny today with high in the upper seventies\n[noise] ... land grants heritage from renewable energy for global health us students and researchers are working to solve challenges at ... dot UFO dot edu\nSupport comes from the Senate art museum of art museum invites you to explore art from an evil manuscripts to surrealism was two locations to serve one on the campus and another in downtown to assert all events are open to the public more museum dot dot edu\nGood morning America funky the sun will break through it will become partly sunny today with high in the upper seventies it will be mostly cloudy tonight with patchy fog after midnight lows in the sixties sometimes on tomorrow partly sunny was patch you fall in the morning and ... in\nThe upper seventies art scene now on W. V. I. A. O.\nA press release for the event was released which read\nThe ... area high school alumni association will sponsor Judy Shepard president and founder of the Matthew Shepard foundation at the weather Lee area middle school auditorium on Wednesday September twenty six twenty Eighteen\nThe first program a student assembly will begin at nine thirty AM it will be followed by an evening for um for the communities of northeastern Pennsylvania also held in the ... area and middle school auditorium at seven pm\nThere is free admission and parking for everyone in attendance\nThe noticed continues in Nineteen Ninety eight Matthew Shepard a Twenty one year old college student at the University of Wyoming was brutally beaten beyond recognition tied to a fence and left to die\nMatthew to come to his injuries four days later\nHis mother Judy Shepard founded the Matthew Shepard foundation and through her effort the United States Congress passed the Matthew Shepard James Byrd hate crimes legislation\nAnd President Obama signed into law Mrs shepherd travels globally on a mission to one day it race hate\nThe foundations model\nFrom a press release to invite the community to attend a special event between both Judy I'm Dennis shepherd the parents of Matthew Shepard presented by the weather Lee area high school\nAlumni association on September twenty six here in northeastern Pennsylvania\nThe visit by the shepherd's coincides with the ... anniversary of their son's death in ... on October twelve [noise]\nAs it happens the University of Scranton players will open their production on the Laramie project a play that explores the murder and the community of which the shepherd family was apart on the twentieth anniversary itself", "show_name": "ArtScene", "year": "2018", "city": "Williamsport", "day": "09"}