{"month": "10", "state": "PA", "station": "WVYA", "content": "Streaming live at W. V. I. A. dot org we have a translator in Clark summit at Ninety point three up in your arts any information station listener supported public radio W. V. I. S.\n\nEvery day thousands of Pennsylvania and mothers fathers children neighbors struggled to overcome addiction\nThat is why Pennsylvania's public media stations have come together for battling opioid series of educational programs that focus on increasing awareness and reducing the stigma around opioid addiction to the story to find the resources available to you is it badly opioid dot org together\nWe can save lives major funding provided by guys sugar\nHigh on Chris daily hopes to buy from here are some times rockets sometimes poignant always excellent variety show each week we fill your public radio tote bags tropical and music and comedy for lunch time favorites to new discoveries you didn't even know what you were looking for I Hope you'll join me this weekend for killer show with comedian type ... position Diana Gordon\nFor a long time favorites to new discoveries you didn't even know what you're worth looking for I Hope you'll join me this weekend for killer show with comedians talk Barry ... Diana Gordon and the one the only Jeff Tweedy turn on tune in ... on\nSaturday Night at ... Sunday night at eight on W. V. I. A. F. M.\n\nAnd coming up and just a few moments the latest news from National Public radio and then art scene with Erica funky followed by fine classical music\nLarry Waco taking it through the afternoon and the classical style until four then we'll during National Public radio for all things considered fresh air with Terry Gross just tonight with George Graham and all that jazz and mixed bag\n... keeping uniform from the w._b. I a news desk the news from NPR is next live from NPR\nNews in Washington I'm core of a ... at least three more suspicious device that have been discovered today that are similar to those that were sent to democratic officials and activists this week\nTwo packages were addressed to former vice president Joe Biden they turned up in the Delaware postal facility the third was sent a liberal activist and actor Robert De Niro New York city Mayor Bill de Blasio told CNN Today that package was found early this morning in lower Manhattan\nWhat we have to recognize is we should expect more of these in the meantime so yes this morning Robert De Niro his office a thank God because of an eagle eyed security employee or no one was hurt or the device was removed successfully bought in life you do\nAt least ten suspicious packages have now been sent some of the people addressed her former president Brock Obama and former secretary of State Hillary Clinton\nPresident Trump is calling for civility in light of pipe bombs being sent to his political enemies but as NPR's Tamara Keith reports Trump is not let up on his attacks on the media\nPresident Trump told the rally crowd he wants all sides to come together in peace and harmony but not even twelve hours later he tweeted out blame to the media\nQuote a very big part of the anger we see today in our society is caused by the purposely false and inaccurate reporting of the mainstream media that I referred to as fake news\nFormer CIA director and Trump critic John Brennan who was targeted with one of the packages responded on Twitter telling the president to stop blaming others and look in the mirror saying Trump's inflammatory rhetoric and encourage mental physical violence are disgraceful the package was addressed to Brennan care if CNN\nAnd networks Trump frequently attacks ... NPR News\nBoston has taken game to the world series at home in Fenway Park the red Sox defeated Los Angeles Dodgers forward to to last night from member station WVU are Shira Springer says Boston hold the two games to none lead\nThe games big hit was a single to right field by the red Sox JD Martinez the hit with the home team ahead for good and because it came with two outs and the fifth inning and kept a three run rally Martinez said at showcase the red Sox relentless off and\nShe ... she previews and ... and just keeping the London\nMeanwhile on the mound Red Sox started David prices got the when he granted his way out of the bases loaded gym in the fourth and pitch six solid innings allowing only two runs on three hits game three takes place friday at Dodger Stadium in Los Angeles for NPR News I'm Sheera Springer in Boston\nOn Wall street the Dow Jones industrial are up two hundred fifty six points or more than one percent the NASDAQ he's up one hundred sixty points or more than two percent you're listening to NPR CIA direct\nPercent an abductees up one hundred sixty points or more than two percent you're listening to NPR\nCIA director Gina Haspel is going to brief the President Trump today about the investigation into the killing of Saudi dissident journalist ... in Turkey Saudi Arabia has changed its story yet again and now admits he's killing was premeditated\nUkrainian filmmaker imprisoned by Russia has won the European Union's top humanitarian prize the Chuck Robb prize Teri Schultz reports the European Parliament is using the occasion to praise Oleg Sentsov courage and determination Andrew pressure Moscow to set him free\n... cents off in a jail cell in Russia is far north got a standing ovation from eve lawmakers and stuff [noise]\nJust film directors turned activist to survey the twenty year sentence after the Kremlin accused him of plotting terrorist attacks in his native Crimea annexed by Russia in twenty fourteen\nSince I've denies the charges and became a symbol of political prisoners worldwide when he went on about one hundred and forty four day hunger strike to demand freedom for dozens of Ukrainians jailed by Russia\nEuropean Parliament president Antonio ... says since also ward is a message to Moscow it ... the European Parliament would like to show it's important to him and his cars townie Ted we call upon the authority to release and immediately\nFor NPR News I'm Teri Schultz in Brussels\nThe joint typhoon warning center said super typhoon YouTube has crossed over the ... islands the U.S territory in the Pacific its current top sustained winds are one hundred sixty six miles\nPer hour although there are reports the winds were stronger I'm core of a cool and NPR News\nSupport for NPR comics from NPR stations or their contributors include a log me in makers of go to a meeting a collaborative meeting platform with over Eighteen million mostly users designed to connect people from anywhere in the world on any device learn more at go to meeting dot com\nSupport comes from the Senate art museum the Senate quiet museum invites you to explore art from medieval manuscripts to surrealism with two locations to serve went on to Bucknell campus and another in downtown St Louis bird all events are open to the public more museum ... Bucknell dot edu\nGood morning I never got funky it will be partly sunny today with high in the mid forties mostly clear this evening they come in partly cloudy lows overnight in the low thirties\nAnd some sunshine tomorrow morning becoming mostly cloudy through the day I in the upper forties and as far as the rain goes rain on friday night lows in the upper thirties wins out of the southeast gusting up to twenty five miles per hour\nSaturday rain eyes in the mid forties and wins out of the east gusting up to thirty five miles per hour chats of rain on Saturday near one hundred percent part seeing now on W. V. I. okay\n\n\n[noise]\n\n\n\n\nWe're hearing a Gershwin classic performed by trumpeter John Morrow mom or\nSomeone to watch over me [noise]\nIt would be much to bowl to claim that these two could serve as a theme song from ... new album songs for my son but in a more modest away we might say that it certainly seems appropriate to suggest such a role for the tune and the conversation we had was\nThe album and about his life in these\nJohn Maher is an award winning trumpeter an educator and it's like an artist in residence at ms recording a University in Dallas, Pennsylvania\nMauer speak highly of his musical mentors\nBeen a sense watched over his development into a full musician\nMuch more than a brass player alone John our and his wife are now watching over and loving into life their young son Patrick deck on and one of the gift Sean is giving to their child is a collection of songs that means so much to pop John\nIn this zone Ira Gershwin gives us the image of the key", "year": "2018", "show_name": "ArtScene", "city": "Williamsport", "day": "25"}