{"month": "10", "state": "PA", "station": "WVYA", "content": "Do you hope you'll stay with us we'll have an updated weather forecast Ericka will keep you posted end to the arts world a lot of great things going on enjoyed this day enjoyed the music and we'll see you tomorrow\nVisit WBRC\nEighty nine point nine F. M. W. B. I. H. D. once granted Wilkes Barre ... and we're in Williamsport at W. B. Y. U. eight eighty nine points evidence and you'd Mansfield a W T I O eighty eight point three of them were like one of them pop back a W. P. A. U. Ninety One point five about them streaming live a W. V. I. A. dot org\nWe have a translator in Clark so much at Ninety three up in your arts any information station listener supported public radio W. V. I. S. [noise]\nNewly ... grew up with Mr Rogers on PBS noticed celebrate the fiftieth anniversary of Mr Roger's neighborhood WPRI and the greater ... valley way and the daily item in white due to the movie won't you be my neighbor to to act\nThe three of them were like well I'm ... Ninety One point five of them streaming live at W. V. I. A. dot org we have a translator and Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I. S. [noise]\nMillions of us grew up with Mr Rogers on PBS and now to celebrate the fiftieth anniversary of Mr Roger's neighborhood WPRI and the greater such grand valley United Way and the daily item invite you to the movie won't you be my neighbor Tuesday overnight six PM in the capital cedar Lewis burns your free come first served\nFree small popcorn and drinks and her win prizes from WBAI and again on or Mr Rogers are bringing a sweater to be donated to community aid October night with W. V. I. [noise]\nAlmost we broadcasted the San Francisco to music director Michael ... home which brings out all the colors of the orchestra stolen and whole sections of going to get a chance to shine visually and collectively\nBy bars on most are single out next time with the San Francisco to\nSunday afternoon it to a W. B. I. A. F. M.\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nLive from NPR News in Washington I'm neuron Michael is now a hurricane the national Hurricane Center says it's a category one storm with winds that strong it's Seventy five miles per hour as it moves across western Cuba it could hit the Florida Panhandle later this week\nThe Nobel Committee today awarded it's twenty Eighteen prize for economics it's being shared by William Nord house of Yale and Paul Romer of New York university there work focuses on climate change in innovation\nThe UN led Intergovernmental Panel on climate change is warning the disastrous effects of climate change are happening now ... says the world must take immediate action\nGiven the evidence available we couldn't pillow punches and the messages needs really really radical changes in terms of emissions reduction if you're going to avoid all the climate change impacts that goal was warming be on one point five degrees\nThat's one point five Celsius scientists say limiting increases to that number would reduce flooding and gives people time to adapt to climate change\nThe Supreme Court is now at full strength with Brett Kavanaugh the ninth justice a ceremonial swearing in will be held at the White House tonight he was sworn in at a private ceremony Saturday and the ocean events and reports\nConservatives now have a working majority of five justices and will decide dozens of federal cases on issues from auto emission standards to immigration Kavanaugh was sworn in in the shadow of a bitter confirmation fight exploding and possibly deepening divides and an already polarized political system\nProtest church that demonstrations over the weekend said they were gearing up for a larger long term movement to inspire voters to head to the ballot boxes in November and beyond\nRepublican leaders say Kavanaugh's confirmation well all to rally voters among the GOP based\nChina Men sent NPR News Washington\nA politician from the far right when it commanding lead in Brazil's president\nIt's MORNING in the shadow of a bitter confirmation fight exposing and possibly deepening divides and an already polarized political system protest church that demonstrations over the weekend said they were gearing up for a larger long term movement to inspire voters to head to the ballot boxes in November and beyond\nRepublican leaders say Kavanaugh's confirmation well all to rally voters among the GOP based\nSentiment and sent NPR News Washington\nA politician from the far right when it commanding lead in Brazil's presidential election yesterday NPR's Philip Reeves reports\nVeteran congressman and retired army captain ... NATO needed more than fifty percent of the votes to win the presidency of Latin America's largest democracy or fried he came close with just under forty seven percent after almost ... votes were\nCounted in Rio his supporters celebrated as if you put this contest and I'll go to a runoff which bullshit auto if I ... from a leftist workers' party\nThe stand in for Brazil's former president Luiz ... Lula da Silva who's in prison for corruption this election's opened deep divisions of Brazil between those who think both NATO will combat rap and crime and corruption and others alienated by his ... and racist comments of his admiration for Brazil's polish military dictatorship\nPhilip Reeves NPR News Rio de Janeiro\nAt last check on Wall street the Dow is down fifty three points this is NPR\nVisuals are being held across Bulgaria today to honor journalist Victoria Marron over her body was found over the weekend you're the Daniel river she had been raped beaten and strangle mare nova was the third journalists killed in the European Union in the past twelve months\nTurkey is asking Saudi Arabia for permission to search the Saudi consulate in Istanbul ... has been missing since last Tuesday when he went to the consulate for paperwork to marry his Turkish fiance Turkish officials suspect the writer was killed there Saudi officials deny that\nPakistan's Supreme Court has heard the final appeal of a Christian Woman who was sentenced to death for blasphemy NPR's ... reports from Islam abide\nThe court reserve judgment on the appeal and didn't say when it would be announced local media will buy from any further reporting a baby was sentenced to death nearly a decade ago after women who worked alongside her in a field accused her of insulting Islam\nVisalia maintain the women were angry that she used the cop to drink from a well over the years the case against maybe has led to the assassination of two senior officials one of them was noted by his buddy God who is now regarded as a ... by the religious right\nThe case also unleashed a powerful extremist movements and their leaders wound of terrible consequences if the beat was granted leniency ... date NPR News Islam about\nIndonesian authorities now say more than Nineteen hundred people died in an earthquake and tsunami ten days ago they say thousands are still missing and feared dead the quake measured seven point five I'm neuron NPR News in Washington\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag him drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts\nSupport comes from the semi art museum the Democrat museum invites you to explore art from an evil manuscripts to surrealism was two locations to serve one on the Bucknell campus and another in downtown St Louis bird all events are open to the public more museum dot ... dot edu\nGood morning America funky it will be mostly cloudy today\nIt's by more than two hundred thousand customers worldwide with email tablets a drag him drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts\nSupport comes from the semi art museum the Democrat museum invites you to explore art from medieval manuscripts to surrealism was two locations to serve one on the Bucknell campus and another in downtown St Louis bird all events are open to the public more museum dot ... dot edu\nGood morning America funky it will be mostly cloudy today with isolated showers and thunderstorms some patchy dense fog is well highs around Seventy\nMostly comedy tonight some isolated showers in the evening news in the low sixties mostly cloudy Tuesday Morning becoming partly sunny through the day with ties in the mid seventies\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this was your arts that information station\nW. V. I. A. F. M. artsy now on W. V. I. hey [noise]\nWe're told the cast of the TV series mash would regularly complain about this thing or the other various script issues or just general prima Donna whining whenever this would happen\nThe writers would all of a sudden decide do film of cold weather scene [noise] why uh cold weather scene because it for the actors to get into heavy winter weather clothes while they were filming in the middle of Ninety degree hot Malibu\nOnce the actors caught on to what was going on they quickly stop complaining [noise]\nDo you remember the episode of mash they called dear assess the fifteenth episode of season seven an episode written and directed by Alan Alda\nIs Christmas Time in Korea and everybody's depressed especially father and okay\nHe who is concerned that he isn't making a difference to anyone\nBother him okay is writing a letter home to his sister and he's bemoaning his relative lack of usefulness Hawkeye BJ Margaret in hotter celebrate Christmas in potters office Potter has a stiff\nUpper lip but his three younger friends are miserable [noise] Christmas presents are dispensed by captain Santa hunter cut and Winchester is surprised to learn that there's one for him his old childhood to log in hat which makes Winchester size tear up with the ...\nThere's also a precedent for father McKay he Hawkeye leads everyone in a toast to locate he thanking him for his simple decency and kindness he also has everyone's saying don't and there'll be ... give us peace", "show_name": "ArtScene", "year": "2018", "city": "Williamsport", "day": "08"}