{"month": "10", "state": "PA", "station": "WVYA", "content": "[noise]\nThis was W. B. I. nine point nine F. M. W. B. I. H. D. one granted Wilkes Barre has built in we're in Williamsport it WTY eighty nine point seven have him in Mansfield a W T I O idiotic we three of them were like well I'm pop back a W. P. A. U. Ninety One point five of them\nStreaming live a W. V. I. A. dot org we have a translator o'clock so much a ... point three I found your arts and information station listener supported public radio W. V. I.\nAre you weren't ducks in a row [noise]\nAlmost half of Americans do not have a proper instinct plan\nPlans are more than in matters of money\nThe w._b. why eight eighty nine point seven FM in Mansfield a W T I O eighty eight point three of them were like well I'm ... Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator and Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I. S. [noise]\nAre you weren't ducks in a row [noise]\nAlmost half of Americans do not have a proper instinct plan\nEscape plans are more than matters of money and inherited deacon guide your future health decisions and revise special instructions for loved ones and your care\nPut your mind at by getting your ducks in a row today [noise]\nTo request to free planting guide contact Joe ... W [noise]\nBy on Christmas Eve from life from here with Chris do and\nWe're proud to be the highest rated to our life musical comedy variety show on public radio in this time slot [noise]\nDo it in this weekend for our show at the policy leader in Saint Paul Minnesota with the ... brothers miss Madison Cunningham\nAnd dirty projectors [noise] fly from here we make great radio\nSaturday Night at Sunday night at eight O W V. I. A. F. N. [noise]\nThe Y. Center for the performing arts presenting Cristina Pato master of ugly should bagpipes on Thursday October eleventh at seven thirty PM at the white setter tickets available at Bucknell dot edu slash box office or five seven zero five seven seven one thousand\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. I. A. F. him\nLive from NPR News in Washington on corporate Coleman the national Hurricane Center says hurricane Michael is just off the Florida Panhandle with ... stayed winds of one hundred and forty five miles per hour Florida governor Rick Scott said greater danger is from the water he says the code will get at least twelve inches of rain\nSo thinking about that a foot of rain in some parts of the panhandle again prepare for major flooding from the storm the national Hurricane Center is forecasting storm surge to be between nine and Thirteen feet\nThat means of water will come miles in shore and could easily rise over the roof so houses\nOnce the hurricane makes landfall it will move north east into Georgia it will lose strength but it's still expected to be a tropical storm then it will push into the Carolinas before ... into the Atlantic ocean\nNow that Brett Kavanaugh has been sworn in as a Supreme Court justice abortion rights groups are gearing up for what they expect to be more difficult fight in the years to come Planned Parenthood is unveiling a new strategy designed to prepare for the possibility that roe versus Wade could be overturned NPR's Sarah McCammon has more\nWhere the candidate on the court abortion rights opponents see a new opportunity to weaken or overturn roe the Nineteen Seventy three decision that legalized abortion nationwide Planned Parenthood's Don McGahn said abortion rights advocates expected increasingly difficult environment\nAlready women across this country have to access funding they have to access transportation they have to access housing that have to access support\nNetworks Planned Parenthood officials say they will focus on shoring up abortion rights in state legislatures expanding acceptance states with more liberal abortion laws and reducing stigma surrounding abortion Sarah McCammon NPR News\nImmigration and Customs Enforcement officials will inspector privately run immigration jail in Southern California\nAlready women across this country have to access funding they have to access transportation they have to access housing that have to access support\nNetworks Planned Parenthood officials say they will focus on shoring up abortion rights in state legislatures expanding accept in states with more liberal abortion laws and reducing stigma surrounding abortion Sarah McCammon NPR News\nImmigration and Customs Enforcement officials will inspector privately run immigration jail in Southern California it's been cited for violations including poor medical care and news is in cells from member station KCPW Q. E. D. for ... Romero reports\nA contractor for ice will investigate the ad that entail processing center which is operated by the GEO Group one of the largest private prison companies nationwide but a former detainee ... says he doubts that new inspection will improve conditions for the up to two thousand people health there\nThis is going on for years they known about this\nEvent goes that he repeatedly said detainees suffer seizures and ... on the floor without proper medical care\nBut I made it will get their either or anything that will meeting yesterday\nThe GEO Group says the company takes the federal inspectors report seriously most ice detainees locked up in facilities run by private companies according to a new report by Syracuse University for NPR News I'm fighting that have metal in San Francisco\nOn Wall street the Dow was down three hundred and sixteen points It's NPR\nA new report from the government Accountability Office find cyber flaws and the Pentagon's latest weapons systems the geo report said the Pentagon is just starting to grapple with numerous vulnerabilities common problems included password that were easy to guess or weren't even changed from the factory setting\nThe report cites Pentagon officials who say their systems are secure\nGuatemala's former vice president has been sentenced to Fifteen Years in prison in the country's first major verdict against corrupt officials reemerge and reports the case was brought by a controversial un backed anti corruption commission\nFormer vice president of somebody that he was charged with defrauding the state of what the mother of millions of dollars for purchasing chemicals that were to clean the contaminated lake I must be done in reality the chemicals did nothing but make by the the rich in this case the press here cause metric waters\nCivil society groups are hitting the verdict as historic they said this shows the un backed anti corruption commission known as C C ... has indeed been effective in fighting corruption at the highest levels\nBut did they served under former president of it is more than enough he's also in person facing charges and other corruption cases in which both at the is also implicated for NPR News I'm Maria Martin\nA private TV channel in Turkey is airing footage that it says it shows the missing Saudi Arabian crude ... he went into a Saturday consulate in Istanbul, Turkey last week and vanished the Saudi Government says it doesn't know where ... is turkey says it's suspect she was kidnapped or killed\nI'm core of a ... NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nSupport comes from the semi art museum of art museum invites you to explore art from medieval manuscripts to surrealism with two locations to serve one on the Bucknell campus and another in downtown St Louis bird all events are open to the public more museum dot ... dot EDU\nFor NPR terms from NPR stations other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nSupport comes from the Senate art museum of art museum invites you to explore art from an evil manuscripts to surrealism with two locations to serve one on the Bucknell campus and another in downtown to assert all events are open to the public more museum dot ... dot edu\nGood morning America funky it will be mostly cloudy today with a slight chance of showers this afternoon highest in the upper seventies hobby overnight when the chance of showers in the evening\nAnd some rain a slight chance of thunderstorms after midnight lose in the mid sixties overnight and chance of rain Ninety percent\nRain tomorrow morning was showers out a chance of thunderstorms in the afternoon highs on Thursday in the low seventies\nAnd try to rein Ninety percent\nArt scene now on W. V. I. hey [noise]\nIt's perfect for us that Alexander Feldman lays out his whole argument in terms of evolution\nEvolution for him is a perfect metaphor for helping us understand the development of plays like the crucible by Arthur Miller I demand for all seasons by Robert boat\nAnd the drama of interest to us inherit the wind from Nineteen fifty five centering topical early on the theory\nOf evolution Feldman reminds us that plays about trials and the law aren't new\nClassical tragedy he says is marked by its recurrent recourse to the law and often features trying matters judiciously insult to ... and take any for example\nThe conflict between the dictates of the positive law gave her and the duties of the natural law heroin\nForms the structural conflict at the heart of tragedy between mutually exclusive but independently justifiable legal claims it's well it tested that Greek tragedies almost obsessive concern\nWith legal concepts reflected the theaters function as an alternative for um\nFor the exercise of citizenship\nParticipatory citizenship\nAnd the rapidly evolving society theaters and law courts were embedded in a sustained the combative culture of a scene in public space both work closely bound up in the mediation of conflicting social values\nAnd the responses of a scene in citizens as jurors and assemblyman were inevitably influenced by the fact that they're having the members of theatrical audiences", "year": "2018", "show_name": "ArtScene", "city": "Williamsport", "day": "10"}