{"month": "10", "state": "PA", "station": "WVYA", "content": "Streaming live a W. V. I. A. dot org we have a translator in Clark so much at Ninety point three of them you're arts and information station listener supported public radio W. V.\nI. A.\nW. V. I. A. F. M. at NPR are like nothing else vantage tobacco based journalism and intelligent enjoyable entertaining and it's all made possible by listeners like you your contribution pays or programs like boarding additional all things considered and the ... radio our community outreach like kids in the classroom and the great American ...\nNothing comes close to public radio support WBAI with the general visit W. B. I. dot org were called when he seven seven seven hundred Ninety four to thank you\n[noise] I Am\nGoing to say we can win [noise]\nNovember six the campaigning and who will win and what will it mean for the country and find out with live election results on analysis from around the U.S critical elections central coverage NPR News\nFor the country and find out with live election results and analysis from around us critical elections central coverage NPR New [noise]\n\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners\nVisit P. C. T. dot edu to learn about Penn college degrees that work\nLive from NPR News in Washington I'm more of a Coleman authorities have discovered to more suspicious packages bringing the total found so far this week to twelve as NPR's Ryan Lucas reports the latest were found in New York and Florida\nLaw enforcement official tells NPR that the package discovered in New York was addressed to James Clapper he was the top intelligence official in the Obama administration\nThe FBI says another package was recovered in Florida addressed a democratic senator Cory Booker both Booker and Clapper had been striding critics of the president authorities say the latest packages were similar to ten others discovered this week that were mailed a prominent Democrats in Trump's critics\nOfficials have said the packages contain a potential explosive device that have been described as a homemade pipe bomb\nThe FBI has a massive investigation underway to try to track down the individual or individuals behind the packages Ryan Lucas NPR News Washington\nMeanwhile President Trump is tweeting quote Republicans are doing so well in early voting and at the polls and now this bomb stuff happens and the momentum greatly slows news not talking politics very unfortunate what is going on Republicans go out and vote exclamation point\nA new NPR PBS NewsHour Marist Poll finds President Trump is a major motivating factor for voters ahead of the midterm elections which are less than two weeks away and the earth to medical months neuro has more than\nTwo thirds of voters say the president and the factor in their vote that's far higher than in twenty fourteen when the same question was asked about President Obama forty seven percent of voters say their impression of Trump makes them more likely to vote for a Democrat for Congress while just thirty four percent said it makes them more likely to vote for Republican\nAs a troubling sign for Republicans trying to fend off a potential blue wave November six and hold on to the U.S house of representatives come on to narrow NPR News Washington\nStocks in the United states are tumbling again this morning as follows disappointing results reported last night by technology giants Amazon and\nAlphabet the parent company of Google NPR's Alina Selyukh has more\nThe markets are back in negative territory the Dow is down more than one percent the U.S and be five hundred and the NASDAQ are down more than two percent analyst they're beginning to sell off on two companies in particular Amazon and Google that tech giants are hefty movers in the market and both reported mixed results last night\nAlthough they reported solid profits both of them voted sales that did not grow as much as Wall Street expected plus Amazon lowered its work out for the big holiday quarter this added to the concerns among some investors that the bull market has reached its peak and a correction is coming Leno Selyukh NPR News\nOn Wall street stocks are doing much worse the Dow Jones industrial average is down four hundred and Seventy eight points down early to present the NASDAQ is off two hundred and forty two points are well over three percent you're listening to NPR News\nPublished reports say President Trump made signed an executive order clothing that southern us border to mind\nTo NPR News\nPublished reports say President Trump made signed an executive order closing the southern us border to migrants\nThe Washington Post and the New York times said that could include asylum seekers the White House says the Trump Administration is considering several options to address what he claims is a crisis of Mac illegal immigration created by Democrats\nUnits of Warren Zinn estimated twenty three hundred children traveling with the thousands of migrants and Mexico are suffering from harsh conditions we push lined reports from Geneva many of the children are falling ill from extremely hot\nTemperatures UNICEF reports the children and the caravan black essential services including healthcare clean water adequate sanitation and shelter spokeswoman ... says many of the children are suffering from dehydration and trauma\nIn Mexico unit that is working with the government and other partners to make sure that up through the children are provided with the support and services that they need and that their rights are held we're providing technical existence to the authorities on nutrition I shop protection mc ... says\nThe journey is long uncertain and full of danger she says the caravan of migrants children and their families are at risk of exploitation violence and abuse for NPR News I'm Lisa shrine in Geneva game\nThree of the world series is tonight in Los Angeles the LA Dodgers will host the Boston Red Sox Boston leads the best of seven series two games to none box and trying to win its fourth championship since two thousand for LA has not won\nSince Nineteen eighty eight I'm more of a Coleman NPR News\nSupport for NPR comments from NPR stations or their contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more and go to meeting dot com\nSupport comes from the semi art museum the Democrat museum invites you to explore art from an evil manuscripts to surrealism with two locations to serve one on the campus and another in downtown to assert all events are open to the public more museum dot ... dot edu\nGood morning America funky it will be partly sunny today was highest in the upper forties a chance of rain this evening with rain likely after midnight lows in the mid thirties chance of rain near one hundred percent\nRain on Saturday as well highs in the low forties when out of the north east\nGossiping up to thirty miles per hour and chance of rain near one hundred percent Saturday Night rain lows in the mid thirties and cloudy on Sunday with a fifty percent chance of rain showers ... in the upper forties art scene now on W. V. I. A. [noise]\nWe're told by Robert than acronyms that one fine day a friendly man who introduced himself modestly as Georgia more odor appeared in the office of ... is head of the newness films museum\nHe related that he was a composer and spoke of his interest in writing music scores for silent films if only he could find the right film\nFun aware and overjoyed for such interest comes rarely taller believing in the composers good intentions spread out the girls of cinematic arts before his guest I'm suggested he worked with the movie metropolis\nWith metropolis for its line created in ... his expressionist to master work of silent\nWith the movie metropolis with metropolis for its line created in ... expression is to master work of silent cinema in the twin cities\nWith a clever coup or odor widow onto turns film art on its head music no longer a company's the film the film is degraded two and a company meant for the sound effects\nOr odor uses the classic movie in this way as a vehicle for the lucrative reproduction up his disco music\nWith this in mind he has working with love but above all moved by commercial instinct taking various versions of the films and come up with his very own quote reconstruction [noise]\nShe did not even take the trouble to run his version that silent speed and U.S forces it too unreal on screen too fast by a third\nHis hammering synthesizers sound takes care of the rhythm\nAs well as an electronic noise backdrop orchestrated as if this were a comic film he embellishes the silent worked with seven songs and without trying impart the impression that the projection is has forgotten to turn off the offbeat inter musician intermission music [noise]\nHe's spreads Eric quotes of color over the black and white images in this way the film is made in the ... mind palatable to an entire generation as a sort of gigantic feature film lengths video clip", "year": "2018", "show_name": "ArtScene", "city": "Williamsport", "day": "26"}