{"month": "10", "state": "PA", "station": "WVYA", "content": "As far as weather forecast is concerned we should see some sunshine that's according to the national weather service but we're more rain is on the way\nAnd we'll see some heavy downpours from Tuesday to Tuesday night and a little bit on Wednesday but by Thursday Friday all clear and the temperature should be around sixty six to eight to Seventy degrees the weekend looks a little under cloudy side with the chance of showers\nA temperature should be around sixty eight degrees right now it's overcast and it is sixty five degrees\nAt the Wilkes Barre Scranton international airport enjoy the day enjoy the music and we'll see you tomorrow\nWhich was WBRC nine point nine of M. W. B. I. H. D. once granted we're ... we're in Williamsport it W. B. Y.\nThey all clear and the temperature should be around sixty six to eight to Seventy degrees the weekend looked a little on the cloudy side with the chance of some showers a temperature should be around sixty eight degrees right now it's overcast at it is sixty five degrees\nThat the Wilkes Barre Scranton international airport enjoy the day enjoy the music and we'll see it tomorrow\nThis was W. V. I. eighty nine point nine F. M. W. V. I. H. D. ones granted Wilkes Barre ... and we're in Williamsport it WTY eight eighty nine point seven FM in Mansfield a W T I O eighty eight point three of them were in a while and pop packet W. P. A. U. Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator and Clark summit at Ninety point three of them you're arts and information station listener supported public radio W. V. I. S.\nThe opioid epidemic using a men's public health crisis of our time now WB I as a proud partner\nWith family service association of northeastern Pennsylvania for the ninth annual national family we conference a community built to conquer opioid addiction\nFriday October twenty six at the best western plus genetic hotel in conference center in books very [noise]\nTwelve workshops focusing on different aspects of the opioid crisis details on registration FFA\nAnd he'd be a dot org\nJoined us for a celebration of the one hundredth anniversary of the birth of Leonard Bernstein's\nSunday October fourteenth the three ... with Richard dollar\nResent a program that includes excerpts from a stage where you can't beat it was like glory as well as early as ... and the district theater liking to enjoy the concert in this or don't have the ... make reservations of the eight or ...\nOr by phone five seven zero six five five to\nEight live from NPR News in Washington encore of a Coleman President Trump is did speak that's our at the White House on new trade terms reached with Canada the agreement will allow candidates joined the revamped North American free trade agreement\nMr Trump will be in Tennessee tonight to campaign for a Republican member of the house who is seeking a seat in the Senate from member station WBHM P L and ... Martinez Deltron has more\nTrump's event in Johnson City will serve rowdy for us representative Marsha Blackburn a Republican candidate running to replace retiring Senator Bob Corker this is the second time in five months that President Trump will visit the state to campaign for Blackburn who's running against Tennessee's former governor in a race that he's very close according to recent polls\nThe former governor Democrat Phil Bredesen has run his campaign nothing moderate in a state that overwhelmingly supported Trump you have avoided endorsements from his party and hope that he will not support the current democratic leadership if elected\nFor NPR News I'm set as you might be missed what it's done in Nashville\nDisaster officials in Indonesia say at least eight hundred forty four people have been killed from last week's earthquake and tsunami on the island it's all the way the NPR's Julie McCarthy is in ... and says rescue and relief efforts have been disastrous leak snarled including in the provincial capital pollute\nThe ... airport was closed today a one police major said four thousand people stormed the airport there they rushed a military transport\nFilled with aid and that shut down to the flights for the day so you know their chaos is emerging people are shown a standing on tankers siphoning the fuel power has been cut hospitals or crippled people have moved outside where patients are have been moved outside where the doctors are trying to administer them outside their NPR's\nJulie McCarthy there were questions over why warning systems in Indonesia failed after the initial powerful earthquake General Electric has fired it's cheap\nPeople stormed to the airport there they rushed a military transport\nFilled with aid and that shut down to the flights for the day so you know their chaos is emerging people are shown a standing on tankers siphoning the fuel power has been cut hospitals or crippled people have moved outside where patients are have been moved outside where the doctors are trying to administer them outside their NPR's\nJulie McCarthy there were questions over why warning systems in Indonesia field after the initial powerful earthquake General Electric has fired its chief executive after a little more than a year on the job NPR's Jim Zarroli reports the move comes admitted declining profits for the company\nGE chief executive John ... had been on the job just Fifteen months he will be replaced by H. Lawrence cope the former chief executive of the conglomerate Danner her\nWho's now board member a G the company also said it's cash flow in earnings would be less than previously thought because of problems that it's G. E. power division\nOnce considered the essence of a modern cutting edge conglomerate gee has seen its fortunes and its share price fall dramatically and it's been forced to sell off divisions and lay off employees and assemble of the company's decline GE was removed from the Dow Jones industrial average in June\nJim Zarroli NPR News New York\nOn Wall street the Dow Jones industrial ... two hundred Seventy point that twenty six thousand seven hundred twenty eight an aunt that gets up forty four you're listening to NPR\nThe winners of this year's Nobel Prize in physiology or medicine or American James P Alison and talked to a ... of Japan\nThe Nobel Committee is honoring them for their work and discovering methods of cancer therapy they develop ways to use the body's immune system in a manner that can't arrest the development of cancer research has led to major advances and cancer therapy drums\nThe man at the center of a scandal that led to the cancellation of this year's Nobel Prize in literature has been convicted of rape that go over guard has more\nSwedish court has sentenced John cloud or no to two years in prison for the rape of a woman in two thousand eleven I Know is married to a member of the Swedish Academy which awarded the Nobel Prize in literature and has long been considered a kingmaker in Swedish art scene\nAllegations against him began to emerge in two thousand Seventeen when Eighteen women came forward to accuse him of sexual harassment and assault\nMost of the cases were dropped but the scandals sparked a crisis within the academy that eventually led to the ouster of its head and the subsequent wave of resignations by the two thousand Eighteen prize will not be awarded the academy has said it will choose to laureates into that Nineteen for NPR News I'm since all of a guy in Denmark\nReports in South Korea and say that north and South Korea have started to remove some landmines from their heavily guarded mutual border the ... news agency says that his actions stems from the most recent summit between the countries to leaders\nThey both agreed to halt all hostile acts against each other countries and to take steps to eliminate the danger of war\nI'm core of a ... NPR News in Washington\nSupport for NPR comes from the NPR stations other contributors include the law firm Cooley L P with offices and the U.S Europe and China ... advisors entrepreneur as investors financial institutions and established companies around the world where innovation meets the law\nProgramming on W. V. I. is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more\nSupport for NPR comments from NPR stations other contributors include the law firm Cooley L P with officers in the U.S Europe and China Cooley advisors entrepreneur as investors financial institutions and established companies around the world where innovation meets the law\nProgramming on W. V. I. is made possible by our members\nWe thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter Home Depot more saving more doing\nSupport comes from the semi art museum the comic art museum invites you to explore art from medieval manuscripts to surrealism was two locations to serve one on the Bucknell campus and another in downtown to assert all events are open to the public more museum dot Bucknell dot edu\nGood morning America funky it will be mostly cloudy today with ties in the low seventies cloudy overnight with a slight chance of showers\nAnd ... developing after midnight ... around sixty on Tuesday mostly cloudy with patchy morning fog showers and the chance of thunderstorms in the afternoon and as we've been hearing of late some of the thunder storms may producing gusty winds\nAnd locally heavy rainfall as well highest tomorrow in the lower seventies and chance of rain eighty percent art scene now on W. the I ...\n[noise]\nHe\nPulled kings Mary tells us on the eve of the release of recording titled strange conversation\nThat during August show this year in Nashville Mandy by net introduced a song from her new album strange conversation this album is completely different from anything I've ever done she told the crowd but I'm really proud of it one of the best singers in a town filled with exceptional ones\nBarnett had just delivered the kind of song performance she has long excelled at an aching intimate rendition of the classic pop and country ballad love hurts\nThough her voice is a formidable ranging instrument she approached the tender song was restraint under playing the song as a skilled actor would approach\nA complex role teasing out the Barnett who was released five studio albums since Nineteen Ninety six on the marketed as country music\n\nShe still best known for originating the role of Patsy Kline in the stage musical always Patsy Cline the Ryman for a two year run in Nineteen Ninety four uh Nineteen Ninety five", "show_name": "ArtScene", "year": "2018", "city": "Williamsport", "day": "01"}