{"month": "10", "state": "PA", "station": "WVYA", "content": "We're in Allentown Ninety nine point three any Bethlehem at one of five point seven member supported public radio W. V. I. S.\n[noise] millions of us grew up with Mr Rogers on PBS and now to celebrate the fiftieth anniversary of Mr Roger's neighborhood WB I and the greater ... valley United Way and the daily items invite you to the movie won't you be my neighbor Tuesday October night six PM and the campus either Lewis burger it's free first come first served\nFree small popcorn and drinks entered when prices from WBAI anti can honor Mr Rogers by bringing a sweater to be donated to community aid October night with W. V. I. A.\nThis week's broadcast of the San Francisco symphony music director Michael ... and Thomas leads the orchestra ... symphony that won the Pulitzer Prize one of the box musical resumes and ... and meet the writer's block\n... symphony that won the Pulitzer Prize one box musical resumes and check on skis triumph over face and maybe writer's block that next time with the San Francisco symphony [noise]\nSunday afternoon at two on W. V. I. A. F. out\n\nIt doesn't take long to become addicted to opioids in fact\nThirteen Pennsylvanians die from them every day [noise] guys singer is committed to ending opioid addiction with both prevention and treatment in the last three years we've reduced the amount of opioids we prescribe by fifty percent and we've opened three medication assisted treatment centers to help patients recover from attacks and\nLearn more at guys in her ... if I had enough\nLine from NPR News in Washington I'm core of a Coleman President Trump is being criticized for mocking the woman who was alleged Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were in high school\nMaine Republican Senator Susan Collins who is not decided whether to support Kavanaugh's nomination said Trump was quote just plain wrong when he made fun of Christine Blasey Ford at a political rally in Mississippi last night the crowd laughed and clapped\nNPR's Kelsey Snell says GOP leaders are seeking Collins support\nRepublican leaders are still trying to convince undecided Republicans and even some Democrats to vote for Kavanaugh and this kind of conversation that kind of the exact opposite of what they're trying to deal\nThe president has made clear that he takes this personally that he and he had a personal connection with allegations and he says what he believes to be false allegations of sexual misconduct\nAnd that is playing a role in the way that he's responding to all of that\nNPR's Kelsey Snell in\nIndonesia time is running out for earthquake and tsunami victims still buried under rebel Indonesian disaster officials have increased the death toll to more than fourteen hundred people Michael Sullivan reports on the rescue efforts\nA spokesman for the national disaster mitigation agency said in Jakarta that rescue workers have reached all four of the worst affected areas but he declined to give an estimate on casualties three of the areas had been largely cut off since Friday by roads damaged by the earthquake landslides in down bridges\nOfficials say heavy equipment to clear the rubble are still in short supply\nAnd increasingly desperate survivors are still waiting for food and water and medical supplies many still sleeping outside five days after the quake\nMost of the dead reported so far were found in the city of ... where nearly a dozen military flights carrying relief supplies landed Wednesday morning for NPR News I'm Michael Sullivan in the know Vietnam\nTests done by the state of North Carolina show no environmental hazards in the news river it's after Hurricane Florence breached coal ash ponds operated by Duke Energy Jason to ruin of member station WBUR UNC says that contradicts claims made by an environmental group\nThe department of environmental quality says their tests on the Neuse River showed new elevated levels of dangerous metals in the water\nWhile those results came as a relief to Duke Energy they are in direct conflict with tests taken by the water keeper alliance\nThe environmental advocacy group says the tests were done too late by the time regulators took samples ash had been diluted but the secretary Michael Reagan is pushing back he says the state tests Smith the highest standards tests on the Cape Fear River are still pending for\nNPR News I'm Jason to brew in in Raleigh\nOn Wall street the Dow Jones industrial gr up one hundred thirty six points at twenty six thousand nine hundred ten now decades up more than fourteen\nThis is NPR News\nWhite House's rejecting a detailed story published by the New York\nAnd then out decades up more than fourteen this is NPR\nNews the White House's rejecting a detailed story published by the New York times that investigated President Trump's wealth\nThe White House says the story is deeply inaccurate misleading attack the report says it is based on a trove of documents including tax returns and other confidential documents from the state of President Trump's late father it alleges Trump and his siblings increased the wealth that they inherited through questionable financial actions\nOught to make her ... is reporting a sharp jump in the production of its model three electric cars NPR's Camila Domonoske has more\nThe model three is less pricey than the earlier Tesla's it's supposed to be a mass market electric car\nThat from the start Tesla struggled to actually produce the vehicle and mass quantities then this summer founder and CEO Ilan mosque got in trouble for tweeting about taking the company private the federal government cried fraud and must agreed to step down as chairman of the board\nDespite the turmoil and the third quarter Tesla made more than fifty three thousand model threes nearly twice the output in the second quarter in fact the company went from having a production problem to having a delivery problem with so many cars coming off the assembly line Tesla was struggling to get them out the door\nIt's still not clear if Tesla had started to turn a profit ... NPR News\nThe federal emergency management agency will conduct a nationwide emergency alert test today at two Eighteen pm eastern time millions of people will get this on their cell phones that means you will not be able to opt out of this and you will have to dismiss it from your cell phone or smart watch\nEncore of a Coleman NPR News\nSupport for NPR comments from indeed used by over three million businesses for hiring or employers can post jobs and youth screener questions to build their short lived a preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\nSupport comes from the Senate art museum the Democrat museum invites you to explore art from an evil manuscripts to surrealism with two locations to serve one on the campus and another in downtown to assert all events are open to the public more museum ... dot edu\nGood morning America funky it will be mostly sunny day to day lives in the upper sixties partly cloudy tonight with some patchy fog developing after midnight lose in the low fifties\nPartly sunny to begin the morning tomorrow becoming mostly cloudy through the day with showers and the chance of thunderstorms tomorrow afternoon some of the thunder storms may produce some heavy rain in the afternoon I was in the low seventies on Thursday and wins out of the southwest gusting up to twenty miles per hour\nChance of rain Seventy percent artsy no on W. V. I. hey\nNews items from ... county in Eighteen Ninety seven and Eighteen Ninety eight include these pieces in slim the triangle literary society and other guests to the number of about fifty were pleasantly entertain January fourteenth\nA well selected program including an amusing original comedy a beautiful very devout these small various recitation readings vocal and instrumental solos were charming Lee rendered in star rocker some young people who drove to Jackson to attend the drama in Roberts hole\nIn West Auburn singing schools will be held every Tuesday night\nSome young people who drove to Jackson to attend the drama in Robert toll\nIn West Auburn singing the school will be held every Tuesday night at the west Auburn home\nIn New Milford the new Milford dramatic society will on November Eighteen Nineteen produce the deacon a comedy drama\nIn for city the famous Columbia court ... has been engaged to appear in the opera house seven September fifteenth\nFrom the ... county Historical Society archives Eighteen Ninety seven Eighteen Ninety eight\nSocieties are ... not only with notes about the creative activities in the county at the turn of the ... century past but also about the Flora and fauna of the region and so much more narrow items about ten cows in Brooklyn and Slovenia horses in Dimock and spring bill\nAmount or wild cat and forests city\nAnd Barry pickers out among the black raspberries and blueberries bounding in the season not was then and though much has changed in ... county over the last hundred or so years there's still lots of cows and horses\nAnd blueberries just over a month ago the forty seventh annual blueberry festival was held in Montrose [noise]\nAnd there are artists who continue to enrich the lives of their neighbors a ceramic artist like Mark Chuck who celebrates the fish and the frogs and other water creatures and the countless streams and the one hundred twenty seven lakes throughout the county", "show_name": "ArtScene", "year": "2018", "city": "Williamsport", "day": "03"}