{"month": "10", "state": "CA", "station": "KFMB", "content": "No needles no surgery no medication just the newest debatable proven treatment from Europe using a true stick energy waves are FDA cleared medical device regenerate blood vessels and around town tissue with short ... sessions and it's all done with no pain no needles no surgery and no medication\nCalling now for full information in San Diego county six one nine four hundred thirty forty four to six one nine four hundred thirty four eighty four if I ... in Seattle is like you don't call our commend south at six one nine four hundred thirty forty four and get your sex life back with the arc men's health\nCosts six one nine four hundred thirty forty four or visit our website at a RC men's health dot com\nAmerica's find Seventy five years the seven than be San Diego's talk where he\nWas [noise]\nThe news on the hour sponsored by their works relief and I'm Steve\nKaye than the wheels of justice about to turn some more for Robert Bauer is the man accused of killing eleven people at a Pittsburgh synagogue attorney general Jeff Sessions moments ago in Boston charges\nHave already been filed and we intend to do a duty or in this Matt ...\nSays prosecutors have indicated they will seek the death penalty\nPowers have been in Allegheny General Hospital and the north side of Pittsburgh since Saturday's attack when he was shot multiple times he was treated for those gunshot wounds and apparently was good enough\nTo be released around nine forty five this morning according to a hospital officials will be brought here to the federal courthouse on grand street in downtown Pittsburgh for his one thirty arraignment in front of a federal magistrate to\nAtlanta where CNN says a suspicious package address to the network turned up today the FBI says it's similar to packages with explosive material that were said last week to CNN and prominent democratic critics of President Trump said he has his that'll keep\nThe and I went to great lengths to point out that this was not ever received at CNN headquarters here in Atlanta but actually it was still in an offsite postal facilities and status\nSuspect in the mail bomb Casey's our say Iraq will appear before a judge later today in Miami in Matthews North Carolina reports say a student who was shot at a high school this morning died at a hospital police have a suspect in custody students shake it up by the incidents\nLike crazy that someone can be done to the school like I said I thought it was\nIn riverside California police say seven people were wounded when a shooter opened fire in a nightclub last night police investigating and a tweet President Trump says members of a Central American caravan should go back in the military will be waiting if they make it to the U.S border CBS as David Martin on the Pentagon planning the exact\nNumber has still not been worked out there had been at least one report that they could be as many as five thousand I Am told it could go even higher than that\nOfficials in Indonesia say it's likely all one hundred eighty nine people on board a jetliner that crashed into the sea right after take off from Jakarta died CBS has been tracing\nThis is a brand new airplane tumbling seven thirty seven max it was delivered to lie in air on August fifteenth of this year the pilot was a very experienced pilots there was no weather in the air so certainly the focus will be on whether or not there was some sort of mechanical issue\nIBM's says it's buying the software maker red hat in a thirty four billion dollars stocked deal and red hat stock is up more than forty percent today because the news on Wall street the Dow coming back a bit it's up one hundred ten points the NASDAQ was still down this the CBS News\nTo experience relief or muscle cramps and your legs in feet used their works really fast acting ... there were released today and the pain relief violate your local pharmacy or their works relief dot com\nNow from the studios of using live\nSan Diego's talk and breaking news this is am set in sixty\nOverdoses are up I'm seven sixty ... and that's one of the stories we're following\nWhat channel found Fifteen a mirror Mesa boulevard guessing which agree in the middle of land were sponsored by the extradition several scanner thermometer not knowing the difference between a cold and the flu can be frightening by using the extradition temporal scanner for mom and her this Halloween you won't be tricked by any spooky symptoms new report says a number\nOf ... the a record number of people die from prescription drug overdoses in San Diego county last year the prescription drug abuse report says two hundred Seventy three people died from prescription drugs and twenty Seventeen\nAmanda's on the loose after stabbing another man to his car as open window in city heights\nPolice say the victim was sitting in this car around noon on Menlo avenue yesterday when the suspect walked up and stabbed him through the window ... it's cloudy and sixty three Lindbergh valium seven sixty talking breaking news now it's mark Larson\nShow orange ... trees [laughter]\n\nEvery Monday so you're going to have you with us\nTalking\nEvery Monday so you're going to have you with us\nTalk and breaking news breaking down\nOf the latest on the election issues you need to know about the elections are we putting them are all I Know you can tell because that's every commercial on television and then sold yes I Know no one yes you see one candidate this candidate is great\nAnd then the second later it's no not so great uh as the seasons are one pack a lot of that before you get into some of these choices walks through some of my a ballot picks as well that are somewhere located in our border guide\nThat uh yeah I'm told is within seven sixty K. F. it'd be the outcome but you may have to navigate and do a little I'm hoping to be ... archaeological digs possibly\nAnd you can find that that ... going to be with us and political vanguard dot com after the bottom of the hour and bus Patterson ten and colonel retired but never really retired from the air force and they ... up to top secret stuff buzz is going to join us ... Patterson eleven o five he's former\nMilitary aid to President Clinton during the day of the nuclear codes football all that there is no but he wasn't turning a metric bought them so there's that up by the way to go to Dan noon our technological czar even after the Packers lost yesterday he's here\nReady to roll life does not stop just because a professional football team lost\nAnd you're blaming it on one a Hoosier than it is this a person who can no longer live in a in Green Bay I'm not going to go into that discussion but it's also one player is that correct shame I'm not going into that discussion\nOkay I'm going to this discussion a Red Sox [noise] just saying I rent a more pottery fans over the weekend his stint oh I got I got to watch the Dodgers it teaches you cannot do that that takes you out of time to read them\nFor a bit doesn't it it's just not right anyway moot point because the world series is over moving on\nCourse the big story over the weekend and I'll tell you what this felt like the incident on friday with them grabbing the alleged suspicious device bite bomber stripper guy in Florida and then to wake up Saturday and have the horrible attack on the synagogue it kinda makes you wonder\nHow to tell you what what's what's next of course next may have been what was going on with the shooting a nightclub and riverside for that in the news a little bit ago there was last night so looking into that it's almost like one event brings out other\nUm less than stable people let's just say it's like you just give give one night and then another is out there go al I think it's my turn\nAs a scary thing is also very scary thing for people who investigate\nThese sorts of of events and that includes a former detective with the New York police department Thomas ...\nWho is a highly decorated NYPD investigator detective he was responsible for crisis management for the mayor police commissioner and deputy commissioners of operations and crime control strategies for new New York city and and they involved and a lot of cases including the first World Trade center attack\nThe subway system bombing airline crashes police shootings hostage situations you to entertain the understands this whole issue of the kinds of people who do these dastardly things Thomas Rusk and joined us ... have you here welcome\n[noise] hey mark thank you so much\nSo this has got to I Can't imagine that if I I Know a few people in law enforcement I really respect but these men and women do but I Can't imagine first of all how you handle investigations these kinds of situations no matter how ghastly the synagogue\nNeal massacre is one of them I've seen people and you've seen it over the weekend investors are saying it's the worst I've ever seen I don't know how you just as a human being cope with after starters right\n[noise] well ... you know what cops and forensic people to every single thing they have to go into crime scene today after the crime scenes together\nTo be able to prosecute it leave Pittsburgh ... based on religion you're your own expediting basis because under Judaism dish supposed to be buried within a day or two in the day of the week\nThat a person dies so police will put on ... extra pressure with the FBI who did the crime scene and process the crime scene\nTo be able to release the bodies to be or top seat and then for their proper burial and I understand from people in Pittsburgh this warning most of them will be very tomorrow in accordance with Jewish law ...\nJust the way that that unfolded was um I have to say sick and twisted is an understatement um [noise]\nWhat about if you look at these two cases the guy that they stay the alleged needs to know alleged people I Know this new process\nIncome book and the poor poor Greek Greek state and the poor poor ... three seven to three three eight four four three eight three states\nFor for three three seven to three three\nYou're Pfizer good the lawyer and blue jeans and I have a bunch\nOf announcements I Want to make a we want to let you know we're back on seven sixty cats in the every Sunday at nine AM perfect time kind of old time slot and I'd like you to come back and tell your friends your family\nTell your neighbors that were back on the radio every Sunday seven sixty cap and be nine am talking about law talking about life talking about everything that affect you and my son the attorney now Justin ... will be joining me on many of the shows as well\nI'm also check us out a lawyer and blue jeans dot com we'd do estate planning I encourage you it's mid year now it's time to get our act together please feel free to give us a ring\nAs a free consultation than we do need to show you how to get the government out of your life and death and make sure you're in control of your family that's the bottom line Lauren ... dot com and look at us Sunday's not am on radio okay up and be\nHey I Can't hardly a phony partners in power but still a solar and I'm a conservative\nOn Michael power is also a partner at San bar by sellers solar and I'm a liberal and I'm Brian\nGrabs the third partner and as an engineer I'm politically somewhere in the middle despite our political differences the three of us are celebrating Twenty years of working together providing solar to San Diego homeowners help lower their electric bills like us our customers have political views that are all over the map\nBut they share the same goal not giving their money to the power company every month with zero return the point is joy solar is a smart financial investment regardless of your politics\nHey it's can't hardly chime in and all you conservatives out there going solar gives you a free market choice and it's one of the best investment you can make\nAnd Michael Bowers here reminding liberal than a science helping you save money clean solar energy can help save the planet to\nWhatever your politics solar is one of the smartest investments you'll ever make I'm Brian rams some power by cell or solar along with my partner and Harley and Michael powers inviting you to check out solar for your home or business stellar solar dot net a stellar solar dot net\nBusiness needs fast secure networks to be efficient and profitable detail can help you keeping your data secure your business safe and connect\nWe've been helping San Diego businesses since Nineteen eighty three days you can provide expert solutions for networks voiceover I. P. wireless and video security we can help you make the right choices for your business\nCalled detail at eight five eight five seven one thirty one hundred\nWhether you're networking four or four hundred systems we have the solutions the answers and knowledge to make it happen we have expert IT consultants have experience in helping local business schools state and government with experts solutions such as voiceover IT systems from Cisco why insecure professional video surveillance solutions using top quality components\nDetail is here thirty five you're strong we have the experience to do it right and we would love the opportunity to help you and provide you with the right solution\nGive us a call and talk to details corporate sales consultancy eight five eight five seven one thirty one hundred or email us his business at\n... dot com da T E. L. S. Y. S. dot com\nImagined Pecker parked filled to capacity then imagine you have the microphone you have the chance to tell them all why they should do business with you you don't have to imagine anymore\nSeven sixty K. F. M. B. A. M. reaches hundreds of thousands of listeners each week that's right I said hundreds of thousands of potential customers that could be yours if they only knew about you how could that impact your bottom line why do they return month after month well it works several of our clients have been with us for decades\n... audience sports are sponsors enabling us to continue to bring you live in local programming\nThat matters to San Diego and\nHere's the best part it's more affordable than you might think\nOur experience team container a campaign around almost anyone's budget to put the power of am seven sixty can be to work for you today email Brian Busta at ... at ... dot com that's B. B. U. S. T. A. J. F. M. B. A. dot com and puts power seven sixty cave and be am to work for you\nSupport for the United states fund documented circumventing the lives of waiting patiently still generally and walk away the because the rest of us got\nFor legal immigration has brought pointed\nOut if they don't have any of the rights that are regular American citizen worker as as one of the things the corporations like about it do you do abuse your employees illegal immigration will stop if there are no welfare state can benefits free education free medicine cetera sand under the table job sanctioned by both parties people won't come\nAm seven sixty dogs\nAnd breaking news\nDuring the campaign cameras Saturday\nBit of information\nSing Saturday I should know your fall friday is the second\nThird [laughter] and then that's followed by Saturday [noise]\nWhich is the third and then Sunday November fourth services and fixed Sunday [noise] out there you mix up the counter\nI'm just reading what was given to me from ... ... people how about this\nDuring the campaign B team on Sunday this Sunday November for us for the Susan G Komen race for the cure and bell ballpark and one thing to be aware of breast cancer it's another thing to do something about it here so the heroes make pay\nSo much more than a color act donate get involved register at Komen San Diego dot com K. O. M. B. and San Diego dot com dot dot org\nWhatever that would go to dot com even try them know what's going to dot org Komen San Diego dot\nOrg that's on Sunday\n... in San Diego dot org mark Larson here that's M. A. R. K. L. A. R. S. O. M. um right now as we speak our elected officials including mayor Kevin Faulkner\nAnd are assorted members of the city council are ah making a big deal about hey we hit a thousand a thousand what a thousand\nMiles the streets of news ...\nGood morning worrying Pacific beach day and the road that were on is very smooth you may think so what well it can only look like that this was one of about\nA thousand miles of road light at the city has worked to repair and they've done it well ahead of schedule this is something that the mayor has been a big issue for mayor Kevin Faulkner\nI Want to emphasize that we're not simply filling potholes in many cases where in repairing the entire street curb the curb\nIt's been a long time goal of the mayor and twenty teens and they were a member in his state of the union any place it takes hundreds of miles of red light in five years time that would have been twenty twenty eight days going to announce that it's already been completed two years ahead\nSome ... there's a lot of Roach who's also what hundreds and hundreds of miles of the pipes underground those decided to say hey do once in a while with a water main burst that's all under the heading up what's the word class infrastructure right\nAnd these I I I realize it's a tough tough thing\nBut you know you can't get it all done and then when the other thing is when you get everything completed let's say you go from mild one all the way through mile whatever you say that were done well then you've got to start over it's like when you paint the corn out over the San Diego Coronado Bay Bridge right um\nYou you ... once you're done painting and they've been painting and now right pending that blew a book so great and then I guess coming next couple of years of fancy lights are going to collapse can be very nice and it'll be a new\nIconic image right but when you finish on the Golden Gate bridge same thing well we'll just be painting because we get to the other end of the of never quite over and that's the thing with infrastructure and the bridges and everything else the solution by the way state wide is not as the one which we're trying to do\nBecause that's just more money for you know mostly for bike lanes on HOV lanes I Know zero new roads etcetera\nProp six right one of my recommendations and I'm certainly not alone that no one sex but\nTo the credit of the mayor and the city council they they are hustling on this more than they were say five years ago in terms of this being the infrastructure and the roads and so forth but they're still places downtown\nAnd you know where they are where a lot of tourists are and they're still a mess so I'm not sure why those weren't priority won but we'll keep an eye out and unpack that coming up from seven sixty talking breaking news aramco mayor on our on our team are good friends said oh I'm Sorry\nAramco is happy to bring you the show as well but San Diego air and Space Museum that Iran is gonna be a not today because of this uh uh Wednesdays this week those you're taking notes program does one more family fun here's what you do you go to the San Diego air and Space Museum to bell ballpark\nAs your best value for family find any day anytime any season\nAnd there's some schools up this week that are ah some of the charter schools are off on fall break fall break week anyway just enjoy your time maybe it's a weekend maybe it's a during a one of many breaks go to San Diego\nAir and Space Museum get the bell ballpark explorer pass was good for sixteen different attractions including air and space a lot of different packages and price ranges options available my favorites of the family pass that's good for two adults and up to four kids and that is good for a year's worth of fun when you want it any day\nAnywhere with the different sixteen different attractions start it all started all your fun with a bell ballpark explorer pass at San Diego air and Space Museum and bell ballpark and check out speed science in motion the limited time exhibition which is so much fun and coming in March\nThis is this how the left up rates the less media and Trump's first cultural war president the first one just stand back up to them say no you're doing the wrong thing for America which excites his bay\nWe'll get to see how it plays in the first midterm remembering of course that Obama eight years to go and on your show I predict ... sixty five seats he lost sixty three feet\nAnd so we're going to have the uh the house is tightening and in the Senate We're going to pick up anywhere from two to four seats\nRoutes what am I bet I'm checking some of these ... Senate races are they're getting closer by the moment and that doesn't uh even summer ones where they go oh yeah that's going to swing democratic ... not really the case um the ...\nAnd mark on this point I ... I Want people to realize\nWhat's happening here there are twenty seven reliable red state there's thirty three states with Republican governors so that he just twenty seven reliable\nAnd six others that lean Republican through time to time choke you just do the math of that two senators each state Republicans should have in the Senate ... since the early\n... fifty five fifty six senators ... Senate seats coming home North Dakota possibly Missouri Indiana\nHe's actually just natural Republican seats Heidi Heitkamp there's no more fit North Dakota than I should San Francisco you ate at the natural for the they come home now that's going to really laugh\nBecause they desperately need the Senate and of course they cut the presidency because mark if you think we have division now if\nBecause they desperately need the Senate and of course they called it the presidency because mark if you think we have division now if Trump workplace Ruth Bader Ginsburg they lose it\nAll is and you know that's going to happen whether it's a refresher somebody somebody's going to be going Oregon I still contend with all due respect to ... is a bill she passed away four years ago and nobody really knows but you know Trump will have one more seats and that's going to look like Armageddon that battle it's going to be unbelievable\nThan I have a new up and coming out that talks about how the Democrats will be so desperate if they win the house because they really won't be able to do much but investigate\nAnd so they're gonna have to do something and the two things that they would do and by the way if you're hearing my voice you got to get out there and help Diane Harkey the two things the Democrats would do is shut down the government continuously\nAnd force the Republicans with big spending bills 'cause you know the press blames the Republican trendy shut down\nAnd then they're going to be really desperate because the triumph print of Soros dire and Bloomberg aren't gonna wanna teach men and so they're going to do that as well it's kind of get ugly\n[noise] by the way speaking of ah harkey there's a lot of Republicans saying that and she's just not my favorite Republican as well the alternative is Michael Evans so you have their eyes because I have some issues with an argument that he's not my favorite back but the alternatives of impeachment if he could live with a ... about Tom ...\nFirst times tire because he was apparently a member on friday one of our stories was that there was a a suspicious package that it was a there was a I'm a ... one of a dozen pipe bombs resent the prominent critics of Trump one went through is dire\nAnd so one of the headlines today this is a union hyphen Tribune former movie daily to UT Trump ridicules pipe bomb target so apparently now somebody who's a recipient of some wacko someplace of any sort of nasty\nThat and that person is just all out there on policy that is just ruining the California Academy of resemble a lot of different issues with toms dire I'm just as long as you so you're not yeah he is now immune just like Obama was immune because as an African American you can't possibly question policy that's where we are now with like this thing to whoever\nKevin McCarthy tweeted that Bloomberg Soros and Taiwan and by the economy I'm Sorry by the election you know which they do and he had to take it down because 'cause they were recently threat so yes this is the way the let go it doesn't matter how many times Trump gets\nRight now and so there isn't that he was calling in fact what they're trying to do is to take it down because they were attacked so that doesn't count at\nThe at the American left and I guarantee you Donald Trump leads the country right now in death threats just as Obama did when he was president but that doesn't matter what matters to them is is what they can get away with and making people cow\n... ... in this election and look if there were as the Republicans don't show up in California there's enough California Republican chill elect someone state wide but they said oh because they don't believe they can't so I'm sure they could\nYeah well I talk about what Carl with us I'm looking at some of the spending here on the statewide\nRaces and so forth and that it's not it's not great um in terms of the avenue some who um they actually got a little criticism will sort of\nFrom leaving the LA Times over the weekend about all of his business interests and they were all pro business but it is a it is I mean he without the Gettys and I'm not talking Jody of Armstrong again anyway without the Getty\nFortune behind him he wouldn't have had such a head start that's just something to know if they're going to criticize Jon Kyl John Cox started with ... nothing and built a real estate empire but in the middle of this here's the times again will blurb in the Sunday news news some out spends rival Cox by more than two to one so you\nKnow it now quite have led to a gilded little life\nBut the danger of gab news and then why you got to get out there some John Cox gather news things in a bidding war with all the other which with ... uh I'm Bernie Sanders\nIs in a bidding war with ... Harris a bidding war with Cory Booker can get ahead\nFor the presidential on twenty twenty you got to be on the left and you've got to be allowed the leftist and labs so ... Harris bids six thousand dollars to family Cory Booker bit fifty thousand eight thanks for children should get fifty thousand dollars they all want Medicare for all\nThe avenue them and this that wrote about this in the ... and you can get this at political vanguard as well mhm Gavin Newsom has improved to the country to his left\nThat he's the man he delivered on gay marriage in their eyes and he's going to be the one just set up some sort of universal healthcare that seems cool he wants to say I'm the guy who gave you universal healthcare no one else elect me in twenty twenty four that's it that's going to be a siren song\nWhile well\nUm yeah you just have to know what that is where the girls course he made the mayor he made San Francisco just a beautiful place now you need to add to make sure you don't step in a\nNumber to have ... which he hasn't had to step in by the way because he's I guess he just floats manmade yeah there were his\nBecause my daughter lives in San Francisco and I asked her she uh I had just some mail in the house and I want to send it to her and she said oh you you ... she lives on knob hill mind you\nKnow I feel very trendy ... by the time yes\nShe said don't send it because the homeless steal the now\nOh nice and then they uh and the more aggressive of them are just use the streets as the toilet or loved to my ...\n[laughter] I Can't even believe you went there my ...\nWell no actually they rammed third time if you want to go there they'll go that's how you want to go there you don't have to I Would say\nWe're number today I'm really into that [laughter] so California\nWhich already has ... public debt is seven hundred and eighty seven thousand seven hundred and eighty seven a billion deferred maintenance on ...\nYeah but they're fixing that with sb one it's that great gas tax we're doing because if we don't do that it's all gonna fall on our heads a raw gonna be dead\nRight yes okay my point is\nAdding gather nuisance ... a presidential ambitions on top of that ... to provide universal healthcare and what that means of course is if you like Kevin is the case has spent two years pushing a cutting prop Thirteen in half because she needs the money\nTo do to for his ambitions so if you vote for Gavin Newsom you're voting to cut prop Thirteen and a half\nWell in some people like that I don't know why they think that way but so I Believe that's just ...\nThe left is already arguing mark that the reason why you gotta cut prop Thirteen it says it's protecting old white people in their homes against the poor wow ... I Do too well today\nKnow your is this a two hour day for the for the author of the divided era as Tom Delbanco you can find them in political vanguard dot com also some other great features\nIt's a two hour day for your for the author of lead divided era that's Tom Delbanco you can find them and political banged guard dot com all sorts of other great features are including my review of the movie first man which I'm sure you want to read and chair based on again okay met other on next week so you're one eight hundred seven sixty KF it'd be I'll go through some of my\nPersonal ballot picks as well [noise] that are or will be soon posted on seven sixty ... ... talk and breaking news\nYou're listening to mark Larson on AM seven sixty talk and breaking news\nCanada port in West found if he just asked are funny to drive it's a ... or a large piece of metal in the\nMiddle ... people are ... take get around that so\nMuch for steps north than some of the scientist has Santa Fe there is a car that went over the shoulder down the embankment spending is censored by having Styron service centers right now when you buy to select can tires you'll get to free they be competitive pricing restriction alive is at ... dot com never halfway\nHandcuffs tire stalled on my plate today\nAnd lower risk don't worry about any high pressure sales tactics all the office eight five eight five for six six eight five eight five or six ... you're a free consultation or visit the website smart investing two thousand dot com\nHey it's can't hardly CEO at some power but still a solar oceanside we've been ... dealer for twelve years and two years ago we made the decision to sell only son power and become an exclusive some power master dealer their highest level dealer last month some power panels were exempted from the ... based on their superior self technology\nIn fact there was only solar company it'd be exempted this is huge news\nIt will keep us competitive against inferior products for a long time\nSome parts technology is fundamentally different and you can experience that by by the one of our energy consultants to your home to demonstrate a sell breakage get provides a great visual and you'll immediately understand how some power panels produce more power for more years and how some power is able to stand behind them with the best warranty in the industry plus they're just great like a battle\nTo celebrate this massive event route from five hundred dollars off your home solar system through things that's five hundred dollars off through Thanksgiving I'm can't hardly CEO at some power but still or solar Biden you'd take advantage of this offer as stellar solar dot net that dollar solar dot net\nFor his final Seventy five years as am Seventy than be San Diego's talk radio\nNews [noise]\nThe CBS News on the hour sponsored by zoom video conferencing\nI'm Jim shouldn't be accused Pittsburgh synagogue shooter Robert Bauer is has now been arraigned on hate crime and mass murder charges shackled in in a wheelchair Bowers has been assigned a public defender he's waved the reading of the complaints independent leads us attorney Scott Brady\nThe federal magistrate judge scheduled a hearing for Thursday November first at ten am at that time we will have the opportunity to present evidence demonstrating that Robert Bowers murdered eleven people for exercising their religious beliefs\nAnd then he shot or injured six others including four of 'em were police officers responding to the shooting\nProsecutors are expected to seek the death penalty and the murders of eleven people accused of sending out those mail bombs to Democrats and others last week had his first court appearance today even as a possible fifteenth device has turned\nUp I'm Matt Piper in Miami say ox court appearance here at a federal courthouse is that to happen as that other suspicious package was intercepted by authorities before getting to CNN headquarters in Atlanta\nThat fifty six year old is being prosecuted in New York so this hearing will likely just the procedural at issue is if he waves extradition to New York and whether he thinks released on bail\nThere was a shooting today at a high school in Matthews North Carolina and police say a student's shot and critically wounded a fellow student at the butler high school\nAs a parent is a text message or call I never wanted to hear about the reality is is that this is the America we live in a\nSuspect is in custody and number of us troops to be deployed at the border with Mexico and the coming weeks total five thousand or more corresponded David marking\nThe troops that go will not have the power to physically stop\nImmigrants from crossing the border their job will be to provide support to the border patrol chose a basic concept is that the U.S military is going to support a surge of border patrol to the free states of Texas Arizona and California\nCalifornia so called sanctuary state is the expected destined\nOne of the seven thirty seven it was a a sort of a complete remodel if you will complete update of the the airplane ooh avionics new engines or it's the first max to crash\nIndonesia one of the fastest growing markets for aviation but its safety record has not been great on Wall street right now the Dow is up fifty eight points this is CBS means\nZoom video conferencing featuring video and audio clarity would scream sharing free accounts are available it zoomed on us that zoomed on us assume video conferencing\nNow from the studios of using live\nThen he goes talk and breaking\nNews this is a set in the sixties\nSeven sixty soundly and that is one of the stories we're following\nThem stop and go in the north one sixty three from ash street to fourth avenue sponsored by my CD\nAir dot com my seat the air dot com San Diego's newest airlines plane to all your favorite destinations like Reno Las Vegas San jose in Phoenix flights began to remember first from the convenient Carl's that airport\nThe SWAT Team detained ten people after a reporter gunshots in Bonita sheriff's department says one suspect was arrested for allegedly playing ... a several shots\nIn a residential neighborhood around four o'clock yesterday morning he was charged with negligence a discharge of a firearm searches on for for a minute rub the circle case store and Kearney Mesa and nice point police say they walked in yesterday morning one of the suspects pointed at night but the loan woman working there demanding cigarettes\nCloudy and sixty four Lindbergh field in seven sixty talking breaking news now it's mark Larson\nHit the mark Larson show live when I take my time to go and say listen to a lot yeah if you like it or not you can keep your doctor this is what drives me nuts I Can't say every [laughter] oh I don't know I'm president and a boy or some politician doesn't matter you say whatever you want\nSunni I'm loaded them I find that one except we on there you go again let's face it without says nor\nAm seven sixty talking\nIs our slogan hurting him seven sixty so I Do a little segment therapy finding national can be just as a little breather for people to do this all the hard news and saw him I don't think American people get off his whole fan so they do [noise]\nAll you people you know you are bless your heart to love watching YouTube because there's you know there was a kept playing the piano and I just thought it was interesting that among\nAll the other stories people want a little relief they're saying but today October twenty ninth is national ... day which if you tell them too often about that in Washington somebody they're probably already working on this somebody will make this a national Monday holiday a paid holiday that\nJust is a big you know and then the cats or the cat to our cats and\nDogs going to be replaced by artificial intelligence once we get to the point where we have nothing to do when the robots that didn't do everything\nI think reports full of crap no I'm not just I just thought about these are deep thoughts I really don't care to think about but the hash tag national cat day\nWill so now I get critique ideas did they throw away that's what I Want to know I don't want to know right now but my ah my fine flight instructor or the legendary Joe Brown certified flight instructor who's very patient as he to teach me to fly or making great progress on the way forward\nDenigrate\nOr listen to like bringing a baby about nine months it's actually ... ah anyway he says we know during the break cats\nSlow news day you know that sort of thing you\nKnow it was just his training we report on TALK and breaking\nNews so guys [laughter] the stuff that has nothing to do with anything\nIt was signed by the way congratulations speaking of things that applied bill Allen with the Allen airways flying museum in the ... election was out there for a couple of events ah one was to salute um Austin blue son of wind\nBlew Lyndon and Neal Blue in general the comics and they make the predators and have all kinds of really great companies great local company terrific over company so\nI'm the event out there last night was a with a a ... a a a\n... with Austin blue getting the award from the boy scouts San Diego where imperial county uses the explorer aviation explore the earth is really great seeing a lot of these young people were getting into aviation through the scouts that was really cool right and villains place villain Claudia Ellen's place out there and there was there for another man\nOn a lost track Saturday Night and\nI wanted to give kudos to bill Allen he received an award from the Federal Aviation administration that few people get its its master pilot the master pilot aboard an among other things you have to be a pilot for fifty years\nAs a bill I didn't realize you were that old because you can't tell\nThey weren't congratulations to ah to him and they are an honor well deserved am seven sixty talking breaking news or friend bus Paterson's back with us lieutenant colonel air force retired but never really fully retired that you can find most Patterson to live\nAnd among other things he carried the nuclear codes the info for Bill Clinton and military to Bill Clinton written many books about them including dereliction of duty\nSo bizarre you mark how ya doing\nGood you got a big weekend you were trying to post some video you're talking admitted you weren't very good at it\nWhat was that event that was my that was my wife to get video and all that ...\nI'm gonna have to tell her all about that either the silk she'll correct that yes oh\nWhat a great weekend my bike and all you're following it but there was this ah this just walk away or that a Brandon struck started Brandon struck you as a a a gay male hairdresser in New York and he decided to do a video\nThat went viral back in the spring that you know they'll basically saying he was walking away from the Democratic party for all raised so\nThat prompted the creation of this movement so the first ever walk away march was this past weekend in Washington DC and it was\nLiterally was exhilarating\nIt was a a great cross section of America people flew in from everywhere including who's the one thing we had about five thousand five hundred people march and I'm On the Capitol on Saturday afternoon we had a big game last friday night dinner thing that I spoke at and then a Saturday we uh we started\nI followed a great time to change your old windows and put an end to those expensive energy bills Newman replacing windows obviously there's a place to go you can save two hundred dollars off the Amazon or be on a more energy efficient no guard vinyl windows when you purchase ... and you can also say five hundred dollars off the Amazon piano guard vinyl patio doors\nTo solve our camping combined with any other offering it expires at the end of October thirty first\nThe quality products the best product\nAnd the customer service that you can't remember windows absolutely next none of the customer services beyond anything you've ever experienced anywhere they never used subcontractors hundred percent lifetime warranty on labor and on all ... products\nSo when it's time to replace your old window and patio doors just remember one day Newman replacement when do they seven seven seven Newman for a free in home estimate knew my window\nDot com bust ... lived there for them\nAttention all homeowners you need to hear this we're slated to be slammed up higher interest rates twice more this year old values are at an all time high but experts say the bubble may burst at any second taking your equity with it so if you need cash out now at the time I Am ... Tyler president a bright choice mortgage or direct lenders and get the cash you need fast out of your home\nWith our own money or the money of one of our many investors we have a full menu of mortgages to get the cash you need self employed mortgages we got it at a ... short seller foreclosure no problem a paper investment properties all day long interest only conventional unconventional we got it all at the best possible right give us a call now before interest rates go up in the\nBubble burst call me or my top aged T. J. jet than at eight three three eighty nine thirty eight sixty three that's eight three three eighty nine fund we consider ourselves the last house on the block and if we can't do it chances are can't get done\nCalls today and let's make it happen at eight three three eighty nine thirty eight sixty three three three eighty nine fund raisers mortgages licensed by the hour or one night for three Seventy six analysts on like three to buy the three and his equal opportunity under\nThe Toyota spread the word sales have been\nThey figure most talked about models which huge factory cash back offers like thirty five hundred back on her new Sienna three thousand other towns around\nCash back on a new Camry rap or high Britain or Tacoma visit your Toyota dealer today the why so many people are spreading the word about ...\nMust take deliveries from twenty\nTeens you ... did not have silver thirty first cars value is more than ... ... ... ... and I can't ... factory\nTwenty four hour roadside addicting are\nTime to resort to you know there are more ways than ever to police were perfect\nCombination [noise] real ... [laughter]\nOwn practical Nightline I'd say dirty martini slots in swimming that beautiful\nAt the China I Can't remember a combination of golf is locked in a rib eye rare\nWhoever you are what ever you love to do you'll find more weight to escape more ways to celebrate and more ways to win at the tone to resort to you know into\nIt's time to get out and finally tackled those old projects that you've been pushing off all summer long and all the equipment has the top two vote detractors mowers and utility vehicles to help we have a phone line of rental equipment and huge inventory of tractors and attachment whether you've got a garden detailed rush to clear or job to complete\nFall for a new ... all the equipment company for sales are rental plead visit all the equipment dot net or any all the equipment location or toll free eight hundred five P. A. U. L. E. Y. set the hundred and five Seventy to eighty five thirty nine your local elite ...\nThere's an interest in it diverted package from central promenade Democrats this week on force has apprehending\nSuspects and taken him and took us back to the ... year old ... was taken into custody in South Florida\nA M seven six if he's a white guy who would be part of the story hearing freaking someone that just not even a question if you were a white guy that would be part of the story and white men can't handle giving up the power and all that crap you keep hearing that will be for the story now the son of white guy that part of the stories on TALK and breaking news\n[noise]\nStories behind the story of this horrible\nMassacre Saturday sort of God has to do with those who\nUm [noise] work behind\nThe scenes to save wherever it needs to be saved\nRight\nAnd that includes unfortunately when you have a an alleged perpetrator ooh\nSustained a lot of gunshot wounds 'cause he is the perpetrator or like I Know this sounds silly though Elijah they were taking part in a a shootout with police\nAfter doing is horrible things er during the whole ...\nYeah I Know this sounds silly though allegedly was taking part in a a shootout with police\nAfter doing is horrible things er during the whole massacre\nRight\nSo here's this as Fox News dot com as is Jewish doctors and nurses Allegheny General Hospital in Pittsburgh but their personal feelings aside\nBecause they were on duty\nAnd they had to help save the life of the man who allegedly claimed he quote as he yelled wanting to kill all the Jews as he opened fire at the synagogue and murdered eleven\nForty six year old guy whose name I Will not make more famous as much as I can help and just kind of keep it quiet that guy shot multiple times and he was taken to Allegheny General Hospital in Pittsburgh\nAnd he killed the allegedly a and I know eight men\nThree women wounded six others including for police officer before he surrendered\n\nIt would be tempting you talk about the fortitude and focus and and embracing of the Hippocratic Oath\nThat ... that that renews by spirit in human\nBeings\nBecause I don't know I could do that if you're sitting there it wouldn't be tempting and you watch all these medical shows raise anatomy what I'd be very tempting to sit there and go this guy why maybe I'll just not be a really\nGood right now and then maybe I'll just kind of forget about something and he'll be toast\nAnd then we'll have a lovely time in hell\nBut instead they did their jobs\nDr Jeffrey Cohen president of Allegheny General Hospital and member of the tree of life synagogue told ABC this guy was taken to the hospital he shouting the first three people who took care of them were Jewish\n[noise] one of the one of this slime the alleged assailant\nThe synagogue massacre now has a different view or does he want to check out entirely it is a different view of these Jews he wanted to kill who then took care of him and made sure if he could still\nUh-huh face consequences based justice and\nOther nurses as they account a nurse whose father is a rabbi came in from a mass casualty drill like well but in case this happens here's the drill\nDuring this was not a drill so she was there\nJewish woman who's a nurse father's a rabbi\nTook care of the perpetrator\nMr Cohen was one of the first people on the scene lives in the neighborhood that are gunfire from his house who said I was standing there and I started hearing what was going on and\nAnd\nUh like the first responders he credits his doctors and nurses and staff are stepping\nUp he said we are here to take care of sick people were not here to judge we're\nNot here to ask do you have insurance or do not have insurance\nThat's refreshing 'cause that's usually the I Know you're about ready to check out do you have insurance is this vast villain your network I don't know I'm about to check out\n\nAnd this uh Mr Cohen had a brief conversation at the hospital with the alleged perpetrator you so uh how you doing you're in pain\nAnd the slime said no I'm fine\n\nDescribed powers I asked him who he was he said I'm Dr Cohen president of the hospital and he turned around and left\nThis bouncing around that alleged suspects head should be forever am seven sixty talking breaking news\nWant to see more of the martial arts show follow mark on Facebook at Mars Larson me as well as food or Instagram with the handles\nMark Larson radio smack\nLaughing and Tony ... memorial park\nTony we've been saying for years singing hills memorial park is not what you think of in a cemetery you know it's it's a beautiful place like going to a park and you can only know that if you go out and take a free tour great time of the year to do that but also explore some of the new additions and the new options\nYes sir if you mentioned this that you will find significant savings if you come out and see us we also have unique opportunities such as private estates for your own family\nKnew Muslim is there now to the special garden areas just a gorgeous place and it's a wonderful place to reflect on not only beautiful nature and creation but also\nTo think about the future do what we did years ago take care of those future needs so your family doesn't have to deal with it later on that gives you a peace of mind it's a wonderful feeling it really is go see our friends at singing hills memorial park six one nine for for for three thousand\nOne nine for for for three thousand bison branch will see president of will see Asset Management and most of the smart investing show on Saturday mornings are you concerned with the height of the market maybe you're not getting the investment returns you invite at will see Asset Management we used a proven strategy for investing that delivers good returns and lower risk\nAnd none of the guns are for all but it was just there are kind of a wreck and they're writing in ... [laughter]\n... that's a lesson to us about society who are your neighbors\nI don't know Mr Rogers was right who are the people in your neighborhood you better know kind of helpful\nAims I'm sixty talk and breaking news ... present ski over there are planted MSNBC or what was she\nTicked off about first thing this morning Iraq a Trump oh making the a strong suggestion of rocket doesn't care about America what because she didn't return her message\nHat on MORNING Joe Ivanka Trump\nLook to credit the White House for lowering the flag to have staff good lord as if that should be in class and like if your biggest accomplishment of the day to get the White House is something to Don and got his tail for history at times because\nThey really need to rethink your ... here in in ... it's just bad for your brand for bad for your reputation I'm thinking that history is going to look at your brand terribly so if you I Know you don't care about the country\nAnd I I don't care about us and our lives I Know you don't cause I reached out to get it right back around\nUm but if you care about your brand bad for your brand\nWow\nReally what did we learn today kids mhm but did we learn that\nThey are ... buys in consequential stuff I mean the double standard Sarah Huckabee Sanders was talking about that here earlier industry minutes ago and today is a professor at the White House\n... for everything and here's an example MSNBC pressing the Israeli ambassador this guy on MSNBC just keep cried every which way to blame Trump blame Trump for the synagogue mastered\nThe reason why I brought those up is because people are saying those our dog whistles to anti Semitic white nationalist groups in the United states do not see that from your vantage point\nThere was an attack in two thousand fourteen I Know I ... with all due\nBack so I understand the history of the attacks and I definitely don't disagree with you about the history of anti Semitism I'm Talking to you about the political leadership in this country if they bear blame for the rhetoric and the and the kind of a victory all that we see directed towards the Jewish American community you just heard the president there say that people who are changing in Charlottesville saying\nThe Jews will not replace us being described as very fine people\nWhy didn't think that the president common after Charlottesville were very good and I just told you that I thought his comments yesterday or a strong a talent as I've ever heard of any leader so I'm very glad to hear that\nAnd I think the problem and is that when people attribute anti Semitism in one side of the political debate they make a very big mistake Jews have been accused of being capitalist Jews have been accused of being communist\nI Hope that people from both sides of the political I Will put the politics aside and we'll work together to confront anti Semitism which is a growing problem is an aim and uh the president I think there is not the reason why you have Jeremy Corbyn\nIn Europe as a leader of the Labour Party in Britain was an anti Semite it's not the problem why you have a tactic and choose\nAnd European country that you're willing to simply simply and to simply say\nThis is because of how a lot of one person or the only comes on one side is not understand the history of anti Semitism for the reality of anti Semitism one of the big\nForces in college campuses today he's anti Semitism in those and the anti Semite so usually not neo Nazis on college campuses they're coming from the radical left so we have to stand against anti Semitism whether it comes from the rights or whether it's ...\nYeah that's the Israeli ambassador to the U.S talking to the guy just wouldn't let up on MSNBC who's trying to blame Trump whenever they trumps the best friend ... Israel's had this far as president for some time\nIn a while but the MSNBC guy kept going so would you be willing to ambassador to call out\nThe American government if in fact you felt this prize it into a and many of what people have described his dog whistles to anti Semite even going after prominent I Do it even prominent Jewish philanthropist George Soros has become a punching bag if you will of the far right you're not criticizing them for using George sources image in a derogatory way\nI don't think you should rush to reach a conclusion that because somebody take the stand against George source that's necessary stand against anti Semitism\nI think you have to look at those things very very clearly what I find very troubling\nIs that people will only look at an senators among the other side of the political outlook you just had somebody minister Farrakhan called all Jews tonight for a week ago\nThat is outrageous than I Would like to hear people on both sides of the ... whether you agree with some of their costs policies or you don't where do you think he's a positive force in some areas and you don't say this is totally wrong and totally unacceptable so I Would certainly call out any anti Semitism wherever it comes from\nA man [noise] break into small groups of discussing um some sixty talk and breaking news if you file your tax return as the sole proprietor you are paying too much in taxes and you have no asset protection oh you're also risk and IRS audit boy a financial group\nDesigns the legal intact strategies of your personal and business wives and prepared to returns on the legal strategies you need they do it all in one office talking about convenience attorney of CPAs Sam ... is the president of lawyer financial group\nSalmon as professionals have years of experience\nDeveloping the right legal intact strategies to help you cut your taxes protect your assets and keep more for retirement that's what they do for me no wait till tax time call my friends are ... financial group for your free consultation the last review your living trust for free learn how to leave your spouse more control of your trust assets under the new\nTax law lawyer financial group combining legal attack services to serve you better call eight five eight seven five zero sixty nine hundred eight five eight seven five zero sixty nine hundred eight five eight seven five zero sixty nine hundred\nYou're listening to mark Larson on AM seven sixty talk is breaking news\nFor traffic hazard on Fifteen south down just before the ocean view also somebody walking down the right shelter there perhaps ... on the south on the side of the five year old town had\nAn accident here everything is off to the shelter now have sponsored by San Diego restaurant solution to survey team up with San Diego area restaurants them ever ninth through twelve to support your veteran in military community\nYou dine they donate find details of restaurants to live to service dot coms Harlem Ike later today at noon on AM seven sixty\nThey're added again it's yet another deeply flawed proposition was written in secret behind closed doors by a special interest group this time it's competition will be costly for you and dangerous for kidney dialysis patients aids which for sale is his clinics to cut back services are shut down\nThey shouldn't be costly for you and dangerous for kidney dialysis patients aids which for sale is his clinics to cut back services are shut down the sounds as a kitten dialysis concerns into overcrowded emergency rooms for cops would be dramatically\nHigher and higher costs would just be passed on to the rest of us in fact experts warn companies with including health care costs by hundreds of millions of dollars\nJoined the California Medical Association representing forty three thousand doctors and the American nurses association California insulting and no one eight stop this costly and dangerous dialysis proposition for I Know one proposition and\nStop the dangerous palaces proposition conquered by the ... down with this council committing major funding from the ... percent of the medical care in North America [noise]\nI Love the pal in our solar is a local company a couple of years a lot of solar companies have wanted me to advertise form and couple of years ago company came from a completely different country and as I Know you guys\nYou're not going to last pal in our solar not only has lasted but is continuing to grow so I Want to thank you for that I took all the time or if you're thinking about this investment\nElectricity as the genie it's only getting more expensive as time goes on so get some solar panels up on your roof and make your own electricity just makes it doesn't make sense everywhere\nBut it makes sense in San Diego it's very sunny and electricity is very expensive seven six zero five zero four zero three eight eight and why Powell Marlowe first ah preparing a monitoring\nA central very different than whole house monitoring so asking about the ... panel monitoring and find out why companies like whack the and good well San Diego have chosen Palmore seven six zero five zero four zero three eight eight or Pelham our solar dot com [noise]\nWhat do you hear those people will just here and we share a six point two liter of me being with the chargers that accelerates so fast [laughter] it'll certainly air out of your lungs and knock you back and you're seeing part you're an astronaut in a rocket ship hurdling through the stratosphere but then again we're not most people [laughter]\nDodgers a registered trademark of FCAT us well see\nThis is a court ordered notice current and former foreign Lincoln and mercury owner ... skin receive payments and other benefits from a legal settlement related to allegedly defective take on it airbags in their vehicles\nTo see if your vehicle is included and to file a claim to auto airbags settlement dot com or cold one eight eight eight seven three five five five nine six that's auto airbags settlement dot com or one eight eight eight seven three five five five nine six\nAm seven sixty six zero winner register for your chance to win the ultimate holiday party for twenty people aboard a horn lower yacht which offers great food postcard views and spectacular crews on the San Diego bay is a holiday party that everyone will remember for years to come up to seven KF envy dot com for your chance to win [noise]\nWith you without ever having to leave your home or your office or wherever an amazing new technologies would just go to the website\nJeff gray with an actor Jeff great DDS click on the link to smile virtual console\nIt's easy it's free submit a photo and within a few days you will receive a personalized video console just directly to you and an estimate from Dr grade Dr ... and you can do it all from the comfort of your home\nSo if you're unhappy with their smile\nWhen I get happy with it if you have any questions you can call six one nine seven eight zero thirty five fifty an average check out the website Jeff gray with an H upgrade DDS dot com\nAmerica's financial Seventy five years faces EMs devastating than be San Diego's talk radio\n\nCBS News on the hour sponsored by their works relief I'm Jim ... Robert Bowers the forty six year old suspecting Saturday's attack on a Pittsburgh synagogue has now been rained on federal murder and hate crime charges U.S attorneys gotten ready\nToday Robert powers made his first appearance in federal court\nThe judge it by some of the charges against them fears detained in jail without bond corresponded David beg no\nWere about five U.S Marshals standing around him\nAnd from what I could tell they ... hits the from the wheelchair to the actual wheelchair where they put him in a spot there were two defense attorneys ... judge came in he read the ... for him\nFrom the wheelchair to the actual wheelchair when they put him in ... there were two defense attorneys rats to judge came in he read the column for him\nThat he understands charges and said\nProsecutors are expected to seek the death penalty in the case or just hours before his first court appearance saves are see actually accused male bummer another possible device turned up at a male facility in Atlanta address to CNN CBS has gotten older\nIf confirmed that aid packages containing the components of the bomb this would bring the total number of the chain packages that have been discovered so far the FBI was notified at this suspicious package by US postal inspectors\nThe number of us troops to be deployed at the border with Mexico ahead of that caravan of Central American migrants could be five thousand or more CBS just even ...\n... the president or just the migrants to please go back\nHe caused the caravan an invasion of our country and once the military is waiting for its arrival traveling overseas defense secretary James Mattis told reporters the military will be sent to the border to support civilian authorities and at the number of troops to be deployed would be based on the homeland security secretary ... says she needs\nThe search continues but holds for finding any survivors of today's jetliner crash in Indonesia are doom the plane and new bowling seven thirty seven max went down in the ocean nine miles off the coast of Jakarta with a hundred eighty nine people aboard corresponded been tracing\nWe don't yet know what caused this crash but the c._e._o. of lying ... says that this plane did have a technical issue on a previous white Sunday night it was then cleared for takeoff Monday morning Thirteen minutes into that flight\nRadar Austin celebrating the red Sox World Series championship panic while yeah\nMayor Marty Walsh planning a parade on Wednesday there'll be no rallied city hall plaza this is just the parade or that we're going to be doing on Wednesday I'm excited as mayor to host my first Red Sox gray and those guys get used to the patriots parades and now we have a Red Sox Rachel I'm happy about that\nOn Wall street the down now down hundred Ninety points the S. and P. don't well it's a CBS News\nTo experience relief from muscle cramps and your legs and feet used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot\nCom\nNow from the studios of using five\nDiego's talk and breaking news this is a um set in the sixties\nPhoebe assault victims arrested this twelve o three I'm am seven sixty I'm Jim sharp ... that's\nOne of the stories we're following let's begin by checking on traffic right now things are pretty quiet out there the five and the fifty and we're not seeing any accidents are stalls anywhere\nThe eight in the age of five also looking good no crashes know stalls and everybody seems to be moving along at the speed limit\nThis traffic updates sponsored by scripts health express for same daycare on your schedule down an appointment health express locations are open seven days a week with extended morning and evening hours you don't need to be a script patient learned more at Scripps dot org slash today [noise]\nA man suspected of sneaking into a Pacific beach home in the middle of the night and sexually assaulting a woman as she lay in bed was arrested today up in LA Los Angeles county sheriff's deputies took fifty five year old Jeffrey ... into custody early this morning\nDetails or the arrest in how investigators identified Haynes as the suspect in the case have not been released\nWill follow the story throughout the day plus others but right now it's time for the Mike Slater show\nOn AM seven sixty socket breaking new\nI'm just told me the story and I'm I'm reading about it now about the\nMurder in Pittsburgh\nAnd how he went to the nearby hospital and was treated by a group of Jewish doctors\nAbout that so it just gets done killing eleven people at a synagogue and then the Jewish doctors go and are saving his life and the president of the doctor of the hospital is a member of that synagogue is well believable [noise] so let's talk about this a little bit\nWe'll talk a little later about hatred in general it's very simple we live in a fall and broken sinful world\n\nA better theory that ended that that that's why these things happen ah nah I don't really feel like doing any react to media reaction today it's all very obvious claiming Trump violent rhetoric and so here's what I Want to do for a bit I've never understood\nHatred of juice I don't get a\n... popped up to a mixture of the sentence comes across properly but I'm about to say here director\nI can understand I don't I don't agree with it obviously but I can understand why the Japanese have the Chinese and the Chinese and the Japanese given their history there last hundred years or so and ... I can understand\nRacial hatred I don't agree with that obviously but I can get in the mind of a racist and and see how their twisted mind sees the world is us versus them they look different than me et cetera I get I get Sunni hitting ... uh she isn't she is hating Sudanese\nAre you in so far anything I said can I mean everything I could be twisted if someone wanted to but if someone's genuine and listening here they understand what I'm saying it right I understand why\nMuslims hate the Jews but I don't understand I can I never understood how\nSo called Christians are people living in a Christian culture I leave it like that are like ours we live in a Christian called white those people ages I don't ... don't get it all makes no sense to me never had\nSo a couple of years ago I was reading Thomas souls black run next and white liberals one of my all time favorite books when I was so grateful that there is a chapter talking\nAbout why people throughout history have hated the Jews and truly since the beginning of time all around the world he played the Jews why\nSo an echo some of those thoughts that for a couple of ... there's a lot here obviously so we're just going to scratch the surface so she argues Thomas soul argues that the root of hatred the core of the hatred\nOf Jews is economic resentment that's the core that everything else that comes after that is rationalization and scapegoating and blaming it all is that right but he says it's really economic\nIs rationalization and scapegoating\nAnd blaming it all is that right but he says it's really economic so here's the first overall plan that will get into some more specific a salary job is still says that there's really nothing unique\nWith the Jews in why the majority populations around them because in a Jews are only two percent of the American population\nIs it something unique about what the Jews as when it comes to why majorities hate them\nSo he calls the middleman minorities and I'm going to define that term in a second here middleman minorities but tens of thousands of ... have been slaughtered in Nigeria\nThe Chinese slaughtered in Vietnam the the Armenians and the Ottoman Empire the Jews ... you know during World War two all of these genocides share similarities\nOr the Lebanese attacked in the early on and tell a story about that later that the Japanese persecuted in Peru the Indians in Burma will go on now obviously none of these to the scale of the Jews in World War two or juice throughout history but all very similar and reasons why\nI talked to the nursing care of him before I went down to the game\nAnd yet I broke down his years as to\nWhat all those men [noise] ah I went to the game and came back but I went to see the shooter and the cops was already\nTo try to understand why did he do\nI have no answers I asked them\nSorry she always sort of brought he said I'm going okay that I introduced myself a soccer following president of al ... general\nThe FBI agent in charge of the basis\nOf how you did that so I'm not sure I Would have\nA pretty amazing now so let's finish up this is why why people hate Jews why for all of history of people ... and Thomas soul he's a thoughts are that they're the core of it\nIs economic based everything else that comes after that is rationalization and scapegoating corps economic so do you want to admit it pretty reminding of convincing arguments are in this book black right next white liberals which I highly recommend I'm\nSo one thing that's interesting about middleman minorities which Jews have been everywhere or the hatred against them isn't because they're rich\nBecause they went from so poor to above average so quickly\nIt was it was the quick rise to at least above average well\nThey got people so full of resentment so the Eastern European Jews who came to America in the early Nineteen hundreds they were the poorest minority in America New York city tenements you'd have three or four or five people living in a room\nWith a porous right so how did you ... how did the Jews in particular\nRise from one of the poorest ethnic groups in America to one of the wealthiest actually Indian Indian Americans have the highest household income in America at a hundred and twenty two thousand dollars a year and use it a second that a hundred thousand gentleman and he says to the third highest ... as the ethnic group that is the third highest average income you'll never get\nIndians are first Jews are second\n[laughter] it's kind of touched touchy games yeah [laughter] yeah you can't just throw out yeah been here like I like to do ethnic group or the third highest household income\n... Japanese could guess let me go Chinese could guess Australians\nRon I'm I kind of weird [laughter] so anyway that's what I'm ... I'm so Thomas also that the Jews in America or knew that they had to work harder in school to succeed\nAnd so even if the initial immigrants who came to America were illiterate education was still a strong family value middlemen minorities all across the world Jews and other middlemen minority also have a strong culture of saving money\nAnd working at the family run business\nThomas talked about Koreans in America and how Korean businesses or had a lot of unpaid labor but everyone is in the family right working eighty hour weeks Chinese shopkeepers in southeast age is ...\nIt's or their blood suckers who are\nProspering at the expense of the rest of us that kind of nonsense which obviously isn't true\n\nAnd here I think is the grand human nature point of all of this which is why when Thomas ... says it's economic economics or the core of it is not really economics at the core of it it's it's human nature is obviously at the core of it uh but ... says that when people are presented\nWith an option of either hating themselves for their failures\nOr hating others for their successes more often\nThan not they choose to hate others let me say that again because I didn't have to really insightful unimportant\nThomas ... says that when people are presented with either hating themselves for their failures\nOr hating others because of their successes there often choose the eight others\nSo give an example of how this is not I'm ethnically based but economically based Japanese immigrants in\nPeru which is kind of a weird thing to think about right and I we have any Peruvians or Brazilians listening right now going back to south but they're barely does a pretty sizable minority population the Japanese in Peru in Brazil I had no idea so Japanese immigrants moved to these two countries in Peru\nThey became a middleman minorities merchants shopkeepers et cetera and rose the economic ladder pretty quickly Japanese immigrants in Brazil stayed farmers\n\nCouple generations later the Japanese say so much more prosecutor persecution in Peru and Brazil\nNow they're Japanese in both places Peru and Brazil are somewhat similar right\nSo why did the Peruvian said the Japanese so much and the Brazilians on out so much well it's because the Japanese in Peru went from poor to wealthy very quickly\n\nSo final point on economic success in the whole wrap this up\n\nAll around the world these uh minorities\nHave been accused of taking over large portions of a country's economy\nRight so so the Jews took over then insert whatever industry you want boats radios about that is in many cases the ethnic group will say Jews here they didn't take over and industry they created that industry\nWhich is very different those out like a bunch of the native or whatever or or running industries and the Jews came in and took 'em over there was no of this industry that existed until the Jews or whoever came in and started\nRight so all around the world\nAll around the world is has been the case um Jews in Hungary around the world war one\nThe Jews in Hungary where six percent of the population but sixty percent of the merchants\nProud of World War two and Germany Jews owned sixty percent of clothing and retail businesses but again it's not just do so in Indonesia the Chinese which is the middleman population there the Chinese were five percent of the population but they own to Seventy percent of the economy\nSeventy five percent of the country's largest businesses\nAnd for all four of the country's banks something about that you have\nChinese immigrants coming in here and controlling that much of the economy\nOf course the native people are going to be resentful of that success\n\nI don't say rightfully they're going to be resentful I say of course they will be because of humans\n\nSo in summary minority groups in this case Jews but many others around the world they stick together because they came here so poor\nValue education and saving and working long hours and because of those values they rise economically faster than the majority around them\nA couple of generations later they're creating entire industries and then get accused of taking over those industries even if they ever existed before they started\nAnd the ones that economic resentment builds than hate filled leaders exploit other\nDifferences\nSo Hitler famously once said if there were no such thing as a Jew\nAnd here's the quote\nTo send him it is essential to have a tangible enemy not merely an abstract one\n\nSo I think my conclusion today is uh what happened this weekend is no different than than all of history\nPeople are envious and they have those who are different people look to divide us to build their own power base\nAn easy way to scapegoat an easy way to divide is based on class warfare right today we tend to see it with the general\nThe rich right blame the rich but if an evil person can take it one step further the Jews\nThen they can consolidate power even stronger\nThat's culture wide for an individual all this I don't know exactly this person right but usually the cases instead of dealing with his own problems in his own life was a lot easier for them to blame a whole another group of people\n\nWant out of seven sixty K. F. M. B. one out of seven sixty five three six two so again that's a lot of that sort of the book or black right next and white liberals by Thomas all fantastic book and one of the chapters is about a lot of people have the Jews or something like one out of seven sixty\nGame F. M. B. David Epstein and Bradley why it was just what these guys the other day that his Social Security seminar a packed house loved it loved it\nBut still small and here's the thing is so small enough that you can uh you get all your questions answered it feels very intimate because it is an intimate an individual right\nGive me a couple of examples New York magazine published an article celebrating the quote revolutionary power of anger\nThe Atlantic October force the seismic power of re ... get a good way this is last month the Washington Post rage is healthy rational ... but it's not rational\nA defining second rate is not rationed by definition if not rational but rages healthy rational unnecessary for America that's why she was just last month\nNBC wrote an article about the TV show on Netflix called chilling adventures of Sabrina miles his favorite show is that right sure sure yeah less amazing do you have a little\nYou want to tell us a little while you I mean it's really it's you've got to start is just chilling oak gate goose bumps file thing there you go and then Sabrina oh while she's naturally so NBC wrote articles proving that quote anger is righteous unnecessary\nOr NBC again it's time for women to embrace their range New York times magazine and it's like mother do a anger as a tool to be used part of a well stocked\nArsenal All right and then Kevin Williams and the highlight it all the same group same newspapers whatever a same kinds of publications\nDecrying conservative rage\nSo Eugene Robinson a and the Chicago Tribune encourage Democrats to a harness your rage\nHarness your age and then criticize cabinet all for being in his words rage filled so it seems like we had some mixed signals here right as rage good or bad\n\nSo the answer to this one actually this one is very simple range is bad\nWeird that we have to have this conversation but according to all these articles or indeed we do article article saying it's good [laughter]\nSo I'm here to say no doubt\nThey're not does not this is not newsworthy free but are not breaking viewer a new thing but uh uh from your previous suspicion that indeed rages bad range is silent uncontrollable anger that's the dictionary definition violent uncontrollable anger and [laughter]\nWant to make the argument that that's good\nThe root of the word means a fit of frenzy and raft it's the same Latin roots that we get the word rabies\nIs a good to have a rabies is good to act like a like a wild\nOr a raccoon\nInfested with rabies is this what we're supposed to we're trying to as what the left said is a good thing that we need to harness you can't hardly so that's the definition of it\nAs a here's Kevin Williams and he says uh I Would suggest that we make a concerted effort to abolish sheep outrage from our political discourse\nBut that proposal will go nowhere there's just too much money and outrage\nAnd said I Would suggest understanding that what people on TV are engaging in is not really political discourse at all but something much more like sports commentary or the real housewives of wherever\nGetting to the truth requires careful thinking which is difficult to manage\nWhen you are high on rage which out before about how it's it's the same if you watch um I was what I Want some of those sports shows like that are needed all of the day and\nAround the horn yeah like all the like the ones in the morning or the worse soda and it's there's a creamy like anything with Stephen I spent on it sure who I don't hate I like the other guy uh yeah the big guy bailiff Kelly\nOkay same thing they're just arguing about ... ...\nThe head coach and the play whatever they're just doing sports but it's no different than the political and literally market soccer or Jeff Zucker\nWho runs CNN now he used to work as ESPN is that right although much of that\nYou wanted to do you watch those shows of it it's so funny because it's simple and you're like oh yeah this is like a genius idea for the entertainment yeah oh yeah a ton of money here\n\nOf course not and he wasn't ESPN who I was thinking of [noise] could have just said it would have believed in\nYou know let me say confidently the head of CNN used to work or you\nWant the same format and outrage was forced to violate why that make sense out your loan I just mayor is area and very much I Know there's someone who does not as if it's not just ... someone\nSo we're gonna we're gonna you know what I'm going to deport right now that yeah but still sure [laughter] we're gonna do it yeah but still habits so okay so there's a flag on the plane and go you know what still but still yeah but still Eric\nI'm sure Jeff Zucker was George Foreman if that's totally making this stuff off ... yeah but yeah I go on the program\nCan you play that clip of the uh\nWell it's not ... if that's totally making this stuff up ... yeah but yeah ... ... what the programming\nOr can you play that clip of the a la Oklahoma State football coach the miles just sent me a second ago randomly not knowing that this was going to be the next topic that we're going to talk about right\nCitizen where from where\nSomewhere south right there so I got a question was about ... what do you make of this criticism or is this criticism from where\nOutside [laughter] I think you sit outside noise outside to different things outside noise\nThings like that now because I've been always medium this guy also has a mole it [laughter] I don't know if you know this ... head coach has a great\nLike eighties ... awesome I saw a guy wearing ... or ... what does it come stone washed tight eighties gene wow yesterday good we're like in the eighties haircut he had really thing going on\nFor him big gala began has a ... and the leather pants your dad taught that their data yeah here's what he has a mullet coupled with leather pants and he ... well I don't know central well he\nEither a worse garment as it were a down jak well he\nDoesn't exactly where and because he showed up here one Christmas in leather pants and that's all it took whereas here to my sister's house Christmas morning [laughter] they're ... or was serious heart attack at a Rolling Stones T shirt on [laughter] good wave fan huh [laughter]\n[laughter]\nA slice of rat's ass about Twitter [laughter]\nPlatform for people that are sitting home trail and John employment jak sitting in front of a keyboard\n[noise]\nReally the fertile disregard what you're saying\n\nBut I I mean I just kind of felt like the social media and twitters what's this girl in this country anyway so that's how I feel about it from politics to sports whatever gives people a platform to [noise] and then other people like needle in it and they're sitting at home and their light on a payment so anyway that's how I feel [laughter]\nSo uh\nWe need to include that more more of this so I'm I'm normally against that level of commentary\nSpot on totally that sound effects ...\nRemember 'cause I I Would mock or people who go to Ted Cruz and screaming his face yeah little screen does\nI I just scream a I feel like this kind of the equivalent of that it works it works or they\nMight actually be appropriate ... uh\nI mean if you have a debate and you're just not agreeing with like some of the calls and it's like we don't need more housing I Want to know if they if they start out with\nSomeone on Twitter sad [laughter]\nHow about this site or did you know they're just soccer used to be ... [laughter]\nI don't want to come back\nWith a quote from a a book that I read in my book I read I mean I went to Barnes and noble yesterday and picked it up and read the first page and it was the opening quarter the book what book miles I don't know Robert Greene human nature oh we've got we've got 'em all the books on the air force he coming on\nOh that's not coming on yet last couldn't make it happen wow oh [laughter]\n... [laughter] that's fine sign up and I just [laughter]\nI the first page in Barnes and noble I guess by some sort of Trump [laughter]\n\nIs that nothing can come back with my guy wrote for the laws of power and every picture he has his with this cat wow so he's insulting in solving the author ... know what I read the book again I don't know how much power\nYet [laughter] and it's a double down here mind makes a good argument actually alive but sell sell\nMy time on the ... to come back with his are excellent quote that it's changing how I'm doing politics from this point forward agreed\nShovel the next one hundred and sixty camp MB loves the already always have ... six years now or something you just\nCome by about twice a year if you've been looking for a good excuse stemmed come by because maybe like me I'm like well if my carpets already really dirty I'm going to wait until the extra dirty dabba ... you really get my money's worth\nFor having a ... but then if you just play the game primary or competed ever going to clean so here's the little extra incentive to get you over that hump their uh they've been doing this for ten years I haven't come by you get three rooms a carpet cleaners runner twenty nine dollars usually it's on eating out is that by the way with their patent a powered water you can drink at the whole thing that's less expensive than the other guys\nAre you tired of exposing your retirement to stock market risk how would you like to participate in stock market gains but never stock market market joined Thomas here for the retirement income radio show on Saturday and two PM you can also call ... year now for your free customized retirement income kids in one hundred and Fifteen paid retirement\nIncome book and the poor poor Greek Greek state and the poor poor ... three seven to three three or four three eight three states\nThey for for three three seven to three three\nHigh it's bright the founder wept automotive group and the host of auto talk radio along with being the auto man on the cw San Diego or philosophy is we never put money to people whether your personal fleet vehicle meat service or repair\nWest automotive group at San Diego's highest quality independent automotive insurance but it's just service and repair facility\nOr facilities maintain the industry's highest service tenders enjoy use of our free shuttle service to and from work or low cost rental vehicle while you're vehicles being service to repair by our professional AFC certified technician west automotive group services repairs your vehicle to manufacture specifications\nYou can enjoy peace of mind knowing that we also back every repair with some of the longest nationwide warranty\nTake advantage of our no charge sort of care transmission diagnosis\nAt one of our three San Diego facilities\nLocated in ... Oklahoma or ... or your ultimate automotive service experience book an appointment now at West automotive group dot com experience the true meaning of satisfaction guaranteed that swept automotive group dot com\nFind Seventy five years the seven than be Denny yeah go talk\nIt's one o'clock on AM seven sixty I'm chip sharp ... that's one of the stories we're following first a check on your traffic\nThings are still really quiet out there we don't have any problems on the five Fifteen no accidents and know stalls and looks like everybody's moving along at the speed limit right now said the eight oh five also in great shape and no trouble and the rest of her roadways either\nThis traffic update is being brought to buy F G G Andy during an emergency information is critical when you register your mobile phone with alerts San Diego you can receive notification during an emergency legislature now is ready San Diego dot org\nRobert Bowers the man accused of shooting and killing eleven people out of Pittsburgh synagogue is out of the hospital and in court today CBS News Hillary lane reports\nOn a website popular with the alt right\nThat was posted a photo of three hand guns he calls his glock family and wrote Jews are the children as saying he also fixated on a group called the Hebrew immigrant aid society or highest\nWhich helps refugees from all backgrounds settling the you at ... in his last post before the shooting that whereas wrote highest likes to bring invaders in that kill our people\nI Can't sit by watched by people get slaughtered screw your optics ongoing it\nYou can see the stars and David behind me one for each person that was killed people in the community say they can't believe the deadliest attack on Jews in this country happen right here Hillary lane CBS News Pittsburgh\nNearly two hundred people are feared dead after jetliner crashes in Indonesia just minutes after takeoff over three hundred people are involved in the search for survivors and so far there authorities fear the worst CBS Tina crafts report\nCrews found racket the Boeing seven thirty seven near that you'll click where the plane when the town and the job is the along with passengers belongings\nAnd Denise in official says my prediction is no one could there by\nOne hundred eighty nine people including three children were on board lion air flight they can win that nearly brand new jetliner crashed into the the Monday morning Thirteen minutes after take off\nThe pilot had requested to return to the airport shortly before the plane plunged into the water is such a cart at scattering records for miles\nSearch teams are working through the night to recover body them debris and hopefully the black box which could get clues as to why the plane went down\nTina crowds CBS News\nOf is the man accused in the murder of his wife will be in court today Hector Martinez was arrested last week more than a year after Maria goose men was reported missing\nInvestigators believe Martinez killed ... men after an argument last October than dumped her body and your ... that's where her remains were recently found however the medical examiner's been unable to determine a cause of death\nOr climate change lawsuit prompted dozens of rallies around the country including here in San Diego news H Derek Connor has more the lawsuit\nJuliana versus the U.S argues that government officials failed to stop climate change by promoting the use of fossil fuels who was filed in twenty Fifteen by Twenty one plane just all over the country that was supposed to go before a U.S district court in Oregon today however is now in limbo after the Supreme Court intervened at the request of the Trump Administration\nDemonstrators are pushing for the suit to move forward\n... that we're not going to sit back and let something happened to lax again to like you said when we have a chance to change something and make a change\nYesterday's downtown rally was one of more than Seventy rallies held throughout the country for am seven sixty I'm news H Eric\n... there was a nice day for a rally is again today here's news H carry lane with your micro climate forecast\nSee are going to see nothing but sunny skies this afternoon a beautiful day along the coast and the low seventies inland valleys copy out in the eighties same out in the mountains and the desert Ninety four\nAs far as the next couple of days I'm sure a lot of you looking forward to Halloween on Wednesday we are going to start to warm up in fact on Wednesday temperatures will be on the rise for an seven sixty I knew they carry lane\nRight now it's cloudy and sixty eight out of del mar football tonight and it could be over early the five and two New England patriots take on two and five bills in Buffalo Slater's next am seven sixty talking breaking\nComing up and want to share I interview\nOn a couple of things so we'll talk about that also have a story that we mature on friday\nThat will make your day [noise]\nYour now\nWow maybe\nOnly your day I don't know if anyone else in the same day may well that's what we're here for\n... to Monday [laughter] point maybe subliminally I waited till Monday well I think we smashed that'll oh wow I Am out on that one ... you had a good Monday went W good today so\nFor sure yeah well I had given away on friday\nSo you never done one of three characteristics of this person that to find a their lives are good ones that we can apply them to our lives in a little story with each of them and then we can all be better storytellers and this week we're talking about a new book which comes out tomorrow how about that being Crosby\nSwing it on a star the war years Nineteen forty Ninety six and your ... he's the author or get into our user\n[noise] I'm good how are you a\nWonderful doctor good to talk with a a about a a guy would some local times to say at least I think um I\nI'm Sorry I Need you just a little\nMore to the microphone I'm OK you look at the beginning you give us a little by being brought before we break down the characteristics\nWhile he was born in Tacoma raised in Spokane educated it a ... year diversity he's probably the only one of the great\nSuperstars like ... Presley [noise] uh who had a a you know a college in education including the two years of law school and then he came down to California with is a ritual partner or outright gr and they started playing political and\nWithin a few years he was the king of recordings the king of radio\nAnd became an enormous film\nStar a\nParticularly in the Nineteen forties during the war years when he created to in ... characters one father O'Malley in the movies going my way and does a saint Mary and the other the names changing a scheme or who partners with Bob Hope\nOn seven road trips to various places in the world\nWhat do you think made him some exceptional\nExceptional well Percival Lowell an absolutely magnificent\nA vocal instrument or with a gorgeous high notes that alone notes and are completely original a way of phrasing impeccable time he's you know he was born and I you know three and he was the first\nMusician to really understand what Louis Armstrong was doing the same time to love the Broadway theatrics of someone like al ... and the Irish ballads hearing of John McCormack he had no biases in that respect and you hear that in his music and just bars or whatever will work for him\nAnd in so doing he created a really ... an immigrant rule a vocal mask and attack and was capable of seeing anything so that when he sang country songs that were the blues even later a elite sounded like he was a you know born to the men are\n... s M B. rapid trends missions got a a attacks Sandy limb cooler the warning foundation of course of a the picture didn't come through a month and you get the tax ... no I didn't get the picture I got extra back ah\nBut she went on and on about how wonderful rapid transmission is dropping off a ton of items for the words on his freedom station so there's been off for a while now wow now where'd you get a did you bring an item from the more years active duty special needs us\nThen you get ten percent off your invoice up two hundred dollars so uh that's going on for a while now and it's still on the table and they just dropped off a bunch of stuff that had already been dropped off so\nYou want to know what's on that list and then save a couple of bucks on a service senior transmission than you can go to one of hundreds or you call them I planted five six to seven six Seventy five or Coursera upside rapid transmission dot com they're hurting Mesa asking do you do and the Mesa rapid transmissions dot com jumps from about ... coming up to\nA man suspected of sneaking into a Pacific beach home in the middle of the night and sexually assaulting a woman as she lay in bed was arrested today up in LA Los Angeles county sheriff's deputies to fifty five year old Jeffrey Haynes into custody early this morning\nA twenty eight year old navy man's recovering in the hospital after being attacked with a baseball bat following an altercation in the barrio Logan happened shortly after three this morning near naval base San Diego the victim suffered a skull and spine fractures is injuries are not believed to be life threatening\nAnd police believe they have the man who shot and killed an active duty sailor on local freeway over the weekend police say Twenty one year old Brandon or tuna shot Curtis Adams who had pulled over on the transition ramp from the south down to the team to the north bound five to help who he thought was a strange a driver\nYou're never more than Fifteen minutes away from the top stories of the day on the Mike Slater show am seven sixty talking\nYou saw was a strand of driver you're never more than Fifteen minutes away from the top stories of the day on the Mike Slater show am seven sixty talk and breaking news [noise] am seven sixty KF empty\n[noise] they're celebrating our ... our our news this morning California's housing prices will cross and help or hurt we break down the controversial and complicated measure placements for\nLocal and then plus one of the other\nHand all the latest breaking news after the amount of traffic is alive consumer and business news ... who said this morning from four thirty to seven switched to the thing that would be for knew they weren't in extra seven said I Am [noise]\nTuesday on news said I Love it keep pulled her against her well into her bedroom\nLaw enforcement force themselves onto those are sworn to protect and change from police officer to ... and it was on duty see that's the local law enforcement agencies if they could track sexual misconduct ... response was\nCost too much sex crimes Tuesday on news they have you learned after CSI New Orleans\nOh we're going to miss you guys in the neighborhood Fifteen Years living here kind of be so hard thing to ... oh I'm sure yeah lots of memories for the good thing we found the right people to help us through it yet we're so lucky what do you mean you see how much we saved by selling our home and\nThis instead of the normal six percent the with rex we only pay to for ... the in the industry how can we do that they took the traditional real estate agent out of the equation\nWe got a full service teams phosphate seen scenes in technology houses sold within faith so what about your new house got us free qualify for a mortgage at the lowest available rate hates you give me rex number before you guys to leave home on a\nThree three rack and home a three three ... home and eat more of your own money a three three racks home a three three rats home ... license number zero one nine seven six zero one here I'm In in the may apply\n\nBallmer solar give Adam a call here get some solar panels up on your roof just saw to my friends at church yesterday said uh what are they say they got an\nEffort to master the effect it has already came out of their coming out I think they're coming out but they had a good phone conversation because whenever someone says I call when your sponsors of my fears that tell me how they treat you want to know everything tell me all the details\nThat we will but everything's been great so far I'm so fully they come back with a with a good number in this family going to seven a lot of money [noise] uh oh that's true for you to ... panel monitoring is the key with column our solar and that's essential other companies would do the whole house was most do not know monitoring ... I guess I just wing it [laughter]\nI Hope they're still working up on my roof or the whole house monitoring which is a better than nothing but you really want the ... monitoring because of that\nSecond panel from the right\nMiddle row isn't working I Want that one fixed and you won't know it if you have a whole ... system or a no monitoring of course ... per pound is essentially just monitor rate on your phone or your computer super easy and they'll check it out for you to write the good I don't really have a lot of time to monitor every last\nThing like that but they don't check it out and if anything's going round the combined effects at seven six zero five zero four zero three eight eight seven six zero five zero four\nZero three eight eight local name you can trust Powell more solar dot to come\nHere than in a rash and it does is fine thank you how many Democrats this week thought force has free has is assessed that and say can him as the tests\nThat fifty six year old he's our say I was taken into custody in South Florida\nA M seven six [noise] if he's a white guy who will be part of the story hearing voices to him as it's not even if you're a white guy that would be part of the story had white men can't handle giving up the power and all that crap theory that would be for this story now this is not a white guy that form of the stories on top and breaking news\nIn the hall you lead to more rhyming oh\n... where's\nMy Rebecca ... the ah ...\nBacked about white Christmas\nNow that the number one song times a thousand Santa Claus\nIsn't it like in second place is something Mariah Carey\n[laughter] maybe for don't ruin it for me okay go [laughter] go by the number one by far my eyes I'm really started to have you to know my phone is in your office and I need that for the story that only make our cabinet go get all of us at ... that's what it's really fun\nI so I think it's there [noise] so er Eric I was speaking at a a pro life pregnancy center the other day ... home provide pregnancy seven and a woman came up to\nOkay and I instantly I never met before instantly knew she was [noise] okay\n... do you know the sites that do you know the uh\nYou know the ... but I I tell you this report on your phone or an hour ago\nSo she's she's she uh came up to me I knew instantly who she was\nNever met her before she says hello oh here's the pitcher\nGot a couple of ... or [noise]\nOn the two of us are now than I Do know that guy what's holding\nOh is that Cain's\nWow oh\nIs that like that's the Cain that's Becky\nWow how about that very good at all [noise] well what do you say did not make your day\nYeah that's that's a that's way better than what I use it for [laughter]\n[laughter] that's\nCool so you're the great back story if if he misses one was two years ago must have been like to know what it was this maybe I just start yeah ... ... miles but it's gone to dissolve the acting director of facts\nOr there was one of my yard sale ideas apparently noses years ago though no I Know that I've been trying to get this yard sale ... dress up one year following the old guy from up and you made a Cain with the for bottoms do it and you play tennis balls at the bottom just like in the movie up right that's right that's how this came up\nI don't know and and you talked about\nRid of it or something and I said well who when you're there\nAnd you put tennis balls in the bottom just like in the movie up right that's right so this came up I don't know and and he talked about getting rid of it or something and I said well who when you're there you want to give it one of our listeners on the\nIt was some about a prize and I said oh I got a cane and maybe somebody will give it to ... yeah that's what we had a I got sort of I think we were\nWe had our trivia question and we had nothing to give away\nThat's probably what a great concert tickets was on the stars like well I guess is they'll gain I said I Know they don't want your Cain that's dumb who's going to get the\nPhone fly out of my life as Erica Kane kind of a sudden it turns out this this does that this has been called and I wanted to give a cane this came to his wife who has multiple sclerosis and that is they want to see who I met last Thursday\nCame up to me how McCain up in the air I getting me how 'bout that that's super cool that's cool oh geographic us she works at the volunteers at the Brennan Center well pretty ill circle that are very yeah that's pretty awesome\nYeah he was in the midst of all the yeah is there a little ... like I think he's admitted to some of it to your straight\nUp right out right out of the friday came out so not to be graphic he would uh uh a pleasure himself in front of one in five women over the years have come forward and uh he admitted to it and the show got cancelled and do all of this tour dates and the whole thing right so it's like a year or so ago\nWell he just started coming back and trying new material in small little comedy clubs all over the place which by the way I think it would be super cool science wilderness interview said recently he grabbed his sports jacket at seven PM and is running out the door and his wife said where are you going and he said I got a child is new material\nSo I'm sure you just showed up some comedy club probably didn't even tell the guys coming shows up and as I Want to try some new stuff you're how cool would it be if you happen to be there yeah in science on Wall rose and enter and throws out some on some jokes are funny because he hasn't really worked shopped at all yet\nYeah there was just a fact wife and I were watching a Netflix documentary on Seinfeld on Saturday\nWhich is weird that we're talking about it today which won the ... the one that the reason one where there's multiples I think it's like ... or what's the new one got or something about comedians\nIt's like the ... follow them around okay but he goes up on stage and he's worked stop it's work shopping stuff he's forgetting lines and bombing like sitting on stage no Joe oh I'd love scene for about a minute and he's going back over his lines as I can I can\n... and he's like\nIn front of the puzzle solving [laughter] while and I thought to myself\nThat is incredible absolutely to just sit there and bomb\nWith the crowd full of angry people or just the flaws so disappointed and it said Jerry Seinfeld up there\nAnd some other guy said\nYeah but you get a little bit of a break because you're Jerry Seinfeld and he said you get a break for maybe the first ten second yeah that's right and then they expect you to be Jerry Seinfeld\nWhoa yeah I got to find that\nTV so Jerry before Seinfeld was the one that we talked about before but that that's not this one\nNo it's called like comedians if you search Seinfeld and Netflix that will pop up wow\nThat's awesome are so Lewis ha ha I get to sort of come back and people are outraged that he there ever show his face again so Seinfeld was asked is it too soon for Louis C. K. to be performing again I I was the crosshairs of Seinfeld said\nNo\nIt's the way he did it then I think people didn't like we know the routine the person does something wrong and the person's humiliated they're exiled they suffer\nWe want them to suffer we love the tumble we love the crash and bank of the fall and then we love the crawl back the ... are you going to gravel how long are you going to ... are you gonna cry or you're going to Jimmy swagger\nSwagger that TV pastor who got caught with prostitutes right he did this big apology break ride in the whole thing right so you're gonna Jimmy's flag and see what they're going to cry you gonna do this whole thing we can cause we need it\nAnd ... and people I think figured that they had that coming with Louis He owes us that we the court of public opinion decided if he's going to come back he'd better show a lot of\nPain\nIt's apple said that because he denied us that because he denied people that\nI'm not good enough\nSo it's not that he's coming back and said he didn't\nBy people that I'm\nNot good enough\nSo it's not that he's coming back and said he didn't do it the right way you didn't gravel enough I think that's true so what are what are where I've always said we we love to tear people down in the pick of backup\nMaybe now it's a little different or I was wrong it's we love to tear them down and then we'd love to have them gravel for there to return back to their previous stature right and then we'll maybe will allow you back to this place but you got to ... for it\nPuts us in control over them and their districts that about some things are it doesn't matter how much gravel and you'll do right Megan Kelly ... apology a week or two ago and they still fire\n\nBut that's the difference right this second that's the first time for a point about political grabbing a second one um he says you know how many people around you how many comedians are around from when I started I started with hundreds of guys and women Ninety nine percent of them are gone\nAnd some of them are great why are they gone every reason you can name every human frailty there is every hairline crack in your personality gets pulled on\nLet's see if we can make it a gash and then push you into it that's what happened in stand up\nSo you have these great comedians or whatever it is it doesn't matter in this case we're talking to me it's very great comedian some of the better the ... but they're gone they didn't make it\nBecause whatever human frailty there was it was a hairline crack and their personality and their character\nAnd it just got I'm sort of looking for\nExploited and took him out\nSo then the person said well how did you avoid it he said I was pretty lucky in the seventies I was surrounded by cocaine and alcoholism but because I had no interest in it I never saw it is it I've never seen cocaine in my life\nSeriously I knew it was going on but I was on another track I Would just go now that's not for me I think I was lucky to have a natural aversion to things I saw as toxic and that covers a wide range\n\nShared as many times a first time I met going back I asked him for radio advice and he said a new gentleman remember what he said his stage advice for young bad one likes later no\nI'm Glad that this moment had much of an impact on me as you unusual I mean retelling or just from the stakes something about Mr ... I remember\nOkay\nUh stay away from anything destructive very close very close ... listen you both get\nYou get Seventy five percent credit you get twenty five ... enough to gather represent ... that could be the right to gather you got it right\nPretty good avoid self destructive behavior\nThat was a man and I was very disappointed in that advice I found that advice to be not nearly what I was looking for\nBut I was looking for a for a specific thing and then an active than like a positive I Do this but read it for like ... avoid self destructive behavior but of course Glenn was an alcoholic and all that\nSo uh that's what that's what a Seinfeld here's the thing is though I've I firmly believe in ... after doing this biography second for so long it's super clear what do you I think Seventy five percent of the biographies we have on they say one of the three characteristics are perseverance yeah my sister is all about presidents\nBut it does it so the people who we know successful whatever they're not even necessarily the best so let's say there were a hundred comedians who started one Seinfeld started right this time it was just one of them so I could have been the the twentieth funniest comedian twenty of funniest it's just a Nineteen out of them\nWere got an alcoholic crack cocaine or couldn't take it or this level of whatever they can take the failure they couldn't take it mocked on state whatever was whatever hairline fractured they had in their character it took them out and Seinfeld is just the one who remained and now we know of him is the best or whatever right\n[noise] that's really interesting\nAnd that says if you if you're just avoid destructive behavior you'll be above average just avoiding bad things you'll end up above average but then you live a life of virtue\nOh goodness your way out of the game\nOne out of seven sixty K. F. M. B. one out of seven sixty five three six to Dr Jeff gray\nFrom a simple teeth whitening he's my dentist so simple teeth whitening to a bonding and more seriously right or a visitor line braces Dr Jeff grade Dr Todd ...\nThey're the guys are talking about of his life for a second severe crooked teeth and you never had braces maybe got like that one to flow out of line or things is annoying you just a little bit enough right there on this and you're older writers who wants to go through braces\nAt by by age or this is a discrete nearly invisible way to enhance your smile and you can make yourself and I thought early Christmas present\nAnd tell me this nice actually get five hundred dollars off\nBy their butts off your invisible line treatment this month and this month is almost over so give us a call now six one nine three three seven\nSeven seven zero zero you know you can actually get your first consultation over the Internet to just go to their website and click on smile virtual counseled you can also to picture and they'll let you know if there's a line or anything else is is right for you and you don't have to go to the office\nWill send you a personalized video consultation\nJust right over the computer there just send him a couple of pictures six one nine three three seven seven seven zero zero if you do want to go in person making the point where you can do it on the line Jeff great with the age of gray D. D. S.\nDot com which I'm sure about what a guy coming after President Trump and first lady Milan you Trump will visit Pittsburgh tomorrow to mourn a synagogue massacre that left eleven people dead White House spokeswoman Sarah Huckabee Sanders says Trump will go quote to express the support of the American people and degree for the Pittsburgh community", "year": "2018", "show_name": "Mike Slater Show", "city": "San Diego", "day": "29"}