{"month": "10", "state": "AK", "station": "KOAN", "content": "The insulation plus the time by ordering a head on line and you order will be ready for pick up and start stop by our visit most for ... dot com ... details so pro now that you know start with love minimum purchase require selection varies by location\nTwenty four seven three sixty five you're up an ad on every day so you don't want something like Medicare part D to slow you down at Walgreens will take care of your Medicare part D prescription saving you time and money snake\nTo switch to Walgreens today and get more bang earning a hundred dollars for four points and save up to five dollars on each Medicare part D prescription Walgreens is more preferred pharmacy Walgreen trusted since Ninety One prescription pain as if I went to New York when he prefers versus another pharmacy in select plants ... here in New York New Jersey or Arkansas medications apply\nSome of the money sometimes is rocky and this time of year to become ISIS still\nAround your good tragedy needs to be Saturday with severely spinning your wheels maybe it's time to pick up a new Toyota for all wheel drive to make the decision Toyota has special limited time savings a best selling special the middle east options out there so much for water since ... zero\nPercent financing for sixteen months at all rather horse there's even three thousand dollars in cash ... and that's just a few examples of the race savings plus mostly Toyota models now featured Toyota's safety says no extra costs so get a grip this winter at the Toyota\nFour by four at all wheel drive\nFor ... job comes rivalry do they tend to Toyota\nLet's go\nTo jail for that sort of a history but he was just one which I was ...\nThe words breast cancers summing up powerful feelings and emotions we all know the early diagnosis and treatment generally result in a better outcome for ...\nThat's why you should be aware of their powerful new technologies are no enabling doctors\nDo make earlier clear diagnosis and treatment abreast of me and once again is the doctors and technology said imaging associates were brought these new technologies to encourage them to you three\nD. Trumbull mammography breast biopsy capability and now the rest of the MRI and imaging associates as you do the only non hospital admission imaging center in ... when they come up all these powerful diagnostic ability imaging associates partners with Alaska radiology associate ghost\nShip grain radiologist specializing in residency training\nAnd all of this competitive pressure on average thirty percent less than ... did you remember\nWhen it comes to imaging the choice is your wife imaging associates\nCalling all zombies clowns princes and superheroes you know where you need to be on Halloween right the diamond center malls model mean trick or treat event on Halloween date from six to eight\nOut of the cold the diamond center I'm trick or treat the benefit\nStapler limited to go to the diamond front ... Facebook\nPage to purchase your ticket early\nThe cost is five dollars per trick or treaters\nYou must have an official trick or treat bad to participate\nA voice on mine pick up your trick or treat that early\nUp is available now the diamond send them off gas [noise]\nStay out of the cold and satisfy your sweet ... at the diamond center mom Ramallah mean trick or treating can benefit the red cross in the last time\nI'll treat no trick\n\nAnd the bases Ronan running and running running and running running and running and running and running and running and lie\nCome here to chew bubblegum venture capital [noise]\n... [noise]\n... show good bad and we [noise] I'm\nOn conservative talk Jay away in Ninety five point one ... eighty am\n\nJoining the conversation\nGoes by two Jews chain a Spanish\nDi di\nDi\nDi\nSeven minutes after eleven [noise] you can let that rolling along [noise] that was cool seven minutes after eleven\nIs the ... the bird show I Am any bird you are alive and color we are alive and color\nMr Chris Coons sitting over there taking care of your phone calls five six nine five six nine\nTen a drive in a spaceship making sure everything is working properly five six nine Jane eighty another great day starting off sunny\nWell what's gonna happen starting off sunny and\nIt will end up Mm\nProbably maybe rain and before the day [laughter] that's Alaska I was gonna say have you\nSeen the mountains over there I mean like there is termination dust and then it was gone and you know ... it's\nA knot looks like real snow yeah I mean I ... I was looking at the mountains up by an Eagle River there oh yeah I'm not ... not the closest ones yeah but it's you know but but the ones in the\nBackfield ... the backfield and they they they were looking pretty snowy village that was more termination\nDoes yeah but still here and I mean I haven't even ... really pulled out a real ... yet or anything that uh I did have a guy a trimming the trees around by building yeah and stuff so today I came out I had a lot of leaves stuck to my car had they had to be extra quick like blow 'em off on the way to work you know\n\nJust left it when taking my garden or ... or maybe like picked up the leaves and stuff that you happen to leave behind\nIt was a tree trimmer you know so yeah like stuff get kind of shaken off the tree and you know on a little Dewey in ... the kind of stick to my car I could have swept him off but I was like nah I don't have a twenty two year olds through brute of Dr slow [laughter]\n[noise] super is run forever they do man that's what they do those run forever but there are\n... ... yeah you you got to hand it to him I mean they they run they keep running\nOr there's this I don't know what it is about um they're just they figured it out\nThey built the car and and it works that's all there is to it um it is quite amazing vehicle I mean personally I like them but there are still\nTo off budget cash pools\nTo its general fund my pledge to protect and restore the permanent phone oppose taxes and restore and protect the whole of incomes that's a total and said baggage reiterated they planned to protect the fun\nI guess you can go to a link saying he would use a formula based on percentage of the sons market value that's what you call P. O. M. B. P. O. M. B. folks the law that we have now I think it's S. B. twenty six twenty\nThree something like that maybe somebody calling me help me out five six Nineteen eighty five six nine one zero eight zero\nThat there is the twenty six I Believe I think that's what which one it is is\nA\nA plan in which siphons off a portion of\nThe um the permanent fun and it ends up it ended up it can even into digging into a corpus of the fun when when are the markets not right it's just another it's the ... the way to understand it\nThey wouldn't have done this new P. O. M. V. plan per cent of market value the legislature would not have done it think about it think about it\nThe legislature would not have done this and the governor would not agree to it if it didn't give them more money\nOkay that's what it does\nTake some more money the potential to go to you and takes it and give it to the legislature\n\nMy plans to take fourteen billion or out into the corpus so the public is only a only people who can decide how to use that baggage said\nWell why put it into corpus why not just just keep spending them dollars off to the people of Alaska and let them spend it the way they want to spend the seat [noise] that child government works\nThat's how they always wanted to work they always wanted to be the decision makers for you they want to tell you how to spend your money\n\nThat's that's the problem we always got government telling us what to do how you should spend your money how you should brush your teeth what you should do how much you should do this and it just gets to be like hey wait a minute\nWhy don't you just not do it this way why don't you just go back to the old way let us decide how much you know we went through a fifty fifty split half of what was yours half of it was ours you spent yours now you want ours\nNow you came up with this clever idea called P. O. M. V. percent market value\nWhich also does aside for more money off of them being fun in in and give it to the legislature to spin you didn't do it for us you didn't devise is planned because it was great for Joe and Mike in Perry and Shelley\nYou didn't do this planet for them you did it for you you did it so that you can spend more money five six Nineteen eighty five six nine one zero eight zero that's [noise] that's what it's all about\n\nOh we came up with this plan here you know so that we could keep permanent fun alive still keep putting out dividends\n\nWhich still keep doing with Alaska's traditionally have wanted us to do\nWell then why did you change the plan you change the plan in order to benefit yourselves in order to fit the cash flow of the legislature that's\nWhat you did that sweat peel William V. does it was argued years ago it's failed it was argued now is one\n\nReason or one here's a reason it one because Walker took the David in 'cause Walker took the permanent fun doing it so after that that\nGave the the the the legislature being encouragement to go P. O. M. V. because they get sneak that by because let me tell you something it takes a week to figure out P. O. M. V. and explain it\n\nPeople say well you must be a little slow for takes you a week to understand this and after you get there explain that to me a favor go\nGet a hundred people stick them in a room and explain P. O. M. V. too and then give them a quiz afterwards\n\nOh just it it it it it [noise]\nMore difficult they make it the better off the legislature is\nMore difficult they make it the better off the legislature is because the harder it is for you don't understand it you're not getting normally spent time to dig into it and figure it all out that's what I'm here for that's my job\nAnd I'm telling you appeal envied this S. B. twenty six I think it is ... ... that's how it's going to control the Denver then you're going to get lessons to evidence\nAnd it doesn't work does\nAnd that's what they want to do is just another way\nSomebody was very clever they they make about messed up ... up a decade ago that got it it it could have\nBeen further back than that I think maybe back in Ninety eight Ninety nine\nWhen I was a staffer in the legislature I think they were kicking his appeal and be around people that want to have anything to do is it because they know what Rob the ... and\n... and just get it goes back to the budget and and and some other things we want to talk about later I'm Jackie driver killed a fury early morning crash\nAction much talk about this yesterday or the ... weekend or a Jew vehicle collision the old Stewart highway early Sunday Morning left one person dead and to others her according to ... police officers responded to Iraq the surge intersection Seventy nine avenues several blocks lord the diamond boulevard\nJust before one thirty AM\nIs only what is it Chris there's only a couple of people on the roads at one thirty morning\nDrunks taxi cab drivers and what else cops\nThat sounds like that well one of them was a taxi driver yeah the he's the one that the seas right round pick the classic classic crowned that yeah\nThe last of the cop cars the last of the big cop cars taxis to rear wheel drive yup\nOr a PD didn't respond to requests for ... details Sunday\n\nPeople talk about how they heard I heard a taxi catches video appeared to be Alaska yellow cab employees\nDeferred to dispatch supervisor\n\nThere's not much on the ah on the driver\nOr of the the vehicle that\nI'm crash in to the cap so ah the verdict still out on this see who you know it's not about guess whose fault it is there's there's a there's there's a death um\nAnd and that's the most important thing right now will figure out all the details later who did what what somebody didn't do or did do\nAnd uh and and it's a sad story\nYou you know you'd think hey I'll just go out and Dr ... part time make new will get extra cash maybe for the family and and the next thing you know you're um\nYou're not doing well your ... your your your your debt and uh so uh Alaskans\nWe're looking at a a a well all a lot of\nThings are starting to turn in the economy\nWe're starting to see it you know housing right now is real flat there's nothing coming on the market news there's really nothing out there nothing happening now if you're a real estate agent in and\nYou think I'm wrong about what I'm Talking about right now ... you know I Know we're just doing a we're in a spot on the market but right now this spot in the market and real estate market's pretty debt out there\nNot much happening not a lot of inventory are coming up for sale not a lot of new things to look at\nInterest rates are starting to rise that's that's the kicker right there so if you are interested in a house\nOr you know interest rates are going to start to rise to the president got on the fed for raising rates but I don't know uh how how that's going to change anything threats the feds are pretty independent so I'm\nInterest rates on the rise housing market flat but the economy in Alaska\nPledge to protest store the permanent fond opposed taxes and restoring protects overhaul of the state's financial assets in incomes baggage wants to change you as authorities over the money was fourteen billion of that into the corpus\nSo Republicans as long as the people that can decide how to use that were sent a market value that they came up with something better than to the constitution with a less percentage away propose they have a five point two five percent joy\nInto the constitution with a less percentage when they were both have a five point two five percent or every year I think it should be for some better percentage over the long\nPercent of that money for the defense\nAnd Walker said after being in office he wants to start out that the evidence at a certain spot and go up from their\nBias early voting in a positive way above about protecting the appeal to the sewer a constitutional amendment so I was a threat to the floor to ceiling cowboy let us let us continue to grow over the years [noise] you know oh here's the whole the\nWhole of phone Governor Walker's talking about protecting the permanent friends [laughter]\nGot along folks\nIn LA oxymoron in that light\nOpposite of the truth\nI mean he just he just took the permit fun I mean he was he was literally\nA you know not make a ceiling so yeah pick a former Nazi and I don't know what that means well so he could take all the cream off the top of it even though I mean did you get the crumbs on the floor people we get what the cream of the the one\nI don't know quite how to take that I mean may make you know I understand you know may not be up on\nWhat he means as much and maybe I'm being too hard on him but but please send me five six Nineteen eighty they didn't that five six nine ones are angel didn't sound kind of awkward to use like\nWhen you know this is the guy that stole your lawn more and then now he's gone all on\nMars or save other protect Ron more from the top to the bottom I mean maybe that's just silly analogy but it's just as I'm going to protect your money\nEven though for months ago I took your money a year ago I took your money you're given his are smaller today because I took it\n\nAnd now you're telling me you're protected my living in I I\nI don't\nUnderstand that I'd done you know maybe 'cause I grew up in in ... and it's been hard\nMaybe I grew up around his neighborhood right here I grew up in Anchorage I grew up with spin art and went\nTo school you know public ... I went to public school here in Anchorage I've been here since Seventy one I don't quite get all the stuff\nBut\nBut how does anybody else does that jibe with anybody else does it make sense ... ... ... I guess you could make any statement you want but\nTo me it just doesn't it doesn't jive ... it's hard to accept\nWhen someone says well I'm going to protect you and then you go a little ... he I appreciate that offer but but\nThe last time he said you're protecting human you kinda clipped me\n... and so uh I don't know can can we can we keep it gone or that I miss it all up All right let let let let's let her all\nOf them it was about six or eight hundred dollars [noise]\nThis is your sixteen hundred dollars and it's going to continue to grow\nThe you a student body president ... says he helps people get one thing from debate\nI Hope people are able to learn and then getting better understanding of what the candidates are sending four and a special on this important issue as a [noise] a piece of the\nSame I have noticed Republican might down leaving with missing and ... especially in conflict and just a reminder election day Tuesday November\n... what's next for the candidate such um are they have another debate it's at the center and they're gonna be talking about the Alaska guy fine as well as support McCain the extent where like sanctioning Iran\nRight today that'd be today there will be a gas line debate at the consider I Believe she said\nAh it doesn't leave is not there again he's not showing up at hardly any of the debates I I mean\nYou know from a strategic point of view if it's not necessarily that show up these dates and don't do it and and and if and if he's winning and all because this is what's gonna happen ... the uh this is what's gonna happen that the debates I don't want to sound like\nA like a Mr know at all or anything on it I can just tell you from my experience is\nThis is what's gonna happen and he's going to show up and the three of them are going to beat the crap out of him\nWell Billy to them might not but but but the but\nBut you can guarantee that Walker and baggage are going to beat the crap out of a of a deadly\nSo what do you do you go to the debate take the beating\nTake the you know they're ridiculed the last the ... the jabs\nI'm going there present your case\nBeat him and blah blah blah blah hold your head high and walk out or or do you spend your time being more constructive in and and doing other things\nWhatever those maybe maybe you got different events maybe you got some coffee events maybe got meet people at the coffee shop for the lunch hour or I I don't know what you do\n\nBut that is what's gonna happen to done levy when he shows up these debates there they're going to use them as a punching bag he's in Italy they noises lead they know they've got to taking down he says one thing wrong does one thing wrong in next thing you know he's a target for a week\nAnd he probably looks that has gone to the going to the debates now if you're a political advisor you're sitting back and you're having this debate back and forth within the team [noise] and you and I were just a fly on a wall right we're watching it\nIn one side say hey you know if you go to debate you're just going to be ... you're going to look like fools or the TV cameras going to be their newspaper and blah blah and then something goes wrong you're going to make your going\nTo be made look stupid right there's a chance that we're not seeing your stupid candidates than they were just saying that they're going to do different things to put you in a put you in a trick box\nUm the other thing the other side of well yeah but if you don't go then you look weak you know you got to be able to stand up to these people you got to be able to take he got to be able to da da da da da da da da ... in order to prove people that you're a leader in that you can handle the ... the fire\n'cause if you don't go to the base and it looks like well you know you're not part of it\n\nI Would imagine that those two arguments those two presentations took place in front of done early and and at this point in time I think they've chosen to not show up because of\nThe different things and then they'll choose just show up at some of them but not all of them\nAnd they'll continue to have different debates and rallies on their own throughout the state as time goes on and not necessarily participate in um [noise]\nEach one of these I Will be right back was more on the permanent fund the budget and the race\nIt was more on the permanent fund the budget and the race\n\nMm [noise] type folks I'm Scott Jansen my wife W. I. along with\nOur son in law Jordan Eastman own jazz who's evergreen memorial jak dancers legal residency of alone chances Alaska commission center and Jackson's Metsu soon and I've been a license funeral director in the bomber in Alaska since Nineteen eighty five\nI'm also and I did Raj initiative known these days is much more efficient when your choices cremation always go Jesse's Alaska cremation center that chance in Alaska convention\nCenter you can choose to have the viewing or service was just finishing families can be president of the nation which like those that she was very ill at the graphs and cost drives your choice let us know\nWhat would you regard as severe financial situation when you need to\nChoose a funeral home or cream matory harassed your recommendation be sure to choose a locally owned Jansen funeral homes where just like family were there when you need us [noise]\n\nRobert Miller here the orange soil bells vacuums before you buy a new vacuum I suggest you do some online research you'll find that middle vacuums are rated at the top that\nVirtually every reputable source Neal a vacuums or German engineer design and build band there are some of the most beautiful durable functional and powerful Americans in the world was acting as they're known for one more thing they are never on sale\nWell almost done by\nMales values today in Syracuse so actually the ... call on sale today you can save up to two hundred dollars on a new me what have bills racket do depend solely on someone else's review bells vacuums you can hold a vacuum in your hand test drive and listen to it\n[noise]\nWhen I found in Fiji geo and asked them to serve it is [noise]\nMichael claims that more lives on the ... at least twenty six now known dead in four states and search crews begin to wrap up their work and one of the hardest hit areas where the storm made landfall in the Florida Panhandle\nLed by the Florida task group but number two or this multi jurisdiction of group\nHas been all over they'd been all through the structures year more than once they've searched it with dogs or they have back back in the marshes searching around there so they have by covered a lot of ground and quite possibly they are done now we know now in Bay county or the number of people killed by hurricane Michael is twelve state wide that number is sixteen\nConscious my job and in Mexico beach where officials are still urging residents to stay away for now because there's so much debris and it could take weeks to restore power and water service Sony officials say they still had nothing to do with the suspected murder of a Saudi journalist in Turkey the\nPresident tweeting just spoke with the crown prince of Saudi Arabia who totally denied any knowledge of what took place in their Turkish consulate he\nContinued he was with the secretary of state Mike Pompeo during the call and told me that he has already started and will rapidly expand a full and complete investigation into this matter South Carolina Republican Senator Lindsey Graham is already blaming Saudi Arabia\nSaying he's prepared to in his words sanctioned the hell out of Saudi Arabia for its alleged involvement in the disappearance of the missing Washington Post contribute\nRocks and the John decker at the White House shares officials in South Carolina just confirming that Emanuel ambushed officers earlier this month had nearly one hundred thirty guns in his home one officer was killed six wounded when they went to question the man's son about a child sex assault case Wall Street comes roaring\nBack out of five hundred forty six points at the closing bell a rally ... earnings report in ... this is science [noise]\nFrozen the no star with low because Lois have the power tool brands pros count on every day coming now during the wall days and get up to thirty five percent off the lights all tools like adult tone evil cordless drill or a cordless impact driver\nVote was battery included now Ninety nine dollars each ... save time by ordering ahead on line and your order will be ready for pickup install\nSome fire visit Los ... dot com pretty tail so pro now that you know start with loaves of ALS or ten thirty one last flight last us on\nTwenty four seven three sixty five Europe an ad on every day so you don't want something like Medicare part D to lay down at Walgreens will take care of your Medicare part D prescription\nSaving you time and money to make the switch to Walgreens today and get more bang earning a hundred dollars or more points and save up to five dollars on each Medicare part D prescription when ... disorder pharmacy Walgreen trusted since Nineteen oh one prescription said it applies to engineers when he's always prefer\nVersus another pharmacy and select plans for the ... here in New York New Jersey are are going to other locations apply\nThe word breast cancers summing up powerful feeling\nMotions we all know that early diagnosis and treatment generally result in a better outcome for ...\nThat's why you should be aware of their powerful new technologies are no enabling doctors do make earlier clear diagnosis and treatment abrupt and once again the doctors and technologies that imaging associate were brought these new technologies agree [noise] three ...\nBreast biopsy capability and now breast m._r._i.\nAnd images so she has to do the only non hospital admission imaging center and I agree they offer all these powerful diagnostic ability imaging of shows you the only group in the last good about what's your brain radiologist specializing in\nRush to meet you at all of this competitive price on average thirty percent less than ... D images remember when it comes to new imaging the choice is your wife imaging socio\n[noise] there's always somebody\nLaughing trick or treat to keep the trail this Halloween on Wednesday\nGood time trick or treat addiction provided\nWe will be decorated in Halloween candy activities in the trick or treat it if you get a little chilly you can warm up a bonfire or\nAt the coffee shop there will even be indoor activities to last year over three thousand people shouldn't be allowed\nParking EPA's use limited to ensure your family gets him quickly from your lesson motor coaches provides free shuttle service from South high school to and from every ten to Fifteen minutes for\nFour to eight prevent ticket prices are seven dollars for members nine dollars for a non member and available at ... dot org tickets will be ten dollars at the gate be sure to arrive from black history will be seven thirty PM so put on those costumes grab your trick or treat bucket enjoying this ... at the last\nFrom the moment you realized you're\nWill be forever change on the little moments\nExcitement trying\n\nTo think when you need on\nMy Twenty one Twenty one and done um\nDo you have a left wing struggling with alcohol prescription or street drugs not sure how to help [noise] you're not alone\nCan learn how to turn your family into recovery teams best selling author is jak endeavor table present structure to I'm covering two pm Saturday after every twenty minutes entering lasagna and seven pm Monday October twenty second and when you Williams and out of time in Anchorage register and learn more real about addiction dot net\nThat's real doubt addiction dot net effect of just wants to buy real about addiction aired by the Alaska broadcasters association and efficient\n\nIt's\nThe liberty lunch hour I'll be Eddie ... show the army and navy in a battle they have one or two Americas colored the colors of never\nThe wings of liberty and their religious conservative talk J. O. away in Ninety five point one FM at ... am and K away and FM dot com and I'm not terrified for free speech is your First Amendment rights express it [noise]\nMinutes after twelve lets the liberty lunch hour [noise]\nAnd when you have more money you have more liberty [noise]\nGo talk to a rich person they'll tell you all about it\nVery confused about ... uh liberty and money and what money can do for liberty go talk to a rich person liberty I can talk to you about it but I don't know about it\nThat's it I don't know I'd say freedom to of liberty freedom a winner flat broke you got a lot of freedom to strip to nothing and you just take your shopping carts\nTo not really strapped to nothing and you just take your shopping cart anywhere and go crash there there is a little bit of freedom and not having anything even though I couldn't be like in that song enough of freedom freedom just means you've got nothing left to lose\nSometimes [laughter] both into the spectral before he got a lot of money we're not sure\nWhere money we're going to try to run a positive spectrum\nSo if if you want to have a lot of freedom and a lot of liberty my suggestions use get out and work hard earned money because the more money you have more freedom and and and liberty you have you you you're more independent\nAnd I'll\nBe going to say because they're not rich or they don't have much money that there is no way they could ever experienced this ... and or you\nKnow I'm wrong or something no I'm not wrong I'm\nI'm just ... ... if you'd just examine\nFreedom and liberty that people\nWho are are more well off\nHave you'll understand that and and my bigger point is that don't ridiculed people who make good money don't try to because you don't make good money don't cook to go out and try to tax them don't go out and try to go after them well that's a rich guy\nYou know I I never worked for a poor guy\nI never at\nA U.S are so keep in mind you know it it it's it's the business people it's the people with money who generally do the investing is they're the ones that\nBy quip man they're the ones that take the risk they're the ones that you know are the ones\nPutting everything out front in jeopardy in order to hopefully make money\nAnd and and it's always seems like in this country that somehow it's easy to to the beat up on somebody that's made it a man he's got going on and he makes lots of money I guy makes two three hundred thousand dollars a year man you know\nAnd the lady's name is not mention now we've all been through this and we've all talked about it many times and we all have have have had our own opinions about this story and and I think the ones that we keep going back to was that\nThe judge\nSomething failed in the judicial system and it's this judge who let this person go\nNow today\nToday there's an opinion piece this is an opinion piece that was written by dean of Corey and this appears to be the wife of judge Michael Corey\nAll right so what happens is the judge makes the decision there is a fallout from it\nAnd depending on what the fallout is I guess this this one here um\nCreated an organization and some of his living room probably as as a are we going to analysts\nThey've got marching in front of the gym a front of the uh the the the courthouse\nAnd all these people are are upset about this this decision what what what do we do what do we do what can we do the elections coming right up I mean people are not going to forget elections only twenty days waves to act is less than that\nOr what are we going to do how are we going to save my bacon well the idea that they came up with was to have\nThe judge's wife come out and say hey I've been molested too so I understand so does my husband\n\nOf course I don't see what that has anything to do was making the proper Judgement\nRendering of proper Judgement on a case\nMeans five six nine ten eight if you think I'm wrong or you got a better suggestions on the same day on the same day the same exact newspaper\nThe editorial board so here you have one editorial by the wife that\nComes out and she\nIs uh basically making excuses she's taking care of her husband that's what I expect\nI mean I I'm not going to blame her for doing that I mean that's just that's that's ... that's what families do they take care of one she's looking out for us\nThat's what families do they take care of one she's looking out for her husband she was looking out for his job I wouldn't be too I I'd be trying to protect me\n\nThen like I said the Anchorage daily news editorial board came out today ah with with their own op ed piece justifying why kind of making excuses for judge Corey\nWhen justice Snyder received a plea deal that allowed him to avoid jail time in a sexually motivated assault case that shocked\nAlaskans many were justifiably outrage the punishment didn't fit the crime the leniency of the sentence was difficult to spray it with any notion of justice unfortunately one of the targets of the greatest a year in the wake of the sentence is superior court judge Michael\nCorey and whose lap the plea deal landed\nIt's understandable that Alaskans are looking for a way to make sure an outcome doesn't occur again\nYou're absolutely right\nThe out all the people shouldn't have to act in order\nTo ensure to ensure\nIs that a wrong fooled determination is is made are not made well I Would tend to tend the negative I Would say is not me\n\nBut that's been she how we're missing the daily news misses the car here they missed the boat they missed the ship\nIt's that's why we have judges that's why they are versed in in in in in these cases\nThat's why they have so much attorney experience law or experience courtroom experience that's why that's why they get appointed just because someone felt\nThat that they had the the legal sense\nAnd\nAll the other fancy words they use for the legal temperament and ... blah in order to be a judge\nA superior court judge\nIt says again but singling out judge Michael Corey isn't the right way\nTo make sure of that\nWell who is\nThe judge has the final say the buck stops at the top\n\nThe judge made the call\nThe judge could have sent back the plea deal because that are you kidding me\nGuy jokes that a woman Jackie liaison or all over this little although I'm not taking this I'm not accepting this\n\nI Would be feeling the citizens of Alaska by accepting this this um this plea bargain\nJudges do that all the time they don't accept plea bargains they can accept or reject that's what they're there for it if we just wanted a a a robot to do it we can get one of those do they make 'em nowadays\nThe timeline Snyder's case as it moved through the court system is the tragedy of errors that lit up to an end proper outcome no nothing lead up to an improper outcome the judge made an improper outcome\n\nSee the daily news thinks are slick than the daily news is word Smith and things and oh it's all about this and that\nNo it's not\nAt junctures throughout the process decisions were made that lesson the severity of the consequences Snyder face further egregious incident in August the twenty Seventeen in which\nAccording to a police report he choked and threatened to kill a woman before masturbating on her what an elder you need to know more than that\n\nOnce they're missing what's missing what am I lacking\nFive six nine ten eighty five six nine I Want to hear from you five six nine ten eighty\n... waterway medicine\nWhat didn't the judge jab at his disposal in order to make a a um\nA decision that was\nWell I guess you could say more uh approval by the citizens of of Anchorage, Alaska\n\nSubscribe to the issues in the case\nSpeak to the ... states over burden law enforcement criminal justice division\nSo not only were their mistakes made in the case right not only that were their mistakes made in the case but there was a whole string you know of errors and then it was just all just dumped in the judges lap\nAnd therefore course you know judge can't make a decision good decision 'cause it all just got dumped in his lap five six Nineteen eighty five six nine one zero eight zero\nI Want to hear what you have to say\n\nFive six nine ten eighty five six nine ones or aids or I only hear the differences and opinions on Schneider finally hit listen to this this is good\nSchneider's financial ability to hire a defective private defense counsel was helpful and convincing their superior court judge\nTo allow him to stay out of jail on electric modern in law enforcement dealing with the swarm of other cases lost track of the victim in the case prosecutors didn't subpoena her to compel her testimony in the case of a potential trial I mean here you go they they even failed to keep track of the other witness\nAnd and and the victim and I'm ... and have her there five six nine ten eighty\n\nThis has nothing to do\nThey're trying to take things that happen in the regular courses of the day and trying to make this judge's ... like like the judge is not his fault not his fault all these things happen it's not his fault not his fault\nWhose fault visit who's willing to take the blame that's what I Want to know who's ready to stand up who's man and a woman enough to stand up and take he'd say okay it's my fault\nIf the judge isn't worthy who is [noise]\n\nThat's what they want us to believe\n\nShoot if you if you're having trouble finding somebody I Know bill collector that'll find them\n[laughter] that guy find anybody he's got connections over at M. L. P.\nSaw ways electric company phone company man that dude that that'd be fine anybody [laughter]\n\nWas there a more that could have been done judge court could have asked a for a present and the report before agreeing to a sentence which would allow prosecutors and defense attorneys to debate Snyder prospects for rehabilitation and argue aggravating or in mitigating factors that could have affected\nThe sins and that's another thing\nThat's why this case has so many holes in is abuzz why people should be so upset that's why the judge should be gone it's why this judge needs to be removed these aren't mistakes the court made\nThese are the decisions that he oversaw he's the judge he is the final arbiter he makes all of the disease is about the inflow and our flow of information into the courtroom\n\nThey're making it that there's this daily news articles making them look like judge ... it was just some third base guy sitting out and maybe wanted out to the outfield and every now and then they throwing some information out there this guy this guy is the the the catcher man he's right there\nIt's his job\nJudge Korea was unanimously recommended for retention by the Alaskan ... he was given a four out of five star rating by attorneys who came before him in a five out of five ranking by\nJurors these recommendations should not be taken lightly they represent a robust survey that's great that's great we got all kinds of great people and do things every day that are great but guess what one day they mess up and they screw up and guess what happens\nThey go to jail they pay a penalty they pay a price sometimes the prices are kind of heavy but that that's what happens when you screw up\nThat's what happens when I think when you get ...\n\nYou get sick and you forget about why you're there so you get hung up into the legal minutiae of it all\nAnd you forget who you are you forget you forget why ... what your services to your state dear to me\nWe're not perfect none of us are but there are but there are many many many reasons\nWhy this judge alive outlined several of them\n\nThey never took in here here either they're talking there the daily news is using this as an excuse\nBut in actuality\nIt is a is a factor\nFor the judges guilt in his complacency\n\nWhen it starts off and let me read it against this was there a more the that could've been done question mark judge Corey could have asked for a pre sentencing report before agreeing to a sense that maybe that wasn't necessary may mean normally that's not part of the process\nWhich would allow prosecutors investors debate Schneider prospects rehabilitation argue aggravated mitigate that's the part there\nIs the aggravating in mitigating factors aggravating factor was one he choked her out sec any jak you elated honor those are aggravating factor\nOr what was the third one he um\nHe he uh he left or they're so\nHere are ... and you can say there and there was a case of kidnapping\nNow that they say well technically she got in a vehicle on her own so that there for that and make it ... you know you couldn't keep the the kidnapping charge alive\n\nBut just some of these things aggravating and mitigating factors was never as far as I Know\n\nBecause that's these aggravating factors would have added\nTo the judges time they would end justify the judge gave him\nThe the the defendant more time more jail time any didn't do it\nThey had the daily news who runs out today and defend them\nAnd then the guy's wife the judge's wife comes out in the ...\nShe's a sexual assault victims herself\nBecause she's a sexual assault victims herself\nOh I'm a sexual assault victims myself and so I'm gonna let you know my story\nSo Sanaa that makes my husband's screw up okay [noise]\nUm I'm not sure if I'm I'm\nI'm I'm I'm following that one or not maybe somebody can help me out five six nine ten eighty we'll be right back [noise]\n[noise]\nLaughing trick or treat the trail this Halloween on Wednesday\nGood time with trick or treat fiction provided\nWe will be decorated in Halloween candy activities in secret prove\nBones and if you get a little chilly can warm up I'm On fire grab\nThe coffee shop there was even be indoor activities to last year over three thousand people join the\nParking is limited to ensure your family gets in quickly mirror laughter motor coaches will provide free shuttle service from South high schools do from every Fifteen minutes for voter Eighteen prevent ticket prices for seven dollars from nine dollars for non members in debatable\nAdolescence ... tickets will be ten dollars at the gate be sure to arrive from the last century students will be seven Thirteen so put on those costumes grabbing a trick or treat bucket enjoying this ... at the Alaska\nCalling all the time these clowns princes and superheroes you know where you need to be on Halloween right the diamond center mouth mouthing mean trick or treat event on Halloween day from six to eight [noise]\nStay out of the cold the diamond center I'm trick or treat for benefit the red\nThey had to go to the dining room off Facebook\nPage to purchase your tickets early\nAccosted by dollars per trick or treaters\nYou must have an official trick or treat bad to participate\nAvoid them I pick up your trick or treat that early pick up is available now I've forgotten in front of ... that\nStay out of the cold and satisfy your sweet kid at the diamond center mom from a mean trick or treating to benefit the red cross in the last time\nI'll treat now trick\nYou know there are many people in Anchorage who have their own special place for gifts for occasions like mothers' day or birthdays anniversaries whatever into bells nursery and gift they go\nAnd there's always something perfect bells gift shop ... incredible selection of unique creative gift ideas crystal glass in China and flat where a wonderful kitchen section candles motions and potions and of course delicious sees candies and lots more great for browsing or finding that special gift\nThe gift shop at bills nursery I'm spec and grow\nWhat'd you tired of corporate robot and with a fine print and company policy and save on foreign we don't have a policy we have common sense low overhead and all that they wouldn't be walked and save on forty looking\nTo purchase by corporate if you will that will solve it hard would we do this a few times a week with the most you especially from the middle in Georgia and what did you save on ... and you saw was working harder it's all hospitality like we all used to know marriage you know that you\nWould tell you about it and somebody said one day of minutes of driving the houses were these changes are way floor you saw\nAn ad for two didn't started turning up on the radio station I own I'll bet you've heard it the tale of two Charlie's\nIt close to home because I did lifted my mouth for years it was getting embarrassing so I gave him a try I wound up seeing Dr Spalding expected a lecture I deserved it I'll tell you that I deserved it he looked he said\nWe've got some work to do and he got started everything good that was said about modern dentistry in that ad is true the staff really is pleasant caring in professional and I'm Amazed at how quickly modern anesthetics work\n[noise] oh yeah I'm On our family and\nCheating on line [noise]\nMore bodies found in Florida and the ... hurricane Michael now blamed for at least twenty six deaths four states as a grim search continues in the devastated Florida Panhandle local\nPolice working off a list largely they have exhausted that last pending that can notification they may be done with it but you still have taskforce number two out here it's working the map and they keep finding more people\nAre just like to open in Mexico beach for the storm made landfall President Trump says he's hoping for answers from the ongoing search for evidence in a suspected killing in the Washington Post contributor in Turkey pocket John decker live at the White House\nThe president tells Fox Business network Trish Reagan that he's continuing to\nRight at the White House the president tells Fox Business network fish Reagan that he's continuing to monitor the situation with Saudi Arabia which is suspected of being responsible for a missing Saudi journalist who's not been seen since entering the Saudi consulate in Istanbul\nWorld looking at it together but turkey and Saudi Arabia looking at a very strongly and it depends whether or not the king or the crown prince ... about it in my opinion who\nNumber one what happened but whether or not they knew about it if they knew about it that will be bad\nSouth Carolina Republican Senator Lindsey Graham is already blaming the Saudi royal family saying he's prepared to in his words sanction the hell out of Saudi Arabia Lisa\nThanks John that interview Trish Reagan prime time aide eastern tonight on ESPN a record number a job opening helping to fuel a rally on Wall street the Gallup five hundred forty seven points positive earnings reports part of it\nToo had eleven for five hundred companies are pointing yeah seven components of hoarding we already heard from all this and also I Jonathan in John straight and that brings the optimal that actually\nThe sandwich Nicole ... at the New York stock exchange Netflix shares storing Fifteen Percent in after hours trading after beating estimates in its earnings report yes and the and the NASDAQ also\nA lot more than two percent succeed [noise]\nFrozen I Know start with low because loves makes it easy proposed to save money every day on building materials supplies especially when you buy in bulk\nPrepare for any job insider up by saving up to thirty percent down to like concrete singles R insulation plus see time by ordering ahead on line and you order will be ready for pick up and start stop by our visit low supposed dot com ... details so pro now that you know\nStart with low minimum purchased require selection varies by location\nTwenty four seven three sixty five Europe and had an every day so you don't want something like Medicare part D to slow you down\nAt Walgreen will take care of your Medicare part D prescription\nSaving you time and money to make the switch to Walgreens today and get more bang earning a hundred dollars or more points and save up to five dollars on each Medicare part D prescription\nWalgreens is more prefer pharmacy Walgreen trusted since Nineteen oh one prescription said it applies to engineers when he's always prefer versus another pharmacy and select plans points given here to New York and there are going to other medications apply\nDo you know what happens when there's no flies everybody goes nuts trying to get there is no tires on and that's still is one car and everybody needs new winner tires and we'll do the shops are jammed\nThan you might have to wait for a week or more\nThat's why you winner take your rigged him up their city and break right now because multiplicity and break as a killer special litter package on our wheels and steel wheels each with new tires murdered balanced and stole Michelin him cooking more available and buffalo city and break those those are defined sizes to were serious\nThese are great deals on winter ... wheels right now but listen carefully\nWhen you go to buffalo city there are no gimmicks all you have to do is check the final price and you'll know muffled cities where you want to be and one more important detail unlike most shops multiplicity and break users car Biden steel ... better in last longer that's more for your money\nBut get it all done now before the winter rush for sixty three years the best and break smugglers sharks instructs tires and we'll muscular city and break fifth than eight street downtown\nRobert Miller is your story bells vacuums before you buy a new bacterium I suggest you do some online research you'll find the middle of actions are rated at the top\nVirtually every reputable source Mueller vacuums or German engineer design and build and there are some of the most beautiful durable function on powerful bedrooms in the world are Jews are known for one more thing may or never Ansel\nWell almost every dollar bills back your city and see our June she'll actually the name American Paul on sale today you can save up to two hundred dollars on a new me what ... does depend solely on someone else's review at bells vacuums you can hold the vacuum in your hand test driving listen to it\nAnd feel this option we have a thirty day read three trailer most products try it for a month not happy or you may\nRemember we are all on pricing reserve is all rooms and we never charged for an estimator bills racket five hundred ... Benson\nFrom him in a mall\n... suddenly and the responsibility is yours to make the arrangements you have no\nPrior experience and the death of a loved one what do you do for the final plans for various cremation would there be viewing what will this cost folks this happens to people just like you every\nDay I'm Scott chance and my wife W. I. along with our son in law ... gym sins evergreen memorial chapel chances Eagle River fewer chances Alaska cremation center Jim Smith says I'm also when I did was initially known these days is the mission mortician\nAs a mortician in Marshall many stories as to the trail of life and you do to address told me if you need to speak for your organization when you need a funeral homes would just make the range was we're here to help when you experience suggests ask your recommendation\nAlways choose a locally owned Jansen funeral home chances evergreen memorial chapel Jetsons Eagle River funeral home gym sins Alaska cremation center or jams Metsu funeral homes where just like family were there when you need a [noise]\n[noise]\nHe's the ... show today a lot of the ... level I mean I wake up one\nAre you know I'm just a big hairy American Boy that was the first year last\nThe most conservative voice on the airwaves king\nThank God [noise] yeah\nOn conservative talk Jay away in Ninety five point one ... eighty am [noise]\nSeven minutes after one o'clock seven minutes after one [noise] you know question and I put up earlier\nThen maybe some people can call in an answer for me [noise]\nAnd maybe I don't have my story straight I Know there's some people listening and that that that might be able to score me away if the governor took them permanent fund David in\nAnd the\nRound three thousand dollars that he's taken since he's been in office if he did that and he put it in the earnings reserve account why did he do that\n\nI thought that was money was going to use because you know the state was was crashing\nI I like for somebody to come in and ask answer that question I liked him to help me out if you need money so bad that were in the middle of the fiscal crisis\nBut you take the money and put it in a reserve account\nHow does that coincide with we have a crisis interview don't give us your ... and if we don't take it you know like crippled children aren't going to get to go to school because that's basically what you're saying so why would that money put in journey\n\nSo why was that money put into earnings reserve account and not spent in general sons\nNo eight maybe it's a simple explanation somebody that knows the budget and those are things work and can explain it does lay people\nSo that we can understand better southern please explain that to me I'm I'm begging somebody to call me five six nine ten eighty five six Nineteen eighty and tell me\nIf we needed the money so badly that\nWe had to take it I mean really take it like at the for the night\n\nBecause of the crisis\nBecause of lack of money and a lack of money would do the certain programs and all then why did we take the money and put it in their earnings reserve account their earnings reserve accounts is is a savings bank\n\nSo I don't get that\nIt might not understanding something\n\nOr use confused as I Am\n\nNow I don't call anybody out over the air but\n[noise] you know who you are ... and then they can answer this question they have the ability to answer this question\n[noise]\nWhen I seen that that brings back memories won Nineteen we're talking about um\nWhy did the legislature take millions of dollars out of your permanent fun well we can just well the legislature was in on it too but this is talk specifically why did the governor take millions of dollars out of your ... and\nAnd then we lose it\nOkay we lost the call at five six nine ten a call right back we'll get you ride on five six nine ten eighty I think it was Kim right\nHe was Kim\nAnd I was going to ask Kim Kim was going to tell us why she thought\nThat\nThe governor did that why they took the money from the permanent fun well took it from us\nAnd in deposited into the earnings reserve a cow like what did that do\nBecause if you're under the I explain this a few different times on me be done about it repetitive about it but if you're asking because there's a crisis then you have an absolute definite idea you have to do with the money because you're asking for something is over and above the normal\n[noise] ... expenditure revenue stream\nYou're asking for something that accurate when it comes to the permanent for them and then you're asking\nA for something that's been guarded and [noise]\nAnd ... served in historical sanctity for so long that to ask something from that\n... you must you know the world must be coming to an end or something it it's a big big big deal if you understand Alaska politics in order to\nTo dip in and take not even they didn't even ask I mean this to look at\nThis one thing about asking in everybody going well okay but they just took it\n\nSo I that that that that and Jim was on the line I wanted her to but\nShe had to go five six Nineteen eighty five six nine one zero eight zero\nOf anybody had any ideas as to why they took it\nBecause if they didn't want to spend it then why did they take it in the first place you know what I mean\nIf you don't have any food and a house and the kids are hungry and you're starving you know and you go on mom and pops to Bob's bomb I I I Need a few hundred bucks we we gotta we gotta have some food and house you know blah blah blah\nAnd then you put you give them the money and then\nThey put it in a savings account was like ... well I mean go buy\nFood that you need food\nThat was that what you got a strange five six nine ten eight five six nine one zero eight zero so uh\n\nTeachers or continue to pair for um lockdown called Alice dream throughout our school district\nI think the amount of we practice is vital because a lot of time something that goes uh the first indicator is for the kids to be a free cook says yeah I ... I keep\nBut they have got they have these new door locked in place where we're um they're pretty simple and act like a barricade and um so\nHave this uh Web drills where they barricade with their desks and stuff from yeah enough stuff in the classroom that they get here\nStay with their death and stuff from yeah and the stuff in the classroom that they get to really do or don't they I Know\nIt's a pretty slick in a bar that lays down oh yeah and then this thing comes about the floor and it acts like as a letter to keep it there and it's just a phenomenal\nThe way just that piece of bar\nGoing down in front of the door and\nWound up there we have something like that I mean we need yeah meaning like this and obviously this kind of stuff works I mean uh what was it just a couple of weeks ago we had the shooting of the downtown just in the parking lot but I mean they locked down the school and and everything you know so\nHey if you stop if you can you know like the way you stop people from\nThe ladder you know they had a drill it a nice time where they actually had a police officer shooting blanks in the hallway oh right and stuff so yeah and my my son was a\nVery nice time when they were doing that I have to be heard and he said no you didn't hear any of the show going on but you knew they were doing that live a shooter drill so this is the\nThis is the reality we live in and then we got to be prepared for it\nYeah and as time goes on things will improve in a security will get better and then things will be better um I Want to play this a comical Philips credits oil tax regime for new north slope production\nAnd it's about time we see something that we'd be getting a lot of oil taxes way does seem like we do much to get things in return so if you want to play that soon as you can uh be happy to listen to that five six\nNot until you have first oil from federal leases and the national petroleum reserve in Alaska or the NPR a\nJoining me now to talk about the greater because she has one project is Scott ... vice president of extra on the air that kind of Alaska thanks so much for joining us special is so different now than it was made on to say but it's actually two months ahead of schedule how comical Phillips reach up production hadn't schedule\nBut we have a pretty exceptional project team and uh they basically work schedule and got things done and more expeditious fashion and we had planned a this project has actually been in the work since two thousand and Thirteen\nThat's when we first started the permitting process and here we are about five years later we have a first production on line was October this winter so pay when all the wells are up and running will do about twenty five to thirty thousand barrels a day a GMC one\nYeah and I wonder how do you mention it dates back twenty Thirteen and twenty sixteen Wi Fi dramatic drop in price of oil and we really haven't seen it rained down since how has that impacted this project\nBoth will drop down to less than thirty dollars a barrel ... years ago you know when that happened we basically I'm\nTrying to find ways to reduce our costs to go back to the to the fire segment you just had a moment ago reduced cost find ways to do things more efficiently more expeditiously or as a company it really is an industry as a whole but really started focusing more on how we can reduce our costs him survive in a low cost environment\nTo right now based when we look at all of our read all of our projects who tried to make sure we can do it at forty dollars a barrel or less cautious supply the price of oil has rebounded pretty significantly we're up to close to eighty dollars a barrel right now so that is obviously giving us some breathing room there really hasn't changed our focus on trying to remain a low cost producer\nWell in the wake of those low oil prices state lawmakers changed our state oil tax regime in several ways but actually the Senate resources can a chair when she heard about the outfit she referenced in LA and she said\nAnd denouncing it actually proof that that the corps framework taxing that lawmakers print play several years ago is working gave a great\n... great in two thousand Thirteen removed obligations to just be Twenty one task try and work and that's been really leveraging for investments from Alaska um you know Alaska was a high cost place to do business and our tax rate under the old days was regime was as much as Ninety percent of all the marginal tax base was\nUh the current tax from like we have no kind of puts us in the average of where we need to be in helping people actually competitive\nYeah let's talk about the greater relationships one is native land and within the NPR a it's a very remote location at seven hundred and twenty five million dollar investment can you talk a little bit about what it takes a logistical aid to develop a project in this area\nSure some you know we've been doing this in Alaska for over forty years going back to our historical companies are co Philips comical comical Philips and we know how to do this um it takes hundreds of people to build a facilities over the last two construction seasons we had over seven hundred people working to build facilities and build a project\nWe're contractors up here who are very experienced and putting in the gravel we have a supply chain team that knows how to get the equipment up here when we need it and get the right equipment in place with the right time\nSo it's it does take a lot of people but it's also something that we're very good at we've been doing this for quite a few years\nAnd it is actually in that first as a two part project at greater risk a chance to set the stage for that tell us about that fight\nTo greater loses too ... too is about eight miles southwest of greater measures tooth one\nI think that thirty well for gym teacher that pretty well explains little\nThing uh you know like be pessimistic and I hope it is in relationship Senate bill Twenty one of the tax\nThe new tax regime ... does create more\nProduction uh I I've\nBeen a little leery about that because over the last several years has been through not much drilling not much expiration not much of anything you know of course\nPrices have been at the bottom of the toilet so um it's hard to expect a lot of things to ah take place when things like that are happening so I'm getting better food doubt hopefully this is a moving the right direction because obviously\nNinety percent of our states revenue comes from oil and um we we know what happens when it's not there will be right back around\n[noise]\n\n\n\nThen things will be better for a while\nBut if there are still feeling in the legislature\n\nThat they can go after the David in and the little or nothing will happen to you\nThey'll go forward again\n\nThat's all they need they need a window they need to feel\nThere's a there's a there's a grace period out there to where potentially they can go at it again and take it remember they'd been after they have been running after for twenty five years\nIn some way or the way everybody been been mad at you know like they're like like\nCockroaches man just just they're just going out there just wasn't picking here breaking here and they just come from all different places and and they surround the thing and and and and they want it and they keep trying to feed from it\n\nAnd and that's the way they've been for the last twenty some years have you given money they they spent ... years ago if it wasn't locked up in a ... and and the constitution\nThat those billions of dollars that sixty billions of dollars that's a locked up ... it'd be gone or I I don't know if it'd be gone but\n\nThey they definitely want to spend a lot more of it than what they could have what they have which is nothing because it's been locked up in in in the constitution\nUm\nBut but this question and I'm not going to keep delivering it because I'm trying to find the answers someplace else\nBut\nThe legislature has chosen to take the money from you ended up the governor and chose to take the the the governor and the legislature\nThe governor didn't do it on as a\nGovernor had to help the legislature and the governor took your P. F. D. they've taken about three thousand dollars worth of it based on the deal we made years and years ago\nAnd they put the money and an earnings reserve account\n\nAnd and I I Would lie I think we should I mean yeah the average citizens don't we deserve to know why\nCould that be explains somebody just call up and five six Nineteen eighty and and explain that to us and then put us all arrest make yourself feel better make us all feel like\nAll all you know you go oh I didn't know that oh okay\nWell yeah that makes sense I'm waiting for somebody to do that\n\nAnd now you're wrong the governor didn't do it on his own\nThe governor did it without their resistance and the legislature\nThen\nIf the legislature wanted to get the the the the governor of the legislature could've overridden the governor\nAnd done it no that's not going to work here when not going to work after that the legislature could've acted legislature\nDid this on their own legislature played ball the legislature wasn't brave enough to go out and take it but the governor was but the legislature told the governor a if you take and we won't go after you because the legislature\nThe governor news of the legislature had the votes to come in and override veto\n\nThere was never vote taken lead\nYou want to show me push back you want the legislature to show me some pushback show me a vote on the floor\nThat's where the pushback comes that's reality because not see legislatures only get paid do two things vote and talk\nIf you're not talking you got to vote and when you quit talking it's time to vote the legislature\nThe legislature never wanted to be forced to vote on it they never wanted to take it up\n\nAnd it still doesn't explain why\nThe money was put into the earnings reserve if you need money for a crisis dang it you if you need money for an emergency situation if you need money so bad that you got to take it out of the people's money then then you should have\nBeen thing why is why why can't we see why don't we know of what they did with it why why don't we know what why did it end up in an earnings reserve\nAccount a savings account\n\nAlso legislature's got to do is call for a vote\nIf enough legislators wanted to call for a vote for him to re sin because there is going to be a meeting here's the facts and the last\nLetter saying it was later say just let us a legislative session\nThere was a called a joint call for the house and Senate to come together and override vetoes\nWill some senators voted no and that stopped that\nThe opportunity to override vetoes and the David in was one of them and they didn't want to have the votes because nobody wanted to go on record\nShowing that their support or or the lack\nOf support for the devotee\n\nOr ... ... ... ... they didn't let Walker um I'm I'm reading some messages years why there's a delay\nWe may have ... they may have a\n... look I'm not going to get into the we did this thing the legislature had the power to block to override the legislature had to block had the power to block taking the David in that period\nThat's it they had the power to do it\nCan blame it on the guy from ... to be the guy from wrangle or this cat and that cat and they didn't have the votes and they ...\nGot to be the guy from wrangle over this cat and that cat and they didn't have the votes and they couldn't do it the money around wherever they want to okay but they had the the bottom line and they had the power to do it that a power to stop it\nWhy is the money and the earnings reserve accounts why is money that was so critical so necessary so dependent upon receiving ... these people receiving his money it was such a big deal it was it was\nCalled the crisis crisis the word was used crisis and it went into the into the earnings reserve accounts\nWhy wasn't that money spent if it was so important that to take away from people\nI'll be right back [noise]\nAnd imaging associates we're proud to be a breast imaging center of excellence bills are encouraging and valley officers who does it mean it means imaging associates has been awarded the American College of radiology gold standard\nAnd accreditation agreed imaging associate has the highest level of imaging quality and safety\nMeans we have some central key radiologists providing services including ... those are sounds minimally invasive breast biopsy in means the newest technology they're only\nTo breast imaging centers of excellence in Anchorage we have the new is located on ... street in the first and only ... imaging center of excellence and the Nazis Ali the American College of radiology says imaging associates provides the highest standard of care and now you know what it means\nThe choices you're imaging associate expert Rudy audri big structural\n[noise] there's always something\nLaughing trick or treat the trail this Halloween on Wednesday\nGood time with trick or treat fiction provided\nEntire movie decorated in Halloween candy activities in the\nTrick or treating and if you get a little chilly you can warm up I'm a bonfire or grab\nThe coffee shop there will even be indoor activities to last year over three thousand people wouldn't be allowed\nPark and you have to do is limited to ensure your family gets him quickly from your lesson motor coaches will provide free shovel service themselves high school student from every Fifteen minutes for food aid ... been ticket prices for seven dollars from nine dollars for a non member debatable adolescence Darkhorse\nTickets will be ten dollars at the gate be sure to arrive for the last century\nWill be seven thirty pm to put on the customs grab your trick or treat bucket enjoying this President Bush at the last\nTime this is Jonathan Martin of Harrington company sellers if you're going to sell your home now may very well be the best time\nTo current interest rates are still very low comparison previous low right now is the time to take advantage of the uncommon phenomenon we'll look back at this period as a golden opportunity to buy or sell homeowners planning to self just call us have to for four zero as to what we will be happy to come out and do a comparative market analysis at your convenience for Jonathan Martin\nHarrington company to four zero eight to one that's two four four zero it to one\nFrom the moment you realized you're\nForever changed all the little moments", "year": "2018", "show_name": "The Sean Hannity Show", "city": "Anchorage", "day": "16"}