{"month": "10", "state": "WA", "station": "KWSU", "content": "[noise] both them out [noise] the rallying cry from the march for our lives following the Parkland shooting youth registration\nSpiked after the protest and those young voters mean business in a new poll by a deep breath the center for information and research on civic learning and engagement thirty four percent of Eighteen to twenty four year old said they are extremely likely to vote in the midterms\nSome of that energy is a response to the political environment but there's also money behind it mostly from the left\nOur program is over thirty million dollars in a good chunk of that is being spent on field organizing on the ground face to face conversations with young people\nBen Wessel is with progressive group next Gen America he says his outrage budget this year is more than double what it was in twenty fourteen outreach aimed at people like the friends of Twenty one year olds\nI just don't think they are that engaged in a political sphere obviously a lot of my grinding pretty hard right now I jobs out of school\nEven sound next Gen than it already signed up more than two hundred and thirty thousand young voters across the political spectrum Mike do came as a Republican strategist with the public affairs from mercury\nBut I think you're seeing a new registrations for both parties at a higher clip that I've seen in the mid term in a long time\nHe said the GOP hopes to pulling younger voters along with everyone else but some campaigns are also focusing on places like college campus than high schools\nThere's no one size fits all but you do see a whether it's activities are local events are fares mailings to voters who just turned Eighteen\nNext Gen Z Wessel said the increased attention and funding is a recognition that the old strategy wasn't working\nDuring what our job needs to be to register motivate and turnout younger people rather than changed the same people who lives in like six counties in central Ohio\nBut registration is one thing election day and another and the real test will come when it's time to show up and vote in Washington I'm Kimberly Adams for marketplace [noise]\nThis is going to sound a little cynical and I suppose in a way it is but that doesn't make it not true kids and I'm Talking really young kids or or a market there a market that can be catered to the content can be created for and from which profit can be made\nThe corporate example at hand is YouTube and its influence on the youngest of consumers Alexis Madrigal is a staff writer for the Atlantic his most recent piece is called raised by YouTube book on the program thanks for having show talked about how you came to work on this story I\nI have a two year old and a five year old ... being toddler YouTube and I was like what are\nAll of these things are taught each branch I've never heard of these companies all over the world and I watch my daughter becoming totally absorbed in the kind of animation that to me it's kind of pre Pixar if you know what I mean\nTalk okay there are lots to unpack in air because the idea first of all of a toddler you\nSickly for you know when you're old ... year old a three year old this and that's what I call toddler YouTube and it's this kind of\nLike wild place well [laughter] I I almost don't even know what to say uh the premise here is that is that really young kids in this economy have tablets and phones and they're on them off almost as much as adults that kind of seems\nThat YouTube is by far the most popular brand among children and even little children have\nTheir own favorite for one of the biggest brands within the space is called to chew TV you know they have Nineteen billion views they have twenty nine million subscribers global children's entertainment ... kids love it they can't get enough they watch them over and over and over and over\nAll right so maybe I'm being naive here but I'm a you know back when the the analogy you make in this piece is to PBS in public broadcasting in Sesame Street in children's television workshop from like fifty years ago now in in the American economy\nAnd the ostensible reason for all of that was to educate not necessarily one or two year olds but you know slightly older toddlers and and give them a leg up is that\nThe mission of of toddler YouTube an end to chew TV is that what they're doing\nYou know I think right now they're in a transitional place they've banned entertainment they've been just trying to capture as much children's attention as they possibly can and now they realized that they've done that\nAnd they need to deliver them something better and so what I'm hoping is that this global phenomenon of all these video producers on YouTube will have a similar revelation and do similar work to create YouTube it's good for kids rather than just something that affects up their time\nWell so spit ball at for me do you think that's going to work because you know not to make the American analogy on everything here but there were researchers and educators and and government regulators in some sense talking to the folks who are doing children's television workshop is there a sense that there's that infrastructure beneath what toddler YouTube is doing\nNot really on the other hand they can benefit from you know fifty years of research on children's television but the media environment the media business is obviously much different\nAnd the biggest difference is there's just YouTube basically physicians where kids are going this is where the whole businesses and say YouTube itself would have to be the one that sort of maybe tip the scales for educational content within the algorithms that determine what people watch\nWhat do we know what do we think uh it's actually doing as a kid setting aside from it or whatever educational benefit that might have\nYou know that the worst possible impact is that essentially that kind of attention grabbing fast paced content and the ability to switch between those things very quickly\nMaybe sending kids up to back to kind of pacing that's actually not educational and that's kind of the big worry that we've sort of induce kind of attention a loss and kids\nAlexis Madrigal who writes for the Atlantic his most recent piece is called raised by you and your sexual aren't really pushing guy [noise]\n\n\n\n\nComing up a huge part of the music industry is the other side of the industry not just a recording music side but to live side nothing beats live shows and the money they make but first let's do the numbers\nIn a while since we've had the wall was all downhill throws up eight hundred and thirty one\nPoints on this Wednesday that's three and a jet present twenty five thousand just five Ninety eight that down three hundred and Fifteen points four percent they're Seventy five sixty four\nOr five hundred film Ninety four points three ... to ... percent ended the twenty seven eighty five I must say this one more time markets go down to the ... more than sixty percent to death reports troubled department stores into hired an advisory for 'em to prepare a bankruptcy filing more on that one coming up Macy's one down each other's at\nJC penny approved about six and a half percent insurance dog suffers hurricane Michael made landfall in Florida all stay\nDown three and a half percent travelers of two and a half percent to ... we get back more point nine percent you're listening to morning\nMarketplaces supported by legal zoom dot com offering a network of independent attorneys in tax professionals who can help provide advice for getting through the daily grind of owning a business morning legal to dot com slash marketplace\nCan't buy fresh works customer engagement software design to streamline processes and deals with the end user in mind Lawrence fresh works dot com\nAnd by vantage partners a consulting in training term helping companies to achieve alignment by generating insights and strategies that Dr collaboration innovation transformation advantage partners dot com [noise]\n\nBringing romantic favorites from felt risky across the ... and ... to the stage Saturday October twenty if at home in high school the twenty first of course in high school ticket information at W. way bash id symphony dot org I'm a nest fresh air\nI Believe this nation just committed so when she was of landing a man on the\nWe talked to Damien chains out who directed the new movies first men about Neil Armstrong the first man to walk on the moon Janelle author wrote and directed la la land join us\nFresh air is coming up at seven with one name right after that date on the NPR News service of northwest public broadcasting [noise]\nIt comes to you from reporters who are knowledgeable inexperienced and it comes to you from the listeners who donate to northwest public broadcasting and joined them it's easy to do become a contributing member right now at N. W. P. B. dot org again an W. P. B. dot\nOrg and donating takes just a few minutes you can give it in W. B. B. dot org is Don set or call eight hundred eight four to eight nine nine one you'll provide some contact information and decide how much you want to give the your pledge variety of ways checks credit cards monthly payments\nYou could ask the phone crew when you call that eight hundred eight four to eight nine nine one\nWhen you're looking for information to understand important issues if you want sources that are reliable consistent than trustworthy\nThat's why you listen to northwest public broadcasting its listener supported the gives you this is central coverage joined other should give five or ten dollars a month to keep these programs on the air Amy amount will work seriously whatever you choose it is your choice but donated the key at N. W. P. B. dot org\nI'm thinking is pretty good bet that you'll wake up tomorrow and spend an hour or two listening to an W. P. be a good way to keep it on the air is by signing up as a sustaining member through your checking account credit or debit\nGoing support for the programs you enjoy donate now at eight hundred eight four to eight nine nine one\nThat's eight hundred eight four to eight nine nine one\nThank you uh to uh someone from a non anonymous in Richland bath in post falls and listen at a John oh we're going to say agenda that isn't Olympia she says every minute of northwest public broadcasting is just outstanding everyone is some every minute\nEven while I'm Talking so but uh maybe when you call eight hundred eight four to eight nine nine one state a lot of the Suzanne or Marilyn or Kelly Nancy Lindsey those are all her phone volunteers today but you're just support is crucial at eight hundred eight four to eight nine nine one\nAnd if you just do unto you and your joining us from marketplace armed the falls on driving more news is ahead but we're spending a few minutes asking for financial support for the programs you value on northwest public broadcasting\nRight now how 'bout three of those pledges each from show land lacy and lake would it would mean a lot and it does so much Langley and Leavenworth have you called in lately or you can do it now at N. W. P. B. dot org\nYou know what I was just thinking you know with uh what's great is we don't have to say the W. W. say we're back at a time used to say W. W. W. dot and leave the beat out or don't have to do that anymore you just go to an W. P. B. dot org Google that it'll get it right there but you know think for a second I think about why you listened to northwest public broadcasting\nYou listen because maybe it aligns with your principles and values of what you think news should be and you trust that it will deliver the news with perspectives context and information you can't get anywhere else\nAlso in a line with your values as financially supporting the institutions you believe in\nListeners support is one of the ideals of public radio because you listen please showing your financial support today right now called just do it takes a couple of minutes to make your pledge at eight hundred eight four to eight nine nine one eight hundred eight four to eighty nine Ninety One if you're already in\nNorthwest public broadcasting member you recognize that you use the service as much as any other and you know you'll hear fair minded news coverage and your support major favorite programs possible oh these are all\nAnd also good reasons to renew your support today especially if it's been about a year since your last gift your donation keeps the news you value on the air\nGive it N. W. P. B. dot org\nLet's see if we can get seven more pledges while we're still talking here before we go back to the marketplace if you are getting ready to make our pledge to date you may want to know how\nYou give makes a difference because the dollars are pulled together to pay for all things considered and marketplace the programs that are important to you Baker former student donation right now say ten dollars a month at N. W. P. B. dot org\nBig thank you out to Henry and crystal ball from the past go an WB be asked at a time when we were fortunate enough to be able to help also fail and Debbie in Walla Walla thank you so much\nThose are some of the members supporting the programs you value as well as supporting short fund drives help them get whatever's right for you and keep super Thursday alive on N. W. ... W. P. B. dot org sure would like to hear from you if you've played should already thank you so much for going to go back to all things considered find out how the market is doing\nCold now eight hundred eight four to eight nine nine one\n[noise] coming up [noise]\nIf you're not one of the very large players you better be offering some niche product\nTrue in life true also in retirement planning but first Joanna let's do\nThree days in a row the while I was I don't know about this down down throws off five forty five today two and a ten percent twenty five thousand two the two ... two point one point two percent Seventy three and twenty nine\nIs the five hundred dollar fifty seven two percent twenty seven twenty eight their banks did belong with bond yields Wells Fargo dropped ... percent\nGroup give back to ... percent bank of America declined three percent day energy stopped stack as oil prices hit a two week low Exxon Mobil down three and four percent malarial gave me and a half percent Chevron down\nAnother three point shots they Delta Airlines shut up three and a half percent after posting from that exceed expectations that company so I didn't ever have higher\nHave your high revenue\nFirst and business class passengers Jet Blue to two and a half percent today bond prices rose get this deal on the tenure treasury notes actually fell today and we won four percent you're listening to morning [noise]\nThis is marketplace I'm ... rebel retirees and others in this economy who get Social Security benefits are going to get a little bit of a bump in January a to point eight percent cost of living adjustment that's about forty bucks a month on average\nThe government make that adjustment every year to help people keep up with inflation there's that word again and the two thousand Nineteen increase is the biggest in seven years marketplaces Renata Sago explains the micro and Mike macro economic impact\nNow David cutting taint gets about six hundred dollars a month and Social Security benefits and he'll tell it to you straight letting in Cleveland\nThankful for the money he gets but a two point eight percent cost of living increase heck any increase well\nSure to keep up with inflation inflation is going up outrageous\nYup food prices are creeping up same with gas and healthcare costs keep climbing to according to economist Andrew bricks\nThe conservative American Enterprise Institute He's we'd enjoy the ride of relatively low inflation but first policy shift then Mother Nature changed that\nOne of the reason for the increase in price who last year was the impact of hurricanes\nFor Cheryl ... who's sixty six and lives in Las Vegas a small benefit in streets every few years is not enough to keep up with her cause she already Lance with a roommate spends about half of her sixteen hundred dollar monthly payment on rent and she expects rent to go up\nSocial Security should have a ... every year\nSeventeen year old Joe and wheat in Orlando, Florida that gets a little over one thousand dollars a month she's been receiving Social Security for six years and says she fled to use the extra money she gets for groceries\nBut um I Know how it's going to come out they're going to face Medicare premiums and we won't get the two point eight\nNews on any Medicare hikes won't be out until later this year I'm Renata Sago for marketplace [noise]\n\n\n\nWe're not always talking about Social Security of the biggest cost of living adjustment American seniors have gotten in years\nAgain thank you inflation but the flipside of that is that roughly one and three people in this economy have less than five thousand dollars set aside for their retirement\nFor that of course it's human nature not wanting to think about the inevitable but part of it has been saving for retirement has historically been expensive with fees and charges and whatnot\nThe good news is that that's changing management fees for some mutual funds have dropped fractions of a percent of the marketplace Justin hold reports eventual retirees have started buying forty two\nYear old Evan list as a software engineer in Ohio he began saving for retirement in his mid twenties but when he started investing he didn't pay close attention to what he was invested in he let us brokered take care of that eventually he did something a lot of us do from time to time he reckons with his mortality\nAs I've gotten older of course that's a retirement staring down on all of us and I pay more attention to it\nHe has his broker for ten years of statements\nLower fees he and his broker went their separate ways\nThere are certainly anxiety because they're going out on your own I trusted advisor for decades literally decades\nListeners part of a wave of investors that have poured money into cheaper fun so over the last decade investment companies like vanguard in Charles Schwab which on the rise in this program have been scrambling to undercut each other yell finance professor James choice and the pressure is getting intense\nThere's the question of whether at some point the market would move to negative fee funds where you get paid in exchange for investing money\nHow can a big investment company charge microscopic fees one reason the funds are pretty easy to run their called index funds which simply mimic the likes of the S. and the five hundred", "year": "2018", "show_name": "Marketplace", "city": "Pullman", "day": "11"}