{"month": "10", "state": "AZ", "station": "KJZK", "content": "\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five K. J. ca Drake Prescott valley Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven kj the cake Kingman Boulder City Nevada\nAnd on translator cake to one seven ... park in Ninety One point three eh than [noise]\n... board for the Arizona community radio network is provided by uptown United drug where you'll find friendly knowledgeable farmers are with more than eight years of combined experience for the board on Health News discount coupons key medication information or to refill your mail order prescription log onto uptown you're not you're drug dot com\nSerbian king ... golden belly\nSupport for the Arizona community radio network is provided\nBy Grand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feeding him right out of your hand the hundreds of animals up close elk buffalo pearls camels co watching Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near Williams\nAnd with the b._b._c. news crown prince Mohammed bin Salman law that's Saudi Arabia who's facing growing pressure to explain the disappearance of the Saudi journalist Jamal ... has been meeting the U.S secretary of state Mike Pompeo in Riyadh\n... held talks with king's called ... mistook her show she has not been seen since entering the Saudi culture in Turkey two weeks ago a correspondent McClellan considers the Saudi position\nAll they going to put forward the lion the\nWitch is being recorded and some us media outlets that ... she was\nKilled by mistake as a result of an interrogation which went wrong this happened inside the Saudi culture that so I think it will be seen as an attempt to others they'll be thought he got much of its responsibility and the turkey and the U.S what you buy into the narrative it looks like they might do\nIt will be seen by critics those governments as an attempt\nTo ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "show_name": "Democracy Now!", "year": "2018", "city": "Kingman", "day": "16"}