{"month": "10", "state": "AZ", "station": "KJZK", "content": "\nMm [noise]\n...\nYou're listening to the Arizona community radio network an eighty nine point five K. J. PA Drake packet valley Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven cage eighty K. came in Boulder stating that\nAnd a translator cake to one Seventy eighty Flagstaff month park at Ninety One point three ... [noise]\nThey use the Ira news editor here's your sixty seconds up to take the regional medical center presented as women's health fair on Saturday October thirteenth from nine to one PM pet care um sees wallet but nothing campus on Santa Rosa drive and came back over forty organizations will participate in this year's event\nOffering screens that information do enhance the health and wellbeing of women in making that area attendees could receive a free flu vaccination schedule of remember grab information will also be available on various health topics including family planning exercise nutrition ... ferocious smoking cessation that physical activity\nThat history and hoping that the public with the rest of his advisors border bay should evaluate to six three thirty eight Seventy three gets the women's health fairs kick the regional medical center Saturday after over thirty from the new center that you're up there [noise]\nSires are nice summer absolutely fantastic quarters orange plane dragon has been grown exclusively for the Prescott area dragons or in natural about gardens with author blooms it's that\nInto bloom I get and spring\nWaters great center in Prescott regarding cyber now passing we tend to play with [noise]\nReally so you are and whether gender Hoosier forecast a working but at the ... county area today partly cloudy chance of showers daytime eyes Seventy four Prescott Prescott about it you know ... they'd have eyes sixty six for Williams ... valley isolated chow responsible daytime five fifty a grill the weather's that are that your forecast\n\nThis is the b._b._c. news hello I'm Jonathan eyes odd ... has told the BBC that show the Saudi journalist Jamal ... has been noted and that their intelligence that is has what they called documentary evidence of this the Saudis denied any involvement McLaughlin reports\nOutsource close to the tech is investigation into Jim ... disappearance says techies official line remains that the Saudi journalist is missing but that uncommon knows for sure that he was killed\nTurkish intelligence he added had documented evidence of the matter which back South American reports that tacky has gathered audio and video of Mr casualties interrogation torture and killing\nEven so tacky has accepted a joint Saudi tax investigation into the case welcoming Saudi officials yeah\nThat's an attempt by and courage to tread carefully and its relationship with Riyadh well tightening the screws on the Saudis with the leak incriminating evidence\nThe U.S treasury secretary says he plans to take part in the Saudi investment conference despite that is the parents\nBut Steven ... added that the decision might be revised is more information came out the disappearance of the time to join this does lead to a number of news organizations such as CNN and the Financial Times to withdraw from the conference on Thursday President Trump said he didn't support sanctions being placed on Saudi Arabia because of the case\nBut prompted has accepted the resignation of an American archbishop he was being accused of mishandling allegations of sexual abuse by Roman Catholic country Martin Bashir report\nCalled new donor rules resignations stems directly from a grand jury report in Pennsylvania published in August which alleged ... more than three hundred priests in six dioceses had abused around a thousand children\nCalled in the world who had to being the bishop of Pittsburgh was accused of not dealing adequately with allegations within his dialysis during the Nineteen eighties and nineties though he was known to accused of a cover up\nThe pipes led to accepting the resignation said that while the cardinal could justify his actions he's no ability and let him not to defend himself\nAn American evangelical pastor has been freed by coal Kentucky despite being convicted of terrorism challenges Andrew Brunson was sentenced to three years in one month in prison but it will be freed us he's already spent two years in custody ... hot has more details\nThe release of Andrew Brunson removes the key obstacle to repairing relations between these two NATO allies [noise] he'd been accused of links to groups turkey sees this terrorist Mr parents and denied the challenges President Trump and made the release of the ... pasta\nMatter of national pride it sets up a clash with Turkey's nationally ... presidents ... type Edwin but he ended up the mall bruised economically Mr Edwin has always claimed the independence of Turkey's judiciary\nThan have odd world news from the BBC\nFor K. A. W. see news in Yuma I'm Kim transcend\nAttorneys for a man working with the humanitarian aid group on the Arizona Mexico border will ask a federal judge next week to dismiss charges against him\nThe attorney said the U.S government is retaliating against the group no more deaths from kj sees these terrorists desk in Tucson but you're all ... report\nScott Warren was charged last year with two felonies accused of smuggling and harboring undocumented immigrants and they know more deaths shelter and not ... the group is shown videos of border patrol agents destroying some of those water jugs and says Warren was targeted after\nA new video was released volunteers Sebastian or that he gets\n... morning in the evening I worry whether\nThe U.S attorney's office declined to comment citing the upcoming trial that trial is leaders for early next year from Tucson I'm a ... school\nAnd was next quarterly household hazardous waste collection day set for tomorrow in the east parking lot of the ... convention center at fourteen forty west desert those dry\nIn a news release the city says leftover household products that are flammable corrosive talk soup or reactive are considered to be household hazardous waste this type of waste require special care\nIn order to have proper disposal\nThe city's waste day provides free opportunity for residents to safely disposed of these products such as motor oil paints antifreeze household cleaners solvent pesticides batteries fertilizer and tires collection hours from eight am until now\nFor K. A. W. see news in Yuma I can transcend [noise]\n\n\n\n\n[noise]\n\nBut I\nI was I\nShow\n\nMy\n\nCash [noise]\n\n\nNa na\nMe the ...\n\nNa\nNa na\nNa na\n\nI guess he's still\nNa na\nAnd it was the infamous string dusters from their undercover volume two that came out last year and their cover up the deaths among kids get lucky\nAnd interesting way to continue our friday makes music you're on the bridge on board or radio before that the ban will greet you did bring me a boat we heard high hopes for Joe plants and we started that set up with that one stone and attract called perfect world\nBecause more music coming up I guess the Tom Waits coming up with the next head and also some trolls Lloyd\nBut I Do want to take a quick second to do a quick shout out ... thank you all the folks that participated in our a fundraising effort last week especially all the great ... D jays from our community who came in to share their playlists and their experiences of listening to border radio\nEspecially when I think Daniel courtship ... stop chalk little Perry junior Chris we there Mike Fox bill moody Stephanie little woods Steven headache and Ellen wreak\nMy wife has a shout out to her and we had a great time with those played listened to I think are just there's had a great time listening to them as well so thanks so much for everybody for taking that extra effort to support his programming here at Puerto Rico\n... general manager at border radio and I think everyone who called during a recent pledge drive if you didn't get a chance to make that call it's not too late you can call eight seven seven eight three eight five to nine to to make your contribution or been to the border radio easy dot org to make your secure I'm like get every dollar every donation makes a difference so thanks for your support\nThank you for listening to border radio on Thirteen twenty I Am in Yuma and border radio ... dot org we've been in service of Arizona western college for more than forty five years\nIn Flagstaff there was a chance of showers today with the highest sixty degrees east north east wind six to ten miles per hour and tomorrow the chance of showers but the highest sixty\nPrescott chance of showers today eyes near sixty seven tomorrow the chance of showers eyes near sixty six in Kingman sunny today with the highest Seventy six and tomorrow\nFor ... chance of showers in the eye of eighty two today tomorrow chance of showers I near a ... to\nWhile for\nThe little ...\nAnd the\nThose ... those so Marilyn\nSo I'm not saying you know a\nJust ... soon\nRent or so ago or\nAnd it's you know some do or do\nYou I\n\nSunni all\nGoing to do was\nA stone in\nThan slips understanding\nWell\nPaid again Sam that's um weights of course we have bad bad labor and a broken heart little snap crackle pop on that when we took her right up to Nineteen Seventy six L. E. small change and you're saying to purchase it's a rental a great way to continue our friday mix of music here on board or radio\nAnd this program we called the bridge before that Rodney crowded sects of gasoline and we started that set off with the Ventura and uh that's they tracked by Charles Lloyd and the more bells and he got some help them just send Williams on that that's a new album called banished garden [noise]\nHey we're going to take a short break and come back we're going to step things up a little bit with the ... so stay with us\nBorder radio is supported by Arizona west during college now offering extended hours as part of their ongoing commitment to putting students first and improving the college experience for our community student facing services on the campus there now open from seven AM to seven pm Monday through Thursday\nLearn more at ease the western dot edu\nWho's just Thirteen twenty am border radio K. U. S. state AM radio waves he died or a service of Arizona western college for more than forty five years\nIt's American roots lie in words and music permitted that she trucks ban Randy Newman gauging fiddler Doug ... shot and the meter tall [noise]\nWill be on the rock and roll rode on stage at the Howlin' Wolf\nAnd the New Orleans jazz and heritage best I'm Nick bits or ... for American roots live\nSaturday morning from hell and I'm bored area Tony am [noise]\n[noise]\n\n\n[laughter]\n\n[laughter]\n\n[noise] [laughter]\n[laughter]\n[laughter]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[laughter]\n[noise] [laughter] [noise]\n\n[laughter]\n\n\n\n... [laughter]\n\n[noise]\n\n\nBring\nThe", "year": "2018", "show_name": "Democracy Now!", "city": "Kingman", "day": "12"}