{"month": "10", "state": "AZ", "station": "KJZK", "content": "You're listening to the Arizona community radio network an eighty nine point five kj ca Drake packet valley Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven kj the came came in Boulder City Nevada\nAnd on translator K. two one seven ... park in Ninety One point three FM I made ...\nAuthor of the kindness rubble or\nOf my favorite quotes of all time goes like be in there too important rules to live by\nThe first is don't sweat the small stuff the second is it's all ...\nMyself often caught up in a signing\nSome point I began to realize that I spent a lot of time worrying about things that never happened\nVast majority of my peers never became reality but I'd wasted precious time worrying about those things\nThat worry where you live there's a lot more fun than stressing out about ... most of the time when we realized that something is bothering us that we can't fix there simply isn't much good that you can come of worrying about it\nWhen we're worried about something that can be fixed\nWe can fix it terminate worrying about that one at all become ... no ... ... check us out of the kindness revolution\nDot net\nSupport for the Arizona community radio network is provided by came in regional medical center\nThat care and see we want to make sure every woman in our community received annual breast cancer screening we provide free or low cost mammograms regardless of income or insurance called the imaging center at six nine to two seven to seven K. R. M. C.\nSupport for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of Williams on interstate forty welcome any deer feeding him right out of your hand see hundreds of animals that elk buffalo girls camels collecting Mindy kangaroo llamas Rainier and more the Grand Canyon deer farm near Williams\n\nOh this is David Austin with the b._b._c. news more unconfirmed and gruesome reports have appeared in the Turkish media about the suspect you kidding ... G the Saudi journalist who disappeared two weeks ago in the study called she lives in Istanbul\nA pro government Turkish newspapers had access to multiple recordings that convey the extent of the torture which it says Mr ... she was subject to\nHas been international outrage over the incident which is also a key Saudi investment conference next week it's website shows most speakers of no withdrawing from the events as a Arab affairs on the list to the best you can also explains\nMany global leaders have already pulled out the latest was the head of the IMF Christians luck God now until yesterday the state still had names of people still have to take his it's now completely blank it's extraordinary that in the ...\nA significant events anything like what happened to ... but that that the truth tends to be was allowed to hop because it's entirely overshadowed this symbol of what's supposed to be the new Saudi Arabia\nCrime is Russian appointed administration says Seventeen people have been killed in an attack on a college in the city of catch investigators say the victims appear to have died of gunshot wounds although\nI haven't made bomb was positive in the cafeteria officials say the attack I was an Eighteen year old student at the college also died President Putin and offered his condolences and promised a full investigation is your your sister to be so ready\nClear that this is a criminal act different accounts of this tragedy and the motives behind it now being carefully studied one slow enforcement buddies has come up with that conclusions the public will be informed\nViolent protests to taking place in the Indian states have Canada as one of Hindu is in his most sacred sites opens its doors to women off through centuries old bad about a single female devotee has been able to make the journey to the Saturday mother shrine so far only men has been able to get through\nAn Indian minister who's been accused of sexual harassment by more than a dozen women has resigned and Jay ... says he was stepping down to contest the allegations orders which he denies defeating a coup to records after almost a week\nWhen he was named in India me too movement on social media Indians junior foreign minister engineer but has stepped down from his post he was going to die by federal wouldn't in general is ... ... when he was the editor in chief often English language newspaper\nThe Haitian age on Monday he denies these allegations and team they were politically motivated\nHe's even find a definition case against one of the female journalists today and a brief statement the former minister has said he's stepping aside to seek justice in ...\nDefeating a coup to woo news from the BBC\nFor K. A. W. see news in Yuma\nI'm can transcend\nThe number of immigrants coming in to the U.S from Central America is up all along the U.S Mexico border including locally a border patrol spokesman tells K. A. W. sees Victor called wrong what's bringing them here to the human area\nHere and desperation that's a border patrol agents that has driven a higher than usual number of migrants from Central American countries to the U.S Mexico border including the human factor the number of border apprehensions of unaccompanied alien children as the border patrol calls them\nAnd family units has doubled in the past year at age it has got hit by they weren't seven thousand nine hundred and sixty three such apprehensions and fiscal year twenty Seventeen and Seventeen thousand four hundred and twenty seven and fiscal year twenty Eighteen\nThey cover my and my last one to last may he call and if I let out\nBut it could be anywhere like economic reasons I'm a big reason that we're seeing that individuals who are coming into our sector and giving up which is what the majority these people are doing they're treating their they're leaving their country to do to the economic factor their country and and the biggest is uh the gang factors\nAre that they have to be claiming a silent for an audience with his\nApprehensions are up in neighboring sectors as well a nine percent in central and forty percent in the Tucson sector for K W the news this is Victor candidate on\nCindy McCain where the will of Senator John McCain has purchased another home in Phoenix, Arizona republic reports public real estate records show Cindy ... McCain family trust\nA to point to a million dollars like last week for all five thousand square foot five bedroom home ... includes five bathrooms marble floors to laundry rooms and a big back yard\nI'm Kevin transcend K. A. W. seeing new [noise]\n\n\n\n[noise]\n[noise]\nTrue\nIn Vegas punch out for a while I was getting others do not know how my\n\n\nKnow no trains no\nI mean no mom\nThat rock and roll with those grave it's our job well Frank way wrong mama I'm outraged\nWho\n\nAre gone along they were\n\nBringing her mom is lower than it was a bar a chain carnivores rarely want and what they were out of college and dream or\nDon't agree on ...\nOr ... or get rid of her mom\n\n\nGoing to be [noise] um I met on the train or Atlanta where am I Want to go we're ... we're literally\n\nYou know your mom and I'm\nTo be able to be\nAble\nTo\nWalk up to new\nLows buffet\nTo know the ...\nMy son\nPray you know they say they know\nWith more genetic\nRandy coming down\nHome I Do all\nTo time alone\nOn by\n\n[noise]\n\n\n[noise]\nYeah [noise] well and you're going to sell the but I'm sure all\nNow I don't\nWell\nWe have a point of view\n[noise] but if\nYou be hanging out oh\nWith that [noise]\nMy\nI got some real\nHanging around all\nYou ought to be [noise] you know oh me all\nThe\nAnd to me manager [noise] do\nWant to make me [noise]\n\n[noise] I'll make it home\nYou don't want to make\nAnd I'll tell you there's already\nHate to bring it to you but it's just\nHow I Am you know what I mean\nBlown up back home\nMy face and I don't know if you\nDown\nI think some of it's gone you're trying to keep out\nThat David Robert where some help from Dr John you don't want to make me mad\nAt somebody two thousand twelve released today Robert ... teamed up with a lot of his favorite artist called use me interested in the bridge on board or radio I'm very glad to be with you hope you having a good Wednesday morning before that it was brownie muggy with rum cola poppa\nWe heard cocoa Montoya before that would just let go and started that set off with the truth will set you free\nOne by Bobby ... and the truth is we love mixing together blues and folk and rock and jazz and everything else on this radio station and we're certainly glad you're along for the ride and enjoying this makes music here on a public radio station with no commercials ever\nWould you have to take a short break but there will be no commercials when we come back we've got a reggae dumb but\nA celebration of some Grateful Dead music for you so stay with us\nToday is border radio day sponsors el senor taco de Tijuana, Mexico offering tacos case it is ... more prepared with fresh ingredients and traditional ... cooking techniques el senor taco fifty eight thirty six east thirty second street Monday through Saturday open for lunch and dinner\nInformation at el senor taco dot com your tunes border radio Thirteen twenty am in Yuma\nAnd border radio easy ... or we also broadcast on the Arizona community radio network\nFlagstaff the chance of showers a high near forty six with east north east wind Seventy nine miles per hour today tomorrow the chance of showers and a high near fifty Prescott chance of showers eyes near fifty eight today tomorrow sunny I near sixty two in Kingman mostly\nToday and tomorrow sunny with a high near Seventy one Yuma sunny today hide near eighty one and sunny tomorrow with a high here eighty five degree Mm\n...\nMusic they blow you know John Lennon them through the cracks me up with me and\nYou may you\nThey bring to bear beer out big bowl of bank to be maybe a little bit extra little study and\nNeeded to go no they're not ... they're still ... bird but maybe they can\nDone to lead the written word we used to drink get both look to the nitty gritty manner\nAnd them your hand may\nMan\nOr you know in Beijing\nThey bring them no beer all things over six bank to make some you know the extra ... na\nNa\nNa na leaders none of them you know and everybody gets a new free of charge they love it if they were born you better\nThan ... million that you got to get to know what you want one but ...\n... ... ... ... I\nJust it's all going to do much stories now into\nA scar on liners in ... park and mumble shop Congress said\nIt's already won man this guy\n\nNa na na\nNa na\nNa\nAnd train and he carried his mind\n\nWonderful cover their of up both Simon's grade class they get the boxer was Mumford and sons with the dog will master Jerry Douglas of Jerry Douglas is twenty twelve released traveler and understand Paul Simon came in and de ... some background vocals on that track as well\nAs you listen to the bridge on board or radio before that it was mark Boudreau ingested dean with Andy man cause when I was a track from the band quicksand before that\nAnd we started that set off of course the beautiful version printed the devil the Grateful Dead classic and that was from roots of creation\nA stick around and they take a short break and then we back I've got a song from an order she called herself soccer moms and she's up next after the break\nBetter radio is supported by eighty eight federal credit unions and not for profit financial institution that's locally owned and operated with five full service branches and you ... ... counties\nFounded in Nineteen forty two eighty eight has been helping members achieved their financial goals every day for over Seventy six years learned more at age ... AFC you dot org\nYou can also you're bored or radio Thirteen twenty am on the radio I facts out download ... or the Google Play store install it it's like to say is your favorite station\nA brochure first produced by the Arizona how we department in Nineteen twenty five Arizona highways evolved into one of the most respected and repair publications in the world doing K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh five thirty seven at St Paul's cultural center\nFor information visit K. A. W. C. dot org ... have been made possible in part by a grant from Arizona humanities", "year": "2018", "show_name": "Democracy Now!", "city": "Kingman", "day": "17"}