{"content": "I was a cruel arriving unseen they're already talking about a traffic great to clear those cars for once for possibly stuff cars here Tim and Tim Northam your long between fifty seven ... cents a crossing just getting rid of a stolen car also just in four or five freeway north men at the winter five freeway interchange\nTo car accidents on the shoulder and when he ... he received a stall in the middle end just clear to the shoulder but traffic still a little bit of extra have either I'm Richard turn is filling radio seven Ninety king ABC\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWonder if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in as little as sixteen months one hundred percent on line\nSex fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nOr anything so uh the squeaking white Ford Motor\nAssuming office newest at most or we can't stop that noise but we can call it all the news ruined finding the right tone the noise ripped from job sites with one size fits all products you don't need and the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price has that so it\nReally sounds like the opposite of this marker\n... eighty they'd most are to talk to someone without noise today\nHigh court is allowing DNA databases to keep samples from non felons and this was the case we talked about last week where juveniles\nUm who had to submit DNA to the database if they were acquitted they did not want their DNA to stay in the database like it shouldn't be permanent record in the database that are going\nUp one per are they going to my DNA um what's right and when you're dealing with ... I guess people fear you know privacy or ... well once your DNA\nIs in the database ... makes it very easy to track you down and do they say because requiring the submission of DNA sample is not punishment follows that retention of example is not punishment either says justice Carol core again in a pair of cases involving use from Contra Costa county she said removing their DNA from the database would not advanced prop\nForty seven goals of reducing the prison population and refocusing police say that again reducing the where he would have said again\nWell that was the argument was ... um that it would not have nothing to do with prop forty seven is basically what the the high court argued so so where\nSo can we can we not keep it in their hand care yeah yeah they are allowing if they had to do for his ... shocking we can track criminals down to people who have a tendency towards their own behavior even if\nThey were only attempt at criminals or alleged\n... a ... fine yeah okay I mean I'm fine with that I had mine you're going to war and it right it's\nStrange in this day and age what people get I'm\nParanoid paranoid about the word but you got to do everything out there on social media but it's like well I don't know if I Want them to have rumors I mean it's just so insane when we come on over\nAnd we find criminals all the time because you post about the crimes you commit [laughter] I mean that's how silly it is for\nDr Jews who start to him because he heard ... I Love that you listen to the quiz mega colon [laughter] ...\nOr heard of that before and you said well first I never missed a quick [laughter] I always looking for for things that allow anything it makes you laugh but you also were yeah ... well and I never heard of medical I was talking to you were talking and talking to your call and then ... year old and just leave talking with\nAnd I'd like to believe if I don't go to the bathroom for quite some time I don't exploded my dad you could actually happen without constipated wearing it already all over the ... calling from inflammatory bowel disease\nBut we're seeing lots more toxic than coal in these days because of the opiate addiction oh no the opiates are going around down there and going up and\nIn fact I think Tom Arnold have this condition remember is that the one who ... his up or how do you walk around does it describing uncomfortable thing ever right ... ah your meal you know you don't know you don't really notice it until it's too late 'til you and the reason you get sick is\nThe colon ruptures a little bit and you now have ... and then you've been around crashing right away you're you're done you're dead\nIf you're a drowning in debt you can't afford\nNot let the credit card companies trick you into thinking that you have to pay it all back\nThe credit card companies don't want you to know\nThat there's actually a way to get debt free\nPaying off your entire debt\nIf you have five thousand dollars or more in credit card debt\nNow have the right to let us settled that that for a fraction of what you will\nFree information coal credit associates now one eight hundred nine five seven nine seven four six will even show you how much money you could save\nIf you can't afford to pay off all your debt\nTo not let the credit card companies tricked you into thinking that you have to\nCall credit associates now for free information on how to get debt free faster than you ever thought possible without debt consolidation or bankruptcy\nDepend on your success it offer a guaranteed\nFree information cold now one eight hundred nine five seven nine seven four six that's one eight hundred nine five seven nine seven four six one eight hundred nine five seven nine seven four six\nToday you wait Greek yogurt you took the train you wondered why people spend so much time reading celebrity blogs you read the celebrity blog you plan to work out\nYou skip did you did all the things that one normally does the day before a devastating earthquake shakes the community to the ground\nYou never know when the day before is the day before prepare for tomorrow at ready Doug ... today brought to you by FEMA and the ad council\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little lists sixteen months one hundred percent on line\nSex fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nYou'll see one or earnings growing up we are and more\nYou know if you've done or um squeaking board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who capture Penn like she's doing a drum solo at a soda arena [noise]\nAnd monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to sell you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your knees and address those needs with the right solutions no more\nNo less just more people getting to know your business with simple personalized solutions for fair price real human being human how's that sound\nWill probably like the opposite of a smoker [laughter]\nCalled eight eight eight months to to talk to someone without Louis today\nWith your Mayo Clinic\nRadio ... minutes and ... Williams in the teen years or so\nSince the human genome was first sequence we learn a lot that includes the role our genes play in cancer\nSome cancers are primarily caused by environmental toxins could be melanoma from UV radiation could be lung cancer from smoking other cancers are kept in check by genes which prevents cancers from forming\nAnd when those genes are broke it and do their hereditary trades Dr Douglas ... says patients are at increased risk for cancer genetic testing can help unravel that risk in the past\nWere primarily being tested for knowing their own risk\nAnd then their children's risk it didn't change their immediate cancer treatment but for both breast and ovarian and now going if you have one of these are the cherry tree you receive a different more effective chemotherapy\nThan if you didn't for more information talk with their health care provider or visit Mayo Clinic dot org\nGovernor Brown has signed a bill legalizing street vending here in California\nOr this bill will decriminalize selling food and other goods on the sidewalks and parks here in California it was proposed back in February and it prohibits criminal penalties for sidewalk vending vendors will also be able to clear pending citations that they currently have and be retroactively relieved a previous conviction strictly for food\nFrom her I don't know that's a really good question have you been to buy a it's for food cart apart\nYou know four year olds don't have any money you know it's like anything else it's a matter of proportion if you if you eat there once in a while there's nothing wrong with that but when it comes to what we eat [noise]\nPeople's diets what we'd like to eat is so personal and there's tremendous push back\nWhen you've got some busy body that's trying to meddle with how and what you why because they just push back and go don't shame me for liking my ... my ... year my ID and your gluten free artesian well water you know baked a granola bars you know knock yourself out just leave me alone\nItaly is of course a love of junk food and I grew up doing that most of my whole life but I think what this also shows with you know your kids eating fast food is there's so many parents that they are both working now no one's\nTime to be cooking actual meals anymore well ... ... and that's a choice people just choose not to do it you there are ways that you can still ... yeah it's and and at home it's I cook at home and I'm busy back entire in the morning [noise] weekdays five to ten\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nSex funded to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nHey ABC has dependable traffic when you need them most just reported in Sun Valley five freeway something around liquor symbol of arts stalled car and watch out here the car pooling is blocked five ... as you make your way from the teen freeway traffic in extra heavy\nFour or five freeway north bound run Wilshire Boulevard to stall up ahead around Mulholland another stall and traffic as a result brutal from the Ninety freeway interchange\nAnd earlier on the four or five freeway southbound right around the one in five an accident clearing Fifteen north on ... street and narco accident just reported rights' side of the road and in Downey lookout six five freeway South Bend before the five a breakdown being tend to there in the left my amateur attorney ... radio seven Ninety K. A. B. C.\nC. on our names of the squeaking white Ford Motor\nAssuming office newest at most or we can't stop that noise but we can call it all the noise road finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price has that so it\nReally sounds like the opposite of the smoker\n... eighty they'd most are to talk to someone without noise today\nI don't want to identify her 'cause I don't know if she wants to be identified but I'm working with somebody in another project\nWhose mom worked with monkeys those little monkeys that they use working runners she was training them to work with people who are paraplegic are quadriplegic so they could perform that task for person opener jar do whatever what you said was [laughter]\nAfter working with monkeys for a while to try and train them for people who are quadriplegic and paraplegic she said monkeys or answers she would drain the monkey to actually do the task and then the person in the wheelchair would blow into a two and a treat would come down and it would be a prize for the monkey which would incentivize them to keep doing it\nWell she found out after a very short time monkeys could figure out the fact that oh the person blows and the two the tree comes up they would not wait to do that sure they go up behind the person slam their head down into the two forcing air out and\nAll the treats would [laughter] not the best use of a monkey and they're ... they're not the philanthropic they don't care about helping people in wheelchairs or people who are quadriplegic they just want the treats and they figured out a way to get the treats [laughter]\nAll right up next we found out who ... will be flying privately to the moon on his\nNew space flight it is Japanese billionaire\nYou ... ... nice he's a Japanese entrepreneur he founded the e commerce company those though and he purchased all of their seats that bore it'd be a BF our vehicle that will launch on a week long track around the moon as early as\nTwenty twenty three\nUm he's an art lover and collector and said he will take six to eight Arctic sweat and the goal of the nation which my vowels called the moon\nTo hash tag deer moon to help spur the creation of great art that will inspire the whole of humanity he said it last night SpaceX headquarters in Hawthorne, California nowhere to live the founder\nWill be going with him I knew I was there a possibility they just that he would join on the trip ... with a laugh\nI find it weird that um [noise] we were to be taking the ultimate sort of expression of science and technology and use it to inspire our though I I don't I get a bit of luck where it just seems weird to me like this I but\nI mean what do you what I was ... they do whatever you want to ask you can ... like a bunch of on the am privileged kids from ... if you want to tell him yeah yeah yeah yeah ... I think it's kinda cool yeah\nI think this is the whole thing I Love about faith act versus NAFTA versus any other government agency it it it carries with it the air of when the\nThat you don't you know it's so unpredictable you don't know who's going to get this ticket you know Iran must get launching his own car out and to stay like a government agency would never do any of it is a giant wasted fat yeah yeah but it's that's why you need private entities to come up with the fun stuff\nTo get the inspiration peace so you're right that they've all the has always had a piece of inspiration and so why not artist why not about artists and whether\nWhen severe illness or injury robs a person at the ability to work and to innovate and Social Security disability benefits can help\nWhen you work and pay Social Security taxes he earned credits toward retirement survivors and disability benefits the number of credit you need to qualify for disability benefits depends on your age maintain from one and a half to ten years of work depending on your age\nIf you have a disability now is the time to apply\nIt to be W. W. dot Social Security ... disability [noise]\nThe following is not an actor but a real life story from trinity debt management\nMy story began with that a lot of debt credit card debt and I heard a commercial for trinity I gave them a call\nIf you're in depth and you need help cold trinity at one eight hundred seven nine for over four three seven\nWhen I first called I was a little embarrassed and kind of a shame and I looked at the number and I saw how quickly that astronomical debt that was in my life would go away\nTrinity will consolidate your accounts into one easy to manage monthly payment reduce your interests and possibly improve your credit score you'll save thousands\nWhat I Would tell other people please pick up the phone and call trinity just let them put together a program and see how affordable and easy it is to pay off your debt\nCalled trinity a one eight hundred seven nine for ... for three seven that's one eight hundred seven nine for oh four three seven\nYou talk talk talk the full moon\nJae ABC [noise]\nThis is one of the businesses how Americans stories where we left bring you stories from every part of this great country north south east was big cities\nLittle town and everything in between today we bring you a story from a place called Midland, Texas which got its name for being midway between two bigger place Fort Worth and they'll Paso in the middle is known for any reason for the tremendous oil and gas resources the our\nOwn nation from one of the leading energy entrepreneur as there is a guy by the name of Tim Duncan who's been married to his wife Terry for over forty years and today brings us the story from his book yellow blooms [noise]\nI mean that's phase having grandkids would have a number Eighteen on the way now\nAnd we had six kids and nine years\nMary Catherine our oldest daughter\nSo Mary Catherine until moved in with us\nAnd they had two daughters greatly when he was so we're at the time\nAnd ... it was about one\nIf you or someone you know boarded the freedom train and are willing to talk to one of our contributors were log onto our American network dot org and choose the contracts tab and the top right hand corner Ben select for general inquiries and send us an email we can't wait for you to get on board\nThis long long long [noise]\nHave you seen you live and local at seven thirty I'm Liz Warner is behind bars for allegedly placing a suspicious looking device underneath a U Haul truck in Pasadena last night\nPasadena police were able to track down to thirty four year old Theodore ban cars at his home in Glendale just before midnight lieutenant Jason coughing says he told them the device it wasn't a bomb but rather something to hold his drugs so\nInvestigators searched his residence and they found a container that had methamphetamine and some syringes inside\nThe surrounding area was evacuated and shut down while the bomb squad and a robot work to render the device safe ban cars who had to warrants out for his arrest was taken in on drug charges James Rojas NBC News radio\nThis is us actress Chrissy met just the latest victim in a string of celebrity burglaries across Los Angeles\nTMZ reports that her LA homeless broken into last night while she was in New York appearing on the Tonight Show her sister reportedly went into the house after an alarm went off and found it ransacked it's unclear yet he's met was targeted or if it was a random burglary talk radio seven Ninety\nKABC sports [noise]\nClippers are playing Oklahoma City today the ducks will host the Philadelphia Flyers tonight and the Cleveland Cavaliers may have lost LeBron James to the Lakers but there are now reports that that city will get to host the NBA all star game in twenty twenty two [noise]\nThat sports on seven Ninety KBC traffic weather and more of our American story is the lead heavy next KBC news time seven thirty to\nAnother chip from first five California no matter the music turn up the volume and sing with your baby from the moment they're born the rhythms of the music and the sounds of your voice help your baby's brain grow more at first five California dot com this report sponsored by first five California\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nSex funded to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nABC has dependable traffic when you needed most for the four or five just been a mess especially that the north side for a wound up\nFour or five north of the one in five we mentioned the crash it's still a clearing out of the way and then up ahead and your will share a stall and now we're just getting rid of an accident four or five north bound just before the one on one freeway in Sherman Oaks the carpet in the left lanes blocked with a new crash\nSo that's going to Jim up that are more than four or five to just over the past even more\nSuccess on a freeway north and a rose hills a stall has just been reported one on one free way east mounted Venice Boulevard San Fernando valley an accident there by freeway South Bend during link or shut them in the valley earlier stalled in the middle and I'm Richard turn age talk radio seven Ninety K. A. B. C.\nC. on are running out of the squeaking white Ford Motor\nIt's annoying office noise at most or we can't stop that noise but we can call it all the noise around finding the right talent the noise of reps from job sites with one size fits all products you don't need and the unqualified Ken is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price has that\nReally sounds like the opposite of this marker\n... eighty they'd most are to talk to someone without noise today\nHave you see so Cal weather\nClear skies tonight with Lowes in the mid fifties\nTo mid sixties gonna be sunny and warm and immoral for Halloween with highs around eighty near the coast and the mid ... downtown and in the valley is a red flag warning going into effect for the valley the mountains of LA in Ventura County ... ate tonight expires at six PM tomorrow due to the high firing danger posed hosted by the gusty winds\nAnd the low humidity levels from building Santa Ana condition\nRed flag warning will be in effect for the LA basin from three am until three PM tomorrow\nRight now it's sixty eight and count canyon county country sorry it's sixty seven in Costa Mesa and sixty eight in Santa Fe springs [noise]\nCourse she'll vote on November the sex then count on smart election coverage with John Phillip and Lawrence of honor to break it all down I'm Liz Warner KBC news [noise]\nThis is our American stories and we continue with the story Tim's on the book is yellow balloons and it's about well it's about a loss but it's also about how to live a life [noise]\nAnd when we last left off we were hearing about grief and my goodness what good good advice for anybody who is going through such a thing right now we're real tragic\nLoss in the family and how to deal with it with other people\nBut now we continue with the story of Jim ... family and yellow blooms because when I loved about this book is that it wasn't really about grief it was about how to live a good life\nBut the book is really about is not\nGrief per se it's how to choose a perspective is when something tragic like that happens to you you're forced to choose a perspective you're forced to think well how am I supposed to look at this\nBut really every day all day long we're choosing the perspective most of the time we're not even aware we're doing it [noise] and if we are aware we're not thinking to ourselves well what is the correct perspective what's true and and the book mainly\nIs about the power the manpower the overwhelming power\nTo choose how we look\nThere's only three things we get to choose as\nWe get to choose who we trust\nWhat we do and how we look at things up perspective perspective they choose that's it [noise]\nNow we tend to try to control other people we can influence other people we can't control and we can't my choices but\nWe try to control the weather we get mad at the weather\nWe try to control traffic lights we try to control all kinds of things are sports teams here's my worst one I Try to control basketball officials\nIt's futile let me tell you doesn't work as a word and it makes me happy and I lose I've done it ever since I was a kid I was a bad player I Would think about the refs instead of thinking about the game\nIt's counterproductive okay so really the question is what's what's true about what's going on and what our pastor helped the student is choose a true perspective but really all day long every day we should be thinking to ourselves\nWhat's the true perspective\nIn order to choose a troop perspective\nWe have to decide what do I believe in\nAnd that's going to shape what we choose to do\nAnd if we do that well if we do that well\nThen we will have a great life no matter what circumstances are a great life\nThat will go on forever it it it changes the attorney when we do that well\nIf we don't do that well\nIt's self induced destruction\n\nIn the valley is really the only time he generally your ... [laughter] because the the circumstances make you be away and the valleys when [noise]\nA disappoint\nYour expectations are shattered and I call it a job like it's been [noise]\nAfter the biblical book a joke\nBut the valleys or the times really usually when growth\nIs most accessible\nBecause the circumstances force you to reflect\nAnd to decide I Want to do something different from what I'm used to do [noise]\nBut most of our life is lived on a plane everyday routines and we tend to not value those and not think of him and anything special we tend to think of\nThe valleys as times and we want to avoid the mountaintops like when when things are great when you had some success or achievement that he wanted to have that that's the desirable place in the planes", "show_name": "Sam Nation", "station": "KABC", "day": "31", "state": "CA", "year": "2018", "month": "10", "city": "Los Angeles"}