{"content": "Our veterans who were there for you everyday to ensure our way of life let them know we care joining me as a pro supporter of our veterans [laughter]\nHi this is Joe Montana and on the one hundredth anniversary of veterans say help no vet alone improve the lives of those who have served our country please show your support and give back a little to those who give us so much\nText fat V. E. T. to eight zero eight eight eight to choose your donation about messaging data writes may apply\nIf you have really big gaps incorrect to fill the Home Depot has really big news introducing do luck tight tight phone big gaps insulating foam ceiling with four times the density of conventional ... it'll feel gaps up to three inches in malls in around ... in one path so big gaps are no longer a big problem\nSee love winter dress moisture and pass with rock type type phobic gas exclusively the Home Depot more saving for joining us only store for details [noise]\nYou'll see when our earnings go up we are and more\nYou know if you've done costs um squeaking white board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who taps or Penn like she's doing a drum solo at a soda arena [noise]\nAnd monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to say you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your needs and address those needs with the right solutions no more\nNo less just smart people getting to know your business with simple personalized solutions for a fair price real human being human how's that sound\nWell probably like the opposite of the smoker [laughter]\nCall eight eight eight months to to talk to someone without Louis today\nYou know we passed a measure over a billion dollars to help homeless and it 'cause it's a it's a tough issue it is a really tough if you have so many mentally ill people out on the street you know of I've worked with tradition or transitional housing\nIn LA family housing specifically to help people get off the streets and it's remarkable how you can help some people get off the streets are\nAnd get into a program and then get back on their feet and make a life for themselves because there's a certain percentage of those in the street who just had bad luck illnesses deaths just terrific stuff happen and they need a hand for a short time and then they get back up\nBut so we've a billion dollars and I've been saying you know what I don't think the one hand is talking to the other hand and I've been trying to make calls to see what groups are actually focused with other groups and different silos and figuring out how to spend the money making sure the resources we spent the correct way to yield as much benefit as possible and I was\nConcerned because it appears that there is not a whole lot of coordination there and there's not a whole lot of coordinated effort there because like I said you read one report that says they're empty beds and then you're in another report that the mayor is rushing to build\nTemporary housing 'cause there are no beds and you go how can that be their contradictory okay did he not know that there's beds that are going unused every single night what we find out now is that there's almost a billion dollars in unspent funds\nThat were meant to help treat mentally ill\nAnd that was passed in two thousand and four so after nearly Fifteen Years prop sixty three the mental health services are\nBooming is with dollars were steered the counties across the state\nBut massive sums are unspent when we need the money to be spent I mean they could have done something all along\nExcept the way the rules were written how this money can be spent and how it can be processed and then you know some colleges are nervous because when times are good the money's occurring but they're holding some back for for bed time so it's almost like money is out there but these groups have no idea\nWe're ... and her husband is not like it is that\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in as little as sixteen months one hundred percent on line\nSex funders to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nHow old is your water heater if it's been around for more than ten years it's been around too long the Home Depot was here to help with reducing the number one more year Brendan America\nGet ten percent off of ... water your when you have it in Seoul by the Home Depot local license to short prose\nItaly saying goodbye easy call one eight hundred Home Depot to get started we only available the Home Depot or saving for doing those are the twenty first ... months of the restrictions apply for Washington were sealed to accomplish more universal\nWith your Mayo Clinic radio health minutes I'm Vivian Williams a recent study has found that using andme oh\nGeez those happy sad or angry looking faces is an easy way to attract quality of life for cancer patients during and after treatment he should report\nIt outcomes are important for multiple thing so at the time of diagnosis with cancer there are multiple factors that we know are ... so they'll predict how patient will do that moving forward there are also very helpful to track\nPatients symptoms and how they're tolerating treatment duck or Kerry Thompson the lead author of the study says patients were\nFirst asked to rate their quality of life\nAnd fatigue from zero to attend the very next question was the same question but showing them five possible ... faces and what we found was that the faces track very nicely with the traditional numerical score\nNot only was it affected the doctor Thompson says patients like having the ... as a means of communication for Mayo Clinic radio I'm Vivian Williams\nYou'll see one earnings growing up we are and more\nYou know if you've done or um squeaking on board marker [noise]\nUsually one of the most annoying office noises there is right up there with the woman who ... she's doing a drum solo at a soda arena [noise]\nAnd most or we can stop those types of news but we can quiet all the noise ruined finding the right talent you know the knows we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with ripped from job sites trying to slow you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your knees and address those needs with the right solutions no more\nOr less just more people getting to know your business with simple person Louis ... for fair price real human being human how's that sound\nWill probably like the opposite of this marker\n... eight eight eight months to to talk to someone without Louis today\nCalifornia high court is allowing DNA databases to keep samples from non felons um this was the case we talked about last week where juveniles\nUm who had to submit DNA to the database if they were acquitted they did not want their DNA to stay in the database like it shouldn't be permanent record in the database that are\nGoing up one per are they going to my DNA um\nWhat's right and when you're dealing with ... I guess people fear you know privacy or ... well once your DNA than\nThe database could easily it makes it very easy to track you down and do they say because requiring the submission of DNA sample is not punishment and followed that retention of example is not punishment either says justice Carol core again in a pair of cases involving youth from\nContra Costa county she said removing their DNA from the database would not advanced prop forty seven goals of reducing the prison population and refocusing police\nSay that agenda reducing that we would have said again\nWell that was the argument was um that it would not have nothing to do with prop forty seven is basically what the the high court argued so so where\nSo can we can we not keep it in their hand care yeah yeah they are allowing for his shocking we can track criminals down to people who have a tendency towards their own behavior even if\nThey were only attempted criminals or alleged\n... a ... fine yeah OK I'm fine with that I have mine you're going to war and it's\nStrange in this day and age what people get I'm\nParanoid paranoid about the word yet so everything out there on social media but it's like well I don't know if I Want them to have no worse I mean it's just so insane when we come on\nAnd we find criminals all the time because you post about the crimes you commit [laughter] I mean that's how silly it as you want\n[noise] [noise]\nThe Los Angeles on\nJune ... [noise]\nHave you seen use live and local it's seven I'm Liz Warner authorities are still investigating a deadly officer involved shooting in Hollywood that took place inside a gym locker room this morning ... Rojas has that story\nTwo officers responded to the twenty four hour fitness on sunset inkling of boulevards around eight o'clock in the morning after an LAPD spokeswoman says a man got physical with an employee\nReally sounds like the opposite of the smoker [noise]\n... eighty they must have talked to someone without noise today\nI don't want to identify her 'cause I don't know if she wants to be identified but I'm working with somebody in another project whose mom worked with monkeys those little monkeys that they use working ... she was training them to work with people who are paraplegic are quadriplegic so they could perform the task for person open majority whatever what she said was [laughter]\nAfter working with monkeys for a while to try and train 'em for people who are quadriplegic and paraplegic she said monkeys or answers she would drain the monkey to actually do the task and then the person in the wheelchair would blow into a two and a treat would come down and it would be a prize for the monkey which would incentivize them to keep doing it\nWell she found out after a very short time you could figure out the fact that oh the person blows and the tube\nComes out they would not wait to do that sure\nThey go up behind the person slam their head down into the two forcing air out and all the treats would [laughter] not the best use of a monkey and they're ... they're not the philanthropic they don't care about helping people in wheelchairs or people who are quadriplegic they just want the treats and they figured out a way to get the trees\nThe Westwood One pod cast network eighty three weeks with every dish off to a halt\nPointed out it's too early for Vader bitter assumed it was because of didn't want to have a match them 'cause he was afraid that they couldn't really work the kind of massive hope needs to work that wasn't the case [noise]\nWe just agreed it was too soon period\nMaybe three weeks with every dish offering free from the west would one podcast network\n\nWith your Mayo Clinic radio health minute I'm Vivian William women with breast cancer often\nFaced with difficult decisions not only regarding that treatment mastectomy or lumpectomy but also their future risk what about my other breath\nIncreasingly these days women who are diagnosed with breast cancer from one breath do decide that they wish to have the other ... and it's been a huge area of controversy in the media\nAmong press societies and when the nation wide that's\nDespite evidence that their risk to the other ... is pretty low so it can be a tricky landscape for providers who are counseling when that that's why Dr Judy belly and a team of researchers went back and surveyed more than Thirty Years' worth of patient about their decisions that the second breast removed and whether or not to undergo breast reconstruction\nWhat we found was that people were relatively happy with whatever they decided today\nSo her advice is simple listen to yourself\nAnd make that decision is that the aid\nFor Mayo Clinic radio I did in Williams\nABC has dependable traffic when you need it most near Griffith Park just getting rid of a breakdown five freeway north been around Los villas boulevard rattling block cording to the first call to see each being traveling so ready Jim from the ten freeway\nAlso downtown ten freeway you spend your central avenue an accident there the middle east has been blocked for a time\nAnd that's making for very slow going out of uh the mid city area east side of the ten heading toward the tall buildings there in Carson four or five freeway something Evelyn boulevard an accident in the car full of listening to block their traffic bumper to bumper from main street and it stays slope\nAs you make your way past that the heading toward Long Beach and ... just in five freeway something seventeenth street look out for a crash reported right lane amateur attorney talk radio seven Ninety K. A. B. C.\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nSex funded to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nHow old is your water heater if it's been around for more than ten years it's been around to the Home Depot is here to help with reducing the number one water heater branded America\nGet ten percent off ... water heater when you have it installed by the Home Depot local license to short prose\nIt'll make saying goodbye easy call one eight hundred Home Depot to get started we only available at the Home Depot or saving for doing battle to within the twenty first ... of the restrictions apply for license and we're seeing people accomplished warrior and so\nCeiling are earning so uh the squeaking white Ford Motor\nAssuming office newest ad muster we can't stop that noise but we can call it all the noise around finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of this marker\n... eighty they must have talked to someone without noise today\nI was reading something about Ken stars are in history of proposition eight and a he\nSaid essentially that rights are important but they don't go to structure rights are ultimately defined by the people\n... ... was that the anti gay marriage arrogant emerging and I think he was ... I it's either going to be what he was doing and what was the other but if you this this quote as his and I don't know that I agree with their\nRights are important but they don't go to structure rights are ultimately defined by the people in isn't our constitution based on the idea that rights or something that we have an area about right that they're out there somewhere that we can access the rational thought of that sort of a rancher he ran out of a different one granted by God and whatever\nThat they're not granted by the people I guess we the people were the ones that create the constitution that's maybe you'll have an excellent yeah that was a challenging comment he made\nA new study out the chosen one in five college students are reporting thoughts of suicide that is not that surprising in that it's an extremely stressful titled of life accordingly\nOf course but also between the age of Eighteen and twenty five is when major mental illness emerging symptoms of major mental illness emerge so it's not that\nA surprising but what was a piece of data that came out in this study was a twenty percent reports self injury which is cutting and that sort of thing and that's a very gently right now that's a that's a big number one of the five doing that\nSo that was a information are inching information or the or who's smart kidnappers getting at you and I talked about that a pair of your family wants nothing to do one thing to do with her and I can understand that but the fact that she bought into all his nonsense and an air tanker yeah ours are groomed her served her up to him with something\nAnd she has she'll never owned the bill as a smart felt was the absolutely\nThe most allow at the lowest the most disturbing part\nOf the whole thing [noise]\nKnow like the way the report the news on it than\nThey thought of as funny\nSeven Ninety Ninety K. A. B. C.\n[noise]\n\nWe continue the story of the great Harry Houdini who at this point had found moderate success but hadn't yet become famous\nIs being re human Eighteen Ninety nine when he met manager Martin back in St Paul Minnesota convinced to need to concentrate on his escaping even toured Europe in his show was an immediate success is salary rose to three hundred dollars per week with his newfound\nWealth purchased address and to have been made for Queen Victoria you didn't arrange for Rand reception where he presented his mother and the dress to all of their relatives\nGenius and was the happiest day of his life in Nineteen of war he returned to the United states and bought a house for twenty five thousand dollars in New York City area Houdini had arrived but his popularity was just beginning\nJoshua D jays are successful magician respected Harry Houdini expert joins us from the contemporary Jewish museum in San Francisco\n[noise] All right so let's talk a little bit about being in a metaphorical than who is going to any lenient five foot three he's considered at this time period an outsider Hungarian\nAn immigrant at a time when more immigrants were coming into the country than ever before he's a minority into it\nSo already you out a lot of\nThings that people in that time viewed as stacked against you he was an outsider he wasn't thought of as American and yet somehow he became America First superstar\nAnd he really was that's not really even a debatable state than it was America's first superstar because although there were\nPeople who are famous actor is on the stage and later and silent pictures they were famous for portraying other people other powerful papal\nIt's seven thirty I'm Liz Warner after several shows of\nSolidarity across the country in the wake up the horrific tree of life synagogue shooting America steady has been speaking out about the violence\nBut I realized everything that people who came before me overcame [noise]\nPeople who are\nIn their nineties stuff all the costs only be taken from this is a punch up to speak up about hatred about oh\nThe mayor held a candlelight vigil this evening at city hall\nSeven people were injured in a shooting at ... night club in riverside over the weekend and happened during the party based upon the movie the hurt to people for transport it from the scene five others got made their own way to the hospital now the injuries are considered life threatening\nAnd alleged member of a Southern California based white supremacy group was scheduled in court today Aaron Eason from riverside county was arrested after he surrendered to the FBI yesterday he's the fourth member of the rise above movement accused of travelling to rallies and attacking counterprotesters like\nThose in Huntington Beach and Charlottesville, Virginia [noise] talk radio seven\nNinety K. A. B. C. part\nThe Lakers are playing in Minnesota and buffalo is hosting New England on Monday Night football that's sports on seven Ninety KABC traffic weather and more of our American story it's lovely heavy next KBC news time seven thirty two from our\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nSex funded to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar cheer on line MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nYou on a running so uh the squeaking white Ford Motor\nGoing off his newest at most or we can't stop that noise but we can call it all the noise around and finding the right talent the noise of reps from job sites with one size fits all products you don't need and the unqualified Ken is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price has that's\nReally sounds like the opposite of the smoker\n... eighty they most are to talk to someone without noise today\nHow old is your water heater if it's been around for more than ten years it's been around to the Home Depot is here to help with ... the number one water heater branded America\nGet ten percent off of ... water your when you have it installed by the Home Depot local license to short prose\nIt'll make saying goodbye easy call one eight hundred Home Depot to get started we only available at the Home Depot or saving for doing Belgium the twenty first ... months of the restrictions apply for licensing mercy on people to accomplish warrior insult\nTeacher down in Florida port St Lucie Florida or claims that she was fired for refusing to give a student a partial credit for work that was never handed in Diane tree auto is her name she's been teaching for more than Seventeen years\nAnd she works at the west gate a school which is K. through eighth grade\nAnd this year as an eighth grade social studies teacher and she says that she gave her students two weeks to complete and explores notebook project or some of them didn't turn it in\nNow here's what's ridiculous the school has a nose zero grading policy was written in red and the schools handbook states know zeroes the lowest possible greatest fifty percent so you can literally not do you work and coast with a fifty\nAnd that's what she was expected to do when she didn't do it she gave the kids who did not hand in the assignment\nHas zero yeah because you didn't do anything that is a zero and she was fired and as a ms uh Toronto says if there's nothing to grade how can I give somebody a fifty percent yeah you didn't have to work you did there was a work\nThat's teaching is right you're setting up children to learn so when they get out of school that when they get a job if you don't show up for a job you don't get paid you don't get half your paycheck for not showing up is that correct so why don't show up for a job do I get half my paycheck\nBusiness now this is even worse than the participation trophy a participation trophy at least to participate trail you didn't partake evaluate simply didn't do anything to do your job so it was really here this is you know what this is very much like\nWell I shouldn't say that because now I think like I wasn't here on Monday or Tuesday and I got one hundred percent [noise] yeah but you have to pay [noise] come when the part I think about it though I'm One hundred percent someone pay and I didn't come\nBack entire in the morning [noise] weekdays five to ten I\n... the news report brought to you by a chunk of resorting casino\n[noise]\nIs our American stories and for all we do by the way to go to our American network dot org stories about everything and that last segment we heard about how Houdini was the twenty fifth person to fly in the air ... years after the Wright brothers did\nGo to our American network dot org and listen to the marine corps for the hour talking about the Wright brothers is terrific new book\nThe Wright brothers are not so new but knew if you haven't read it and you can hear the whole story you know American network dot org just typed the Wright brothers in there and you'll hear David McCullough walk us through in all of us through one of the great stories American Life\nAnd now we return continue with the epic tale of the great Harry\nWhere he was suffering greatly over the loss of his mother\nAfter the death of his mother the great Houdini was in the throes of depression the story from year usually goes that after his mother died Houdini attended saying I'm just in the hopes to communicate with her and then he found\nWas fraud you didn't set out to expose broadly mediums and launched a new a new wave of his career as an anti spiritualism crusader into monger stores\nTrouble is it's just not true the notion that his mother's death blood directly to his into spiritualism crusade has grown to become one of the most popular demons and it would be ten years and four Houdini and mashed his first media from\nThe truth genesis of Chinese anti spiritualism crusade is rooted in his friendship with sir Arthur Conan Doyle author and creator of Sherlock Holmes\nAfter World War one spiritualism became extremely popular Arthur Conan Doyle lost his son in the war became a passionate champion of the movement to\nDealing insisted that spiritualism mediums employees trickery no oil became convinced that Houdini himself\nPossessed supernatural powers and here's the voice of sir Arthur Conan Doyle reporting in Nineteen thirty where he describes his view of spiritualism\nMajor ship some experience ...\n... I was ...\nBy experimented with a friend\nDo any comment mine she couldn't communicate and\nIs it possible that I'm just calling\nThe limit body [noise]\nAnd trendy examine them and\nA find a link to the conclusion of your own battles\nWith such communication washing\n... you know the return of\nFood for some reason I did not among them come\nAnd all the roads are screwing\nGiving us our time ...\nMuslim church which I'm\nThen it on my wife and I felt Saddam knowledge troublesome\nWhile on the beach one day sir Arthur informed Houdini that his wife the lady ... oil that developed the power of medium ship herself and were symptom that Houdini deceased mother wish to communicate with them\nPrivate they rush Houdini and warned her husband that lady oil had been covering or with questions about his relationship with his mother just of the day before\nNevertheless Houdini agreed to the second run\n\nDuring the say a Sudanese mother appeared to return through automatic writing process in which the lady Doyle transcribe words from beyond", "show_name": "Sam Nation", "station": "KABC", "day": "30", "city": "Los Angeles", "state": "CA", "month": "10", "year": "2018"}