{"month": "10", "state": "CO", "station": "KRCC", "content": "Future generations please consider the K. R. C. C. legacy find when thinking about your state planning your legacy gift will help Ninety One point five K. R. C. C. provide programming that informs educates entertains ended Rich's southern Colorado for years to come more at K. R. C. C. dot org\nProgramming on Ninety One point five to your cc is supported\nWhat community karate and fitness helping parents feel special under the tree this holiday season with karate uniforms could be wrapped in classes that started in January schedule and more online at nice karate school dot com\nThis was southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs ISI see law hunter tc she a structural M. T. W. CCF them woodland park\n\n\nFrom WB easy Chicago NPR ... this is sound opinion I'm ...\nAnd I'm Jim ... got us with Halloween just around the corner will round up some of our favorite hunting dogs from ... go to the cure we've got a playlist to leave you terrified\nOf footsteps follow behind but to me\nDown or around blush we review the debut album from Greta Van fleet a band do sounds like it's dressing up as Led Zeppelin for Halloween\nThat's all coming up on sound opinions\nSound opinions and supported by goose island beer company breweries have good IP a four star pills dopey farmhouse ale and bourbon county branched out more at ... dot com [noise] we don't need to be the only barely drink we just want to be the bacteria drink [noise] this is found\nOpinions and a bit later in the show we're going to review the much anticipated debut album from Greta Van fleet [noise]\nBut\nFirst it's time for our annual batch of scary songs in honor of Halloween\nManuel batch of scary songs in honor of Halloween [noise]\nBreak caught favorite show of the year this is one of your big holidays I Know many people love it right [noise] and everything goes better with music\nDo several times we have chosen some of our favorites scary songs from throughout rock history to play one of those trick or treaters are ringing a bell or you're having your Halloween party or just generally want to get create doubt in the spirit of the season right\nIs by requests from our listeners Jim I think are most popular show or second most popular maybe behind the end users and Christmas special but people love scary songs and there are a ton of them were going to get to a bunch more today you get to go first or a gym I've got a perfect lead a song for us it's from the band the cure\nFrom the u._k. debut album from Nineteen Seventy nine three imaginary boys and it is a song that I think typically buys this whole notion of the theater of imagination you talk about this a lot of movies where\nA guy like Alfred Hitchcock was terrific building suspense and building anticipation\nYou wouldn't show you what is happening but what might happen and planting the seeds of doubt in the viewer's mind about what is about to happen to these characters and I think this cure song subway song does that perfectly\nBasically only eight lines averse I great I'm In his baseline in this song these little terse finger snaps about midway through and then a surprise ending I'm not going to give away completely but just be a notice that something terrible is going to happen\nTo this person that is depicted coming home late at night on a subway train we've all been there we've all heard the footsteps in the back of us wondering is that somebody following me am I the only person in here or am I being stalked by someone\nSo the anticipation is is really nicely played out in the song it is a horrific Halloween song the cures subway song on sound opinions [noise]\nAnd\n[noise]\nAnd\n[noise] and\n[noise]\nAnd [noise] midnight and ...\nOn her way home she tries to room\n[noise] midnight and\n... on the way home she tries not to run for who she is not alone\nIn a coup so footsteps photo goes behind Bush and\nI'm Around [noise]\n[noise] Mm [noise] Mm [noise]\nMm [noise]\n\n[noise]\n\n\n[noise]\nWell I suppose you're part of my seat when I hear that part of the song it'll be played in the background and I'm just like I'll jump out of my chair when I hear it is scary but I tell you what scarier as Robert Smith all the whole outfit\nThe make up the whole thing yeah this is kind of like the pre make up Robert Smith but his head was definitely in a dark place when he wrote subway song that's the cure from Nineteen Seventy nine\nAll right Jim what have you got for a great Halloween song well Greg your\nScary rock songs is seemingly a boundless but you know we've done the show a bunch of times and I wanted to not be so obvious that I wanted to kind of take some left turns today so I turned to some of our listeners for some inspiration some I chose myself some came in by email people were look on it's all about the show they just were given a great suggestions\nKevin in ... park out here in Illinois he said one of my favorite songs spooky or not is ghost town by the specials from the ghoulish mountains to the high pitch whales\nFrom the scary image painted of empty streets and closed down clubs to the singles cover art work of skeletons playing the piano he loves the creepy vibe of this song he does know in in a joking better that even scarier was that no doubt once covered it well we're going to the\nPlaying the piano he loves the creepy by about this song he does know in in a joking better than even scarier was that no doubt once covered it but we're going to the original version by the special one ghost town came out in Nineteen eighty one it was talking about\nShuttered streets unemployment urban unrest on the streets of London it was a heavy time and there were riots that erupted just as this song was coming out and making to the top of the chart\nAnd I think that's the scary thing about this song a city losing it so a city in an uproar here it is by the special ghost town on sound [noise]\n\n\nAll go a little\nBit and it\nLaws [noise]\n\n\n\nTown by the specials on sound opinions one of our scary eggs for this Halloween which got your next what do you got to chill is good when Jim one of the scariest aspect of this song is the fact that the singer Scott Walker once used to be in a group called the Walker brother scene\nChill a good one gym one of the scariest aspects of this song is the fact that the singer Scott Walker once used to be in a group called the Walker brother seeing music was completely unlike when I'm about to play\nThe Walker brothers had a huge hit in the sixties called the sun ain't going to shine anymore you can you do but and find out what that is all about and played that song and then play this next one is about to lay on you in the Gulf that's the same guy\nNPR on Ninety One point five to your cc is supported locally by the Colorado health foundation proud supporter of Ninety One point five K. R. C. C. and southern Colorado more about the Colorado health foundation and their mission to improve the health of Coloradans throughout the state is that Colorado health dot or\nBy the Colorado Springs school hosting a pre K. through twelfth grade open house in school showcase\nFeaturing the arts sciences and family entertainment Saturday November temp one to four pm more at C. S. S. dot org [noise]\n\n\nWelcome back to opinions on bread with Jimmy regardless and this is our annual Halloween special we've been hearing from some of our listeners about some of their scariest songs of all time and Gemini or going back and forth with some of our selection and right now it's Jim stern\nI'm going to throw another one to another dedicated listener who wrote in with a killer suggestion one was so good maybe go instantly Dole how come I never thought of it before\nShelby Peterson from Chicago said hard choice but I have to go with pirate Jenny by Nina Simone her voice has a haunting cash to it and when she gets out near the end that alert and yet it sends shivers down my spine Shelby is absolutely right\nEunice waymen need it smells real name is singing a song by ... Brecht and Curt Vile from three pending opera\nIf I look at it as just a tune that those guys wrote pirate Jenny is about a woman who is perhaps captured by one ship and then the pirates that she was part up are coming to rescue her the black ship on the horizon and they these people who've been mistreating are making her scrub the decks and who knows\nRich that she was part of coming to rescue her the black ship on the horizon and the people who've been mistreated her making her scrub the decks and who knows what else are going to get there the weight Nina Simone plays it now she was a civil rights activists\nShe changes a very few words and does it skillfully it suddenly a southern hotel but she is cleaning and she's being mistreated by the white patrons in a racist society and the black\nShip suddenly becomes something else that's it's going to become justice when societies equalized you're going to get yours and you know the anger in her voice is amazing but it's so subtly underplayed that that's what's\nCreepy about it a powerful tune\nA scary tune pirate Jenny by Nina Simone unsound opinions [noise]\nYou can watch one grab a nice bourbon while you're gone [noise]\nMaybe once you've kept me and it makes you\nFeel well it's probably been towns crummy old hotel\nBut you'll never guess who you talk you\nKnow\nYou ... you know\nThey won it as a scream in the night and you wonder ooh could that have\nBeen [noise] and you see me Ken green in our labs glove in\nWhat she got to grill out ... yeah [noise]\n\nWhen the snow on it smacks\nStan we'll be common\nYou gentleman ... finish\nGetting bad what's wrong with you our\nTeam here you're talking to me it seems some of our relationship but I'm\nNobody's going to sleep you\nNo [noise]\n\nBans green and you see who's\nKicking around [noise]\nAnd you see me\nWhat she got to stand [noise]\n\n[noise]\nThe uh the shooting guns from ... oh [noise]\nPirate Jenny from Nina Simone from Jim to regard as one of his great Halloween songs of all time I loved that choice Gemini ties in a really nicely with what I'm going to play next that sort of macro view of the world a sense of evil in the world ... pay fiasco address that on his song puts you on game from his two thousand seven now and the cool\nIt was a concept album about this title character and the choices he has to make in this world fraught with evil I mean look at it was coming up a really hard time his life when he made his album his father and a good friend had just died his longtime manager just gone to prison so he's investigating this topic of\nYou know temptation evil sinister forces at work in the world\nBut the narrator in this song is a really creepy character the guy who runs this place and we're talking about from the White House to crack house and you had those those violins kind of escalating in the background the crack of gunshots you've got this ominous chant let me put you on game\nThe game as this hustle but you know the pimp game the con game the gangster game\nAnd the song just keeps escalating intensity until the very end when ... almost revealed his identity or the identity of the narrator in that song\nHe doesn't really tell you who it is because it's on cuts off just in time but you can guess I mean this is sympathy for the devil this the Rolling Stone said you know everywhere there's some mayhem happening on the guy at the heart of it all coup a fiasco put you on gang unsound opinion [noise]\nSome you know this place and not become this month\nLet's go put you on gang unfounded but\nDon't you know that are running this place and I'm becoming this race must army runs is based on the reason it's become this way instead of love spoke with is the reason I have become this racial thing\n... them all in the in the reserves and they have become on Mars is up in the ... the point where the numbers dot in the heart of ... similar to search on the audience and given the mole lump in this one from listening to the heart\nOf this that you wrote ... from what steps I'm the one that the low end of the one that they lost when\nMarket and the whole of the nation and crack houses and the bottom\nAnd do what amazed though the cleaning is the pages and pages then the chamber extreme\nWith ... with chicken wings you all the famous or the ... when the oldest most ancient is missing speak every single language on the plane it down\nThe American dream looking\nAnd dying and machine in the ... the murder regime the tough guy and the one percent of your\nAnd I ended up in London this that the gas and electricity climate to Jim and math and history the gunshot wound the class and drinking pageant human she\nInvented and then I told them again for the head you know things have become I'm Glad you're dead he's going to be helping them all comes back up these which among the mom Liz Hi you're much ...\nValue in the trash can heal middle of the year when you fry in his lap\nI'm sure somebody find you've had in his bag ground hospital little baby ... maybe one of the welfare receive in prices are going to ... you can watch TV you had a problem with the ... the British are filled with like the ... next to this I Am just said the\nHunt for the rebels ... veterans didn't mislead the number one to prevent it from a grownup blown up and do\nThese fools or more fuel so why make them who\nIn the water out of Scott makes like thinking I'm from the table with all the rules if you tell them that you played my game you're pulling in all the mouse to see my name is on the\nOther fine Halloween choice put you on game by loop a fiasco nice one Greg I ever got nobody to blame\nAnother fine Halloween choice put you on game by loop a fiasco nice when Greg I\nAm ever got nobody to blame except myself for this one and you make Scott initially at this choice but I'm going with tendency sees I'm not in love watch creepy about it for one thing the production\nKevin godly and allow cream the driving forces in this early seventies English rock band are now much better known as an award winning video production team back\nThen they were just as inventive in the recording studio this initially started out as a falling out of love song with a bossa nova beat nothing too extraordinary they decided to take out the drums and to build\nA wall of rhythm from voices the four members of the ban each saying one ... and then over and over and over dumped it until they were two hundred and fifty six voices singing the same note which gives this kind of robbing sensation it seems\nThe ... ... ... ... ... ... ...\n...\nWhy\n... ...\n... ... ... ... to\nThe radio shows and uh the talk shows ...\nSusan draw ... ... ... ...\nFor the ... the vibe\n\nA state trooper from Bruce Springsteen unsound opinions one of my\n[noise] both\nAt a state trooper from Bruce Springsteen unsound opinions one of my scariest Halloween songs of all time I actually am scared by all of Bruce Springsteen laughed out but what are you got for your last choice Jim I Want to go with\nPeter Gabriel Greg it it may seem like an obvious choice but there's good reason you know Gabriel I think is one of the best people in the history of rock to him body foreign characters and really bring them to you in song the third album the one that really established him as a post genesis solo artist\nIncludes the tune intruder it's about a burglar I don't think he's just a burglar who enjoys breaking into people's houses the recurring line is I like\nYou know I like to feel the suspense when I'm certain you know and they're like you lying awake your bated breath charging near this guy's doing it for kicks and who knows how far he's going not just stealing the silverware\nWe think of Peter now as warm and fuzzy world be champion this was back when he was playing darker characters on the third also interesting this song was built around a little repetitive phrased that his friend\nAnd replacement in genesis Phil Collins played on the drums and the entire thing really relies on this time to be much of what Gabriel would\nDo for the next Fifteen Years came from this chance discovery in the studio and much of what Bill counts would you would just sort of came from the big eight it Tom tom sound with lots of reverb I also love the way [noise] somebody's guitar just a little guitar comes in twice and mimics the sound of a window breaking at one point what an unsettling to\nBe intruder by Peter Gabriel unsound opinions [noise]\n[noise]\n\n\n[noise] for them\nIn a way that the intruder by Peter Gabriel wrapping up our creepy saw picks for this year if you've got a creepy song to share give us a call at eight eight eight eight five nine Eighteen hundred\nComing up we review the debut from classic rock torch bearers Greta Van fleet that's intimate unsound opinions from WB easy Chicago NPR is [noise]\nThis is the case for the lord Cohen charitable trust\nMy good friend Dr lord Cohen asked me to help finish some task for her\nLawyers gift to the care cc legacy fun helps perpetuate knowledge and understanding of the world she so cherished\nShe would encourage others to join her in this effort to help make the community she loved and lived in a better place\nInformation on the ... legacy fund can be found at our website K. R. C. C. dot award gee\nNinety One point five K. R. C. C. is dedicated to covering a changing southern Colorado your membership dollars directly fund our local reporting thank you for your support\nProgramming on Ninety One point five K. R. C. C. is supported by\nFind our local reporting thank you for your support\nProgramming on Ninety One point five K. R. C. C. is supported by a e G presenting an acoustic evening with Lyle Lovett and John Hi it that'd be ... eleventh the pikes peak center more information is available at access dot com that's a ... S. dot com\nWelcome back down and ends on him here got us my partner is Greg ... and that is a song called when the curtain falls the first single break\nFrom the much anticipated debut album Greta Van fleet and some of the peaceful army I think the best place to start with introducing was group they've been the runaway smash of many a summer festival cook all over the last couple of years\nThey formed in the early two thousand times we're talking about three brothers Sam Josh and Jake ...\nAnd another guy come together as a late teens or in the town of Franken mood Michigan which needs to be explained for anyone outside of the mid west\nThis is a a fake but very in Christmas village a North West of Detroit and Greta Van fleet grows up enormously enamored of classic rock radio\nAnd begins to to ah imitate those sounds I think they would admit they were imitators early on all of a series of eat peas\nIndependent recordings they release themselves they begin to get the attention of of a music supervisors a there's a Detroit car ad that use one of their songs they had another that got a lot of attention in shameless the TV series\nA and now comes there much anticipated full late the debut on the trail of all of these successful festival appearances this is a concept album Mr cash gym or the themes arch hate greed and evil as the world's self destruct\nIn this period of global warming\nAnthem of the peaceful army I suppose are the marching songs\nFor a for these times let's hear a song from this album and we'll come back and we'll give\nOur reviews fishes renovating sleep with them\nFor a for these times let's hear a song from this album and we'll come back and we'll give our reviews\nFishes Greta Van fleet with a mountain of the sun is out there and\n\n", "year": "2018", "show_name": "Sound Opinions", "city": "Colorado Springs", "day": "28"}