{"month": "10", "state": "MI", "station": "WWJ", "content": "The right length or blocked due to an accident in this spot from the idol download her group twenty four hour traffic center I'm Tracy McCaskill WWE Jane news radio nine fifty and\nThe accuweather forecast from accuweather meteorologist Dave Samuel for the rest of today's sunshine mixing with clouds chili will see a gusty breeze in hind you're fifty five then for tonight chilling with increasing amounts of cloud that brief shower or two later in the low near forty right now with Detroit metro it's sunny and it's forty seven degrees\nFor news wash never saw that news radio nine fifty to all the\nGood afternoon I'm Jackie page and these are the top stories I had a child in Florida has died from complications of the flu will get the details ahead from WWE Jay health reporter Dr Dana lights\nSecretary of state Mike Pompeo presses Saudi officials for information about missing writer your mouth 'cause she'll be a critic of the kingdom the latest ahead from CBS News that's next tonight the mega millions jackpot six hundred and fifty four million\nThe odds of winning the jackpot or one and three hundred and three million\nI'm Beth Fisher and now CBS News coverage the world at one o'clock [noise]\n\nCBS News on the hour sponsored by their works relief on Steve Kaye feeling the pressure on Saudi Arabia increases in the wake of a high profile disappearance should be up to ...\nSecretary of state ... American diplomat is all smiles meeting with the crown prince and also meeting with\nKing saw him on his second goal on this trip is to add to the already pretty incredible pressure that the kingdom is under to come up with them and sincere and to explain what happened to ... and if in fact he was killed why I'm cammie McCormick in watts\nNot clear who will replace him the ambassador prince ... bin ... is the crown princes younger brother and\nPresident Trump mocks Massachusetts Democrat Elizabeth Warren as Pocahontas it's not the first time\nOn Twitter he points to a statement from the Cherokee Nation which blasted warns use of the DNA test saying she is undermining tribal interest with her continued claims of tribal heritage\nAnd CBS is Steven port noise so it was Mr Trump didn't stop there he called Stormy Daniels horse face after one of her to lawsuits against him was tossed out her attorney responded by calling the president a disgusting massage units in central Texas the Leno river is on the rise after ten inches of rain in the [noise]\nThe waterfront on a bridge and people who live near the river are clearing up\nTo do and evacuations in almost rescues that people as ... continues to come up with something to pull people out of houses and that's what our guys are doing right now\n... book with the Austin fire departments in the Florida Panhandle after the hurricane CBS is Omar via Franco tells us our\nSituation is still not great there's roughly about a hundred and twenty five thousand people in Florida who still do not have any power here locally in Mexico beach I talked to the mayor and he told me he does not expect to have power maybe even water for at least to\nLock the fourth largest jak pond in us history will be on the line and the mega millions game tonight six hundred fifty four million dollars we go to the motor city did you\nBuy a mega millions lottery ticket\nWho knows [laughter] what would you know with all those a lot of weddings I'm going to go to someplace warm uh probably divorced my wife to\nWell okay but then I convinced you to buy a lottery ticket give me one it'll make a million dollars a pop that boy Charlie Rangel for CBS News\nDetroit and that's not all three hundred and forty five millions the jackpot for tomorrow's Powerball game Wall Street right now the Dow was four hundred eleven points NASDAQ up\nOne fifty eight ... this is the CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam give their works released today and the pain relief violate your local pharmacy or their works relief dot com\nJewish [noise] wash never saw on Detroit's number one\nOr any of the older you don't even [noise]\nGood afternoon and thanks so much for joining us on this Tuesday is October the sixteenth and I'm Jackie page foreign WWE Jane news radio nine fifty\nBut it's a conscious afternoon not a bad looking Tuesday Afternoon your height fifty five degrees shower late tonight then cold tomorrow with a strong when the complete accuweather forecast is coming up\nAnd right now like Detroit metro airport it is it sunny and fifty degrees that he'd have a detainees time there's not one of three the searches on for the person who opened fire in a Lincoln park neighborhood overnight killing a woman and sending another person to the hospital now that you'd have a DJ Mike Campbell with the story\nShootings happened on Garfield between Washington and Pingree this is south of fourth street and west of the shelves field freeway Elizabeth Moreno lives next door to where the shooting happened how many shots do you think\nOh my God [laughter] navy pain or more yeah different than maybe for five\n... men and women and later the more\nSaid that two people were shot one is at the hospitals their condition on known according to police we have confirmed that in other person was shot and killed\nA female in her late twenties some reports say twenty nine years old we are still investigating what led to the shootings reporting from Lincoln Park Mike Campbell doubling up late\nSome reports say twenty nine years old we are still investigating what led to the shooting reporting from Lincoln Park Mike Campbell ... J news radio nine fifty\nWWE chain you started out what else for multiple investigation stemming from the discovery of eleven infant bodies at it now abandoned funeral home in Detroit officials are trying to learn the identities of the remains that were left in the ceiling of the ... funeral home in the city the sign on friday here in Washington says if he is behind the funeral homes previous operator\nI was wondering if Mr ... was a nice guy he was he was trying to help people who didn't have money so he was trying to hold on one of them you know try to get\nThe funeral home was closed in April after state inspectors came across what was described as deplorable conditions\nW. W. J. news time is now what else five on the auto be deep recalling Eighteen thousand of their wrangler jails from the twenty Eighteen and twenty Nineteen model years\nThe outcry sir identified a well defected could lead to a crash without prior warning at least Nineteen customer complaints have been received over the issue that includes one owner in Florida reported turning the steering to the right but the vehicle kept going straight while traveling on the freeway\nIt's the best way to judge a vehicle take it for a test drive W. W. J. ought to be a reporter Jeff Gilbert is one of the judges for the ... North American truck and utility of the year\nWe're putting the semi finalist for North American car truck and utility of the year through their paces as we drive through these wind the roads washed accounting\nI met a Toyota around four of us are going to check out the jeep wrangler the Lincoln not listen several others in the utility category there are a number of big three vehicles or the truck category\nAnd a lot of cars the winners will be announced in January the ... the north American International auto show on the roads in Washington are counting I'm jumped George W W J rodeo nine to\nWWE Jay news time is now one oh six\n[noise]\nAnd I make a million jackpot is worth a lot of money six hundred and fifty four million dollars WWE day's best Fisher reports it's the fourth largest jackpot ever\nAnd that along with a three hundred and forty five million dollar Powerball jackpot Wednesday night is creating a lot of excitement I asked the lottery commissions Jeff Holyfield our chances of winning the mega millions\nOverall odds of winning in that game on one and twenty four the odds of winning with jak fog or one and three hundred three million ... bit asleep but it's been done in fact we had a mega millions winter\nJust last year but if you don't play it's all ... and it's you know are the key thing is is if you don't have a ticket you don't have a chance to become a multimillionaire\nWill have the winning numbers here on W. W. J. tonight that Fisher W. W. J. news radio nine fifty\n[noise] WWF hate is talking about oh seven the countdown is on and the University of Michigan Michigan State\nWill go head to head on Saturdays otherwise known as the back yard brawls might be an in Studio ... All right well you don't have anything to do that we get more now live in local from from\nWhat it says all love Jackie a lot on course Jackie big Michigan fan of the Michigan say guy yesterday we heard from Jim Harbaugh today I go to mark Antonio took her started the podium he admits they have a big challenge in front of them as Michigan is a very talented team\nWhen you look at them I think if you look at it and be freshly lotta starters back into line backers factors start a tire secondary you know really three out of their top four four guys up front I'm playing very well and the defense side of obviously a lot of pressure\nOh really three of their top four four guys up front I'm playing very well in the deepest so obviously a lot of pressure\nTo ... various various other things are the victims of socially quarterbacks playing well front of the football successfully big play off of ... and a lot of respects so a very well coached football team and of who will be challenged as as always send\nTony also took some time to praise at ... for the way the last three games have been played\nI I tell you one thing about the three games should we've had a little Fifteen sixteen Seventeen not they play with grief sportsmanship on the field\nI really do there's everybody's playing hard as it gets good coach football coach football teams and um you know respect respect with him to\nKick off of the games that for noon yeah of course in here right here I never to BJ starting at nine thirty reporting live Ryan woolly W. W. J. news radio nine fifty [noise]\nIt's near the Michigan Ohio border this has been here for more than a couple of hours avoid the area completely close for now it's time now for the national electrical contractor association construction alert we have here along these phones six Ninety six of them ten the right shoulder they're closed up until\nSix PM work continues along each phone I Ninety six where my two Seventy five to Schaffer also watching here along the responding thirty nine former tended to Ford wrote the right lane and right shoulder close for that we're continuing until three\nIf you've been pulled over and received a ticket and limited can help at a limited you can hire inexperienced a traffic ticket and drunk driving attorney for as low as Ninety nine dollars to buy your ticket they are still confident that they can save you from receiving points\nThat they offer a no point promised some restrictions apply call them at one eighty four four zero ticks that twenty four for the R. O. T. I. X. from Amazon motor group twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty\nAnd that accuweather forecast from the family heating cooling an electrical weather center\nOf sunshine that if you go out there this afternoon Augusta cool breeze or high fifty five until you know tracking a strong code for the will cross the area leader at night on that'll bring a spotty shower and also gusty winds alone you're forty temperatures could stay in the forties all day the moral of strong winds blowing throughout the day might have a couple forays in the air\nGo to Mars like forty five fifty across the region everybody gets a freeze tomorrow night it looks\nThen Thursday sunshine all the hype fifty one friday\nPart at least on a little while there with a high fifty five could be a showers and extra rolls through than over the weekend I Will see a couple of our Saturday but dry and cold or Sunday this was accuweather meteorologist they've Samuel L. W. W. J. news radio night fifty\nAnd right now we're looking at sunshine it is fifty four and Bluefield hills fifty one in Roseville in Detroit metro airport it's sunny and fifty degrees is traveling whether update sponsored by north ... home design center\nThe all new radio job job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nOn news radio nine fifty to oh\nGood afternoon I'm Jackie page and needed at the top stories at one Twenty one and campaign ad forcing Republican Senate candidate John James to apologize James said that he made a mistake for allowing a brief appearance of a swastika and his most recent commercial it appears on a bulletin board and the school hallway at a press conference this afternoon he said\nQuote we should've caught this error and we didn't and there's no excuse for\nMajor flooding along the lotto river in central Texas washing away a bridge in ... Texas reporter Melanie Barton reports of people in the area have been told to evacuate to higher ground\nThere trying to make out what is that is that a boat is that a dog you know we've seen so much debris it just one thing after another after another we've seen some votes get stuck in trees along the shoreline here\nA flash flood warnings in effect and forecasters say it's not expected to drop below major flood stage until tomorrow WW can't use time now one twenty two\nIdea man this is the cost of the CBS News radio network present of us are worst relief Microsoft co founder Paul Allen died Monday at sixty five but he had known since Nineteen eighty two but he was on borrowed time that's when it was worse\nKnown since Nineteen eighty two but he was on borrowed time that's when it was first diagnosed with Hodgkin's and made two crucial decisions to leave like resolved and to turn down Bill Gates offered to buy 'em out for five bucks a share\nThat left him very wealthy and free to focus on his dreams and since his dad round the University of Washington library he grew up with a lot of dreams\nHe knew the names of the mercury astronauts by heart so adult he bankrolled spaceship one for his private vehicle the for the better this Bush\nHe was hooked on Jimi Hendrix to rebuild the museum of pop culture he loved concerts so we bought a ticket master expanded into online tickets you brought it home you grew up with a speck of National Geographic to the basement and love fishing with his dad so he built the ship to explore the oceans\nHe wrote that he never forgot how Britain felt to right the first version of basic for the company he called Microsoft that's but his fortune tried to recreate that feeling whether it made it richer or not\nThe cruise to be a lot of kids are born with Paul Allen's obsessive curiosity imagine if we educated every one of them is if they were going to have twenty billion dollars someday you never know\nRosh on the CBS News radio network\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\nThe all new radio jak combat is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nFor anywhere [noise]\nIf you love puzzle game but our border crossing Kenny lay the hugely popular up again ... ... is ridiculously pot with convicted by that if I start raining\nAgain you can't miss out on south Athens the most collect tons of key characters and play weekly events that's been updates every month so you'll never get bored\nCrushing candy so twenty Fifteen\nNow or if it's at the apple app store or a plane to download that's being for\nOut the fire that theme\nForty heats usually to lead to become a fire fighter\nBut not a rookie cop\nSome it was this morning and some who was long before this goes out of ... tonight to use these old must watch I mean it was it a little later and to a sure fire hit up [noise]\nThan really any other work twice as fast as hard as you all of this house tonight tonight central uneasy\n[noise]\nIt's a twelve K they give away hearing WWE Jane news radio nine fifty this hour is key word is registered text to register R. E. G. I. S. T. E. artist Seventy way they want for your chance to win a thousand dollars messaging data rates apply and remember don't text and drive [noise]\nW. W. J. knew someone twenty five time for business from the suburban Cadillac of Troy business desk and Lisa for anti has our Bloomberg Business for for it I think keeps looking to challenge Amazon Walmart is teeming with advanced auto parts to create an automotive specialty store on Walmart dot com\nThis will add to Walmart automotive offerings of parts and accessories online and in stores the new venture is expected to be rolled out in the first half of next year electric cars may not be the environmental Nirvana some have hoped\nBuyers looking to lower pollution and greenhouse gases need to look beyond emissions on the ...\nAnd Germany and Poland which rely on non renewable power sources such as coal\nSales from its consumer and drug businesses helped Johnson and Johnson top Wall Street forecast for quarterly profits for the first time in at least a decade drugs made up more than half of the company's quarterly sales Jay and Jay is raising its outlook for the year I'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nAnd right now the Dow is up four hundred one points in as that goes up one hundred Seventy this check of your money sponsored by Iran does oh heating and cooling\nIf you love puzzle game but our border crossing Kenny lay the hugely popular ... best beans and this is ridiculous they fought with consistent but that if I start raining\nAgain you can't miss out on felt that the five most collect tons of the characters and play weekly events that's been update every month so you'll never get bored\nCrushing candy it's twenty Fifteen\nNow or visit the apple app store or go to a plane to download that scene for\nOut the fire that theme\nForty you usually too late to become a fight or flight\nBut not a rookie cop\nTo me this morning and some food for the schools should be able to bring her tonight to use the gold watch was sure fire him up [noise]\nAnd ... other work twice as fast as hard as old as hell and central you see\nIt every time you went out you can cash in now is the capital and save your car you are in four percent cash back on dining and entertainment like celebrating every year the crew gets [noise]\nWhen you and your crew or courtside during all the time [noise]\nFor going out now you have four more introducing new saver carts and capital and earn four percent on Ninety four percent on entertainment what's in your wallet terms of our capital one bank usa in a\nFirefighter ... firm firehouse subs introducing new firehouse pub steak so savory steak crispy fried onions in a rich Belgian for your cheese sauce on top for limited time or to yours firehouse ... dot com remember fortunate every self you bug helped by lifesaving equipment versus ...\nSave more lives if I'm only ... which is pretty well because you don't even minimum one million dollars to borrow some public safety from doing what you're saying every person\nThat was news time no one twenty eight to shock Tobar sales event going on now is Sarah Chevrolet in Southfield get shockingly low prices all October long telegraphing six Ninety six they will make a deal let's get to check traffic and whether together on the eight to one twenty eight and here's Tracy McAfee and\nThan any aunts Ross Spears [noise]\nYou know we can't afford to pay their alright students familiar a thirty seven thirty central on ABC [noise]\nW. W. J. new scientists out one thirty eight traffic ad whether together on the eighth and here's Tracy McCaskill\nAnd Jackie this report sponsored by Ben Johnson law we are watching here along north and south on I Seventy five around twelve miles traffic completely stopped reports of power lines being hit\nTry taking the myth and highway or even Campbell is a detour around at the stoppage now also watching through the triple a GM camps that accident us twenty three both directions affected your Stearns wrote in Monroe County near the Michigan Ohio border\nThat's been there for more than a couple of hours also we found six Ninety six of them tend we still have the closure for road worked there until six PM more we're continuing along north on him thirty nine from were tended afford road with the right lane and write shoulders closed until three car crashes aren't about the vehicles involved there about the people\nAnd that's been Johnson is fighting for everyday\nPeople just like you who want justice hold one eighty five five then to fight today because everyone deserves a fighting chance to get their life\nBack on track from the idol download our group twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty and that accuweather forecast for weather meteorologist\nDays Samuel\n... Ohio Valley meanwhile the cold front are crossing into the\nNorthern plains of will be quickly heading south and East that will cross Michigan tonight\nWe'll we'll see a lot of moisture as Ezra comes through but certainly it will back porch with colder temperatures and strong with\nFifty five this afternoon sunshine in a few clouds a bit of a breeze blowing throughout or afternoon then that when the ten used tonight the cold front itself moves through late at night well below around forty could be a shower with a front the Tamara blustery and cold behind the ... the high just forty five\nI just forty five fifty guinea roulette a couple of ... in the air and likely will be looking at heart freeze in many places\nTomorrow night Thursday will be sunny with a high up fifty one that up to fifty five friday looks coolers we kick off the weekends Saturday five fifty to whistle showers this was accuweather meteorologist ape Samuel L. W. W. J. news radio nine fifty\nAnd right now still looking at sunny skies fifty foreign Bloomfield fifty two in West land it's sunny and fifty degrees at Detroit metro airport trapped again whether together sponsored by Trevor no at the Fox theater is dark comedy Central's the Daily Show Trevor Noah back and he's bringing his loud and clear tour twenty Nineteen to the Fox theater on friday April twenty six\nGet tickets friday at ten am at the Fox theater box office ended ticket master\nThe all new radio job job that is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on you and your news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nPresent you with us together on the and breaking news came up to date on the road\nNews where do you just don't\nHave any news time is now one forty two lottery fever already high and building with a mega millions jackpot now worth six hundred sixty seven million dollars Jeff Holyfield is with the Michigan Lottery commission\nOnce these jak start to roll of the way the system works the more tickets players by the bigger the jak arts and the big of a ... give or take its players five so it's exciting for everybody\nYou know your chances are get lower though Holyfield admits at the odds of winning the mega millions are one and three hundred three million buddy says it there are winners and he says you can't win if you don't play [noise] W. W. J. news time is that one forty three researchers giving brewers and beer drinkers more reason to worry about climate change\nA recent study published in the journal nature plants and the global warming could threaten the world's beer supply researchers from UC Irvine and other institutions say the production of barley is likely to drop substantially because of droughts and extreme heat barley is the main ingredient in beer meaning prices could double\nThat CBS News correspondent Diane King hall W. W. J. news time no one forty three\nCBS I owned veterans presented by their works really Moore and hope is a trained chef\nShe graduated from the ... Institute of America worked for Ritz Carlton and even competed on top chef\nShe's also an army wife with her family got stationed in Kentucky there just weren't jobs for a shovel her caliber the\nOnly job I could find a bouncer was decorating cakes in the commissary and if you can imagine that was eating a slice of humble pie\nSo she made a career change watching her own jewelry company hope designed limited and now she's launching a new website shot military dot org that will only offer products from companies like\nHers we would like to introduce America to all these hardworking military spouses at your own business is people are welcome to comment list their military businesses with us for free\nI maybe veterans Eric day from connecting that's dot com for CBS News\nTo experience relief or muscle cramps and your legs and feet used their works relief fast acting foam get their works relief today and the pain relief ... your local pharmacy or their works relief dot com\nOn Wall street the Dow Jones industrial average is up four hundred and fifty point that we do have that big closure I Seventy five in both directions closing your twelve miles that because of a power line we'll check in with\nOn Wall street the Dow Jones industrial average is up four hundred and fifty point that we do have that big closure I Seventy five in both directions closed near twelve miles that because of the power line we'll check in with Tracy coming up [noise]\nW. W. K. news time is now one forty five that means it's time for sports in here is Ryan will and\nJackie Michigan said our coach marked in Joni oh speaking today he admits despite the team's upset whenever Penn State on the road over the weekend it's not going to get any easier this week at home and gets Michigan and says the team that makes the fewest mistakes it's going to win this game\nWhere you can make mistakes so neither side of the ball really you can't give up the easy ones from the coverage of or or a gaffe and then also you know you can't turn the ball over I think is a huge you know traditionally the team this rush for the most shortage is usually one of the game you know that's probably true in most cases\nAntonio also was asked to talk about the rivalry in what became personal to him\nIn any rivalry situation I remember playing her first game and you know what I was just South Carolina pleading Clemson you know and there's a big game down their huge game and everybody talks about it and told you about it you really didn't know what to expect when you play football game for the first time you understood after effect\nI think that's the same thing here are you sort of understand after the fact so after the Ninety five game I understood and um and then I just sort of brought forward\nMichigan states won eight of the last ten here in the series of Michigan's last when was that spartan stadium in twenty sixteen baseball playoffs continuing today American League championship series resuming this time from Houston that series tired of the game of peace Nathan evolved he will get the call gets Dallas Tyco first pitch at five or nine\nGame for the you know see us meanwhile gets underway today from LA the Dodgers looking even that series up a two games apiece geo ... against were chill\nWell the first pitch at nine o nine and the NBA regular season officially opening up tonight for the pistons won't hit the floor until tomorrow that they play hosted the Brooklyn that's done it a little Caesar's arena\nWith sports Fifteen and forty five passed each hour I'm Ryan Wally W W J news radio nine fifty\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on you're listening to news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert probably are a\nStep out of the car please I probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend that's driving drunk driving and that that brought here by nuts and the ad council\nGigi the R B L and deadly it'd be there and if you do you think that these kinds of text they're fine because of their links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five seconds I'm traveling at fifty five miles an hour that's enough time to travel the link to them\nThe all new radio job job that is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere [noise]\n[noise]\nW. W. K. news time there's one forty eight traffic and whether together on the eight cent here's Tracy McCaskill and Jackie\nThis report sponsored by free star financial credit union we're still watching here through the triple a jam scams north and south on I Seventy five around twelve miles complete closure their report the power lines being hit with just stop the traffic their traffic being directed off at fourteen mile road on to south on I Seventy five\nBill W W J news radio nine fifty alright Tracey the accuweather forecast for making whether meteorologist Samuel son mixing with caused this afternoon with a cool breeze and a hundred and fifty five will drop down into the forties with some chance of showers a during the overnight hours right now Detroit metro it is sunny and fifty degrees\nThe news much never diverse sneezes radio nine fifty to only\nGood afternoon I'm Jackie page and nice at the top story the head with a great vitamin secretary of state lifetime pale in Saudi Arabia to meet with king Salman CBS News with a live reporting acts the identification process of infant body sounded a former Detroit funeral home can take much longer than normal when the plane\nAnd downed power lines have completely shut down I Seventy five at twelve mile road now but he doesn't have tracing McCaskill with the latest following CBS News at two o'clock\nDot com\nUse CBS News on the hour sponsored by their works relief I'm Jim shown to be the disappearance\nOf Washington Post contributor ... after a visit to the Saudi consulate in Turkey has become a major subjective international injury Mitt accusations the Saudi crown prince ordered ... murdered Holly Williams reports\n... knew that fatty laid it out for parents to admit to the accidental killing ... has sounding\nDespite previously denied that they had haunting\nOr even with his aware about package investigated what finally allowed to set\nThe fatty confident here and they've done for life not techies president ... said today that they're looking into toxic materials inside the building package ethics you're thinking anonymously had already told channel that they relate to some tea with killed inside the confidence secretary's\nDay by palm pale met with the Saudi king and crown prince today and should both are committed to a full investigation of the disappearance of central Texas dealing with flooded rivers after more than ten and a half inches of rain fell over the past ... going to have fire chief Palmer bug says a bridge on the lotto river is washed away\nDoing evacuations and almost rescues that people as ... continues to come up with something to pull people out of houses and that's what our guys are doing right now we just want to keep encouraging people to stay off the roads if they're in someplace they stay state\nOfficials in Florida's panhandle say they're trying to track down more than a thousand people still unaccounted for since hurricane Michael or the vast majority are expected to be staying with friends or in other situations since entire neighborhoods were wiped out by the storm more on the recovery efforts from correspondent Omar ...\nCell phone companies like ... and are working to improve kind of activity in the area power situation is still not great there's roughly about a hundred and twenty five thousand people in Florida who still do not have any power\nHere locally in Mexico beach I talked to the mayor and he told me he does not expect to have power maybe even water for at least two months\nThe Labor Department says job openings ship the highest on record dating back Eighteen years us employers posted the most jobs in two decades and hiring reached a record high CBS is Jason Brooks\nThe Labor Department reports that employers posted over seven point one million openings in August which is well over the number of unemployed which the government puts it just over six point two million\nThat's the first time since two thousand that there were more openings than unemployed and there were more openings in construction healthcare financial services and government the jobless rate filled a three point seven percent in September a nearly forty nine year low\nOn Wall street right now the Dow is up four hundred and forty two points and ... forty nine ... CBS News\nOn Wall street right now the dollars four hundred and forty\nTwo points and ... yes NPR forty nine ... CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never stops on Detroit's number one\nForty nine fifty to holding on to be a\nGood afternoon and thanks for joining us on Tuesday October the sixteenth\nI'm Greg Bowman for W. W. J. news radio nine fifty broke Allen has the day off sunshine that if you ... have to do all the guys the breeze with a high a fifty five another ... late tonight that's an structures in the forties for tomorrow the complete accuweather forecast\nIs coming up we have sunshine we've warmed up a little bit since the uh thirty two degrees this morning is fifty two right now AT Metro\nTrafficking weather coming up on the age W. W. J. news time two or three\nNow on you buy one of the guard windows\nWere starting things off is our big problem downed power lines that parts of I Seventy five completely shut down this hour WW Jane newsworthy late fifties Tracy McCaskill joining us live in local with details from the twenty four hour traffic setter Tracy\nAnd Greg or keeping an eye on the spot as you said again a complete standstill here along north and south on ice Seventy five around twelve miles reports of these power lines being hit which is traffic stops\nBeing directed off at fourteen mile un I Seventy five thousand for North bound isn't I Seventy five\nYou're being forced off at twelve miles tried taking Stevenson highway all there are typically they're telling us that pretty packed right now\nCampbell or even John are might be a viable alternative to the stoppage we'll let you know when this clears out but uh boy north and south by Seventy five right now around twelve mile reporting live here in the twenty four hour traffic center Tracy McCaskill W. W. J. news radio nine fifty\nDue to eat energy reporting about one thousand power outages in the area they say they're aware of the problem we have cruise and route to that senior high Seventy five and fourteen miles there's always people hurts to stay away from downed power lines with news reading a nine fifty for updates as they become available\nIt's a new up day to a story we've been following a W W J could be some time before the bodies of those eleven infants found in the old ... funeral home on Detroit's east side or identified Wayne County medical examiner's office says the remains are in mummified conditions\nForcing them to rely on records because the body's already made it to a funeral home there should be information available chief medical examiner Dr Carl Schmidt says\nThe entire process could take months meantime\nThat funeral home is now also facing a million dollar lawsuit W. W. J. news radio nine fifty survey Hoover has the story\nA lawsuit was filed by Ayn Vince ... on behalf of Katherina Hauner\nShe claims that she went to ... funeral home to set up services for her husband who passed away the funeral was scheduled for January twenty three days later two weeks after they got a whole of the body can Trump pulled Bonner her husband's body was unfair for an open casket funeral\nShe says they refused to let her see him and convince start to let them cremate her husband after reading reports that can't travel with improperly storing body than non refrigerated areas of the home and are now believe that her husband's remains\nWere not handled correctly and questions what really happened can't tell by the way under investigation after the bodies of ten in ... and one child were found hidden inside\nThe her Hoover W. J. news radio nine fifty\nIn Lincoln Park a deadly shooting investigation W. W. J. news radio nine fifties Mike Campbell has more\nShootings happen sometime between ten and eleven and startled residence on Garfield\nAsian W. W. J. news radio nine fifties Mike Campbell has more\nShootings happen sometime between ten and eleven and startled residents on Garfield between Washington and can read this is off the shelf feels road and Ford strict Margaret lions lives across the street from the shooting death of what we're\nSeeing here we thought we heard gunshots but we thought it was on our TV\nWe say to people were shot one is at the hospitals their condition unknown W. W. J. has learned second person that was shot has died we're told the woman in her late twenties Margaret says the neighborhoods change\nIssues to be the quietest Sheree section in the field right here what's your name ...\nSays new neighbors have moved in and troubles started from Lincoln Park like Campbell ... JDs radio nine fifty\nFarmington Hills residents on high alert after police say man approached the child Monday afternoon happened to the area of liberty and middle belt that's there nine mile road and grand river suspect described as white heavyset wearing a black coat in short hair drove up to the child in a white box utility van\nHe then asked the child if he should call some other if they wanted to get in the van to get warm\nAnd he won with information as to call Farmington Hills police\nA judge giving both sides more time to work out a deal in a dispute involving a charter school and a former Detroit city councilwoman W. W. J. city beat reporter Vicki Thomas is live local with more forests Vicki motion granted\nGreg attorneys for sharing that fail and the conservator for Detroit community schools given two weeks by judge Craig strong to try and work out a deal MacPhail fired for allegedly not being certified but her attorneys say yes she is certified\nMaureen Kramer with Michigan welfare rights among the MacPhail supporters in the courtroom\nSo then I'm not a lot of schools has gone up a gas even cats that can be can stand in things so you know I wanted to really [noise] what is this something out\nAnother supporters Sylvia or Dona said that there is a lot of interest in the ... more community where the school is located and she says a developer could want to turn that school into something else reporting live and local in Detroit and the heat down it's W. W. J. news radio nine if\nW W J news time\nTo await trafficking whether together on the front of the out all the motor group\nTraffic center brought you this hour by Motor City many\nAnd trace you got a big mess here and I Seventy five a ride Greg we are watching this a big mess about the great characterization because\nReturning your room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your child listen Jen I did your boyfriend we play a clip sweetie [noise] never give up until the buckle up\nLearn more safer car dot Gov slash kids buckle up\nMessage from the national Highway Traffic Safety Administration and the ad council\nJay's trafficking whether together the AIDS in ah Tracy what's happening and I Seventy five watching\nQuiet day back up here Greg checking the AAA GM cams in this report is sponsored by north veil lumber home design so north and south I Seventy five around twelve mile remains close they were a downed power lines in the area\nSouth on traffic is being backed up to Rochester road north bound backups rented nine mile if you're heading south bound get off it Rochester mode is a detour and if you're heading north on get off at John are and take that as a detour now with these downed power lines\nWere getting reports of traffic lights out it seems in highway and Thirteen Molly you can certainly expect more traffic lights to be out in and around that area as well and time now for the electrical workers local fifty eight construction alert we are watching here along with John ... from Greenfield\nTo Wayne right shoulder closure there for at least another forty five minutes war continues he found I Ninety six that deck road\nAs well from the idol download our group twenty four hour traffic center Tracy McCaskill W. W. J. news radio nine fifty and\nTraffic and whether together is sponsored by north ... know by home design center and the accuweather forecasts the updates from the family heating and cooling electrical whether centered on a big Samuel\nSunshine that if you go out there this afternoon I guess the cool breeze or high fifty five until you know tracking a strong code for the will cross the area later at night on that'll bring a spotty shower and also gusty winds alone you're forty temperatures could stay in the forties all day to more of a strong with long throughout the day might have a couple of four is in the air\nGet to Mars like forty five fifty across the region everybody gets a freeze tomorrow night\nWendy what a spot that burglar when he was chasing your home or after his head as John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using bling smartphone app so you know when your kids get home from school they'll contracts subscriptions totally affordable and blink works with Alexa\nBlinked cameras systems a buck and stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nWhat is every time you went out you can cash in now with the capital and safer cars are in four percent cash back on dining and entertainment like learning more about each other on your first date you maybe over or just suffering you hit the high notes that your favorite karaoke bar\nNo matter your reason for going out now you have far more introducing new favorite cartoon capital one in four persons on mining and four percent on entertainment what's in your wallet terms applied capital one bank usa in a\nUse to twenty five it's time for the update of your money where we\nLike a fourth is the best sponsored by Huntington Bank and at least ... with our Bloomberg Business for Ford got a big rally today Lisa\nGreg that's for sure we are seeing some of the biggest gains in quite a long time the Dow up four hundred Seventy points again of almost two percent benchmark back above twenty five thousand seven hundred\nThan as that can pause it above Seventy six hundred gaining one hundred eighty eight points\nThat is good for a gain of two and a half percent for the composite as in ... higher by fifty to moving above twenty eight hundred the Bloomberg W. W. J. Detroit indexes also winning the session\nOf one and a half percent we had a mix of all the earnings reports and some positive economic indicators and that's helping to lift investor sentiment industrial production Rosen September for the fourth month in a row\nAnd homebuilders are more optimistic about their business prospects the price of lumber has been slashed down almost fifty percent since may and solid demand is boosting confidence among homebuilders\nWell let's see I feel that Wall Street in Silicon valley can't wait for according to the wall Street Journal Lugar has received proposals that value the ride hailing service it up to one hundred twenty billion dollars in a public offering\nThat's nearly doubled loopers valuation from just two months ago Goldman Sachs Morgan Stanley reportedly delivered their proposals last month\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nABC tonight [noise]\nThe year was Nineteen Seventy two of your brother and I want to know when my parents say we're a family of eight boys it was a time of peace\nRecently have you flown this was my girlfriend how on earth would and it's our eyes are going to an Emmy and Ross Spears [noise]\nWe can't afford to go back outside of ... students from you have thirty seven thirty central on ABC\nFirefighter ... firm firehouse subs introducing new firehouse pub steak so savory steak crispy fried onions in a rich Belgian beers cheese sauce on top court limited time more than yours firehouse ... dot com remember\nIn and around the area also watching now a couple of crashes he thought I met before after living in a way a crash blocking the left shoulder and left lane as well I Know the Upper East on after casualty right leaning shoulder block we are backups to outer dry\nErnie or as low as Ninety nine dollars to buy your ticket they are so confident that they can save you from receiving points that they offer I Know quaint promised some restrictions apply call them at one aid for for the E. R. O. T. I. X. from the idol download a group twenty four hour traffic center and Tracy McCaskill WWE Jane news radio nine fifty\nAnd tried to get another together is sponsored by Trevor Noah at the Fox theater the accuweather forecast now the update and meteorologist ape Samuel high pressure\nSlutty bite or south across the Ohio Valley meanwhile the cold front crossing into the\nNorthern plains of will be quickly heading south and East that will cross Michigan to night we'll see we'll see a lot of moisture is is fraught comes through but certainly a pack of punch with colder temperatures and strong winds\nFifty five this afternoon sunshine in a few clouds a bit of a breeze blowing throughout our afternoon then that when continues tonight the cold front itself moves through late at night well below around forty could be a shower with a front that Tamara blustery and cold behind the front adjuster forty five fifty guinea ... a couple of ... in the air\nAnd likely will be looking at a hard freeze in many places\nTomorrow night Thursday will be sunny with a high up fifty one that up to fifty five friday what looks coolers we kick off the weekends Saturday side fifty two with some showers this is accuweather meteorologist Dave Samuel L. W. W. J. news radio night fifty\nSunshine this hour fifty two degrees at city airports fifty one in Ann Arbor and fifty two at Detroit metro star Comedy Central's the Daily Show Trevor Noah is back he's bringing is loud and clear two or twenty Nineteen to the Fox theater friday April twenty six\nGet tickets friday ten am at the Fox theater box office and ticket master well\nWe are just getting an update on this problem that the Tracy tells you about a minute ago north bound I Seventy five still closed near twelve model road with the south bound lanes have just open to because of the downed power lines will update that the traffic and weather coming up\nThe all new radio dot com at is available now it's a totally new experienced it was listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone now\nOr anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war and the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right subscribing download today on radio dot com and I can [noise]\n[noise] many medicines used to treat colds and flu contained acetaminophen a pain reliever and fever reduce are found in hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen for day can damage your liver\nSo always read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more as if it's the ... Gulf slash OTC pain info a message from the U.S department of health and Human Services food and Drug Administration [noise] on\nWhether to gather on the apes and breaking news came up to date on the road\nWith newsworthy nine fifty W. W.\nW. W. J. news time to forty two growing concern at the Centers for Disease Control in Atlanta mother rare polio like disease sickening\nFor Disease Control in Atlanta by the rear polio like disease sickening primarily children nationwide as doctors see more cases the latest from reporters Sabrina cupid\nFrustrated and concern the Atlanta based CDC says yes and more acute plus my light as as a mystery they're not sure exactly what causes it why it can cause paralysis or why it tends to target children\nI encourage parents for medical care right away if you or your child developed cutting a lot of muscle code in the army or later\nThe CDC's Nancy ... says just in the last few months they received reports of nearly a hundred thirty patients and twenty two states seem pretty cute but for CBS News Atlanta\nW. W. J. new start to forty three time for eye on second I on the tax with Larry Magid technology world and the sports world\nAre mourning the death of Microsoft cofounder Paul Allen\nAllen played a very early role in the personal computer industry back in Nineteen Seventy five when he and Bill Gates created the basic language\nAnd cofounded Microsoft on behalf of Microsoft he later acquired the company that had the software that became the operating system for the IBM personal computer\nWhen it was released in Nineteen eighty one and that led to M. S. dot and ultimately Microsoft Windows he bought the Portland TrailBlazers and the Seattle Seahawks and he was also a freelancer\nVest an entrepreneur Larry Magid CBS\nTo experience relief or muscle cramps ... used their works relief this fast acting film is proven to prevent and relief footed leg cramps give their works relief today and the pain relief violent Walmart CBS Rite Aid and Walgreens pharmacies or their works relief dot com\nThe all new radio jak combat is available now it's a totally new experience that was listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWas going on the market the NASDAQ up one Ninety and the Dow right now is up above four eighty\n... latest numbers from the Bloomberg Business reforms in ten minutes W. W. J. news time is to forty five for sports rivalry we've got a baseball double header tonight\nTo games on and of course the national league and the American league trying to find out who's going to represent each moving forward in the world series it's going to start though with the American league championship series this afternoon there Greg guts from Houston series tied at a game of peace between Houston and the red Sox Nathan evolved or you will get the call against Alice Tyco first pitch is it five o nine\nGame for the into the U.S gets underway tonight from LA Dodgers looking even up their series at two games apiece with the ... first pitch in that one\nIs at nine or ... as he built up they'll continue stored Saturday showdown any slanted between Michigan Michigan state's ... Tony ... took his turn at the podium today admitted it put a big challenge in front of them many respects which I'm horrible and a staff of done is they've played with great sportsmanship on the field the last three years\nHave a pretty big challenge in front of them many respects which I'm horrible and his staff have done is they've played with great sportsmanship on the field the last three years also talked about the rivalry and how it benefits all involved\nWhen you look at it obviously is a new games rivalry game and when you look at it lost and said no that kind of stuff but uh when you look at it I think is good for college football always have to also think it's good for the state of Michigan 'cause everybody everybody's enthused\nAntonio went on to say he learned the importance of this game when he was an assistant at this game is always intense but even more so now is it will look to move forward and the Big Ten east race and the NBA regular season officially opening up tonight with a pair of game Celtics bringing the Seventy Sixers warriors playing host the thunder the pistons were hit the floor until tomorrow is they entertain the Brooklyn nuts\nWith sports Fifteen and forty five passed each hour Ryan woolly double ... news radio nine fifty\nWhere we are seeing some movement though and I Seventy five near twelve miles up to that situation with traffic and whether to me\nThe all new radio jak combat is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list to get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nBe forty it's usually too late to become a fight or flight\nBut not a rookie cop\nThis morning and some who was born before disco de ...\nTonight to use the calls must watch from your family and a sure fire his place up\nIn ... other work twice as fast as hard as you oh that sounds\nNice to nice to nice central on ABC\nTo forty eight percent of your weather together on the eighth\nCheck of the roads Tracy is finally seeing some improvements here and I Seventy\nAnd here's Tracey and Greg checking the triple a jam came to the game and we have north and south ... twelve miles reopen the traffic remains heavy here from Rochester oh north on every year from nine miles as well they acted any fun I met before or after cash you have the right lane and shoulder blocks slow down\nFrom after Morocco from the motor group twenty four hour traffic sensor Tracy McCaskill WWE Jamie's radio nine\nFifty accuweather forecast Samuel so silly increasing plowed through that chance of a shower low forty blustery cold again tomorrow with clubs and somehow forty five fifty right now fifty two degrees AT Metro that two fifty nine and [noise]\nThe news watch never diver sad news radio nine fifty to all these afternoon\nI'm Greg Coleman vice president Mike Pence stressing the importance of finding out what happened the Saudi journalist ...\nWorld deserves answers [noise]\nLive up to date on the way also ahead of the big line or Audi prime auto beat reporter Jeff silver\nDot com they should have been a clock\nCBS News on the hour sponsored by getting loans\nI'm Jim ... vice president Mike Pence says the administration will get to the bottom of the Jamal 'cause she'll be disappearing given\nWe need to know who was responsible way to hold those\nResponsible for show the Washington Post contributor and residents of the u._s. disappeared after entering the ... in Turkey two weeks ago secretary of state Pompeo is in Riyadh where he met with the king and crown prince today CBS was ...\nThe state department says palm pale has expressed concern and ask for a thorough and timely investigation from the Saudis at the un human rights deepest called for the lifting of immunity of any Saudi diplomats involved in the case of the cost of living in Turkey\nThat constantly was searched overnight by forensics expert and the council's residents will be starts today by Turkish investigator\nDay after a judge threw out Stormy Daniels defamation lawsuit against\nInvestigator or one day after a judge threw out Stormy Daniels defamation lawsuit against President Trump the president was lighting up Twitter CBS or Stephen ...\nTuesday Morning tweet storm that touched on Elizabeth Warren's claims of Native American ancestry and the so called witch hunt he says the Justice Department is conducting against him\nThe president called Stormy Daniels horse face it was in reference to a defamation lawsuit the porn star filed against the president which was dismissed yesterday by a federal judge\nWhile another legal fight over Daniels as non disclosure agreement is still pending Mr Trump vowed to quote\nGo after horse face and her third rate lawyer\nAfter more than ten and a half inches of rain fell in central Texas in just a day and a half rivers are on the rise and flooding is a major issue numerous highways are closed in a major bridge over the lotto river as washed away state departments are state Transportation Department spokesman crush bishop\nThis is close you're not going to find a safe place an oil up things dry out in the water recedes that it really is our job safety is our top priority\nIn Florida's panhandle hurricane relief and recovery efforts are hitting a higher gear CBS is Omar be Frank\nThe relief effort now involves more than four thousand national guardsmen and Seventy thousand utility workers but recovery is slow\nIn Panama City people lined up for gas yesterday but what they're running out of his patients\nLike that as far as we know where to go to shows\nAre trying to track down more than a thousand panhandle residents who are now officially unaccounted for since the storm the death toll from hurricane Michael now stands at least twenty on Wall street that that was four hundred forty one points that has that up one Seventy six and the ... this is CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender and MLS number thirty thirty\n[noise] wash never stops on Detroit's number one news\nWorthy nine fifty to only going to be a\nGood afternoon and thanks for joining us on this Tuesday it's October the sixteen\nI'm Greg Norman for W. W. J. news radio nine fifty in Brooklyn is off today are average temperatures are still the low sixties but we're gonna have a hard time getting past the fifties over the next several days I'll have all the details ... but\nThe forecast coming up cloudy skies let's call partly sunny and fifty two AT Metro right now trafficking whether on the age W. W. J. news time\nThree oh three earlier downed power lines along I Seventy five still causing some problems in the Detroit area WWE Jane news radio fifties Katie joining us live and local from the twenty four hour traffic center with the latest Katie\nYes he's downed power lines down the freeway just reopened ... quarter to three this afternoon and north mine I Seventy five years still slower a heavier from nine miles between nine and twelve miles wrote in South on I Seventy five you're very heavy from Rochester wrote to fourteen mountain roads Stevenson highway and John are\nAnd twelve and fourteen now roads\nAre very heavy in the area you're next update said three awaiting the twenty four hour ... devil detainees reading of nine fifty\nMeantime D. T. energies reporting about one thousand power outages in that area they say they're aware of the problem they have crews and route to the scene they would news radio nine fifty for updates as they become available knew this afternoon half of the legendary drew and Mike team has died\nFamily posting on Facebook says that might Clark passed away in the middle of the night no word yet on the cause of family asking for privacy at this time\nFamily posting on Facebook says that might Clark passed away in the middle of the night no word yet on a cause the family asking for privacy at this time\nThere was no resolution in court today and a job dispute between former Detroit humidity schools administrators Sharon MacPhail and the charter school Wayne County judge issued a temporary restraining order last week when Mick fail refused to leave upon being fired this is one of her attorneys mayor Morgan or off\nWe had a long meeting both sides\nAnd we decided this point that we should close calls because we'll see if we work something out\nThere do to be back in court in a couple of weeks W. W. J. new century of the state of the court says public tax dollars can be sent to private schools and the education lobbies upset about that nobody DJ's Lansing bureau chief Tim ... joining us live in local with a story temp\nAgreeing that collective ouch that you just heard from our neck of the woods is from the education lobbied not happy with his true to want to tell a court decision which basically said the Republican legislature had every constitutional right to sit and millions of dollars to private schools your tax dollars going to private schools\nFor service used the word non academic oriented legislators Republicans said it's fair the education law they said it's no not fair in fact it violates the state constitution and the lower court agreed with the education a lot of people now an appellate court says you know the lower court got it wrong\nWheeler turned up at the Supreme Court pretty good guess\nThe answer's yes recording ... W W J news radio nine fifty\nNew this afternoon looking to help build the talent gap in Detroit Davenport University opening a new campus location in midtown W. W. J. news radio fifties John Hewitt joining us live and local with all the details young\nGreg we're not talking to you of D. or making real for DU Davenport University of course as you mentioned announcing plans to start classes here in midtown come January president Rick pappas talks about the Taylor curriculum his team designs to help area businesses in native talent\nSome companies want to Greece some companies don't want to agree that they want a skills based in and certifications which were able to do whatever they want it could be nine credit it can be credit they guarantee is are basically once you've decided to become a nurse\nAnd you signed up with us is that you would expect to get employed but we know where our own marketed intelligence their jobs and so every one of our degrees we could actually probably the guarantee eventually we will\nPresident pappas tells me over the past few years they've added twenty new graduate degrees all tied to the likes of healthcare technology business urban education he says he's already met with the tea Blue Cross Blue Shield Quicken Loans and others to see how they can be supported directly here in Detroit we're probably live and local in midtown John Hewitt W. W. J. news radio nine fifty\nMen reportedly approached a child in Farmington Hills now police are investigating the alleged encounter happened Monday afternoon the area of liberty wrote in middle belt between Grande river and nine mile the child says the driver of a white box utility van asked if they wanted him to call someone\nIf they get into his vehicle to get warm the suspect is described as a heavy set white man with short hair wearing a black coat anyone with information as to call buildings [noise]\nW. W. J. new ... for trafficking whether together every ten minutes on the age from the out of the motive route traffic center brought you this hour by portion of the motor city good afternoon Katie is Seventy five still slow\nGreg I had both ways at twelve miles has just been reopened from power lines down on the freeway those are out of your way I Seventy five is slower south down from Rochester out I Seventy five north on you're already\nIt's been reopened from power lines being down on the freeway those are out of your way I Seventy five is slower south down from Rochester route I Seventy five north on you're already heavy from nine miles road now we have a crash on I Seventy five north down\nAt six Ninety six this one blocking you're left lane and shoulder and looking through the ... you're going to start to slow down now or right after nine mile road\nWe've gotta get reported disabled vehicle sunny down I Ninety four east on it I Seventy five is making a left leaning hipster trucker Chris called that in North down tenet Linwood got an accident on the right shoulder and we've got a police investigation that has the east and West I'm twenty three mile close between card road\nAnd hiding Reich Cherry Hill west of Newberg in West land closed for rail road repairs\nTraffic is moving better between Madison heights and try and I Seventy five Seventy five both ways at twelve ... road was closed but looking to the ... down just seeing the typical slow down and I somebody five south down between fourteen miles route and six Ninety\nLin wood exit on the lottery way north on is closed until friday and we still get that crashed in car crash investigation going on it's gonna be going on for a while twenty three mile road closed east and west bound gene card wrote in hiding right now it's time for the national electrical contractor associations\nConstruction alert Cherry Hill west of Newberg in West land as close for rail road repairs that's going to go on to afford this afternoon bird stone engineer drive car tires take a puncture and keep running\nFifty miles after a flat with Dr ... can get to safety in a flat instead of being stranded on the side of the road so rest easy and like birds don't drive car tires give you peace on the road in the adult that motivated twenty four hour ... devil detainees write him nine fifty\nAnd the accuweather forecast the update family heating cooling electrical weather center and Bryan Thompson another cold on July Brian\nWhat's the name of the name of clear sky early then clouds will increase label Philo around forty tomorrow a blustery and chilly day was some sunshine a high only around fifty and keep in mind with the wind is going to feel colder than that now the window died down some tomorrow night's will be a clear and cold night with a widespread freeze alone you're thirty downtown will drop out of the money is in the suburbs\nAnd for Thursday plenty of sunshine a high up fifty one makes clubs us on friday with a stray shower too high fifty five but most of the day should turnout rain frayed brusque on Saturday with more clouds and sunshine there will be a couple of showers around I Saturday fifty three I'm active but the drought is Bryant opposite on W W J just running a nine fifty\nAnd the current conditions in Ann Arbor right now it's sunny and fifty three degrees in Troy it's fifty three fifty six in ... in a Pontiac right now it's fifty four degrees fifty forward city airport and fifty four degrees AT Metro\nNews radio nine fifty [noise]\nGood afternoon I'm red velvet here's what's happening at three Twenty one legendary radio host Mike Clark of the drew in my show has died no word on a cause family asking for privacy at this time he was sixty three new this our attorney general Jeff Sessions\nHas announced indictments against the Mexican drug cartel C. J. N. G. part of an effort to combat transitional criminal gangs\nToday we are announcing a whole of government effort against C. J. N. G. we're hitting them from all sides and with every weapon we have\nMore coming up at the bottom of the hour\nRepublican Senate candidate John James's apologizing over a campaign ad at a press conference today said he made a terrible mistake for allowing a brief appearance of a swastika in his most recent commercial could be seen on a bulletin board in a school hallway liberal say there's no way someone didn't catch it and that it promotes a symbol of hatred\nW. W. J. news time has three twenty two it's time for the ... report\nDriverless cars early tests fine right now some of them may be no better than we are I'm a result in with a silver and report on W. W. J. news radio nine fifty\nThe insurance Institute for highway safety has been analyzing autonomous car crashes with special emphasis on the deadly ones they want to see what's going on two themes emerge you know how you have to pay extra attention when you're driving in the road splits sometimes it can be confusing well some of the driverless cars get confused too when they go off the road\nThe other thing when people use semi driverless cars they often forget that they have to be on alert no distractions no phone texting sometimes drivers become so relax when the car drives itself\nThat they don't pay attention and so when they're needed they don't step in some autonomous engineers have actually had that problem too when do we start to realize and care about how people view us at age to according to new research from Emory University earlier was believe we didn't have those feelings into we were four or five but now we learn at two years\nAbout how people view us at age to recorded a new research from Emory University earlier was believe we didn't have those feelings into we were four or five but now we learn at two years old we can have our feelings hurt too\nWith the film and report I'm Marie Feldman W. W. J. news radio nine fifty W. W. J. news time three times [noise]\nIt's the twelve could they give away on W. W. J. news radio nine fifty this hour is key word assembly text the word assembly A. S. S. E. M. B. L. Y.\nThe seven to eight eight want your chance to win one thousand dollars a gallon text assembly to seven to eight eight one your chance to win a thousand dollars messaging data rates supply remember don't text and drive\nThe all new radio jak combat is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nOr anywhere [noise]\nHey Sean Spicer and every mid term elections since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique and say you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nQueens have mastered the art of tuning out Jen there's a spider in the car\nReturning to room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time I Do whatever it takes to make your child is\nJen I friend is your boyfriend late blight book club sweetie [noise] never give up until they buckle up\nLearn more safer car dot Gov slash kids buckle up\nA message from the national Highway Traffic Safety Administration and the ad council\nW. W. J. news time is now three twenty five for the update of your money suburban Cadillac of Troy business this big rally all the markets the dial up four hundred and fifty points right now Alisa per se has our Bloomberg Business reporter Greg\nWe have a rally for stocks today with the doubt NASDAQ and nothing the\nHigher by about two percent to more than two and a half percent for the NASDAQ Composite as it keeps looking to challenge Amazon Walmart is teeming with advance auto parts to create an automotive specialty store on Walmart dot com\nThis will add to Wal Mart's automotive offerings of parts and accessories online and in stores that new venture is expected to be rolled out in the first half of next year\nElectric cars may not be the environmental Nirvana some had hoped\nBuyers looking to lower pollution and greenhouse gases need to look beyond emissions on the road Bloomberg new energy finance says by twenty Twenty one capacity will exist to build batteries for more than ten million cars coming from places such as China Thailand Germany and Poland which rely on non renewable power sources such as coal\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nUpdated their money sponsored by levine associates\nSay two exceeds any expectation or any dream I could've ever had about a hospital I was told we wouldn't get a bill or I didn't quite process that houses possible as possible through all the wonderful people who donate I don't know they are aware of\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list saying if the news and information you rely on even when you are near radio you can take this station when you're on the go download the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be on writing subscribe and download today on radio dot com and I to\nQueens have mastered the art of tuning out Jen there's a spider in the car\nWe're turning your room into a home gym\nThe better but some messages need to get through like making sure they're buckled up the whole ride every time do whatever it takes to make your child listen\n... and I did your boyfriend we play a clip sweetie [noise] never give up until they buckle up\nLearn more safer car dot Gov slash kids buckle up\nMessage from the national Highway Traffic Safety Administration and the ad council\nFirefighter I feel more yet from firehouse subs introducing new firehouse pub steaks up with savory steak crispy fried onions in our rich Belgian for your cheese sauce on top for limited time to yours firehouse ... dot com and remember a portion of every ... by helps provide lifesaving equipment first response\nSubs enjoy more substance save more lives limited time only put aside from dissipating location by herself to donate a minimum of one million dollars in two thousand they seem to borrow some public safety foundation the only point when the person every person\nW. J. new ... trafficking whether together all the gates Katie's\nStill slow in I Seventy five yes it's slower but traffic is moving better between Madison heights in Troy I Seventy five north on your slower now from before eight mile road that's because we have a crash north Seventy five it's six Ninety six locking left lane and shoulder I Seventy five south on these still slower\nFrom before fourteen mile road due to these power lines that did fall across the freeway that is totally out of your way though\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I open the window to stay alert probably are kids enough\nStep out of the car police I've probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend that's driving is drunk driving and method ... send the council\nDo you double digit news time\nFree thirty eight rather good weather together the AIDS indicate the where the problems\nRight now it's kind of crafts I Know before was founded binding it's on your right shoulder traffic is lower from before middle belt traffic is sponsored by the carpet guys and I Seventy five north on the six Ninety stay together crafts like in the left lane and children through the ... you're going to start to slow down after eight mile road\nI reported broken down vehicles Sunday down on nine Ninety four east on it I Seventy five sucking left lane and your slower from before I Ninety six on the lodge freeway north bound to crash to underwrite shoulder at Lin wood and also a crash investigation continues which closes twenty three mile road east\nAnd west bound between card and heightened Reich and we've got a Cherry Hill west of Newberg in West land it's closed for railroad repairs that's going to go on for about another twenty minutes\nFrom an earlier incident I thirty five north on for twelve to fourteen mile road you're left lanes blocked\nFor power line repairs need new flooring in your home called the carpet guys right now and save up to fifty four percent off new carpet and flooring plus twelve months interest refinancing called eight five five for my guys or go to Harvard guys dot com that's ... carpet guys dot com today\nIn the idol downloaded give twenty four hour traffic sensor Katie for W. W. J. news radio not fifty the accuweather\nForecast checking in lived out in a meteorologist Bryan Thompson I I Know it's thirty two degrees around here this morning not quite the cold overnight again\nI'm not quite the cold tonight Greg but we'll get down there again tomorrow night so tight where do we saved by some clouds that are going to be moving on it and we have a lot of sunshine right now it is pretty brisk do a pretty good breeze blowing are about to Fifteen to twenty miles per hour most spots\nIn the suburbs plenty of sunshine Thursday hype fifty one makes clouds and son friday with a stray shower too high and fifty five I think Saturday is going to be on the cloud of your side there will be some sunshine at times but it will be births with a couple of showers around most of the day Saturday the looks around with a high of fifty three\nFifty three degrees right now at city airport it's fifty four in Ann Arbor and fifty six metro airport I'm accurate the major biologist Bryan Thompson on WWE ...\nKeep it here for trying to get what they are together every ten minutes on the apes around the clock you can always know before you go log on anytime W. W. J. news radio dot com for the latest coming up the attorney general going after a Mexican drug cartel that stories now did\nThe all new radio jak job that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nTrafficking whether to gather on the apes and breaking news first came up to date on the road\nNews radio nine fifty W. W.\nW. W. J. new century forty to attorney general Jeff Sessions going after a Mexican drug cartel he announced new indictments today against CJ Angie I'm announcing unimportant\nImportant criminal charge Fifteen and I I guess they turtle a forty five C. J. N. G. leaders finance fears transporter drug sources and distributors its\nSoul in an effort to combat transnational criminal gangs W. W. J. news time three forty three it's time for ... chronicles\nStopping you from going the wrong way listed you have to do with the chronicles suppliers\nThe up has come up with a system that can warn you if you're going the wrong way on a freeway ramp or a one way street\nWith a camera technology we can do you ads and traffic signed recognition and be able to identify when a driver it's heading the wrong way and be able to give them that ... the\nSystem could even take control Suzie a vice president on your ... the polls are showing off a system that monitors drivers to watch for potential distractions\nWe had systems that can monitor and a driver position including high tracking an eye position as well as more of a three dimensional driver position that\nCould be important for early automated driving systems that still require the driver to keep their eyes on the road and be ready to take over if needed what the corporate Nichols I'm Jeff\nGilbert W W J ...\nSays firefighter wrapped up oriented firehouse subs introducing new firehouse pub stakes a savory steak crispy fried onions in our rich Belgian fear cheese sauce on top for limited time more than yours firehouse subs dot com gang member a portion of every ... by helps provide lifesaving equipment first response\nSubs joined more substance save more lives limited time only plus ... which is pretty location by herself to donate minimum one million dollars to done anything by some public safety foundation donations went when the person every person\nHey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering this\nIf you left the games that are sick of cracking candy played the hugely popular mobile game that's being this is ridiculous like that and they can buy that if I die rating it's a part of the games you can't miss out on some type of collect tons of character and play really event\nThat seem update every month they never get bored\nCorrecting candy out too many team pick up your phone and download that scene and the apple app store or Google Play for free now\nFriends without the eye that team\nWell the markets a staging a big\nRally without more than five points Fifteen minutes before the closing bell with the latest coming up from the Bloomberg Business for four\nThree forty five it's time for sports and Ryan ... got a couple of a baseball playoff games today the Milwaukee Brewers\nIs certainly a surprise the Dodgers I I Know the networks are in a panic over the prospect of Milwaukee in Houston in the world series that would not be what the ratings they would\nWant no they're certainly not what they would want I honestly thought it would be LA in Boston I Know you're not going to talk about before the playoffs started but you can't sleep on the brewers this is a team of creeps up on everybody towards the end of the season\nFound a way in and then of course they've been right on the table here they have a two games to one lead over LA that will be the lake game tonight it's game for the national league championship series the brew crew will get up to one and it will be geo Gonzales against ... first pitch is at nine or ... and the American league championship series middle resumes tonight after he traveled to yesterday\nNow they're down in Houston that series tired of the game of peace between the Astros and the red Sox Nathan he boldly against Alice cycle first pitch less than two hours away that times we're way at five or nine\nCloser to home no Michigan State I coach marked Antonio spoke today he admitted despite the team's upset what ... said on the road it's not going to get any easier this week at home and gets Michigan and so it's pretty clear what will take to win this game\nWhere you can make mistakes that either side of the ball really you can't give up the easy ones little coverage or or or a gap and then also you know you can't turn the ball over I think is a huge you know traditionally the team is Russia for the most shortage of is usually won the game you know that's probably true in most cases\nMichigan State has won eight of the last ten Michigan last one did come at sports stadium just two years ago and the NBA regular season officially opening up tonight Celtics and the Seventy Sixers warriors playing hosted the thunder pistons will play tomorrow night as they played host to the Brooklyn that\nWith sports Fifteen and forty five passed each hour them Ryan woolly W W J news radio nine fifty\nNor thanks Ryan will check out the drive for air traffic and whether in a minute W. W. J. news time three forty seven\nFirefighter Raphael bariatric firehouse subs introducing new firehouse pub stakes would save restate crispy fried onions in our rich Belgian beers cheese sauce on top for limited time more than yours firehouse subs dot com remember a portion of every ... by helps provide lifesaving equipment first response\nOurselves joined more subs save more lives somebody's I'm only ... which is pretty location by herself to donate minimum one million dollars to done anything by some public safety foundation donating point when the percent every person in\nThe all new radio dot com that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on and even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere\nForty eight trafficking whether together on the edge checking the roads Katie looking at I Ninety four\nIt dining near the airport at an accident on your right shoulder looking at the ... dam cans us lower\nBut I Ninety four westbound it binding near the airport at an accident on your right shoulder looking at the ... dam camps us lower from before metal belt\nTraffic is sponsored by Chris furniture kind of slow gal in Bloomfield township on telegraph north and south on at maple roadwork blacks to write lanes each way now this is going to go until midnight on friday also erode works Loni down I Ninety six west on the Jeffries from I Ninety four two grand river\nRoadwork blacks you left lane we've got a crash investigation that has twenty three mile road east and west on closed\nBetween Carter wrote in hiding Reich and the traffic lights near Thirteen now wrote in Stevenson not working doing due to a power outage in the area Chris furniture of lasagna selling quality you estimate furniture and discounted prices\nBetween card wrote in hiding like in the ... center Casey ... news radio ... fifty\nThe accuweather forecast and Bryan Thompson says Chile increasing amounts of plows with a shower tonight and a little forty blustery cold tomorrow clubs in sun high forty five fifty fifty one on Thursday it's fifty four AT Metro now that three fifty nine\nTo ... watch never diverse sneezes radio nine fifty to ODU\nAfternoon I'm Greg Norman top stories ahead President Trump says the Saudi friends now vowing a full probing the missing journalist\nIf they know about it that would be bad CBS News with alive report also ahead a Detroit ... home already under investigation after ... an infant in a child with down hidden inside now the thing for the last time the Hoover\nPlus Mayor Mike Duggan responding to that kind of diversity of lights and sirens policy in the city or John you it will have a live reports CBS News coverage of the world\nThan nine to\nAccount for glock\nCBS News on the hour sponsored by capital one\nI'm Jim mission to be President Trump says the Saudi crown prince Mohammed bin Salman has denied any knowledge of what happened is Washington Post writer Jamal 'cause Yogi CBS or Stephen ...\nIn a pair of tweets the president says he personally spoke by phone with the Saudi crown prince as secretary of state Mike Pompeo stood by Mr Trump says Mohammed bin Salman totally denied any knowledge of what took place at the Saudi conflict in Istanbul\nMr Trump says NBS intends to rapidly expand his investigation into ... disappearance and he promised his answers we'll be forthcoming shortly\nSecretary of state Pompeo has wrapped up his stop in Riyadh and is headed to turkey CBS is Holly William\n... president right get pay if I didn't want that investigators are looking into toxic material inside the fatty confidently ... exactly what that means he'll take that they would be given access to the Saudi consul general's residence\nRivers in central Texas are busting their banks after ten and a half inches of rain fell in a day and a half is washed out roads and bridges and forced evacuations Craig Campbell watched his boat flow way with the dark on the Colorado River\nCafe in your book\nAnd it's pretty bad\nK. J. C. E. radios Casey John they're seen some of the worst flooding they've seen an about eighty years Nineteen thirty five actually was the last time the land a river rose to these levels it was up ... just below forty feet which the all time high the national weather service said was forty one and a half feet so it's just under that all time high\nOn the heels are president's visit earlier this week to areas hard hit by hurricane Michael BP Mike Pence is in Georgia today all\nBars here where\nWe are with\nGeorge's suffered the strengths extensive crop losses the official death toll from Michael up to thirty President Trump is warning Honduras that it stands to lose USAID does not stop a caravan of up to three thousand would be migrants across from Honduras into Guatemala Monday headed for the U.S\nI mean time you've finished ration has released an update on its promise to reunify families that were separated earlier this year after crossing the border illegally ...\nOver the summer there were so much ... when hero tolerance policy went into effect because several of these agencies had to work together to implement it and there really was a lack of communication to do that and sell families are being torn apart and so I Believe that's where we are right now with the sixty six shows\nLack of communication to do that and sell families are being torn apart and so I Believe that's where we are right now with the sixty six children who have not been reunited with their family\nThe Dow is up five hundred and forty seven points this to CBS News\nCapital one quick silver card or an unlimited one point five percent cash back on every purchase everywhere that's all there is to it just unlimited one point five percent cash back on everything you buy what's in your wallet\n[noise] never saw on Detroit's number one [noise]\nAlready oh\nGood afternoon and thanks for joining us on Tuesday October the sixteenth I'm Greg them for W. W. J. news radio nine fifty broke Allen is off today\nThey will stay mainly dry over the next few days but it it's gonna sail actually sign will talk about actually it's going to be with a complete accurate forecast coming up\nWe're seeing the sunshine a this afternoon and it's a definitely look a little bit nicer fifty six degrees this hour traffic and whether on the age W. W. J. news time for oh three\nA scary situation for drivers along I Seventy five in Madison heights this afternoon one of the road worker accidentally snack power lines causing them to come down on the freeway Michigan State police first lieutenant Mike shah says it happen or Thirteen mile road\nThose power lines also fell on a couple of vehicles are actually driving up and down the lanes troopers were able to close the freeway down start to exit traffic off at both fourteen mile and twelve mile road as they went along D. T. energy was sunk contacted they came out major did lines were were dead they weren't they weren't live\nLines were pulled off the freeway which is sense reopened no one was injured\nOne half of the legendary drew in my show has died family posting on Facebook that might clerk passed away and the middle of the night no word yet on a cause family is asking for privacy at this time he was sixty three\nIt's a new up day to a story we've been following a W W J could be sometime before the bodies of those eleven infants found in the old ... funeral home on Detroit's east side or identified Wayne County medical examiner's office says the remains are in mummified condition\nForcing them to rely on records because the body's already made it to a funeral home there should be information available chief medical examiner Dr Carl Schmidt says the entire process could take months meantime\nA Southfield attorneys felt the one million dollar lawsuit on behalf of the Detroit woman who says her husband's remains were mishandled by that same funeral home W. W. J. news radio nine fifty sorrow Hoover has the story\nKathleen Bonner says she contracted funeral services for her late husband with Ken ... funeral home and Detroit which is currently under investigation after the bodies of ten feet a sit in one child were found hidden inside\nBonner says two weeks after the funeral home tip possession of her husband's body they told her it was unfit for an open casket funeral\nAfter several visits to can't trial to try and see her husband's body than it was convinced to cremate him she found out shortly after that control was improperly storing bodies in non refrigerated areas of the home\nShe says it causes her to speculate the authenticity of what really happened to her own husband's remains the Herbert Hoover W. J. news radio nine fifty\nNews this afternoon Detroit Mayor Mike Duggan is responding one day after the firefighters union called up the city over policies being used on calls W. W. J. news radio and fifties John Hewitt is alive and local where the story for us John\nOf course we're talking about the lights and sirens or maybe more apt to no lights no sirens policy that does something in the fire department and the firefighters association believe makes this community less safe as you mentioned the mayor weighing in saying the policy is the right thing to do essentially\nI'm In the fire department and the firefighters association believe makes this community less safe as you mentioned the mayor weighing in saying the policy is the right thing to do essentially not using sirens for calls deemed non life threatening\nIf there's any chance that there's a fire any side of the smoke the fire trucks are going a high speed of light errors but if you're going to wash down at night after the fire is out\nI don't think people want to thirty thousand our vehicle lived through a red light so I think a ... year old is doing the right thing and we're going to stick with it at\nAll costs in Phoenix and a number of servers all use the identical process we have to be mindful of the safety of our pedestrian that are motorists are unnecessary bureaucracy\nJust yesterday here a news radio nine fifty Detroit firefighters association president might ... says the policy has already proven to be dangerous claiming hundreds of emergency calls have been coated incorrectly everybody lived locally Detroit John ... W W J news radio nine fifty\nW. W. J. news time is for all seven it's the best way to judge a vehicle ticket for a test drive W. W. J. ought to be reporter Jeff Gilbert one of the judges for North American car truck and utility of the year\nWe're putting the semi finalist for North American car truck and utility of the year through their paces as we drive through these wind the roads of Orange County\nI met a Toyota around four of them are going\nTo check out the jeep wrangler the Lincoln not listen several others in the utility category there are a number of big three vehicles in the truck category and a lot of cars the winners will be announced in January to start the north American International\nAuto show on the roads washed or not counting I'm Jeff George W W J radio nine ...\nW W J news time for a way\nIt's done for trafficking whether together every ten minutes on the gates from the ... traffic center brought you this hour by Audi of Rochester hills and Katie what are we watching this hour\nGreg we had a crash near the airport I Ninety four west ... finding road is Tanya right so they're looking to the AAA damn Kansas lower from before ... and I Seventy five north found at six Ninety six\nA crash and you write children's slower from before eight mile road and its logo and Bloomfield township with roadwork telegraph north and south down at maple you're too right lanes of black each way that's going to go until midnight on friday and Clinton township natural parkway is close to the east and west bound east harbor\nDue to a crash also in Clinton township crash at north on north Fifteen mile road and accident blocking you to write lanes and we've got to crash investigation that has closed twenty three mile road east and west on iTunes card wrote in heightened break\nClosed east and west on metro parkway just east of Harper now it's time for the electrical workers local fifty eight construction alert\nTelegraph north and south bound in Bloomfield township at maple you to write lanes are blocked and that's going to go until midnight on friday in the idol downloaded there twenty four hour traffic center ... news radio nine fifty\nNow the accuweather forecast now from a family he didn't grueling electrical weather center Bryan Thompson has looked\nSo that will host a clear sky early clouds will increase late fulfill lower around forty four tomorrow blustery in Chile there was some sunshine and high close to fifty as it gets to tomorrow night's will be clear in the cold the windows die down some but as a do so it's we're allowed to object to really drop are expecting a widespread for use the low near thirty downtown and many suburbs into the twenties\nThursday a sunny day and all that windy so I don't think I feel too bad um son with the highest if you want even though it is going to be a pretty chilly day mix clouds on friday with a stray shower to a higher fifty five\nAnd for Saturday ... son will be a couple of quick showers around I Saturday fifty three I'm accuweather beat around which is Bryan Thompson on W. W. J. to try to get on fifty\nSunny skies fifty four now it's city airport fifty six had metro\nTrafficking weather is sponsored by free star financial credit union it's time to break up with your back and come see why free start financials been wrecked the best of the best for seven years switch today and free store financial we'll give you a hundred and fifty dollars when you open a\nBoomerang rewards checking account with direct deposit it pays to belong to free star financial credit union insured by\nThe end see you a\nNews radio nine fifty settled or you don't want to get good afternoon\nI'm Greg Bowman here's what's happening at four twenty legendary Detroit radio personality might clerk has died he worked with drew lane on drew in Mike for a number of years no word on a cause of death but family says he passed away in the middle\nClark has died he worked with drew lane on drew in Mike for a number of years no word on a cause of death but family says he passed away in the middle of the night attorney general Jeff Sessions speaking out about department of justice involvement in the investigation into the disappearance of journalists Jamal ...\nWhile at the management given serious evaluation on the FBI understands is responsibilities and I'm not able to comment on any um details of what might be occurring I think that'd be inappropriate at this time\nHe also announced indictments against the Mexican drug cartel today more coming up at the bottom of the hour today marks three weeks till the mid term elections W. W. J. news writing online fifties Vicki Thomas has a preview\nThe ballot proposals especially prop one to legalize recreational use of marijuana that to be driving voters to the polls on election day three weeks from now state why we could see a record for a million voters cast ballots and in Detroit voter turnout expected to be\nForty one to forty six percent Detroit Urban League president and Charles Anderson\nWell it'll be great to see fifty one percent and I think I think or whatever percentage of goes out they could have been much larger percentage of voters and what we've seen in the past [laughter] see a number of people who are energized and motivated to go to the polls and vote and so I'm looking forward to a great turnout and I hope all the courts or house a state of affairs for the voters\nVicki Thomas WW Jane is radio nine fifty\nSix hundred sixty seven million dollars as that son to your grand prize in tonight's mega millions jak but no one has drawn all the winning number since early July what would Kevin manning of Detroit do with all that money to\nSpend your door\nGoes out to be what our girl\nGets the winning numbers after eleven tonight on W. W. J. N. W. W. J. news radio dot com W. W. J. N. used them for twenty [noise]\nAnd it's the twelve kid they give away on W. W. J. news radio nine fifty this hour is key word is slice text that word slice S. L. I. C. E. to seven to eight eight one your chance to win one thousand dollars messaging data right supply remember don't text and drive\nHad a big rally on the markets today we'll update your money and the Bloomberg Business report coming up in a minute\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves piping solution and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy on com forward slash marketplace consumers energy count on us\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nCameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink camera systems a buck and stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nW. W. four twenty five time for business suburban Cadillac of Troy business desk and the closing bell report sponsored by the Michigan schools in government credit unions have at least ... Bloomberg Business report that's a big winner today Lisa\nDefinitely Greg we saw a massive move up the Dow sword five hundred forty eight points are more than two percent\nFinishing just shy of twenty five thousand eight hundred NASDAQ gained almost three percent or two hundred Fifteen points as St piece sword fifty nine points higher again of more than two percent to finish above twenty eight hundred\nThe Bloomberg W. W. J. Detroit index up one and three quarters percent so the gains were widespread and they might continue tomorrow after the bell net flicks posted blockbuster earnings news\nThe number of new subscribers beat expectations and profit exceeded forecast\nAnn Arbor base dominos pizza is still growing at a rapid clip\nThough not fast enough for investors that Sunday chairs lower the bar is high for dominoes while it grew into brisk six point three percent pace in terms of domestic same source sales\nThat's slightly missed the six point five percent rate analysts then expecting and shares of dominos pizza down almost five percent today I'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nSocks of local interests courtesy of ... and wealth management General Motors today closing at thirty two thirty for a twenty two sets the Chrysler\nAt sixteen eighty four that's up ah sixty two cents and Lear Corp and one thirty four fifty a gain of Seventy six cents look\nWhat he is every time you went out you can cash in now with the capital receiver card ... percent cash back on dining and entertainment light and their first have to walk them all\nAnd for for cash back when you take your kids to the museum for the first time what would it [laughter] [noise]\nNo matter your reason for going out now you have formal are introducing new theater carts and capital on four percent on mining and four percent on entertainment as much as your well in terms of ... capital one bank usa NA\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is on Amazon company limited time offered terms and conditions applied\nSo rest easy in birds don't drive ... give you peace on the road in the adult that motive twenty four hour traffic center ... devil detainees ready in that fifty\nThe accuweather forecast live now and the meteorologist Bryan Thompson other chili night I guess are pretty much typical weather for late October Brian\nYeah pretty much Greg although we already a little below average the average Joe highs are in the low sixties average low temperatures in low forties won't be too far from that tonight\nWe'll be seeing a temperatures backed down near blow the freezing mark tomorrow night well even though that is below average but this time of year typically we do start getting frosting and freezes around this time of year so up to forty two nights and not as cold as last night or will be mainly clear early it's also pretty brisk right now the windows still blowing run to Fifteen or twenty miles per hour many spots\nBut that will die down here during the evening clouds will start to increase late battle help keep temperatures up a little bit so low near forty tonight to blustery and chilly day tomorrow with some sunshine a high only around ... even a bit cooler than today clerical tomorrow night be window die down and they were expecting a widespread freeze low near thirty downtown in the twenties and the suburbs\nPlenty of sunshine for Thursday hype fifty one I don't think there'll be a lot of wind on Thursday mixed climbs in sunshine for friday with a stray shower two hundred fifty five most of the day should be dry\nSaturdays going to be a ... day we'll have more clowns and sunshine and along with that a couple of showers but not a washout high Saturday fifty three right out fifty four degrees in Flint it's fifty five it's to the airport in fifty seven AT Metro airport ... W W J just running it on\nThat day driving whether together we've got it when you needed every ten minutes on the AIDS around the clock Andrew next report less than ten minutes away it for forty eight coming up on news radio nine fifty flooding in Texas because of record rainfall will have that's ...\nYeah we sort of stopped paying attention and racked up a lot of\nThat yeah it was stressful he blamed and even my credit card debt and I blame him for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal ad time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a B B\nAnd best they handles everything on life start to finish\nAnd consumer advocate that stack five star it's very easy on line ... and we can be approved and find it and if we're leveling business day I played on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cards and some bills while lowering our monthly payment the best they loan was like a total fresh start\nVisit best egg dot com slash radio best day dot com slash radio subject acquitted approval actual Rich Beeson title very\nPressing and whether they gather on the AIDS and breaking news first came up to date on the road\nNews radio nine fifty\nW. W. J. news time is for forty too heavy rain causing rivers in central Texas the flood reporter Casey Jones says the record rainfall is even over the bridge and things like there's river gauges that have picked up\nTwelve inches of rainfall since late Sunday night when this first started and that's on top of another six to eight last week there just saturated there's nowhere for the ring to soak in it's just all running off at this point out their\nResidents have evacuated the area with officials trying to contain the overflow the rivers two candidates locked in a contentious race for the eighth congressional district in ...\nBishop and delicious sly couldn't believe that pipeline five should be shut down they don't agree on when that should happen Mr bishop says he supports the governor\nIn building the tunnel under the straight smack enough to host the controversial an aging pipeline he says that's the best thing to do she says not really close she wants to pipeline shut down now know total no nothing just no pipeline fine\nReporting from ... W W J news radio nine fifty W. W. J. news time for forty three we'll talk sports in\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news is across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nIt only takes a minute to find out if you may have pre diabetes and you can do it I Do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes or mine I read that wrong\nThey can to warn glasses so visit do I have pre diabetes that Oregon take a short time\nBecause pre diabetes can be river\nTalking about the ... and it's pre diabetes around ...\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert probably are kids mouth\nStep out of the car please I probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving CEO warning signs stop and how like have a car or a friend that's driving drunk driving and that that brought here by the council\nReading an fifty had a big rally on the market today the Dell a finished up more than five hundred points we'll get the latest\nComing up from Bloomberg Business reporting ten minutes for forty five cents for sports what's happening rhyme liquid records the buildup continues towards Saturday showdown in East Lansing between Michigan Michigan State starting to go work Antonio took his turn to the podium today he admitted they have a pretty big challenge in front of them many respects what\nJim horrible and the staff of done they played with great sportsmanship on the field for the last three years in the series you also talked about the rivalry and how it really benefits all involved\nWhen you look at it obviously it's a new games rivalry game and when you look at it what's been said no that kind of stuff but ah what do you look at it I think is good for college football I always have also think it's good for the state of Michigan 'cause everybody everybody's enthused\nWent on to say he learned the importance of this game when he was an assistant at this game is always intense but even more so now is both looked to move forward of the Big Ten east\nSide of the baseball playoffs continuing today a pair of games on the Astros a Red Sox game three of the American league championship series from Houston first pitch now just about thirty minutes away a series by the way tied at a game of peace brewers and Dodgers game for from LA tonight at nine o nine or ... up\nWe you know dreary obviously Frank can you do ... Wilson he got a lot of guys who spread about two or ...\n... and the NBA at regular season officially opening up tonight Celtics bringing the Sixers the warriors playing host to the thunder the pistons will open up the the season tomorrow is they bring in the Brooklyn nuts with sports Fifteen and forty five passed each hour I'm Ryan woolly W W J news radio nine fifty\nBucks rival hit the roads for trafficking whether the minute W. W. J. news time for forty six\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list of news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nIt only takes a minute to find out if you may have pre diabetes and you can do it I Do I have pre diabetes that or if you're probably not going to argue\nKids were listening to the radio you're busy which is great because busy people can't get pre diabetes and mine I read that wrong\nThey can just want my glasses so visit\nDo I have pre diabetes dot org and take a short time\nBecause pre diabetes can be river\nThat he had cancer and it's pre diabetes and when I hear\nW J news I forget\nYou've done for traffic and whether together let's check the roads Katie looking at the Southfield freeway\nYes Greg south founded schoolcraft got an accident on your right shoulder and looked through the triple a jam camps your slower from eight mile road traffic is sponsored by the extradition temporal scanner thermometer I\nNinety four west on vine instill crash underwrite shoulders slowing down from before middle belt and the ... area I Ninety four east on if they're here on street reporters grass and you're right shoulder\nAs you slower from us twenty three in Port Huron an accident I Ninety four west on at the bridge to Canada and it's on your left shoulder and Clinton township Metra parkway west on clothes from union like the harbor with a crash\nAnd also in Clinton township granted north on north to Fifteen miles wrote an accident blocking you\nIt's on that both shoulders also in Port Huron an accident on nine Ninety four west on at the bridge to Canada that one on your left shoulder and Clinton township Metra parkway westbound still closed community lake to Harper\nAnd also in Clinton township granted north on north of Fifteen mile road and accident is blocking you to write lanes see a problem on the road to give us a call on the W. W. J. tips their line that you've worried for two three six WWE day in the adult that motivated twenty four hour ... center Katie for W.\nW. J. news radio ... fifty see actor weather forecasts now in Daraa meteorologist Bryan Thompson says Chile increasing amounts of clouds tonight shower later on low forty blustery cold tomorrow with highs forty five fifty fifty six now metro\nNews watch never diverse sneezes radio nine fifty ... leaves afternoon\nI'm Greg Goldman top stories that vice president Pence says us will demand answers about the disappearance of suspected murder of Saudi journalist ... live up to next from CBS new this hour a serious crash involving a child in ... county or is are Hoover will have a live report also\nYou if you make room for the youth Gavin port university opening up shop in midtown Detroit I'm John you Brian Lillian Fifteen before while they're doing on today with one series already underway luggage gone up the latest and tell you what does that work in Tony ... from Michigan coming up for this radio nine fifty\nDot com it's five o'clock\nCBS News on the hour with Jeff Lord presented by their works really good Tuesday Afternoon still looking for answers that is the bottom line\nThat those responsible are held to account\nCBS News has learned the Saudis are preparing for France where they will ... death was the result of an interrogation gone wrong and they're expected to admit the interrogation was approved by Saudi crown prince Mohammed bin Salman\nSecretary of state Mike Pompeo met with both the Saudi king and the crown prince who said they've already got an investigation into the matter um pay will travel to turkey tomorrow somebody with officials there to discuss the case when a much more on the ... disappearance on tonight's CBS Evening news\nSenator Elizabeth Warren's release of a DNA test that she says proves her Native American heritage has sparked more questions and more attacks and President Trump CBS Steven port annoy the\nPresident is reveling in the story which heroes and knew this week with the production of a campaign video in which Elizabeth Warren has an expert say she does have a Native American ancestry Mr Trump has seized on the possibility suggested by the expert that Warren is merely one one thousand Native American\nAnd on Twitter he points to a statement from the Cherokee Nation which blasted warns use of the DNA test saying she is undermining tribal interest with her continued claims of tribal heritage\nThe death toll has risen to at least thirty across four states after hurricane Michael Florida accounts for twenty of those deaths or CBS Omar via Frank is\nPower situation is still not great there's roughly about a hundred and twenty five thousand people in Florida who still do not have any power here locally in Mexico beach I talk to the mayor and he told me he does not expect to have power maybe even water for at least two months\nWasn't ten and a half inches of rain over the past few days is cause near record flooding across central Texas the water's destroyed a bridge across the ... river an old homes within a quarter mile of the river and the city of London have been urged to evacuate Austin fire department division chief Palmer book\nWe're doing evacuations and almost rescues that people as oil continues to come up with starting to pull people out of houses and that's what our guys are doing right now we just want to keep encouraging people to stay off the roads if there is some place they stay stay\nVery big deal in Wall Street's Adele rose five hundred and forty seven points the NASDAQ was up to fourteen and the S. and P. game fifty nine this is CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam give their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never stop on Detroit's number one\nForty nine to only going to be a\nGood afternoon and thanks for joining us on this Tuesday October the sixteen I'm Greg gum for W. W. J. news radio nine fifty broke out at all today\nAre advertisers are still the low sixties but we're gonna have a hard time getting past the fifties over the next several days I'll have all the details of the complete accurate the forecast coming\nUp some ... fifty seven degrees turned into a pretty nice afternoon right now traffic it whether out of the AIDS W. W. J. news time five oh three\nNew this afternoon a multi vehicle accident and become county leaves a child seriously hurt W. W. J. newsworthy like that these are Hoover joins us live and local with more on the stories are\nThem become county sheriff's office says traffic began to slow down this afternoon on west down twenty three mile road east of card in Macomb township\nA vehicle was not able to slow down\nAnd rear ended another one causing a chain reaction at first vehicle then spun off and went in to the east bound lanes where it with the blonde several people were hurt but not seriously however a two year old child was taken to a local hospital\nAnd then transfer it to a children's in Detroit because of the extent of those injuries twenty three mile by the way still shut down in both directions but expected to open shortly\nAnd then transfer it to a children's in Detroit because of the extent of those injuries twenty three mile by the way still shut down in both directions but expected to open shortly reporting lives to her who Bert ... W J news radio nine fifty\nEarlier today for D. T. E. energy bucket trucks tend to be used to clear downed power lines across I Seventy five thirty mile road those power lines fell on three cars but no one was hurt this is Dee Dee spokesman Brian blue\nOne of the um the road crews that was out there working snagged a wire which caused the pole to break and then that caused the line to land on the expressway\nMichigan State police say the wires were already hanging low and the road worker accidentally snack the line wires have since been lifted off the freeway\nA legendary Detroit radio personality has died my Clark of driven my passed away in a sleep overnight according to family are very on traffic reporter Katie worked with the parrot the beginning of their career in Detroit the\nFunniest jokes were probably all about the sexual innuendoes if I didn't have one of those before Seventy and my day wasn't started I cried laughing everyday belly laughing on the radio marathons that we did the funniest parts were at two in the morning especially when he was in sleep deprivation\nWhile he wasn't on the air Katie says Mike Love flying airplanes and spending time with his wife Trish\nUpdating it earlier story on W. W. J. the Wayne County medical examiner's office says it could take months for the bodies of those eleven infants founded a former funeral home to be identified\nBecause the bodies are in mummified conditions doctors have to rely on records chief medical examiner Dr Carl Schmidt says he would hope because they already made it to a funeral home with information will be available the ... funeral home along Mac avenue on Detroit's east side was shut down back in April over deplorable conditions\nNo resolution in court yet in a dispute between a former Detroit city councilwoman and local charter school years W W J city beat reporter Vicki Thomas with more\nEvery one of ... ... strong giving those signs and yet we try and work out an agreement between sharing the male and the conservator for Detroit community schools who fired MacPhail mayor Morgan Roth is one of her attorney sexually we dispute\nWith they say including that make Neal is not certified he says she is Maureen Taylor state chair of Michigan welfare writes in the courtroom to support me fail for someone\nTo suggest that she has been anything of wonderful to these students in ... the place is yet again it conservator emergency manager unless somebody else who is smarter and better to do the job\nThe town is W. W. James radio nine fifty\nLooking to help fill the talent gap and Detroit Davenport University opening a new campus location in midtown W. W. J. news radio nine fifties John Yoo it with the details\nYou of deem make room for DU Davenport University announcing plans to start classes in January in midtown campus location president Rick pappas talking about the Taylor curriculum his team designed to help area businesses and native talent\nSome companies want degrees some companies don't want to agree that they want a skills based in and certifications which were able to do whatever they want it could be non credit it can be credit when we know where our own marketed intelligence their jobs and so every one of our degrees we could actually probably guarantee eventually we will\nPappas tells me over the past few years they've added twenty new graduate degrees at the college tied to the likes of healthcare technology business and urban education he says he's met with the likes of ... a Blue Cross Blue Shield quicken and others to see how they can be supportive here in Detroit from midtown John ... W W J news radio nine\nCross Blue shield quicken and others to see how they can be supportive here in Detroit from midtown John Hua W. W. J. news radio nine fifty W. W. J.\nFive oh wait time for trafficking whether together every ten minutes on the age from the motive rip traffic cetera brought you this hour by BMW of Rochester hills and Katie looking at a problem on the Southfield\nYes Greg cell phone at school crafts an accident on your right shoulder and look into the ... or slower from Nick Nichols\nTraffic it's sponsored by the carpet guys and I Ninety four west on and finding a crash on your right shoulder has or slower from ... in Port Huron an accident I ... for west on the bridge to Canada\nAnd it's on your left shoulder sunny down in Clinton township Metra perfectly westbound closed immune in like two harbor with a crash also and Clinton township granted north on north of fifty mile road\nAnd accident blocking her to write lanes and emit come township crash from earlier has closed twenty three mile road east and west vomiting card and hiding Reich\nNeed new flooring in your home called the carpet guys right now save up to fifty four percent off new carpet in flowing plus twelve month interest free financing called eight five five for my guys or go to ... dot com that's carpet guys dot com today in the adult that motive twenty four hour traffic center ... news radio nine fifty\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio is on Amazon limited time offered terms and conditions of his time by\nGod for trafficking whether together on the eighth and Katie looking at a problem on the Saffir south on his school crafts an accident on your right shoulder ad in the ride home and look into the triple a jam can zero slow and go from before eight mile road\nTraffic is sponsored by Detroit princess riverboat I Ninety four west on him signing near the airport a crash on you Rachel there has a slower\nFrom the middle belt in Port Huron an accident on that for whites on at the ... on your left shoulder a slowing traffic down and still and Clinton township measure parkway westbound clothes from union like the Harvard also\nAnd Clinton township grafted north on north Fifteen mile road and accident is lacking or to write lanes and now it's time for the national electrical contractor associations construction alert six Ninety six both the east and west bound between telegraphing I two Seventy five\nOnly one lane is going to be open now that starts tonight at nine until five AM that's going to go\nA nightly at through friday morning at making your corporate holiday party different this year will get now on the Detroit princess river about their heated and enclosed or you can celebrate any party political fundraiser or birthday all year long cruise within the Saturday or Sunday for lunch and dinner\nCalled eight seven Seventy T. B. O. A. T. or Detroit princess dot com in the idol download a good twenty four hour traffic center Katie for W. W. K. and he's right in that fifty\nDaddy accuweather forecast now the update from the family heating and cooling electrical whether centered Bryan Thompson\nThe chilly weather is not going anywhere anytime soon although it's not going to be quite as cold as it was last night's this little start off with a mainly clear sky but clouds will increase of the night goes on a low near forty\nWill have some sunshine to borrow a blustery and chilly day Jaime or fifty clear and cold tomorrow night to the widespread freezes the wind dies down alone you're thirty downtown most suburbs would get into the twenties\nPlenty of sunshine Thursday high up to fifty one mix clubs and sun ... back to the mid fifties there could be a stray shower to an ... Saturday with tons of clouds of sending a couple of showers\nI Saturday fifty three I'd give it to be around just Bryan Thompson on WW J just running on fifty\nYard conditions in Ann Arbor right now sunny in fifty five degrees it is fifty three hat city airport sunny were fifty seven AT Metro\nNews radio nine fifty to be a\nGood afternoon I'm Greg Bowman here's what's happening at five Twenty one [noise] developing news is serious crash in ... county leaves a two year old child hospitalized in\nSerious condition the sheriff's office says the car rear ended another on twenty three mile road between cards heightened Reich roads causing a chain reaction with four other cars vice president Mike Pence says he'll be speaking with secretary of state Mike Pompeo later today about his trip to\nUh Farmington Hills complex on twelve mild their middle belt investigators say the victim was targeted no arrests have been made\nMeantime a man reportedly approached the child in Farmington Hills now police are investigating the alleged encounter happened Monday afternoon the area of liberty wrote and middle belt between Grande river and nine mile the child says the driver of a white box utility van asked if they wanted him to call someone and getting his vehicle to get warm\nThe suspect described as a heavy set white man with short hair wearing a black coat anyone with information as to call police WW ... twenty three [noise]\nIt's the twelve kids they give away on\nWWE Jane news radio nine fifty this hour is key word is water tax the word water W. A. T. E. R. to seven to eight eight one your chance to win one thousand dollars again text water to seven to eight eight one your chance to win one thousand dollars message and data rates supply remember don't text and drive\n[noise] we'll look at the closing numbers with a big rally on the market your money is next\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run onto doubling batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around your yard\nAnd parents loved links live feed auction electric checking from anywhere using your blink smartphone app\nSo you know when your kids get home from school\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon got on a limited time off our terms and conditions applied\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut if rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only about on certain three year fixed rate loan scholar crossing permission and conditions people having liquor license and all the states and unless number three three additional conditions are solutions may apply [noise]\nNobody covers the auto industry like W. W. J. ...\nTime auto beat reporter Jeff Gilbert following it can just read about more than cars and trucks it's about new technologies job most of all people you'll hear breaking auto news plus there in depth coverage with my daily car chronicled suppliers spotlight features\nPlease download my tales from the auto be podcast WW Jane radio dot com [noise]\nW. W. J. news time five twenty five sign for business suburban Cadillac of Troy business desk sponsored by the suburban collection big rally today Jeff Ballenger with our Bloomberg Business for for the\nStreet had its best day in months the Dow Jones industrial rose five hundred forty eight points or to point to present to twenty five thousand seven Ninety eight\nThe NASDAQ closed two hundred Fifteen points or two point nine percent higher the S. and P. five hundred added fifty nine points or to point two percent after the market's close Netflix posted a third quarter profit the top Wall Street estimates the streaming video providers revenue matched forecasts Johnson ...\nThere are more upbeat and industry groups measure of home builder confidence increased this month\nThat was a surprise to economists the pickup and sentiments suggest the market for newly built homes may be regaining some steam crude oil futures closed at Seventy one Ninety two a barrel I'm Jeff village or with Bloomberg Business report on W. W. J. news radio nine fifty\nSocks of local interest courtesy of plant Moran wealth management American Axle today closing at sixteen twenty five a to point sixty five percent board water thirty eight twenty nine of more than one percent\nAnd comb Erica closing it eighty three Ninety with a gain of thirty six cents trafficking weather coming up next\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlinks camera systems are back in stock and right now there are Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio is on Amazon company limited time offered terms and conditions of\nWhat he is every time you went out you can cash in the capital of the for ... for cash back on dining and entertainment light in their first have to walk them all\nAnd for for cash back when you take your kids to the museum for the first time what would it [laughter] [noise]\nNo matter your reason for going out now you have formal are introducing new Cedric hearts and capital on four percent on dining and four percent on anything let's say you're well in terms of my capital one bank usa NA\nUsed on five twenty seven find timeless jewelry it fabulous prices at Maloof jewelry and gifts on harbor in St Clair shores\nW. W. J. new signed up five forty eight side for trafficking whether together every ten minutes on the AIDS Katie problem on metro\nParkway yes in Clinton township we've got natural parkway west bound closed now this is going to be closed until further notice so it's much properly westbound clothes\nFrom union like to harbor due to a crash and we've got an accident on the south feel free way south on slow me down and said schoolcraft on your right shoulder and looking through the ... you're a slower from before eight mile road\nIn Port Huron an accident on I Ninety four west bound right at the bridge to Canada it's on your left shoulder slowing down and in the ... township a crash has closed\nA slowing down in Detroit Davis an avid ... got a wreck this locking your right lane and tips are gym called that and\nAnd they couldn't challenge of this is really going to slow you down for your ride home lifts your neighborhood and Clinton township Metra parkway westbound closed from union like to Harper until further notice due to a crash\nNow traffic's already backed up to I had before and as this logo on the night before a ramp to natural parkway\nBird stone engineer drive car tires take a puncture and keep running fifty miles after a flat with Dr car tires you can get to safety on a flat instead of being stranded on the side of the road so rest easy in birds don't tires drive a car tires give you peace on the road in the adult downloaded there twenty four hour traffic center ... devil detainees radio not fifty\nAnd the accuweather forecast now the update and meteorologist Bryan Thompson what's ahead Brian\nWell most of the clear sky early then clouds will increase late fulfilled lower around forty four tomorrow blustery in Chile there was some sunshine in a high close to fifty as it gets to tomorrow night's will be clear and cold the windows die down some but as it does so it's a lot subject really drop are expecting a widespread for use the low near thirty downtown and many suburbs into the twenties\nThursday a sunny day and all that windy so I don't think I'll feel too bad um son with the highest fifty won't even notice going to be a pretty chilly day mix clouds on friday with a stray shower or to a higher fifty five and for Saturday Briscoe times the clouds son will be a couple of quick showers around\nFifty seven at Detroit metro your station for traffic and whether together every ten minutes on the apes around the clock coming up on news radio nine fifty this judge is giving a family more time to keep their child on life support that's next\n\nAll across the country people coming together to speed up what we can learn about helps\nThe all of this research program he's calling on one million people to join as we try to change the future of\nFuture generations\nThis joint fall in love his dog and find out how you can become one [noise]\nWendy what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlinked cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nAgain whether together on the eighth and breaking news first came up to date on the road\nNews radio nine fifty W. W. W.\nW. J. news time five forty one\nA Texas judge giving a family more time to find a hospital that will keep their daughter on life support the cook Children's Medical center in Fort Worth says Peyton summonses brain dead with no chance of recovery who's a reporter Andrew Greenstein\nThe parents of nine year old Peyton summons have been trying to find a new facility to care for her and attorney Justin more says they're making headway\nWe're getting multiple calls every day from the facilities we get a lot from in state and we get a whole lot from out of state\nPeyton has been a cook Children's Medical center in Fort Worth since going into cardiac arrest on September twenty fifth\nThe hospitals attorney Greg blaze argued that the temporary restraining order should not have been extended sometimes most more civil thing a court can do is applied to clear law to declare facts the case once again this didn't happen Andrew Greenstein for CBS News Fort Worth\nEducation today on W. W. J. sponsored by Oakland University\nHospitals are encouraging nurses with an associate degree to get their bachelor's degree hoping university professor Kimberly ... is with the university nursing program and they're putting Pacific time frame\nOn that so they're actually having them sign contracts saying that within four to five years or whatever the health care facility has mandated that they complete that they enroll in complete their BSN within a certain timeframe\nProfessor Hogan says the dry is better pay in some cases and leadership roles Laura by now W. W. J. news radio nine fifty\nPlenty every time you went out you can catch you know the capital in the required reading for cash back on dining entertainment like celebrating\nWhen you and your crew or courtside during the time [noise]\nWendy what a spot that burglar when he's case in your home or after they had asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blinked video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions apply\nEvery time you went out you can cash you know the capital in secret coyote for cash back on dining entertainment like celebrating ever use if you get\nWhen you when you recruit report finding who for [noise]\nFor going out you have far more introducing new favorite card from Capitol Hill and for for ... for every time you can send your while in terms of life capital one bank usa in a\n[noise]\nSome of your time is five forty five it is time for sports and Ryan well we've got some American League playoff baseball here takes us back to the years when the for about ten years the tigers were actually in the postseason twenty four team or just remember I was not so hot\nYeah I was just yeah telling you that I saw a tweet about an hour ago that said that on this date back in two thousand fourteen the starting line up as a rotation was put for the tigers and it was just in Berlin or\nDavid Price in ... yeah and they didn't want to say whether it's the last of the Orioles and of course Orioles went on to lose the royals but it just makes you think about what was and what got away and hear the tigers are like all the rest of us watching American League championship baseball the right now it's pretty good game at the Houston Astros in the Boston Red Sox\nOf course that series tired of the game of peace right now the red socks on top two to one at the end of one game for the national league championship series gets underway tonight from LA the Dodgers looking even that series up a two games apiece for the brewers ... gets to call gets rich ... first pitch at nine o nine\nMichigan State I coach mark Antonio also spoke today he admitted despite the team's upset one over Penn State on the road it's not going to get any easier this week at home as Michigan comes to town and says it's pretty clear what will take to win this one\nWhere you can make mistakes on either side of the ball really you can't give up the easy ones little coverage or or or a gaffe and then also you know you can't turn the ball over I think this is huge you know traditionally the team this rush for the most shortage of is usually won the game you know that's probably true in most cases\nAntonio also asked today to talk about the rivalry with the ... and really when it became personal for him\nIn any rivalry situation I remember playing her first game and you know as is South Carolina fleeting glimpse and you know and there's a big game down their huge game and everybody talks about it and told you about it he really didn't know what to expect when you play that game for the first time you understood at the fact\nThat I think that's the same thing here uh you sort of understand after the fact so after the Ninety five game I understood and um and then I just sort of brought it forward\nAnd Michigan State has won eight of the last ten in the series though Michigan last one came ... stadium just two years ago and the NBA regular season officially tipping off tonight the pistons\nWendy what a spot that burglar when he was chasing your home or after he's been asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using bling smartphone app so you know when your kids get home from school they'll contracts you know subscriptions totally affordable and blink works with Alexa\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nYou've done five forty eight for trafficking whether together on the AIDS jak the roads Katie problems on I ...\nWell I have good news bad news I'll start with the bad news I noted for west on a middle dog got a racket and your left shoulder and looked into the ... dam camps not much of a delay though you are slower from after ... traffic is sponsored by free star financial credit union I noted for west on after Addison good news that accident has been cleared\nAccuweather forecast and Bryan Thompson says Chile increasing amounts of cloud shower can't be ruled out tonight low forty blustery cold or tomorrow with a high forty five fifty is fifty seven metro\nWatch never style sneezes rodeo nine fifty to older you get anything\nI'm Greg Coleman top stories that President Trump says he'll get to the bottom of the disappearance of Brazil murder of a Saudi journalist if they know about it that would be bad CBS News with alive report developing news a two year old child hospitalized following a serious question McKown Cody we'll have details also ahead\nOf former Detroit city council member due in court today as she fights to hold on to her job as a school administrator I'm Vicky Thomas Ryan William Fifteen as you said of course marked in Sony oh talk today about Saturday's robbery game with Michigan on you know what he had to say coming up in sports\nIt's a law [noise]\nCBS News on the hour sponsored by del small business\nI'm Pam Coulter after a series of meetings with Saudi officials secretary of state Mike Pompeo said there's a serious commitment to pinpoint and get counted delivery for what happened to us resident in Washington Post columnist your ...\nIn the Saudi diplomatic facility in Istanbul CBS is Stephen ... has more\nWe're all looking at it together but the president tells function Business Network it matters to him whether the Saudi king or his son the crown prince knew about the disappearance of democracy hoagie\nBefore it happened if they know about it that would be bad while the president tweets that answers are forthcoming he for now reiterate said denial from crown prince Mohammed bin Salman of any knowledge of ... disappearance having spent the day in Riyadh secretary of state Mike Pompeo has next to stumble aiming to learn more\nSteven port noise CBS News the White House\nSaid president Mike Pence saw peak can trees toppled by hurricane Michael during a visit to an orchard in Bainbridge, Georgia he had knowledge growers need help I just want to\nAssure you that um [noise] we get it uh we need to do more\nState agricultural officials say it takes up the country seven years to produce nuts\nIn Austin, Texas fire officials have temporarily banned all boating along the city's water ways because of dangerous conditions caused by heavy rains K. J. C. E. radios Casey Johnson says evacuations were ordered for people who live near the overflowing lotto river\nThey're seen some of the worst flooding they've seen an about eighty years Nineteen thirty five actually was the last time the land a river rose to these levels\nAfter four days of criticism the interim head of USA Gymnastics is out\nDays after she was hired former congresswoman Mary Bono is out as the interim head of USA Gymnastics\nIt was hoped that photos hiring would bring some stability to the organization still reeling from the Larry Nassar scandal instead some of the top us gymnasts attack bono Simone Biles was critical of between by bono attacking Nike another high profile gymnast alley Raisman ...\nAnd this ... bono Simone Biles was critical of a tweet by bono attacking Nike another high profile gymnasts Aly Raisman complained that bono once worked at a law firm alleged to have helped USA Gymnastics cover up the Nassar scandal Steve Feldman CBS News\nThe Justice Department changed Fifteen indictments had been filed against members of one of Mexico's largest drug cartels attorney general Jeff Sessions made the announcement\nDie we're announcing a whole of government effort against C. J. N. G. we're hitting them from all sides and with every weapon we have\nThe Dow was almost five hundred and fifty points today NASDAQ got two fourteen this uh CBS News\n[noise] washed never stops on Detroit's number one\nForty nine fifty to only going to be a\nGood evening thanks for joining us on Tuesday October the sixteenth\nI'm Greg Bowman for W. W. J. news radio nine fifty broke Allen is off today well the chilly weather is not going anywhere anytime soon if I go to get even colder by tomorrow night time the details that could lead occupy the forecast coming up not a bad fall afternoon though today sunshine fifty\nSix degrees that would metro trafficking whether ... W W J news time six oh three\nDeveloping news this evening a child seriously hurt in a crash in ... county involving five vehicles it started on West I'm twenty three mile road east of card and become township\nThe sheriff's department says vehicle wasn't able to stop inside when traffic slowdown it rear ended another car causing a chain reaction then spun off into the east bound lanes where it was T bone\nThere were several minor injuries two year old taken to a local hospital but then transferred to children's in Detroit where that child now in serious condition\nA scary situation for drivers along I Seventy five in Madison heights this afternoon when a road worker accidentally snack power lines causing them to come down on the freeway Michigan State police first lieutenant Mike Shaw says it happen they're Thirteen mile road those\nPower lines also fell on a couple of vehicles are actually driving up and down the lanes troopers were able to close the freeway down and start to exit traffic off at both fourteen mile and twelve mile road as they went along the tea energy was contacted they came out major did lines were dead they weren't they weren't live\nLines were pulled off the freeway which is sense reopened and no one was injured radio host Mike Clark of the legendary drew in my show has died family says he passed away in the middle of the night no word on a cause Trudy Daniels worked on the show with Mike for years and says his death was unexpected\nNo one expected it terribly shocking all lately blindsided and his legacy funny guy\nOn a show you know he may never expected to be on that list is actually you know I relate it typical in radio person that you're hearing the voice and dramatic great storyteller\nDaniel says she had a great time with my during their twenty three years together his family asking for privacy at this time\nIt's a new update to a story we've been following on W. W. J. could be some time before the bodies of those eleven infants found in the old ... funeral home on Detroit's east side or identified Wayne County medical examiner's office says the remains are in mummified conditions forcing them to rely on records\nBecause the body's already made it through a funeral home there should be information available chief medical examiner Dr Carl Schmidt says the entire process could take months\nMeantime that funeral home is also now facing a million dollar lawsuit W. W. J. news radio nine fifty sorrow Hoover as the story\nThe lawsuit was filed by events\nThat funeral home is also facing a million dollar lawsuit W. W. J. newsworthy fifties or who worked as the story\nThe lawsuit was filed by eve Vince ... on behalf of Kathleen Bonner she claimed that she went to ... funeral home to set up services for her husband who passed away\nThe funeral was scheduled for January twenty three days later two weeks after they got a whole of the body controls pulled Bonner her husband's body was unfair for an open casket funeral\nShe says they refused to let her see him and convinced her to let them cremate her husband after reading reports that can't troll was improperly storing body than non refrigerated areas of the home Bonner now believe that her husband's remains\nWere not handled correctly and questions what really happened can't troll by the way under investigation after the bodies of ten fetuses and one child were found hidden inside\nThe her Hoover W. B. J. news radio nine fifty\nA judge giving both sides more time to work out a deal and a dispute involving a charter school and a former Detroit city councilwoman W. W. J. city beat reporter Vicki Thomas has more on the story ...\nFor sharing MacPhail in that conservator for Detroit community schools given two weeks by judge correct strong to try and work out a deal MacPhail fire for allegedly not being certified for her attorneys say she is certified Marion Kramer with Michigan welfare rights among the MacPhail supporters in the courtroom\nIs Lewis Lewis says then a a a lot of schools has gone up against even Cass Tech and beat cats and things so you know I wanted to really [noise] what is this a mouse\nSylvia or donor another supporter says there's a lot of interest in the right more community and a developer may want to turn that school into something else the Thomas W. W. J. news radio nine fifty\nW. W. J. news time six oh wait it's time for trafficking whether together every ten minutes on the AIDS from the idol dumb motor group traffic center brought you this hour fine Motor City many and Katie or what are we looking at this hour\nGreg's we've got to crash on I Ninety four west found that middle ... is on your left shoulder looking through the ... hour slower from\nEaster in Detroit Davison avenue was founded lodge freeway Iraqis luckier right lane and tips the gym called that and\nNow in Clinton township metro parkway westbound closed from union like road to Harper and this is going to be closed until further notice\nTraffic is heavy for my Ninety four also us logo on the Ninety four ramp to metro parkway and we've got some traffic lights law that are not working ... down on Davis an avenue east of Lin wood in Detroit and they're right there there's got some they have these a temporary stop signs\nIn place and heads up south on I Seventy five from and fifty nine to square like road road works in a black two lanes\nAnd that starts at nine tonight until five am tomorrow morning see a problem on the road gives calling the W. W. J. tips are lining up to forty four to three six W. W. J. in the adult that motivated twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nAnd weather is sponsored by higher Dunn dot com or the accuweather forecast and meteorologist Bryan Thompson\nDown and talk lots of casually interest when you're done with Eugene news time\nThey said it's time for trafficking whether together on the AIDS and the Katie it probably Ninety six yes first of all traffic is sponsored by the I. V. E. W. I. Ninety six\nThe Jeffries was found express after and thirty nine to Southfield freeway an accident on your left shoulder got a reporter crash on the Southfield freeway north on its after Michigan avenue is fucking you're right and I am in tips are Linda called that in in Detroit Davis an avenue west on after the lodge Iraqis locking your life\nIs blocking year right lane and Clinton township ... closed from union like road\nTo Harper and this is going to be until further notice due to an earlier crash traffic is very heavy for my Ninety four and he got his logo on the I Ninety four ramp\nTo a metro parkway and now it's time for the electrical workers local fifty eight construction alert it's a slow go in Bloomfield township telegraph north and south on maple road roadwork blocks to rewrite the to write lanes each way now this is going to go until midnight on friday\nPut the expertise and skill of an I. B. E. W. electrician and neat guy\nSignatory contractors to work for your commercial public industry or residential construction project learn more empowering Michigan future dot com the best of contractors the best electricians period in the ... twenty four hours\nTomorrow we'll blustery and chilly day with some ... high around fifty so bit cooler than today clear and cold tomorrow night with less when dental widespread freeze on their thirty downtown and will drop all the twenties though in the suburbs\nPlenty of sunshine Thursday high fifty one makes clubs in sun on friday with a stray shower two hundred fifty five and then for Saturday a brisk day with more clouds and signed a couple of showers I Saturday fifty three not accurate the meteorologist Bryan Thompson on WWE ...\nGot sunshine and fifty five degrees in Ann Arbor this hour setting and fifty two at city airport sunny fifty six at Detroit metro\nLet's start Comedy Central's the Daily Show Trevor Noah is Becky is bringing is loud and clear two or twenty Nineteen the Fox theater friday April twenty six get tickets friday at ten am at the Fox theater box office and ticket master\nNews radio nine fifty to a\nCity thing I'm ... years what's happening is six Twenty one [noise] this just in USA Gymnastics Andrew I'm President Mary photo has just resign just four days after being appointed she came under fire for posting a tweet that insinuate if she was upset with Nike over his choice to feature football\nPlayer Colin Kaepernick and it's just do it campaign the organization still reeling from the former Dr Larry Nassar scandal more the bottom of the our\nSecretary of state Mike Pompeo visited Saudi Arabia today to meet with king Solomon about missing journalist ... both President Trump and vice president Mike Pence say if he was murdered those who did it should be held accountable the very latest in a live update from CBS News at six thirty one\nBest vehicles at twenty Eighteen being put to the test today W. W. J. ought to be reporter Jeff Gilbert one of the judges for North American car truck and utility of the year [noise]\nThis Toyota around for that um tooling around the Washington are counting countryside and is one of the semi finalist for North American utility of the year along the other semi finalists or the Lincoln novelists\nAnd the jeep wrangler there also a number of vehicles off for truck and for ... for the year we'll narrow this down to a list of three finalists\nThat will be announced at the LA auto show and then to start the north American International auto show in January the final announcement will be made on who will be the north American car\nTruck and utility of the year here in Washington on county I'm Jeff ... W W J ...\nW W J news time is six twenty two\nDriverless cars early tests find right now some of them may be no better than we are I'm already filled in with a ... report on W. W. J. news radio nine fifty\nThe insurance Institute for highway safety has been analyzing autonomous car crashes with special emphasis on the deadly ones\nThey want to see what's going on two themes emerge you know how you have to pay extra attention when you're driving in the road splits sometimes it can be confusing well some of the driverless cars get confused too when they go off the road\nThe other thing when people use semi driverless cars they often forget that they have to be on alert no distractions no phone texting sometimes drivers become so relax when the car drives itself\nThat they don't pay attention and so when they're needed they don't step in summertime them as engineers have actually had that problem too\nWhen do we start to realize and care about how people view us at age to according to new research from Emory University earlier was believe we didn't have those feelings into we were four or five but now we learn at two years old we can have our feelings hurt too with the film and report I'm Marie Feldman W. W. J. news radio nine fifty\n[noise]\nThe twelve kids they give away on WWE\nThe rebuilding W. W. J. news radio nine fifty\n[noise]\nIt's the twelfth they give away on W. W. J. news radio nine fifty this our keyword is treat tax there were three T. R. E. A. T. to seven to eight one your chance to win one thousand dollars message in data rates supply remember don't text and drive\nG D G the R B L and deadly it'd be there and if you don't you think that these kinds of attacks they're fine because the links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five\nSeconds I'm traveling at fifty five miles an hour that's enough time to tell the links football fields making decisions don't take ...\nDoes it stop tax ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nWendy what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied Eugene used\nSix twenty five time for business suburban Cadillac of Troy business desk sponsored by suburban collection and Jeff Ballenger as a loon bird business report\nStocks rebounded from their recent sell law federal is said corporate earnings provided a respite craven geopolitics each of the key indexes gained more than two percent\nThe NASDAQ Sudan's was closer to three percent the Dow Jones industrial rose five hundred forty eight points to twenty five thousand seven Ninety eight than as that closed two hundred Fifteen points higher the S. and P. five hundred added fifty nine might cry on WBFO financial services says investors are being realistic\nOne of the things that does give us some covered years the fact that we don't see the kind of you for the position we don't see people who are significantly overweight and we do see kind of a sober view for how growth will play out\nRyan says investors are taking fed rate hikes and the trade frictions into account\nTotal industrial production increased three ten to ... percent last month the fed report shows the factory output expanded for a fourth month in a row crude oil futures hedge tier two Seventy one dollars and Ninety two cents a barrel I'm Jeff ... with Bloomberg Business report on W. W. J. news radio nine fifty\nAnd you know an ad from dad save money on car insurance when you bundle home an auto with\nProgressive yeah to another way to save money don't find those are expensive coffees every morning and then you can save up for a I don't know really nice dress shirt just saying it's great that you feel comfortable here at work but you know an adult walking\nProgressive cats from becoming your parents but we can see if you money when you go home and progressive casually insurance company affiliates other insurers just coming off a little stricter situation\nConsumers energy invite you to check out our small business marketplace the energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers save on smart thermostat they'll leave evolves\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat deli the bombs by ... and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nStocks of local interest sponsored by plant Moran wealth management General Motors today closing thirty to thirty four up twenty two cents the at Chrysler at sixteen eighty four sixty two cents deliver corporation and one thirty four fifty up Seventy six cents traffic and whether it emitted\nWendy what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions of life\nYou're Wu ... says hey trafficking whether together every ten minutes on the AIDS and the Katie problem on I Ninety six\nAt Jeffrey's west on express lanes right after and thirty nine to Southfield freeway got Iraq on your left shoulder\nLooking to the ... not much of a delay behind it tried to get sponsored by Michigan schools and government credit union on the south feel free way north down after Michigan avenue reported crashes locking your right lane you are heavier from before Michigan avenue\nAlso on the Southfield freeway north on after Michigan avenue and this one is a slowing you back to just have asked her I Ninety four now and Clinton township\nGot a big slow down that's a perfectly west on is closed\nFrom union like to Harper this is going to end until further notice now traffic is a very heavy for my dad before and it's a slow go on the metaphor ramp to metro parkway and granted north on Mount Eliot in Detroit got an accident partially blocking that intersection tips there's called in on that\nMichigan schools and government credit union offer some of the best CD rates you'll find with as little as five hundred open at twenty three month CD and start earning two point seven annual percentage yield\n... visit an S. G. CU that or to get started in the adult downloaded there twenty four hour traffic center ... devil DJ news radio nine fifty\nDriving and whether sponsored by Ben Johnson law Bryan Thompson as our accuweather forecast\nTonight will be mainly clear early then called will be on the increase lay low tonight around forty a blustery and surely day tomorrow with some sunshine after we got well in the fifties today will struggle to get to fifty tomorrow\nAnd with the wind it's going to feel colder than that clear in cold tomorrow night the window die down and there will be a widespread freeze so Lowe's and the twenties and most suburbs near thirty downtown\nPlenty of sunshine Thursday hundred fifty one mix of clouds in sun on friday a stray shower it's around but most of the time will be arraigned free ironic fifty five and brisk on Saturday with signs of ... there will be a couple of showers I Saturday fifty three I'm active other meteorologists Bryan Thompson on WWE ... nine\nFifty and the current conditions in Ann Arbor right now still seeing some ... uh sunshine and fifty five degrees it's fifty two at city airport and fifty six at Detroit metro if you're a car crash victim you deserve a fighting chance to get your life back on track Ben Johnson law will fight tirelessly to get the justice you deserve\nCall one eight five five van fights today but a champion in your corner\nComing up on news radio nine fifty here's a here's a happy question to ponder what would you do with an extra six hundred sixty seven million dollars will examine that now\nJay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans\nWendy what a spot that burglar when he's case in your home or after they had asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions applied\nAgain whether together on the eighth and breaking news came up to date on the road\nNews radio nine fifty W. W. W.\nW. J. news time six forty two so what would you do with six hundred sixty seven million dollars it could be yours or what's left of it after taxes if you play tonight's mega millions WW Jay's John Yoo it out and about talking to people he joins us live and local with more John I wouldn't\nBe sticking around to talk to you Greg I must be honest with say of taking off that six hundred sixty seven million dollar jackpot could even grow tonight it's already the third largest mega millions drawing ever died from Southfield is all in\nI can do some stuff with that you know what would you do\nA fix my car get a new house for my mom\nNow wouldn't you just buy a new car\nAnd that's an idea and I did my dad cargo I inherited it I'd love to keep it going got some sentimental value it does you know the odds are I don't want to burst your bubble but you know they're\nA hundred percent one right\nConfidence I like it those odds by the way are actually one and three hundred to ... million\nBut with this kind of money on the line like they say you can't win if you don't play and if you're curious the cash payout tonight will be three hundred eighty million dollars to the drawing at eleven will of course have the numbers you're on a news radio nine fifty are probably live and local in Southfield John ... W W J news radio nine fifty hundred\nMillion to one John So you're saying we got a chance a small change yes we do not much but we do All right W. W. J. news times six forty four sports is now I\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loan software cost information and conditions equalizing Leonard licensing office he takes animal is number three thirty initial conditions are solutions may play\nWhere do you every time you went out you could cashing where we'd the capital in the ... or ... percent cash back on dining in entertainment like learning more about each other when you first date you pay the mortgage covering can't hit the high notes that your favorite comedian to buy\nNo matter your reason for going out or you have four more intriguing in New haven cartoon capital for procedural mining and for for the time and you can like in your life terms apply capital one bank usa in a\nThe market's closed higher today without\nFive hundred will get the latest from the Bloomberg Business for four six forty five for sports\nIn LA Dodgers looking even up to a series of two games apiece with the brewers ... will get the call he'll go up against ... first pitch is at nine nine on the back yard ... take place this Saturday in East Lansing Michigan State it said to play host Michigan that coach marked Antonio admits they've got a big challenge in front of them as Michigan very talented team\nCan you look at them I think if you look at them defensively lotta starters back into line backers\nFactors start a tire secondary you know really three out of their top four four guys up front I'm playing very well in the defense side of obviously a lot of pressure\nAnd they should I figure past defense various various other things to the Big Ten uh officially quarterbacks playing well front of the football successfully big play office and a lot of respects so a very well coach football team and of ... will be challenged as as always\nKick off of that game set for noon yeah of course can hear it right here on W. J. it will come your way at twelve o'clock when our pre game coverage will start at nine AM now the XFL of course getting closer to announcing their teams is falling today commissioner Oliver lock announce that their jerseys will not\nHave player nicknames on the back of the first go around and they will not try to resurrect original team names or identities from the inaugural season and the NBA regular season officially opening tonight Celtics bringing in the Seventy Sixers the warriors are playing hosted the thunder the pistons will hit the floor tomorrow down a little Caesar's arena safely hosted the Brooklyn nuts\nWith sports Fifteen and forty five passed each hour I'm Ryan woolly WCW chain news radio nine fifty thanks rivals check out the drive with traffic and whether the minute I\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to double A. batteries last up to two years brand technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around your yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app so you know when your kids get home from school\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time off or terms and conditions applied\nWhat every time you went out you can cash you know we the capital in the required ... for cash back on dining and entertainment light and their first have to walk them all\nAnd for for cash back when you take your kids getting museum for the first green [laughter] [noise]\nNo matter your reason for going out or you have formal are introducing new card from capital of the ... and four percent I mean we can ... terms of my capital one bank usa in a\nFire fighter I felt for a firehouse subs introducing new firehouse pub steaks up with savory steak crispy fried onions in our rich Belgian beers cheese sauce on fat for limited time more to yours firehouse subs dot com remember fortunate every sub you buy help provide lifesaving equipment first response", "year": "2018", "show_name": "Greg Bowman", "city": "Detroit", "day": "16"}