{"month": "10", "state": "MI", "station": "WWJ", "content": "Watch members to use radio nine fifty for you to all the\nGood afternoon I'm Jackie page and these are the top stories ahead with ... at least two people are dead as hurricane Michael's hairs through Florida and Georgia\nThe big problem with this hurricane was a tremendous power for chili or is very fast\nCBS News with the very latest it next to a local priest removed from any public ministry over credible sexual assault allegations will have the details but first new at this hour more convictions as the last of the rape kits neglected in Detroit are tests that\nWe have almost eight hundred and Seventy identified serial rapist\nWe'll check for the two Fifteen with Ryan woolly your money coming up to twenty five again seeing a down day on the Dow as it sound one hundred and Seventy points and now the CBS News at two o'clock\nDot com station [noise]\nThe news on the hour presented by CBS is Murphy Brown\nI'm Jim ... be what's left of hurricane Michael is a fast moving tropical storm with fifty mile per hour Sistine wins centered over the north Carolina South Carolina border and behind it a path of destruction from wind and wet corresponded Omar be Frank as in the Florida Panhandle\nAfter the I Will pass the port saint Joe ... who wrote out the storm emerged to find the town shredded by the hurricane [noise]\nBoats were pushed on shore tree sap in half by voting hundred and fifty five miles per hour winds [noise]\nPower lines hung over rows of cars were crunch together by up to eight feet of storm surge cash\nFor those who do the evacuated some advice from governor Rick Scott do not try to travel home to a coastal county that was the path of hurricane Michael or it's not safe might not be possible dream be we'll get there and you can get in a way of law enforcement and rescue workers or from CBS is Nicole Killian\nThan our has said that he plans to make at least getting power back on top priority and\nWe know that their son Nineteen thousand at personnel that have been staged a in advance of all that and now some of the crews are starting rolling we did see a couple of power cuts that were also hair throughout the day you know so it's going to take time uh and if people are kind of prepared for that at\nLeast two deaths have been confirmed NASA and the Russian space agency agree on one thing it was the best possible outcome next to a successful flight because the crew survived of Russian and so a huge castle was forced to make a high speed returned worth average booster rocket failed this morning I assessed operations manager Kenny taught\nOur Russian colleagues do typically when they have a failure like this they will stand up what's called a commission and we expect it to be formed very soon which will be passed with trying to understand exactly what happened and what a recovery efforts are needed in order to get flying again\nA judge in New York has with no objection from prosecutors dismissed one of the six criminal charges against former movie producer Harvey Weinstein charges related to sexual allegations made by Lucy a Evans salt in two thousand for her attorney Carrie Goldberg\nHey thrill away his plane but this has nothing I've outlined in a sense\nThat reflects on this\nAllegation that she was sexually assaulted\nHardy wine or cost\nOf living raise where people on Social Security CBS is Wendy Gillette\nAbout Seventy million recipients of Social Security and other retirees will start seeing higher monthly checks and I'm thirty nine dollars extra thanks to rising inflation this is the highest increase in seven years\nThe Dow is down one eighty three this is CBS News tonight on CBS catch new episodes of the big bang theory and young Sheldon followed by a new mom and Candice Bergen Murphy Brown vantage a new episode of swat tonight on CBS\n[noise] wash and never saw on Detroit's number one\nForty nine fifty holding and holding on to be a\nGood afternoon and thanks for joining us a Thursday it's October the eleventh I'm Greg building\nAnd I broke out or W W J news radio nine Fifteen\nFeeling like October out there well because the breeze with clouds and some sunshine high temperatures in the upper fifty two around sixty the complete accuweather forecast is coming up\nRight now partly cloudy fifty degrees at Detroit metro airport W. W. J. news time ... three\nNews authorities in Monroe investigating after a body was found inside us\nThe sucking car to Corey it appears to have been there for a long period of time few details are available but we know it was the body of a man the Monroe news reports a scuba diver made that discovery and alerted police an autopsy is planned\nKnew this afternoon the Wayne County prosecutor's office is now getting results from the last of the eleven thousand rape kits tested after decades of neglect W. W. J. news radio fifty sander but Neal reports\nIt has been nearly ten year long fight broke for Wayne County prosecutor Kim worthy to find the money to have the more than ... eleven thousand rape kits that were discovered a decade ago and the Detroit police storage facility or the says all the kids have now been tested\nOr like his numbers are we have over a hundred and forty five convictions we have almost eight hundred and Seventy identified serial rapist what kind of close to crime scenes and forty other states\nWhere they says she's awaiting the retesting result of the final six hundred in Nineteen cats the Michigan women's foundation raised over seven hundred and fifty thousand dollars in private donations to help fund the testing of the kids are pretty much see Andrew McNeill W. W. J. and he's ready and I'm fifty\nParishioners in disbelief after the archdiocese of Detroit and I also retired priest has been removed from public ministry over allegations of abuse officials say the sexual assault claims against Robert would cow ski involving minors from decades ago are credible\nI was a caretaker you know like cleaning maintenance so it was a great guy great guy he was very number one priest in the world\nOther parishioners at St Augustine in war and say they will pray for would cost to the announcement comes after state investigators requested records from the dioceses last week as part of their priest investigation\nOf le shooting on Detroit's east side leaves one Matt hospitalized today officials say an off duty officers song man point a gun\nTo a woman's head in the war in ... neighborhood and when the man refused to put their going down the officer open fire the officer was not injured while the man who was shot was driven to the hospital by the same woman being threatened the man's current condition is not known at this time\nMeantime a state police Joplin is recovering after being hurt while trying to help her man was walking in the middle of a Detroit freeway\nTroopers got a number of calls overnight about the way we're pedestrian in the middle of West but I Do these six near Warren avenue when they tried to talk to the man who started fighting with troopers Chaplin riding along the metro south post took some minor cuts in the ... before the man was taken into custody\nW. W. J. news time two oh six new this afternoon more construction barrels are headed for I Seventy five in Oakland County work is scheduled to begin Monday on both directions I Seventy five between thirty mile and Coolidge\nCrews will light in the freeway shoulders which will mean lane closures for the next two months and look for a traffic chef's next year putting all vehicles on the south side of I Seventy five\nThe two year project to also includes bridge replacements and other modern upgrades\nW. W. J. news time two oh six welcome betting the opioid epidemic it's the first of its kind in the state of Michigan referred\nTo as an opioid health home\nTo recovery program if then launched in a Twenty one county read it in northern Michigan\n... with the Michigan department of health and Human Services it's\nDesigned to help individuals on Medicaid fight the their opioid addiction who are who are dealing with substance use disorder\nHelping them by coordinating services coupled with comprehensive care management the Twenty one northern most counties in Michigan lower peninsula which this program serves have the highest per capita of Medicaid beneficiaries with opioid use disorder\nJason Scott's W. W. J. news radio nine fifty W. W. J. news type\nW J news time to oh seven [noise]\nAnd you have another chance to be rich with tomorrow night's mega millions jackpot standing at five hundred forty eight million dollars\nIn fact no one has claimed the grand price in early July Saturdays Powerball still in touch with all afternoon and had to win a number of last night's drawn now worth three hundred fourteen million dollars to classic lotto players in the ... township and the bay city area will split the nine point two million dollar jackpot after last night's draw\nAnd until now no one had won the big prize in classical idle since may twenty\nW. W. J. news time used to always\nIt's time for trafficking whether together every ten minutes on the age from the ... group traffic setter brought you this hour by BMW of Rochester hills\nAnd tasty McCaskill what's going on right now\nWe're watching a number of slow down here broken Greg will start with accident is going there for hours it's closed all lanes along with on Chicago with the Van Dyke and war and\nNow we also have no traffic lights working at Northwestern highway a twelve miles certainly when I moved through with extreme caution for those areas of the four way stop east on six Ninety six that I Seventy five the right shoulder blocked by an accident better news along east on I\n... the right shoulder clear to have an accident but we still have a long time I met before after Michigan avenue an accident working through that stretch and some slow down for work down here north on us twenty three near grand blanc with the right lane is blocked now you see something on the drive we should know about all this on the traffic gets their line to for aid for two three\nSix W. W. J. from the motor group twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty\nNow the accuweather forecast from the family heating cooling and electrical weather center with meteorologist aid Samuel\nWill feel breezy and cool out there this afternoon with clowns in some sunshine you're high temperature anywhere from fifty six and a few northern suburbs who around sixty in downtown Detroit will have clearing tonight at will remain breezy and the little chillier there well below forty one of the city\nColder with thirties and some suburbs for tomorrow partly sunny with a high a fifty three degrees and we'll continue our October like whether through Saturday with a high again and the loaded mid fifties Sunday mostly cloudy with a high fifty it could be a shower late in the day otherwise Monday\nMostly cloudy and cool with a high only near fifty this was accuweather meteorologist Dave Samuel L. W. W. J. news radio night fifty\nAnd the current conditions in Ann Arbor right now cloudy skies and fifty three degrees it's fifty eight at city airport fifty eight degrees AT Metro\nNews radio nine fifty to afternoon I'm\n... and I'm broke Allen our top stories that you twenty good news about the eleven thousand untested rape kits found collecting data centers south and in Detroit police storage facility Wayne County prosecutor Kim worthy says they've now all been tested and nearly eight hundred Seventy serial rapists had been identified\nNow it's the cleanup [noise]\nFlorida's panhandle is huge disaster zone after hurricane Michael roared through the region springing catastrophic wins heavy rain and devastating storm\nSurge at least two were killed thousands of homes and businesses still without electricity very latest didn't alive update from CBS News at two thirty one\nMcKown county getting three hundred sixteen thousand dollar federal grant or prepare against school threats in other emergencies more details now from WW Jane is ready and I said he's wrong doing\nThe emergency management director for the county Vicki ... W W J the new personnel will work with police fire and schools aren't all types of emergencies\nSo in addition to the active assailant events that are now a prevalent at least and on everyone's mind we're also going to be doing planning with them for tornadoes or floods or chemical cells that can happen at the schools\nThe grant also educate students and parents are these efforts to make them more aware than alarmed run Dewey W. W. J. news radio nine fifty W. W. J. news time to twenty two it's time for what's hot around town on\nThe Jay's refer to just seen of liquid tight around town to Detroit symphony\nOrchestras paying tribute to Motown this weekend the cancer called dancing in the streets tomorrow morning at ten forty five tomorrow night Saturday Night and Sunday afternoon the music of Motown at orchestra hall superstar Elton John is coming to the ... it's the farewell\nYellow brick road to her little seizes arena tomorrow night in Saturday Night at eight PM Christina ... is live on stage at the Fox theater Saturday Night at eight PM the eagles are alive at little seizes arena Sunday at age Troy savant is at the Fox theater\nSunday at seven thirty and here comes the foo fighters that little Caesar's arena on Monday at seven\nThirty also cool event downtown tonight I read says jazz cafe opens this evening inside the music hall in honor of the late great queen of soul reverted just saying that W W J news radio nine fifty\nW. W. J. news time too\nI'm twenty three [noise]\nIt's the twelve pay they give away on W. W. J. news radio nine fifty and this hour is key word is taco text tacos T. A. C. O. seven to eight eight one for your chance to win one thousand dollars messaging data rates apply and remember do not tax syndrome\nSome more big losses piling up on the markets today your money's next W. W. J. new stuck to twenty three this\nWouldn't even want to spot that burglar when he's case in your home or after he's in ... John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and boy she works with Alexa\nBlinks cameras systems or book unstuck and right now the Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash Rudy over offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions of a deal\nIf you love puzzle game but our border crossing any play the hugely popular ... ... ... is ridiculously fought with consistent by that if I start raining\nAgain you can't miss out on south Athens the five most collect tons of ... and ... weekly events that's been update every month so you'll never get bored crushing candy so twenty Fifteen so\nNow or visit the apple app store or go to a plane to download that scene for\nOut the fire that theme\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nW. W. J. new century police on time for business suburban Cadillac of Troy business to\nAt least the friends he has our Bloomberg Business reporting Alisa another day of law says\nThat's right broken Greg and we had a little bit of a break in terms of the declines but now here we are again with the Dow down more than one percent a loss of two hundred eighty nine points in the benchmarks at twenty five thousand three hundred twelve\nNASDAQ now falling forty four points or more than half a percent and the S. and P. down thirty four points the Bloomberg W. W. J. Detroit index down three quarters of a percent the core consumer price index rose to point two percent in September from a year earlier\nThat was unchanged from August and less than expected part of the report is baffling to auto industry analysts it's fine\nDiscrepancy might result from a recent change in methodology for the report Cox Automotive says it might not have taken SUVs fully into account\nCBS and ESPN will be home of the PGA of America tournament for a long time to come on new eleven year deal\nBetween ESPN ESPN Plus we'll get first lied and second round coverage and more airtime during later rounds CBS will get exclusive later date third and fourth round coverage I'm only ... with the Bloomberg Business report on W. W. J. news radio nine fifty\nWendy what a spot that burglar when he's facing your home or after his head has John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and wrote on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems a buck and stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's bleak project dot com slash radio like as an Amazon company limited time offered terms and conditions of blood\nWith twenty five percent off on new enough to Seventy percent off previously refreshing you really need a better reason to party we don't think south or new court furniture clearance interact with more than nine thousand square feet of\nNew and previously in these furniture and acorn for your home and all that so far from one Ninety nine Ninety nine cents that's something I mean I Ninety nine dining some two Ninety nine Ninety nine and more presented prizes and find all weekend long entertained only cost furniture clear and center at one three nine for sex lead Jackson memorial highway for online that court Clarence furniture dot com\nThe all new radio jak job that is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list of news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nAny time to twenty eighth time for traffic and whether they gather every ten minutes on the eight and a slogan trace McCaskill under Southfield\nArrived broke we are watching this accident delay and it is growing south on Southfield just north of vi Ninety six this crash leaving only the left lane open backups ... from before Nick Nichols now aside from that and watching an accident on the right shoulder and he's found I met before after Michigan avenue\nW W J new stuff through for the Democratic whether together every ten minutes on the age [noise]\nAnd chasing the casket let's happening on the sounds freeway so we're still watching here broke this big slow down along the outfield freeway and this report sponsored by Detroit princess riverboat\nThis outfit on Southfield just north of by Ninety six were watching this crash at least only the left lane open so we now have traffic flow or from seven mile route to get around they try exiting at Grand river and take the service drive\nEast sound six Ninety six Seventy five an accident on the right shoulder there we still have in war and this has been here for hours west ... condo what's the Van Dyke all lanes blocked due to an earlier accidents\nAnd we still have here some heavier traffic through the works down for this project underway north on us twenty three near grand blanc with the right lane is blocked\nMaker corporate holiday party different this year will get now on the Detroit princess riverboat heated enclosed so you can celebrate any party political fundraiser a birthday all year long\nCruise this Saturday or Sunday for lunch or dinner recall eight seven Seventy eat the boat or go to Detroit princess dot com from Adel download or group twenty four hour traffic center tasty McCaskill WWE Jane news radio nine fifty big show in the air today the accuweather forecasts known to have send me a we\nHave high pressure starting to build up to the area of the cold front is Ruben ... off to our west and uh we have a cold front and Michael off to hurt each so we're dealing with the pressure gradient today what that means is will have gusty winds\nAre certainly adding to the ... we're not used to temperatures in the mid to upper fifty certainly a feeling cool like they otherwise would in October it were me breezy and cold tonight temperatures will be dropping below forty one in the city thirties\nAnd most outlying areas when probably prevents frost most areas but one or two protected spots could have some frost otherwise tomorrow sunshine to start clubs will increase in the afternoon ... fifty three looks like we could have a shower to tomorrow night will be chilly closing the upper thirties\nAnd Saturday will clear up part at least thought he was a high a fifty three Sunday turning climbing again the high fifty it could be a shower at night then Monday very cool out there with a high only near fifty this is accuweather meteorologists have Samuel on W. W. J. news radio night fifty\nRight now in slanted it's cloudy and fifty one in Ann Arbor and it's fifty three and that Detroit metro it's cloudy and fifty eight with wins out of the last ... up to twenty miles an hour or check on the market now the Dell a down\nWell I'm Glad you enjoyed it but I think it's that had back in\nKilling I'm sure they'd be careful getting as a\nI'm going to return the kayak\nHow about a taxi\nShy than sending our neighborhood here in nature had to find that hard to find a neighbor had ... or ... ... us place and I\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or wire free set up and minutes and run on to double A. batteries last up to two years brilliant technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around the yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlinks camera systems are back in stock and right now the Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offer terms and conditions applied and whether\nOn the AIDS and breaking news came up to date on the road\nNewsworthy nine fifty you're done all the\nTime to forty three President Trump hosting rap star Kanye West for lunch at the White House today the purpose to discuss issues of importance to the African American community and the performer foot on quite a show and the press enter the room is CBS News wide as correspondent Steven ... tells us\nI Love this guy right there was one of the stranger scenes White House reporters have witnessed donning a make America great again hats\nKanye West held forth in the oval office and cast himself as an unapologetic supporter the press when I put his hat off and made me feel like supermax wet meandering monologue and supported Mr Trump featured multiple profanity robbers on his hero's journey\nRight now and he might not have expected to have a crazy mother like Kanye West run up and a\nSupport the president surely appreciated I'll tell you that was\nStephen ... noise CBS News the White House\nW. W. J. news time to forty four right now the gallon S. and P. are down ... percent we'll check your money at you fifty five it is now time for your eye on tech\nI on the chat with Larry Magid a recent study from Pew Research finds that fifty nine percent of\nTeens said that they've been cyber bullied in at least one way at some point in their life the official definition of bullying and cyber bullying is repeated and aggressive behavior with a power imbalance and this that he didn't necessarily look at it from that angle\nStill nearly sixty percent if too many but here's the good news about six out of ten kids said that parents or their greatest ally when dealing with cyber bullying elected officials only twenty percent\nDetail that Larry world dot com learning that you had the S.\nDo experience relief or muscle cramps ... use terror works relief this fast acting film was proven to prevent and relief footed leg cramps give their works really today and the pain relief violet Walmart CBS Rite Aid and Walgreens pharmacies or their works relief dot com\nWell I'm Glad you enjoyed it but I think it's that had back in\nKilling I'm sure they'd be careful getting as a\nI'm going to return the kayak\nHow about a tax the\nHe I Need to head to find the right to find him either had ... or green space near you you can find us probably said\nWell the market is now done more than five hundred points\nWe'll get the update from the Bloomberg Business report\nW. W. J. new assigned to forty five it is now time for that seat was willing\nWell Brooke today because the media day in Chicago and despite MSU and U. of M. projected to finish it wanted to in the standings this year Michigan I go to John ... says he knows the league is a much more balanced the competitive one that was a year ago and he expects to see more teams in the NC double a tournament\nWe all know and it's well documented we had four teams and last year and there was a reason for that is is that we are very young league and we get we have teams that have almost everybody back\nThat are going to be terrific they're not going to be the cancer eleventh team in this league like some of your projects they're really good both\nTeams will open their season in November six now over in the NFL week six gets going tonight for the Meadowlands giants playing host to the eagles you can hear it on ... Seventy starting at eight Red Wings also back at home tonight sorts of their first victory of the season as they bring in the maple leaves that means former head coach Mike Babcock is in town\nHe was asked his thoughts on the team now replacing they're all red seats where they black seat because of the appearance on TV with no fans support and give it pretty honest answer\nYou know it's like anything is a product driven right didn't so they got their product going in the right we got one of the best General Motors is not the national hockey league yeah they'll rebuild the the program and the thing about being good as long as we were here and doing what we did is is you sacrifice\nOr to your true because you for ... to be good at the time but that's what it sounds one at the time\nWe ever get yourself then you know someone's got to stand there and take the bullets in will you rebuild it and that's what they're doing right now they're doing the job\nYou can hear the game will run out any civil and the ticket tonight for a game and seven ten will drop the puck at seven thirty with sports Fifteen and forty five passed each hour Ryan woolly double ... news radio nine fifty\nWe're looking at a test drive right now in the south feel free way just north of I Ninety six look at the at the gate with traffic in weather in one minute\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working round your yard\nAnd parents love blinks live feed auction electric checking for many where using your blink smartphone app so you'll know when your kids get home from school\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's Blake protected dot com slash radio is on Amazon company limited time offered terms and conditions applied\nWell DJ news time to forty in traffic and whether together on the a\nAnd taking a castle has this outfield freeway worth watching a big slow down there and this report sponsored by B. E. W. Mika so long without ...\nThat'll debris in the left lane we heard from tips to Angela\nAbout that and he found six Ninety six Seventy five fill in the earlier collusion they are on the right shoulder but the expertise in scale of ... electricians and Nico signatory contractors to work for your commercial public industrial urban construction projects learn more at powering Michigan's future dot com bust contract is the best electricians period\nEight on Sunday fifty eight and veteran Iowa to fifty nine\nTo ... watch never style that news radio nine fifty to ODU who'd afternoon I'm Greg Goldman\nAnd I'm broke Allen FEMA assessing the damage from hurricane make\nOur lives are gone you know lives everything we have his own solar cars everything\nAlive update on the way from CBS News sentencing\nFor and Oakland County team for threatening his school or John ... with alive report also ahead cracking down on Michigan's opioid epidemic I'm Jason ... sports coming up at three fifty and we'll check in with Ryan bully for the latest\nRight now the Dow is down five hundred and twenty three the NASDAQ down a hundred and I will check your money\nAccuweather says breezy turning much cooler this evening lows around forty in the city we could dip into the thirties and the outlying areas [noise]\n\nThree o'clock\nNews\nAnd the bonds there by Quicken Loans\nI'm Jim ... hurricane Michael is let the path of destruction from the Florida Panhandle will inland and President Trump says it could've been worse it\nWas the fastest hurricane anybody said it just was the was it that would be absolutely nothing left a it was an it was incredibly powerful and the destruction\nFlorida governor Rick Scott says it'll be awhile before any sense of normalcy returned\nMy thing today is we've got to get everybody we got a search and rescue everybody we've got to make sure everybody's say then the next thing is be careful stay off the roads are don't touch downed power lines be careful of trees you know if you're going to use a generator\nFollow the rules I Need your hands and say James Florida us Ninety eight along the coast is officially closed do\nYou live here at the end of his this highway is covered with debris from homes and trees and entire trees a block long stretches of us ... head National Guard is try to clear of that away as fast as possible Peter things CBS News St James Florida\nAt least two deaths have been confirmed from the storm including an eleven year old Georgia girl a stock markets taking it on the chin again today with the dial down five hundred twenty points right now CBS is Jill slash singer\nEveryday investors make a decision where can I get the best risk adjusted rate of return with interest rates higher they may be induced to sell out of a high flier like the tech sector and go to the safety of the bond market\nScary time this morning after the launch of a Russian so use capsule on a trip to the international space station the booster rocket failed so you had to make a quick returned worth CBS News space consultant bill Harwood\nThe crew did land safely it was a steeper than normal trajectory they were subjected to very high G loads in other words a deceleration much higher than the experience on the surface of the earth but the landing was safe recovery crews report that both of the crew members are in good shape and\nRussia's manned space flights are on hold now until they can figure out what went wrong you could soon be paying more to send something through the mail and Gary ... reports\nPending approval by regulators the price of a first class stamp will jump on nickel to fifty five cents beginning in January because the postal service continues to lose money increase would be the largest in almost Twenty years mail volume continues to drop and us BS costs of health care and pension payments surpass gains and package delivery is\nThe price of each additional ounce for a letter will drop from Twenty one sense to Fifteen\nGoing on Wall Street the Dow don't for Ninety One now NASDAQ is off Ninety nine ...\nFifty three points this is CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender and MLS number thirty thirty\n[noise] never stop on Detroit's number one\nNine fifty to holding on to be a\nGood afternoon thanks for joining us on Thursday October the eleventh I'm Greg Coleman\nIn Brooklyn for W. W. J. needs radio nine fifty\nBurning chillier tonight and there'll be pockets of frost of the cold has outlined spot to complete accurate the forecast is coming up\nRight now mostly cloudy fifty degrees happy type metro airport W. W. J. news side three ... three\nNow on you by with regard windows\nPulled up one but two big problems along the Southfield freeway W. W. J. newsworthy line fifties Katie joining us live and local from the twenty four hour traffic setter Katie while we\nHave good news for one of them I'll start with the one that's still there in the south the freeway north on right after I Ninety six is crass leads to own the you're right\nIt's crass leaves on the right lane open your very heavy for more than avenue\nTo avoid it you can swing or does telegraphing go north from their Southfield freeway southbound before I Ninety six and this crass just got cleared out of the way your those traffic is very heavy from Finkel your next updates that thrill eight and twenty four hour traffic center ... double detainees reading that fifty\nW W day news time three or four hundreds of rape is identified and nearly one hundred fifty convictions the Wayne County prosecutor's office is now getting results from the last of the eleven thousand rape kits tested after decades of neglect W. W. J. news radio and I had the standard but Neal\nReports it's been nearly a decade long fight for Wayne County prosecutor Kim worthy to find the money to task the more than ... eleven thousand rape kits discovered ten years ago in uh Detroit police storage facility where the says all the kids have now been tested\nOur latest numbers are we have over a hundred and forty five convictions we have almost eight hundred and Seventy identified serial rapist what tentacles to crime scenes and forty other states\nWere these awaiting the testing results from the final six hundred in Nineteen kids the African American for Ninety challenge raised over seven hundred and fifty thousand dollars to pay for the testing of thousands of the cats Sandra McNeil WW Kane is ready on ... the\nRetired mourn priest has been removed from public ministry over what the archdiocese of Detroit calls credible allegations of abuse of minors allegation stayed back decades to the early years of eighty three year old Robert ... career parishioners that his former church St Augustine or rattled by the news\nThis man tells W. W. J. surly linked in the news almost brought him to tears I've worked with him\nHe took care of you know my wife's funeral my brother everybody's general and I just can't believe it Saturday I Can't believe it [laughter]\n[noise] which ... named joins over a dozen other priests on the archdiocese list the priest against whom there are credible allegations\nSentencing important Oakland County teenager today after making a false terror threat at school WW Jane is right and I think he's John Hewitt is live and local outside the courthouse with the latest John\nBroke he was facing a twenty year felony but in the end Eighteen year old Ryan ... gets three years' probation from circuit court judge Phyllis McMillan this case stem from a Snapchat message to Bruni sent to a south Lyon high school classmate back in February asking that student if he wanted to recreate the Parkland, Florida massacre\nFrom a thirty day state and the Oakland County jail for a time a ten million dollar bond and having to wear a tether it has been a stressful spring and summer for to Bruni who cried after this hearing clearly relieved if he handles his probation without incident this will not beyond his permanent record\nBrooke Greg I spoke at length with his father who decided not to do an interview formally but said when the time is right the family does want to send a message to other students what they've experienced and that they may think they're pulling a prank but it can literally ruin their lives job college opportunities et cetera\nIronically said his son knows the high school student who just yesterday was arrested in South Lyon for making a threat\nReporting live and local outside of circuit court in Pontiac John ... W W J news radio nine fifty\nSchool districts in become county getting any three hundred sixteen thousand dollar grant keep building save\nMoney from the U.S department of justice will be used to hire personnel to work specifically with local police school districts and other officials for drills and exercise is Vicki ... director of emergency management for the county says the should also help parents\nHopefully in the end you know our goal is to is that they feel safer and more secure a and that we give them options should any of that happen\nEfforts also include mental health training\nW W ... it is the latest\nAnd it is the latest effort to curb the opioid epidemic in Michigan\nLieutenant governor Brian Kelly announcing the start of the state's first opioid health home program it's available for people on Medicaid in the northern Twenty one cow to use of the lower peninsula\nThey have the highest per capita number of Medicaid beneficiaries with opioid use disorder and we also know that it's kind of under served there's not enough providers to help with that particular situation so this is the kind of an effort to try to mitigate that situation\n... with the Michigan department of health and Human Services says the opioid health home we'll coordinate health and social services which are typically not available for Medicaid reimbursement Jason Scott's W. W. J. news radio nine fifty W. W.\nJ. news time for your weight it's time for trafficking whether together of resentment of ... from the motive of traffic center brought you this hour by Motor City\nMany and Katy claimed to drive on the Southfield freeway yes still working a crash on the Southfield freeway north bound right after I Ninety six leaving only right lane open and listen to the ... you are slow and heavy\nFrom a Ford rode down the south feel free way south found a crass just cleared before I Ninety six and you're still slow in heavy from eight mile road got an accident on I Ninety four west on after Woodward it's on your right shoulder and good news in Warren ... earlier a crash closed Chicago west down just west of van Dyck\nEarning fifty miles on a flat with Dr guard tires you can get to safety and a flat instead of being stranded on the side of the road so rest easy and like birds don't drive car tires give you peace on the road in the idol downloaded give twenty four hour traffic center Katie for W. W. J. these regular nine fifty\nNow the accuweather forecast for the family heating green and electrical letters center meteorologist John ...\nSome clouds deceiving mostly clear in Chile or later tonight down to forty one thirties most suburbs with a touch of frost of the coldest spot of law partly sunny cool I fifty three be late afternoon or evening shower mostly cloudy tomorrow night below thirty eight still chilly Saturday partly somebody I again fifty three mostly cloudy Sunday I fifty eight\nMonday cooler again mostly cloudy a high fifties is is accurate there's John fear W. J. he's radio nine fifty\nCurrent conditions in Ann Arbor right now cloudy skies and fifty three degrees it's fifty five in ... near Detroit city airport cloudy and fifty eight fifty eight degrees at Detroit metro\nNews radio nine fifty to owning an afternoon I'm directing\nAnd I'm from ... has officially been sold for three point one million dollars ... complex has been up for auction over the past couple of days are ingrained Kelly is working this story and we'll have more and I live in Florida at the bottom of the\nDevastation in parts of Florida and Georgia following hurricane Michael\n[noise] homeless smashed the bits while search and rescue crews struggle to get through areas where residents decided to write out the storm at least two deaths have been reported as Michael makes its way through the Carolinas more to live up to date from CBS News at three thirty one\nFor the second day stocks are tumbling the Dow Jones industrial average is down over five hundred or two percent which had business in just a few minutes at three twenty five\nMayor of Detroit doing something for the first time in five years\n\nHe's appearing in a campaign ad for some of them as the Senate leaders Gretchen Widmer went desk to death to get Republicans and Democrats\nAnd now six hundred and eighty thousand people\nLeadership change lives\nW W Jaycee said he leads a reporter\nVicki Thomas says the story trait Mayor Mike Duggan featured in a new ad for a democratic gubernatorial hole full Gretchen Widmer\nThis is the first TV done for any candidate last five years but we need a full partner for the city that's right and a graduate or has a great track record thousand people in the state have healthcare today she was willing to work with Republicans and Democrats could have done\nWayne County prosecutor Ken worthy also featured in a Whitmore ad and just out today that Detroit News endorsing Republican bill shooting for governor the papers latest poll shows shooting trailing Widmer by twelve points Vicki Thomas WW Jane is radio nine Fifteen\nW. W. J. news time to be twenty two it's time for the Feldman report\nThe news has been filled with plenty of stories about security fraud and it looks like it's having an impact on us Amory filled in with a filter and report on W. W. J. news radio nine fifty\nWe've seen and heard about incidents of hacking data breaches stolen identities and now the company compare cards tells me nine out of ten consumers of taking at least one step to try to protect themselves more than half now look at their credit score regularly and they set up alerts to be notified when charges up you're on their credit cards\nMore than a third now review their credit report to see if there were mistakes are charges that are suspicious and it's paid off for all those kind of found a fraudulent charge on an account and the past twelve months\nMany people complain about the cost of healthcare\nAbout the cost of healthcare some even skipped doctor visits or medications because they can't afford the co pay or the deductible the Consumers Union says forty two percent of adults are now calling the doctor's office to ask the cost of the visit before they go with the film and report I'm rebuilding W. W. J. news radio nine fifty\n\nHey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October cave halogen I was an hour long weekly political part gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nListen and imagine [noise]\nIf it's five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nIt stopped ... dot org a message by ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council [noise] [noise]\nThat is the twelfth they give away um W. W. J. and use really good on fifty the SARS ... where does adapt to use the word adept A. D. A. P. T.\nThe seven to waited one your chance to win a thousand dollars again text adapt Seventy waited while your chance to win a thousand dollars messaging data rich supply remember don't text and drive right now the Dow is down two hundred Ninety nine points we'll check your money in one minute\nHuge savings on new and previously leads furnishing that writes huge savings court furniture Clarence center choose from a wide variety of new and previously in these furniture and acorn for your home and often you'll find so friends from one Ninety nine Ninety nine and more everything in our nine thousand square foot\nShe'll run its course certify guaranteed and in fact ready for delivery or to take home today that are tend to court furniture than center at one three nine for six lead Jackson memorial highway or go on my heart clearance furniture dot com mentioned radio twenty and get twenty percent off\nFor baseball cap mess and everything you need to think about what you really get so much more\nFedEx delivered game day spirit what we deliver by delivering\nWould you change is a forty five it's time for business from the suburban Cadillac employed business sponsored by blood bred will management\nAnd all these offends you has our Bloomberg does this report right now the Dow down two hundred and sixty six the NASDAQ down Fifteen broken red\nSox are coming back from their lows of the day but we saw another two percent drop across the board\nThe main averages hit those marks after a headline that the European Central bank won't come to Italy's rescue unless the country gets a bailout that came from Reuters but volatility breeds more volatility and the selling started and it hasn't stopped so we're looking at weekly declines of more than five percent across the board\nNo relief for crude oil futures either they finished under Seventy one dollars dropping three percent today lower by five percent so far this week and said investors are turning to gold and gold futures have moved to their highest level in two years the latest on Sears Holdings is at lenders including bank of America Wells Fargo and city group\nAre pushing fears to file for chapter seven\nThat's all out liquidation rather than reorganization\nAlso Reuters is reporting fear skipped payment deadlines to at least three vendors I'm Alisa parental\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nThe all new radio jak job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\n... how about a taxi\nTeenager head or the fourth dialect to find a neighborhood park or green space meaning you ... your body temperature in the U.S Forest Service\nWindow the only one factory in Michigan Building commercial break windows designed to last where the guardian guarantees them for life called eight hundred three seven seven eight eight eight six\nTimes a week when he ate it is time for traffic and whether the gathering Haiti's some better news yes on the south feel free way north on right after I Ninety six this accident just got moved to the right shelter they'll look into Tripoli damn cams you are slow and heavy from before Ford wrote\nAnd still in the south field freeway south um right before I Ninety six this ... have been out of the way for a little while the traffic still slower from Nick Nichols and the idol downloaded give twenty four hour traffic center Katie for WWE Jay news radio nine fifty\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... message by the by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nW. J. traffic and whether together every ten minutes on the eight\nAnd Katie is that Dr improving on the Southfield freeway yes it is getting\nBetter you are now slower from after forward road in the south feel free when north on right after I Ninety six this accident moved to the right shoulder looking through the ... again you were a slower from before Ford wrote traffic is sponsored by Ben Johnson ... got an accident I'd I'd ... you sound right after nine miles\nIt's on your right shoulder and heads up I Ninety six the Jeffries westbound express lanes\nFrom Davis in avenue to the south the freeway it's going to completely closed as starting tonight at nine through Monday morning car crashes aren't about the vehicles involved there about the people and that to vent Johnson is fighting for everyday people just like you want justice to call one eight five five\nEvent fights today because everyone deserves a fighting chance to get their life back on track in the ... group twenty four hour traffic center ... news radio nine fifty\nThey are the accuweather forecast now checking in with meteorologist or John fear it can ah John what's ahead for us this evening\nOh we've got a blustery afternoon out there will see the ... can continue to funnel in across the region some clouds for the evening and they're mostly clearing cooler later tonight down to forty one thirties and most suburb to touch frost the coldest spot simple tomorrow partly sunny and cool of them are like\nOh the high up to fifty three or maybe a shower too late in the ... more evening mostly cloudy chilies are like down to thirty eight and partly sunny Saturday cool high again fifty three Sunday mostly close to fifty a cooler again Monday mostly cloudy that high right around fifty right now they're all timidity forty nine percent of a west twenty three barometer twenty nine Seventy nine and steady\nPontiac fifty one at our fifty three metro fifty nine without a forty one this is accurate there's John fear it will be W. J. news radio nine fifty\nAnd this is where you hear trafficking whether together every ten minutes on the AIDS and on demand whenever you needed at W. W. J. news radio dot com\nCould cost you more than a male that a letter in the future will explain with the news continues\nWhitney what a spot that burglar when he's case in your home or after he's an ass John who's blink camera alerted him a burglar\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions applied\nTo suppress them whether together on the apes and breaking news first came up to date on the road\nNews radio nine fifty five O W\nW Cheney assigned to a commission will have the final say on a plan to raise most postal rates here CBS is Steve Case in\nThe postal service is proposing a five cent increase in the price of a first class stamp from fifty to fifty five cents the largest boost in its history\nProposal also calls for twelve percent hiking rates used by Amazon and other shippers that should please President Trump who's blasted the postal services record losses and tweeted earlier this year that Amazon's getting richer while the postal service is getting dumber and poorer Steve Case and CBS News\n[noise] W. W. J. new scientific forty three it's time for a car chronicles\nUsing new materials to make vehicles stronger Leiderman quieter this is Jeff Jeff with with the whole chronicles take for example a material called graphene\nGraphene is two hundred times stronger than field it's one of the most conducted materials in the world it's a fantastic sound barrier but it's\nVery expensive says Debbie Malesky who's the senior technical leader board but then they discovered that even tiny amounts of graphene can greatly improved phones that are used in a number of under the hood applications now this is part of an ongoing process to make new materials are part of new vehicle\nWe need to be able to get new emerging material into the marketplace so that not only Ford Motor company can use them but everybody can use them other industries as well\nMalesky says he getting closer to the small amount of graphene makes vehicles quieter while also cutting costs making them wider and\nMore fuel efficient with the chronicle I'm Jeff Gilbert W. W. J. before they go nine fifty [noise]\nIf you left the games that are sick of cracking candy play the hugely popular mobile game that fans did gain is ridiculous like that and they can buy that if I start raining it's a popular games you can't miss out on some thousands of hospitals collect tons of character and play weekly events\nThat seems update every month they never get bored\nCorrecting candy out too many Fifteen pick up your phone and download that seem to have the apple app store or go go play for free now\nFranco is happy I seen\nThe all new radio jak job that is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you ...\nThe accent that I feel the red wings wrecked still looking for their first victory of the season you might remember they look pretty good in the pre season undefeated or for the first six games then eventually I dropped one but now it's still looking for their first victory here in the regular season tonight\nAt former head coach Mike Babcock in Toronto maple leafs in town down a little Caesar's arena this is also the loan home game for the team over the next seven you can hear it on Ninety seven on the ticket starting at seven ten\nNow today was big media day in Chicago and despite Michigan State and U. of M. projected to finish it wanted to in the standings Michigan I go on the line because he knows that the league has much more balance a competitive and it was a year ago\nWhich is going to be a dog fight over a year long I think the year to the leaves is balanced as it's ever been maybe more than it's ever been and it's going to lead to a lot of excitement all across a big country and around the around the country as well\nMichigan State ... meanwhile says despite a disappointing to last year he is looking forward to this season after having a write off season\nI thought we had a great summer and it wasn't a battle cry of\nLet's make up we knew were good team last year we knew he got beat by a good team and we knew we didn't play well or shoot well and so it wasn't like we are trying to correct a million things were just trying to do our battle cry the summers we got to finish the job now and we finished it and the Big Ten but we've not finishes you'd see tournaments\nAnd turning to the NFL week six gets going tonight for the Meadowlands as the giants and the eagles see that one over on CBS Sports radio twelve Seventy starting at eight with sports Fifteen and forty five passed each hour I'm Ryan wall e W W J news radio nine fifty\nSplit sponsored by MasterCard heating and cooling traffic and whether or not\nWhitney what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double A. batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blinked works with Alexa\nBlink cameras systems are back in stock and right now the Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nYou left has the games that are sick of cracking candy play the hugely popular mobile game that's being this is ridiculous like that and if they can buy that if I start writing it's a part of the games you can't miss out on some boxing title collect tons of character and play weekly event that seem update every month they never get bored\nCorrecting candy is now too many Fifteen pick up your phone and download that means that the apple app store or Google Play for free now\nFriends without the iron that steam\nWhether together and let's go to those roads\nAnd Katie what's happening I Seventy five well I sort of north on right after ... Ninety six got an accident on your right children ... Iraqi called it and look into the AAA damn camp with the afternoon Dr building you're a slower from the Davis and freeway traffic is sponsored by the Detroit princess river boats\nGotta crash that leaves only you're left lane open now on I Ninety four ... right after nine miles and you're slower from after my Ross and not in the south the freeway north on right after I Ninety six good news is accident is now out of your way though\nYou wrote in the adult downloaded twenty four hour traffic center\nFor example the ... the actor weather forecast than meteorologist John fear excess clearing brush getting colder tonight lives about forty in the city of lows in the thirties and the most suburbs some of the areas could see some frost tomorrow and Saturday partly sunny chili high both\nDays about fifty three it's fifty eight AT Metro now at three fifty nine\nAs much never Steiner staff sneezes rodeo nine fifty to all these good afternoon I'm Greg moments\nAnd I brought gallon fish and rescue teams are searching communities that hurricane micro level hoping to find survivors CBS News ...\nStocks plummeting today for the second straight day our business editor Murray Feldman with details live and local the dial down more than five hundred also why more people are being urged to get the ... vaccine I've got this nice to\nDot com it's four o'clock [noise]\nYou've CBS News on the hour sponsored by capital one\nI'm Jim and she had to be the death toll is now up to at least six President Trump says category for hurricane Michael could have been much more destructive if it hadn't moves so fast the big\nProblem with this hurricane was the tremendous power and fortunately it was very fast it went through Florida very very quickly it didn't linger didn't come back\nAnd it has left much destruction across Florida's panhandle governor Rick Scott as hurricane was an absolute monster and the damage that students wake is still yet to be fully understood corresponded Omar via Franco's in hard hit port saint Joe\nAt least days possibly weeks before any power is going to be turned on in this area getting around port saint Joe is an adventure in itself and what we found is that only big trees and the way roads completely washed\nOut Michael currently a tropical storm centered over central North Carolina's fifty mile per hour sustained winds at this point is mostly a rain maker of the stock market has been in ... again without a doubt now down five hundred and forty six points of the clothes that had been down around seven hundred points earlier this afternoon CBS News business analyst Gilles lead singer\nWhen interest rates rise investors may say wait a second I made a lot of money in the stock market over the last few years maybe I'll take some of the money I made in the stock market and now put it into the bond market because I'm getting a higher interest rate\nAt the White House today President Trump hosted supporter and rapper Kanye West\nI Love this guy right there was one of the stranger scenes White House reporters have witnessed donning a make America great again hats\nKanye West held forth in the oval office cast himself as an unapologetic supporter depressed when I put his hat off and made me feel like Superman west meandering monologue and supported Mr Trump featured multiple profanity Trump is on his heroes\nGermany right now and he might not have expected to have a crazy mother like Kanye West's run up and a\nSupport that the president surely appreciated I'll tell you that was one of us from Port noise CBS News the White House\nTense moments during the Russian launched at the international space station today when the booster rocket failed in to a board that attached ... castle\nAstronaut Andy Kaufman I had to make a high and high speed emergency landing deputy chief astronaut read Wiseman\nReady at all times for that aboard today's abort was automatically initiated by the vehicle so from a crew perspective certainly there is a bit of shock in there for a moment that communication with the crew was extremely professional they had a brief moment a boy with us and then she forces built up parachute came out and they were added man\nBut communication with the crew was extremely professional they had a brief moment a boy with us and then she forces built up person came out and they were added\nMan do worse for the experience again on Wall street down now down five forty five this the CBS News\nBrought you buy a new capital ones saber card earned four percent cash back on dining in entertainment to present a grocery stores and one percent and all other purchases once in your wallet\n[noise] washing ever saw on Detroit's number one [noise]\nForty or fifty holding and holding and\nGood afternoon thanks for joining us um this Thursday October eleventh I'm ...\nAnd I broke a gallon for WW Jane is radio nine fifty\nCool air stays locked in through the weekend the leader of the forecasts coming up\nAnd right now it is cloudy or seen a bit of sunshine it's fifty eight degrees that Detroit metro airport W. W. J. news time for oh three\nNow you buy one of the guard windows\nWe've got a problem Floyd things out along a portion of minority for this afternoon W. W. J. newsworthy like fifties Katie joining us live and local with details from the twenty four hour traffic setter what's the latest Katie\nWell as just as you said that Greg in St Clair shores I Ninety four east on after nine mile looking through the truly jam Kansas grass has just been cleared out of your way they'll traffic very heavy from Ross now your next updates that far away and the twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nW. W. J. news time for all for here we go again negative day on the market W. W. J. business editor Murray Feldman joining us live and local and Marie what happens well\nWhat happened it was just a repeat of yesterday we did get a bounce out of the market this morning broke but then things fell apart the high flying NASDAQ market has been hit the most now down in correction territory dumped ten percent from ... the Dow Jones industrial Z in the U.S when the five hundred down about six percent from their hives\nThree things are behind this concern over trade with China concern about higher interest rates and concerned about the next batch of corporate earnings reports\nThere are a handful of Michigan survivors day though perceptive Ron ... Chrysler sporting motors of western Michigan Lansing based in the gym and metro area bank level one will take a look at some of the stories behind the stocks that needed out alive just after four thirty reporting live Murray Feldman W. W. J. news radio nine fifty\nW. W. J. news time you know four oh five well the quarter Vern urine eight mile road and Harper woods could soon look a lot different now that the Flint mall is just sold W. W. J. newsworthy line fifties Ingrid Kelly joining us live and local with the details and ...\nWell good afternoon you know that mall just sold an on line auction forget this three million one hundred twenty five thousand dollars now Harper what city manager Joseph ... says it's good news for the city\nI'm happy that it as training or we don't know who the buyer is as of yet\nNow record says there's a lot of potential for that space and that the city wants to work with the new owner but rake are also made it clear what the city does not want to see\nI don't want to have a single point failure like mall are asked to be a mix you is what we're looking for\nNow ... says ideally the mix you space would include hotels and restaurants reporting lie in court Kelly W. W. J. news radio nine fifty\nW. W. J. news time for a sex nearly nine hundred serial rapists have been identified as the last of your choice neglected rape kits are finally tested WW Jane is right in the sand or Neal has the story\nThose are the numbers from Wayne County prosecutor Kim worthy who says\nKids are finally tested WW Jane is regulated safety standards Neal has\nThe story those are the numbers from Wayne County prosecutor Kim worthy who says all of the more than ... eleven thousand kids found neglected\nAnd the Detroit police storage room a decade ago have now been tested to date or the says the kids have identified eight hundred and Seventy serial rapists with ties to forty states there have been over one hundred and forty five convictions she says and they found the evidence and the kids\nWe are getting the results of the last six hundred and Nineteen kids that had with him to be tested a few weeks ago a few months ago beginning those results back now\nPrivate donations raised in the African American for Ninety challenge paid for thousands of the kids eighty percent of the victims are Black Sea Andrew McNeill W W Jane is ready on identity\nRetired priest has been removed from public ministry over what the archdiocese of Detroit goals credible allegations of abuse the allegations against eighty three year old Robert with cow ski involved minors for decades ago parishioners would cow skis former Warren church St Augustine or in disbelief for coping with the news\nGod and father because and I believe in God and I believe and forgiveness\nIt's going to be hard but I Will get\nTheir over a dozen other pre son the archdiocese lists of priests against whom there are credible allegations\nAnd investigation is underway in Monroe County after a body it's discovered in lake Munro the sheriff's department says they were called out around seven o'clock Wednesday night after a scuba diver so\nFound a vehicle emerged on its worth on the Cory floor the dive team responded to the scene and found the body inside the vehicle the person has not been identified official say another vehicle which had been reported stolen was also discovered in the water\nW. W. J. news time for a way it is time for trafficking whether together every time the ... from the motor traffic cetera brought you this hour by Porsche the motor city\nAnd Katie another problem on to Southfield freeway yes north bound at I Ninety six is crashes locking your left lane and so they're looking through the ...\nYou have even slow from a foreign road\nHad an accident and I to Seventy five south on seven miles on your right shoulder with the afternoon Dr building traffic is slower and pockets back to the Ninety six six Ninety six interchange and I Seventy five north on after six Ninety six\nReported crash on the right shoulder traffic is heavier from eight miles you're slower from the Davis and with the afternoon Dr added in Ninety four east on a nine mile accident has been cleared out of your way though you still slow\nFrom it'd be former Ross now if you see a problem on the road give us a call and the W. W. J. tips are in line at two forty four to three six W W day in the adult that motivated twenty four hour traffic center Katie for WWE Jamie's already of nine fifty trafficking whether sponsored by higher ed Dunn dot com\nFrom eight mile road and looking through the triple a jam camps at the ride home seeing slowdown sounds six Ninety six west bound\nFrom after orchard lake rode a and as we continue on to I Ninety six tobacco road I Ninety four both ways in between the entertain just slow down town also coming out of the city as any five north on your slower from the Davis and to twelve miles road now it's time for the electrical workers local fifty a construction alert\nHeads up I Ninety six the Jeffries west down from I ... Davis an avenue construction\nIs going to black two lanes that started to seven tonight until Tuesday that's going to go nightly see a problem on the road give us a call now WWE Jake tips to line at two point four to three six WWE Jay in the downloading of twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nNow the accuweather forecast for the family heating cooling analytical either center with me all adjust John ...\nSome clouds receiving mostly clear in Chile or later tonight data forty one thirties most suburbs with a touch of frost of the coldest spot\nNumber law partly sunny cool I fifty three be late afternoon or evening shower mostly cloudy tomorrow night below thirty eight still chilly Saturday partly somebody I again fifty three mostly cloudy Sunday I fifty eight Monday cooler again mostly cloudy a high fifties is is accurate there's John fear ... W J news radio nine fifty\nIn Ann Arbor this hour cloudy skies in fifty three degrees it's fifty five in Sterling Heights Lapeer at fifty to fifty nine at city airport and fifty nine degrees at Detroit metro seeing\nOn news radio nine fifty afternoon\nI'm reading Roman ... gallon justice being served acted as eleven thousand untested rape kits were found collecting dust on a shelf in Detroit police storage facility\nAnd nearly eight hundred and Seventy serial rapists had been identified\nStocks slumping for the second straight day the Dow closing down about five hundred forty five point\nThree things are behind this concern over trade with China concern about higher interest rates and concern about the next batch of corporate earnings reports there are a handful of Michigan survivors day though perceptive Ron ... Chrysler spartan motors western Michigan Lansing base Neal gin and metro area bank level one\nThat's our business editor Murray Feldman you'll have more than other live report at the bottom of the hour\nSentencing sign Oakland County teenager today after making a false terror threat at school here's WW Jane is ready and I said these tiny like\nEight tearful Ryan ... family and friends after he was granted three years' probation by judge Phyllis McMillan he had been charged with filing a false threat of terrorism a twenty year felony last February after sending a Snapchat message to a classmate it's outlying high school asking if he wanted to recreate the Parkland, Florida massacre\nThat classmate reported the message that Bernie was arrested and charged even spent a month and the Oakland County jail and has been home on a tether ever since now it's over it if he handles his probation their Bruni will be able to avoid having this incident on his permanent record\nOutside of Oakland County circuit court in Pontiac John Hewitt W. W. J. news radio nine fifty\nMe time become catty getting a three hundred sixteen thousand dollar federal grant to prepare against school threats in other emergencies here's more from W W J news radio I'm fifties wrongdoing\nEmergency management director for the county Vicki ... W W J the new personnel will work with police fire and schools on all types of emergencies\nSo in addition to the active assailant events that are now a prevalent at least and on everyone's mind we're also going to be doing planning with them for tornadoes or floods or chemical spell that can happen at the school\nWill grant also educate students and parents on these efforts to make them more aware than alarmed run Dewey W. W. J. news radio nine fifty\nSocks slumped for the second straight day we'll check your money coming up at four twenty five\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home because like having ice everywhere\nCameras or wire free set up and minutes and run on to double A. batteries last up to two years bringing technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers walking around the yard\nAnd parents loved links live feed auction the electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlink cameras systems are back in stock\nAnd right now the Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon out on a limited time offer terms and conditions applied [noise]\nIt's the twelve kids they give away on WWE Jane who's running it on fifty this hour is key word is plastic tax the word plastic\nP. A. P. L. A. S. T. I. C. that's P LA as the icy Seventy one year since they want a thousand dollars message and data rates apply remember don't text and drive the downfall is Thirteen\nHundred points in the last two days we'll check your money and to me\nThe all new radio jak combat is available now it's a totally new experienced it was listening\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink bleak video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double the batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction the electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink cameras systems or book unstuck and right now there are Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink project dot com slash radio over offer details that's blink project dot com slash radio is an Amazon Cody limited on offer terms and conditions of life [noise]\nW. W. J. new son for twenty five it's time for business from the suburban Cadillac of Troy business this mustard by ... wealth management\nAnd it leads to find the has our Bloomberg Business reporting that Lisa another stay on the market\nBroken Greg that's right and you really put it in perspective when you look at the two day losses of Thirteen hundred points today's contribution to that tallied the Dow down five hundred forty six points\nSliding more than two percent and finishing a twenty five thousand fifty three NASDAQ down more than one percent or Ninety three points sep fell fifty seven points or more than two percent the Bloomberg W. W. J. Detroit index gave back one and three quarters percent\nCrude futures were lower by three percent today they closed under Seventy one dollars a barrel the one winter on the day was gold they posted its biggest gains in more than two years and bond rates are still on the rise Jamie Cox of Harris financial group says this is a normal run of the mill correction\nThat happens to be concentrated in some of the more expensive and more notable names in technology Amazon apple and Netflix all finished lower although Facebook did eke out a win the company says that it has deleted\nFive hundred and fifty nine pages and two hundred fifty one accounts for consistently breaking its rules Facebook says some of those were so called ad farms that misled people into thinking they were forums for legitimate political debate\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nSacks of local interest sponsored by plant ran wealth management Chrysler gained eight cents close at sixteen dollars an Eighteen cents or glory are closed at thirty eight dollars into sense with the loss of fifty six cents\nThe all new radio job job that is available now\nIt's a totally new experiences which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nOr anywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political podcast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I too [noise]\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years brilliant technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nAnd we've got a reported crash in eight mile road east bounce after living in Detroit and its slowing down stocking at least one lane and heads up roadwork six Ninety six east bound from telegraphed to ice Seventy five only one lanes going to be open tonight starting at nine to five am tomorrow morning\nBrad Stone engineered drive car tires take a puncture and keep running fifty miles after a flat with Dr tires you can get to\nSafety with a flat instead of stranded on side of the roads rest easy and like birds don't drive car tires to give you peace on the road in the idol downloaded give twenty four hour traffic center Katie for doubling devil detainees reading of nine fifty\nAndy exclusive W. W. J. accuweather forecast now live in meteorologist or John fared very chilly nights and even some frost in the forecast to\nYeah absolutely or the coldest spot so late tonight will see a touch of frost I think most places probably don't but\nA few of the coldest spots will uh as the breeze shuts off later on tonight a blustery evening but again the windows die all through the night mostly cleared out a forty one of the city uh thirties and most suburbs I'm Laurel cool again a November light partly sunny the high fifty three couple to showers late in the day in the evening\nAnd most ... down to thirty eight so cool on Saturday partly somebody get up to fifty three not quite as cool Sunday mostly gone to fifty eight and then cooler again Monday mostly plotted I run around fifty an hour old timidity forty nine percent will west twenty three barometer twenty nine Seventy nine and steady\nUh we've got a Pontiac now at fifty Ann Arbor fifty one metro fifty for going out of forty one this is accurate there's John fear WW Jay news radio nine fifty\nAnd this is when you hear traffic and whether together every ten minutes on the eight to your next step day coming up at four forty eight\nComing up on news reading and I'm fifty your chance to win tickets to see President Bill Clinton and secretary Hillary Clinton in the moments that\nWhen you want a spot that burglar when he was chasing your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blinked video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school\nThey'll contracts you know subscriptions totally affordable\nAnd blink works with Alexa blink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions of\nTraffic and whether they gather on the apes and breaking news first came up to date on the road\nNews radio nine fifty W. W. J. news time for forty to\nTexas mother is in the ICU after being beat her own son as a reporter Austin York how's that he took off at high speed with police on his house\nWere called through an apartment complex to find a woman on the ground in the parking lot and bleeding from the head witnesses say her son Austin shell had struck her several times with a baseball bat and then took off in our Mazda SUV and police caught up with a vehicle they tried to pull it over but shell refused to stop\nTens of care in serious condition after New York for CBS News Dallas masses says Russia's promising to get to the bottom of today's aboard admission of a Soyuz rocket to the international space station rocket forced to make an emergency landing moments after liftoff in Kazakhstan due to what seemed like booster rocket failure\nKenny toddlers operations manager for the international space station and says Moscow has a track record of transparency\nThey already offered to us that whatever they learn that will most certainly share with us and our experience to date is that when they have these kinds of issues that will give us an understanding of what they're the best understanding of the failure isn't so we look forward to working with him on that\nTask that's being treated at the hospital Bert said to be in good condition\nW. W. J. news time for forty three and the night's caller now like you for eight three five six five seven eight will beat the box office and when a pair of tickets to join President Bill Clinton and former secretary of State Hillary Hillary Rodham Clinton for one of a kind of conversation at the Fox theater on April ...\nAgain the number to call to for eight three five six five o seven eight good luck\nWhen you want a spot that burglar when he's case in your home or after easy when asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts go subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio link is an Amazon company limited time offered terms and conditions applied\nAt six ... six maybe only temporarily bears for winter news radio nine busy there I Hope we don't have any more taxes everywhere and raising the only species that covers it all\n\nThe concert manners money making we have\nPay a Mexican by this election revealed nine fifty ... do you do\nAnd it was a bad day on the market will check your money in\nFor forty five it is a time for sports Ryan believes\nRed Wings in action and the pistons I think this one more preseason game what he says the real deal\nYeah that'd be tomorrow it will be actually out at the Breslin Center the pistons in the Cleveland Cavaliers of course then Gilbert having a a vested interest in Michigan State after going to school there so they'll wrap up the pre season then than open the season next week but the red wings regular season of course underway\nAnd they're still looking for that first victory Greg tonight do they have the Toronto maple leafs in town and you can hear it on ... on the ticket pregame it's seven ten will drop the puck\nAt seven thirty about Michigan Michigan State took part the victims media day to day MSU ... says he likes this year's team because he has a team of experience and chemistry thanks to came back and a pair of former players\nI think the the way that happens is if your ego lists and uh [noise] you know one thing just cheering especially miles is may be taught this program you can be great without being in titles and this this day and age [noise] um that's a that's not always common now as from Michigan\nIt without being in titles and this is this day and age um that's a that's not always common\nNow as for Michigan I coach John ... and he said he's looking forward to the rebuilding process of losing will Wagner in rock them on and said that he doesn't feel it needs to win the title to cement his legacy\nIs nothing about me personally this is not going to define me as a coach or whether I could win this thing\nIt's about that how what could I have done better to get ... Wagner and Duncan and Mohammed and all our guys the championship last year what what could have done better get Trey Burke gym art away and all those guys a championship is well\nBoth teams will open up the season November six over in the NFL week six gets underway today in New York it's the giants and the eagles you can hear it on CBS Sports radio twelve Seventy starting at eight and the tigers announcing Christian Stewart in Jordan Zimmermann both undergoing poor muscle repair surgery today in Philadelphia but both are expected to be ready for spring training\nWith sports Fifteen and forty five passed each hour I'm Ryan woolly WW chain news radio nine fifty\nWell hit the roads and check the chili forecasts trafficking Leatherneck\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves piping solution and more consumers energy part of a small business ... helping Michigan businesses save energy and money was consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nThere's a reason we invented things like same day delivery and TV and Jay in the same jar we love convenience which is what makes Kaiser Permanente so special we offer health care in coverage together rather than having your doctor over here and your insurer there we provide quality health care and coverage under one roof\nBring you up for other important tasks like making a quicksand which Kaiser Permanente together we thrive taping dot org slash integrated customers and hopefully the meal and if they could predict when it when he starts to run them onto the report to\nThe all new radio dot com that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you is it the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere\nW. W. J. nuisance\nFor forty eight trying to get a weather together um the AIDS\nAnd Katie while you're watching I two Seventy five south on at six mile across and your left shoulder looking to the ... with the ride home added in you are slow and go from the six Ninety six I Ninety six interchange and then sent south on Reddit telegraph\nHighly accurate weather forecasts John fear exists clearing brusque and colder tonight Los forty one of the city lows\nIn the thirties and most outlying areas some bras in some of these suburban spots tomorrow Saturday partly sunny in Chile I both days fifty three it's fifty nine AT Metro\nNo four fifty nine ... watch never diverse views radio nine fifty W afternoon\nI'm Greg Bowman and I'm Brooke yelling at least six have died after hurricane Michael tour Florida towns apart\nOr live your own lives everything we have is going on with our solar cars everything\nCBS News next with a live on a more construction barrels headed for I Seventy five a lot of details last more convictions as the last of the rape kit and neglected in Detroit are tempted\nWe have almost eight hundred and Seventy identified serial rapist I think\nNeal sports five Fifteen Red Wings on ice tonight details with Ryan lily it will be breezy and much cooler tonight pillow jumping down to forty\nOne and it was nice to\nDot com it's five o'clock\nNews CBS News on the hour we'll get lured presented by their works really\nI'm Jim ... Jeffs on assignment in the Florida Panhandle where hurricane Michael Caine was your yesterday and left a big mess behind governor Rick Scott do not try to travel home to a coastal county there was an ad the hurricane Michael or it's not safe might not be possible jury and be able to get there and you can get in a way of law enforcement and rescue workers\nCorresponded Omar via Frank as hard hit port saint Joe\nWindows blown out you have a lot of debris in the yard from the walls from the roof everything just rip down and throwing we're trees in the street we were actually hunkered down in Port saint Joe when Michael was blowing through the walls were shaking\nActually hunkered down in Port saint Joe when Michael was blowing through the walls were shaking the ground was shaking it was pretty vicious Michael is left at least six people dead including an eleven year old ... reports from birth to Georgia\nSome parts as they could say up to six inches of rain a hundred and eight counties in Jordan or under a state of emergency that's nearly Seventy percent of the state's power crews are out assessing a power losses and trying to restore power to the roughly a quarter million people who are not without it that will take days\nAnd Michael is not through yet it's currently located over North Carolina was fifty mile per hour sustained winds and lots of rain it's expected to continue on attractive will ultimately take it to Europe early next week as a tropical storm\nWhat a week it's been on Wall street and other major sell off today with the Dow dropping five hundred forty five points or to point one percent that's nearly fourteen hundred points off the blue chips in two days CBS is Jason Brooks Morgan Stanley wealth manager Jeff Trump says volatility has returned in force\nThere have been a bit of complacency for a couple of months and the increase in interest rates creates attention and and that finally showed up in the market with greater volatility\nInvestors are getting a break on government bond yields which are moving lower but that's not enough to stop the stock market from continuing it slide a scary time for two would be travelers to the international space station astronaut Anna Cosby not as their booster rocket behind this Russian Soyuz capsule failed in flight\nAnd the capsule made an emergency landing the two unharmed I. S. S. operations manager Kenny taught\nThey've already offered to us that whatever they learn that will most certainly share with us and our experience today is the one that have these kinds of issues that will give us an understanding of what their best understanding of the failure isn't so we look forward to working with them on that and\nFor now manned Russian space flights are suspended a judge in New York City with the blessing of prosecutors drop one of the six sex assault charges against former Hollywood moguls Harvey Weinstein\nProsecutors say the rest of the case is strong and that they're actually looking at possible additional charges again on Wall street and the Dow losing five forty five the NASDAQ drop Ninety to this is CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never stops on Detroit's number one news\nRadio nine fifty to only going to be a good\nAfternoon thanks for joining us on Thursday October the eleventh I'm Greg them and\nAnd I broke a gallon for W. W. J. news radio nine fifty\nDuring chillier tonight and there'll be pockets of frost of the cold has outlined spot to complete accurate the forecast is coming up\nRight now cloudy fifty four degrees that he tried city airport WW Jay news time five other three\nSold ... mall has a new water than it online auction it was sold for a little over three million dollars it's unclear what will become the mall or the space but Harper woods city manager Josephine Baker says he wants to see the space bring people together\nIncreased recreation and restaurant opportunities longer near I'd like to see a one or two hotels in the area I'd like to see a mixed use that is going to attract a socioeconomic in age groups\nCity officials say the new owner has twenty four hours to sign the purchase agreements\nThat eat everyday news time five oh for hundreds of rape is identified and nearly one hundred fifty convictions\nThe Wayne County prosecutor's office is now getting results from the last eleven thousand rape kits tested after decades of neglect W W ... Neal reports it's been nearly a decade long fight for Wayne County prosecutor Kim worthy to find the money\nAct W. W. J. news radio ... Neal\nReports it's been nearly a decade long fight for Wayne County prosecutor Kim worthy to find the money to have the more than ... eleven thousand rape kits discovered ten years ago in a Detroit police storage facility where the says all the kids have now been tested\nAre like his numbers are we have over a hundred and forty five convictions we have almost eight hundred and Seventy identified serial rapist tentacles to crime scenes and forty states\nWere these awaiting the testing results from the final six hundred in Nineteen kids the African American for Ninety challenge raised over seven hundred and fifty thousand dollars to pay for the testing of thousands of the cats Sandra McNeil WW Jane is ready on ... the\nParishioners in disbelief after the archdiocese of Detroit announced a retired priest has been removed from public ministry over allegations of abuse officials say the sexual assault claims against Robert we'd cow ski involving minors from decades ago are credible\nThat was a caretaker you don't like cleaning maintenance said it was a great guy great guy he was very number one priest in the world\nOther parishioners at St Augustine and war and say they will pray for would ... the announcement comes after state investigators requested records from the dioceses last week as part of their police investigation\nAnd Oakland County teenager learns his sentence for making a false terror threat against his high school W. W. J. news radio fifty ... with the latest\nHe was facing a twenty year felony for making a false claim of terrorism in the end Eighteen year old Ryan to Bruni gets three years' probation from circuit court judge Phyllis McMillan\nThis case stemmed from a Snapchat message to Bruni said to his outlying high school classmate back in February asking that student if he wanted to recreate the Parkland, Florida massacre\nFrom a thirty day state and the Oakland County jail a ten million dollar bond for a time and having to wear a tether it has been a stressful spring and summer for ... who cried after the hearing clearly relieved if he handles his probation without incident this will not be on his permanent record\nOutside of district court in ... John Hewitt W. W. J. news radio nine fifty\nPreventing potential school threats in ... county the emergency management office receiving a two year three hundred sixteen thousand dollar grant that will go to wall Twenty one school district's emergency management director Vicki ... says comes in the wake of that massacre in Parkland, Florida and the stabbing death and Fitzgerald high school in ...\nSome of that just an awareness level you know some of that will get into you know signs to look for unusual behaviors and and not only with the students themselves but the staff people coming on site so I think it'll just raised that education piece for all of us\nRead will hire two personnel it'll work specifically with police first responders and school districts on the potential for school violence\nMore construction barrels are headed for Seventy five in Oakland County work is scheduled to begin Monday on both directions of I Seventy five between thirty mile and Coolidge\nCrews will ride it widened the freeway shoulders which will mean lane closures for the next few months then look for a traffic shift next year putting all vehicles on the south side of I Seventy five the two year project also includes bridge replacements and other modern upgrades\nW. W. J. News I'm five away for trafficking whether together every ten minutes on the front of the ... center brought you this hour by Russia just by a roster you this hour by Audi of Rochester hills\nKatie a couple of problems out there yes broke we got a police incidents that this loan you down I Ninety four west on Michigan avenue in Dearborn is lacking and left lane and shoulder and looking through the triple a damn camps who are slower from before Van Dyke on I two Seventy five south on six\nThat is found in Michigan avenue in Dearborn is lacking in left leaning shoulder and looking through the ... dam camps who are slower\nFrom before Van Dyke on I two Seventy five south on his six mile an accident on your left shoulder Hedges slower from nine mile road and ten southbound a telegraph an accident on your right shoulder and in Detroit eight mile road east on if you're living or reported crashes locking your right in line with you slow from after Wyoming westbound eight mile road is also slow in the area\nIn Bloomfield township or broken down semi and square like road westbound\nAt telegraph is lacking you're right lane and tips to carrying called that went in if you see a problem on the road give us a call on the W. W. J. tips to line that two point four to three six W. W. J. in the ... twenty four hour traffic center Katie for W. W. J. news radio nine fifty trafficking whether sponsored by coffee espresso\nAnd the accuweather forecast snow and a meteorologist John fear it well the ah your teases for for a few days here with the summer like temperatures but we're back to reality tonight oh\nFrom after Michigan avenue tips to recall that in\nTraffic is sponsored by the Detroit princess riverboat got a police incidents on I ... for west on Michigan avenue in Dearborn that's been cleared although your traffic is very heavy from before Van Dyke as far as I can see through the Tripoli jam cams\nI two Seventy five south on six mile an accident on your left shoulder has slower from nine miles wrote in Taylor telegraph north on the Goddard an accident button your two left lanes and tips are packed called that and now it's time for the national electrical contractor associations construction alerts six Ninety six east bound\nFrom telegraph too I Seventy five only one lane is going to be open it starts at nine tonight and survive am tomorrow morning making your corporate holiday party different this year book it now on Detroit\nPrincess riverboat they're heated and enclosed so you can celebrate any party political fundraiser or birthday all year long cruise with them Saturday or Sunday for lunch or dinner called eight seven Seventy E. T. B. O. H. T. or Detroit princess dot com in the adult motive twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nNow the accuweather forecast from the family heating cooling and electrical weather center and it's about to get chillier John ...\nBlustery this evening with the wind should die off through that either chili die mostly clear about a forty one thirties most suburbs with a touch of frost of the coldest spot ... partly sunny cool I'm fifty three couple to showers leaving tomorrow tomorrow evening will speak loudly Joey the more I doubt uh thirty eight\nCool on Saturday partly suddenly arguing fifty three Sunday mostly cloudy up to fifty a cooler again Monday mostly clouded on your fifties she's actually what they're John fear again WW Jay ... radio nine fifty\nAnd right now fifty three degrees and Clinton township fifty one in Livonia\n\nOn news radio nine to\nGood afternoon I'm Brett Goldman\nAnd I've read gallon eastern mall has been auctioned off for three point one million dollars ... is expected to be turned into a mixed use facility\nResidents of Florida's panhandle ticking stuck up with a strong category for hurricane Michael slammed into the coast guard at least two deaths it's been downgraded to a tropical storm it's no over the north Carolina border jumper Delhi's the CBS whether contributor\nThe big impact over the next few hours is going to be this really heavy rain along the western kind of an edge in North Carolina up against the Piedmont up against the Appalachians 'cause it really squeezes out rainfall so flash flooding going to be the major concern is\nMore to live up to date from CBS News at five thirty one\nThe mayor of Detroit lending his name to someone else's campaign ad as election day draws closer more with W W J said he bit reporter Vicki Thomas\nDetroit Mayor Mike Duggan says it's the first TV ad he's done for a candidate in the last five years it rained county prosecutor Ken worthy also appearing in a separate TV ad for Gretchen Widmer for governor Duggins Fifteen second ad focuses on wit MERS bipartisan push\nTo get Medicaid expansion through the state legislature\nKind of leadership when eight and a prosecutor or that I are going to be on the airwaves and we're going to work up till election or\nMe while the Detroit News today out with its endorsement and the governor's race giving the not to Michigan attorney general and Republican nominee bill shooting the latest Detroit News\nPoll has him down by twelve points Vicki ... W W J news radio nine fifty W. W. J. news time five to [noise]\nThey give away on WWE juniors ready on fifth either so risky where this clown touched the word clown\nIf the Trump could they give away a W W J news radio nine fifty this hour ski where this clown text the word clown C O W in Seventy way they'd won your chance to win a thousand dollars message and data rates supplied remember don't text and drive\nIt was another gay as dean teams stock so we'll check your money coming up at five twenty five\n\nAll across the country people are coming together to speed up what we can learn about helps\nThe all of this research program is calling on one million people to join as we try to change the future of [noise]\nFuture generations\nVisit joined all of us\nAnd find out how you can become one [noise]\nIf you love puzzle game but our border crossing Kenny lay the hugely popular up again best beans it's ridiculous the pot with convicted by that if I start raining\nAgain you can't miss out on south Athens both collect tons of ... characters ... weekly events that's been update every month so you'll never get bored cracking candy out twenty Fifteen so\nClinton now or visit the apple app store or go go play to download that theme for\nPrinted out the fire that theme\nAnd you know an ad from dad [noise] alright to save money on car insurance when you bundle home an auto with progressive\n... what is it just as good wow where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] and so that's not the near that's solid stuff\nProgressive can't save you from becoming your parents but we can save your money when you go home and all across the country can Trump's companies really us and other insurers just not available little stricter situations\nThe all new radio dot com that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I can\nW. W. J. news time five twenty five time for business suburban Cadillac of Troy business desk\nAnd jet Salinger has our Bloomberg visits reports\nStocks were not able to regain their footing and the market close sharply lower again the Dow Jones industrial fell five hundred forty six points more than two percent to twenty five thousand fifty to the NASDAQ closed Ninety two points lower a loss of one of the quarter percent the S. and P. five hundred lost fifty seven point toward to present\nPresident Trump blamed the markets weakness on the Federal Reserve's interest rate hikes economist dean the Peterson the city group says the fed is just trying to normalize policy and the president's comments are not helpful\nIf you don't have commentary from those who are not within the fact that independents is very important\nPeterson says the central banks and some ...\nCrude oil futures fell three percent Seventy Ninety seven a barrel I'm ... with Bloomberg Business report on W. W. J. news radio nine fifty\nStocks have local interest sponsored by plant ran wealth management I General Motors lots Nineteen sense they close at thirty two dollars and forty one sense and Lear Corp gained two dollars and Seventy six cents they closed at one hundred and thirty seven dollars and eighty two cents\n[noise]\nAll across the country people coming together to speed up what we can learn about\nThe all of this research program he's calling on one million people to join as we try to change the future of [noise]\nFuture generations\nThis joint all of those dogs [noise] and find out how you can become one [noise]\nThe all new radio job job that is available now it's a totally new experienced it which was sitting at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on you're listening to the news and information you rely on even when you are near radio you can take their station when you're on the go\nDownload the all new radio ... job apple on your smartphone\nOr anywhere\nWhen you listen here to listen you understand more alert or they don't understand clearly\nDo we have an information\nCareer field day after day more\nWeather window the only one factory in Michigan Building commercial break windows designed to last for the guardian guarantees them for life goal eight hundred three seven seven eight eight eight six\nStudied everyday news time twenty eight time for traffic and whether to gather sponsored by Mercedes Benz or Bloomfield Hills and Katie what slowing us down\nBut we just picked up a crash on six Ninety six east sound is after American drive on your right shoulder and looking through the ... hour slower\nFrom just about to die just before the mixing bowl with the ride home also six Ninety six east on through the ... dam cans I can see that it is slow and go from telegraphed to just after I Seventy five that's what the ride home got an accident I two Seventy five north on after the Ninety six and fourteen\nExchange tips are tied called that went in and in Grand blanc a north on us twenty three right after Thompson wrote\nAn accident blocking you're left lane with you slow from the ... area and Taylor telegraph north on a gathered a reported crashes biking or two left lane stone you down in the idol downloaded give twenty four hour traffic center Katie WWE Jane is ready to nine fifty\nEveryday news time five thirty eight traffic and whether together every ten minutes on the AIDS\nAnd Katie what are we looking at this hour well we've got a crash on six Ninety six eastbound right after American drive it's on the right shoulder on six Ninety six eastbound your temper connect here\nYou know as you accept the mound eleven mile road got police temporary blocking that ramp and tips to a gym called that and\nTry to get sponsored by Ben Johnson law and I to Seventy five north on at the Ninety six them fourteen interchange\nIraqis luckier left lane and both shoulders and traffic is very slow and the and fourteen eastbound ... two Seventy five north bound got a reporter disabled vehicle on the Davis in east bound ramp to ice Seventy five north down as locking the left lane of that ramp\nAlso a disabled vehicle on square like road west on a telegraph in Bloomfield talented blocking you right lane tips to Karen called that in\nTips are packed called in telegraph north on a gathered\nGot a crash in Taylor and this one blocking or two left lanes have your car crash victim you deserve a fighting chance to get your life back on track vengeance law will fight tirelessly to get the justice you deserve\nCall one eight five five vent fights today and put a champion in your corner in the ... twenty four hour traffic center Katie for W. W. J. news radio not fifty\nGoing to be a chili on July ... here's the accuweather forecast in John fear a glossary\nFor the evening mostly clearing cooler later tonight at a forty one thirties most suburbs\nAnd for tomorrow partly sunny November like the high fifty three couple of hours later today in the evening in Chile tomorrow night down to thirty eight partly something cool Saturday I Am fifty three mostly Bloody Sunday up to fifty eight and then cooler again Monday mostly gladly high right around fifty as his accuweather John fear\nStay mostly cloudy high right around fifty this is actually what there's John fear it will be W. J. news radio nine fifty\nRight now in Ann Arbor it it's cloudy and fifty one made his forty eight in Flint and Detroit city airport and it's cloudy and safety for with wins out of the west at Ninety miles an hour\nComing up we'll tell you about a big deal for a college athlete revenues continue\nIt only takes a minute to find out if you may have pre diabetes and you can do it I Do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes and mine I read that wrong\nThey can warm night classes so visit do I have pre diabetes that Oregon take a short time\nBecause pre diabetes can be reverse\nTalking about the ... and it's ... fighters\nWendy what a spot that burglar when he's case in your home or after easy in ... John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option electric check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nTime my forte [noise]\nCollege athletes scoring a most unusual first I'm Gary non Justin ... goes to cross country runner at the University of Oregon has become the first athlete with cerebral palsy the sun and the doors when contract with Nike gear Dole out\nSo Justin says it was the most emotional moment the seven years running and his mom says do anything you put your mind to it doesn't matter if we have a disability or not last weekend after a race or representative of Nike showed up and surprised it with a three year deal\nThose around him applauded and Justin failed to his knees and cried in tears he said there's no such thing as a disability and CBS News\nW. W. J. news times like forty to education today sponsored by Oakland University\n[noise] does he or she lecture for Islamic understanding it open university take place tonight at seven o'clock in the center founders ballroom the lecture features professor had deer he'll gear him a research fellow at the Baker\nInstitute of Rice University in Houston, Texas you'll deer and will present and discuss findings of a larger scale public opinion survey conducted in several Middle Eastern countries\nThe survey looked at attitudes on the relationship between religion and politics including support for freedom and democracy Islamic law and gender equality professor ... Cooper check with open university and an expert in the middle east region says\nAttendees will be treated to some survey results they may have anticipated and some that may surprise even those who keep a close eye on politics and religion in the region a discussion will follow Laura by now W. W. J. news radio nine fifty\nIf you left has games that are sick of cracking candy play the hugely popular mobile game\nWendy what a spot that burglar when he's case in your home or after they had asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts your subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions applied\n[noise] don't even know Jacob gradually last winter and then we'll give you they give away by\nThis is turtles from cars to Michigan and I just want a thousand dollars some WWE ha\nCongratulations film if you want to be a part of the twelve kidding in way national contests\nListen to the keyword teacher or between Seventy seven PM then next thing you were just seven to one before you a chance to win the rules that W W J newsworthy you've done or said twelve K they give away I W W J costs or [laughter] I Love a message in the interests may apply\n[noise]\nCity that'd be a nice time forty five and it's time for sports and Ryan willy the red wing back and actually have broken\nThe need to win in a desperate way they have yet to pick up a victory the seasons and I do have a chance the Toronto maple leafs coming to town of course Ron oh and the has former Red Wings head\nCoach Mike Babcock as door head coach and he was asked his thoughts team replacing they're all red seats with black seats because of the appearance on TV with no fans support and give it pretty honest answer\nYou know it's like anything is a product driven right and so they got their product going in the right we are one of the best General Motors is not the national hockey league yeah they'll rebuild the the program and the thing about being good as long as we were here and doing what we did is is you sacrifice\nPart of your true because you for drugs to be good at the time but that's what the sounds one at the time we ever get yourself then you know someone's got to the standard and take the bullets in well you rebuild it and that's what they're doing right now they're doing a good job\nYou can hear the game of Ninety several and the ticket tonight starting at seven ten today was big media day in Chicago and it's like Michigan State and Michigan projected to finish at one or two in the standings this year in Michigan I go to John ... says he knows this league is pretty much more balanced the competitive than it was a year ago when he expect to see more teams and the big dance\nWe all know and it's well documented we had four teams in last year and there was a reason for that is is that we are very young league and we get we have teams that have almost everybody back\nThat are going to be terrific they're not going to be the cancer eleven and a team in this league like some of your projects they're really good\nAt turning the NFL week six gets going to die for the Meadowlands giants playing host to the eagles you can hear it on AM twelve Seventy starting an Eighteen Christian Stewart and Jordan Zimmermann both undergoing poor multiple repair surgery today in Philadelphia tiger said they expect them to be ready for spring training\nWith sports Fifteen and forty five passed each hour I'm Ryan wall e W W J news radio nine fifty\nIt's going to get chilly tonight and we have the crash liking the IT Seventy five I Ninety six and fourteen interchange chat a traffic and whether\nYou laptops the games\nWendy what a spot that burglar when he was chasing your home or after he's been asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using bling smartphone app so you know when your kids get home from school no contracts you know subscriptions totally affordable and blink works with Alexa\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions of law\nWould Eugene used on five forty a driving whether sponsored by Methodist children's home society foster today dot org\nDaddy accuweather forecast meteorologist John fear it's just clearing risk and colder than I was forty one of the city ... thirties and most of the suburbs with some frost tomorrow and Saturday partly sunny Chile had both days fifty three right\nNow fifty four metro at five Fifteen\nTo news ... news radio nine fifty\nTo all these big I'm Greg Bowman\nAnd I broke a gallon out hundreds more than five hundred points for the second day of the law says\nHe had to live apart there's a new owner of the Flint mall\n... county was the federal grant to preparing you school violence\nYou know our goal is to it that they feel safer and more secure I Ron do\nSix Fifteen Red Wings back on ice tonight the latest on Michigan Michigan State and all the sports news straight ahead [noise]\n\nSix o'clock [noise]\nHe's CBS News on the hour sponsored by del small business I'm Pam\nCoulter [noise] all streets closing bell brought down the curtain on a second day of big loss it the Dow fell five hundred and forty six after yesterday's plunge of more than eight hundred\nPoints and NASDAQ was down Ninety three today CBS is Jason Brooks\nWall Street is a volatile place these days with investors showing up stocks on worries that rising interest rates are going to hurt the economy and earnings the streets fear gauge the VIX has spiked to its highest level in eight months and the stock market is headed for its worst weeks since March at its lowest point the Dow was down almost seven hundred points on the day\nReturning home to Mexico City Florida residents find hurricane Michael left little to be recovered\nOur lives are gone you know live everything we have is gone now with all our cars everything\nAt least six people were killed in the storm in nearly seven hundred thousand homes and businesses are without power in four states\nI'm Jim ... North Carolina there's widespread flooding from tropical storm Michael across the Carolinas and Virginia\nSwift water rescues and evacuations have taken place in the north Carolina mountains and in and near Roanoke, Virginia first responders have had to rescue many people trapped in homes in vehicles by downed trees\nCelebrity visits to the White House or nothing unusual until today\nNo goals but to be bought it Kanye\nWest linked the oval office speech featured multiple profanity in lines blasting Democrats liberal will try to control a black person through the concept of racism he called for more pardons less prison compared the thirteenth amendment banning slavery to a trap door for blacks and said his meandering remarks were like a fine line\nHas multiple notes do you read a forty chess with me like it's a Minority Report\nOne message was clear as art and supported President Trump called west a smart cookie before that anytime he wants ... court noise CBS News the\nHouse media companies are pulling out of the Saudi investment conference amid growing anger over a Washington Post columnist Jim ... who vanished inside the Saudi constantly in Turkey State Department spokeswoman Heather Nauert we are all concerned about his whereabouts\nWe don't have any information on his whereabouts right now for\nWhat happened to how President Trump is searching for us\nWe're about we don't have any information on his whereabouts right now for\nWhat happened to President Trump is searching for a replacement for outgoing UN ambassador Nikki Haley but one name has been crossed off the short list\nA senior administration official says Goldman Sachs executive Dina Powell is no longer in the running Powell had served in the White House has deputy national security advisor early on in the administration this his CBS News\nDo small business technology advisors no there's nothing small about your business they provide one on one partnership and reliable del PCs with intel core processor to get this done called eight seven seven by Dale\n[noise] washing never saw on Detroit's number one they\nWere only going to be a\nGood evening and thanks for joining us on this Thursday it's the eleventh of October\nI'm red Bowman for W. W. J. news radio nine Fifteen wouldn't die off Tonight Show and I was from Austin the coldest suburbs of complete active with the forecasts coming up the skies worth fifty three degrees we'll check traffic and weather coming up on the AIDS\nW. W. J. news time six oh three\nNow you buy one of the guard windows we've\nGot a crash closing all but one lane along I six Ninety six this evening W. W. J. newsworthy fifties Katie joining us live at local from the twenty four hour traffic Saturday the\nWell just as you say that now it's only black and the two left lanes but traffic is very heavy I six Ninety six he's found after American drive again you're too left lanes are blocked and you're having and so from after orchard like road your next update said six to eight and a twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nEach land malls been sold and an online auction for a little over three million dollars right now but it questions like who is the new buyer and what will they do with them all Harper woods city manager Josephine Baker says this is what the city would like to see a mixed\nUse development and potentially retaining some of the larger structures such as maybe Macy's or shears and also establishing a civic campus adjacent to a school district\nCity officials say they want to work with a new owner is much more should be revealed in the days to come meantime W. W. J. news radio on fifties John Yoo it out and about talking with people he joins us live local with that part of our story John\nGreg you heard those anchor stores reference Sears Macy's there of course long gone and shoppers here it is led tonight like Teresa ... are wondering what's to come\nI don't know what they're going to do with it and hopefully maybe there'd be another better or [noise]\nOr maybe some hotel maybe something completely different\nYou know they they need anymore hotel\nAnd I mean I think that they downtown [noise]\nYou know but hey\nHey maybe a water park and something that might be\nHappy at least somebody's interested in investing in and making something of it\nThat the ... thing and then it won't just that they're\nThe all winter has to sign on the dotted line tomorrow Harper woods city officials hoping to learn more suit reporting live and local John ... W W J news radio nine fifty\nW. W. J. news times six o five nearly nine hundred serial rapists have been identified as the last of Detroit's neglected rape kits are finally tested W. W. J. news radio and fifties sander McNeil with the story\nThose are the numbers from Wayne County prosecutor Kim worthy says all of the more than a eleven thousand kids on the collected in a Detroit police storage room a decade ago have now been tested to date or the ...\nOf the more than a eleven thousand kids found neglected and the Detroit police storage room a decade ago have now been tested to date or the says the kids have identified eight hundred and Seventy serial rapists with ties to forty states there have been over one hundred and forty five convictions she says and they found the evidence and they can't\nWe are getting the results of the last six hundred and Nineteen hits that had was had to have a few weeks ago a few months ago became those results back now\nPrivate donations raised in the African American or Ninety challenge paid for thousands of the kids eighty percent of the victims are Black Sea Andrew McNeill W W Jane is ready ...\nRetired priest has been removed from public ministry over what the archdiocese of Detroit calls credible allegations of abuse allegations against eighty three year old Robert with cow ski involved minors from decades ago parishioners it with ... former war insured St Augustine or in disbelief for coping with the news\nBecause it's between God and father because and I believe in God and I believe and forgiveness\nIt's going to be hard but I Will get\nTheir over a dozen other priests on the archdiocese lists of priests against whom there are credible allegations\nMonroe County sheriff's department is investigating after a scuba diver made a disturbing discovery a body found in a car submerged in a Corey popular with swimmers\nThe vehicle was submerged on its roof of further search turned up another car about thirty to forty feet away that vehicle had been reported stolen from the city of Monroe the victim and the first car has not been identified yet [noise] W. W. J. news time six\nAway and it's time for trafficking whether together every ten minutes on the AIDS from the idled a motive traffic setter sponsored this hour about BMW of Rochester hills and hello Katie what's happening on six Ninety six\nMcGregor the backup keeps getting bigger I six Ninety sixties found after American driving accident is lucky or two left lanes and both shoulders looking through the ... traffic is heavy and slow from orchard lake wrote\nGot an accident on the two Seventy five north on rent and fourteen westbound as like in the left lane and both shoulders of that ... has very heavy coming from\nAnd fourteen I Ninety four east founded French wrote down in an accident by your left lane and also both shoulders now if you see a problem on the road give us a call in the WWE take tests are Lynette too for a four to three six W. W. J. N. the items that motivates twenty four hour traffic center Katie ... is ready to nine fifty\nAndy exclusive accuweather forecast meteorologist John fear it gets a chili win tonight John\nBlustery this evening with the wind should die off through that either shell a night mostly clear about a forty one thirties most suburbs of the touch of frost and the coldest spot and borrow partly sunny and cool I fifty three couple showers Leighton today tomorrow and tomorrow evening ... down to thirty eight\nCool on Saturday partly sunny I Am fifty three Sunday mostly cloudy the fifty eight cooler again Monday mostly clouded on your fifties accuweather is John ... W W J news radio nine fifty skirt\nIn the gate tea six Ninety six in the south field looks like a problem spot yes six Ninety six east on right after American Dr Iraq is walking or two left\nLanes and the right shoulder and looking to the ... you have even slow from before or to like road traffic is sponsored by ... health care center\nAt an accident on the two Seventy five north on rent and fourteen west bound blocking the left lane and both shoulders of that ramp on I Ninety four east on French route had an accident black and you're left lane and also both shoulders now it's time for the electrical workers local fifty eight construction alert I Ninety six the Jeffries westbound express lanes\nFrom Davis an avenue to the south feel free way it's going to be totally close that starts at nine tonight and goes all the way until five AM on Monday morning river gate health care center and river gate terrorists down rivers\nPremier rehab and skilled nursing facility offers exceptional physical occupational in speech therapy after illness or injury to help you get better faster call them at seven three four to eight for eight thousand and get back in the game in the adult downloaded give twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nThe accuweather forecast now the update family heating and cooling electrical weather center in John ...\nThree for the evening mostly clear and cooler later tonight at a forty one thirties most suburbs\nAnd for tomorrow partly sunny November like the high fifty three couple of ... hours late in the day and in the evening and Chile tomorrow night down to thirty eight partly something cool Saturday I Am fifty three will speak loudly Sunday up to fifty eight and then cooler again Monday mostly cloudy high right around fifty is exactly what their jobs\nThe metro news radio nine fifty dollars\nFor the evening I'm Greg Coleman here's what's happening at six twenty following an auction Eastleigh and malls been sold for three point one million dollars the Harper woods city manager says the owners are not known to the public yeah as twenty four hours to sign the purchase agreements there's massive destruction along the Florida\nPanhandle following category for hurricane Michael at least six deaths now blamed on the storm this man in Keaton beach was grateful to find his home was spared was able to take down the boards he put up over his windows\n[noise] very\nLatest in a live update from CBS News coming up at thirty\nOne while combating the opioid epidemic this is the first of its kind in the state of Michigan\nReferred to as an opioid health home\nTo recovery program that's been launched in a Twenty one county read it in northern Michigan\n... with the Michigan department of health and Human Services it's\nDesigned to help individuals on Medicaid fight the their opioid addiction who are who are getting the substance use disorder\nHelping them by coordinating services coupled with comprehensive care management the Twenty one northern most counties in Michigan's lower peninsula which this program serves have the highest per capita of Medicaid beneficiaries with opioid use disorder Jason Scott's W. W. J. news radio nine fifty\nW. W. J. new sense six twenty two it's time for the failed and report\nThe news has been filled with plenty of stories about security fraud and it looks like it's having an impact on us I'm a result in with a Sylvan report on W. W. J. news radio nine fifty\nWe've seen and heard about incidents of hacking data breaches stolen identities and now the company compare cards tells me nine out of ten consumers of taking at least one step to try to protect themselves more than half now look at their credit score regularly and they set up alerts to be notified when charges up you're on their credit cards\nMore than a third now review their credit report to see if there were mistakes are charges that are suspicious and it's paid off for another ten of found a fraudulent charge on an account and the past twelve months\nMany people complain about the cost of healthcare some even skipped doctor visits or medications because they can't afford the co pay or the deductible the Consumers Union says forty two percent of adults are now calling the doctor's office to ask the cost of the visit before they go with the film and report I'm Marie Feldman W. W. J. news radio nine fifty\nW. W. J. news time six twenty five [noise]\nIt is the twelve K they give away on WWE Jane news radio nine fifty this hour is key word is school that's the word school S. C. H. O. O L seven to eight one your chance to win one thousand dollars messaging data rate supply remember don't text and drive\nYour money and the Bloomberg Business report with another dramatic fall off the Dow down five hundred and forty six\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed and even my credit card debt and I play in town for building not man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best handles everything on life start to finish\nAnd consumer ... five star it's fairly easy on line ... and we can be approved can find it and if we're leveling business day I applied on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric chicken from anywhere using your billing smartphone app so you'll know when your kids get home from school\nBlinks camera systems are back in stuck and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions of I\nW W J news time is\nThe time for business suburban Cadillac of Troy business desk sponsored this time by Huntington Bank Jeff ... with our Bloomberg Business report\nThe Thursday session on Wall street was marked by heavy volatility and more heavy losses now Jones industrial fell five hundred forty six points more than two percent twenty five thousand fifty to the NASDAQ close Ninety two points lower a loss of one and a quarter percent\nThe S. and P. five hundred lost fifty seven points or two percent Christina Hooper of invesco tells Bloomberg Radio she thinks this will pass\nWithin the next week rather than later most likely be helped along ironing Hooper\nSees a couple of reasons for Wall Street's performance she says treasury yields spiked after German pow all said the central banks rate hike cycle going to have a long way to go\nAnd investors worries over trade wars and tariffs have been renewed the September increase in retail level inflation was smaller than expected the consumer price index send the core CPI both rose one tenth of one percent I'm Jeff ... with Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interest sponsored by plant Moran wealth management General Motors down twenty nine cents today closing at thirty two thirty one the at Chrysler game seven cents close at sixteen Seventeen Lear Corp game to forty eight to close at one thirty seven fifty for an American accent lost Twenty one sense closing at Fifteen Ninety three\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loan scholar cost information and conditions equalizing Leonard licensing office he takes animal is number three thirty initial conditions are solutions may play\nMetro PCS is now metro buy T Mobile [noise]\nNow you get new plans with unlimited high speed data all Muslims are all into the mobile network check out the new metro by the mobile today and discovered the smarter way to get unlimited metro buy T Mobile\nDuring congestion the fraction of customers even greater than thirty five six per month than it is reduced the metro customers may notice review speeds versus on the mobile customers video streams of forty percent available in some areas the store for details in terms and conditions\nThe all new radio jak combat is available now it's a totally new experience that was listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite states\nRemember thinking mom had ice in the back of her head like or a superpower was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home it's like having ice everywhere\nCameras or wire free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlink camera systems are back in stock\nAnd right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio is an Amazon company limited time offered terms and conditions applied\nW. W. J. new size\nSix twenty eight it's time for trafficking whether together every ten minutes on the AIDS Katie looks like six Ninety six kind of a mess\nYes is six Ninety six east sound right after American driving accident black and your two left lanes and both shoulders\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts you know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nSix thirty eight trafficking whether together every ten minutes on the AIDS in Katie's still looking at he spent six Ninety six here\nYes as a C SPAN I six Ninety six right at American Dr got an accident by two left lanes and both shoulders looking into the ...\nYou're happy and slow from before or just wrote traffic is sponsored by President Clinton and Secretary Clinton at the Fox theater I two Seventy five south on after six miles broken down vehicle\nAs luckier right center lanes slower from before seven now and an accident on the two Seventy five north on ramps and fourteen westbound is backing the left lane in both shoulders of that ramp I Ninety four east on a French road\nHad crashed box left lane in both shoulders in Ann Arbor I Ninety four east on if a state street an accident is lacking and left lane and traffic is heavy from the ... road ... hipster bats called that and joined President Clinton and former secretary of State Hillary Rodham Clinton Clinton\nAnd then up close and personal live event at the facts theater friday April twelve to witness a conversation discussing the most important moments in modern history from the American presidency to one of the most\nControversial elections in us history get tickets this Friday at ten am at live nascent dot com and the motive twenty four hour traffic center Katie for that but the devil DJ news Randy of night fifty\nBanned the accuweather forecast the update meteorologist John fear it could surely wanted I jump\nWhen dies off for the evening mostly clear and chilly tonight none of the thirties and most suburbs a touch of frost one of our morning\nA in some of the coldest spots the forty one of the city than partly sunny cool for tomorrow\nI fifty three ... hours late in the end of the evening will see cloudy chili tomorrow night that uh thirty eight partly sunny so cool Saturday I fifty three Sunday a little milder but still on the cool side the high fifty eight and then cooler again Monday and I just fifty this is accurate there's John fear W. W. J. news radio nine fifty\nThe current conditions in Ann Arbor right now a lot of these guys in fifty degrees it's fifty three at city airport in fifty three now at Detroit metro coming up on news radio nine fifty will take you to the White House and the president's special guest today who stole the show Kanye\nPressing and whether they gather on the apes and breaking news first came up to date on the road every\nNews radio nine fifty you're president\nTrump hosting rap star Kanye West for lunch at the White House today the purpose to discuss issues of importance to the African American community the performer put on quite a show and the president of the room was re here from CBS there's White House correspondent Steve important like\nI Love this guy right there was one of the stranger scenes White House\nResponded Stephen ... I Love this guy right there was one of the stranger scenes White House reporters have witnessed donning a make America great again hat Kanye West held forth in the oval office and cast himself as an unapologetic supporter the press when I put his hat off\nIt made me feel like Superman wet meandering monologue and supported Mr Trump featured multiple profanity Trump is on his hero's\nJourney right now and he might not have expected to have a crazy mother like Kanye West's run up and a\nSupport the president surely appreciated I'll tell you that was plenty of\nStephen ... CBS News the White House\nW. W. J. news time six forty three Red Wings back home at the el CA Sports is next\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat Kelly the bombs by insulation and more consumers energy part of the small business falls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nWhen you want a spot that burglar when he's case in your home or after he's in asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio like as an Amazon company limited time offered terms and conditions applied\nMetro PCS is now metro buy T Mobile [noise]\nNow you get new plans with unlimited high speed data a month long haul into the mobile network check out the new metro by the mobile today and discovered the smarter way to get unlimited metro buy T Mobile\nDuring congestion the fraction of customers even greater than thirty five six per month than it is reduced the metro customers may noticed review speeds versus on the mobile customers video streams of forty percent available in some areas the store for details in terms and conditions\n[noise] well the market closed lowering\nThinking five forty six losing Thirteen hundred in two days look at the latest from the Bloomberg Business report six forty five it's time for sports rhyme only the red wings back at the little Caesar's arena\nAnd now all in black in the lower to Bull Run it looks so odd to me I don't know if you've seen the photos and and I mean they're they're changing out the seats right now just a ... by the way so the bottom is still going to be read in the back is going to be black so they have Black Sea covers and it I don't know maybe if they would have built the arena with black originally wouldn't look so weird\nIt just looks out well you know they did that a tiger stadium before they moved on if you remember that they put in all new\nOrange seats and plastic and stuff getting rid of the old wouldn't seat so that and you know what I mean the buildings obviously it's beautiful it's brand new it's a year old so I mean it's still new in that in retrospect it a lot there's not a lot of memories to build from right now you think about the Joe in the Stanley Cup stair you think about the palace in the NBA titles air so right now you have two teams that are struggling and\nThey're doing this for a cosmetic reasons for TV\nUps their you think about the Palestinian B titles air so right now you have two teams that are struggling and they're doing this for a cosmetic reasons for TV but yeah if you see the photo certainly doesn't look like it did when it was first open\nBut nonetheless the wings in town tonight to take it on the maple leafs down their little Caesar arena you can hear it on several on the ticket starting at seven ten\nAll throughout the pocket seven thirty the team also announcing although officially retire the number for Jersey that's for red Kelly you played a more Stanley Cup wanting teams in any player who never played for the Canadians he won eight cups in his time between the wings and the maple leaves you played here in Detroit from Nineteen forty seven through Nineteen sixty in the maple Easter Nineteen sixty three sixty seven\nWeeks six of the NFL season gets going tonight from New York it's the giants and the eagles you can hear the actual Renee and twelve Seventy starting at eight and Christian Stewart in Jordan Zimmermann both undergoing court most repair surgery today in Philadelphia both expected to be ready for\nSpring training with sports Fifteen and forty five passed\nEach hour I'm Ryan woolly W W J news radio nine fifty thanks Ryan trafficking whether\nThe all new radio dot com app is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nTo resign Walter White county Fifteen or Twenty one I Love to do any smart to strike\nThat his homework [noise]\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents of the one in five kids with learning and attention issues go for misunderstanding to understood dot org ... by understood in the ad council\nW. W. J. N. used on six forty eight time for trafficking whether together and let's check the roads gate the six thirty six dollar problems but\nYes six Ninety six east bound to after American drive that you've got a crash that is lucky or two left lanes and look into Tripoli jam camps you're having slow from orchard like road and I do Seventy five south on it for six mile we had a ... there was a broken down vehicle in the center lane\nNow it's a craft show with about five vehicles on your right sold their tips damn called and said the weight is very heavy and I could see that you are slow and go from after nine miles road", "year": "2018", "show_name": "Greg Bowman", "city": "Detroit", "day": "11"}