{"month": "10", "state": "MI", "station": "WWJ", "content": "And that accuweather forecast from accuweather meteorologist or D divorce for the rest of today mild with rain ending this morning then breathing and turning colder this afternoon with mainly cloudy skies temperatures will return hold on to sixty early that start to fall back through the fifties this afternoon\nThen we'll see temperatures in the low fifties during that trick or treat time it'll be cloudy overnight look any more rain and alone you're forty four then tomorrow mostly cloudy chili well the rain at times in the afternoon and in the evening with a high near fifty degrees right now at Detroit metro airport we have cloudy skies it's fifty eight degrees\nTo news ... news radio nine years old\nGood morning I'm Jackie page in these other top stories that had the jury continues to deliberate over the little girl Fifteen year old he's on his ATV Charlie's Angels campaigns beginning to heat up before the November election with a live to CBS News for the details next\nTime auto beat reporter jumped Gilbert at GM headquarters were strong pickup sales means grain third quarter profit\nAlso on the way we'll check sports at eleven Fifteen your money and eleven twenty five dollars up three hundred six points and now the CBS News at eleven o'clock\nAccount\nBS news all the hours presented by capital one bank\nAnd I'm Steve caves and President Trump heads to Florida Today just the start of a final days blitz before next week's mid term elections to be a food ... in Miami\nPresident Trump is campaigning for Republicans here in Florida Today he's been trying to change the conversation to immigration and issue where Republicans things that they have the edge\nOf a campaign stop for Democrats\nThere's there's work to do the only way that happens this year if Democrats meat and exceed turn out that we've seen in previous mid term or non presidential elections and that is a high bar in several of these states\nIn a tweet President Trump defends his intention to sign in order to design do end birthright citizenship to babies born to illegal immigrants she says it will be ended one way or the other White House press secretary Sarah Sanders\nShe's laid out a number of different pieces of legislation that Congress could have easily address these problems and help fix our system and they failed to do that\nHouse Speaker Paul Ryan is among the critics of the president's plan ten Chinese intelligence officers are accused of hacking their way into American jet engine companies trying to get turbo fan technology\nThan a statement a U.S attorney accused China of trying to steal the information for commercial gain saying that China could use the information to build their own engines instead of buying American\nCBS Jeff ... says Thirteen companies and the U.S and other countries were targeted more funerals today for victims of last weekend's synagogue massacre in Pittsburgh city but it's beginning to get back to normal\nBusinesses are open along Forbes and Marie avenue Z people are returning to work navigating the police detours in the media trucks and school has started\nAnd to that end local Taylor older dice high school which is just blocks from the synagogue when the city's football championship last night beating rival Westinghouse Eighteen to aid to defend their title a moment of silence was held before the game which was supposed to have been played on Saturday\nThey'll re cops CBS News Pittsburgh\nPayroll from a deep peace says companies have a two hundred twenty seven thousand jobs this monthly economists believe the Labor Department report on hiring later on this week will show a one hundred Ninety thousand workers game\nWall Street right now the Dow is up two hundred Ninety points the NASDAQ is up one fifty this the CBS News\nCapital one is reimagining banking offering accounts with no fees are minimum that can be opened in five minutes capital one what's in your wallet capital one in a\n[noise] wash never stops on Detroit's number one news\nWorthy nine fifty to only going to be a\nGood morning and thank you so much for joining us on this Wednesday is October the thirty first in I'm Jackie page for WWE Jane news radio nine fifty\nIs going to be mild reign ends this morning breezy it'll start turning chillier the sample mainly ... guys early high near sixty and then starting to fall back to the fifties this afternoon the complete accurate there might be on the way\nAnd right now in Detroit metro airport it's cloudy\nAnd fifty eight degrees that we didn't have any news time these al ... more than one hundred Thirty years ago children's hospital of Michigan opened its doors in today and Seventy Seventy a news radio named fifties my candle reports live and local they're celebrating a new start Mike\nAnd it's a new start on a special day Halloween at children's hospital in Michigan is always big and the nurses and doctors all get dressed up and the patients are allowed to dress up including two year old highly butler her mom or a Shonda butler says this is special for over two hundred\n[laughter] ashes\nDressed up as a cute little which and as you heard there for a second Lou Ann Thomas evolved from children's hospital says this three year one hundred and fifty five million dollar redo makes it the new children's hospital of Michigan and more family friendly\nHave over two hundred thousand a year we have almost a hundred thousand emergency room than in any here\nWe have over two hundred thousand and they said I'm here we have almost a hundred thousand emergency room but in any here we've probably had about twelve thousand kids that are in that are here overnight\nAnd she says they had to make it family friendly with pull out beds other found parents could spend the night with the kids and also as family rooms where they can just spend time together and remember that two year old Kiley butler shifts three words for you on the shallower\nTrick or treat from the new Michigan children's hospital in Detroit like apple W. W. J. news radio nine fifty\nOr anything like W. W. J. new time now eleven o five General Motors posting very strong third quarter profits W. W. J. ought to be a reporter Jeff Gilbert is that the company's headquarters\nHim or two and a half billion dollars in the third quarter those earnings blowing away analyst expectations GM sold fewer vehicles but they made more money per vehicle you're in North America they earn to point B billion pre tax chief financial officer ...\nIt was an outstanding quarter there will be a strong execution despite the challenges that we face revenues where all the profits were up margins where the earlier\nGM's profit margin here in North America Tim point two percent at GM headquarters I'm ... W W J you're going to move\nTo a break in and high steady Detroit auto assembly plant details are still coming together but to Detroit police are telling W. W. J.\nThe just after three thirty this morning some unlikely more than one person busted through the gate at the ... percent assembly with stolen van three possibly for cars and driven away no details on and make model or colors of those stolen vehicles the van was silver in color with a plate number D. V. X. six seven six one\nAnyone with any information please call Detroit police\nThe voted police expected to release it more details later this morning about a deadly crash in Ninety six the accident happened on east on an eighty six new Newberg around six thirty last night the freeway was shut down we're told that the driver died at the scene no names have been released the freeway was closed for several hours after an investigation\nDeliberations continuing this morning in the murder trial of a former state trooper who's accused in the ... death of a Detroit teen last year this after the jury told a judge they were deadlocked here's WW Jay's Charlie length\nAnd a jury of six men and six women have three choices murder manslaughter or not guilty they heard testimony that best or fired his teaser after Fifteen year old Damone Grimes reaches speeds up through sixty miles an hour on his ETV\nAnd it was going about forty when he was taste buster was claiming he fired the taser in self defense or the jury is absolutely deadlocked the judge will declare a mistrial and then it will be up to the prosecutor to go for another trial Charlie wanting to build up the UJA news radio nine fifty\nDemocrats placing their bets on a strong turnout in Oakland County with three female candidates running for state Senate with that story here's W. W. J. Lansing bureau chief ...\nRepublicans from ... in the state Senate now Democrats are talking about taking control away and focusing on three female candidates in Oakland County to do it\nThat's place where we hold them every once in a ... at least three or possibly for a there is a huge momentum there among uh and we have three great a democratic women candidates\nState senator could or should tell any of the campaign for the due to get back control he says there's a fifty fifty chance that will happen reporting from ... W W J news radio nine fifty\nW. W. J. new time is now live in LA [noise]\nTime for a traffic and whether together every ten minutes on the aid from the idol downloaded route traffic center brought you this hour by BMW of Rochester hills in here\nTime for a traffic and whether together every ten minutes on the AIDS from the idol downloaded route traffic center brought you this hour by BMW of Rochester hills and here's Tracy McCaskill and Jackie we've been watching some accidents earlier but those have cleared out of the way it forced to leave so checking the route through the ... on our major freeway systems that looking\nToo bad a couple of slow down and still look illusion here along with the nine west of the winter it's walking the left lane and shoulders although through the ... keeping an eye on\nSouth but I Seventy five and north on between twelve mile at Adams wash were slower traffic traffic all clear eastbound I'm Eddie six were denied to Seventy five and a telegraph over to North on him thirty nine from I ... problem free\nAnd no accident or big slow down to report here along north by two Seventy five from I met before to the Ninety six connector now we are watching all works zone this along cellphone telegraph at maple the left lanes are closed and this is going to last actually up until November seventh at seven PM\nNow in the time and they just to get your dream quite limited time we're offering special financing for you\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable sheets loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and bring the ball so misty stays warm and I don't know ... it's like magic we let you sleep in Memphis thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping was promoted night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote goodnight bowling brash dot com spelled B O L L and branch dot com promote night\nDJ news time as loving Eighteen traffic and whether together on the eight cent here's Tracy McCaskill and Jackie chicken ...\nThis time around all clear for the most part along or major freeway systems this report sponsored by Louis financial mortgage\nTime now for the national electrical contractor association construction alert\nWe do have some work along the cell phone telegraph road at maple the left lanes are close they're also watching this we're continuing here along south when I Seventy five and north town between twelve violent Adams we do have some break lights through the stretch because of that work under way from Adam motor group twenty four hour traffic center\nI'm Tracy McCaskill WWE Jane news radio nine fifty\nAnd that accuweather forecast from the family hit including an electrical weather center mild\nThe rest of the morning to lunchtime renal end this morning and then turning chillier as we get breezy this afternoon temperatures going to start sliding back through the fifties will be in the low fifties for trick or treat time this evening and they may remaining cloudy\nChili overnight to another forty four chili tomorrow temperatures mainly in the forties rain moved back in the afternoon and evening showers friday chili is well behind the upper forties upper forties or fifties for the weekend both days right now look dry I make you were there on the juicy divorce WW James Worthy nine fifty\nAnd right now we are still looking at cloudy skies fifty two in Bloomfield fifty five in West land it's cloudy and fifty eight degrees that Detroit metro airport\nNewsworthy or nine [noise] good\nMorning I'm Jackie page and these are the top stories and eleven twenty several hundred people are inside the main sanctuary ad congregation best from home in Pittsburgh for services and remembrance of Joyce Feinberg first of the second day of funerals from the synagogue massacre services from El\nLax in Irving Younger are also scheduled for today they are among the eleven people who were killed by a gunman at the tree of life synagogue on Saturday\nA wetland woman has died in a roll over accident along I Ninety six of on your police say twenty five year old cleave ya catchy was trying to exit eastbound I Ninety six to Newberg last night when she lost control of her vehicle\nThe car flipped several times and ended up back on the freeway the woman who was injected from the vehicle the freeway was closed for several hours for that investigation\nTrick or treaters on the streets while people are driving to and from Halloween parties could spell trouble that's according to traffic experts from the University of British Columbia there are studies find the risk of car pedestrian fatalities goes up forty three percent during Halloween\nThe frequency of accidents peeks around dusk that's according to the research when it can become more difficult to see pedestrians or oncoming traffic their advice attach reflective material to the costumes carry flashlight or glow sticks and be sure that any masks with costumes cannot obstruct your child vision [noise]\nIt's a silver thirty first Nineteen sixty four Charles arrested at Boston's Logan Airport bus charged with possession of her a long\nTime it was his third Boston Six you\nThe president's science to rehab my middle never touched heroin\nAgainst them bugs in Nineteen sixty nine ... who the release of the detective movie Marlowe word is wrong during James Garner pieces over\nHis film debut\nAs it were thirty first again seven days was excellent topic of the album charts with what set was\nBrand new and rewind\nTo do experience relief from muscle cramps and sorting is used their works relief this fast acting phone was proven to prevent and relief and link cramps get their works relief today in the pain relief file at Walmart CBS Rite Aid and Walgreen pharmacies for their works relief dot com [noise]\nIt's the twelve K they give away here I W W J news radio nine fifty this hour is key word is relaxing tax relax R. E. L. A. X. to seven to eight one for your chance to win a thousand dollars messaging data rates apply and remember don't text and drive\nForget those pesky tax returns\nYeah we sort of stop paying attention and wrapped up a lot of debt right\nIt was stressful he blame me for my credit card debt and I blame him for that mandate\nIt's awesome anyway we were making breakfast ... yeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a winning the payment right\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score I clicked that met my application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nOr high I got an amazing amount it paid off credit cards and bills and lower their monthly payments that really is blending over easy yep\nOwns scramble your finances from your kitchen table visit best egg dot com slash fried best to dot com slash fried subject to credit approval actual rates fees and approval times will vary\nA voice it Josh Groban bridges tour November seventh that little Caesar's arena with very special gas the incomparable ... get tickets now at ... nation dot com and Ticketmaster [noise]\nW. W. J. news time now eleven twenty five time for business from the suburban kind of like a toy business desk and Korea with Bloomberg Business report adds\nJackie's Dr trading higher today after we found out somebody's added more workers than expected to us payrolls in October the Dow is up three hundred and forty points as backup one sixty three at the gate of two and a quarter presented the S. and P. is forty points higher\nGeneral Motors third quarter operating profits jumped twenty five percent\nGM's pretext profit for the July August September period stripping at one time factors total three point two billion dollars that was a record for the quarter GM follows that earnings report with a plan to keep cutting costs by starting a voluntary retirement program presuming employees\nThe auto makers offered buyouts salaried workers in North America but at the company at least twelve years he shares of GM or up seven point three percent now at thirty five Ninety nine right now the Dow was up three hundred thirty seven points I made Corey with a Bloomberg Business report on W. W. J. news radio nine fifty\nThe we started at fundraisers in our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and breathe double so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of sheets plus free shipping with promote night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote good night but one branch dot com spelled B O L L and branch dot com promote night\nNow is the time to visit Florence to get that more of your dream Portland time we're offering special financing for months on purchases of my Ninety nine or more she's from the largest selection guarantee everyday low prices ...\nPrices and accredited offered to help the complete that project offering ten Twenty one Eighteen today learned decor dot com\nPromotional financing available authority for credit card account topics like maybe capital thanks so she terminal suffocation for informational eligibility semi monthly payments are required\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere [noise]\nHey Sean Spicer said handling the midterm elections are approaching any anticipation is building with each passing day President Trump Will Stone ... traveling the country and campaigning for his fellow Republicans in Congress it goes without saying there's a lot on the line when Americans go to the polls on November sex\nThat they the latest news and information by subscribing to our new podcast everything's going to be All right it's available now on radio dot com I tuned or wherever you go to download your cat\nThat everything's going to be alright inscribed today and don't miss\nW. W. J. new time is now eleven twenty eight traffic and whether together every ten minutes on the eighth and here's Tracy McAfee and Jackie chicken the triple a gym camps\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote good night but one branch dot com spelled B O L L and branch dot com promote night\nNow is the time to visit Florence to get that your dream for a limited time we're offering special financing for months on purchases of nine Ninety nine or more she's from the largest selection guarantee everyday low prices ...\nBottom prices and the credit offered to help the complete that project offering ten Twenty one Eighteen today for floor decor dot com\nProfessional financing available at forty four credit card account topics like many capital thankfully she terminal suffocation for credit information eligibility Senate mostly payments are required\nSeven thirty eight traffic and whether together on the eighth and here's Tracy McCaskill and Jackie chicken a AAA Jim ...\nThis time around we are watching here or works down along southbound telegraph at maple has left lanes close network an ac actually not going to wrap up until November seventh this report sponsored by Frankie Valli and the four seasons at the Fox theater\nNow we're also keeping an eye on what's behind him fifty nine west have declined there and earlier accidents still\nThere with cars blocking the left lane and elect shoulders the road war continues with break like through the stretch along south by Seventy five and north bound\nBetween twelve mile road and Adams aside from that through the triple a jam Kansas either out all clear along the south feel free way north bound in thirty nine from I Ninety six to empty the lodge\nHere come rock and Roll Hall of famers Frankie Valli and the four seasons this Sunday night at the Fox theater Nineteen top ten hits over the years with Frankie valley in the ... get tickets now I'd lived ... dot com and ticket master from Adel download our group twenty four hour traffic singer and Tracy McCaskill WWE Jane news radio nine fifty\nAnd the accuweather forecast for back you whether meteorologist deemed to bore\nHave been mild this morning we'll see a couple of more showers come to an end and then breezy and turning chillier\nAnd then start to fall back through the fifties this afternoon chili low fifties during trick or treat time but it should be dry it will remain cloudy overnight they'll do the forty four tomorrow very chilly upper forties or best\nTo near fifty was rated times in the afternoon and evening chili showers around through the day on friday ... again in the upper forties\nWe stay on the upper forties Saturday but it looks dry with the clouds and some sunny breaks and then we're looking at mainly cloud these guys on Sunday temperatures below fifty some showers either late in the day are holding off to Sunday night I'm accuweather meteorologist need to board WW James where you're going to be\nAnd right now we're still looking at cloudy skies it is fifty three degrees in Sterling Heights also fifty three and Canton in Detroit metro airport it's cloudy and fifty eight degrees traffic in weather together sponsored by north ... nobody home design center north ... nobody\nStuff crashing candy today the day you start playing that's being\nThe first day of the rest of your life\nFun puzzle game we can find out if I start raining\nOff and tons of characters to collect pressing candy oh twenty Fifteen\nTo the apple app store for Google Play to download for free\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable sheets loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and breathe double so Missy stays warm and I don't know ... it's like magic we let you sleep with them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteen stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping was promoted night\nThat's fifty dollars off plus free shipping right now at Boeing branch dot com promote goodnight bowling brash dot com spelled B O L L and branch dot com promote code night\nThere on the and bringing you keep up on the road\nNewsworthy nine fifty\nWWE Jay do time is now eleven forty two\nFor the third time since September of Chinese intelligence officers are now accused of stealing information from American corporations ten Chinese intelligence officers hackers and company insiders are now facing espionage charges a federal indictment unsealed yesterday accuses them of conspiring to steal commercial jet engine technology\nThan a statement a U.S attorney accused China of trying to steal information for commercial gain saying that China couldn't use the information to build their own engines instead of buying American\n[noise] that was CBS News correspondent Geoff to gays [noise]\nA man was shot and killed while a woman was wounded passing out flyers last night in a Detroit neighborhood police say the twenty four year old victim got into an argument with another person before being shot to death near Chandler park on the city decide\nThis aspect took off on foot and remains at large investigators say they don't believe the shooting was connected to the flyers for a nonprofit organization but\nAt least don't believe the shooting was random either\nResearchers at Mount Sinai Hospital in New York has found most common medications taken during pregnancy do not put the mother higher risk for having a child with autism I'm Jealous\nSame two exceeds any expectation or any dream I could've ever had\nAbout a hospital I was told we wouldn't get a bill or I didn't quite process that houses possible it's possible through all the wonderful people who donate I don't know if they are aware of what they do they're saving children's lives every day\nSaint Jude children's research hospital finding cures said in children learn more at Saint Jude dot org\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and breed the ball so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks ago the bowling branch dot com today for fifty dollars off your first set of sheets plus free shipping with promote code night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com ... night but one branch dot com spelled B O L L and branch dot com promote code night\nDo time now live in forty five time for sports and here's Tony Jackie is back to work today for the lions as players and coaches are set to hit the fields and Allen park for the first practice of the week in talking with reporters just a few minutes ago head coach pat Patricia made us per first public statement about the trade of golden take to the Philadelphia Eagles yesterday\nNot an easy day yesterday when a when the trade deadline comes a you know there's a lot of difficult decisions that are made in the NFL um you know multiple times during the course of the year uh yesterday is one of them and um you know from our process um you know we try to evaluate everything the best we can and um you know try and make the best decision we can as we move forward\nA trade of take now puts the onus on Marvin Jones junior and Kenny Golladay to increase their production in the lion passing game beginning was Sunday contest in Minnesota against the Viking today also a day of game planning at Michigan and at Michigan State as those teams prepared to return to a game action Saturday\nBut we'll ... we'll battle Penn State of the big house while the Spartans will hit the Maryland for contest against the turbans\nI'll talk back to back set of games will come to a close for the pistons tonight if they're in Brooklyn for a showdown against the nets tip off at seven thirty complete coverage of that game is on Ninety seven one the ticket with sports Fifteen and forty five past the hour I'm Toni T. W. W. J. news radio nine to\nDownload the all\nThe time that they are to get that your dream Portland time we're offering special financing for some time purchases if my wife she's from the largest selection guarantee everyday lives ...\nPrices and excited offered to help you complete that project offering ten Twenty one Eighteen of course have learned decor dot com\nFinancing available authority for credit card account topics like many capital thankfully she turns suffocation for informational eligibility send them to the payments are required\nAnd this was lieutenant governor just in Fairfax and we have an important election on November the six Hampton Roads has an opportunity to elect a champion for our community Democrat Elaine Luria for Congress Elaine is a former navy commander bomb in small business owner governor north of me and I are both supporting Elaine Luria\nBecause she's the partner we need in Congress to help create jobs improve our schools and protect our civil rights vote for Democrats Elaine Luria for Congress I'm Elaine Larry and I ...\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and bring the ball so misty stays warm and I don't know ... it's like magic we let you sleep in Memphis thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with promote night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote goodnight bowling brash dot com spelled B O L L and branch dot com promote night\nAnd then for tomorrow cloudy and Chile with the rain at times in the afternoon and in the evening with behind your fifty for friday cloudy and Chile with showers with a high and you're forty nine and then for Saturday chilly at times has clients answered sunshine we'll see how you're forty eight right now it Detroit metro airport is cloudy and fifty eight degrees\nTo news wash ever to use radio nine busy all the only\nGood morning I'm Jackie page and these are the top stories ahead drug related deaths around the rise in one local county I'm Dr deanna lights details coming up President Trump vows on Twitter that\nHe will end a birthright citizenship the details straight ahead from CBS need in Halloween at a hospital at the new children's hospital Michigan and Detroit I'm Mike Campbell\nWhat's exports at twelve Fifteen your money at twelve twenty five dollars an hour or two hundred eighty seven points and now CBS News coverage the world at twelve noon\nDot com\nThe news on the hour sponsored by their works release\nI'm Steve cave from the White House press secretary says an executive order is just one way to attack and immigration issues\nThere are a number of options the president's looking at all levels\nSarah Sanders defends the president's intention to sign an order that's aimed at ending the citizenship birthright for babies are illegal immigrants she blames Congress for inaction White House correspondent Steven port\nOn traveling on Twitter to end birthright citizenship one way or the other the president argues the fourteenth amendment shouldn't apply to the children of illegal immigrants or so called birth tourists who travel here just to have their babies\nBut most legal scholars say Mr Trump's interpretation of the amendment is flawed noting the Supreme Court in Eighteen Ninety eight rejected the argument that the word jurisdiction in the amendments text means allegiance to the immigrant parents homeland\nNone of Mexico CBS as Adrian bart is following the progress of the Central American caravan that set it to the U.S southern border\nThere are now three separate groups that Central American migrants walking through southern Mexico the farthest north has reach Hoochie ... about nine hundred miles from the Texas border organizers say most are determined to reach the U.S border crossings ... where they will ask authorities for asylum\nThey don't plan to storm the U.S border\nOr to sneak in through the desert ...\nPresident Trump heads to Florida to campaign for Republicans six days ahead of the mid term election political correspondent adult key says democratic hopes for print on turnout by young voters\nSurvey suggest history has shown that the young folks don't necessarily show up to vote is this year any different could be we won't know till Tuesday\nChinese hackers are accused of trying to steal information on jet engine technology from firms in the U.S and other countries corresponded ... federal\nProsecutors say the Chinese officers trying to steal information on tour both an engine technology while they were working to develop a similar engine for their commercial plane the hackers allegedly several tactics including injecting malware and the company's computer system\nReaction was mixed at University of Maryland now that the school says embattled head football coach DJ darken can return to his job\nI felt that they're almost for making the scapegoat and I'm really glad he's coming back it's evident that will cause more about money then you didn't get a student was\nDark and was put unpaid leave back in August after the death of a player and accusations of bullying by the coaching staff school report cited a toxic athletic department said the dark and shouldn't have to shoulder all of the blame\nWall Street right now the Dow is up two hundred sixty three points the NASDAQ hit a hundred and twenty five points\nYou shouldn't have to shoulder all of the blame Wall Street right now the Dow is up two hundred sixty three points the NASDAQ hit a hundred and twenty five points less than five hundred years or thirty is the CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] washing ever saw on Detroit's number one [noise]\n[noise]\nGood afternoon and thank you so much for joining us on this Wednesday is October thirty\nFirst time Jackie page and you're listening to WWE a news radio nine fifty lingering cloud hurting chillier this afternoon as temperatures slowly fall through the fifties so the complete accuweather forecasts coming up right now it is cloudy at fifty six degrees W. W. J. news time has now twelve o three new this mid\nDay the opioid crisis is a National Public health concern but in Washington County cocaine is also a growing problem W. W. J. health reporter Dr deanna life is here with more deanna nearly\nHalf of death related to opioids in Washington County between January in August of this year have also involves cocaine he mental love is with the Washington County health department\nPeople who are ingesting cocaine may very well be aware that there are also ingesting sentinel with it which is very deadly synthetic opioid\nFentanyl is so dangerous and deadly it takes as little as three milligrams which is the size of a grain of sand to kill an average adult male\nFifty five washed in our county residents died of opioid related overdoses between January in August of this year that's up thirty percent from the previous year live from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty\nOr a take your DNA W. W. J. new time is now twelve o four as of today WWE Jay's Mike Campbell says it's the new children's hospital of Michigan\nCEO Lou and Thomas ... says they've spent three years making a one hundred fifty five million dollar ... added\nA brand new emergency room brand new operating rooms a brand new neonatal intensive care unit\nAt your says they specifically open ended on Halloween because it's big at the hospitals nurses and doctors all get dressed up and the kids are in costumes James Harris his son Joseph Thomas has been here nine which for spinal and brain surgery\nGot a lot of trouble moving is thirty\nOne here through Russia's by opening is low and slow and got her return on his\nDad says it's pure gold searching his son smile today at the new children's hospital Michigan and Detroit like Campbell doubling up with Jake is radio nine fifty\nJurors deliberating in the murder case against former Michigan State police supermarket ... have not requested any new information from the court as of today this is the third day of deliberations for the jury who must decide if best near is guilty or not guilty of second degree murder or involuntary manslaughter\nAmiss trial could be declared if jurors cannot reach a verdict best there was charged after taste drink Fifteen year old demand Grimes who was driving an ATV on the east side of Detroit last year while fleeing from police after he was hit with the taser Grimes crashed into a pickup truck and died\nWho killed strawberry the answer could be worth one hundred thousand dollars a strawberry whose real name is Tim era green was the stripper rumored to have performed for newly elected mayor Kwame Kilpatrick at the ... mentioned here with the story is W. W. J. legal analyst Charlie liked and ...\nSo the stripper rumored to have performed for newly elected mayor Kwame Kilpatrick at the ... mansion here at the story is W. W. J. legal analyst\nCharlie liked and strawberry was murdered at a drive by shooting under towards northwest side back on April thirtieth two thousand three but it's always been the rumor that in the\nFall of two thousand two tomorrow green danced at a party at them and do you imagine no attorney Norman ... who sued the city of Detroit on behalf of the green children is offering a hundred thousand dollar reward for information that leads to the killer a judge throughout your tomb was casing there was no evidence that Detroit covered up Greene's desk\n... W J news radio nine fifty\nChrysler recalling about eighty six thousand vehicles to take care of a possible stalling risk ... W W J ought to be discovered explains\nThe recall only affecting twenty Nineteen jeep Cherokee use with two point four leader insurance\nCompany says that's a fraction of the models population but ... versus in rare instances\nThese vehicles crude stole during the celebration that's obviously a safety risk but don't cry issues are accidents have been reported gross versus dealers will fix the problem by ... flashing power train controller\nStrip Dilbert WWF ... after\nGeneral Motors divided Russ stretched to earn two dollars two and a half billion dollars\nDuring the third quarter pre tax earnings have two point eight billion in North America went beyond industry analysts expectations while GM sold fewer cars they did make more money for each vehicle that sold with the ... point two percent profit margin strong pickup and cross over sales\nHas jammed predicting a strong finish for twenty Eighteen\nMega millions tickets worth a million dollars were sold them to come and Jesse counties the state lottery office says one ticket was sold that allure I'm art on gross neck highway in Mount Clemens the other was sold at us energy distribution and Kyle wrote in Flint both tickets match the five white balls but not to make a ball\nAnd some Wayne County court clerks will be getting a raise in a letter to all clerks to president have asked me local sixteen fifty nine wrote that she has accepted an offer to give clerks with eight or more years of seniority a seven percent increase some clerk started to raise it should go to all clerks but the county turned down that request [noise]\nWW Jay news time is now twelve away traffic and whether together every ten minutes on the age from the idol downloaded Ruth ... this hour Motor City many and here's Tracy McCaskill and Jackie chicken the triple\nA jam cams this time around we are still watching here a long list on him fifty nine west of decline during earlier accident remains with cars blocking the left lane and the left shoulders the broad work continued alone both north and south bound I Seventy five between twelve violent Adams\nNo matter your reason for going out now you have far more introducing new favorite cartoon capital one in four proceeds on Ninety four percent on entertainment what's in your wallet terms applied capital one bank usa NA\nNow is the time to visit to get more of your dream Portland time we're offering special financing for months on purchases of Ninety nine or more she's from the largest selection guarantee everyday low prices ...\nPrices and accredited offered to help you complete that project offering ten Twenty one Eighteen pointed toward today learned decor dot com\nProfessional financing available authority for credit card account maybe capital thanks so she turns ... informational eligibility semi monthly payments are required\nTo sign it out twelve Eighteen traffic and whether together on the apes and here's Tracy McCaskill and Jackie chicken that ...\nThis time around and we're still watching this one accident delay along with John I'm fifty nine west of the Quander this accident\nFrom earlier here still has cars blocking the left lane and the left shoulder is now time for the national electrical contractor association construction alert where we are keeping an eye on road work here\nAlong south on I Seventy five and north found between twelve miles wrote an Adam's we do a break like through the stretch\nThere was work here it's going to last and least until November seventh along south on telegraph in maple where the planes are closed through that stretch and then heads up that he spent six Ninety six Seventy five to telegraph all either going to close this Friday night and that's going to run through Monday\nFrom the idol down ... twenty four hour traffic center I Tracy McCaskill WWE Jane news radio nine fifty\nAnd that accuweather forecast from the family heating cooling and electrical weather center here's Carl Erickson\nAttorney chillier this afternoon it are mostly cloudy skies temperatures slowly falling through the fifties ... during trick or treat this\nSunshine returning high forty eight and mostly Bloody Sunday high fifty to this is accuweather meteorologist ... Erickson W. W. J. newsworthy oh nine fifty\nAnd right now we are still looking at cloudy skies it fifty three and can fifty one and wild lake at Detroit metro airport it's cloudy and it's a fifty six degrees\nOn newsworthy or nine [noise]\nGood afternoon I'm Jackie page and here's what's happening at twelve Twenty one if you attended the Spartans own football game versus the Wolverine that October twenty I\nWant to pay close attention Michigan State university officials say more than thirty seven thousand dollars raised during a raffle at the game remains on claimed to fifty fifty raffle held during the game raised more than Seventy four thousand dollars\nThe MSU athletics department spokesperson Matt Larsen says it they will start to diligently for the winter until December twentieth and after that and claimed winnings that go to a charity\n[noise] W. W. J. news time is now twelve Twenty one there will be increased security at New York city's annual Halloween day parade the extra police officers are just a precaution because of last year truck attack when a man mowed down people in the west side highway bike path killing eight and injuring more here's Mayor Bill de Blasio\nThis wasn't an attack on our values for that attack will not change us has not changed us and we continue on together\nWWE Jay news time is now twelve twenty two I weekend to jail for the wrong man costing the state a lot of money now that he'd have a DJ Jim Matthews explains\nSilly roles gal who county was arrested on child pornography charges in twenty eleven but he was the wrong road the real suspect to have the same first name and same last name but a different middle name any also lived over one hundred miles away now the state of Michigan has agreed the payroll one hundred fifty five thousand dollars to settle a lawsuit the\nWrong road was released after three days in jail but he says he had to ride one hundred miles home with his hands cuffed behind him the state attorney general's office filed the lawsuit but lost some key Susan's Jim Matthews doubled to object news radio nine fifty\nWWE news time is now twelve twenty to education today is sponsored by Oakland University [noise]\nDetroit mercy biochemistry students Tiffany to know earned selection is one of eight us college students to serve as a student representative at the twenty Eighteen United Nations framework convention on climate change\nNo will serve as a student representative for the American Chemical Society at the conference\nWhich takes place in Poland in December no it was not shy about the role her professors played in her intellectual development and how important they were in terms of receiving this opportunity the experience is expected to provide Tiffany with insight and perspective that only a few select students throughout the country\nWill get Laura ... W W J news radio nine fifty [noise]\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable sheets loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and bring the ball so Missy stays warm and I don't know ... it's like magic we'll let you sleep in Memphis thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteen stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with ... night\nThat's fifty dollars off plus free shipping right now at Boeing branch dot com promote night bowling\nI'm One out of every six Americans and I'm struggling with hunger\nThis isn't an incurable disease it's not an uncontrollable epidemic\nThere's enough food in this country to feed every hungry person\nThis problem it's closer than you think fortunately so what's the solution please visit Feeding America\nDot org today and find your local food bank for ways to help every dollar you donate helps provide seven meals for those around you know quietly struggling with hunger together we're Feeding America\nBrought to by Feeding America\n[noise] it's a twelve K they give away here in WWW news radio nine fifty this hour key word is charity ... chair C. H. A. R. to seven to eight one for your chance to win a thousand dollars messaging data rights applying\nRemembered don't text and drive [noise]\nW. W. J. news time is now twelve twenty five time for business from the suburban kind of like a for a business death and it was two hundred and eighty four points and the least have already has our Bloomberg Business report businesses are stepping up their hiring Bloomberg Vinnie del dude ice report spaghetti\nPie employment report chose private payrolls expanded by two hundred twenty seven thousand in October that's the biggest gain since February and atop Wall Street forecast the ATP data suggest demand for workers was fairly broad based across industries\nGeneral Motors drove right past Wall Street's forecast with its latest result the carmaker points to strong truck sales for the upbeat news demand for a higher price trucks helped make up for higher material costs and other increased expenses stemming from the trade war back in the eighties and nineties genes dominated the casual fans market but not anymore\nTwenty years after ... first pair of yoga pants us sales of active where sometimes called at leisure\nKnow top forty eight billion dollars and the Census Bureau says last year in Port of women's elastic knit pants surpass those of genes for the first time ever\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nMm it's rocky road is in our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bowling branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and bring the ball so missing stays warm and I don't ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with promo code night\nThat's fifty dollars off plus free shipping right now at Boeing branch dot com promote good night belonged branch dot com spelled B O L L and branch dot com promote night\nNow is the time to visit to get that more of your dream for a limited time we're offering special financing for months on purchases of maybe Ninety nine or more she's from the largest selection guarantee everyday lives ...\nBottom prices and accredited offered to help you complete that project ten Twenty one Eighteen of course today for learn decor dot com\nFinancing available at Florida for a credit card account topic like many capital day when she turns suffocation for credit informational eligibility semi monthly payments are required\nTo ... percent we should be doing stuff\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\nGotta didn't have any Jay do scientists know twelve twenty eight traffic and whether together on the AIDS and here's Tracy McCaskill\nAnd Jackie taken a AAA dream came this time around still watching the same accidentally without him fifty nine to ... or the accidents\nFrom a over an hour ago ... blocking the left lane and left the shoulders now aside from that checking the ride along ... my two Seventy five to telegraph moving well\nTen minutes on the AIDS and here's Tracy McCaskill and\nJackie chicken that ... this time around the traffic moving pretty well a longer major freeway system the only flow downs we're seeing here\nWith this roadwork cell phone I Seventy five and north bond between twelve mile at Adams\nYou could watch for break life in the area watching to south on telegraph in maple the left lanes closed at Bayer\nChecking the route along the route their west on six maybe six between him ten in the eye to Seventy five connector looks good at all clear along southbound emptied as well from him thirty nine to the Davis and I'm the editor motor group twenty four hour traffic center Tracy McCaskill W. W. J. news radio nine fifty\nAnd that accuweather forecast from accuweather meteorologist Carl Erickson\nMostly drive through this after you know the skies remain rather cloudy temperatures are slowly falling through the fifties antibodies will be holding in the lower fifties during trick or treating this evening mostly cloudy overnight otherwise the low forties for\nOr the ... somewhere else some rain over spread in the area in the afternoon and evening Hi fifty the chilly day on friday with a few showers her own hides forty nine and herself partly sunny on Saturday high forty eight\nBack in the low fifties on Sunday under mostly cloudy skies this was accuweather meteorologist ... Erickson W. B. J. news radio nine fifty\nAnd right now it is cloudy it's fifty three and Clinton township fifty for less than Fifteen ... metro airport it's cloudy and fifty six degrees WWE Jay do time is now twelve\nForty this trafficking weather updates sponsored by Northfield lumber is nobody home design center\nNorth ... nobody\nHeroin mixed promises but all it really does is take heroin can take your job your house your family maybe even your life\nUser when once and you can get hooked does have courage to crisis dot com to find a treatment center near you as curb the crisis dot com\nNow is the time to visit to get more of your dream Portland time we're offering special financing for months on purchases of nine Ninety nine or more she's from the largest selection guarantee everyday low prices ...\nPrices and accredited offered healthy complete that project offering ten Twenty one Eighteen to court today for foreign decor dot com\nProfessional financing available at forty four credit card account like many capital ... but she told me ... for credit informational eligibility semi monthly payments are required\nTo go there on the breaking news keep up on the\nNewsworthy nine fifty [noise]\nW. W. K. do time now twelve forty what a local filmmaker preparing to host a red carpet premiere for his latest project is W. W. case Harry lead tells us live and local everyone is invited carry that's Jackie love\nIs not enough is film number five from writer producer director Shawn Woodard the movie which will habits premiere the first weekend of November focuses on a group of college grad living and working in Detroit\nTwo of the members of course you know and she's from a suburban middle class background she'd begin dating Raymond tailor the male lead he's from the inner city so you have that identity\nAnd Raymond just happens to be the best friend and roommate of Christie's brother so what happens next\nAnd the to fall in love and relationship is that it by a chain of complications which ultimately break them apart perhaps ruby Christie's pieces that love is not know\nWhile not autobiographical the movie does touch on some of what is real life experiences\nThat idea we're kinda mirrors some of the things that I was going through a recent college graduate with my friends and I wanted something a different story above Detroit\nThe movie features a number of local actors but what are awesome man\nWanted something a different story about\nDetroit the movie features a number of local actors but what are also managed to cast actress Kim coals perhaps best known for her role as Sinclair and living single\nShe brought a lot of humor to the set and\nEven a lot of upcoming actors that we have here she was in in between set ups in a shooting of seeing she was able to impart some wisdom and you know basically just opened up a class at the that teach the actors or what to look for\nThe cast off all enclosed actors Claudia Jordan avail Crawford and Jackie Long\nAt all of them just were great to work with and I took time out to speak with the cats and give them inside on working in the business\nLove is not enough for me is friday and Saturday at the north west activities center on Detroit's northwest side for more information log on to W. W. J. news radio dot com teary lead W. W. J. news radio nine fifty\nNow that you have any time there's now twelve forty four which exports with Ryan next\nYou know Jimmy in our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at bowl and branch dot com they're unbelievably soft warm and breed the ball so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks ... dot com today for fifty dollars off your first set of shoots plus free shipping with promo code night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com from a code night but one branch dot com spelled B O L L and branch dot com promo code night\nNow did you have any changes times is now twelve forty five [noise]\nThat means it's time for sports and here's Ryan ... in the morning show over on Ninety several on the ticket today said that the chemistry of this year as Michigan team is really been amazing because of how the players get along both on and off the field\nTeam comes together and and uh really enjoys each other's company in like a like she likes playing ball likes being out of all team together I mean it usually happens on natural um that's something that the coaching staff generates\nCarbo went on to say they do not need any extra motivation for Saturday's game with Penn State is they know what is on the line as far as the playoffs are concerned that he's ... Gary ... playing the game but working towards getting back\nThe lions and the practice field and Allen park today continuing to get set for Sunday showdown with the biking so Minnesota coach Matt Patricia talked about the Trade Center golden take to Philadelphia for a third round pick in the locker room reacted when they found out\nLook we very open and honest about the conversation I think the biggest point for me to you know make sure everybody understands is um\nYou know this also shows a lot of confidence in the people that are in that room you know there's there's great players in that room and there's a lot of them and there's a lot of guys that are have opportunity to make plays and go out there and play at a high level and um you know I'm we're all good with that from that standpoint\nPatricia also said he had a long talk with Tate after the move but doesn't want to spend the rest of the week talking about it that they have a huge game on Sunday team also making a roster move they've signed former giants linebacker Kelvin shepherd to a contract and the pistons back at it tonight the wrapping up a short to game road singing the stop in Brooklyn to take on the net you can hear it\nSo making a roster move they've signed for giants linebacker Kelvin shepherd a contract and the pistons back out tonight the wrapping up a short to game road so I can stop in Brooklyn to take on the net you can hear it on several on the ticket starting at seven oh five ... Fifteen and forty five passed each hour Ryan woolly W W J news radio nine fifty [noise] the only way\nI Am incredibly incredibly proud to be efficient I think you\nTo be in a place where I Know my patients are gonna get the top notch care not only care but also at least are happening twenty four hours a day seven days a week every single person that contribute to the part of that nature family that needs to have been because of everyone that this really committed to the mission of the Jews and we're getting gave me hope\nSaint Jude children's research hospital I'm\nFinding chores seating children learn more at Saint Jude dot org\nCharity motors is driven to help donate your car to charity motor then help any charity you choose and help yourself to a full fair market value tax deduction call AAA nine away cards or does it charity motor dot org today to donate your car\nStop crushing candy today it's the day you start playing best team yet\nToday's the first day of the rest of your life and that means as a crazy fun puzzle game with can find out about their eighties\nOf characters to collect\nCrunching candy out twenty busy\nIt's at the apple app store Google Play to download for free\nThe aren't that theme\nNow is the time to visit to get that more of your dream Portland time we're offering special financing for Eighteen months on purchases of my Ninety nine or more she's from the largest selection that guarantee everyday low prices how slowly\nPrices and accredited offered to help you complete that project offering ten Twenty one Eighteen to court today learned accord dot com\nOriginal financing available authority for a credit card account topic like many capital day when she turns falls vacation for credit informational eligibility simply payments are required\nThe all new radio job job that is available now\nIt's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love you know will save your favorite stations and\nOthers do you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nFor anywhere [noise]\nHey Sean Spicer and I gave the midterm elections are approaching any anticipation is building with each passing day President Trump in full ... traveling the country and campaigning for his fellow Republicans in Congress goes without saying there's a lot on the line when Americans go to the polls on November ...\nForecast for making whether meteorologist Carl Erickson breezy turning colder this afternoon mainly cloudy skies temperatures falling through the fifties this afternoon and temperatures will be in the low fifties right around trick or treat time and then remaining cloudy overnight with low near forty four\nMostly cloudy chili tomorrow rain at times in the afternoon and in the evening with the higher fifty and then for friday cloudy and chili would see some showers in the high near forty nine right now Detroit metro it's cloudy and it's fifty six degrees\nTo news watch never style that uses radio nine fifty to only\n[noise] good afternoon\nI'm Jackie page and these are the top stories ahead\nOn this thing big GE imposed solid profits they offer some employees buyouts fine motor we reporter Jeff Gilbert\nCampaigns go into high gear and this final week before the midterm CBS News will have the details coming up next drug\nRelated deaths are on the rise in one local county I'm jak your he analyzed details coming up we'll\nCheck board at one Fifteen with Ryan willy and we'll check your money coming up at one twenty five the Dow is up to three hundred thirty three porno and now CBS News coverage the world at one o'clock [noise]\nAccount\nThe news on the hour sponsored by their works relief\nAnd I'm Steve cave and President Trump heads to Florida Today what a minute campaign stops for Republicans as a mid term elections now six days away somebody else's that'll keep says Democrats are pushing to try to take control of both houses of Congress the\nOnly way that happens this year if Democrats meat and the scene turn out that we've seen in previous mid term or non presidential election\nStudious was big Oliver is in Texas covering a tough Senate race which drawn national interest\nTax cut in a generation where common sense we want low taxes on low regulation to want lots and lots of jobs\nTo be a slam dunk for the one term senator turned into a bus ... tend to see in the state to secure vote to think a Democrat has a chance of winning and the state of Texas I Do actually looking for political change neck all of our CD a sneeze San Antonio\nPresident Trump insists the election is not the impetus for some of his immigration statements in a tweet today he defends his intention to sign an order designed to win birthright citizenship to babies born to illegal immigrants and he took a shot at house Speaker Ryan who criticized it white\nHouse press secretary Sarah Sanders\nThere are a number of things that are allowed under the law we're looking at all those ... again I go back to the president shouldn't have to do any of these things alone but Democrats are failing to work with the president\nFunerals today in Pittsburgh for the synagogue shooting victims Dr Donald ... at the hospital where the wounded are being treated\nSocial three people hospitalized two in the intensive care unit no longer required reading for medications to support the\nCost cutting move General Motors says it's offering buyouts to around Eighteen thousand white collar workers and the U.S and Canada the Google owned company called ... has gotten a key greenlight says we hear from W W J Radio's Jeff Gilbert\n... becomes the first company to be able to legally operate self driving vehicles in California without a backup emergency driver\nThey will have to monitor the vehicles remotely and have a remote operator able to take control if needed the testing will begin with way more employees in the passenger seat and expand from there\nIn Boston worker productivity is down\nThousands limit up at the big parade for the world series champion red Sox Wall Street right now the Dow was up three hundred twenty nine points there's the CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] washing never saw on Detroit's number one news\nRadio now I'm only going to be a\nGood afternoon and thank you so much for joining us on this Wednesday idiots October the thirty first happy Halloween and I'm Jackie paid for WWE Jane news radio nine fifty or many rather cloudy this\nAfternoon as temperatures slowly fall through the fifties the complete accuweather forecast coming up\nRight now with Detroit metro airport is cloudy and fifty six degrees WWE a news time is down one oh three as you heard from CBS News developing this afternoon at the very day that General Motors announces it two point five billion dollar profit the company also announcing a new round of salaried workers buyouts we get more now from W W J ought to be reporter Jeff Gilbert\nGM colds a buyout offers a proactive steps being taken at a time the company is strong chief financial officer dubious zero the Vera telling me before the announcement that while the economy is good the company can't let us\nKnow uncertain environment again that's even more important that we stick to our planet execute our plans like we have been doing\nThe ... are targeted to GM's salaried workers with twelve or more years experience about Eighteen thousand people total jumped Gilbert W. W. J. news radio nine fifty\nA recall involving the Chrysler jeep Cherokee the automatic are announcing today that it's recalling eighty six thousand twenty Nineteen jeep Cherokee with two point four leader engines because of a problem that can have the engine stone when slowing down yeah Chrysler is not aware of any incidents are accidents or injuries because of that problem mixed reviews on ...\nYou had to install them when slowing down the Chrysler is not aware of any incidents are accidents or injuries because of that problem\nMixed reviews on Kellogg's third quarter earnings the Battle Creek cereal giant had a net income of three hundred eighty million dollars but after non recurring gains was only a dollar six cents a share which is a penny short of Wall Street expectations the maker of pop tarts ed goes frosted flakes and three point four seven billion dollars in revenue\nWhich barely outpaced analysts forecast collect chairs are up six percent on the year and have increased Nineteen percent in the last twelve months\nThe opioid crisis is a National Public health concern but in Washington County cocaine is also a growing problem W. W. J. health reporter Dr Dana lights has more\nNearly half of death related to opioids in Washington County between January in August of this year have also involves cocaine he mental Loveluck is with the Washington County health department\nPeople who are ingesting cocaine may very well be unaware that they're also ingesting fat no with it which is very deadly synthetic opioid\nFentanyl is so dangerous it takes as little as three milligrams or the size of a grain of sand to kill an average adult male from the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty\nHalloween and while in the hospital can be tough especially on kids but WWE Jay's Mike Campbell says it they're celebrating the data huge way at the new children's hospital of\nMichigan hope sovereign is twenty two she's been coming here for brain and back surgery since she was born\n\nElder doctors and nurses here get dressed up in costumes the kids are in costumes as well and CEO low in Thomas ... says they just finished a three year one hundred fifty five million dollar upgrade\nPerfectly made the opening on Halloween Halloween is a huge deal in the hospital and you can see our nurses are dressed up our doctors are dressed up as kids have to unfortunately the in the hospital on a holiday we go out in the eye and make sure that we still celebrate with them and make them feel like they're kids as they are\nAnd they are they're celebrating Halloween at the new children's hospital of Michigan and Detroit Mike Campbell doubling doubling Jay news radio nine fifty\nThe candidates for governor making their final pitch is before the Detroit Economic Club which is just under a week to go before the election Democrat aggression Widmer was asked how she would improve education three point\nFive billion dollars have been taken out of our public schools tobacco the general fund that we've seen our our rankings fall further and further behind our kids deserve better and that's why as governor I'm going to make sure that no dollars are taken out of school I had fun Republican ...\nI Want to make sure the regret our schools they threw a provider report card for families so they can see how their school is faring I Believe in a sentence widow award grants those schools that are showing higher performance and as governor I'll have a ... director as a cabinet member person because of the significance reading\nThe election is on Tuesday polls show that it appears at Michigan voters are poised to support legalizing marijuana W. W. J. lengthy ... takes a look at the segment of those voters that the opposition will target between now and Tuesday\nIf you look behind the numbers in the Detroit News poll that fifty seven percent support for legalized pot it shows that only forty three percent of those folks are strongly supporting it which means\nThere's fourteen percent that could be swayed and the eleventh hour last minute effort by the opposition including prosecutors law enforcement the medical community the business community and others to kill this proposal will focus on that fourteen percent open to me\nThere shouldn't including prosecutors law enforcement the medical community to business community and others to kill this proposal will focus on that fourteen percent hoping to make them flip to the no column and not but yes\nThere still will also come down to a generational vote as young people between the ages of Eighteen and twenty nine eighty six percent support legalize pot well those over sixty five older thirty nine percent voting yes reporting from ... W W J news radio and I get [noise]\nThat we've got a new kind of went away traffic and whether together every ten minutes on the H on the idol downloaded rip traffic than are brought to you this hour by portion of the motor city and here's Tracey\nAnd Jackie we have picked up an accident here are checking the triple a jam came along but Southfield freeway south on him thirty nine service drive in Michigan avenue that right lane is locked traffic on the ramp from him thirty nine and seeing them slower traffic due to this accident\nTo be in place where I Know my patients are going to get the top notch care not only can research happening twenty\nThe all new radio jog combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere [noise]\nThat was good news time is now one Eighteen traffic and whether together every ten minutes on the ... and here's Tracy McCaskill and Jackie this\nReport sponsored by try on solutions checking their AAA GM cams we still have an accident tier along south I'm thirty nine to service drive at Michigan avenue the right lane remains locks traffic on the ramp from him thirty nine if things slow or traffic due to this accident\nNow it's time for the electrical workers local fifty eight construction alerts still watching this road works out but I Seventy five and north bound between twelve miles wrote an Adams\nWas for a break like through the stretch the work continuing along south on telegraph at maple has the left lane closed and keep in mind that this Friday night east on six Ninety six for my two Seventy five to telegraph all lanes are going to shut down until Monday from the motor\nGroup twenty four hour traffic center I'm Tracey ... W W J news radio nine fifty\nAnd the accuweather forecast from the family heating cooling an electrical weather center here's Carly er accent\nMostly drive through this after you know the the skies remain rather cloudy temperatures are slowly falling through the fifties and temperatures will be holding in the lower fifties during trick or treating this evening mostly cloudy overnight otherwise the low forties for\nOr the ... somewhere else some rain over sport in the area in the afternoon and evening Hi fifty the chilly day on friday with a few showers her own hides forty nine\nIt herself partly sunny on a Saturday high forty eight back in the low fifties on Sunday under mostly cloudy skies those accuweather meteorologist ... Erickson W. B. J. news radio nine fifty\nAnd right now we're still looking at cloudy skies it's fifty one of only fifty three and Clinton township by Detroit metro airport it's cloudy and fifty six degrees\nOn news radio nine [noise] good afternoon\nI'm Jackie page and these are the top stories at one twenty General Motors attempting to cut costs by offering buyouts to some Eighteen thousand white collar workers in North America the company made the offer today to salaried workers with twelve or more years of experience\nAnd move comes on the same day that GM reported two point five billion dollar third quarter profit company sat in a prepared statement that although it is performing well it wants to continue to reduce costs while the company and the economy are strong\nThe doctor overseeing treatment for the three synagogue shooting victims who remain hospitalized at from Saturday's attack\nSays the overall prognosis for each of them looks good Dr Donald ... is head of emergency medicine at the University of Pittsburgh Medical center he says while some of those wounded will require years of medical treatment everyone is doing better\nWhile they're much better off I suspect for most of them there's still a lot more care to be delivered\nEleven people were killed and six were wounded in the shooting at the tree of life synagogue W. W. J. news time is now one Twenty one\n... sugar this is the cause of the CBS News radio network present about certain words relieve happy Halloween the holiday where your ... other people's children the candy you hide from your own alas it comes at a time when the nation is more divided than ever\nOver the candy corn issue I have a theory that it's not really meant to mimic corn but it was actually a miniature bar graph depicting the road rules just coloration of the last human too and yet the kids don't\nYou've lost that much blood but anyway I Wish Charles Dickens had gotten a hold of Halloween Halloween Carol Bob graduate comes home after a hard day working for a screw them all started to start doing this as one holiday Scrooge got picked from is\nWhat are we doing daddy is at Christmas already know song it's better than Christmas it's Halloween we don't need screw just Gertie we're going out and ... ... ... what daddy don't need a costume us the best sport you're going to study to get my car\nThey were also CBS News radio that were\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam give their works released today and the pain relief violate your local pharmacy or their works relief dot com [noise]\nIt's the twelve K they give away I W W J news radio nine fifty this our keyword is powered text power P O W e artist seven to eight one for your chance to win a thousand dollars message of data rights apply remember don't text and drive business\nOwners led tried in our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bowling branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our plan all betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and breed the bull so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with ... night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote good night bowling branch dot com spelled B O L L and branch dot com promo code night\nWWE a news time is now one twenty four\n[noise]\nIt's a twelve K they give away here WWE Jay news radio nine fifty this our keyword is power text power a POW we artist seven to eight one for your chance to win a thousand dollars messaging data rates apply remember don't text and drive they were supported it fundraiser\nWhat do you every time you went out you can cash in now with the capital and save your car you are in four percent cash back on dining and entertainment like learning more about\nEach other on your first date you pay the over or just don't bring you hit the high notes that your favorite karaoke bar\nNo matter your reason for going out now you have four more introducing new favorite cartoon capital one for proceeds on mining and four percent on entertainment what's in your wallet terms applied capital one bank usa NA\nNow is the time to visit to get more of your dream for a limited time we're offering special financing for months on purchases of my Ninety nine or more she's from the largest selection guarantee everyday low prices ...\nPrices and accredited offered to help you complete that project is Twenty one Eighteen pointed toward today learned decor dot com\nRacial financing available authority for credit card account topics like many capital thanks so she turned suffocation for credit informational eligibility semi monthly payments are required\nW. W. J. do so I'm not one twenty five time for business from the suburban Cadillac and for a business desk at least have already with Bloomberg Business report Facebook stock took a ride in after hours trade first falling after the company reported revenue and use their numbers\nThat were below forecast for most of the recent quarter but then in the companies' earnings\nThe ... General Motors has posted July to September earning profit and revenue far exceeded forecast with more vehicles sold and it didn't have to slash prices are slap on big incentive to sell those vehicles meaning profit margins jumped\nThe economy keeps generating jobs this month the private sector added two hundred and twenty seven thousand jobs that was forty thousand more than the Bloomberg consensus forecast of analysts the September result from payroll company a D. P. was paired back a bit to two hundred Eighteen thousand\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty right where you are I just want you to write\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bowling branch makers of the world's most comfortable sheets loved by three us presidents if you're like us you'll love our plan all betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and breathe double ... warm and I don't know ... it's like magic we let you sleep with them for thirty nine if you're not and press send them back for a full refund\nR. flannel sheets come and fourteen stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with ... night\nThat's fifty dollars off plus free shipping right now at Boeing branch dot com promote goodnight bowling brash dot com spelled B O L L and branch dot com promo code night\nWhat do you every time you went out you can cash in now with the capital and safer cars are in four percent cash back on dining and entertainment like learning more about each other and you first date you baby over or discovering hit the high notes that your favorite karaoke bar\nNo matter your reason for going out now you have four more introducing new favorite cartoon capital one in four proceed on Ninety four percent on entertainment what's in your wallet terms applied capital one bank usa NA\nNow is the time to visit to get more of your dream for a limited time we're offering special financing for months on purchases of nine Ninety nine or more she's from the largest selection guarantee everyday low prices ...\nBottom prices and accredited offered to help the complete that project offering ten Twenty one Eighteen to court today for floor decor dot com\nRacial financing available authority for credit card account topics like many capital thanks so she terminal suffocation for credit informational eligibility semi monthly payments are required\nAnd that accuweather forecast for making whether meteorologist Carl Erickson\nMore clubs then Sunday afternoon as temperatures slowly fall through the movie's doing trick or treating times this evening temperature is holding the lord lift these\nOtherwise mostly cloudy overnight low forty board it saves quality through tomorrow with rain returning to in the afternoon high fifty some showers around on friday with the highest forty nine we drive things out over the weekend with clouds and sunshine Saturday high forty eight\nMostly Bloody Sunday with the highest in the two this is accuweather meteorologists car here soon to be the BJ news radio nine fifty\nAnd we're still looking at cloudy skies fifty one of Bluefield fifty three and was slanted Detroit metro it's cloudy and fifty six degrees\nThe world's most mistake a voice Josh Groban bridges tour November seventh that little Caesar's arena with very special guest the uncomfortable and didn't ... get tickets now at live nation dot com and that ticket master twenty four seven three sixty\nThe all new radio job job at is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll see your favorite stations and\nOthers do you based on you and your news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nAnywhere\nAnd bringing you keep up to date on the\nNewsworthy nine fifty don't\nThe news time is now one forty the new children's hospital of Michigan taking the rap solve their three year one hundred fifty five million dollar upgrade today CEO ... Thomas ... says that they wanted to make the hospital more family friendly\nHave couches that pullout into bed for them to sleep rebuilt family lounges um we had to bring\nThe arm for Detroit's arts and music scene the night foundation providing the multi year commitment toward the Detroit symphony orchestra the Institute of arts as well as the Michigan opera theater and speaks organization all sharing eight million dollars that donation in addition to the night foundations thirty million dollar donation is part of the grand bargain during the city's bankruptcy [noise]\nMeet the newborn who his name might make you hungry for a bucket of chicken Harlan\nSanders parents have eleven thousand dollars coming their way\nI'm ... and I like to hear your little bit of on writing or dirty fried chicken or not\nThat Harlan Sanders but the baby named after the KFC founder and this one's a little girl\nTo boost sagging popularity of the name Harlan KFC offered to pay college tuition to whoever name their child in the colonel's honor and a pill sudden and decker Platt of southern pines North Carolina decided they wanted the money and chose the name for their new baby Harlan rose weighed in at eight pounds one ounce when she was born on September night\nThe eleven grand ... eleven herbs and spices used in KFC's fried chicken\nEver Rodrigues CBS News\nWWE Jay do this time is now one forty two [noise] the ride hailing company ... coming out with a new subscription plan the service called right path kicks off initially and five US cities the price begins at fourteen Ninety nine a month and the program gives riders a chance to lock and flat rates\nOn over ... over pool there under this program won't be subject to surge pricing\nWas CBS News business reporter Diane King hall WWE Jay news time now one forty three\n[noise] CBS I own veterans presented by their works release when it comes time to respond to a natural disaster the twenty eighth chief of the national guard bureau General Joseph ... told me the men and women serving under him live up to the national guard motto\nAlways ready always there it is a unique piece of what we do we find for we're in the community while his guards men and women play a crucial role in the recovery process the general is quick to point out it's not something they can do alone\nIs a team effort from the the first and local responders who own the immediate response fees or augmented by the national guard augmented by all of the federal installations that happened to be around to come out of their dates to save people's lives and do things regardless of what service or an\nEarth Day connecting vets dot com for\nCBS News to experience relief or muscle cramps and your legs and feet used their works really fast acting foam gift or works released today in pain relief ... your local pharmacy or their works relief dot com\n\nThe ... foundation living with cystic fibrosis could use your generous donation it will help us continue to get lung transplant grants medical assistance not covered by insurance and LBJ dollar ships to people living with cystic fibrosis the F causes chronic and fade a lung infections\nInterferes with digestion and causes many other health issues the average life expectancy for someone with Seattle is forty one years old you can help by going to the ... foundation dot org to donate I'm Laura by now and\nI Do this because I have two daughters with cystic fibrosis and I realized I could help others on behalf of all the people we've helped thank you ...\nHi my name is Michael I became a heroin addict at a very young age and high school I didn't think there was any hope for me since I've been here I've got my life back I'm drug free and that is a miracle\nThis is Jeff bombs all our life challenges the only long term the space residential recovery program in southeast Michigan no medical insurance required can challenge Detroit Toledo in Flint for addiction call each for for three five five L. I. F. E. or go to ... dot life\nToledo in Flint for addiction call aid for for three five five L. I. F. E. or go to ... dot life [noise]\nNew time is not one forty five that means it's time for sports and ah everybody's talking about your Halloween costume today right why first year that I put a lot of work into this thing when you just put it on for that too and you know working\nAround the building and got a couple of hundred dollar bills and the way Spaniards just yeah make hundreds of course a chip 'n' Dale dancer case you're wondering by the way a Michigan I coach Jim horrible who's not a chip and able to answer on the morning show ... several on the ticket today said the chemistry of this year's Michigan team has been amazing because of how the players get along both on and off the field and\nWhat if he comes together and and uh really enjoys each other's company and likes um like she likes playing ball likes being on the ball team together and made it usually happens I'm not sure oh ah that's something that the coaching staff generates\nHarpo went on to say they do not need any extra motivation for Saturday's game at Penn State as they know what is on the line as far as the playoffs are concerned and he's on ... treat black playing the game but are working towards getting back\nAs the lines were back of the practice field in Allen park today continuing to get ready for Sunday showdown with the Vikings from Minnesota head coach map Patricia talked about the trade the golden ticket to Philadelphia for a third round pick it up the locker room reacted when they found out look\nWe very open and honest about the conversation I think I'm the biggest point for me to you know make sure everybody understands is um\nYou know this also shows a lot of confidence in the people that are in that room you know there's there's great players in that room and there's a lot of them and there's a lot of guys that are have opportunity to make plays and go out there and play at a high level and um you know I'm we're all good with that from that standpoint\nHe also said that he had a long talk with said after the move but doesn't want to spend the rest of the week talking about is they have a huge game on Sunday and they also made a roster move they signed former giants linebacker Kelvin shepherd\nAnd the pistons back out tonight the wrapping up their short to game wrote swing of the stuff in Brooklyn to check on the net you can hear it on Ninety several on the ticket starting at seven oh five with sports Fifteen and forty five passed each hour I'm Ryan woolly double ... news radio nine fifty new\nThe all new radio jak combat is available now\nIt's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\nHey Sean Spicer gave in the mid term elections are approaching any anticipation is building with each passing day President Trump in full stumped traveling the country and campaigning for his fellow Republicans in Congress and he goes without saying there's a lot on the line when Americans go to the polls on November sing\nDance today the latest news and information might subscribing to our new podcast everything's going to be All right it's available now on radio dot com I tuned or wherever you go to download your cat\nThat everything's gonna be alright described today don't miss out\nWWE Jay do time is now one forty seven will check traffic and whether together and just one minute download the all new\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I open the window to stay alert [noise] probably are kids enough\nStep out of the car please [noise] I've probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car\nThe all new radio job job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nHey Sean Spicer said have launched the midterm elections are approaching any anticipation is building with each passing day President Trump in full stumped traveling the country and campaigning for his fellow Republicans in Congress it goes without saying there's a lot on the line when Americans go to the polls on November sex\nThat they the latest news and information by subscribing to our new podcast everything's going to be All right it's available now on radio dot com I tuned or wherever you go to download your cat\nThat accuweather forecast her back to whether meteorologist dean divorce actually currently works in this afternoon breeze eternity colder this afternoon it was he mainly cloudy skies temperature slowly falling through the fifties\nRadio dot com station [noise]\nCBS News on the hour sponsored by their works relief I'm Jim shown to be homeless stretch before Tuesday's elections in both Democrats and Republicans are pulling out the stops CBS his ... Ted Cruz's voted to take away health care for millions of American families\nNow this is Patrick Morsi's all take\nAway health here over the past two months more than half of all democratic ads in federal racist mentioned health care highlighting GOP opposition to Obamacare\nWe I have two hundred and Seventeen Days or two hundred and Thirteen\nAs the laws popularity has bounced back from a lower twenty Thirteen\nRepublicans are looking to stabilize losses in the house where Democrats are hoping to win control CBS just it'll keep the\nOnly way that happens this year if Democrats need and they said turn out that we've seen in previous mid term or non presidential election more\nFunerals today in Pittsburgh for victims of Saturday's synagogue gets\nA funeral for the victims of the tree of life attacked continue here in Pittsburgh for men were buried yesterday with large crowds in attendance members of the Pittsburgh Steelers franchise including quarterback Ben Roethlisberger and head coach Mike Tomlin attended the services for brothers Cecil and David Rosenthal their sister worked for the Steelers organization\nFunerals for victims Joyce Feinberg are being younger and Melbourne wax will be held today\nThey'll re cops CBS News Pittsburgh\nSecurity will be tried for tonight's Halloween parade in New York's Greenwich Village one year after that deadly truck attack that left eight dead eleven injured Mayor Bill de Blasio\nThis was an attack on our values but that attack will not change us has not changed us and we continue on together and the\nPolice counterterrorism and crowd control units will be on hand complete with dogs helicopters and links top observers\nPresident Trump said today the U.S constitution does not guarantee the right to citizenship to every one born in the country criticizing comments made by house Speaker Paul Ryan to the contrary also blame Congress for not cleaning up the country's immigration mess spokeswoman Sarah Sanders\nHe's laid out a number of different pieces of legislation that Congress could have easily address these problems and help to fix our system and they failed to do that a correspondent\nAdrian bar and there is the latest on that caravan of Central American migrants so\nBy the migrants walking through Mexico hadn't caught much travel there was one complication over the weekend but later that we negotiated with Mexican police and was allowed into an immigration building to get temporary need that Mexican authorities report so far they identify\nToo man with criminal records out of it that seven thousand both were deported back to Honduras\nOn Wall street right now the Dow is up three hundred fifty five points the NASDAQ up one Seventy two and the U.S and the has gained forty three dishes CBS News\nTo experience relief from muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never stops on Detroit's number one news\nRadio nine fifty holding and holding on to be a\nGood afternoon and thanks for joining us on this Halloween Wednesday is the thirty first of October I'm red Bowman for W. W. J. news radio nine fifty broke Allen is on assignment\nLingering cloud turning chillier this afternoon as temperatures slowly fall through the fifties so they're complete accuweather forecasts coming up\nGot ... guys this hour in fifty five degrees a complete look at trafficking weather coming up the AIDS W. W. J. new son\nWe've got cloudy skies this hour and fifty five degrees a complete look at trafficking weather coming up on the apes W. W. J. news time his two oh three General Motors offering buyouts to as many as Eighteen thousand salaried workers W. W. J. ought to be a reporter Jeff Gilbert explains\nGM calling this part of their journey to transform the company and some of these senior workers take buyouts they're still hiring all there is in areas like automated vehicles chief financial officer divvy assertive era telling me this morning that the economy remains solid\nOn the indicators like ... and household balance sheets 'em down on the overall health of the consumer and the consumer confidence remains released on doing I'm\nPosting at two and a half billion dollar third quarter profit but the company says they need to be proactive while the economy is strong Jeff Gilbert W. W. J. news radio nine fifty\nRecall involving the at Chrysler jeep Cherokee ease the automaker announced today it's recalling eighty six thousand twenty Nineteen jeep Cherokee ease with two point four leader engines because of a problem could have the engine stole when slowing down the Chrysler is not aware of any accidents or injuries due to the problem\nMore vehicles have been stolen from a stores lot near the at Chrysler assembly plant in Detroit now new concrete barriers being put in place at the Jefferson avenue assembly plant in hopes of keeping thieves away a van was used to crash through a gate early this morning police say multiple vehicles then were driven out\nThe ... from the third party managed a lot on the city's east side follows through similar ... last month police recovered at least eight vehicles take in September twenty eight\nTwo teams and a twenty six year old man had been charged in that case for vehicles were taken a week earlier from the lot it's used as a shipping yard for free at Chrysler vehicles and other brands nine ram pickup trucks ticket in may from a lot near a truck assembly plant in Warren\nKnew this afternoon Detroit's project green light expanding to another neighborhood police chief James Craig and Mayor Mike Duggan announcing this afternoon but five restaurants and the Detroit police athletic league offices in court channel in Michigan avenue have formed the court town greenlight commercial court or\nMayor Duggan says the program started in twenty sixteen just at eight gas stations in\nThe\nOf down this way\nLater we\nProject green light involves businesses installing security cameras which are connected to Detroit police W. W. J. new sent to a six deliberations continuing today in the murder trial of a former state trooper who's accused in the hazing death of Detroit teen last year here's W. W. J. city beat reporter Vicki Thomas after\nDeliberating all morning no decision yet and the trial of extra per ... ... in fact the jury has been pretty quiet not sending out any notes to the judge seeking clarification or evidence in that case after telling her on Tuesday\nThey were dead lot the jury could remain dead lot or a convict ... of second degree murder\nOr involuntary manslaughter they could also find him not guilty thinking Thomas WW James radio nine fifty\nSecond suspected an attack on a worker at a Roseville bowling alley has been a rain Roseville police say thirty one year old Clinton Kaiser of Detroit appeared in court today on assault charges he's being held on a two hundred fifty thousand dollar bond\n... during the Clinton township band branded more accused of assaulting the employee of the Apollo lanes bowling alley in October tenth\nThe victim punched and kicked allegedly hid in the head with uh\nBrandon more accused of assaulting the employee of the Apollo lanes bowling alley on October tenth the victim punched and kicked allegedly hid in the head with a bowling ball the incident was captured on surveillance video\nTwo candidates for governor talking roads healthcare and taxes at an appearance today before the Detroit Economic Club Republican bill shooting telling the crowd\nWe are to keep promises where to keep our promises when we have a temporary income tax increase we ought to make sure it is Only Temporary\nAnd so I Will eliminate the a a grand home with her income\nTax increase in for more money back in people's pockets it's important we do that\nThen would read Russian Widmer says the pension tax pass by the Republicans will bring in smaller revenues as fewer people actually got a pension\nAnd taking a smaller paycheck in the moment\nWith the deferred compensation of a pension was a promise that was er into that we should respect and we should protest and that's why I did not vote for the pension tax when the governor I push it through the legislature and that's why I Will find a repeal of the pension tax\nThat election course set for next Tuesday November the ... [noise]\nW. W. J. new sunflower weight [noise]\nAnd it's time for trafficking whether together every ten minutes on the AIDS from the idol downloaded for traffic setter brought to you this hour by Audi of Rochester hills good afternoon Tracy McCaskill what do we\nWatch good afternoon Greg we are still watching here through the triple a dream came as an accident along the Jeffrey what's on I may be six after Greenfield that right shoulder\nIs lot now he's selling this roadwork south when I Seventy five and north found between full mile an Adam's watch for brake light certainly making your way through that stretch we're watching to traffic flows not doing too bad here along the right by two Seventy five between I Ninety foreign I Ninety six\nIt's got the accuweather forecast now the family and cooling electrical weather center Carl Eric's\nMostly drive through this after you know the the skies remain rather cloudy temperatures is slowly falling through the fifties and temperatures will be holding in the lower fifties during trick or treating this evening\nMostly cloudy overnight otherwise the low forties for\nOr the ... somewhere else some rain over spread in the area in the afternoon and evening Hi fifty a chilly day on friday with a few showers around high forty nine it turns out partly sunny on Saturday high forty eight back in the low fifties on Sunday under mostly cloudy skies\nThis is accuweather meteorologist ... Erickson W. B. J. news radio nine fifty\nCloudy and fifty two in Ann Arbor right now fifty seven at city airport and fifty five at Detroit metro\nThis trafficking whether together update is sponsored by kiss the end of the road tour one last kiss march thirteenth and little Caesar's arena ticket started twenty nine fifty plus fees get tickets friday ten am it live nation dot com and ticket master\nNews radio nine to oh good afternoon\nI'm ... and here's what's happening to twenty\nGeneral Motors will attempt to cut costs by offering buyouts through about Eighteen thousand white collar workers in North America company made the offer today two salaried workers with twelve or more years of service company says that although it's performing well he wants to continue to reduce costs while the company and the economy are still strong\nSuspect in the Pittsburgh Senegal massacre as been indicted by a federal grand jury ... charges Robert ... hours with forty four counts including hate crimes\nFederal prosecutors have previously indicated they plan to seek the death penalty authority said Bowers open fire and the tree of life synagogue on Saturday killing eleven and wounding six including for police officers\nTrick or treaters out on the streets while people are driving to and from Halloween parties could spell trouble according to traffic experts from the University of British Columbia\nThere are studies find the risk of carpet history of fatalities goes up forty three percent during Halloween the frequency of accidents peeks around dusk according to research when it can become more difficult to see pedestrians are oncoming traffic their advice\nAttach reflective material the costumes carry flashlights are glow sticks and be sure any mass with costumes\nCannot obstruct your vision\nTwenty million dollar shot in the arm for Detroit's arts and music scene the night foundation providing the multi year commitment or the Detroit symphony orchestra the Institute of arts as well as the Michigan opera theater instincts organizational sharing eight million dollars\nThe donation in addition to the night foundations thirty million dollar donation it's part of the grand bargain during the city's bankruptcy\nA million dollars the donation in addition to the night foundations thirty million dollar donation part of the grand bargain during the city's bankruptcy coming up your chance to win a thousand dollars in the twelfth grade they give away on news radio nine fifty coming up at twenty three past the hour if you or someone you know is struggling with it is\nIt only takes a minute to find out if you may have pre diabetes and you can do it and do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes and mine I read that wrong\nThey can to them more than my classes so visit do I have pre diabetes that Oregon take a short time\nBecause pre diabetes can be revert\nBack to you about the ... and it's pre diabetes and when I hear\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I play in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal ad time drain so I was in my man cave researching personal loans and I found best egg have an a plus rating with a bb\nAnd best steak handles everything on line start to finish\nAnd consumer at their best at five stars rather easy on line loan out and we can be approved and funded and if we're left one business day I played on line with no impact my credit score\nJewish take credit for my wins but long story short she got an awesome loan hate off our cards and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg dot com slash radio best egg dot com slash radio subject of credit for the actual Rich Beeson approval title very\nEvery time you went out you can cash in now with the capital when the required ... percent cash back on dining and entertainment light and their first have to walk them all\nAnd for for cash back when you take your kids to the museum for the first time what would you know there's been\nNo matter your reason for going out now you have formal are introducing new cars can capitalize on four percent on mining and four percent I mean we can once your wallet terms applied capital one bank usa in a\nDouble the owning of\nThis news just end with some of the W. W. J. newsroom the judge has declared a mistrial in the case of former state trooper mark ... trial in the murder trial and the death of demonic Grimes who was riding that ETV so again the jury unable to reach a verdict\nIn that case it will now be up to the prosecutor to decide whether to retry the case WW Jay's Mickey Thomas is in the courtroom\nAnd she'll have live reports for us coming up W W J news time is now to twenty [noise]\nThat is the twelfth they give away on W. W. J. news radio nine fifty and this hour is key word is saved tax the word save essay V E seven to way they'd want your chance to win one thousand dollars message and data rates apply remember don't text and drive\nThat rally on the market the dial up four hundred points your money's not only one factory in Michigan builds commercials\nNow is the time to visit to get that your dream Portland time we're offering special financing for months on purchases of my Ninety nine or more she's from the largest selection guarantee everyday low prices ...\nPrices and accredited offered to help you complete that project offering ten Twenty one Eighteen today learned decor dot com\nRational financing available authority for credit card account topics like maybe capital thanks so she turns suffocation for informational\nThat's at least ... seats are Bloomberg Business report keeping that rally going today early so\nThat's right Greg if only we had seen these kind of games earlier in the month writes the Dow is higher by four hundred points are one and two thirds present the benchmark at twenty five thousand two Seventy four NASDAQ up almost three percent one hundred Ninety three points higher and the S. and P. gaining almost two percent or forty nine points\nMeantime the Bloomberg W. W. J. Detroit index is slightly lower the major indices though are still lower for the month the S. and peas losses about six percent\nThe NASDAQ has tumbled eight and a half percent thanks to the prolonged sell off in tech stocks their recovery is a part of the reason for today's gains after Facebook's earnings report last night it in the the rest of the so called fang stocks that apple Amazon Netflix and Google parents alphabet they're all posting sharp gains\nAnd GM says Chinese customers are buying more Cadillacs that helped as opposed to surprise jumping quarterly profit stocking GM is sharply higher up almost nine percent\nTo thirty six fifty a share sponsored by his ... small business insurance I'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nCheck of your money sponsored by living in San Bernardino jamming\nIn our house bedtime is complicated my wife has always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bowling branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and bring the ball so Missy stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with promo code night\nThat's fifty dollars off plus free shipping right now at Boeing branch dot com promo code night bowling brush dot com spelled B O L L and branch dot com from a code night\nWhat is every time you went out you can cash in now with the capital and see if your car you are in four percent cash back on dining and entertainment like learning more about each other on your first date you pay the over or just suffering can't hit the high notes that your favorite karaoke bar\nNo matter your reason for going out now you have four more introducing new favorite cartoon capital one in four percent on mining and four percent on entertainment what's in your wallet terms applied capital one bank usa NA\nNow is the time to visit to get more of your dream Portland time we're offering special financing for months on purchases of my Ninety nine or more just from the largest selection guarantee everyday low prices ...\nPrices and accredited offered to help you complete that project ten Twenty one Eighteen to court today learned decor dot com\nRacial financing available authority for credit card account topics like many capital thanks so she turned suffocation for credit informational eligibility semi monthly payments are required\nTwenty eight traffic and whether together every ten minutes on the AIDS Tracey how are things along either ... we're still watching this accident here Greg through the triple a gym cameras west bound I'm Eddie fix after Greenfield the right\nShoulder remains block not a big delayed there but this accident has not cleared we're also watching the route along with one I may be fixed and nobody between the ... six two Seventy five interchange in us twenty three moving pretty well know\nSeeing the route along with one I think they know by between the I think Ninety six two Seventy five interchange in us twenty three\nPrices and accredited offered healthy complete that project Twenty one Eighteen of course have learned accord dot com\nFinancing available at Florida for a credit card account topics like many capital day she turns suffocation for credit informational eligibility Senate mostly payments are required\nTo step up to thirty eight separate trafficking whether together every ten minutes on the AIDS what are we watching Tracy\nGreg you know we're still watching this problem along the Jeffrey than a new accident on the lodge checking the triple a jam cams\nThe largest southbound here to eight mile there was some debris and that right lane use additional caution maneuvering around that this report actually sponsored by van that Johnson law now we're also watching through the ... west ... fix after Greenfield the right shoulder blocked no\nBig delay there now but the cars to remain we still have break lights where this road work along I Seventy five south bound and north\nAnd north bound between twelve miles wrote him Adams north bound floor between six Ninety six and Thirteen miles south bound just happened to break from Rochester bow to the ice six Ninety six connector and now in Bloomfield township\nGarfield sounds found a at maple the left lanes are closed north on had the two right lanes blocked traffic heavy through his own if you're a car crash victim you deserve a fighting chance to get your life\nBack on track then Jonathan law will fight tirelessly to get the justice you deserve called ... fights today and put a champion in your corner a metal download our group twenty four hour traffic center tasty McCaskill W. W. J. news radio nine fifty\nTrafficking whether sponsored by Josh Groban in concert the accuweather forecast into your trick or treat night with Carl Erickson\nMore clubs then send this afternoon his temperature is slowly fall through the fifties doing trick or treating times this evening temperature is holding the lower ... these\nOtherwise mostly cloudy overnight low forty four essays cloudy through tomorrow with rain returning in the afternoon high fifty and some showers around on friday with the highest forty nine we try things out over the weekend with clouds and sunshine Saturday high forty eight\nMostly Bloody Sunday with the highest in the two this is accuweather meteorologist ... Erickson or W. B. J. news radio nine fifty\nLobbies guys fifty seven this hour in Taylor is fifty six and commerce and ours cloudy and fifty two degrees we've got clouds and fifty seven at city airport and fifty five degrees now at Detroit metro\nThe world's most unmistakable voice Josh Groban bridges tour November seventh little Caesar's arena with very special guests the incomparable Edina, Minnesota get tickets now live nation dot com and ticket master\nWell a ready or not here it comes time to switch over from ... to snow blowing Olympic that next mostly going\nCrushing candy today today's you start playing vaccine Denise first day of the rest of your life [noise] and that feeds into ... which can find out of ...\nThousands of tons and\nOf ...\nCracking candy and indeed\nThe apple app store Google Play to download for free [noise]\nThe our teams [noise]\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at bowl and branch dot com they're unbelievably soft warm and breathe double so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks ... dot com today for fifty dollars off your first set of shoots plus free shipping was from a code night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote good night but one branch dot com spelled B O L L and branch dot com promo code night\nAnd breaking news first came up to date on the road\nNews radio nine fifty\nW. W. J. news time to forty three as we make the transition from October to November also get ready for the change over from lawn mowing the snow blowing than wind gusts of wind guards power equipment says the earlier you can get your power equipment ready to better\nMatter what it is the first snowfall is always\nWind gusts of wind guards power equipment says the earlier you can get your power equipment ready to better\nNo matter what it is the first snowfall is always crazy and uh and you know everybody who kind of forget about it um you know it brings it to the top of mind but yeah we we get a lot of people that are absolutely thinking ahead and and get ... they don't have that hassle of when that first snow falls\nOne guard says best would guess treatment and your final tank before you emptied out so what gasses left of the carburetor won't gum up the works next spring W. W. J. news time to forty three\nI on the tax with Larry Magid if you open the Google app on a mobile device\nYou might notice something different a new feed Google is putting a news weather and other information right there in front of you and if you notice that some of the topics look familiar\nThat's because Google knows what you search for and it's likely to show you things that it thinks will interest you\nIt should come as no surprise that I'm seeing some tech stories I'm also seeing local news as well as major national and international stories it fell Google's way of saying we think we know what you want to see personally\nI'd rather they let me pick the story that interest me learning how to get the at\nThe national mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensed in all fifty states equal housing lender and MLS number thirty thirty\nIf you or someone you know is struggling with in our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and bring the ball so misty stays warm and I don't overheat it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go bowling branch dot com today for fifty dollars off your first set of sheets plus free shipping with promote night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com ... night but one branch dot com spelled B O L L and branch dot com promo code night\nDavid dials up four hundred points\nTo forty five it's a sign for sports rivalry with the world series victory parade for the red Sox today and author of Athens to sell the weight I Am wearing my Boston Red Sox evidence kind of like a tiger celebration kind of a you know seeing the two thousand\nFourteen tigers at least some when a world champion talk a championship talking with David pricey and Ken's alert a JD Martinez reports cello and yes former GM David ... but ah earlier today it was made known that this was going to be a no drinking parade throughout the streets of Boston so I don't know how they enforce that and\nThey didn't do a good job because fans were actually throwing beer to the players on the boats going down the streets of Boston and\nThis is where things got a little tricky a beer can actually damaged the world series trophy it hit it right and the flags cause it to prevent\nThey took it down inside the car they were in they were trying to fix it as best they could but certainly some more parents are going to need it but the red Sox celebrating their fourth world series title\nSince two thousand and four that's with allies are back in the practice field today now in part because they turn their attention to Sunday's game with the Vikings had backed both Christian Jones in Taylor Decker after not finishing Sunday's game with Seattle and that could map Patricia spoken answer multiple questions\nBut why they decided to trade Golden State and says he can understand why some people don't see\nFishing Sunday's game with Seattle and that good map Patricia spoken answer multiple questions but\nWhy they decided to trade Golden State and so she can understand why some people don't see how it benefits the team\nYou know it's hard it's very difficult when you're in that\nYou know one game in ... time mindset and you know that's really where we are from the standpoint of um you know two week to week for us and that's good but there's also a big picture here that you know it's good for\n'em those to keep an eye on as we move forward and that's something that we always have to consider when we you know make all these decisions whether it's during the season during the off season free agency draft whatever it is those are difficult decisions no matter when they come up\nAnd turned into the NBA pistons back on the hardwood tonight the wrapping up a two game road swing was up in Brooklyn that take on the net you can hear it on Ninety seven on the ticket starting at seven oh five with sports Fifteen and forty five passed each hour I'm Ryan wall e W W J news radio nine fifty\n... thanks rival trafficking whether\nTimidity only way you can take down\nThe all new radio job job that is available now it's a totally new experience which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\nHey Sean Spicer gave in the mid term elections are approaching any anticipation is building with each passing day President Trump's in full stumped traveling the country and campaigning for his fellow Republicans in Congress and he goes without saying there's a lot on the line when Americans go to the polls on November sing\nDance today the latest news and information subscribing to our new podcast everything's going to be All right it's available now on radio dot com I tuned or wherever you go to download your cat\nThat everything's gonna be alright described today don't miss out\nI'm voting in the mid term elections because my because\nThat everything's going to be alright described today don't miss out\nAnd whether together on the eight setting for the top that with Tracy and Greg were still watching here no delays along the east and west on I think Ninety six between Farmington Hills in Royal Oak would we do have bright lights but this road where north and south bound\nI Seventy five between twelve mile road and Adams also break life along telegraph wrote southbound at maple wrote a the left lanes are closed north founders have the right length block\nTraffic heavy through the ... from the motor group twenty four hour traffic\nCenter there will be J Radio Nice if the weather forecast the temperatures in the little fifties or in two or three\nTimes tonight and remaining cloudy overnight little fifty four fifty five degrees AT Metro now two fifty nine\nTo ... watch never Steiner staff sneezes radio nine fifty leading to all these\nGood afternoon I'm drug Bowman top stories ahead a hung jury in the murder trial of former Michigan State police ... Yuri hopefully get W W J city beat reporter Vicki Thomas we'll have more also drug\nRelated deaths are on the rise in one local county I'm back to Indiana like details coming out\nAnd General Motors and I was like a new round of salaried workers buyouts CBS News coverage the world that\nDot com station at three o'clock\nCBS News on the hour sponsored by getting loans [noise]\nI'm Jim ... the President Trump begins in eight states campaign blitz today CBS is even afford\nThem aiming to expand his party's majority in the Senate and help Republicans hold the house the president will be on the road each day between now and the election starting in Florida tonight\nWe had to Missouri tomorrow West Virginia and Indiana on friday by election day he'll have returned twice to Indiana and Missouri and Florida state's democratic incumbent senators face for medical GOP challenger\nDemocrats hoping to energize their base in these final days before Tuesday's vote as analysts believe turnout is the key to winning back the house Robert Bowers the accused shooter and Saturday synagogue attack in Pittsburgh has been indicted on multiple counts including hate crimes CBS is bill rake up\nThe federal grand jury returned to forty four count indictment against Robert Bowers for the killing of eleven worshipers at the tree of life synagogue last Saturday\nUs attorney Scott Brady set in a statement today begins the process of seeking justice for the victims of these have blacks and healing for the victims families the Jewish community and our city Bowers remains behind bars and the butler county jail about thirty miles north of Pittsburgh\nHe faces a pulmonary hearing on the charges in federal court tomorrow they'll re cops CBS\nThere are calls in the Senate from fellow Republicans for President Trump to back out of an Atomic Energy agreement with Saudi Arabia is following the killing of dissident Saudi journalist ...\nI was told young pending a letter to President Trump effectively saying that the investigation into the murder of them all to show hey I'm as well as Saudi Arabia's actions as it relates to Yemen and Lebanon have raised a quote serious concerns about the transparency accountability and judgment of\nCurrent decision making in Saudi Arabia\nCalifornia is giving way more green light to test autonomous vehicles on public roads W. W. J. Jeff Gilbert\nWay more plans to start small with his own employees and the passenger seat for simple drives near its headquarters it'll expand from there they hope to eventually have a driverless shuttle service where am I was already been conducting driverless experiments in Arizona and hopes to larger commercial service there by the ...\nYear another good showing on the jobs front corresponded Diane King whole according\nTo payroll processor ATP companies added two hundred and twenty seven thousand jobs this month\nAnd that was more than expected the services sector once again accounted for most of the games and been companies did the most hiring heat in mind the ATP report is used as a benchmark for the government's monthly jobs report su friday on Wall street developed for forty\nSix to CBS News national mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states people housing lender and MLS number thirty thirty\n[noise] washing never wanted proof number one we\nWere the only\nGood afternoon and thanks for joining us on this Halloween It's Wednesday October thirty first time ...\nAnd I ... for W. W. J. news radio nine fifty\nQuantity withdrawing for trick or treaters receiving will harm arena times tomorrow tomorrow night because we'd occupied weather forecasts coming up\nRight now ... fifty seven degrees at Detroit city airport W. W. J. news times three\nDeveloping news this hour miss trials been declared the murder trial of former Michigan State police trooper mark ... W W J newsworthy on fifties Vicki Thomas joining us live in local now with the latest Vicki\nAnd then carry a Greg it's still here at\nA Frank Murphy hall of justice they declined to talk to the uh\nA prosecuting attorney as well as ah the attorneys former best nerves though we are standing outside right Murphy hoping that a week and find out what the what was going on and that you're a a room during deliberations but they\nTried for three days of for the second day they sent out a note\nOr in a row thing that they were deadlocked or the judge a finally declaring a myth trial after getting a note or when the jury came back from lunch today we talk to both sides of the family of um [noise] the team that was killed after being a shot\nBut with that taser as very disappointed in the verdict or they don't think that the prosecution\nDid a as well as it could have done or they are certainly looking forward to a rape trial\nAnd the attorneys for mark that nerve Richard Carver Chino says that while it is a bit of a recovery for that or he certainly can not\nPlaying and his life or his future at this\nPoint a given that he will be facing a retrial\nPossibly some time in the spring there is a pre trial hearing coming up next Wednesday and a child date will be that at that\nTime but the up ... years off that has led W W gay know that they will be reached trying this case reporting live and let local at quite murky hall of justice ... W W J news radio\nOh that they will be reached trying this case reporting alive and local at like murky hall of justice ... W W J news radio nine fifty\n... took the stand in his own defense in that case W. W. J. legal analysts Charlie lengthened says that likely helped his cars\nBeing remorseful on the stand is helpful effect that he even took the stand most people on the jury know that you know descendants don't they stay on it but if you want to get out of the defense of self defense you almost have to stay on as the sun and otherwise are we going to get that it\nMessenger was charged with second degree murder jurors also could have chosen involuntary manslaughter but they could not reach a unanimous decision to convict or acquit\nAnother man charged with a brutal attack them comb county bowling alley W. W. J. newsworthy line fifties Jackie page where the uptick\nThe second suspect thirty one year old Clinton Kaiser of Detroit on assault charges Kaiser end another man brand in more of Clinton township or both accused of assaulting the employee of the Apollo lanes bowling alley on October tenth\nThe victim was punched and kicked and allegedly hid in the head with a bowling ball all of it captured on surveillance video and tips from the public led to the to arrest Kaiser is being held and a two hundred and fifty thousand dollar bond\nJackie page W. W. J. news radio nine fifty\nWho killed camera green there is a one hundred thousand dollar reward for information leading to an arrest in that case green was gunned down in her car and rose lawn at outer drive on Detroit's northwest side in April of two thousand three Detroit police commander lane Bryant\nWe know somebody had their formation that will help us to solve this case wanted them to come forth that's all of the\nGreen has been at the center of speculation about a wild party at the minute the mansion wing Kwame Kilpatrick was mayor she was a stripper under the name of strawberry anyone with information should call one eight hundred speak out\nDetroit project green light expand into another neighborhood near do good and police chief James Craig announcing this afternoon but five restaurants and the Detroit police athletic league offices in court town on Michigan avenue reformed the cork town green light commercial court or\nProject green light involves businesses installing security cameras connected to Detroit police foreign ... twenty five businesses are currently involved\nOn the very day that GM announces a two point five billion dollar profit that company is also announcing a new round of salaried workers buyouts more fun W. W. J. ought to be a reporter Jeff Gilbert\nGM colds a buyout offers a proactive steps being taken at a time but company is strong chief financial officer dubious or the Vera telling me before the announcement that while the economy is good but company can't let off\nIt's uncertain environment again it's even more important that we stick to our plan and execute our plans like we have been doing\nThe vials are targeted to GM salaried workers were twelve or more years experience about Eighteen thousand people total ... W W J news radio nine sisters\nW W ... weather together every ten minutes on the age probably got a motor group traffic cetera brought you this hour by BMW of Rochester hills\nAnd Katie what slowing us down well we've got roadwork slowness down through Madison heights and Troyer left lane is locked eyes Seventy five south bound and Northam between twelve ... wrote an Adam's north down your slower between six Ninety six and fourteen mile road southbound slower between Rochester rodents six Ninety six and six Ninety six\nEast and west monitoring Southfield wrote in college and Coolidge roadwork is here left lane for barrier repair this is going to go through Saturday right now looking through the triple a sham Camp Six Ninety six he's found slower between evergreen and Southfield wrote enough you see a problem on the road to give us a call on the WWE take tips to line up to four eight\nAnd Southfield rather Nafisi problem on the road give us a call on the WWE take tips to mind that two point four to three six W. W. J. in the adult that motivated twenty four hour ... news radio nine fifty trafficking whether Spencer by Keith Lewis Lewis financial mortgage\nThrough Madison heights in Troy left lane is blocked on I Seventy five north and south down between twelve miles wrote in Adams north on your slow between six Ninety six and Thirteen miles wrote south on your slower between Rochester rodent six Ninety six as far as I can see through the AAA dams and in Bloomfield township roadwork is Loni down on telegraph\nOn north and south down south on maple you got your left lanes close north down at maple you got to write lanes blocked and traffic is very heavy through his own in the idol downloading twenty four hour traffic center ... W J news radio nine fifty\nKnock your weather forecast family heating cooling electrical weather center and the day of ours we look into that I Do\nKnow Greg Burke a cloudy skies tonight but we'll get through most of the night dry a temperature being low fifties for the trick or treaters this evening and overnight law about forty four\nTomorrow tomorrow night read at times to kind of chilly will spend most of the time in the forties and then on friday cloudy and Chile with a shower to Ohio forty nine oh Saturday So dry\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and bring the ball so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with promote night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote night but one branch dot com spelled B O L L and branch dot com promo code night\nNews radio nine to double the good afternoon\nI'm rental and I've read the Allen our top stories that three twenty a judge declared a mistrial in a murder trial of former Michigan safely supermarket ... accused in the ATV jest of Detroit teen W. W. J. city beat reporter Vicki Thomas was in the courtroom\nTried for three days before the second day they sent out a note or in a row saying that they were deadlocked\nThe Wayne County prosecutor's office planning a retrial\nSuspect in the Pittsburgh synagogue massacres been indicted by a federal grand jury Robert Bowers indicted on forty four counts including a hate crimes authority said Bowers open fire in the tree of life synagogue Saturday killing eleven winning six including for police officers\nIt's a dream come true for a local high school student who will be spending Thanksgiving in New York marching in the Macy's parade west Bluefield high school seniors Zachary Crawford says he got the idea after watching the parade on TV last year\nI just looked at it and I said how do I do that so later that night I went online I Googled the makers very American marching band and um it popped up I found out what I had to do and this from December\nLike late November to early December all the way to march I was practicing a four minute solo which was required for the audition\nCrawford said he had to push this new aside at his high school football field so that he can make room to practice marching then he shot video themselves submitted it and found out in April that he'd been accepted and this year's parade we'll have another town the [noise]\n\nIf you hundred and fifty member marching band well for foreign to Aretha Franklin songs respect and saying [noise]\nW. W. J. news time he has three twenty two it's time for the Feldman report\nIt's a trick or treat another fee that you may not see I'm Marie Feldman with a silver and report on W. W. J. news radio nine fifty\nSome businesses that sounded easy way to boost revenue without many of us paying close attention they slept fees on services\nA massive telecommunications company recently boosted fees for most customers from Seventy six cents than Ninety nine cents generating a cool eighty eight million dollars in additional revenue Consumer Reports estimates that us consumers collectively pay at least two hundred and sixty billion dollars in financial sees every year\nBreaking it down it's about Fifteen billion alone and sees for bouncing checks an overdraft\nLast year airlines generated almost three and a half billion dollars from checked baggage fees ... minutes ration fees on everything from loans the phones and believe it or not many hotels will charge what's known as a hotel resort the upon check out you stay at a resort you pay a fee for staying at a resort\nBecause of comments like the one I just made some hotels renaming that seat and amenities the be careful\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and breathe double so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with promote night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote goodnight bowling brash dot com spelled B O L L and branch dot com promote night\nThe place where the hell are where\nThe holidays are right around the corner luckily so is it to her again for our twenty percent off ... a swear word members get twenty percent off anything inside the back\nNot an ace ward member said I'm springing easy at your local waste\nKick off your holiday shopping this weekend with big savings on quality gifts for the best friends don't miss the twenty percent off ... this Saturday and Sunday oh man it out and protest in stores I mean there's no conditions on exclusion of mine's Easter for details\nWhat is every time you went out you can cash in now with the capital when the required ... percent cash back on dining and entertainment light and their first have to walk them all\nAnd for for cash back when you take your kids to the museum for the first time what would it [laughter] [noise]\nNo matter your reason for going out now you have four more introducing the new Cedric card from capital one and four percent on dining and four percent on entertainment wants his your wallet terms applied capital one bank usa innate\nNow is the time to visit to get more of your dream Portland time we're offering special financing for months on purchases of Ninety nine or more she's from the largest selection guarantee everyday low prices ...\nPrices and accredited offered to help you complete that project offering ten Twenty one Eighteen today learned decor dot com\nPromotional financing available authority for credit card accounts like many capital thanks so she turns ... informational eligibility semi monthly payments are required three twenty five\nIt's time for the update of your money from the suburban kind of like a drug business desk\nAnd at least have friends he has our Bloomberg Business report right now the Dow is up for a hundred the NASDAQ out one hundred and eighty five and as a ... five hundred a forty six\nBroke and Greg General Motors drove right past Wall Street forecast with this latest result the carmaker points to strong truck sales for the upbeat news demand for a higher price trucks helped make up for higher material costs and other increased expenses stemming from the trade war businesses are stepping up their hiring Bloomberg's ... reports the ATP\nEmployment report chose private payrolls expanded by two hundred twenty seven thousand in October that's the biggest gain since February and atop Wall Street forecast the data suggests demand for workers was fairly broad based across industries\nIn the eighties and nineties genes dominated the casual pants market but not anymore Twenty years after ... lemon sold at first pair of yoga pants us sales of active where sometimes called at leisure know top forty eight billion dollars and the Census Bureau says last year in Port of women's elastic ... pants\nSurpass those have genes for the first time ever\nA news radio nine fifty Michigan opera theater what is\nIt only takes a minute to find out if you may have pre diabetes and you can do it I Do I have pre diabetes that or if you're probably not going to argue kids were listening to the radio you're busy which is great because busy people can't get pre diabetes and mine I read that runs [laughter]\nThey can just warm so visit\nDo I have pre diabetes that Oregon take a short time\nBecause pre diabetes can be revert\nBack to you about the ... and it's pre diabetes and wearing fighters\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and bring the ball so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of sheets plus free shipping with promote code night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promo code night but one branch dot com spelled B O L L and branch dot com promote night in\nHis time he has now three twenty\nFor traffic and whether together every ten minutes on the AIDS and Katie a problem and I Ninety six\nYes the jeopardy is he ... he got an accident now blocking you're right lane and shoulder and through Madison heights and Troy you're left lane black than I Seventy five south\nAnd north bound between twelve miles wrote in Adams traffic is slow through both zones and in Bloomfield township telegraph south down at maple your lap lanes are closed north on has the right lanes closed\nThirty eighth or for trafficking whether together every ten minutes on the apes\nAnd Katie is you travel sites out there yes we'll start with I Ninety six to ... to live in a way this acts in his life and you're right lane and shoulder and in fact it has just cleared now must have been delayed behind it so no problems traffic is sponsored by the carpet guys I six Ninety six east and west bound from Southfield the Coolidge\nRoadwork is like in your left lane each way for barrier repairs is going to go through Saturday and traffic is lower between telegraph\nAnd Greenfield looking through the ... camp seeing the afternoon ride build on I Ninety four east and west bound\nThat'd be two in Michigan avenue in Van Dyke I Ninety four east on his lawn pockets between ... and ... also sing the south feel free way north on pick up between Michigan avenue in I Ninety six need new flooring in your home called the carpet guys right now and save up to fifty four percent off new carpet in flooring plus twelve months\nInterest free financing called eight five five for my guys or go to ... dot com that's carpet guys dot com today in the adult that motive twenty four hour traffic center Katie double detainees right in that fifty\nNow we check in line with accuweather meteorologists have hours and days though do a ... or a raincoat is needed in a\n... neither I don't think broke the temperature really isn't going to move but for the kids that were around fifty one to fifty five now and it will still be in a low fifties probably through a nine o'clock\nOr not much wind and to really know thread of rain so it'll be fine for the trick or treaters that we get down about forty four degrees that when you are going to need the umbrella as he was going to be tomorrow we expect the rain to break out in the morning or it'll be off and on throughout the day and deep into tomorrow night we'll spend most of the time in the forties so it's kind of a chili rain\nAnother shower too on friday there'll be some long breaks in there but we're still in the forties and then it's a dry cool weekend but seasonable little son on Saturday about forty eight and a lot of clouds on Sunday\nRead fifty wanted Pontiac fifty three at city airport fifty five ... metro airport in northeast would've nine this is accuweather read your brother Steve Bowers on do WG a news radio nine fifty\nAnd this is where you hear trafficking whether together every ten minutes on the eighth always on demand whenever you need that W W J news radio dot\nCom coming up we'll tell you about deadly flooding in Venice that's next to have you taken a good look at your Medicare advance\nHardware\nHolidays are right around the corner luckily so is it to her again for our twenty percent off ... explored members get twenty percent off anything is either back\nNot an ace wars member said it was free and easier to local waste\nKick off your holiday shopping this weekend with big savings on quality gifts for the best friends don't miss the twenty percent off ... this Saturday and Sunday only ... percent\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and breathe double so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks ago the Boleyn branch dot com today for fifty dollars off your first set of sheets plus free shipping was promoted night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote good night but one branch dot com spelled B O L L and branch dot com promo code night\nAnd breaking news first came up to date on the road every\nNewsworthy nine fifty W. W.\nW. W. A. new science we forty to violence\nWhether in Italy this week now blamed for at least ... eleven deaths because some of the worst flooding Venice has ever seen [noise]\nLocals and tourists wore high boots to Wade into the flooded streets of Venice this week they still shopped in sat down in restaurants and business owners try to bail and pump the water out [noise]\nMenace floods frequently but officials said this time the tide was exceptional emerging most of the city for the first time in nearly a decade hardest hit the theme St Mark's facility Times Square for water levels reached nearly three feet Glenn bum Gardner is in London\nW. W. J. news time to be forty three it's time for Jeff ... car chronicled\nSign on the brain situation with China this jumped him with the wrong kind of marker\nFor General Motors they've been a big player there for Twenty years\nYou know we're watching carefully and we're we're a very hopeful that though I Will have dialogue and get the table to work through some very important issue\nGM's Mary Barra says even while they hope for the best they are making plans just in case the trade difficulties with China go on for a while we're hopeful\nThat we'll do the foundation late and they'll they'll continue to do that but I think when we look at our position we have many letters that we can pull to continue to have strong performance in China\nGM had a strong performance in China and the third quarter when even stronger performance in the U.S for a bottom line quarterly profit\nOf two and a half billion dollars with a cold I'm Jeff Gilbert W W J what are you going to\nFaces a place where the hell are where\nThe holidays are right around the corner luckily so easy to her again for our twenty percent off ... words members get twenty percent off anything that fits inside the back\nNot an ace ward member sign up is bringing easing at your local waste\nKick off your holiday shopping this weekend with big savings on quality gifts for the best brands don't miss the twenty percent off ... this Saturday and Sunday home any offered to participate in stores on the digital conditions and exclusion seasonal for details\nNow is the time to visit to get more of your dream for a limited time we're offering special financing for months on purchases of my Ninety nine or more she's from the largest selection guarantee everyday lives ...\nBottom prices and accredited offered to help you complete that project\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and bring the ball so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of sheets plus free shipping with promote night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote good night but one branch dot com spelled B O L L and branch dot com promo code night\nRally on the markets down\nAround for hundreds of other loving right now\nThat he's everyday news times forty five it is time for for sin let's check in with rain Willie\n... Michigan I go to Jim horrible in the morning show will run out several on the ticket today said that the chemistry of this year's Michigan team's been amazing because of how the players get along both on and off the field\nTeam comes together and and uh really enjoy each other's company in like um like she likes playing ball likes being on a ball team together I mean it usually happens on natural um that's something that the coaching staff generates\nA horrible went on to say they don't need any extra motivation for Saturday's game of Penn State as they know where does on the line as far as the playoffs or concern and he's on ... playing the game but are working towards getting back lions back in the practice field in Allen park today continued to get set for Sunday showdown with the Vikings to Minnesota\nEchoed map Patricia ... talked about the trade this in gold and take to Philadelphia for a third round pick and how the locker reacted when they found out look we\nVery open and honest about the conversation I think I'm the biggest point for me to you know make sure everybody understands is um you know this also shows a lot of confidence in the people that are in that room you know there's there's great players in that room and there's a lot of them and there's a lot of guys that\nAre have opportunity to make plays and go out there and play it high level and um you know I'm we're all good with that from that standpoint\nTeam is also made a roster move they've signed former giants linebacker Kelvin shepherd and the pistons back out to tonight the wrapping up the short to game road single stop in Brooklyn to take on the net you can hear all the action will run out several on the ticket starting at seven oh five\n... Fifteen and forty five passed each hour I'm Ryan willing WCW chain news radio nine fifty trafficking weather coming up next twenty eleven ten days after\nThe hardware phones\nHolidays are right around the corner ugly so it was so hurry and for our twenty percent off ... wars members get twenty percent off anything inside the back\nNot an ace ward member sign up is bringing easy at your local waste\nKick off your holiday shopping this weekend with big savings on quality gifts for the best friends don't miss the twenty percent off ... this Saturday and Sunday oh manning offered to participate in stores will conditions and exclusion seasonal for details\nIt ... for trafficking whether together all the eggs\nAnd Katie what are you watching well we're accident free on a major area freeways traffic is sponsored by Greek town casino on six Ninety six east and west bound between Southfield road and Coolidge\nRoadwork is black and you're left lane that's going to be there through Saturday and traffic is lower six Ninety six east on between telegraph and green field and now if you see a problem on the road always give us a call in the WWE take tips to line at two for eight forty three\nPrizes every Friday and November must be Twenty one to gamble visit players services for details in the idol downloaded them twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nAnd at times in the afternoon and evening with a high of fifty and\nCloudy chili showers friday high forty nine fifty five AT Metro now at three fifty nine\nTo news watch never diverse sneezes radio nine fifty to all these good afternoon I'm Greg Gulf\nAnd I'm from ... top stories that had their family other Detroit teen killed on an ATV is upset after I miss trial is declared and the murder trial of a former Michigan safely super\nAlso at the same day gee I'm post solid profits they offer some employee piles motor we reporter Jeff Gilbert\nMuch first President Trump talks immigration while Democrats talk healthcare ahead of the twenty Eighteen midterms the latest from CBS News in moments\nSports coming up at four Fifteen to ride woolly pistons back and actually I did I tried to snap a two game losing streak\nAnd stocks or it in two days will have the numbers for you coming up at four twenty five\nYears where you'll know\nDot com\nNews on the hour sponsored by capital one\nI'm Jim shown to be with less than a week left the campaign before Tuesday's election President Trump is kicking off in eight states blitz supportive Republican candidate\nFor president will be in Florida tonight campaigning for Republicans running for the governor and Senate that's one of the lead in rallies before election day you know all of which are states where Republicans are fighting tough Senate races\nIf you look at both ten states are awful places where the president's overwhelmingly popular in ah those locations and I think that the presence of the best messenger for the party\nBut while the president is pushing immigration for Republicans Democrats are focused on health care over the past two months more than half of all democratic as mentioned health care highlighting the ... opposition to Obamacare and get like ... the U.S news the White House the\nPentagon reportedly has it in a fight about seven thousand active duty troops it could be deployed at the U.S Mexico border and hit a vet care of and that would be immigrants from Central America and some two thousand of those would be on standby defense secretary Mattis today defended the deployment which had been requested by President Trump\nYou know the support that we provide to the secretary a for a homeland security is practical or support based on the request from the commissioner of customs and border police\nA caravan there's now broken up into three different groups all continue that slow trick north toward the U.S\nWe're learning more about the murder of mobster Whitey Bolger in a West Virginia federal prison reports detailing a very brutal murderer that may have included mutilation corresponding to keep a T says the killing may have been retribution for Bolger being an FBI in reforming\nWhitey Bulger's lawyer blamed the federal government for that in a statement issued yesterday he said Walter was sentenced to life in prison but as a result of decisions by the Federal Bureau of prisons that sentence has been changed to the death penalty on\nThree more funerals today in Pittsburgh victims of Saturday's synagogue attract suspect Robert dollars was indicted today on forty four counts including hate crimes eleven people were killed in that attack six wounded hospital spokesman Dr Donald ...\nTo three people hospitalized two in the intensive care unit one dish and all of a standard to any of your unit or doing much better now no longer required reading for medications to support the\nGood news again is again on the job from CBS his Jason Brooks payroll tracker eighty pieces businesses at a two hundred twenty seven thousand new jobs in October the biggest gain since February and on Wall\nJason Brooks payroll tracker eighty pieces businesses at a two hundred twenty seven thousand new jobs in October the biggest gain since February and on Wall street to close the dial up to forty and the NASDAQ up one forty four dishes CBS News\nCapital one quick silver card or an unlimited one point five percent cash back on every purchase everywhere that's all there is to it just unlimited one point five percent cash back on everything you buy what's in your wallet\n[noise] washing never saw on Detroit's number one\nForty or fifty to only going to be a\nGood afternoon thanks for joining us on this Halloween Wednesday October thirty first time read Goldman\nAnd I'm broke a gallon for W. W. J. news radio nine fifty\nHers rain and surely tomorrow tomorrow night to shower to friday the complete accuweather forecast carry up\nRight now fifty degrees at Detroit city airport W. W. J. news time for all three\nYou heard it first here on W. W. J. former Michigan State trooper accused of murder and the ATV death of a Detroit teen is free following them is trial W. W. J. city beat reporter Vicki Thomas has been following this story from inside the courtroom she joined us live in local with the latest Vicki\nAnd Greg after three days of deliberating the jury remains deadlocked forcing judge Margaret been hoping\nTo declare a mistrial X. two per mark best tried on murder charges and the ... the Fifteen year old ... Grimes who crashed his ATV Oliver Gantt as a spokesperson for Grimes is family\nShould have a retrial\nBecause justice is served and as a matter and this is another matter\nWhere we have people saying or thinking at police always get off like a curse young black man we don't want to see that happen again\nRichard convert Keno represents ... or at least temporarily\n... relief that's what it is it's a temporary a condition because we're going to have reached trial in this case\nA pre trial hearing in fact set for next Wednesday reporting live and local at Frank Murphy hall of justice of the time is W. W. J. news radio nine fifty\nSufferers is offering a major reward for information that would solve the mystery of the murder of a stripper that has become an urban legend in Detroit W. W. J. center McNeil reports\nAnd exotic dancer called strawberry Tamara green was rumored to have performed at them and you mentioned and gotten into an altercation with then mayor Kwame Kilpatrick slight current leader story of an alleged party and author kitchen has never been proven Matt conquest with ... green was driving around three thirty AM and April thirtieth two thousand three\nPulled up to the curb side at rose on an outer drive in northwest Detroit at that time she was dropping off for boys\nShe was gunned down by someone who pulled up in the white Chevy Blazer I'm quite says Fifteen Years on someone has donated the one hundred thousand dollars for tips in the case of her concern for the three children Greenland behind our main goal\nIs to advertise this case advertise the fact that an anonymous donor came forward\nThe number is one eight hundred sneak out Sandra Neal W W Jane is ready to the\nThe second suspect in an attack on a worker to Roseville bowling alleys but it rained Roseville police say thirty one year old Quentin Kaiser of Detroit appeared in court today an assault charges he's being held at a two hundred fifty thousand dollar bond\n... during the Clinton township and branded more accused of assaulting the employer the puddle lanes bowling alley October tenth the victim punched and kicked allegedly hid in the head with a bowling ball the incident was captured on surveillance video\nW. W. J. news time for other sects GM is offering buyouts to as many as Eighteen thousand\nThe answer that was captured on surveillance video\nW. W. J. news time for other sects GM is offering buyouts to as many as ... Eighteen thousand salaried workers W. W. J. auto beat reporter Jeff Gilbert explains\nGM calling this part of their journey to transform the company that has some of the senior workers take buyouts they're still hiring all there is in areas like automated vehicles chief financial officer dubious or the Vera telling me this morning that the economy remains solid\nAll the indicators like ... and household balance sheets I'm and I'm On the overall health of the consumer end consumer confidence remains really strong doing I'm\nPosting a two and a half billion dollar third quarter profit but the company says they need to be proactive why all the economy is strong Jeff Gilbert W. W. J. news radio nine fifty\nAnd we'll take a closer look at what all of this means with W W J auto analyst John ... at four twenty\nRecall involving the at Chrysler jeep Cherokee ease the automatic or announced today it's recalling eighty six thousand twenty Nineteen jeep Cherokee with two point four leader engines because of a problem could have the engine stolen slowing down via Christ there's not aware of any accidents or injuries due to the problem\nHe's Rights Project green light is expanding to another neighborhood police chief James Craig and Mayor Mike Duggan announcing this afternoon that five restaurants and the Detroit police athletic league offices in court channel on Michigan avenue have formed the court town green light commercial corridor\nThe mayor says the program started in twenty sixteen and just eat gas stations\n[noise] he was\nLater with your\nProject green light involves businesses and selling security cameras which are connected to Detroit police\nW. W. J. news time he is now for weight it's\nTime for trafficking whether together\nEvery ten minutes on the AIDS from the idol downloaded the traffic center brought you this hour by Motor City\nMany and Katie a couple of new problems yes in more like us twenty three north founded an thirty six nine mile road crashes like in your left lane has these lower master six mile road and the Southfield freeway south on after make Nichols\nA crash on your right shoulder with the ride home added in you are slower from before eight mile road now if you see a problem on the road to give us a call on the W. W. J. tips in line at two forty forty three six W. W. J. in the adult downloaded give twenty four hour traffic center Casey for W. W. J. news radio nine fifty trafficking whether sponsored\nBy Keith Lewis Lewis financial mortgage\nThey have the accuweather forecast meteorologist day Bowers what looks like the trick or treaters shouldn't get wet tonight they\nAgain having you slower from before six mile road on the south feel free way south on after McNichol is an accident on your right so there has to be slower\nFrom before eight mile road as far as I can see through the Tripoli damn camps also seeing some really heavy traffic on the north bound Southfield freeway\nBetween I Ninety four and Michigan avenue in Sterling Heights metro parkway west on after ... park had an accident black in your lap lanes now it's time for the electrical workers local fifty eight construction alert\nI six Ninety six east and west bound between Southfield wrote in Coolidge you're left lane is locked that's going to go through Saturday in the idol downloaded them twenty four hour traffic center Katie for doubling doubling chain is radio nine fifty\nAnd the accuweather forecast now the update family heating and cooling electrical weather center and devour so\nBroke Greg cloudy skies tonight but it's a dry weather for the trick or treaters this evening temperatures low fifties that will be up to about forty four day break there will however be rated size their moral and tomorrow night chilly day we spend most of the time of the forties\nTo shower to friday I forty done it's a dry cool weekend little son Saturday are forty eight so there are a lot of clouds and fifty to this is your brother Rudy round the state of ours on W. J. news radio and I took the\nRight now fifty four degrees and why friend it is fifty three and Roosevelt trafficking whether sponsored by hiring Dunn dot com [noise]\nThis holiday season give the gift of music visit guitar center for great deep including our lowest prices would be kind of leases cringing to electronic drums and just the forty nine Ninety nine world Williams over to the digital just for Ninety nine Ninety nine get appeared selecting Casey headphones fifty percent [noise] check back\nDoor buster deals plus new exclusive give you can't get anywhere else chicken or lessons program\nPerfect gift for the new musician give me give you use your guitar center\nOn news radio nine fifty\nJury after three days of deliberating the jury remains deadlocked forcing judge Margaret van hoping to declare\nA mistrial ... to ... best tried on murder charges and the ... data Fifteen year old demand Grimes who crashed his H. T. V.\nW. W. J. city beat reporter Vicki Thomas was in the courtroom the prosecutor's office planning a retrial\nDefense secretary Jim Mattis is pushing back on suggestions that the move to send thousands of active duty troops to the southwest border is a political stunt ahead of the mid term elections next week matters telling reporters at the Pentagon the deployment of more than fifty two hundred troops is based on a request from the department of homeland security\nW. W. J. new time for Twenty one General Motors will offer buyouts you about Eighteen thousand white collar workers in North America it's an effort to cut costs and joining us lived to tell us what this all means is W. W. J. auto analyst John ... good afternoon John\nGood afternoon so exactly what does this all mean\nWhile I I think you nailed it on their head rare on this is all about cutting costs on companies go through this uh uh at various times as they try to reduce head count on it's interesting of course at a time when you hear so many companies including General Motors\nComplain about how hard it is to get talented in that they need\nA that they're offering others slug buyouts to to leave the company\nIt it could also be true though that\nA GM is looking ahead or not just to cut costs but also to bring in fresh blood to the company and especially people with skills that are more aligned with where this industry is going I e\nElectric cars autonomy scars mobility services and kind of activity\nJohn why do with it at a time when you've also announced record profits for the third quarter two and a half billion dollars and and you're sending 'em out you know a voluntary or reduction notices layoff notices to the workers isn't the timing unusual there\nI'm not exactly because this kind of news is going to be very well received by Wall Street\nUh you know the investment community or is being burned by the automotive industry specifically GM Ford and Chrysler a in years past\nThat when times were good they got fat dumb and happy they overspend and then when the market turned down day we're caught\nIn a really bad position so for GM to be recording very strong earnings and at the same time say hey ah we're looking to for volunteering buyouts to reduce our head count is going to show Wall Street that the company has got good discipline that even though times are very good right now\nIt's not going to get bloated and inefficient again\nSo John ... is it interesting that they chose twelve years so it's for employees that have been there for twelve years or more correct\nYeah and exactly I think this comes back to do what I said in in terms of cutting costs a you get older employees to volunteer all volunteer early except these buyouts and then you bring in younger people who are going to not be as expensive\nAnd potentially who also bring in New skills to the company\nOr thanks very much W. W. J. auto analyst John McIlroy with the update\n\nTime for twenty four it's the twelve kids they give away on WWE genius\nStop crushing candy today it's a day you start playing that means yet\nToday the first day of the rest of your life\n... game we can find out if I start raining [noise]\nThe type of tons of character ... crashing candy out twenty Fifteen\nTo the apple app store for Google played to download that means for free that\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bowling branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and breathe double so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nAnd seen some ... unusual heavy traffic on the south the freeway north down\nIt's between ... and Michigan avenue and then you are slower to I Ninety six of the ride home\nIn Whitmore lake us twenty three north bonded and thirty six nine miles wrote a crash that's lacking you're left lane has your heavy and slow from before north territorial in McAllen got an accident on Twenty one mile road west bound east if north avenue\nAnd this one is lacking all lanes charity motors is driven to help donate your card to charity motors and help any charity you choose and help yourself to a full parking\nFull fair market value tax deduction call triple eight nine ... cars or visit charity motors dot org today to donate your car and the idol downloaded give twenty four hour traffic center Katie for the W J news radio nine fifty\nNow the accuweather forecast checking in lye meteorologist a day Bowers actually fairly mild for Halloween remember many of these where there's a cold and snow going on\nNow that's right yeah I didn't really not bad at all we have a dry conditions expected very little wind\nThe temperatures are going to be much different than they are now just hanging low fifties through the evening so yeah real nice where the trick or treaters Greg overnight are really cool off about forty four that's a little bit above normal that end tomorrow tomorrow night we have to deal with a storm coming up out of north eastern Texas\nA that'll make for a fairly steady rain and I'm of the steady as to which would probably be during the afternoon and evening hours temperatures much of the time staying in the forties\nThat it on friday just a leftover shower too behind it\nAh cloudy with a high about forty nine degrees it looks like it's a dry cool weekend\nA little sunshine Saturday forty eight degrees and we'll sneak into low fifties on Sunday despite a lot of clouds in the sky way of fifty two Pontiac and city airport fifty five cloudy but through airport and a light north when six miles an hour is is accuweather ... to stave Bowers on do WG a news radio nine fifty\nAnd this is what you hear trafficking whether together every ten minutes on the eight year next update coming up at four forty eight\nWell they'll be extra security at New York's Halloween day parade will take you there when the news continue charity motors is driven\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and breathe double so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with promote code night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promo code night but one branch dot com spelled B O L L and branch dot com promote night\nWas hurting other on the apes and breaking news first came up to date on the road every morning\nNewsworthy nine fifty W. W.\nTime is for forty to\nTrick or treaters on this these people are driving to and from Halloween parties to sell trouble that's according to traffic experts from the University of British Columbia says he signed the risk of cars\nThey didn't peeks around desk according to research when it can become more difficult to see pedestrians or oncoming traffic their advice attach reflective material to costumes carry flashlights are glow sticks and be sure any masks with costumes cannot obstruct vision\nThere'll be increased security of New York city's annual Halloween day parade the extra police just a precaution because of last year the truck attack when a man mowed down people on the west side highway bike path killing eight injuring more Mayor Bill de Blasio visited the scene of the attack this morning to remember those killed\nThis wasn't an attack on our values but that attack will not change us has not changed us and we continue on to gather\nTrial for the driver's seat below St Paul has not yet started among the dead five Argentinean friends vacationing in New York a Belgian tourists to New Jersey man who worked at the world Trade Center and one New Yorker a software engineer\nAnd sports coming up with Ryan willy and just about a minute [noise]\nThe holidays will soon be\nStop crushing candy today it's the day you start playing vaccine today's the first day at the front of your life that feeds into ... which can find out a ...\nTo keep ...\nCrashing candy out ... the\nThe apple app store Google Play to download for free\nThe are the teams [noise]\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our plan all betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and breed the bull so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks ago the Boleyn branch dot com today for fifty dollars off your first set of sheets plus free shipping with promo code night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promo code night but one branch dot com spelled B O L L and branch dot com promote code night\nWhere we can you apprehend either say a male devices\nIndian radical violent terrorism division every\nDay is games play\nNational security issue did use unique Saudi Arabia\nWas one of the matter is we had in the mid\nTerm elections they lower the temperatures most unify these news radio nine [laughter]\nWondering like how can they be careful out there on the Roseanne will check out that Halloween for cats pretty mild flip check it out for free\nMinutes for forty five it's time for sports what's happening right willy ... back out tonight wrapping up that short to game road swing was stopping in Brooklyn to take on the nets Detroit the winter in the game at the dropping backed about\nAt the Celtics up her start in the year for no the nets they'll come in struggling as well they've lost for their last five you can hear it on ... on the ticket pre game at seven oh five tipping off\nAt seven thirty as for the lines are back to work today continuing the game plan for Sunday showdown with the Vikings in Minnesota had coach map Patricia those spoke about the trade that went down yesterday that sell gold and take get shipped out to uh\nAnd these things happen and people move on and they keep going and they keep winning team is also made a roster moved today they signed former giants linebacker Calvin shepherd as Michigan it's up for Saturday's game with Penn State for the big house it goes from horrible nutty several on the ticket today admitting he's still unsure about ... black status for the game it's a scary is working hard to get back\nYeah he's he's working as well and and uh you know very hopeful I mean people ... people were say what they say and I was going to make any sense at all but ah\nHe's he's doing his very best to to get back on the field and I'm for that we're not playing they've already was injured\nHorrible went on to say the players shouldn't need any extra motivation for this one that he knows exactly what's at stake and that they're not focused on just getting revenge and the game they just want the W. with sports Fifteen and forty five passed each our number Ryan woolly W W J news radio nine fifty\nWhere we'll or check your drive see if it's a trick or treat this evening with traffic and whether next WW Jane who's done for forty\nSeven [noise] the only way you can take in our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and breathe double so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go bowling branch dot com today for fifty dollars off your first set of sheets plus free shipping with promote night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote good night but one branch dot com spelled B O L L and branch dot com promote night\nIs nothing\nTo help our phones\nThe holidays are right around the corner luckily so is it to her again for our twenty percent off ... explored members get twenty percent off or anything it's inside the back\nNot an ace ward member sign up is bringing easy at your local waste\nKick off your holiday shopping this weekend with big savings on quality gifts for the best brands don't miss the twenty percent off ... this Saturday and Sunday home any offered to participate in stores on the digital conditions on exclusion mine's Easter for details\nNow is the time to visit to get more of your dream Portland time we're offering special financing for months on purchases of my Ninety nine or more she's from the largest selection guarantee everyday lives ...\nPrices and accredited offered to help you complete that project ten Twenty one Eighteen to learn to court dot com\nNine fifty for metro now at four fifty\nNine to news watch never style or sat sneezes radio nine fifty W W\nAfternoon on bread\nI've read ... hot stories that had just one Eighteen midterm elections the Democrats\nAnd Republicans push their messages voters that report for PBS and using them and\nAlso ahead and it'll be a do over in the case of an expat super charged with killing and he's trying gene into the better jewelry or is that a better case nine the economists\nAnd to see where overflow in Ann Arbor and make it into the modern [noise]\nSports at five Fifteen the pistons tried to break a two game losing streak tonight\nThe numbers on the market will tell you what they were coming up at five twenty five\nFifty four degrees CBS News coverage world let [noise]\nDot com station\nIt's five o'clock [noise]\nMedia news on the hour we'll get floor presented by their works really\nGood Wednesday afternoon President Trump visiting the campaign trail again now just six days from the midterms CBS Steve important\nToy between now and election day the president will rally in eight states and stop twice in Florida, Missouri in Indiana where incumbent Senate Democrats face for medical GOP opponents overall Mr Trump will hold eleven rallies in this final campaign stretch as he aims to help Republicans hold on to the house\nIs there a majority in the Senate while the latest polling indicated Democrats could retake the house CBS chief says it will all depend on turnout\n... twenty three seats in order to retake the majority that sounds like very little but given the way the maps are drawn across the country it's going to be tricky and some of these races to find enough Democrats in left leaning independents to show up\nThe man charged in the shooting rampage at a Pittsburgh synagogue has been indicted by a federal grand jury\nThe federal grand jury returned to forty four count indictment against Robert powers of Baldwin including eleven counts of obstruction of free exercise of religious beliefs resulting in death and eleven counts abusive discharge of a firearm to commit murder\nA statement from attorney general Jeff Sessions says hatred and violence on the basis of religion can have no place in our society he said every American has the right to attend their house of worship in safety Bowers faces a preliminary hearing other federal charges tomorrow in Pittsburgh bill re cops CBS News\nWe're learning more grisly details about the murder of Boston mobster James Whitey Bolger in West Virginia prison CBS Nikki Patrice reports\nAccording to the Boston Globe Bulger's eyes were nearly gals out\nAnd to inmates including a convicted mafia hitman or seen on surveillance video entering Bulger's cell Tuesday Morning Bolger rose to power by reading al his rivals in the seventies or that nineties he seemingly ran the winter hill gang with impunity having paid off police and FBI agents\nOn Wall street starts recovered some ground on the final two days of trading in October the Dell rose triple digits for the second straight day closing up to forty one investment advisor to Johnson what\nWe've seen over the last two weeks is just simply a correction in an ongoing bull market and now we're getting over it now are starting to get back to normal\nDomestic gain a hundred and forty for the U.S and he was up twenty nine despite the game yes in the five hundred was off nearly seven percent for the month while in Boston it was time to celebrate [noise]\nTens of thousands of Red Sox faithful took to the streets to celebrate the teams for the world series championship in the past Fifteen Years one person was arrested after throwing in an open can of beer it's not clear if it was the same for me through a beer that struck in slightly damaged the world series trophy the CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never on Detroit's number one\nWhere the ninth inning and\nGood afternoon and thanks for joining us on this Halloween Wednesday October thirty first time ...\nAnd I broke a gallon for W. W. J. news radio nine fifty\n... driver trick or treaters this evening will have rain at times tomorrow tomorrow night the complete rocky weather forecasts coming up\nRight now fifty five degrees out Detroit city airport and Detroit metro W. W. J. news time five of the three\nMissed trials have been declared and the murder trial of former Michigan State police Draper mark ... W W J newsworthy line fifties Vicki Thomas says the latest from the city be\nThe family a Fifteen year old demand Grimes upset and looking for a retrial Oliver gas has a spokesman for the family\nI Would like to see them do a retrial took about a jury or present a better case like the the prosecutor be more aggressive\nBest nerves attorney Richard ... you know there wasn't a conviction that's certainly a positive and negative to I'll tell you what the negative is it's a good ways heavily on my mind personally and that's it this family the grinds family doesn't have\nThese pre trial hearing is set for next Wednesday a new trial could get underway in the spring Vicki\nDozens has\nThese a pre trial hearing is set for next Wednesday a new trial could get underway in the spring Vicki Thomas W. W. J. news radio nine fifty\nThat's there took the stand in his own defense in that case W. W. J. legal analysts Charlie ... says that likely held his cars\nBeing remorseful on the stand is helpful effect that he even took the stand most people on the jury know that you'll just end it don't take to stay on it but if you want to get out of the defense of self defense you almost have to stay on as the sun and otherwise are we going to get that is\nThat's new is charged with second degree murder jurors also could have chosen involuntary manslaughter but they cannot reach in a unanimous decision to convict or acquit\nWho killed tomorrow green there is a one of the two thousand dollar reward for information leading to an arrest in the case green was gunned down in her car and rose lauded out or drive on Detroit's northwest side in April back in two thousand three years Detroit police commander Elaine Bryan\nWe know somebody had her for making that will help us to solve this case I Want them to come for all of the\nRain has been at the center of speculation about all wild party at the movie and mansion with Kwame Kilpatrick was mayor she was a stripper under the name of strawberry anyone with information should call one eight hundred speaker\nMurder charges have been filed against three Detroit women who are accused of running over another woman after an argument on social media the Wayne County prosecutor's office charge destiny easterly and TNA Hicks with murder after destiny parks was run over and killed investigators say the suspects drove over to parks house last August\nTo fight after an argument started on social media\nDoing an argument parks was hit by a car and then run over she died at the scene third woman identified as Charlie Newton was charged with tampering with evidence all three are due back in court next week\nNew concrete barriers being put in place known as the Jefferson assembly plant in hopes of keeping car thieves away Detroit police say a group of people in a band van broke through a fence and drove off for three or four brand new cars from a lot next to the plant this is the fifth time in recent weeks the thieves have stolen cars from the parking lot\nVia ... says a lot is managed by another company beliefs are asking anyone who has information to give them a call\nOn the very day that GM announces a two point five billion dollar profit that company is also announcing a new round of salaried workers buyouts more now from W W J ought to be a reporter Jeff Gilbert\nGM colds a buyout offers a proactive steps being taken at a time but company is strong chief financial officer dubious or the Vera telling me before the announcement that while the economy is good the company can't let up\nIt's uncertain environment again it's even more important we stick to our plan and execute our plan like we have been doing\nThe ... are targeted to GM salaried workers with twelve or more years experience about Eighteen thousand people total jumped over ... W W J news radio nine fifty\n[noise] W. W. J. news time is five o seven [noise]\nDon't\nWith less than two weeks ago before the election the GOP office in Traverse City today evacuated over a bomb threat W. W. J. Sandra McNeal is live and local with the story brick I just got off the phone was Sarah Anderson she was for the Michigan Republican Party she says it happened this afternoon\nA man walked into their office and started renting against President Trump\nUm apparently an individual came into our Traverse City office shortly after three PM I'm yelling at our staff and threatening to blow up the building before ... than our folks and made it called the police department and a Traverse City police Andy\nAt our staff and threatening to blow up the building before ... than our folks get called the police department and Trevor city police and the grandchild her sheriff's department responded swept the building they've since given the all clear and our folks are back to work and everybody's safe and accounted for\nAnderson says the staff is rattles you said they shouldn't have to be afraid to go to work she claims there have been escalating incidents over the past six weeks including a lot of signs of vandalized reporting wide Sandra McNeil W W Jane is ready and I'm fifty W. W. J. new son\nFive away professor whether together every\nTime I saw the AIDS from the ... traffic center brought you this hour by portion of the motor city\nAnd Katie what's happening and Ninety six\nThe Jeffries was founded in fourteen an accident and you write soldier has a slower from before Farmington wrote in wakes them back wrote a Pontiac trail\nAccident has all lanes blocked with police and fire on the scene in tips Eric called that in Chesterfield township twenty three mile road is founded sass\nThere's an is blocked by an accident also in St Clair shores got a crash on Jefferson westbound at nine mile and looking through the ... at the ride home see in the south feel free way slow and go north and south down between\nI'd tonight breezy turning chillier this afternoon also tonight or doing trick or treat time will be in the low fifties and it will become cloudy overnight will drop down to forty four but tomorrow or we do expect rain during the morning hours and in the afternoon and evening tomorrow tiny or fifty right now fifty three degrees at Detroit metro airport\nYour station for trafficking whether together every ten minutes on the age you can always know before you go log on anytime W. W. J. news radio dot com\nNewsworthy or nine ... the only good afternoon I'm Brett gal\nAnd I broke out and our top stories had five twenty with less than a week ago before the election the GOP office in Traverse City today was evacuated over a bomb threat a man walked into the office and started ranting about President Trump Sarah Anderson worse for the Michigan Republican Party threatening\nTo blow up the building before fleeing the scene are folks immediately called the police department and a Traverse City police and the grand Trevor sheriff's department responded swept the building they've since given the all clear and our folks are back to work\nOur standard Neal we'll have another live report at five thirty suspect\nIn the Pittsburgh synagogue massacres been indicted by a federal grand jury indictment which was expected was announced today your charges Robert Bauer is with forty four counts including hate crimes\nFederal prosecutors have previously indicated they plan to seek the death penalty authority said Bowers opened fire in the tree of life synagogue Saturday killing of Lebanon wounding six including for police officers\nIt is a dream come true for a local high school student who will be spending Thanksgiving in New York marching in the Macy's parade West Bloomfield high school senior Zachary Crawford says he got the idea after watching the parade on TV last year\nI just looked at it and I said how do I do that so later that night I went online I Googled the make his great American marching bands and um it popped up I found out what I had to do and from December like late November to early December\nAll the way to march I was practicing at four minutes solo which was required for the audition\nCrawford said he had to push the snow aside at his high school football field so that he could make room to practice marching and then he shot a video of themselves submitted it and then found out in April that he had been accepted and this year's Macy's parade will actually have a Motown theme [noise]\nThe two hundred and fifty member marching band well for foreign to Aretha Franklin songs respect and think [noise]\nW. W. J. news time is five Twenty one your chance to win a thousand dollars in the twelve could they give away on W. W. J. news radio nine fifty coming up uh twenty three pass the our\n... involved in in our house bedtime is complicated my wife has always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of born branch makers of the world's most comfortable sheets loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and breathe double ... warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with promote night that's fifty\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and breathe double so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with promote night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote goodnight bowling brash dot com spelled B O L L and branch dot com promote night\nWWE news time five twenty three [noise]\nIt's it's well they give away on W. W. J. news right unite fifty in this hour ski where it is an avid tax avid a v I D to seven to eight one for your chance to win a thousand dollars messaging data rates apply and remember do not text and drive\nBut rally on the market today the Dow finishing up more than two hundred points your money and the Bloomberg Business reporting that the managing of better banks to\nWhat is every time you went out and you can cash in now with the capital receiver card ... percent cash back on dining and entertainment light and their first have to walk them all\nAnd for for cash back when you take your kids to the museum for the first time what would it [laughter] [noise]\nNo matter your reason for going out now you have four more introducing a new favorite card from capital one and four percent on dining and four percent on entertainment once his your wallet terms of our capital one bank usa NA\nTo tell you the best job candidate isn't always the typical candidate\nSometimes they're regret of life\nMeet the grounds of light and young adults are unique determination and experience that I deal with\nIt for your company and an entry level position internship or mental Russia they might not have every qualification you typically look for what they're exactly who you're company sometimes the best candidates aren't the ones who used to go to graduate dot org and learn how to find cultivate and train this great pool on September\n... by the council aggressive life dot org\n[noise] W. W. J. news time is five twenty five it is time for the\nMoney from the suburban catalog Detroit business deaths and Joe is on a guard has our Bloomberg Business report Paul street\nEnded a tricky October was a treat games of one to two percent across the stock average is\nDown rose two hundred and forty one points than as that one hundred forty four the S. and P. twenty nine that doesn't erase however losses from a brutal months the NASDAQ down more than nine percent of its worst monthly showing in ten years the Dow dropped five percent the S. and P. seven percent\nTech chairs led the most losses there rebound fuel today's games with investors\nSeeing optimism in Facebook's holding on to users even with his privacy issues\nCame to the number of jobs added to private businesses as kind of by payroll company ATP a total of two hundred twenty seven thousand one strategy is telling Bloomberg that Khan skittish nerves about the economy's foundation\nFitbit exceeded its goals and that flooding up its shares in post market trading and saw sales in earnings be targets the company lost a lot less money last quarter than it did a year ago I'm Joan ... what the Bloomberg Business report on W. W. J. news radio nine fifty\nSocks that local interest sponsored by plant ran wealth management General Motors close at thirty six dollars and fifty nine\nSponsored by plant ran wild management General Motors close at thirty six dollars and fifty nine cents up nine percent lazy boy down almost three and a half percent with a close at twenty seven dollars an eighty cents\nLook at Germany sponsored by mother ... will check out traffic in weather together for you on this Halloween Night in one minute\nBaseball apple pie in ... [noise]\nI'm voting in the mid term elections because ... 'cause\nMy ancestors and to make it better for my children are women before me by the week and remain free open community out term election oh every vote make my opinion not very well I vote I vote in\nThe mid term elections\nRegister now on I Am a voter dot com and don't forget to vote Tuesday November ... brought you buy I Am a voter an ad council\nYeah we sort of stop paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me for my credit card debt and I ... for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man gave researching personal loans and I found best egg to have an a plus rating with a bb\nAnd best thing handles everything on line start to finish\nAnd consumer advocate best day five stars rather easy on line long nap and we can be approved and funded and as little as one business day I played on line with no impact my credit score\nJewish take credit for my witness but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\n... ... dot com slash radio best day dot com slash radio subject acquitted will reach piece of fruit will vary\nThe W. W. J. twenty four hour traffic centers you from point a\nTo point B every day whether It's MORNING Dr I'm Dennis ... during the day on tree fell on my way home from work paves the evening so and then overnight I see\nA gram and we also have your coat on the weekend is already bubbly during the time this is Maria W. W. J. twenty four hours or more to do what you do you do\nHave you ever have time by twenty eight and it's time for traffic and whether together every ten minutes on the apes in Huston looking out their case he\nWon't work we're accident free and our major area freeways look into the ... the typical slow down for your afternoon drive on a ... you found your slow in pockets from eight mile road to measure parkway on west bound I Ninety four no delays between downtown and\nAt the airport and I to Seventy five north and south and you're seeing the slowdown June eight mile road and the Jeffries and on I Ninety six the Jeffries you got a slow go between telegraph and I to Seventy five in Chesterfield township still a crash on twenty three\nPrices and accredited offered to help you complete that project offering ten Twenty one Eighteen today for foreign decor dot com\nRacial financing available authority for credit card accounts like many capital thanks so she terminal suffocation for credit informational eligibility semi monthly payments are required\nIn Eugene used on five thirty eight sun for trafficking whether to get her every ten minutes on the\nLine Katie a pretty decent drive right now yes we're exit and free in a major area freeways broke look into the Tripoli jam camp seeing the typical slow down six Ninety six east bound you slower from the telegraph to just pass green field and that again before I Seventy five\nHeading into the traffic shift on the west bound six Ninety six or slower between telegraph\nAn orchard like road south on I two Seventy five you're slower between eight mile road and the Jeffries\nComing out of the city is still seeing some slow down than I Ninety four both ways uh between the inner changes in which some Beck wrote a Pontiac trailer reporter crash still blocking all lanes in Seattle downloaded them twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nGot your weather forecasters meteorologist they Bowers for the trick or treaters Dave\n... tonight but it is going to be dry temperatures below fifties this evening heading down to forty board daybreak tomorrow tomorrow night though ... expected quite cool high a bit below forty one\nBelow shower too on friday otherwise cloudy with a high forty nine it's going to be a dry cool weekend little sunshine Saturday with a higher forty eight Sunday mostly quality high fifty\nSend your next report less than ten minutes away at five forty eight twenty four seven three sixty five [noise]\nI'm voting in the mid term elections because my carpet group or because\nMy ancestors and to make it better for my children are women before me by a week and remain free helping community out term election oh every vote makes my opinion mattered vote I vote I vote in\nThe mid term elections\nRegister now on I Am a voter dot com\nAnd don't forget to vote Tuesday November ... brought you buy I Am a voter an ad council\nJob crushing candy today it's the day you start playing best beans today's the first day of the rest of your life and that means is a crazy time looking with can find out about ...\nOf characters to collect\nCrunching Kenny ...\nIt's at the apple app store Google Play to download for free\nThe art that theme\nSaddam is five forty one a Roman Catholic diocese in Iowa says a new for thirty two years that one of his priest was a pedophile\nAccording to a church officials in Sioux City the priest or Rome ... church officials others conduct in Nineteen eighty six\nDioceses though never contacted police or inform the public coil was stripped of his ability to lead mass and function as a priest but he never face for the punishment he's lived in Albuquerque until recently he retained the title father and continue to collect financial assistance from the dioceses\nThat CBS News correspondent ... reporting\nViolent weather in Italy this week now blamed for at least eleven desk go some of the worst flooding Venice has ever seen [noise]\nLocals and tourists wore high booth to Wade into the flooded streets of Venice this week they still shocked and sat down in restaurants and business owners tried to bail and pump the water out [noise]\nMenace floods frequently but officials said this time the tide was exceptional emerging most of the city for the first time in nearly a decade\nHardest hit the theme St Mark's facility times where for water levels reached nearly three feet when bum Gardner is in London\nW. W. J. news time five forty to education today sponsored by Oakland University\nDetroit mercy biochemistry student Tiffany to know earned selection is one of a U.S how students to serve as a student representative at the twenty Eighteen United Nations framework convention on climate change\nNo will serve as a student representative for the American Chemical Society at the conference\nWhich takes place in Poland in December no was not shy about the role her professors played in her intellectual development and how important they were in terms of receiving this opportunity the experience is expected to provide Tiffany with insight and perspective that only a few select students throughout the country\nWill get Laura by no W W J news radio nine fifty\nW. W. J. newsworthy in our house bedtime is complicated my wife has always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at bowl and branch dot com they're unbelievably soft warm and breed the bull so Missy stays warm and I don't know ... it's like magic we'll let you sleep in them for thirty nine if you're not impressed\nStop crushing candy today the day you start playing that theme\nToday the first day of the rest of your life and that means is a crazy time okay but it's been raining\nThousands of tons and\nOf ...\nCorrecting Kenny ...\nAt the apple app store Google Play to download for free\nThe are the [noise]\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at bowl and branch dot com they're unbelievably soft warm and breed the ball so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of sheets plus free shipping with promo code night\nThat's fifty dollars off plus free shipping right now at Boeing branch dot com from a code night but one branch dot com spelled B O L L and branch dot com promote code night\nFulltime responsibility\nWhen you weren't using as we can get into the hands of curious children troubles users\nOr anyone else might miss\nRemember [noise]\nFor more information on firearms storage safety presidency piece of this mess in the ... the bureau of justice is a\nBig gains on the market today we'll check your money\nFive forty five it's a sign for sports primarily the Boston World Series\nParade supposed to be alcohol free that may not have been the case that's apparently beer bottles or cans were being hurled out there you have\nYour kids I retreated the video did you see it by chance on our our border I ah yeah I've not had a chance to actually look at the video it looks pretty bad so I mean yeah they were just you don't go down the street to Boston and fans were hurling a cans of beer don't know what kind of was doesn't really matter but it hit the world series trophy\nRight in the flags and it's been about three or four of them and they pick the trophy down they tried to fix it and then they continued on\nUh with the celebration so certainly is going to be needing some repairs but a small price to pay when you win for World Series titles\nSince two thousand and four now closer to home lions back to work today is acting in the game plan for Sunday showdown with the Vikings in Minnesota did it back was Christian uh Jones and Taylor Decker revolt in front of Sunday's game with the Seahawks team also made a roster moved they've signed former giants linebacker Kelvin shepherd\n... also back at it and I wrap it can be sure to game road single step out in Brooklyn to take on the net you can hear it on ... on the ticket starting at seven oh five\nAnd despite handling twenty eight NCW tournaments in ten final fours in his career the big tent announcing today Ted Valentine will not be used as basketball season as a rap for being disciplined for showing up north Carolina's Joel Barry in a game last season\nWith sports Fifteen and forty five passed each hour I'm Ryan woolly double ... news radio nine fifty\nTrafficking weather coming up at five forty eight the only way you can take dumped\nPlenty every time you went out you can cash you know the capital in secret Kyrie Irving four percent cash back on dining and entertainment like celebrating every year the cruise missiles\nStop crushing candy today the day you start playing ...\nDid in the first day of the rest of your life is a crazy time looking but can find out about ...\nThousands of tons and\nOf keep characters to collect\nCrunching candy and joining the\nIt's at the apple app store Google place to download that's being furry\nThe art scene [noise]\nOh do you use a five forty eight side for trafficking whether together on the eight\nAnd Katie has the drive home oh Berkeley are still accident free in a major area freeways traffic is sponsored by Josh Groban in concert looking through the Tripoli jam camps at the last of the slowdown are on I Ninety four both ways in between the interchange is coming out of the city\nAnd also your slow in pockets and I know before east on between ten mile road and metro parkway six Ninety six east on your slower from telegraphed Greenfield westbound six Ninety six years Laurent telegraphed orchard like road and then as you approach the two Seventy five I Ninety six interchange in in which\nSome still watching that crash that is blocking all leans back road at Pontiac trail the world's most unmistakable voice Josh Groban\nTo news watch never style that news radio nine fifty to all the good evening\nI'm Greg moment and I've ... stories that had deal the workers are rattled after a bomb scare evacuating their office in Traverse City\nWhere on reviewing security protocols for all of our offices\nIn the intervening in Wayne County judge declare was amiss drama the case of a former state police drew for charged with murder days\nBefore the election President Trump says he might send up to Fifteen thousand troops were attacked the southern border ... CBS News in moment sports\nWith riot at six Fifteen pistons basketball they're like they're trying to break a two game losing streak\nAnd tonight for those trick or treaters mild conditions will drop down to the low fifties [noise]\n\nSix o'clock [noise]\nCBS News on the hour sponsored by Dell's small business\nI'm Pam culture as he campaigns hard to maintain Republican control of Congress President Trump is emphasizing border security and promising to send a huge number of US military troops to the southern border\nOur military is out we have about five thousand they will go up to any wherever we benefit the vows this military personnel on top of border patrol and everybody else is a broader nobody's Dominguez\nMr Trump insists he's not fear mongering by raising the alarm about the caravan of migrants headed to the U.S defense secretary James Mattis just in the deployment of troops we don't do stunts he says it's practical support for questioning by customs and border protection\nThe suspect in the shooting massacre in Pittsburgh synagogue is facing dozens of criminal charges CBS his bill recall for report\nThe federal grand jury returned to forty four count indictment against Robert ... hours for the killing of eleven worshipers at the tree of life synagogue last Saturday\nUs attorney Scott already set in a statement today begins the process of seeking justice for the victims of these hate blacks and healing for the victims families the Jewish community and our city Bowers remains behind bars and the butler county jail about thirty miles north of Pittsburgh\nHe faces a preliminary hearing on the charges in federal court tomorrow they'll re cops CBS News\nThree ... of the synagogue shooting are hospitalized and their conditions are improving Dr Donald Verrilli as head of emergency medicine at University of Pittsburgh Medical center\nI think overall the Broncos are good\nFor all the bases that were made\nBy each of them in a very way we'll have a different subject really likely require a series of ongoing care\nStocks are battling back after losses wiped away all of this year's games the Dow was up two hundred and forty one points today in NASDAQ gained one forty four market analyst huge onset investors\nAre starting to get their courage back or willing to simply conclude that look it looks to me as though the economy is going to continue to expand there's joy in Boston\nHuge\nLook it looks to me as though the economy is going to continue to expand there's joy in Boston\n[noise] huge crowds filled the streets to cheer the world champion red Sox his victory\nFor and kicked off from ten way part\nCan teddy cannon showered team members and fans with red white and blue paper and separate made its way through the city because this is Halloween many in the crowd dressed up in costumes including panda and dinosaur outfits comic book in Disney characters this was the red Scott socks is forest World Series\nChampionship in Fifteen Years this is CBS News\nDo small business technology advisors no there's nothing small about your business they provide one on one partnership and reliable del PCs with into court process to get this done called eight seven seven by Dale\n[noise] wash never stops on Detroit's number one\nForty nine fifty to only\nThree main thanks for joining us and happy Halloween on this Wednesday October thirty first I'm Greg them for W. W. J. news reading and I am fifty\nDry weather the sea they will will see periods of rain tomorrow tomorrow night with temperatures in the forties the complete rocky weather forecasts coming up a lot of these guys are fairly\nMild for the end of October fifty five degrees will get trafficking whether on the AIDS W. W. J. news time six oh three a bomb scare closes a GOP office today after man editors reading about\nPresident Trump W W J ... McNeill is live and local with the story for senator\nGregg ... with the Michigan Republican Party says the man walked into the Traverse City Republican off as threatening to blow it up he took off and is still at large office was evacuated as deputy swept the building no device was found enters and says this is just the latest in a series of threats over the past month and a half leading up to the election\nI didn't like the tactics and the uh the vitriol has has gotten out of hand and it when you're getting to the point where people are afraid to show up to work and nervous about volunteering their time for a cause and candidates they believe and I feel like we've we've got to change the way that our political discourse it's going reporting\nLives Andrew McNeill W W Jane is radio nine fifty\nWake County judge has declared a mistrial in the case of a former state police trooper charged with murder jurors said this afternoon they were deadlocked and could not come to a unanimous decision\nMark ... they're charged with second degree murder and involuntary manslaughter after hazing Fifteen year old ... Grimes who was driving an ATV on any side Detroit street last year after he was hit with a taser Grimes crashed into a pickup truck and died\nA spokeswoman for the prosecutor's office says there will be retried the next hearing is scheduled for next week\nSearches on for a murder in Detroit after him and his gun down by going door to door and get out the vote campaign the twenty four year old was killed last night well canvassing on Drexel street with a Nineteen year old woman she was injured in the shooting\nBrandon Snyder the executive director of good jobs now says it said the pier where shot while trying to campaign for social justice and against violence\nWe know that from all indications that this was not an act of violence you know and they were motivated by the fact that these were canvassers and the and again they didn't that we know that they end up in the house that they were in campus\nPolice believe the victim had been a in a dispute with the shooter who is still at large GM offering buyouts do as many as Eighteen thousand salaried workers W. W. J. ought to be a reporter Jeff Gilbert explains\nCalling this part of their journey to transform the company that has some of these senior workers take buyouts they're still hiring all there is in areas like automated vehicles chief financial officer dubious or the Vera telling me this morning that the economy roommates\nStill hiring all there is in areas like automated vehicles chief financial officer dubious or the Vera telling me this morning that the economy remains solid\nAll the indicators like ... and household balance sheets I'm and I'm On the overall health of the consumer end consumer confidence remains really strong dream\nPosting at two and a half billion dollar third quarter profit but the company says they need to be proactive while the economy is strong Jeff Gilbert W. W. J. before they go nine fifty\nThere's a recall tonight involving the at Chrysler jeep Cherokee ease the automatic or announced today it's recalling eighty six thousand twenty Nineteen jeep Cherokees were two point four leader engines because of a problem that could have the engine stall and slowing down the at Chrysler is not aware of any accidents or injuries due to the problem\nOf sewer overflow in Ann Arbor cents more than a hundred thousand gallons of sewage into the here on the river the water was found licking from a manhole Concordia University on ... road near us twenty three this morning above it works crews found the sewer pipes was blocked by debris including wipes and other paper the line has since been cleared\nW. W. J. news time six or seven it's a goal for project green light in Detroit W. W. J. news radio and fifties Jackie page explains\nSecurity camera program is expanding along Michigan avenue in court count this particular\nRace here we have lots of that\nThe fact is there are so many are\nTo stop that Detroit Mayor Mike Duggan five restaurants and the Detroit police athletic league offices in court town are all participating across the city four hundred twenty five businesses are currently involved cameras tend to live video back to the city's real time crimes center which is staff to twenty four seven Jackie page WWE Jane news radio nine fifty\nW. W. J. news time six away it's time for traffic whether together every time that it's obvious from the motor traffic center brought you this hour by Audi of Rochester hills and check it in now Katie we got a problem on the ice Seventy five in Oakland County\nYes south on Seventy five had David Davis for road this crash leaves only or left lane open\nYou are slow and about a mile and a half behind it in tips the gym called that in looking through the ... dam camps at the ride home the last of the slow down just surrounded by roadwork I Seventy five north and south bound to get you left lane black between twelve now wrote in Adams and you are slow to his own also slow in Bloomfield township\nA telegraph north and south down you got\nTwo lanes liked each way at maple and your through slow through his that zone\nIn which some still the crash biking all lanes back wrote it Pontiac trail now you see a problem on the road to give us a call on the W. W. J. tips deadline at two point four to three six W. W. J. in the ... twenty four hour traffic center ... radio nine fifty\nAnd the accuweather forecast meteorologist Dave hours\nCloudy skies through the night to temperatures will be in the mid forties at daybreak and end up for tomorrow tomorrow night rather chilly with periods arraigned hype fifty in a low forty one\nConstruction alert I Ninety six east and west bound to in Kensington wrote a nobody got moving work crew they're going to be black in two lanes in either direction overnight starting at night tonight until five am tomorrow morning this isn't go nightly through November twelfth\nLooking through the triple a jam cams at the ride home last the slow down or an I Seventy five and at the ... Seventy five both the north and south south on the left lane is black between twelve miles road and Adams in the idol downloaded them twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nHand the accuweather forecast family heating and cooling electrical weather center and Dave ours is one\nOf these guys that I but it is going to be dry temperatures below fifties this evening heading down to forty four day break tomorrow tomorrow night though very it's raining expected and quite cool high fifties low forty one\nStill a shower or two on friday otherwise cloudy with a high forty nine Scalia dry cool weekend little sunshine Saturday with a higher forty eight Sunday mostly cloudy high fifty to\nA Mike you brother Rudy Rob is Steve ... hours on D O W J news radio nine fifty\nGood weather is sponsored by try on solutions current conditions it is cloudy and fifty three degrees in Ann Arbor right now and ... and fifty five fifty six in Troy up in Traverse City it's cloudy and fifty six degrees fifty for city airport\nAnd here's what's happening it's six twenty\n\nFour people have been shot on Detroit's east side fully say one team has died happen inside a home stay with W W J for the latest on this still developing story the murder trial of former Michigan State police drew for mark ... ends in a hung jury after three\nDays of deliberating the jury remains deadlocked enforcing judge Margaret band hope to declare a mistrial ... tried on murder charges and the ... data Fifteen year old ... Grimes who's crashed his H. T. V.\nW. W. J. C. B. reporter Vicki Thomas was in the courtroom the prosecutor's office planning a retrial\nPresident Donald Trump says the number of military troops deployed to the U.S Mexican border could go as high as Fifteen thousand Mr Trump told reporters with the White House the move would be aimed at preventing the entry of a caravan of migrants traveling from Central America hair events dearly nearly one thousand miles\nFrom the border W. W. J. new time six Twenty one [noise]\nWell the late singer sums up for sale you can buy it for eight hundred grand Aretha Franklin's custom brick estate has five bedroom six and I have ... more than forty one hundred square feet of space the colonial style home maybe Mt with no evidence of Aretha but it's still s layer it has white\nMarble floors and hardwood floors black stone countertops huge windows overlook too small ponds there's a sauna and a three car garage Franklin who died in August at the age of Seventy six bought the home for one point two million dollars in Nineteen Ninety seven she died however living and riverfront towers in Detroit\nWell this West Bloomfield high school student really uh something to be thankful for this Thanksgiving senior Zachary Crawford will be representing Michigan the Macy's Thanksgiving Day parade in New York Crawford he plays the Alto saxophone has been practicing marching in her sing a four minutes so low for the past year hoping to be chosen for the water\nAnd then in March I went to the football field at my school which still has now on it I had to brush that's now off\nAnd like make a little spot like in March around than than I shocked myself going marching forward marching backward and then doing slide for them to see that I could march and then from there I admitted it along with an application and then in April they accept\nCrawford says he and his family have a Thanksgiving Day tradition of attending the Detroit parade but this year they're all going to be in the big apple W. W. J. news time is six twenty [noise]\nFor twelve kids they give away on W. W. J. news radio nine fifty this hour's keyword is delicate text there were delicate D. E. L. I. C. A. T. E. the seven to eight eight one your chance to win one thousand dollars message and data rate supply remember don't text and drive time now for the Feldman reports\nIt's a trick or treat another fee that you may not see I'm Marie Feldman with a Sylvan report on W. W. J. news radio nine fifty\nSome businesses have found an easy way to boost revenue without many of us paying close attention they slapped fees on services\nA massive telecommunications company recently boosted fees for most customers from Seventy six cents the Ninety nine cents generating a cool eighty eight million dollars in additional revenue Consumer Reports estimates that us consumers collectively pay at least two hundred and sixty billion dollars in financial fees every year\nBreaking it down it's about Fifteen billion alone and sees for bouncing checks an overdraft\nLast year airlines generated almost three and a half billion dollars from checked baggage fees their minutes ration fees on everything from loans the phones and believe it or not\nLast year airlines generated almost three and a half billion dollars from checked baggage fees ... minutes rations these on everything from loans the phones and believe it or not many hotels will charge what's known as a hotel resort the upon checkout you stay at a resort you pay a fee for staying at a resort\nBecause of comments like the one I just made some hotels renaming that the and amenities the be careful with the film and report I'm Marie Feldman W. W. J. news radio nine fifty\n[noise] the only way you can take ... to have any\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful\nThe blame me for my credit card debt and I blame him for that mandate is awesome\nAnyway we were making breakfast ... yeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills in a one is the payment right\nAnd I read a bunch of rave reviews for best dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score I click submit my loan application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nRight I got an amazing amount it paid off credit cards and bills and lower their monthly payments that take really is lending over easy yep\nOwns scramble your finances from your kitchen table visit best to dot com slash fried best to dot com slash fried subject to credit approval actual rates fees and approval times will vary\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at ball and branch dot com they're unbelievably soft warm and bring the ball so misty stays warm and I don't overheat it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of sheets plus free shipping with promo code night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com from a code night but one branch dot com spelled B O L L and branch dot com promote night\nI said for business suburban Cadillac or throwing business is Joan ... daughter has our Bloomberg Business for four plus if I flip around wealth management\nWin games of one to two percent on most disappointing when investors pulled back from gains of almost two to close to three percent and that is what they did\nTo close out October and live in some of the month losses now still rose two hundred and forty one point the NASDAQ one hundred forty for the U.S and the twenty nine the tech chairs that had led this month's bruising losses rallied after Facebook's earnings indicated that company is weathering\nThe data breach in privacy issues it's seen with user numbers that are holding on but memories of October twenty Eighteen will linger with the NASDAQ having fallen more than nine percent this month\nEnding them on the same correction territory its worst showing since the crisis year of two thousand eight the Dow gained about six hundred points in a couple of days but still lost more than five percent for the month\nThe U.S and the five hundred did manage to do something positive even though it's loss for the month he had seven percent it posted its biggest two day surging since February ... with Bloomberg Business report on W. W. J. news radio nine fifty\nLots of local interest sponsored by plant Moran wealth management there was a a good day for General Motors stocks up ... percent to thirty six\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at all and branch dot com they're unbelievably soft warm and breathe double so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks ago the Boleyn branch dot com today for fifty dollars off your first set of sheets plus free shipping with promote night\nThat's fifty dollars off plus free shipping right now at bowling branch dot com promote good night but one branch dot com spelled B O L L and branch dot com promote night\nWhat he is every time you went out you can cash in now with the capital in the for card you were forbidden the cash back on dining and entertainment like their first have to walk them ally\nAnd four percent cash back when you take your kids to the museum for the first time what what he's doing I spent [noise]\nNo matter your reason for going out now you have four more introducing new theater carts and capital line for for president on mining and four percent on entertainment what's in your wallet terms applied capital one bank usa in a\nIn our house bedtime is complicated my wife has always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time at ball and branch dot com they're unbelievably soft warm and bring the ball so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with promo code night\nThat's fifty dollars off plus free shipping right now at Boeing branch dot com promo code night but one branch dot com spelled B O L L and to branch dot com promote night\nTo gather all of us is by Methodist children's homes society foster today ... and the case\nThe better news on I Seventy five yes Craig near Clarke's denies Seventy five south on David ... wrote an accident has been cleared slow\nTraffic still heavy from after Holly road\nTraffic is sponsored by Frankie Valli and the four seasons at the Fox theater in which some an accident on back road between west wrote in Pontiac trail is laughing ... and fire on the scene tips there's era Canberra called that in and we've got roadwork meant that may change your out tonight on that for west side of Belleville road road worker black two lanes and the\nBelleville north bound rant I Ninety four west on will be closed\nSaturday at nine tonight until ... am tomorrow morning here comes rock and Roll Hall of famers Frankie Valli and the four seasons this Sunday at the Fox theater Nineteen top ten heads over the years is Frankie Valli and the four seasons get tickets now at ... dot com and ticket master in the ... motor of twenty four hour traffic center Katie for it I Believe devotee Jamie it's ready at nine fifty\nAnd the accuweather forecast down the update and meteorologist Dave hours as we look for the trick or treaters tonight Dave\nWhere mostly ... guy right on through the evening but a light wins and temperatures in the low fifties aboard the trick or treaters this evening overnight though about forty four\nTomorrow though it's going to be periods arena this will start first thing in the morning and they don't continue actually right into tomorrow night I'm fifty in the lower forty one\nNow we're for friday cloudy chili Stiller shower to a higher forty nine and then it's dry weather for the weekend the clouds and son Saturday with a higher forty eight Sunday a lot of cloud to the hype fifty to this is accuweather really robust saved hours on do WG a news radio nine fifty\nAnd the current conditions this hour in commerce it's fifty four degrees fifty three and a Ann Arbor cloudy fifty for its city airport cloudy still fifty five pretty mild at Detroit metro with traffic and whether together every ten minutes on the apes around the clock\nStraight ahead project green light expanding to another neighborhood will tell you about that next\nAll children need NBC again whether together on the apes and breaking news first came up to date on the road\nDetroit project green light expand into another neighborhood police chief James Craig Mayor Mike Duggan announcing this afternoon five restaurants in the Detroit police athletic league offices in court\nTowns along Michigan avenue for the court town green light commercial court or the mayor says the program started in twenty sixteen and just eight gas stations\nThe response\nWent down by the way\nJust three years later we\nProject green light involves businesses installing security cameras which are connected to Detroit police crime stoppers offering a major reward for information that would solve the mystery of the murder of a stripper that's become an urban legend in Detroit here's W. W. J. Sandra McNeil\nAnd exotic dancer called strawberry Tamara green was rumored to have performed at the minute mansion and gotten into an altercation with that mayor Kwame Kilpatrick swipe card leader story of an alleged party in their kitchen has never been proven that conquest with ... green was driving around three thirty AM and April thirtieth two thousand three\nHold up to the curb side at rose lawn in outer drive in northwest Detroit at that time she was dropping off her boyfriend\nShe was gunned down by someone who pulled up in the white Chevy Blazer conquest that's Fifteen Years on someone has donated the one hundred thousand dollars for tips in the case of her concern for the three children green left behind our main goal\nIs to advertise this case advertise the fact that an anonymous donor came forward\nThe number is one eight hundred sneak out Sandra Neal W. W. J. news radio that the\nW. W. J. news time six forty three sports is next twenty eleven ten days\nCrushing candy today it's the day you start playing vaccine today's the first day of the rest of your life and that means is a crazy ... with the fact that rainy\nOf characteristic of\nCrushing Kenny out twenty Fifteen\nAt the apple app store Google Play to download for free\nThe art scene [noise]\nIn our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our plan all betting\nBack for a limited time at bowl and branch dot com they're unbelievably soft warm and breed the bull so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets come and fourteen stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out in just a few weeks go to ... dot com today for fifty dollars off your first set of shoots plus free shipping with ... night\nThat's fifty dollars off plus free shipping right now at Boeing branch dot com promote good night but one branch dot com spelled B O L L and branch dot com promote code night\nWhat he is every time you went out you can cash in now with the capital receiver card ... percent cash back on dining and entertainment light in their first have to walk them all\nBack and forth for cash back when you take your kids to the museum for the first time [laughter] [noise]\nNo matter your reason for going out now you have formal are introducing the new Cedric card from capital on four percent on mining and four percent on entertainment as much as your wallet terms of my child to one bank usa in a\nSize today\nStop crushing candy today it's a day you start playing that the\nFirst day of the rest of your life and that means it's a crazy time okay but it's been raining\nOut of the\nTo keep the collapse\nCorrecting Kenny ... diem\nThe apple app store Google Play to download for free\nThe are the [noise]\nThe size of the British the dial up to forty what has enough whatever the earlier today will get the latest Bloomberg Business\nFor for six forty five years why what we think of the day off yesterday life back on the practice field in Allen\nPark today turning their attention to Sunday's game with the Vikings back both Christian Joes and Taylor Decker effort on finishing Sunday's game of Seattle that goes by Patricia also spoke answered multiple questions about why they decided to trade golden Tate says he can understand why some people don't see how it benefits them right now\nYou know it's hard it's very difficult when you're in that\nYou know one game in my time mindset you know that's really where we are from the standpoint of um you know two week to week for us and that is good but there's also a big picture here that you know it's good for\n'em those to keep an eye on as we move forward and that's something that we always have to consider when we you know make all these decisions whether it's during the season during the off season free agency draft whatever it is those are difficult decisions no matter when they come up\nTurning to the NBA pissed them back on the hardwood tonight the wrapping up there to getting road swing of the stuff in Brooklyn to take on the net flip it off at seven thirty and as the red Sox celebrate their fourth world titles and so forth to the streets of Boston today the world series trophy slightly damage during the parade route\nThat for fans started to throw beer to the players and one hit the trophy directly in the flags causing it to bend\nWis ... Fifteen and forty five passed each hour and I'm Ryan ... W W J news radio nine fifty\nWill hit the roads for trafficking whether next W. W. J. new son six forty\nSeven [noise] download the all in our house bedtime is complicated my wife has always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of born branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting\nBack for a limited time a bowl and branch dot com they're unbelievably soft warm and bring the ball so misty stays warm and I don't know ... it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteenth stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of ... plus free shipping with promote code night\nThat's fifty dollars off plus free shipping right now at Boeing branch dot com from a code night but one branch dot com spelled B O L L and branch dot com promote night\nSix forty eight trafficking whether together on the AIDS checking the roads Katie what are we seeing out there\nWell Greg we're accident free we just clear that crashed I Seventy five south down near Clarke's tenet Davis Berg road you're still slower in that area as far as I can see through the ... and then wake some still an accident blocking all lanes on deck road between west wrote in Pontiac trail\nAnd Royal Oak and they'll be driving on six Ninety six Ethan you are slow right before the mound exit because of that dual exit that they do have going on there it'd be idle downloaded group twenty four hour traffic center Katie for WWE Jane is ready to unite fifty\nThe accuweather forecast DeBoer says temperatures of a low fifties during trick or treat time tonight then remaining cloudy overnight little forty four cloudy chili tomorrow rain at times in the afternoon and evening with a high a fifty fifty five AT Metro six fifty nine\nNews watch never Stivers sneezes radio nine fifty for you to oh do you think I'm\nRight Bowman top stories ahead teenager killed in a quadruple a quadruple shooting on Detroit's east side will have the details President Trump hitting the campaign trail as it begins to headline nearly a dozen rallies in six days ahead of the midterms CBS News seconds away plus can\nCancer be cured using alternative treatments I'm Dr deanna lights I'll tell you what a new survey finds coming up\nSports coming up at seven Fifteen and the pistons are in Brooklyn tonight ticket on the net secular there's says we got temperatures in the fifties for the trick or treaters\nWere you nice to\nDot com station seven o'clock [noise]\nTrump says as many as Fifteen thousand us troops could be sent to the border with Mexico nobody coming in\nAnd a grand jury weighs in on the accused Pittsburgh synagogue shooter forty four count indictment against Robert Bowers\nV is useless CBS world news round up late addition presented by Sarah works relief\nI'm Jim shown to be with just five fold days left the campaign Democrats and Republicans pulling out the stops before Tuesday's big vote CBS just even pork\nNot aiming to expand his party's majority in the Senate and help Republicans hold the house the president will be on the road each day between now and the election starting and Florida tonight we had to Missouri tomorrow West Virginia and Indiana on friday\nBy election day he'll overturn twice to Indiana and Missouri and Florida state's were democratic incumbent senators face for medical GOP challengers Democrats\nAlso have their big guns on the campaign trail\nThis election really matter former VP Joe Biden in Illinois where ... where are\nThe character of the country is on the violence\nBut the Democrats want to control the house CBS was ... he says it's all about turnout\nWhile we project that Democrats are going to retake the house the only way that happens this year if Democrats need and they said turn out that we've seen in previous mid term or non presidential election\nPresident Trump says the number of active duty military troops deployed at the U.S Mexico border in the weeks ahead could be double what the Pentagon has said it has plans for the mission\nOur military is that we have about five thousand eight will go anywhere between ten and Fifteen thousand military personnel on top of voters' roll dice and everybody else is the ...\nThe number keeps changing from eight hundred last week to a thousand than fifty two hundred then seven thousand that was earlier today President Trump requested the troops ahead of the expected a rival of the migrant caravan heading north through Mexico now said the number in the thousands\nOf the accused Pittsburgh Syria synagogue shooter faces dozens of counts including hate crime charges CBS is bill rake up\nThe federal grand jury returned to forty four count indictment against Robert ... hours for the killing of eleven worshipers at the tree of life synagogue last Saturday\nUs attorney Scott Brady set in a statement today begins the process of seeking justice for the victims of these hateful acts and healing for the victims families the Jewish community and our city Bowers remains behind bars and the butler county jail about thirty miles north of Pittsburgh\nHe faces a preliminary hearing on the charges in federal court tomorrow they'll re cops CBS News\nWhile inside the synagogue Bowers allegedly made statements indicating his desire to kill Jews on Wall street biggest today again in two years of ... two hundred and forty one now that is\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise]\nEaster too my my buddy of mine in honey\nShe's still not firing maybe he's not from Iowa [laughter]\nYeah maybe he's just not a happy baby maybe he's just being a boy\nHe not boys are or maybe he's TV oh poor baby I\nThink it's gotten hurt maybe he's just tired or maybe his tummy hurt he didn't need that much maybe he's not ... you think maybe he's scared of the dog maybe he'll outgrow it maybe it's a face maybe he just doesn't like smiling maybe he has autism\nAnd we can definitely be something to help\nMaybe is all you need to find out more about autism no big joyful smiles by six months is one early sign learned the others in autism speaks dot org slash size or see a doctor today for not ...\nJoy will smiles by six months is one early sign learned you know there's an autism speaks dot org slash size or see a doctor today for an autism screaming sooner Woodstock knows better and it can make a lifetime of difference to you by autism speaks council\nAfter a week of sell off the stock market is posted two days of significant gains\nMarket is is is clearly recovering and it's clearly covering recovering primarily because we've got some some good news on the earnings side of the equation market analyst you Johnson that's gone down to levels that I'm given the good earnings it looks a relatively undervalued and I think it's really attracted a lot of bargain hunters\nAnd then there's the job market CBS is Jason Brooks payroll tracker eighty pieces businesses that are two hundred twenty seven thousand new jobs in October the biggest gain since February economists are expecting the government to report again of around one hundred Ninety thousand jobs in the October employment report on friday the jobless rate in September ... three point seven percent\nEconomists said nearly a quarter million new jobs in October shows businesses can still find workers even with a jobless rate as a half century low you're listening to the CBS world news roundup\n[noise] washing ever saw on Detroit's number one\nSport in the\nEvening thanks so much for joining us on your Wednesday happy Halloween\nI'm Seventy Davis for W. W. J. news radio nine fifty it is October the thirty first twenty Eighteen accuweather set wet and chilly weather expected for tomorrow it's more of nights to shower too on friday with Dr for the weekend the complete accuweather more gas coming up thank you day\n... hours are pretty mild for an October evening it is fifty two degrees mostly cloudy at city airport Traficant whether together just ahead at seven or eight\nW. W. J. news times seven oh five new this evening for people or shot at a home on Detroit's east side police say a sixteen year old was killed the shots were fired inside a home on laying home near seven mile an hour drive\nTo the other three victims or Fifteen Years old another is age twenty six they are in serious condition no arrests have been made stay with W W J for more on this developing story\nWas less than a week to go before the election of scare closes a GOP office today in Traverse City W. W. J. Sandra McNeil reports\n... interesting with the Michigan Republican Party says the man walked into the G ... Travers city office yelling at staffing ranting about President Trump threatened to blow up the office before taking off Anderson says it's the latest and an escalation of incidents over the past month and a half\nIt's very scary uh are are made offices vandalized last week and we've had some pretty nasty phone calls left out our voice now and now that cat has shaken but they are they're kicking in Michigan and their mission where a revealing security protocols for all of our offices including our main headquarters and just asking everybody to be vigilant\nAnderson says sheriff's deputies came in and swept the building that no device was found Sandra McNeil W W Cheney's radio and you heard at first stone W. W. J. a hung jury and the murder trial of a former Michigan State police trooper W. W. J. city reported Vicki Thomas with the very latest after\nThree days of deliberating the jury remained deadlocked forcing judge Margaret then Holton to declare a mistrial X troop or mark ... tried on murder charges and the hazing death Fifteen year old demand Grimes Oliver again as a spokesman for the Grimes family\nIssue however we try because justice is served\nHazing death of Fifteen year old demand Grimes Oliver again as a spokesman for the Grimes family sure how to retry\nBecause justice is served as matter and this is another matter\nWhere we have people sad or thinking that police always get off on their courage young black man\nRichard convert Tina represent ...\nYou know he's temporarily ... really if that's what it is it's a temporary a condition because we're going to have ... trial in this case a pre\nTrial hearing set for next Wednesday thinking Thomas WW Jane is Radio Nice if the\nMurder charges have been filed against three Detroit women who are accused of running over another woman after an argument on social media the Wayne County prosecutor's office charge destiny Esther lean and periodically next with murder after destiny parks was run over and killed investigators say the suspect drove over to park his house last August\nTo fight over or after an argument F ... started on social media that is\nDuring this argument parks was hit by a car and then run over she died at the scene a third woman identified as Charlie ... was charged with tampering with evidence all three are due back in court next week\nW. W. J. news times seven or eight time for us to check traffic and whether together every ten minutes on the from the idol download or group traffic center brought you this hour by BMW of Rochester hills that set out to the roadways check in now with Lance hours\nJewish take credit for my wins but long story short she got an awesome loan hate off our cars and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg dot com slash radio best day dot com slash radio subject to quite a number of actual Rich Beeson title very\nIs our time trafficking whether together every ten minutes on the eighth inning thing scary on this Halloween Night Lance hours\nNo actually we're doing quite well out there on the area freeways this report sponsored by a roof right looking at those Tripoli gyms where accident free across the board and the later volumes of course a lot of people are out\nWith their trick or treaters so keep your eyes open around the subdivisions in size ... streets throughout the metro area\nIt's now time for the national electrical contractor association construction alert so you can know before you go six Ninety six westbound telegraph out two Seventy five and telling us only one lean open again tonight scheduled nine PM through five am tomorrow morning it's a nightly project through friday morning\nGetting your roof stand another winter of recruit from roof right Jim Brown and his staff have been doing roost right for over Twenty years visit roof right dot com that's roof right dot com\nOr call to for eight six six eight nine one by one from the ... group twenty four hour traffic center rambling it's our WW gene news radio nine fifty\nThank Lance and your accuweather forecast for the rest of your Halloween evening if you're still out and about their let's head on over to the family heating cooling and electrical weather center would they Bowers\nAre mostly ... guy right on through the evening but a light wins and temperatures in the low fifties or for the trick or treaters this evening overnight though about forty four\nTomorrow though it's going to be periods of rain and this will start first thing in the morning and they don't continue actually right into tomorrow night high of fifty in the lower forty one\nNow we're for friday cloudy chili is still a shower too high a forty nine and then it's dry weather for the weekend the clouds it's on Saturday by a forty eight Sunday a lot of clouds with the hype fifty to this is accuweather meteorologists have powers on do W. J. news radio\n... make a day fifty two degrees out at city airport mostly cloudy scientists fifty five AT Metro airport in cloud cover there to the west\nThat is traffic and whether together every ten minutes on the age you're next update at seven twenty eight or on demand over on a website W. W. J. news radio dot com\nW. W. J. news time seven Twenty one update of traffic and whether sponsored by\nRoof right can your roof stand another winter get a free quote from roof right Jim Brown and his staff had been doing roofs right for Twenty years visit roof right dot com that's roof right dot com or call to for eight six six eight nine one side one\nSeven Twenty one is our time a check on our top stories\nAhead stay with us\nYeah we sort of stopped paying attention and wrapped up a lot of\nThat yeah it was stressful he blamed me by my credit card debt and I play in town for building that man cave\nIt's awesome anyway we stop blaming each other dinner homework and read that a smart way to consolidate debt is to get a fixed rate loan but getting a loan was brutal and time drain so I was in my man cave researching personal loans and I found best egg they have an a plus rating with a bb\nAnd best egg handles everything on line start to finish\nAnd consumer at their best advice starts for the easy on line long nap and we can be approved and funded and if we live London that day I applied on line with no impact my credit score\nJewish take credit for my witness but long story short she got an awesome loan hate off our cards and some bills while lowering our monthly payment the best they loan was like a total fresh start yeah\nVisit best egg dot com slash radio best day dot com slash radio subject acquitted approval actual Rich Beeson ruled out\nAnd you know an ad from um\n... home in auto with progressive and have on your car insurance [noise] excuse me maybe we should add in the word money so they know that they're saving money\nAnd just kind of had that in there okay hello just nodding Emmy okay well he's\nGot enough funds to pushing their progressive catch me if you're from becoming your parents but we can save your money when you go home and all of course a casualty insurance companies really us and other insurers just not available on all sorts of situations now\nOn news radio nine fifty to only get to be a\nGood evening I'm Stephanie Davis and these are the top stories at seven twenty three hollowing night tragedy on Detroit's east side a teenage boy is killed during a quadruple shooting at home on laying homes street that's near seven mile an hour to drive the other victims\nTo Fifteen year old and a twenty six year old are in temporary serious condition plus three victims of the synagogue shooting near Pittsburgh laid to rest today meantime the suspected shooter Robert Bowers was indicted on forty four federal charges including hate crimes\nThat tragedy remain on the minds of politicians on the campaign trail here's vice president Mike Pence\nAnd also ... the president said this Saturday that our nation would in his words rise above the move past the division and embrace our common destiny as Americans\nMore from CBS News at the bottom of the hour W. W. J. news times seven twenty three\nFeet of snow for thirty first Nineteen sixty four I'm Charles arrested at Boston's Logan Airport number then charged with possession of her a long\nTime it was his third Boston Six you\nThat point in prison thanks to rehab that promise never touched heroin against them bugs in\nNineteen sixty nine days you I ... the release of the detective movie Marlowe or this or oh darn James Garner pieces over no\nFilm debut\nAs a job or thirty first hygiene Seventy Led Zeppelin topping the album jar with ...\nBrand do wrong but I was\nGoing to do experience relief or muscle cramps than ... years they're worked relief this fast acting boom has proven to prevent and relief and leg cramps get their works relief today in the pain relief file at Walmart CBS Rite Aid and Walgreen pharmacies for their works relief dot com\nW. W. chain news time seven twenty five for business from these suburban Cadillac of Troy business desk Jones ... has your Bloomberg Business report Wall Street getting scary\nJoan ... has your Bloomberg Business report all three didn't scare anybody that's Halloween silver with very enough for investors\nWith the Dow dropping five percent this month the S. and P. seven and the NASDAQ nine investors however it wants some of the losses back\nFor the day the Dell rose to hundred forty one points then asked at one hundred forty four the S. and P. twenty nine gains about one to two percent built on a tech rally sparked by Facebook's earnings\nThey indicated the social network is weathering its privacy issues to investors satisfaction the first thing General Motors did to mark a strong quarterly profit was offered buyouts to Eighteen thousand salaried workers cutting costs in response to terrorists\nAnd market pressures and probably working for Amazon so now CBS health is testing its own membership program it'll provide delivery perks discounts and ten bucks a month to spend in stores if you pay five dollars a month to join a care pass program it's being tested in Boston but CBS wants to expand it nationally\nI'm Joe Donnelly there with Bloomberg Business report on W. W. J. news radio nine\nFifty lottery numbers in the Michigan State lottery your mid day daily three five six zero in your mid day daily for zero five nine zero Traficant weather on the way WW Jay news time seven twenty six this hour has powered by mother what does\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as if the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nHey Sean Spicer said have lunch and mid term elections are approaching any anticipation is building with each passing day President Trump in full stumped traveling the country and campaigning for his fellow Republicans in Congress it goes without saying there's a lot on the line when Americans go to the polls on November sex\nThat they the latest news and information by subscribing to our new podcast everything's going to be All right it's available now on radio dot com I tuned or wherever you go to download your pot ...\nEverything's going to be alright described today don't miss out\n[noise] for\nThe moment my son saw redwood tree\nIs the moment I knew that for him you can\nEven this guy has no limit there are some moments only the fire ... fire find dealers that discovered the foreign that'll learn about for his new recruit things to do when you go for a moment of the things\nThat were brought in by the U.S Forest Service and he had counsel\nFor the W J new time seven twenty eight trafficking whether together every ten minutes on the eighth grade right back after the roadways lands any problems is Halloween\nNo right now which are nothing scary out there at all if you're traveling six Ninety six west bone we do have scheduled construction for telegraph do I two Seventy five and nine o'clock tonight going down to a single lane through five am tomorrow morning\n... Jim Jim showing the rest of the freeway system accident free at this time also care do scheduled construction Seventy five north ... way up to Adams scheduled to go down to a single lane next to or through five AM Thursday Romeo ... motor group ... our W W J news radio nine fifty thank\nTime seven thirty eight trafficking whether together every ten minutes on the eighth or your Halloween Night Lance house to drive\nA doing quite well looking at the Tripoli gyms this report sponsored by the education temporal scanner thermometer exit and free on all of the Detroit area freeways in fact dealing with later volumes near posted speech across the board there is construction schedule\nComing up tonight Seventy five north bound hula ... way up to Adams\nSchedule to go down to a single lane next hour through by William tomorrow morning\nIt'd be cold and flu season is upon us know when to call your doctor because of cold is a cold or flu brings fees fever so be prepared with a thermometer you can trust the extradition to the temporal scanner thermometer backed by more than Seventy clinical studies and trusted by medical professionals everywhere\nThe oxygen temporal scanner thermometer Romeo ... motor group twenty four hour traffic center only it's our W W genes radio nine fifty\nThank you land Iraqi weather forecast for the rest of your Halloween Night let's bring in meteorologists Dave ... is the cloud\nIs going through the night to temperatures will be in the forties at daybreak that end up for tomorrow tomorrow night rather\n... thank you Dave still mild out fifty five degrees at city airport mostly cloudy skies make that a metro airport it's fifty five and then were fifty two at a city airport mostly cloudy skies they're good evening to you on grow seal\nYour checking in at fifty degrees this time and mostly cloudy skies that is trafficking whether together every ten minutes on the AIDS your next up data seven forty eighth\nAnd if you just missed that whole report seconds ago you can always check us online at W. W. J. news radio dot com\n[noise] W. W. J. news times seven forty just ahead who killed Tamara green that story in second twenty four seven three sixty five\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful\nHe blame me for my credit card debt and I blame him for that mandate it's awesome\nAnyway we were making breakfast ... yeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills and one is the payment right\nAnd I read a bunch of rave reviews for ... dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score I clicked that met my application went through and I got approved before and it's making my eggs\nAnd the money was in our account like the next day\nOr high I got an amazing amount it paid off credit cards and bills and lowered our monthly payments that really is lending over easy yep\nOwns scramble your finances from your kitchen table visit best to dot com slash fried best to dot com slash fried subject to credit approval actual Rich Beeson approval times will vary\nIn Southfield right now more than the other on the apes and bringing you keep up on the\nNewsworthy nine just don't [noise]\nForty one is our time is forcing the local news sponsored by Josh Groban in concert the world's most unassailable voice [noise]\nJosh Groban bridges to November seventh and little\nCaesar's arena with very special guest the incomparable a Dina ... get tickets now at live nation that comment Ticketmaster [noise] who killed Tamara green there is a one hundred and two thousand dollar reward for information leading to an arrest in the case\nGreen was gunned down in her car on roles lawn it out to drive on Detroit's northwest side in April of twenty oh three Detroit police commander Elaine Brian love\nSomebody habit formation that will help us to solve this case I Want them to come forth with all of the status quo\nAnd green has been epicenter of speculation about wild party at the ... mansion when Kwame Kilpatrick was mayor she was a stripper under the name of strawberry anyone with information should call one eight hundred speak up W W J news times seven forty to\nOprah Winfrey and Reese Witherspoon will be among the special guests when Michelle Obama goes on tour for her memoir becoming others appearing was a former first lady will include Sarah Jessica Parker\nMichele Norris and former White House aide Valerie Jarrett Mrs Obama's book comes out in November the thirteenth and her tour begins that night at Chicago's United Center with Winfrey serving as moderator and she is making a stop here in Detroit W. W. J. news times seven forty three\nLawyers like one of the hottest tech companies giving up with Volkswagen I'm W W\nAll will be reporter Jeff Gilbert Israel's mobilize now a subsidiary of until you've known for its cuts\nFolks who are going to set up a ride hailing service in Israel beginning early next year automotive news as mobilize has been doing a lot of testing\nTo assure the system can operate in a thriving environment that's described as aggressive the joint venture called new mobility and Israel will start was several dozen votes guinea views and could scale up to hundreds and\nWhat's the worst part time job you'll be W J ... you know carbon monoxide is older laws\nYeah we sort of stopped paying attention and wrapped up a lot of debt right it was stressful\nThe blame me for my credit card debt and I blame him for that mandate is awesome anyway we were making breakfast ...\nYeah not a fan anyhow we read that a smart way to reduce debt is to consolidate high interest credit card debt and bills and one is the payment right\nAnd I read a bunch of rave reviews for best dot com and they're on line ... that takes like a minute and applying doesn't affect our credit score I clicked that met my application went through and I got approved before I finished making my eggs\nAnd the money was in our account like the next day\nRight I got an amazing amount it paid off credit cards and bills and lower their monthly payments that really is lending over easy yep\nOwns scramble your finances from your kitchen table visit best egg dot com slash fried best dig dug com slash fried subject to credit approval actual rates fees and approval times will very\nStop crushing candy today today you start playing that theme today is the first day of the rest of your life [noise] and that means is a crazy time looking but can find out about ...\nThousands of tons and\nOf keeps you to collect\nCrunching candy and now joining the\nAt the apple app store Google Play to download for free\nThe art scene [noise]\nTwenty nine the NASDAQ up one hundred and forty four check on your business just ahead at seven fifty five [noise]\nW. W. J. news times seven forty five times a sports here on WWE changes radio Disney will start off with the pistons in Brooklyn this evening against the Mets right now this one just underway Detroit on top make that now the next on\nTop four to three nine minutes left to go in that first quarter you can catch all of the action over on our sister station Ninety seven one the ticket the lions were on the practice field ahead of the match up against uh the Vikings are this coming Sunday and Minnesota day after the Golden Gate trade head coach Mack Patricia spoke\nAbout the move for us you know it's not about one player it's about team you know it's about everybody we have a lot of guys that are really good on this team that can produce and um you know honestly I'm you know for me it just you know we have confidence and everybody that's on the team right now that everybody can go on do their job uh and I think we've seen through the course of multiple different examples of\nYears of ah the NFL where you know these things happen and people move on and they keep going and they keep one in\nDetroit made some roster moves signing former giants linebacker Kelvin shepherd turning to college football Michigan head coach Jim her bone Ninety seven want the ticket earlier today says despite holding their own destiny in their hands his team's focus is on Penn State right now our approach has\nBeen one game at a time it really has a and we feel like that\nIs what is needed to be because every team in our schedule is is very very very good teams that we play a very good programs is this week no exception Penn State's are\nExcellent football team are both landed at both said Patterson\nThe Michigan State is at Maryland Saturday speaking of Maryland developing news and the sports world tonight DJ Dirk and has been fired as Maryland football coach one day after being reinstated by the school\nIs dismissal comes after the decision to bring 'em back on Tuesday was met by or by students and players in state politicians\nDark and was placed on administrative leave back in August while the university system of Maryland board of regents weight is a result of a report on the culture of the program and after receiving that report the board decided to bring them back\nSaying he was unfairly blamed for the dysfunction an athletic department that you look at sports every Fifteen and forty five pass each hour right here on W. W. J. news radio nine fifty just ahead we'll check trafficking whether together count them twelve second W. W. J. newsworthy\nStop cracking candy and then you start playing that's fans\nDidn't stay on the rest of your life\n... game we can find out if I start raining\nOff and tons of character ... pressing candy out twenty Fifteen\nApple app store or Google played to download free\nYou're WG a nice time seven forty eight trafficking whether together every ten minutes on the eighth lands house Halloween Dr not\nBad at all out there on the freeways this report sponsored by Ben Johnson the lawn of the triple a gym fumes showing an accident free commute on all of the area freeways we do have several construction zone scheduled for tonight", "show_name": "Greg Bowman", "year": "2018", "city": "Detroit", "day": "31"}