{"month": "10", "state": "MI", "station": "WWJ", "content": "They are right Tracy that accuweather forecast traumatic it with their meteorologist D divorce for the rest of today we'll see increasingly windy clouds breaking for sunshine are high temperature today fifty four then tonight clearing cold with a lunar thirty for tomorrow breezy chili sunshine clouds and hide your fifty four\nAnd then for Wednesday brisk even colder clouds of sunshine and hind you're forty eight\nRight now Detroit metro it's cloudy and it's fifty one degrees\nFor news watch members diverse newsworthy you're going to be able to use the older you\nGood morning I'm Jackie page and these are the top stories ahead President Trump suggesting that road killers may have been responsible for what ever happened to that missing Washington Post columnist was alive to CBS News for the details next went out of the list of what's here that k-mart stores in Michigan will be closing\nBecame business editor Murray Feldman was ruined his life and local with the update betrayed by your commissioner and the unions firing\nOver a new policy I think he Thomas and now to CBS News at twelve noon or you know\n[laughter]\nCBS News on the hour sponsored by their works really\nI'm ... Rodriguez President Trump has put his secretary of state on the case of the Saudi born journalist who disappeared after he entered the Saudi consulate in Istanbul two weeks ago\nI was putting the White House for a trip to survey hurricane damage in Florida in Georgia president said he'd just spoken with Saudi king Mohammed bin ... you said been Solomon denied any involvement in the disappearance of ... is\nIt allows me to Mr Trump is we're both bipartisan calls scrap the pending sale of arms to the king and he says he's sending secretary of state Pompeo to Saudi Arabia to further press the matter\nSteve in Port noise CBS News the White House\nTurkish officials have said they believed Jamal ... he was tortured and dismembered by Saudi operative representatives uh both countries entered the consulate about an hour ago President Trump has just landed at ... air force base in Florida where he and the first lady will tour some of the devastation from hurricane my [noise]\nThe death toll from the storm is up to Nineteen attorney general Jeff Sessions says he's put together a team of law enforcement and prosecutors to go after and that is Thirteen and other gang members\nWe are creating a French national organized crime task force of experienced prosecutors who will cool and night are ever develop I plan to take each of these groups off our street\nSessions wants a list of recommendations from the group within Ninety Days health officials in Florida the they've recorded the first flu death of the season a child who had not been vaccinated CBS News medical consulting Dr Karen the ruler on a new survey that shows a lot of parents need to educate themselves\nThis survey point that a lot of misconceptions thirty percent of parents thought it costs ... thirty percent thought it was a conspiracy thirty percent said it doesn't work and over half felt like the flu vaccine to give their kids the flu none of these things are true\nIt was like the Amazon of its day you could buy anything at Sears from lawnmowers tonight gallons entire houses even the company filed for chapter eleven bankruptcy today one hundred forty two additional stores are expected to close around the end of the year\nBefore their plane touched down in Australia this morning Buckingham Palace had released a statement announcing Prince Harry and Meghan Markel are expecting a baby this spring tourists in London are delighted\nThat ... through very play meal is coming thing yeah I'd say that you may be reciting the mice anytime that Duke\nAnd duchess of suffix were married in may they began their first official or\nI'd say maybe residing in anytime that Duke\nIn duchess of suffix were married in may they began their first official overseas tour at Iran does ooh instead name the Dow down twenty five points this is CBS News\nTo extremes relief or muscle cramps and your legs and feet used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot com\n\n[noise] washing ever saw on Detroit's number one news [noise]\n[noise] [noise] [noise]\nGood afternoon and thanks so much for joining us on this Monday it's October fifteenth and I'm Jackie paid for WWE Jay news radio nine fifty\nOr of increasingly strong winds this afternoon in the wake of a cold front windows could reach forty miles per hour will feel cool with higher fifty for the complete accuweather forecast is coming up\nRight now Detroit metro airport is cloudy and fifty degrees WWE tanoos time is now twelve o three accidents causing some closures and delays around metro Detroit this afternoon let's check in with WWE chase tracing the Catskills\nAnd we're watching Jackie the vehicle fire it remains south on him thirty nine of Oakwood we're all lanes or block backups to Michigan avenue try the service drive to get around that\nCrews are still clearing north on ice Seventy five the Fisher ramp to I Seventy five the Chrysler\nOf that earlier jak semi and we have here along the sun I met before at Shane center in right lanes are blocked we are backups to I Ninety six for this accident try taking more in to help you avoid that area reporting live here in the twenty four hour traffic center Tracy make us go W. W. J. news radio nine fifty and W. W. J. news time\nIs now twelve over for no suspects or arrest from that fatal shooting overnight at a Farmington Hills apartment building we have more from the scene from WWE jays that Charlie Langston\nResidents here still learning that one man has been murdered and another man is in the hospital after an early morning shooting here at the retreat affirmative hills apartments on twelve mile road near middle belt Farmington Hills please say that the shooting was targeted not random Adam ... he says that he heard the shots and then he called the police\nRecord gunfire sounded like a semi automatic or you know around one one thirty more to what I couldn't tell us what happened to want to go to the buildings or was it the person was what\nPolice are telling us the shooting was from outside firing into the apartment that murder still on the run reporting from Farmington Hills trolley line do I want to be James radio ninth\nWWW time now twelve o five health officials in Washington County are meeting today to discuss the record number of opioid overdose deaths this year we get the details from WWE jays that\nMichael Cohen good afternoon Jacki is the worst it's ever been ... the culture of the Walsh not health initiative opioid project she's she says so far fifty six people have died from opioid abuse this year in the county it's a problem with having a wide ranging impact on local residents were looking\nNot only at the issue of overdose deaths but the general use of opioids synthetic opioids and the impact that having on our healthcare system and as well as our community members I live and how\nIt's the first ever opioid summit being held today and wash no community college an afternoon session was tailored for medical counseling professionals\nThan an evening session for the general public where attendees we'll hear from people struggling with opioid addiction along with practical information so just the best way to safely use and store opioids Michael Toner boarding why for W. W. J. news radio nine fifty\nA Detroit city councilman facing bribery charges will appear in federal court to this\nMichael Toner boarding why for W. W. J. news radio on fifty\nA Detroit city councilman facing bribery charges will appear in federal court this afternoon we get more now from WWE Jay's Ron doing\nThis is an arraignment hearing for councilman Gabe Leland indicted earlier this month on one kind of conspiracy and two counts of bribery federal investigators accused ... of the campaign worker of pocketing Fifteen thousand dollars from a local business owner for helping to prevent the city from some of the land that's a business owner thought he'll\n... responded to the indictment last week saying he is innocent until proven guilty until further notice and it's business as usual for him wrongdoing W. W. J. news radio nine fifty\nNow going to have a DJ news time is now twelve o seven we now have a list of what Sears k-mart stores in Michigan will be closing tell that he'd have a DJ business editor Murray Feldman joining us live and local with the update Marie\nGood afternoon Jacki Sears will close a hundred and forty two stores for them here in Michigan among those slated to close the Sears stores in Lincoln Park in Ann Arbor that k-mart stores in lake orient and Charlotte boy liquidation sales should begin within a couple of weeks you know at one time Sears had over four thousand stores\nUnder this bankruptcy plan they will have fewer than seven hundred surviving the chairman of Sears Holdings Eddie Lambert who owns nearly a third of the company himself says quoting now as we look toward the holiday season Sears and k-mart stores will remain open for business\nAnd are dedicated associates look forward to serving our members and customers\nWere part of the bankruptcy planned demanded that he Lambert give up his role as CEO he will remain on his chairman report in lake Murray Feldman W. W. J. news radio nine fifty\nAll right thanks Murray devotee to have a DJ news time twelve o seven the debate over the Detroit fire department's policy over emergency sirens rages on we get more now from W you have a ... a reporter Vicki term is\nAs that he tried firefighters union doubles down on calls for immediate changes to the new and said that response policy the fire commissioner calling out the union for spreading what he calls false and misleading information\nThe policy uses a cold won lights and sirens and cold to no lights no sirens to dispatch the union says the policy puts the public at risk\nCommissioner Jones says the policy actually reduces the number of times firefighters and citizens are put in jeopardy ... Thomas WW James radio nine fifty [noise]\nW. W. J. news time now twelve away traffic and whether together every ten minutes on the aid from the idol download a group traffic center brought you this hour by BMW Rochester hills and here's Tracy McCaskill\nAnd Jackie we are watching a busy drive here but uh some good news at the vehicle fire south on I'm thirty nine in Oakland is finally cleared crews are still clearing be jak semi from North by Seventy five the Fisher ramp two Seventy five the Chrysler we still have hear\nYou roll with the times yeah so do we\nWith new styles and great fits\nFranklin real comfortable genes [noise]\nW. W. J. new sounds out twelve Eighteen traffic and whether together every ten minutes on the AIDS and here's Tracy McCaskill\nAnd Jackie checking that ... that we still have more than a couple of slow down the better news along the earth but I Seventy five the Fisher that ramp to North ... Seventy five the Chrysler finally completely clear to bed earlier jak semi\nNow checking the triple a GM came and he found identity forward shame the center in right lanes remain blocked by an accident backups you I Ninety six continue try taking Warren as an alternate west on I ... thirty mile left wing closure there for work in time now for the electrical workers local fifty eight construction alert\nWe're more work is underway along ... up until five thirty\nUp until ... pm the right shoulder as blocked along east bound I Ninety six at back road from the idol download our group twenty four hour traffic center I'm Tracey ... W W J news radio nine fifty\nAnd the accuweather forecast from accuweather meteorologist day than those from the family heating cooling and electrical whether centered\nIn the wake of a cold front will have increasingly strong winds blowing this afternoon your height fifty four degrees when guys could reach forty miles per hour at times will have the sunshine increasing as well throughout the day\nMost of the clear skies tonight a cold one with a lower thirty four degrees downtown so outlying areas where the win diminishes will have frosted even sub freezing temperatures or tomorrow brusque and Chile with a high a fifty four with\nAnother call for its wings through Wednesday will have strong of a high just forty it could even have some snow flurries in the air than Wednesday night it looks like we'll have a hard freeze and many areas Thursday Sunday but cool with a high a fifty for probably partly sunny fifty for this\nIs accuweather meteorologist Dave Samuel L. W. W. J. news radio night fifty and won\nAnd once again we're looking at cloudy skies forty eight now and ... is fifty three and ... fifty two in Clinton township Annette Detroit metro airport it's cloudy and it's fifty degrees\nAnd where do you do you do [noise]\nGood afternoon I'm Jackie page and these are the top stories at twelve Twenty one well now the list of what Sears and k-mart stores in Michigan will be closing just after\nI'd just hours after filing for a chapter eleven bankruptcy the company said the Sears stores and Lincoln Park and Ann Arbor it will be closed by the end of this year k-mart stores in lake oriented Charlotte boy will also be closed liquidation sales should start soon\nIn Britain another royal baby is on the way\nThe palace confirms that that you can touch is obsessed they come on Harry and Meghan to all of us are expecting their first child sometime in the spring\nAre they going to be wonderful very mode and her royal biographer Robert Hartman Prince Harry whenever we go through any of 'em or as a brings a lawyer or killed in a couple\nOf just begun a sixteen day tour of the south Pacific many guesses what everyone they need to spend a lot of talk about Dicky Barker CBS News London\nWWE Jay news time now twelve Twenty one Republican National committee chairwoman running McDaniel of Michigan being asked by President Trump to come back for a second term that as the president gears up for his twenty twenty reelection campaign like Daniel has reportedly accepted Trump's offer but the RMC will hold and officials out\nIn January\nIt's that time of year where there are a lot more car deer crashes in Michigan there were only fifty one thousand such crashes in twenty Seventeen and sixteen were fatal ... county sheriff Brian ... goal has some advice\nWhen they're out and about you're going to need to slow down especially with the reading season um they're going to be you know changing their deer and things like that so they may run out in front of you know the biggest times that we see accidents are from six pm at night until midnight\nThe goal says it there are also a lot of cardio crashes from six to nine in the morning he also says if a deer runs out in front of you don't swerve because you could crash into another vehicle or go off the road [noise] heavy rain causing some early campground closures in the upper peninsula\nOf Michigan department of natural resources says the camp grounds a barrier go state park in barrag accounting and porcupine mountains wilderness they park in ... county are shut down work you by mountains wilderness the park supervisor Michael ...\nSays the park received nearly Eighteen days of continuous rain in the camp sites are completely saturated with standing water in ruts\nFor vehicles and campers that have been getting stuck officials say hikers and bet country campers urged them not to any unnecessary risks into seriously evaluate any attempts that informal river crossing ... still object news radio nine fifty\nDollars you'd have a DJ news times now twelve twenty three education today is sponsored by Oakland University\n[noise] if you received your associates degree in nursing and why you're BS and in nursing open university professor Kimberly hook up to the adjunct instructor for the school of nursing and R. and B. S. cents program coordinator she says oh you is the place to go\nSo if they're coming in with their general education requirements and their knowledge application course fulfilled what this means for them is the overseas sixty three transfer credits then they'll receive a thirty credits\nFor having there are an license and passing their state board which is called there and the clocks Iran and they will only need to focus on our thirty to nursing credits\nWhich are a nine courses\nHogan says the students who get their BSN in addition to there are in the Institute of medicine did some research and it shows that are ends with a BSN or better managing patient care needs and it leads to leadership roles\nTo do of medicine did some research and it shows that are ends with a BSN or better managing patient care needs and it leads to leadership roles and higher education Laura ... W W J news radio nine fifty [noise]\nAt the twelve K they give away here WWE Jay news radio nine fifty this hour key word is thunder or text to thunder T. H. U. N. D. E. R. to seven to eight one for your chance to win a thousand dollars messaging data rates apply remember don't text and drive\nThe all new radio job job that is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll save your favorite stations and\nOthers do you based on your was your news and information you rely on me even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has blocked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nDidn't have any new scientists out twelve twenty five time for business from the suburban Cadillac of toy business death by now the Dow is down thirty eight points in as that goes down forty four the S P is down eight and at least have already has our Bloomberg Business report even as the U.S\n... sanctions and the disappearance of a journalist in Saudi Arabia two major names are bailing out of an investor event there J. P. Morgan Chase it chief executive Jamie diamond and Ford Motor chair bill for both have canceled plans to attend what's being called\nDavos in the desert for a second straight month us retail sales were a little slow in September total sales rose just a tenth of a percent well below the wall street forecast Americans spent less at restaurants but we're a little freer with their wallets in other places\nIt's been around for more than a century and Sears is hoping to be around for a little while longer so the operator at Sears and k-mart stores is seeking chapter eleven bankruptcy protection as it struggles under a mountain of debt\nThe company list more than ten billion dollars in debt and more than one billion dollars in assets in its filing it looks to survive as a smaller leaner chain I'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nAn hour from um [noise]\nSave money on your car insurance by bundling home in auto with progressive [noise] hey is that all this cold in here that it doesn't bother me doesn't bother me advantage is just kinda curious because um if it's the equipment or something that that's fine it's just it's kinda chilly\nProgress with cats review from becoming your parents but we conserve your money when you want oh of course we control over the insurers just coming off a little stricter situations\nThose who go home to change and those who roll with the\nRegular makes change for the ... [noise]\nThe leaders but\nThose who are found by [noise]\nBull riders to rock stars from work life tonight when\nYou roll with the times yeah so do we\nWith new styles and create fits\nSprinkler real comfortable Jay Z\nAnd that accuweather forecast from accuweather meteorologist Dave Samuel\nWill have increasingly strong winds this afternoon of the corporate has passed through the area temperature fifty four for a high but it will certainly feel cooler than that thanks to the head\nCold tonight with a clear sky wince literally diminishes well below thirty four degrees\nAnd that for tomorrow or brusque chilly day but partly sunny with the higher fifty four\nColder Wednesday with the guest you went to high just forty eight could be some reason the year that will likely see hard freeze in many places at night or cold is their best of the season arriving Wednesday otherwise Thursday a chilly day despite sunshine ... fifty two little bitter friday with a higher fifty four\nOf oh looks like one of another powerful culprits winging through the weekend so no warm up anytime soon\nThis was accuweather meteorologist deep Samuel L. W. W. J. news radio nine fifty\nAnd still looking at cloudy skies fifty now Bloomfield fifty foreign Roseville at Detroit metro airport it's cloudy and it's fifty degrees traffic and whether together sponsored by Detroit princess riverboat make your corporate holiday party different this year book it now on Detroit princess riverboat\nThey're heated and the closer you can celebrate any party political fundraiser or birthday all year long cruise with them Saturdays or Sundays for lunch or dinner called eight seven seven D. E. T. boat or Detroit princess dot com\nThe all new radio job job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list is a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nFirefighter Raphael Korea firehouse subs introducing new firehouse pub steaks up savory steak crispy fried onions in a rich Belgian for your cheese sauce on top for limited time to yours firehouse ... dot com member fortunate every ... by helps provide lifesaving equipment first response\nSubs joined more subs save more lives limited time only place I could just finish by herself to donate minimum one million dollars to them and they seem to borrow some public safety from the point when the person every ...\nWhat do you every time you went out you can cash in now with the capital and save your car you are in four percent cash back on dining and entertainment like learning more about each other and you first date you pay the over or just suffering can't hit the high notes that your favorite karaoke bar\nNo matter your reason for going out now you have four more introducing new favorite cartoon capital one in four proceeds on mining and four percent on entertainment what's in your wallet terms applied capital one bank usa in a\nPress again whether to gather on the breaking news came up to date on the road\nNewsworthy nine fifty to\nSeventy Seventy chain you have is now twelve forty one people in the u._k. will soon have a new way to deal with loneliness\nBritish prime minister Theresa May and now like twenty twenty three doctors will be able to write prescriptions for cooking classes walking and our troops to them that loneliness make calls at one of the greatest public health challenges of our time with links to everything from heart disease\nStroke and also ... about two point four million dollars has been earmarked for the initiative called social prescribe it\nRiding and take the place of medications ... Rodrigues CBS News\nA new study by Nielsen and the business music service soundtrack your brand science at the industry is losing huge sums of money when sons are played in some commercial establish a stylish Mintz I'm Gary non [noise]\nWalk into a coffee shop [noise]\nThe background sounds maybe ... but it may not be nearly as\nListen to the use of the music industry music venue constitutes a public performance\nNew study finds the global music industry is losing more than two and a half billion dollars a year because small businesses are using personal streaming services like Spotify and not paying and most owners incorrectly believe but it's okay to use personal music accounts in such places on CBS News\nThis like something out of a Super Bowl ad deputies and California have used it Doritos to lure a pig the size of a mini horse\nBack home and take was running around the neighborhood when the San Bernardino county sheriff's office received the call Saturday\nOne of the deputies had to read those in her lunch bag video shows the deputy leaving a trail of the tips which the pig followed since deputies had responded to previous calls about the pig they knew where to take him he was returned to his penny deputies secured the gate\nWWE a news time now twelve forty four we'll check in with Ryan in sports that's next\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political tide gas\nCovering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I do\nOn Wall street the Dow is down at one point we'll check your money coming up a twelve fifty five\nW. W. K. news times is that while forty five that means it's time for sports and once again here's Ryan\n... should I go to Jim Harbaugh speaking today said that his team is very confident going into the game on Saturday gets Michigan State in his office of line is playing some of the best football of their careers he was also asked though how close is Michigan reaching their full potential after losing that her name on the road to start the year and the rattling off six in a row\nAs a coach or you know gosh darn it to to have a good we're we're going we're done this so far now if we could just get this is better so uh you're always striving for and chasing to ... you can be\nA horrible was then asked what his messages to his players about the chance to not only get a win and the rivalry but to knock offering team on the road for the first time since two thousand six and who's pretty short fried\nOpportunity yeah\nHorrible also wouldn't talk about injuries but it's a it's an surfer Sean Gary we'll be back in time for the game\nAnd they'll be on high alert for trick plays Michigan sort of go mark Antonio meanwhile we'll speak tomorrow we'll sport and safety ... picked up on her today he was in the big tens defensive player the week except for racking up nine tackles any force fumble in Michigan state's upset whenever Penn State on Saturday or the baseball playoffs continuing tonight's game three of the you know see as to when the brewers in ...\nBumble in Michigan state's ups at one of her Penn State on Saturday\nOr the baseball playoffs continuing tonight's game three of the you know see us when the brewers and Dodgers from a lady that series tied the game of piece of the first pitch at seven thirty nine and the red wings and search for the first victory of the season tonight as they skate with the Canadians up in Montreal here in Ninety seven on the ticket starting at seven ten\nWith sports Fifteen and forty five passed each hour I'm Ryan woolly W W J news radio nine fifty\n... reported air hog okay I Know my campfire and smoking to me\nSo you'd round the first started grounded again and felt that it was cold\nI mean it's just like you know you get from Smokey Bear\nI'm going to let you go are many ways to start a fire but once you're way to put it out there now you can do your part Smokey Bear duck sponsored by the U.S Forest Service I counted and your state for\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nG G G E R B Ellen deadly it'd be there and if you do you think that these kinds of Texas they're fine because of their links and you can easily send them at a stop light but no answering one text can take your attention away from the road for five\nSeconds I'm traveling at fifty five miles an hour that's enough time to travel the link to a football fields making decisions don't text and drive\nDoes it stop tax ... or a message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\n[noise] many medicines used to treat colds and flu contain acetaminophen a pain reliever and fever reduce are found in hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver\nSo always read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more visit ... go slash OTC pain info a message from the U.S department of health and Human Services food and Drug Administration [noise] ...\nRisk colder Wednesday clouds of sunshine and high just forty eight\nThursday chili despite plenty of sunshine with a hundred and fifty two and then for friday times of clouds and sunshine and to hire fifty four right now we have found these guys it's fifty degrees that Detroit metro airport\nThe news ... news radio nine fifty to older you\nGood afternoon I'm Jackie page and these are the top stories ahead secretary of state my my Tom hale heads to Saudi Arabia to discuss the disappearance of Saudi journalist in your mouth 'cause she'll be CBS News with the details coming up next quicken\nLoans and it's family of companies announcing the opening of a new technology office across the river WW Hayes Michael Cohen will join us live to explain\nThat they've deadline for anybody who wants to buy a Tesla motor we reporter Jeff your wheelchair\nExports coming up at one Fifteen your money at one twenty five the Dow Jones industrial average is up fourteen points and now CBS News coverage the world at one o'clock [noise]\nAccount\nCBS News on the hour sponsored by their works relief\nI never Rodriguez two weeks after a Saudi born journalist banished after he entered the Saudi consulate in Istanbul President Trump is taking action with echoes\nOf his responses to Vladimir Putin's denials of Russian election meddling the president said the Saudi king told him his government is not to blame for Jamal casualties disappearance but then I was always an Iowa was burned out and Mr Trump suggested can Mohammed bin Salman\nMr Trump has rebuffed bipartisan calls to cancel plans Saudi arms purchases saying he'd rather let us defense contractors keep the business Steven port noise CBS News the White House\nTurkish police were allowed to enter the consulate today to investigate\nPresident Trump and the first lady arrived in Florida about an hour ago to get a firsthand look at the devastation from hurricane Michael make a stop in hard hit areas Georgia before they head back to Washington the death toll from the storm is\nUp to Nineteen parts of northern California had no power today not because of a natural disaster but the threat of one spokeswoman Dana ... Pacific gas and electric is trying to get ahead of potential wildfires for the\nSafety of the community when a fire a threat or right is one of these extreme weather conditions we want to do everything to keep our community safe and our customers say there are\nHigh wind warning in effect across the bay area the music industry as smarting from songs you here at your favorite cafe a restaurant every day CBS is Gary not\nWalk into a coffee shop [noise]\nBackground sounds maybe ... we're not nearly as\nOne of the use of the music industry music in my view constitutionally public performance new study finds the global music industry losing more than two and a half billion dollars a year because small businesses are using personal streaming services like Spotify and not paying and most donors incorrectly believe but it's okay to use personal music recounts and George Bush has\nSaid he by Neal sending the music service soundtrack your brand if you don't your mom or dad maybe your grandparents had a lawnmower a house they bought it tears\nThis morning the store filed for bankruptcy CBS News business analyst you'll lessons oddly enough Sears was a trailblazer it actually was one of the first retailers to launch a Web site in Nineteen Ninety nine but then kind of left it and did not actually\nFigure out how to put more money into that\nThe Dow is Seventeen points right now this is CBS News\nYou experienced relief or muscle cramps and your legs and feet you stir works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] Washington on Detroit's number one\nWhere the older you\nGood afternoon and thanks for joining us on this Monday it is October the fifteenth and I'm Jackie page for W. W. J. news radio nine fifty\nWell just the ones across a year earlier this afternoon the hype fifty four degrees and the wind could top forty miles per hour at times the complete ... weather forecasters coming up\nRight now Detroit metro it's cloudy and fifty two degrees W. W. J. news time is not what oh three in Detroit firefighters taking aim at a policy that they say is risking lives WWE Jay's is Andrew McNeill is live and local\nWith the story Sandra\nThat a lot of controversy Jackie over this policy that\n\nAnd I believe it looks like ah sounds like we lost our connection there to Sandra we'll check in with her and I'm just that today's bankruptcy filing by Sears has many watching what may happen with those that are still open its ears and the bone yet is one of three remaining in metro Detroit alone with no vine west land\nThe live on your location at seven mile a middle belt is also the nature of the nation's largest with a footprint of three hundred Seventy five thousand square feet Dan west of the ... chamber of commerce telling W. W. J. that the city's central location in western Wayne County has allowed that particular Sears to survive people could you shop there\nTelling WWE jaded the city's central location in western Wayne County has allowed that particular Sears to survive people could\nUse a shot there and it continues to be a profitable but you know like a lot of people have on you know what kind of spot for several years and see all the closings and we kind of a campaign that there's going to close but it continues to remain open\nEven if the store does not survive bankruptcy west says it's here's holdings can still make cash by selling their property [noise] W. W. J. news time now one oh four Quicken Loans is expanding again and as WWE Jay's Michael Cohen reports live and local company owned by billionaire Dan Gilbert has just announced plans to open a new location across the Detroit River\nA Jackie in a statement released to the country's largest home mortgage lender so that will be opening a new law visit me historic old fish market building in downtown Windsor location will be used for primarily software technology engineering and programming jobs\nSomebody officials it'd be all this is strategically located in Canada two and a half for Reuben up first of top technology talent in Ontario renovation of the new location is expected to be completed in the first or second quarter of two thousand Nineteen and quick and plans to grow the office to more than a hundred workers\nThis will be the second foray into Canada for the Detroit base home lender and two thousand sixteen rocket homes a subsidiary of rock\nHoldings purchased Toronto based open house real to Michael Toner reporting lived for W. W. J. news radio nine fifty\nAll right Thanks Michael W. W. J. news times without one of five you can't you can't beat this\nOh there we go [noise] his rival rivalry we care in Michigan the highly anticipated Michigan Michigan State game is Saturday with more now here's WWE gays rhyme jak\nThe countdown to the back yard Raul is on Michigan heading the spartan stadium to take on Michigan State on Saturday today though had coached ... asked to talk about the rivalry and was really a man of few words he was first asked if there was extra motivation heading into this one because of how the seasons unfolded\nAh yes I'm In state rival\nPicked an opponent it always has is and ...\nHe was asked to talk about his view of the rivalry is someone now who is both played in the game you know coaches in the series\nUm the way the way it always has been the way it is the way it always will be purchased the same as it always has the game\nLast year he was asked what does messages to his players but not only getting a win in this robbery but to finally be the top twenty five seem on the road for the first time since two thousand six great opportunity\nYeah\nThe harbor harbor was more conversational what other things including that the team is very competent going into the game that was John Gary we back or ... I'm sure he'll be back in time for the game reporting live Ryan woolly double ... news radio nine fifty\nAll right thanks Ryan looking forward to it Detroit firefighters taking aim at a policy\nThey say is risking life let's check in now once again with WWE Jay's Sandra ... who has the story Sandra\n\nTear the union have a problem with the policy the basically separate runs into two different categories you have your priority Iran and then a code to now\nUnion officials say this is rich thing live because how do you know something is the priority or not or you get there when people call in a fire they haven't investigated it so that when he's asked me what's going on and he points out recently\nThere was actually a woman on fire in a field and someone called and they it was debris so that was a co Q. when it was called that now firefighter a union president like Nevin also says that this is leading to rescue personnel being assaulted recently he says\nWell you when it was called at now firefighter a union president like Nevin also said that this is a leading to rescue personnel being assaulted recently he says yeah and that person our probably because they can Fifteen minutes to respond to a cardiac arrest\nAnd by that time the woman had already been taken to the hospital I relatives reporting from Detroit Sandra McNeil WWE Chinese ready and I'm fifty [noise]\nW. W. J. news time now one way traffic and whether together every ten minutes on the age from the idol download a group traffic center brought you this hour by Motor City many and here's Tracy McCaskill\nAnd Jackie checking the triple triple triple a jam can fix me but [laughter]\nUh watching here with on eight mile road it sure would an accident and leaving only the right lane open thanks to picture Cindy she called in about fat as well west on I ... to Monroe we have a moving work crew set up there now the right lane closure underway until two thirty\nThis work continue west on identity for Thirteen miles to the left lane remains closed until three\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using bling smartphone app so you know when your kids get home from school no contracts you know subscriptions totally affordable and blink works with Alexa\nBlinks camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions of law\nNow that you have any changes time now one Eighteen traffic and whether together every ten minutes on the ... and Jack\nAnd checking the triple a jam camp this time around still watching a couple of slow down this report sponsored by higher it done we have a new accident ... for after him fifty three Van Dyke there right lane blocked this problem sill on west on eight mile road it sure what the accident leaving only\nThe right lane open time now for the electrical workers local fifty eight construction alert\nWhere we are watching here north bound and cell phone telegraph down to just a couple of lanes at maple that traffic is backing up in both directions as while we still have the work along with the navy for thirty mile in the war continued until five thirty on the right shoulder obese found six maybe six\nAt ... am tend to lodge again this report sponsored by higher it done for me I have a motor group twenty four hour traffic center I'm Tracy McCaskill WW Jane news radio nine fifty\nAnd that accuweather forecast from the family heating cooling and electrical weather center\nIn the wake of a cold front will have increasingly strong winds blowing this afternoon your high fifty four degrees when us could reach forty miles per hour at times will have the sunshine increasing as well throughout the day\nMost of the clear skies today the cold one with a lower thirty four degrees downtown so outlying areas where the win diminishes will have for us to even sub freezing temperatures\nOr tomorrow brusque and Chile with a high a fifty four with another call for its wings the Wednesday will have struggling survive just forty it could even have some snow flurries in the air than Wednesday night it looks like we'll have a hard freeze and many areas Thursday Sunday but cool with a higher fifty for probably partly sunny fifty for\nWas accuweather meteorologist they've Samuel L. W. W. J. news radio nine fifty\nRight now we have cloudy skies and fifty degrees that Detroit metro airport and put the expertise in skill of I BWI electricians and Nick a signatory contractors to work for your commercial public industrial or residential construction project learn more empowering Michigan's future dot com the best contractors the best electricians period\nOn news radio nine for you good afternoon\nI'm Jackie page and these are the top stories at one Twenty one police have released the name of a tax a student who was fatally shot at an apartment building near Michigan State university last week East Lansing police say he's twenty two year old and I said around us of Alamo, Texas thrown its was killed it really friday and an apartment building two miles north of the campus\nI joined Saturday Turkish team has entered the Saudi constantly at an Istanbul to conduct a surge\nIt comes nearly two weeks after this is the disappearance of Saudi journalist ... ... it's unclear what kind of search the officials will be conducting and if it will involve forensics especially since because she'll be disappeared October second President Trump meantime says is ...\nOr develop putting more mental health and art programs in schools he criticized stop and frisk in Chicago he urged the president to take the word again out of his model because the old America was not that great for black people even hinted at reparations for slavery saying that black people need ownership\nAnd we don't have ownership then it's all about how something look who we focus more on this somebody was something that someone disrespect me so I gotta I gotta shoot him\nAnd then he suggested Trump make peace with Colin Kaepernick and stop obsessing on ... the old traditions\nI Would love to see that the super bowl prompt wearing the make America great ... calling random making America great again showing that they will have to stick to our traditions that we are a side we are one you know we are one country\nAnd the law and order president loved it some people saw crazy but I saw a guy who could end up on the other side of the best they've Ross on the CBS News radio network\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\nWendy what a spot that burglar when he's facing your home or after they had asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nFirefighter right field for a at a firehouse subs introducing new firehouse pub steak so savory steak crispy fried onions and are rich Belgian beers cheese sauce on top for limited time or to yours firehouse subs dot com remember a portion of every self you buy help provide lifesaving equipment first response\nOf joy more subs save more lives somebody time only place I was just reading location by herself to donate minimum one million dollars to them they seem to borrow some public safety foundation point when people are saying every person\nW. W. K. news time there's not one twenty five time for business from the suburban Cadillac and for a business desk and right now the Dow is twenty seven points the NASDAQ is down will get the full bluebirds Bloomberg Business report now from all these different bank of America\nGot a boost from rising interest rates in the latest quarter the big banks lending business produced the most interest income since ... eleven that help to push its profit up by thirty two percent to better than forecast levels\nThe second largest US Bank by assets bank of America posted revenue of nearly twenty three billion dollars and that was also a little better than expected or one hundred and thirty four million dollar debt payment Dubai today has finally forced Sears Holdings to run for cover in bankruptcy court\nThe operator at Sears and kmart's sources seeking chapter eleven protection from its creditors saying that will close another one hundred forty two under performing stores near the end of the year although it doesn't specify yet which ones that is in addition to the forty six stores it had planned to close already this year\nHedge fund manager and the largest invest\nAlready this year hedge fund manager and the largest investor in Sears Eddie ... has stepped down as chief executive I'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nToday resigned Walter\nFifteen or Twenty one I mean a lot to do and he's smart to strike\nI forgot his homework\nWhen you can see learning and attention issues from their side you can be on their side that's why there's understood that or a free resource for the parents have the one in five kids with learning and attention issues go for misunderstanding to understood that Oregon brought to you by understood in the ad council\nWendy what a spot that burglar when he was chasing your home or after his head as John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using bling smartphone app so you know when your kids get home from school no contracts you know subscriptions totally affordable and blink works with Alexa\nBlinked camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions of law\nAnd you know an ad from God save money on car insurance when you bundle home an auto with progressive\n... what is this good wow where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] so it's not near that solid stuff\nProgressive can't save you from becoming your parents but we can save your money when you go home and all across the country the insurance companies will use other insurers just coming off a little stricter situations\nAnd the shock Tobar sales are bad going on now is there are several a in Southfield get\nShockingly low prices all October long telegraphing six Ninety six they will make a deal [noise] W. W. dot is that one twenty eight traffic bad weather together on the streets were already talking Christmas\nAnd young yeah brain is making it sound awfully man\nThat's not a problem but we're watching here ... through the ... a couple of slow down this accident ... for after Van Dyke there the right lane block just a slight delay in that area\nStill on west on eight mile road it sure would\nAn accident leaving just the right lane open we're also watching here on heath on six Ninety six of them tend to right shoulder closure continues there up until five thirty and better news along the Davis in east bound they made\nThe accuweather forecast now from accuweather meteorologist Dave Samuel\nHave increasingly strong winds this afternoon out of the cold for and has passed through the area temperature fifty four for a high but it will certainly feel cooler than that thanks to the wind\nCold tonight with a clear sky wince literally diminishes well below thirty four degrees\nAnd then for tomorrow or brusque chilly day but partly sunny with the higher fifty four\nColder Wednesday with the guest you went to high just forty eight could be some flurries in the air then we'll likely see hard freeze in many places at night or cold as their mass of the season arriving Wednesday otherwise Thursday a chilly day despite sunshine of all the hype fifty to a little bit or friday with a higher fifty for\nA little looks like love another powerful culprits winging through the weekend so no warm up anytime soon\nThis is accuweather meteorologist Dave Samuel on WW Jay news radio nine fifty\nHanded cloudy and fifty degrees right now Detroit metro airport traffic and whether together sponsored by Michigan schools in government credit union Michigan schools and government credit union offer some of the best CD rates that you'll find with as little as five hundred dollars up to twenty three months CD and start earning two points have an annual percentage field\nVisit M. S. G. the EU debt or get to get started\nAnd now a page from the diary of long skinny diary\nBrush off again I don't get it is there something wrong with the way I waive although although I Want that little that hounding me I'm friendly\nGet everyone peace of mind when they protect their homes their progressive jumping for joy when I Walk by\nSaving averages Seventy percent on car insurance when you bundle home an auto through progressive me\nProgressive casualty insurance company and affiliates discounts none of it is\nThe all new radio jak combat is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list in the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n\nPressing and whether they gather on the AIDS and breaking news first came up to date on the road every\nNewsworthy nine fifty to all the\nTime is now one forty one [noise]\nIn Britain the palace confirms that Prince Harry and his wife Megan Marco our expecting their first child sometime in the spring\nHow are you making baby will be seven in line to the British round behind William and Kate's children prince George protest Charlotte at prince ... royal biographer Robert heart\nAnd we'll sing ... those were just continuity\nContinuity and family harmony the ... to make their announcement until after princess ... wedding on friday apparently not wanting to upstaged O'Reilly cousin to keep our CBS News slugger\nW. W. J. news time is now one forty one of the Ford Motor company attorney to a member of the Ford family as it looks to upgrade the way the dealers interact with customers get more and that from WWE Jay auto beat reporter Jeff Gilbert\nElaine afford named to the new role of chief customer experience officer the ... to Ford will lead a team tasked with identifying customer pain points at improving any number of things from the buying process to the service process\nTo overall communications between the company and the people who buy products Elena Ford is fifty two was a great granddaughter of founder Henry Ford\nAnd is that a number of other positions in the company Jeff Gilbert W W J ...\nW W J news time is now one forty to\nCBS I own veterans presented by their words ... hurricane Michael cause widespread destruction when it made landfall last week\nMany groups are on the ground now working to help the affected areas recover including the veteran service organization ... our\nDepartment in Florida has a ... program so they're going to be leading this effort for us um they're bringing a lot of supplies up in there a lot of manpower a lot of guys with chainsaws and shovels that's an vets executive director Joe ... or we have information right on the front page of how people can help\nForce if you are in the area or if your near the end but post very likely they're going to be doing tape drives to collect supplies\nA navy veteran Eric day from connecting vets dot com for CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com W. W. K. news time there's not one forty three we'll check in with Ryan Lillian sports now\nHey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\n...\nThe all new radio jog combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as if the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor any where\nThe ... foundation living with cystic fibrosis could use your generous donation it will help us to continue to get lung transplant grants medical assistants not covered by insurance\nAnd college scholarships to people living with cystic fibrosis the F causes chronic invade a lung infections interferes with digestion and causes many other health issues and the average life expectancy for someone with Seattle is forty one years old you can help by going to the ... foundation dot\nOrg to donate I'm Laura by now and I do this because I have two daughters with cystic fibrosis and I realized I could help others on behalf of all the people we've helped thank you [noise]\nSomebody that would be a new sounded out one forty five that means it's time for sports and here's where I Am willing\nTo give the baseball playoffs continuing tonight it's game three of the national league championship series between the brewers and the Dodgers that now from LA this series tired of the game of peace as well as the first pitch tonight it's seven thirty nine Red Wings meanwhile looking for their first victory of the season\nFrom Montreal to skate with the Canadians you can hear it on several of the ticket starting at seven ten now Michigan ... spoke today so the team very confident going into Saturday's game with Michigan State and that is often said wind is playing the best football their careers\nHe was also asked so close Michigan is reaching their full potential up her wedding six in a row\nHas a culture you're starting to to have a good we're done we've done this so far now if we could just get this it was better so uh you're always striving for and chasing to boost 'cause you can do\nHorrible was asked what his messages to his players about the chance to not only get a win and the rivalry with the knockoff it ranked team of the road to the first time since two thousand six and just said quote great opportunity you also talked about whether he was asked his players to turn down or do away with any pre game talk heading in\nAll used bread from Bert cliches had been plowed so thoroughly on both sides\nMichigan said of course mark Antonio will speak tomorrow in sporting safety car you will is picked up an honor today he was named the victims defensive player the week after racking up nine tackles any forceful mode Michigan state's upset went over Penn State on Saturday with sports Fifteen and forty five passed each hour I'm Ryan woolly W. W. J. news radio nine fifty\nPercent just wish to help you do you ensure stuff\nOut of your budget to Boston\nTo all when you want to pay for sure and you find out for me to get you get out and you don't you don't know I hear your budget oh wait that's just those kids laughing at me\nNow to talk of casually dressed up as much as I said\nHey Sean Spicer and every mid term elections since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nThe all new radio job job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be all subscribe and download today on radio dot com and I to\nIt's by plenty of sunshine and when you're fifty to friday times of clouds and son and hire fifty four right now we are looking still cloudy skies downtown eight fifty four degrees in Detroit metro airport it it's cloudy and it's a fifty two degrees\nThe news watch never saw that video nine\nGood afternoon I'm Jackie paid and these are the top stories ahead with great Bowman and workout\nSounded to me like maybe\nPresident Trump's any secretary of state month ... my ... to Saudi Arabia following the disappearance of a journalist CBS News with the very latest that's coming up now\nSenate candidates Debbie Stabenow and John James facing off in Detroit at the Detroit Economic Club will have the latest on that Leslie tried city councilman Galen has just been arraigned on bribery charges will have those details straight ahead as well and now CBS News coverage of the world\nCalm\nCBS News on the hour sponsored by their works relief I'm\nJim shown to be President Trump is his top diplomat to Saudi Arabia for talks on the disappearance of journalists ... CBS just eat important\nOn while he's sending secretary of state Pompeo to Saudi Arabia to press the matter the president's as king Mohammed bin Salman firmly denied any involvement in the disappearance of Jamal cash hoagie and he suggested the king offered an alternative theory\nI don't want to get by but it sounded to me like maybe they're\nThe president has rebuffed calls to scrap of plant arms sales to the Saudis and he's continually referred to cash hoagie as a Saudi citizen even though we as a green card and has lived in Virginia for years Steven pork noise CBS News the White House\nOr the president is in Florida Today with plans to travel to Georgia later on he he's touring areas hard hit by hurricane Michael and surveying federal relief effort scores wanted eureka Duncan\nRight now the focus is to make sure people have what they need some of the water the food shelter in the long term they're talking about making sure these folks get electricity that a huge need you talk to people around here and you know they're worried that right now there are reports that they might not have electricity for another two weeks\nLast month the president was touring damage from Hurricane Florence ... north and South Carolina or trial is getting underway today in Boston alleging that Harvard University discriminates against Asian American applicants in an effort to help certain minorities there'll be a busy TVs Michelle Fisher\nThe group that bottom a lawsuit and accusing the University of discriminating against the Asian American applicants during the admissions process\nPlanning on line aligning near me I mean how can it mean you know my Harvard\nDenied any discrimination the school says Vali done consider race boards applicants that's just one of many factors\nSears Holdings filed for chapter ... bankruptcy protection today and plans to close another one hundred forty two stores as part of its reorganization retail analyst Craig Johnson\nIt's a sad story here's a company that basically created the concept of of modern retailing um and and the ... I took like a colossus over the American retail landscape bigger than the next four companies combine\nSears is falling victim to online competition from the likes of Amazon eastern Nebraska is still digging out of that early season a snow storm that dumped heavy wet snow downing tree limbs and power lines power has been restored to tens of thousands of last Sunday but thousands of others\nEarly season snowstorm that dumped heavy wet snow downing tree limbs and power lines power has been restored to tens of thousands of last Sunday but thousands of others remain off line some areas got nearly a foot of snow on Wall street right now but don't use up forty three man and the NASDAQ has done Nineteen this the CBS News\nDo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] watching it on Detroit's number one [noise]\nForty or fifty to holding a\nGood afternoon and thanks for joining us on this Monday it sucks over the fifteenth I'm ...\nAnd I broke out and for W. W. J. news radio nine fifty\nFour of increasingly strong winds this afternoon in the wake of a cold front with us could reach forty miles per hour will feel cool with higher fifty for the complete accuweather forecasters coming up\nRight now we are seeing cloudy skies certainly fifty four degrees at Detroit metro airport wins out of the west at Fifteen miles an hour W. W. J. news time two oh three still\nDeveloping this afternoon a murder investigation in Farmington Hills in the assailant still at large one man is the second to the hospital after someone open fire outside of the retreat of Farmington Hills apartments near twelve mile road and middle belt around one in the morning\nTo victims are on the other side of a door wall residents like Alex ...\nJust so complex as I mean as far as it is just a\nYou know that's that's what's that about a\nSecond victim expected to survive investigators say it does not appear to be a random shooting\nHappening right now a Detroit city council men facing bribery charges goes back before a federal judge for an arraignment\n... has just been released some personal bond he was indicted earlier this month on one count of conspiracy taken that commit bribery and two counts of bribery\nFederal investigators allegedly land and a campaign workers had Fifteen thousand dollars in bribes from a local business owner last year in exchange for helping to lay or present the city from selling land the business owner believe he owed last week Cleveland said he is innocent until proven guilty\nDetroit firefighters taking aim of the policy they say is risking lives W. W. J. newsworthy line fifty ... McNeill is live and local with the story Sandra\nGreg there's been a lot of controversy over this new fire policy that separates runs into top priority and coach to code to has no lights and sirens\nCity officials have said this is aimed at reducing accidents that have been happening Seventeen last year they climb with the fire trucks with lights and sirens Detroit firefighters president like Nevin says though this policy makes no sense\nWhen people drive by and they see smoke in a while like they're not going to stop and investigate that's that's our job we're ... so I just went through I just passed Hollywood and I see the smoke coming out of the window they don't stop and investigate they call that we investigate that we get proper resources there it will investigate that will figure out and mitigate that seems recently\nNevin planes a woman set on fire in a field was deemed a code to\nThe woman that was on fire the car drove by they say look like rubbish but I'm not sure a toe to toe worried about it\nAnd having also claims that a fire officials are being beat up because of their slow response times are pointing my finger nail WW Jane is ready on empathy\nW. W. J. news time to love sex senator Debbie Stabenow meeting her Republican opponent at the Detroit Economic Club today for their second and final debate the two candidates addressed the issue of immigration senator ... says she has been a longtime supporter of comprehensive immigration reform\nThe last time we had the opportunity to have that happened was in two thousand Thirteen there was a bipartisan group of us that puts\nThe last time we had the opportunity to have that happened was in two thousand Thirteen there was a bipartisan group of us that put together a comprehensive beyond that would be great for Michigan it passed by very large vote in the United States Senate and the house of representatives decided not to take it up\nMeanwhile John James says he believes immigration reform is critical and blame Stabenow for lack of progress on the issue\nWe must not use our our uh our immigration system is is a political chess piece senator salmon now has been in a position for Twenty years again Twenty years two decades to have this thing done yes something new slow and some things move fast but two decades\nLatest each write news full of likely voters show seven leading James by a fifty three to thirty five percent margin\nRepublican National committee chairwoman runner McDaniel of Michigan is being asked by President Trump to come back for a second term that as the president gears up for his twenty twenty reelection campaign McDaniel has reportedly accepted Trump's offer both the RMC will hold an official though in January when\nDid the nation's largest retailer is announcing today plans to close stores across the country including several in metro Detroit W. W. J. business editor Murray Feldman with the details\nSears will close a hundred and forty two stores for them here in Michigan among those slated to close the Sears stores in Lincoln Park in Ann Arbor that k-mart stores in lake orient and Charlotte boy liquidation sale should begin within a couple of weeks you know at one time serious had over four thousand stores onto this bankruptcy plan they will have fewer than seven hundred surviving\nFeldman says as part of the process see her CEO Eddie land part has agreed to step down from his position he will remain with a company as chairman\nW. W. J. new starts to\nAwait it's time for trafficking whether together every ten minutes on the eighth and from the motor traffic center brought you this hour by portion of the motor city and we check in with Tracy McAfee and Greg and broke we are watching a vehicle fire here checking the triple a jam campus is a long eight mile road east bound before Woodward\nIt's on the eight mile road service Dr Hughes additional caution mayor aside from that still watching here along with mine I met before from liberty to Monroe this movie work through his right lane flows should reopen here by two thirty aside from that checking uh works ... ten network not going to wrap up until five thirty and still along north and south on telegraph\nRode down to a couple of lame that maple this construction has traffic backing up in both directions from the motor group twenty four hour traffic center I'm Tracy McCaskill WWE Jane news radio nine fifty\nTrafficking whether sponsored by north ... design center\nAnd the accuweather forecast now the updated Samuel ... will\nHave increasingly strong winds this afternoon out of the cold for and has passed through the area temperature fifty four for a high but it will certainly feel cooler than that thanks to the head\nAnd that to Benjamin this fighting for everyday people just like you who want justice ... five five then fights today because everyone deserves a fighting chance to get their life back on track\nFrom the motor group twenty four hour traffic center Tracy McCaskill WW Jane is radio nine fifty\nKevin whether sponsored by recount casino\nAnd the accuweather forecast no the updates meteorologist they've Samuel from the family heating cooling electrical weather center\nIn the wake of a cold front will have increasingly strong winds blowing this afternoon your height fifty four degrees with us could reach forty miles per hour at times will have the sunshine increasing as well throughout the day\nMost of the clear skies tonight a cold one with the low thirty four degrees downtown so outlying areas where the wind diminishes will have frost and even some freezing temperatures or tomorrow brusque and Chile with a high a fifty four but\nAnother call for its wings the Wednesday will have strong with all the hype just forty it could even have some snow flurries in the air than Wednesday night it looks like we'll have a hard freeze and many areas Thursday Sunday but cool with a higher fifty for probably partly sunny fifty for this\nIs accuweather meteorologist they've Samuel L. W. W. J. news radio night fifty\nAnd may now fifty one degrees and less land forty six ... and fifty three and Clinton township\nBlame on news radio nine fifty to all the good afternoon I'm Greg building\nAnd I broke Allen our top stories that you twenty and arraignment for Detroit city council ... has just wrapped up he was officially charged with bribery and release some personal bond ... had said last week he's innocent until proven guilty\nPresident Trump says Saudi Arabia could face severe punishment if it's proven that was involved in a journalist ... disappearance but he says the Saudi king is assuring him the country will cooperate\nUn special rubber tour and extrajudicial executions is calling for it\nIt will cooperate the un special rubber tour and extrajudicial executions is calling for a prompt impartial an independent investigation and it does not clarify adjoining one being conducted by turkey and Saudi Arabia will produce ... came to resolve\nThat is corresponded Pamela ... more to live up data from CBS News to thirty one\nWWE news time to Twenty one the Tony Award winning musical Chicago is back in Detroit\nHave SARS Broadway star American Idol finalists and YouTube sensation hundred hall and the role of ...\nThey audit she may for Billie Flint and I was surprised at how the song founded in my voice that I had just come from playing lowly kinky booth so it was it was a definitely a stretch in an opposite direction for me but I I fell in love with a role I had such a great time it was a challenge for me I really enjoyed\n... says he's still amazed that he has two point nine million YouTube subscribers\nPeople started following me and subscribe And Julian coming to see me and supporting my project by things that I was selling and it just changed my life and honestly I mean I'm so grateful that YouTube existed because I don't know what I Would have done that I needed a ... foreign to be able to prove to people what I could do\nChicago is that these rights Fisher theater tomorrow October sixteen through Sunday the twenty first\nSomewhere in metro Detroit a lottery player is sitting on a million bucks that person bought a Powerball tickets at the Kroger store in Sterling Heights to match the five white balls and Saturday drawing for the million dollar prize winning numbers by the way if you want to get your ticket\nEleven fourteen thirty to forty three and sixty five whoever has the tickets still needs to call the said lottery office in Lansing to claim the prize that ticket will remain valid for the following year\nW. W. J. news time two twenty three [noise]\nIt's okay they give away on W. W. J. news radio nine fifty and this hour is key word is horse text horse H. O. R. S. E. to seven to eight one for your chance to win one thousand dollars messaging data rates apply and remember don't text and drive\nWhat mix market not much movement really the Dow is up about seven points your money and the Bloomberg Business report coming up\nAnd you know an ad from dad [noise] alright save money on car insurance when you bundle home an auto with progressive\nCountry because of what is this good wow where did you get this I'm Talking to you with the hair yeah where did you get this good stuff [noise] and so that's not the near that's solid stuff\nProgressive can save you from becoming your parents but we can save your money when you want to go home and of course the insurance companies or other insurers just coming off a little stricter situations\nPlenty of every time you went out you can cash in now is the capital in secret car you are in four percent cash back on dining and entertainment like celebrating every years if you get\nWhen you and your crew or courtside during overtime [noise]\nFor going out now you have formal are introducing new favorite cartoon capital lined in four percent on Ninety four percent on entertainment what's in your wallet terms of capital one bank usa in a\nMetro PCS is now metro buy T Mobile\nNow you get new plans with unlimited high speed data month long all into the mobile network check out the new metro by the mobile today and discovered the smarter way to get unlimited metro buy T Mobile\nDuring congestion the fraction of customers even greater than thirty five to four months later to reduce the metro customers Mentos review speeds versus on the mobile customers video streams of forty\nThis flu season one ... flu shots and make a world of difference so you can protect yourself and so you're close talking co workers out\nNeighbor's two month old niece that's my Walgreens and Wayne read have specially trained pharmacist that are provided over sixty million flu shots ensue thousand ten by for your flu shot today with a zero dollar Kofi with most\nInsurance because protecting the world starts with protecting your ... just as it's nice you know one vaccine subject to availability said Asian health related restrictions may play\nAnd you know the trauma diary of law\nDo you diary there's something about protecting people's homes to progress that inspires me because I just had an idea for a book well it was originally an idea for a movie based on a plane inspired by a pocket but the idea of how you can see when you bundle home an auto ... might not be the best idea for a book\nIt's even up to Seventy percent the car insurance when you go home and auto for progressive\nMaybe or radio commercials I guess we'll never know\nProgressive casualty insurance company and affiliates discounts not available at all stick their situation\nWould you use up to twenty five side for business suburban Cadillac of Troy business this\nPanel for my dad are Bloomberg Business reporting Alisa I don't really even know how to throw it to you right now because that's the Dow keeps switching on me exactly right broken Greg we've\nBeen on both sides of the flat line at the very moment that we speak the Dow is lower by one point the NASDAQ has been in the red and that's where it is down thirty one points are for ten percent as NPR three the Bloomberg W. W. J. Detroit index has hired by almost one percent\nMany thousands of Sears and Kmart employees face an uncertain future now that the bankrupt retailer has announced it's closing another one hundred forty stores and it will select more for potential closure after an analysis yet Sears is also hiring it posted Seventy five new jobs on his career page today\nAnd it now has nearly forty eight hundred jobs to fill mostly for the holiday season we're learning that locally the Sears in Lincoln Park and the one in Ann Arbor are on the list to be closed as well as a Kmart store in Shelby township\nGeneral Electric says it has completed the initial designed for the first commercial supersonic aircraft engine in five decades the Concorde was the last supersonic passenger jet it was grounded in part because of his loud sonic booms and loud engine noise GE says its engine will be a lot quieter\nSponsored by his ... small business insurance I'm Alisa preventing with Bloomberg Business report I W W J news radio nine fifty\nFirefighter Raphael Korea from firehouse subs introducing new firehouse pub steak so savory steak crispy fried onions in Oak Ridge Belgian for your cheese sauce on top for limited time more than yours firehouse ... dot com remember fortunate every so if you buy help somebody might actually be women first response\nAwesome joy more subs save more lives if I'm only put aside from just because you don't even minimum one million dollars to borrow some public safety from doing what you're saying it requires\nThe all new radio job job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll see your favorite stations and\nOthers do you based on your was your news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect she'll be sure to download my new podcast everything's going to\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nOr anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\n... what is it just looks good wow where did you get this [noise]\nThe all new radio dot com at is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is a news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all news radio dot com app on your smartphone\nAnywhere [noise]\nSo did other diseases or two thirty eight time for trafficking whether together on the eighth sponsored by higher ed\nDunn dot com and chasing McCaskill we think that the problem right we're watching this a accident here broke along in fourteen this report sponsored by Detroit princess riverboat\nSo long way in fourteen and I to Seventy five an accident blocking the left lane and shoulder chicken ... are also watching a work crew they're moving out of the way though what's on I ... still slow over I Seventy five\nNinety six of Jeffries west bound for my metaphor to the Davis and the two left wing or closed until five PM traffic is slower through that stretch right now things slow or traffic as well south when I Seventy five between Rochester road and I ... as well at least six Ninety six lower\nFor my Seventy five through the traffic shifted in Sterling Heights Seventeen mile road east bound east of mount the right lane they're blocked with a crashed there\nMake your corporate holiday party different this year book it now on the princess whereabouts heated enclosed so you can celebrate any party political fundraiser a birthday all year long crews there Saturday or Sunday for lunch or dinner recall eight seven seven\nDDT boat or Detroit print that that come from the idol download our group twenty four hour traffic center Tracy McCaskill WWE\nJane news radio nine fifty an hour we check in with accuweather meteorologists have Samuel\nWill have increasingly strong winds this afternoon out of the coal for and has passed through the area temperature fifty four for a high but it will certainly feel cooler than that thanks to the wind\nCold tonight with a clear sky wince literally diminishes well below thirty four degrees\nAnd then for tomorrow or brusque chilly day but partly sunny with a higher fifty four\nColder Wednesday with the guest you went to high just forty eight could be some reason the air that will likely see hard freeze in many places at night or cold as their mass of the season arriving Wednesday otherwise Thursday a chilly day despite sunshine while the higher fifty to a little bit or friday with a higher fifty for\nA bit of looks like one of another powerful covert swinging through the weekend so no warm up anytime soon\nThis is accuweather meteorologist Dave Samuel on WW Jay news radio nine fifty\nAnd right now fifty one degrees in Canton it is fifty and walled lake\nStrapped again whether together every ten minutes on the AIDS around the clock and your next report less than ten minutes away at two forty eight coming up big day for people that want to buy an electric vehicle from Tesla\nAnd has no a page from the diary of low\nYou die any there's something about protecting people's homes to progress that inspires me 'cause I just had an idea for a book well it was originally an idea for a movie based on a plane inspired by ... the idea of how you can see when you bundle home an auto ... may not be the best idea for a book\nSaving average Seventy percent on car insurance when you went to home in order for progressive maybe or radio commercials I guess we'll never know progressive casualty insurance company and affiliates discounts not available in all states are situation\n\nPress again whether they gather on the apes and breaking news first came up to date on the road every\nNews radio nine fifty dollars [noise]\nSee for the kids today is a very important day for people to want to buy the electric vehicle from Tesla here's somebody that would be jailed\nBy the electric vehicle from Tesla here's W J ought to be a reporter Jeff silver\nTesla says today is the last decade order one of their electric vehicles if you want to get the government's full ... tax credit of Seventy five hundred dollars that tax credit starts to phase out after a ... two hundred thousand electric vehicles Tesla\nHit that mark in July but their credit doesn't actually start to phase out until the end of this year Tesla saying today is the final day to ensure that your vehicle is delivered by the end of the year ... W W J ...\nW W a news time to forty three it's time for your eye on tech\nI on taxes with Larry Magid [noise] I've been trying out Amazon's new sub woofer with a pair of echo speakers hooked up in stereo and I can say that I'm somewhat impressed\nThe reason I say somewhat it's because it's not as good as a high end stereo system but considering the costs and the size of the speakers it's pretty good\nEight two hundred and forty nine dollar bundle comes with a pair of second generation echo speakers to hook up in stereo and the sub woofer for rich base there's also a three hundred and twenty nine dollar bundle with slightly better echo plus speakers details at\nLarry world dot com Larry Magid CBS [laughter] see\nTo experience relief or muscle cramps ... used their works relief this fast acting film was proven to prevent and relief footed leg cramps give terror works relief today and the pain relief violent Walmart CBS Rite Aid at Walgreens pharmacies or their works relief dot com\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I ...\nWell the markets have turned a little higher now the Dow is up sixty five a piece of two points more from the Bloomberg Business reporting ten minutes\nWWE any time you forty five at a time for sports and Ryan will leave that ... that counts handed it\nCertainly is Brooke Michigan said I go to mark in Tony oh set to speak tomorrow but Jim Harbaugh took to the podium today so does off it's aligned playing some of the best football of their careers and went on to say ... playing this game\nAnd they will be a high alert for trick plays after Michigan State has used back to back trick plays in back to back weeks he was also asked so after dropping their opener Notre Dame than rattling off six that are out there is some extra motivation heading into the game\nOr yes I'm In state rival\nPicked an opponent it always has is and always will be of\nCourse and hear the game right here on news radio nine fifty a will kick off at NYU which means are pre game show will start at nine AM smart and safety Corey will is also picked up without her today he was there the big tennis defensive player the week after lead in Michigan\nSmart and safety Corey will is also picked up an outer today he was the other big defensive player of the week after leaving Michigan State with nine tackles any force mumbling that upset win over Penn State\nBaseball playoffs continuing tonight game three of the you know see us when the brewers and Dodgers from LA first pitch is at seven thirty nine and the red wings looking for their first victory of the season that up in Montreal to take on the Canadians you can hear it on ... on the ticket starting at seven ten\nWith sports Fifteen and forty five passed each hour I'm Ryan ... news radio nine fifty\nWe're looking at a couple of slow sites out there on the roads and it is quite windy out there and we'll give you all the updates with traffic and why they're coming up next\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list of news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nAm you know an ad from um [noise] my home in auto with\nProgressive and have on your car insurance [noise] excuse me maybe we should add an award money so they know that they're seeing and money and just kind of had that in there okay\nHello just now to me OK well he's\nGot enough funds to pushing their\nProgressive cats review from becoming your parents but we can see if you money when you want to risk actually insurance companies will use other insurers just not feeling a little stricter situations\nEugene used by forty eight rather than whether together on it and taking that has come a bit of good news out there for motorists we are watching something flaring up but we still have some problems here broken this report it sponsored by the accident temporal scanner thermometer so there's actually been west on him for a team that I to Seventy five has cleared\nBut we still have along with the identity for some slower traffic from my Seventy five deliver no and that's just going to be able to even more as we get into the afternoon rush was fun I met before from living in a way to the airport\nForecast and meteorologist Dave Samuels says clear in colder tonight Los thirty four areas of frost sub freezing temperatures and some of the coldest areas\nTomorrow breezy and Chile warm sunny class with a high of fifty four in the brusque and colder again Wednesday with clouds and son highs only in the forties Thursday chili despite the sunshine I'm fifty two fifty aged metro to fifty nine\nThe news much never style or stops newsworthy nine fifty ... afternoon I'm Greg bomb them\nAnd I'm a gallon how stories that had President Trump says the Saudi king is denying any knowledge about what happened in Washington Post columnist can all ... maybe they should\nAlive update on the way from CBS News that arraignment for Detroit city councilman charged with bribery are judge you would with a live report\nBut first is Justin ... who are in custody falling in cells involving a bowling ball in Roseville will have the uptake\nRyan Willie joined system Fifteen who's going to go to law school today about Saturday's game in Michigan State I'll tell you what he had to say and freebie sites Red Wings game coming up in sport right now we're looking at a mixed market will check your money\nRight now where it's fifty eight degrees CBS News coverage\nWorld news radio\nDot com\nIt's three o'clock [noise]\nCBS News on the hour sponsored by we getting loans\nI'm Jim mission to be President Trump says he personally talk by phone with the king of Saudi Arabia today regarding the disappearance of writers ...\nWe are going to leave nothing wrong with that being said\nFirmly denied any knowledge of it\nThe president also ... secretary of state Mike Pompeo to Saudi Arabia CBS has kept him according\nState Department issued a statement saying at the request of President Trump palm pale will travel to Riyadh today the president had said has called for a prompt an open investigation into the disappearance of cash a hoagie it isn't clear what instructions Trump is given pump pale Trump claimed the king has denied any knowledge what happened to the missing writer in Congress has been floating\nAsian President Trump is in Florida right now serving damages and relief efforts after hurricane Michael\nThis is really kind of job they've known for his response was adjusted\nTo recount Duncan says there are still widespread power outages\nThe latest numbers so that there are still about a hundred and sixty eight thousand customers here in Florida without power and that that can make it was that two hundred thousand so they haven't come down significantly [noise] of course the electric companies are telling people to the patients and that they're doing the fact that they can later\nOn the president will be also visiting storm damage in Georgia U.S officials say there's been a significant surgeon illegal border crossings and detention facilities are being inundated correspondent Maria Maria\nBorder patrol agents do tell us they are seen larger groups had the family units crossing here along the Arizona border some of these groups are as large\nAs three hundred people they're mostly coming from El Salvador Guatemala and Honduras but there are no longer running from these agents in fact some of these groups are actually seeking out the agents turning themselves in and then asking for asylum\nHarvard University on trial accused of discrimination in admissions WB Xi's been Parker group students for fair admissions brought this suit accusing Harvard holding Asian American applicants to a higher standard than students of other races and what blood is the group's president Harvard\nHas held Asian Americans to a different academic standard\nThan African Americans Hispanics than white\nHarbor denies any discrimination and says it considers a race if it's Africa's as one of its many factors the lawsuit is backed by the Trump Administration\nSears Holdings filed for chapter ... bankruptcy protection today and announced plans to close one hundred and forty two more stores as part of its reorganization company which is close to Seventy thousand employees has not turned a profit since two thousand eleven\nIt listed six point nine billion in assets eleven point three billion in liabilities on Wall street the dollar fifty this to CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender MLS number thirty\n[noise] washing ever saw on Detroit's number one they\nWere going to be a\nGood afternoon thanks for joining us on Monday October the fifteenth I'm Greg building\nAnd I broke a gallon for W. W. J. news radio nine fifty\nColder night is in store tonight with some spots dropping below freezing and then tomorrow blustery in Chile there was some sun and hides in the fifties the complete accurate the forecast is coming up\nRight now cloudy fifty three degrees at Detroit metro with wins out of the west catching up to sixteen miles an hour W. W. J. news times we owe three\nNew this hour or two people have been arrested and an attack on a worker at a Roseville bowling alley happened at the Apollo lanes last Wednesday night\nAt least the group was creating a disturbance one worker who told a group to leave was punched and kicked by one bowler well another hit the victim of the head with a bar stool and a bowling ball both now under arrest following tips from the public the victims still recovering an arraignment for both men and spending\nAn apartment complex in Farmington Hills the scene of a murder investigation police are looking for the person who opened fire at the retreat in Farmington Hills apartments in the twelve mile road and middle about area around one AM to men on the other side of the door while we're hit one dying from his injuries Emily village lives in the area\nI say I don't even know how to respond to this 'cause I'm just I've never experienced before taking extra precautions I mean I'm moving out in a month so\nThat so I guess\nPolice say it appears the shooting was not a random incident\nDetroit city council accused of bribery goes before a federal judge to be arraigned\nHere's the shooting was not a random incidents\nDetroit city council accused of bribery goes before a federal judge to be arraigned W. W. J. newsworthy line fifties John ... live local with the latest on the story good afternoon Joe\nHello Greg and not guilty plea entered in on his behalf Detroit city council ... said little at his arraignment here in us district court waving a formal reading of the bribery charges against him le ... was released on personal bond with conditions that included surrendering his passport\nHe's accused of soliciting Fifteen thousand dollar bride from a local business owner in exchange for helping delay or even prevent the city from selling land that that business owner claimed healed Leland a city councilman says twenty fourteen is charged with two counts of bribery potential tenure felonies\nAnd one count of conspiracy to commit bribery reporting live and local outside of eleven federal courthouse in Detroit John ... W W J news radio nine fifty\nA danger to the public or a smart change in policy as W. W. J. Sandra McNeil reports live and local the debate rages on over a city of Detroit policy not to use lights and sirens on some good afternoon\nSandra Good afternoon broke under the policy those lights and sirens I only use on what is deemed to be top priority runs Detroit firefighters union president might Nevin says it makes no sense because it's hard to classify exactly what is an emergency before you're at the scene\nYou also claimed that this is slowing runs a danger not only the public but also first responders like a recent incident he claims involving an ambulance crew\nBut they were pushing the face numerous times and I'm a long did they take to get their Fifteen minutes and they went out of code to priority to a ... and the family was like where the hell were you the was the ... crew that was a cardiac arrest that\nPerson apparently taken to the hospital and is doing fine city officials say cleaning response time is load is unconscionable and completely untrue a spokesman for the mayor says that code to is mostly use for hosts downs and follow up runs reporting lied Sandra McNeil W. W. J. news radio nine fifty\nThe Detroit Economic Club hosting a debate between democratic senator Debbie Stabenow and her challenger Republican John James today W. W. J. city beat reporter\nVicki Thomas took part in all of it she's lived and local with more forest Vicki\nAnd Greg one of my questions to the candidates dealing with a proposal one on the November sixth ballot to legalize recreational use of marijuana democratic senator Debbie Stabenow supports it\nComes in is that that will pass and that what we need to do is work with law enforcement and public health and others to make sure that this is minister correctly\nRepublican challenger John James says he can not support it in its current form but he will support the will of the voters\nThe war on drugs has disproportionately negative negatively affected African American community I Would not feel right legalizing something that so many people so many Michigan are currently in jail for\nReporting live at a local Vicki Thomas WW James radio nine fifty\nW. W. J. news time three away it's time for traffic and whether together every ten minutes on the AIDS from the motor group traffic setter brought you this hour by Audi of Rochester hills\nAnd good afternoon ... starting off the hour with\nA problem yes good afternoon broke Greg Gunn I'm Ninety four was founded eight mile got an accident underwrite chilled they're looking to the ... not much of a delayed behind it\nThose seeing some delays on I Ninety four west down between Van Dyke and liver annoy I Ninety six the Jeffries west sounds from I Ninety four to Davis an avenue roadwork still luckier to left lanes and you are slow through the zone that's going to go until five to ...\nI Ninety six the Jeffries west sounds from I Ninety four to Davis an avenue roadwork still luckier to left lanes and you are slow through the zone that's going to go until five this afternoon and roadwork I'll also slow me down on telegraph north and south bound you down to two lanes each way\nAt maple that's going to go through friday if you see a problem on the road give us a call and the WWE Jake hipster line\nAt to forward for two or three six W. W. J. in the adult downloaded them twenty four hour ... center Katie for W. W. J. news radio nine fifty trafficking whether sponsored by north ... nobody home design center\nThere the accuweather forecast meteorologist Bryan Thompson was some downright to cold weather here Brian looks like we could even see a snowflake or do you think\nI wouldn't be shocked if we get a couple of sprinkles here or there wouldn't be surprised to see a couple of ... that might be tomorrow night's\nUse radio nine fifty the accuweather forecast meteorologist Bryan Thompson says clear and cold tonight Los thirty four areas of frost in sub freezing temperatures in the coldest spots in fact we've got a freeze warning in effect re metro Detroit midnight to eight am tomorrow breezy in Chile with a high of fifty four it's fifty wanted metro\nTwice never stops news radio nine busy don't you don't have good afternoon\nI'm Greg Norman ... gallon secretary of state might pay a meeting with the Saudi king to talk about a missing journalist\nIt sounded to me like maybe they should\nCBS News ... also ahead of the candidates for the U.S Senate seat feel about recreational marijuana I Would not feel right by the time and it may or Monday on W. W. J. will have a conversation with Sterling Heights might Taylor Brian\n... sports coming up in Fifteen minutes\nA competition\nIt's four o'clock [noise]\nCBS News on the hour sponsored by capital one\nI'm Jim shown to be President Trump is secretary of state Mike Pompeo to Saudi Arabia and the growing controversy over missing writer ...\nBy putting the White House for a trip to survey hurricane damage in Florida and Georgia president said he just spoken with Saudi king Mohammed bin ... you said been Solomon denied any Saudi involvement in the disappearance of ... is\nIt allows me to Mr Trump has rebuff bipartisan calls scrap the pending sale of arms to the kingdom he says he sending secretary of state Pompeo to Saudi Arabia to further press the matter Steven port noise CBS News the White House\nThe president is in Florida right now handing out bottled water and surveying damage from hurricane Michael hard to believe\nI've seen pictures but it's hard to believe when you're above it they're not playing as it is a total devastation\nA later he'll be visiting hard hit areas in Georgia high winds prompted Pacific gas and electric to cut power to tens of thousands of customers last night amid concerns are downed power lines could cause wildfires see for them and reports\nIn recent years some of California's most destructive wildfires have been traced back to powerful winds and fall when power lines\nNow with wins in northern California forecasts the guest up to fifty five miles an hour Pacific gas and electric is turning off power in some areas north of San Francisco more than eighty five thousand customers are impacted\nThe company hopes restore that power by later today or at least most of the customers Sears Holdings filed for chapter ... bankruptcy today and announced plans to close another one number forty two stores CBS or Joe ...\nWe had the decline in suburban shopping malls the rise of online retailer that that's really just too big a double whammy and then finally this financial plan not marketing plan in the two thousands just did not contain a real business solution\nAnd there were reports that banks were pressuring the company to liquidate Harvard University being sued for alleged discrimination in admissions WB Z TVs Michelle Fisher\nBefore opening statements inside violent demonstrators marched outside their signs did the talking with a loud and clear message to Harvard crystal Lou traveled across the country to show her support thinks that came all the way from California\nThe group that bought on the lawsuit is accusing the University of discriminating against Asian American applicants during the admissions process\nBut shoot is backed by the Trump Administration Asian Americans represent about six percent of the U.S population\nAmerican applicants during the admissions\nProcess but shoot is backed by the Trump Administration Asian Americans represent about six percent of the U.S population and about twenty three percent of Harvard's current freshman class on Wall street right now the Dow is down eighty nine this the CBS News\nCapital one quick silver card or an unlimited one point five percent cash back on every purchase everywhere that's all there is to it just unlimited one point five percent cash back on everything you buy what's in your wallet\n[noise] washing ever saw on Detroit's number one\nFifty to only going to be a\nGood afternoon thanks for joining us on this Monday it's October the fifteenth I'm ...\nAnd I broke a gallon for W. W. J. news radio nine fifty\nColder air is moving back in ... and I said it's going to stay for the rest of the week on the details of the complete occupy the forecasts coming up\nRight now at Detroit city airport is mostly cloudy fifty two degrees wins out in the west at Nineteen miles an hour W. W. J. news time for the three\nSpeaking of those frigid conditions this just in the national weather service issuing a freeze warning for metro Detroit that will go into effect and midnight and won't expire till eight o'clock tomorrow morning temperatures forecast a fall below freezing tonight for the first time the season outdoor vegetation could die if left on protected\nIt's a new update you an earlier story on W. W. J. two men are under arrest for a vicious attack on a worker and a bowling alley in Roseville that was caught on tape WW Jane is ready nights at the center of a Neal is live in local with Sandra brokers attack\nHappened on Wednesday night at the Apollo lanes on ... the tape shows a worker getting pummeled by two bowlers apparently it happened after the worker asked the bowlers to leave said they were becoming unruly one man hit the victim in the head with the bar stool and a bowling ball is twenty eight year old was\nTaken to the hospital he is still recovering now police say tips have led them to to arrest today one Detroit man was already in custody on another charge the other man arrested was taken into custody at his home in East Point they're both awaiting charges ... Sandra McNeil W. W. J. news radio nine fifty\nW. W. J. news time for five minutes and uh and look for to trial and that's my comment\nThose are the words of Detroit city council been gay Leland today leaving the federal courthouse after being formally arraigned on bribery charges joining us live and local with more W. W. J. news radio nine fifties John John\nAnd those were his only words Greg leaving the courthouse literally about ten Fifteen minutes ago a not guilty plea ended in on ... behalf he said little at his arraignment in us district court waving a formal reading of the bribery charges against him released on personal bond with conditions that includes surrendering his passport\nIs formally accused of soliciting Fifteen thousand dollar bride from a local business owner who was apparently wearing a wire recorded the allegation in exchange for helping to layer prevent the city from selling the land of the business owner claimed he old after the arraignment I asked ... attorney Steve Fishman about the symbolic importance of this case with Detroit post bankruptcy\nI think that it's an important case for the community which is all the more reason why I'm encouraging everybody to wait for the trial and hear all of that absolutely an important part of the reasons are saying and just in general of course\nWe live in a city council member states twenty fourteen is formally charged with two counts of bribery potential tenure felonies and one kind of conspiracy to commit bribery report it live and local lopsided loving courthouse in Detroit John Hewitt W. W. J. news radio nine fifty\nDebate number two in the books for the U.S Senate race in Michigan the candidates answered questions at the Detroit Economic Club today W. W. J. city beat reporter Vicki Thomas was among those asking the tough questions\nOne of my questions to the candidates dealing with proposal one on the November ...\nJay Sidie beat reporter Vicki Thomas was among those asking the tough questions\nOne of my questions to the candidates dealing with proposal one on the November ballot to legalize recreational use of marijuana democratic senator Debbie Stabenow supports that\nI'm saying is that that will pass and that what we need to do is work with law enforcement and public health and others and make sure that this is ministers correctly Republican\nChallenger John James says he cannot support it but he will support the will of the voters\nThe war on drugs has disproportionately negative effect negatively affected African American community I Would not feel right legalizing something that so many um people so many Michigan are currently in jail for Vicki\nThomas WW Jane is ready to yell nine fifty\nBad news about rats in Detroit W. W. J. news reading and I and fifties Michael Cohen joining us live in local with the details Michael\nOr good afternoon ... broke the two thousand Eighteen list of ... cities in the country ranks Detroit number six\nChicago's number one Los Angeles and New York also in the top five Oregon entomologist Tim Houston says it's based on the number of calls for service to the pet control company and when it comes to rodents all the country's big cities share similar issues we have\nProblems with how we how we store trash around or resources in in a commercial environment where we're we're giving the outdoor wrote it all the food and all the supplies harbors that they ate for them is just making more rats and mice\nHouston says wrote an activity increases during the winter months of the seat warmer areas for readily available food and water adding that unlike mice rats actually live outside an underground so it's important to not only to try to remove them but to also identify how they're entering your home\nMichael Toner reporting live or W W ... news radio nine fifty\nW. W. J. news time for a waiver signed for trafficking whether together every ten minutes on the AIDS from the out of the motor traffic setter brought you this hour by BMW of Rochester hills\nAnd Katie is logo on us twenty three yes broke in Whitmore lake us twenty three north on at nine mile an accident as locking your left lane any slower from before six mile road\nTried to get sponsored by bridge down I Ninety six westbound downtown roadwork is slowing things down now I Do six west bound from Warren avenue to wind id for\nYour left lane is black then I Ninety six the Jeffries west bound between nine Ninety four in the Davis and the Davis an avenue here to left lanes like now this rover is going to continue until five this afternoon and looking through the ... you're heavy from all the way\nNow the weather forecast for their family heating cooling and electrical weather center and meteorologist Bryan Thompson says it's about to get cold\nIt will be a colder and I said I too have a few clouds in some areas of Ross slow down to thirty for some of the coldest outlines Basel will drop into the wife tomorrow blustery in Chile ... cloud to hire fifty four down to forty tomorrow night with a partly due mostly cloudy skies and then on Wednesday burst getting colder with clouds and some sun\nI just forty eight so many spots drop below freezing Wednesday nights and they'll keep things dry and the Thursday and friday it's up to come back a little bits plenty of sunshine Thursday hype it be to a few clouds Mexican on friday with a high fifty five I'm accuweather meteorologist Bryan Thompson on WWE traders radio nine fifty\nRight now fifty degrees in Canton it is fifty three and a lot of lakes and fifty in Sterling Heights\nWe do trafficking whether together every ten minutes on the eight send your next report less than ten minutes away for twenty eight\nWhat do you every time you went out you can cash in now with the capital and save your car you are in four percent cash back on dining and entertainment like learning more about each other and you first date Haiti over or discovering hit the high notes that your favorite karaoke bar\nNo matter your reason for going out now you have four more introducing new favorite cartoon capital one in four proceed on mining and four percent on entertainment what's in your wallet terms applied capital one bank usa in a\nRadio nine fifty to read them\nAnd I broke out and our top stories at four twenty ready or not cold weather is here the national weather service has issued a freeze warning for metro Detroit it goes into effect at midnight and runs until a day and tomorrow\nNew this hour police investigating after a suspicious letter was found at the home of Maine Republican Senator Susan Collins Bangor Maine police sergeant weighed better says she's aware at approximately one\nAre looking to get out in ... county and buying their first house in Oakland County going to Ferndale or Royal Oak I think we can capture those people with higher end up scale condos in an apartment a units along and I'm fifty nine right at lakeside whether it's lakeside village or whatever the name is\nUh if you give them something unique parks and a urban beaches as another idea that that could go there give them something to to really attract them I think you can find that there's a market for that sort of use\nNow I'm guessing that a lot of the calls you get might have to do with\nConstruction and mound road is usually the number one complaint area and the whole road\nAnd we want to hear about that the construction what's the future of those and we're going to continue our conversation with you coming up at the four forty so stick around and we'll we'll try to get to try to get the answer from you on what's happening with that and some other issues affecting [noise]\nRight now it's the twelfth they give away on W. W. J. news really good I'm fifty six hours kiwi or to shop that's the word shop seven to eight eight one your chance to win one thousand dollars message and data rates apply remember don't text and drive\nStudied everyday news time for twenty five at a time for business ... business desk sponsored by Huntington Bank fan\nTo Lisa ... is our Bloomberg Business report how we finished for the daily So Greg and broke\nWe were in the rat across the board the Dow is down eighty nine points at the closing bell that was the loss of a third of a percent NASDAQ fell sixty six points of retreat approaching one percent\nHasn't ... down sixteen the Bloomberg W. W. J. Detroit index was higher by almost half a percent the tech sector saw the biggest declines Amazon apple and Netflix we're all in the red\nPresident Trump yesterday threatened another round of tariffs on China and European an Asian shares we're in retreat markets were responding to a weekend of warnings on the global economy from finance cheese at an annual meeting of the IMF\nAnd oil headed higher as tensions rise between Saudi Arabia and the U.S over the disappearance of a prominent journalist secretary of state Mike Pompeo is headed to Riyadh right now to meet with the king on the matter crude finishing close to Seventy two dollars I'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nSacks of local interest sponsored by plant ran wealth management General Motors gained forty nine cents closed at thirty two twenty eight and Lear Corp I lost six cents they close at one hundred and thirty four dollars and Seventeen cents\nWindy what a spot that burglar when he was chasing your home or after his head as Sean who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crooks\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions of\nThe all new radio jak job that is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nWendy what a spot that burglar when he's case in your home or after his head has John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blinked video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied\nThat has closed the Ann Arbor saline road rated Gunther court and that's near saline if you see a problem on the road to give us a call them the WWE Jake tips in line\nAt two point four to three six W. W. J. N. the idol downloaded give twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nBack your weather forecast now the update and meteorologist a Bryan Thompson over it's not winner yet starting to feel like it though\n... we had a big shift from what it was pretty warm earlier in the months but now it is a feeling pretty cold in a freeze warning in effect for most of the area tonight says so rude really clear things out in the next few unless you hours\nAnd that'll be a trend that continues declared apart the ... guy low down to thirty four downtown but many areas outside of Detroit will get to below freezing tonight and for many of those the first time we've seen that happen this year\nOr so we are looking at a hard freeze in many areas of some sponsor drop in the twenties also pretty gusty breeze right now is make you feel even colder that will diminishes the night goes on\nLast or in Chile tomorrow sunshine it's a cloud behind fifty four near forty tomorrow night with a partly to most of the ... guide and burst getting colder Wednesday with clouds and some sun just forty eight for a high on Wednesday\nQuite chilly Thursday despite sunshine hype fifty two went up to fifty five of the ... on friday forty degrees right now in Ann Arbor it's fifty two metro airport in all sorts of ... to downtown not back your brother Raul just Bryan Thompson on WWE ... fifty\nAnd this is where you hear traffic and whether together every ten minutes on the eight year next update coming up at four forty is\nGoing up and just a moment we're back with the mayor of Sterling Heights Mike Taylor\nThe all new radio job job that is available now\nIt's a totally new experience to switch listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on you listen to news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nAnd we are bad with Michael Taylor the mayor of Sterling Heights as part of our mayor Monday series and a good afternoon thank you again for being here and we did I mention mound road everybody always talked about mountain road and where do we stand with that\nAt a good news mound road is making progress a despite the lockout that just ended\nA the last time I drove down at a couple of days ago it looks like there's asphalt on all four lanes up to a Seventy mile road and three lanes up to Eighteen mile road where it goes down to three or it's not open four lanes and three lanes just yet still two lanes open but it looks like they're making progress and I'm told\nIt should just be a couple of more weeks until we've got that completely open and that's going to provide a heck of a lot of relief that was one of the worst roads in the country\nIt's Ninety six ten fifty nine so good good news on Monroe and quickly there's more construction to of course what's happening on whole road\nWell hell rode a we we did a in Sterling Heights last year there still it's still going on and couldn't township I drive whole road almost every day it's a mess and I'm knocking on wood that that's going to get done but uh it looks like Paul wrote it looks like all the construction projects in Sterling Heights are going to be done\nBefore the end of this construction season so very good news there\nOkay so now let's turn our attention from the roads and lakeside mall to the general election it's right around the corner and a couple of hot topics on the ballot or where do you stand on recreational marijuana wow a so [laughter] time is short let's get right to do we have is that all the time we have\nSo I I'm a you know I'm of the opinion that it is going to pass and personally I'm going to be voting in favor of it because what we have in Sterling Heights as we estimate our police estimate that there are several hundred if not over a thousand grow operations in Sterling Heights\nAnd these illegal grow operations are are ... are basically they're using the marijuana grown in our neighborhoods\nAre to be sold at these illegal dispensaries throughout the entire state of Michigan and throughout a there are not in Sterling Heights but but they're taking that product and moving it all over and so I think what the passage of recreational marijuana it's going to kind of bring the state of Michigan\nIn line with where the rest of the country is going and uh so I'm going to support it and I I don't you know I don't use recreational marijuana myself I don't plan on using it\nAh but but I think that ah it's it's definitely reading the tea leaves that's where it's going\nIs is there anything on the agenda if city council coming up to deal with any sort of ordinance regulating this has been a problem for many communities as you know where the shops can be how big they can be how they're going to be regulated in and all that what Sterling Heights doing about that we're doing nothing\nRight now taking a wait and see approach we've been approached by a number of people and businesses were interested in getting into the marijuana industry and having dispensers in Sterling Heights\nWe're waiting to see what happens with recreational this November and with regard to medicinal marijuana I think you could see sometime next year an ordinance coming to the city council or will be able to debate whether we want to opt in or opt out\nA despite the fact that the recreational may pass we could still just decided to do medicinal marijuana only and then determine how many dispensers we want to have but it's still an open question and I know it's something that is going to\nGenerate a lot of a debate amongst our residents so I'm looking forward to that process\nOkay thank you so much again we have been talking to the mayor of Sterling Heights Michael Taylor and thank you so much for joining us on our mayor Monday theory it's\nBeen my pleasure thank you for having me thank you again better W. W. J. news time for forty four we'll check sports in\nThe all new radio jak combat is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor any way [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique and saying you can't get anywhere else everything's going to be All right subscribe and download today on radio dot com and I\nThe all new radio dot com app is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on you as if the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nW. W. J. news time is for forty five it's time for\nA check in with Ryan Willie\n... spoke today said that his team very confident going into Saturday's game in Michigan said that his office of line is playing some of the best foot ball of their careers who was also asked though how close Michigan is reaching their full potential after winning six in a row\nHas a coach or you know gosh darn it [noise] to to have a good we're we've done we've done this so far now if we could just get this it was better so uh you're always striving for and choosing to go to you can be\nMichigan cynical marked Antonio meanwhile we'll speak tomorrow we'll smart and safety curry will is picking up on her today he was in the big tents defensive player of the week except for recording nine tackles any force fumble Michigan state's upset went over Penn State\nOn Saturday or the baseball playoffs continuing tonight game three of the you know see us between the brewers and the Dodgers from LA the series of deadlocked at a game of peace first pitch tonight is at seven thirty nine and the red wings still looking for the loser first victory of the seasonal skate with the Canadians up in Montreal you can hear the game will run Ninety seven on the ticket to pre game seven ten will drop the puck\nAt seven thirty with sports Fifteen at forty five passed each hour I'm Ryan woolly W. W. J. news radio nine fifty\nAnd we'll update the driveway with traffic and whether intimate\nHey Sean Spicer and every mid term elections since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\n...\nI reported air hog okay I can fire smoking to me\nWhile you're driving on the far eastern it ground it again and felt that it was cold\nI mean it's just let me know you did good\nFrom Smokey Bear\nI'm going to let you go\nAre many ways to start a fire but once you're way to put it out now you can do your part Smokey Bear duck\nThe president has rebuffed calls to scrap of plant arms sales to the Saudis and he's continually referred to cash hoagie as a Saudi citizen even though we as a green card and lived in Virginia for years Steven port noise CBS News the White House\nPresident Trump is touring areas hard hit by hurricane Michael in Georgia right now earlier he was in the Florida Panhandle to see this\nIs his first\nCBS Evening news anchor jumped Laura's in Missouri and she continues to focus on battleground states ahead of next month's midterm elections\nState is just three weeks until the mid term elections in one of the key contests to watch is the U.S Senate race right here in Missouri between incumbent Democrat Claire McCaskill and the Republican challenger the state attorney general Josh Hawley I sat down with both candidates\nMcCaskill says what is hurting Washington right now is the extremes of both parties and the last thing Washington needs is a rabid partisan\nAll of a new wave is generated on the air at the time we need more noise in the middle we need more people rewarding moderates who are willing to look beyond party and actually come together\nMcCaskill is running as a moderate she votes with President Trump just under half the time Republican holy says McCaskill doesn't vote with the president on anything that matters\nShe voted against the middle class tax cuts uh she's voted against a rolling back regulations or see the voted against the first female director of the CIA why because they're all President Trump appointees\nRight now polls show the race tied forty five percent each we're going to have much more of these interviews on tonight's CBS Evening News I'm Jeff galore CBS News in Kansas City Missouri\nAs expected cheers filed for chapter ... bankruptcy protection today retail analyst polar Rosen bloom\nIt's an American retailing tragedy but it's also long overdue\nThe company also announced plans to close another one hundred and forty two stores as part of its restructured on Wall street develop losing eighty nine points this CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] washing never stops on Detroit's number one needs\nTo be a good afternoon\nThanks for joining us on Monday October the fifteenth I'm direct them and\nAnd I brought down the line for W. W. J. news radio nine fifty\nColder night is in store tonight with some spots dropping below freezing and then tomorrow blustery in Chile there was some sun and hides in the fifties the complete actor but the forecast is coming up\nIt is sunny and forty nine degrees that Detroit city airport W W ... times five of the\nTrain to get your blankets ready freeze warning will be in effect overnight the national weather service says temperatures are forecast to fall below thirty two degrees for the first time the season the warning goes into effect at midnight won't expire till eight o'clock tomorrow morning\nW W a new time five other for it's a new update to an earlier story on W. W. J. he takes police chief holding and not date after the bodies of eleven incense were found inside a closed funeral home the discovery was made friday night inside the can travel funeral home I ... he says a criminal investigation now underway\nI've never heard of anything like this this is the first time in [noise] I'm just can't explain it makes no sense\nTheir names having taken to the Wayne County medical examiner's office\nMore controversy today over a new Detroit fire policy that\nDictates the lights and sirens are only use a mother deem to be top priority runs W\nDiversity today over a new Detroit fire policy that dictates the lights and sirens are only use a motor deemed to be top priority runs W. W. J. newsworthy nine fifty sander McNeil reports\nStanding here on Linwood next to a boarded up fire station Detroit firefighters union president like Nevin says the policy has been delaying Ron's already delayed by the boarding up a fire station\nWe've got civilians dragging their loved ones to neighbors cars because they can't get their entire\nCity officials deny runs or being delayed in say the code to is not used for EMS they claimed the policy is aimed at cutting down on accidents fire truck with lights and sirens\nThey said we have Seventeen the accent of last year produce the ...\nUnion officials say they can't prove the increase response time because they're being denied access to record smokes and for the mayor's office sense the record not public due to federal health privacy laws finger McNeil WW Jane his radio nine fifty\nNew tonight we paving brand new have meant that this plan for a portion of I Seventy five in Oakland County the live and local latest now from WW Jane is that these Jason ...\nMuch like a reoccurring headache it's a director from the Michigan department of transportation to redo a portion of by Seventy five southbound\nBetween south boulevard and Adams road now that segment of highway just Elaine will be closing down part of the ice Seventy five modernization project it was reopened back in September of last year and that says ride quality issues is the reasoning here that stretch of highway\nA portion of it closing down Tuesday evening through Sunday evening the work it's going to be paid for by contractors\nI'll be speaking with them that officials momentarily with the further explanation reporting live Jason Scott's W. W. J. news radio nine fifty\nDetroit Economic Club hosting a debate between democratic senator Debbie Stabenow and her challenger Republican John James today W. W. J. city beat reporter Vicki Thomas took part\nRepublican challenger John James responding to some questions that did not come up during the debate like abortion he is pro life\nFor you the best of all the land and I'm going to always legislator vote to really it was like well I haven't had that in front of me but I always say right here I always vote to protect the life of the mother and the baby\nHamad away at incumbent senator Debbie Stabenow basically saying she's an effective her response understand\nPolitics and when someone doesn't have a lot to say they just attack the other side Detroit\nEconomic Club president and CEOs that area it pleased with the turnout\nWas corner record crowd I think our previous was about a five hundred and fifty and we approached almost seven hundred and fifty Vicki\nThomas WW James radio nine fifty\nRepublican National committee chairwoman rundown McDaniel of Michigan is being asked by President Trump to come back for a second term that as the president gears up for twenty twenty reelection campaign McDaniel has reportedly accepted the president's offer but the RMC will hold unofficial vote in January\nW. W. J. N. used on five away [noise]\nSon for driving in weather together every ten minutes on the AIDS from the idol download a group traffic Sutter brought you this hour by Motor City many\nKatie what's happening out there on the road slows set a crash on six Ninety six east on on your exit ramp the ice Seventy five it's on the right shoulder of that ramp traffic is sponsored by bridge stone\nAnd we look into the triple a jam camp seeing the typical slow down for your afternoon in Ann Arbor us twenty three north and south between Plymouth wrote and Washington are avenue us twenty three north to Whitmore lake in Brighton your slower on six Ninety six west punish low from or to grow to the two Seventy five Ninety six\nYou know us twenty three north on the two Whitmore lake in Brighton your slower on six Ninety six ... from or to grow to the two Seventy five Ninety six interchange and then you still were on I Ninety six west bound to wake some roads bridges stone engineered drive car tires take a puncture and keep running fifty miles after a flat\nWith Dr guard tires you can get to safety on a flat instead of being stranded on the side of the road to rest easy and like birds don't drive car tires give you peace on the road in the adults ... twenty four hour traffic center ... devil DJ news radio nine fifty\nThe accuweather forecast now in the meteorologist Bryan Thompson seems a little bit early for these the temperatures but I guess they've already seen snow up north yeah great\nTo have and over and for some frost tonight to which is not uncommon for this time of year and they're also getting around the time that we typically see be first freezes a year which many of us will see tonight as well freeze warning in effect for much of a metro Detroit\nI think downtown it'll probably just a couple of degrees above freezing about thirty four but both suburbs will be at or below freezing cold ... dip into the twenties ... clear to part of the ... at least for the next several hours to be a pretty ... the times is gonna make it feel pretty chilly to blustery in Chile to borrow sunshine and some clouds behind fifty for\nIn the area to be slow now it's time for the national electrical contractor associations construction alert on I Ninety six the Jeffries west bound\nYou do still have your left lane blocked at worn as before I Ninety four and then from I Ninety four to Davison avenue still your two left lanes are blocked that was supposed to be out of your way up five but some of it is gone though you're very heavy from the Seventy five lodge interchange also telegraph north and south bound\nTo ways as two lanes both ways that maple are blocked causing slow down in the area through October thirty first save up to Fifteen Percent when you upgrade\nTo a ... need new flooring in your home\nCalled the carpet guys hold on it called the garbage guys right now save up to fifty four four percent on new carpet and flooring plus twelve months interest free financing called eight five five for my guys or go to carpet guys dot com this carpet guys dot com today in the motor give twenty four hour traffic center Katie for W. W. J. news radio nine fifty\n... accuweather forecast now we've got that to freeze warning in effect overnight the family heating cooling electrical weather center Bryan Thompson\nCleared a part of the ... will be colder with areas or frost a low down to thirty four of the coldest outlying areas will drop into the twenties tomorrow blustery in Chile ... fifty four forty tomorrow night as there will be some clouds around and members could even colder Wednesday with clouds and some sun a high just forty aids\n... hard freeze Wednesday not as temperatures drop below freezing on Thursday quite surely despite plenty of sunlight fifty to mix of sort of clouds friday high back up to fifty five not accurate debate around which is Bryan Thompson on WW trade ...\nCurrent conditions in Ann Arbor right though we've got some sunshine forty nine degrees is forty nine at city airport ... fifty two metro\nNews radio nine to afternoon I'm ...\nAnd I've read gallon our top stories had five Twenty one these rightfully St James ... says the medical examiner's office is now working to identify the bodies have eleven infant found any drops ceiling of the clothes can Trump funeral home on ... he said some had dates on them both criminal and civil investigations are underway\nPresident Trump responding to report that says Saudi Arabia is prepared to admit the Washington Post contributor ... was killed at the Saudi consulate in Istanbul, Turkey two weeks ago after an interrogation gone wrong he says while he's seen the report he doesn't do for sure what happened\nAnd the secretary of state Mike Pompeo is on the way\nWhile I'm ... I'm just afraid to [noise] really first said what happened what they know what's going on in Jersey made\nMore coming up at the bottom of the hour\nIt is mayor Monday here at W. W. J. R. and has gas this week with Michael Taylor the mayor of Sterling Heights and among the topics discussed the lakeside mall project lakeside village\nThere are a lot of young people who I think young people and even people that are either living in large houses that might want to downsize to a condominium or young people that are looking to get out in ... county and buying their first house in Oakland County going to Ferndale or Royal Oak I think we can capture those people with higher end up scale condos and apartment\nUnits along I'm fifty nine right at lakeside whether it's lakeside village or whatever the name is\nThe city of Sterling Heights has been actively looking at plans to re purpose like ... working with them all owner architects as well as reaching out to potential developers local and national\nType ... working with them all owner architects as well as reaching out to a potential developers\nLocal and national leaders alone you're working together to solve the national opioid crisis for good years W W J health reporter Dr deanna lights\nDeputy secretary Eric hard in with the department of health and Human Services is meeting with state and local opioid experts to discuss challenges as well as progress in the war against opioids in Detroit\nDetroit is one of the areas that has been hardest hit by the opioid epidemic\nHarkin says this state is receiving government resources to help battle the crisis\nSo far something over sixty million dollars last year and a half or Michigan just what the response credits for\nA first step towards getting a grip on the problem is awareness and education\nThis crisis was attacked in the country this is something where we have to we have to be honest with ourselves about what's going on it that's when we ... I Believe it or to turn the corner\nFrom the delta dental health to ask Dr deanna lights that we W. J. news radio nine fifty\nW. W. J. news time five twenty three [noise]\nIt's the ... day give away on WWE Jane is made United safety in this hour is key word is a line text align a L. I. G. end to seven to eight eight line for your chance to win one thousand dollars message and data rates apply remember do not text and drive\nWe saw a lower numbers on the markets today we'll check your money next W. W. J. news time five twenty for\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSeem on smart thermostat they'll leave evolves piping solution and more consumers energy part of the small business falls helping Michigan businesses save energy and money visited consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nWendy what a spot that burglar when he's facing your home or after his head asked John who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent a police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let's check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts know subscriptions totally affordable and blink works with Alexa\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon company limited time offered terms and conditions applied what did you used to\nBuy time for business suburban Cadillac of Troy business desk and Jeff Ballenger with our Bloomberg Business report sponsored by north Bloomfield properties\nThe key stock indexes did a lot of interest session direction changing and ended modestly lower the now Jones industrial felt eighty nine points or a third of our present to twenty five thousand two fifty the NASDAQ close sixty six points lower the U.S and the five hundred last sixteen points\nSears Holdings is hoping to make it through bankruptcy isn't going concern once the nation's biggest retailer the company filed for chapter eleven announced the departure of CEO Eddie Langford and added another one hundred forty two Sears and k-mart stores to its closing list\nImpact of Hurricane Florence I'm ... with Bloomberg Business report on W. W. J. news radio nine fifty\nSocks that local interest sponsored by plant ran wealth management fee at Chrysler close at sixteen dollars and twenty five cents of again of ten cents American Axle gained four cents closed at Fifteen dollars and Ninety cents [noise]\nMany medicines used to treat colds and flu contained acetaminophen a pain reliever and fever reduce your founded hundreds of over the counter and prescription medicines but taking too much or more than one medication containing acetaminophen per day can damage your liver\nSo always read the label and don't take acetaminophen if you drink three or more alcoholic drinks every day to learn more as if it's the I don't go slash OTC pain info a message from the U.S department of health and Human Services food and Drug Administration [noise] ...\nWhen do you what a spot that burglar when he's ... in your home or after easy and asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school no contracts go subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon company limited time offered terms and conditions of life when you listen\nHere to listen you understand more or understand clearly\nDo we have an operation\nWe trade deals they after day more\nTime five twenty eight tanker traffic and whether together every ten minutes on the eighth and here's Katie\nOr watching an accident slowing me down six Ninety six east on your exit ramp the eyes have any thoughts on the right shoulder that ramp traffic is slow and go from before Woodward\nTraffic is sponsored by Detroit princess riverboat in highland township and fifty nine highland road east on after duck like road had an accident on your shoulder and I Ninety six the Jeffries west on the left lane is locked\nFor anywhere\nHey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I ...\nProbably okay to have one more drink before I drive home [noise]\nProbably okay I opened the window to stay alert [noise] probably in my mouth\nStep out of the car police [noise] I've probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving if you see a warning sign stop and how like have a car or a friend that's driving drunk driving and that that brought here by nuts and the ad council\nSomebody doesn't deserve trafficking whether together every ten minutes on the\nAids and let's check in with Katie kind of crash in highland talented than fifty nine highland road east on after duck like road on your\nShoulder and that is causing traffic to be slow in the area traffic is sponsored by California Closets we're accident free and our major area freeways looking through the ... at the ride home still seeing some major slow down town I Ninety six west down the Jeffries from I die before to Davison avenue\nHere and there you have to let planes are still blocked in that section your very slow in that zone I Ninety six is very heavy back to the Seventy five lodge interchange that road work was supposed to be out of your way up five but it's still there will let you know when it is\nFor ... for your complimentary design consultation or call to for eight sixty four one two three four in the idol downloaded give twenty four hour traffic center ... W J news radio nine fifty and now the accuweather forecast with me you allergist Bryan Thompson\nWhile they mostly clear sky a few clouds around or will be a cold or night with areas or frost alone thirty for some of the coldest outlying areas will drop it at the twenties\nTomorrow blustery in Chile with sunshine to supply the higher fifty for tomorrow night to have some clouds moving on through of low near forty those club with a cold front double reinforce the colder air on Wednesday we risk with clouds and some sun a highly forty eighth\nMoney sponsor drop below freezing Wednesday nights\nAnd plenty of sunshine and quite chilly Thursday hype it'd be two next set of clouds on friday with a high fifty five I'm actually about to be around just Bryan Thompson on WW traders riding on fifty\nWe'd rather freeze warning for metro Detroit in front of ... ... am right now forty nine degrees in Canton it forty six and wild like\nComing up on news radio nine fifty Harvard University fighting back against the discrimination lawsuit with the news continue\nThe all new radio job job that is available now\nIt's a totally new experienced it with listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on your list your news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nAnywhere\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has blocked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nTime by forty two\nHarvard University in uh Boston courtroom today fighting back against the lawsuit alleging the ivy league university discriminates against Asian American students who apply to the school\nHarvard denies any discrimination the school says well it does consider race boards applicants that's just one of many factors\nRace cannot be removed effectively from an application just because it is so central to so many people's identity\nNearly two hundred students gathered in Harvard where to show support for affirmative action and head of the trial starting today in ... square the Asian American coalition for education held a protest as well Sunday where demonstrators rallied against affirmative action but his reporter Michelle Fisher\nW. W. J. news time five forty three education today sponsored by Oakland University\n[noise] if you received your associates degree in nursing and why you're BSN in nursing open university professor Kimberley who got the adjunct instructor for the school of nursing and are in BSN program coordinator she says oh you is the place to\nGo so if they're coming in with their general education requirements and their knowledge application course fulfilled what this means for them is the overseas sixty three transfer credits then they'll receive thirty credits\nFor having there are an license and passing their state board which is called there and the clocks Iran and they will only need to focus on our thirty to nursing credits\nWhich are the nine courses\nHogan says the students who get their ...\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I too [noise]\n[noise] well the markets finished lowered to them because the numbers from the Bloomberg Business before the ... coming up\nInside the WWE news time five forty five it is time for sports and Ryan will you were going to be a lot of\nBlue and gold and a lot of reading my book careful\nWhen you say you know I Know I I didn't mean to say\nThat you might or might get some Notre Dame ... go underway but no of course maize and blue light that's where I made the blue and green and white depending on what flag bearer you where are we here in Michigan or news radio nine fifty are of course the whole Michigan football a lot of us do do roots for Michigan states a lot of rivalry smack talk even here in the office but\nNonetheless it go Jim Harbaugh the first of the two coaches to speak this week said that the off into blind playing the best football of their careers and went on to say that he's ... Gary\nWe'll be back in time for the game and also be out of high alert for trick plays horrible also asked though of drop in the opener to Notre Dame and rattling off six in a row if there's some extra motivation that end of this backyard Raul\nAh yes I'm In state rival\nPick ten opponent it always has is and always will be\nAn issue at coach mark Antonio set to talk to the media tomorrow we'll smart and safety curry Willis was named the big tents defensive player of the week today he helped lead the Spartans with nine tackled Sunni force ... she was upset when over Penn State over the weekend\nOr the baseball playoffs continuing tonight game three of the you know see that's been the brewers and the doubters in LA that series deadlocked at a game of peace first pitches it's seven thirty nine lions meanwhile back to work in Allen park they begin to prepare for Sunday's game with the dolphins in Miami the team is also play soldier mall Agnew on injured reserve with the hopes he can return to December for a playoff push\nWeek six set to come to a close tonight Packers taking on the forty niners hear it on CBS Sports radio twelve Seventy at seven thirty in the red wings still looking for that first victory of the season tonight there in Montreal to pick on the Canadians catch it on Ninety seven when the ticket at seven ten\nWith sports Fifteen and forty five passed each hour I'm Ryan wall e W W J news radio nine fifty\nThings Ryan ... sweater that's where I got the gold from trafficking weather coming up next\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blinked video cameras are motion activated so placing them around your home is like having ice everywhere\nBlink cameras or wire free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is looking around the yard\nAnd parents loved links live feed auction electric checking for\nRemember thinking mom had ice in the back of her head like a super power was fought in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio is an Amazon limited time offered terms and conditions of\nReactor weather forecast and meteorologist Bryan Thompson says clear colder than I Am thirty four areas of frost in sub freezing temperatures freeze warning in effect for metro Detroit from midnight data yeah breezy chili tomorrow with a high fifty four fifty two AT Metro by fifty nine\nTo news watch members that news radio nine fifty to old ...\nAnd I'm broke Allen Saudi Arabia is poised to limit wrongdoing and the death of journalists democracy choking\nA lot of people are working on\nCBS News ... also ahead Detroit city councilman gave Leland out on bond after being arraigned on bribery charges I'm a I'm looking forward to trial on John you\nIn a mistake by a contractor leads to the pavement of a portion of I Seventy five are Jason Scott will have a live report\nBrian Willie joined Justin Fifteen come down to the backyard role Saturday\n[laughter]\nIt's six o'clock [noise]\nCBS News on the hour sponsored by Dell's small business\nI'm Pam culture CBS News has confirmed that Saudi Arabia is preparing to admit wrongdoing intermission involving Washington Post columnist Jamal ... who vanished during a visit to the Saudi consulate in Istanbul CBS has deep Letterman joined just live with the latest\nAnd Pam CBS News can they'll confirmed that the Saudi Government appears ready to admit but ...\nDid die as the result of an interrogation that went wrong sources say the Saudi Government is prepared to admit that officials in the Saudi consulate in Turkey did begin the interrogation but then things apparently one too far\nThis of course would contradict previous statements by the Saudi Government denying any involvement Saudi officials at one point said 'cause she'll be left the consulate alive\nReporting ... CBS News\nPresident Trump got an up close look at the damage caused by hurricane Micah\nCard to believe when you're above it they don't play the total devastation\nMr Trump toward the community and Lynn haven Florida with Governor Rick Scott crews are still looking for people who were on accounted for and the hard hit town in Mexico beach CBS the jury could Dunkin' in Panama City right\nNow the focus is to make sure people have what they need the water the food shelter in the long term they're talking about making sure these folks get electricity that a huge have you talked to people around here and you know they're worried that right now there are reports that they might not have electricity for another two weeks\nAbout two hundred thousand customers are without power in six states lawyers for Harvard University were in uh Boston courtroom today to fight a lawsuit the church's school discriminates against Asian American students WB TVs Michelle Fisher\nFor opening statements inside silent demonstrators marched outside their signs did the talking with a loud and clear message to Harvard crystal Lou traveled across the country to show her support thinks that came all the way from California the group that bought on the lawsuit is accusing the University of discriminating against Asian American applicants\nDuring the admissions process\nSee here's an icon of the American retail industry has filed for chapter ...\nEverybody's closing because our own lives yeah\nNot been here in years I only came to give this is where I got my lawnmower and I need to play\nThe company which began as a mail order business a hundred\nNot been hearing years I only came to give up my lawnmower and I need to play\nThe company which began as a mail order business a hundred and thirty two years ago and who's catalog was a fixture and just about every home since all close a hundred and forty two of its remaining seven hundred stores the Dow was off eighty nine today NASDAQ fell sixty fix this to CBS News\nDo small business technology advisors no there's nothing small about your business they provide one on one partnership and reliable del PCs with intel core processor to get this done called eight seven seven by Dale\n[noise] wash never saw on Detroit's number one\nWhere the\nCleaning and thanks for joining us on this Monday October the fifteenth I'm Greg Norman for W. W. J. news radio nine fifty\nWe're in for a cold nights and not as many fans will drop to near or below the freezing mark and then a blustery in Chile downtown for tomorrow I'll have all the details the complete occupy the forecast coming up\nAnd right now metro airport has a little bit of sunshine fifty one degrees trafficking weather coming up on the age W. W. J. news time six oh three the national weather services issuing a freeze warning for metro Detroit tonight it goes into effect at midnight it\nWon't expire till eight o'clock tomorrow morning temperatures forecasts to fall below freezing tonight for the first time this season outdoor vegetation will be killed if left unprotected it's a new update to an earlier story on W. W. J. criminal and civil investigations are underway\nAfter eleven bodies were found at a closed funeral home on Detroit's east side police chief James Craig says he's been in touch with the prosecutor's office and state attorney general's office regarding the bodies found friday night at the ... funeral home on ... avenue\nAnd since we're in a\nSimulated ... believe they were rats and then four term\nEmphasis was placed in a very small coffee a day do both seasons influence from a child was created an addict area funeral home\nCivil investigation by the state department of licensing and regulatory affairs also underway thought he's working to identify the bodies and notify families\nControversy raging today over a new Detroit fire policy that separates runs into priorities under the policy lights and sirens are not used on what is called code to Detroit firefighters union president might Nevin says the policy's been delaying response time and risking lives\nWe've had some very bad incidents we uh to uh last Sunday or two Sundays ago we had to medicate units are\nAssaulted a one bedroom was assaulted in the back of a rig because of poor spots\nCity officials called the allegations unconscionable and untrue Nevin claims he had no proof of increased response time because the city is locked them out of the records officials at the mayor's office say those records are not made public due to federal privacy laws\nDetroit city councilman spending part of his day in court as he faces charges of bribery WW Jay news reading and fifties John you it was the latest thing\nLittle at his arraignment constantly gate Leyland waved a formal reading of the bribery charges against him which would carry up to ten years in prison if convicted and not guilty plea ended in on his behalf he was granted personal bond as he left the courthouse Leland had only one comment\nI'm a I'm looking forward to trial and that's my comment\nIs attorney Steve Fishman shared this with the gathered media\nWe are going to try that doesn't say I don't know what else we can both cases over here in Ninety five percent resulting guilty plea this one this will be a jury\nAnd I don't know what else have most cases over Ninety five percent result and guilty plea for the world this will be a jury trial as sure as we're standing here\nLate is accused of soliciting a Fifteen thousand dollar bribe from a local business owner in exchange for allegedly helping to layer prevent the city from selling the land that business owner claimed Hill City councilman since twenty fourteen Leland is charged with two cups of bribery potential tenure felonies and one kind of conspiracy to commit bribery\nAnd Detroit John W W J news radio nine fifty\nLow territory covered it the second and final debate between democratic senator Debbie Stabenow Republican John James W W J city beat reporter Vicki Thomas one of the journalists asking the question\nDemocratic incumbent senator Debbie Stabenow and challenger Republican businessman John James fielding questions on a host of issues including U.S Supreme court justice Brett Kavanaugh James says he would have voted for Kavanaugh\nI Believe that both of my Republican and my friends were disgusted and embarrassed by the political wrangling that went on in Washington but\nStabenow says no way\nAround it took nine minutes after the announcement me for coming out and supporting him much more time most before he put on the DC circuit stand for kids were in looking at the last Supreme Court\nVicki Thomas WW James radio nine fifty a quality\nIssues been identified along a portion of I Seventy five in Oakland County W. W. J. news really good on fifties decent Scott joined us live and local to explain what that means Jason\nYeah Gregory outside southbound lane between ... boulevard and Adams road it's set to be closed Tuesday evening through Sunday it's all due to sagging contractors their footing the bill\nIt's not a a warrant to crochet because the job and never been accepted so this is something or you know they have to do to be accountable and obviously it's disappointing to us but we're glad it was caught before was except\nFor Jeff grandson communications director for the Michigan department of communications says the portion of highway is only about two hundred feet in length the segments it was reopened back in September of last year reporting lived Jason Scott W. W. J. news radio nine fifty\nWWW time\nSix oh wait it's time for trafficking whether together every ten minutes on the AIDS from the idol download a group traffic center raunchy this hour by Porsche of the motor city and Katie what are we looking at this hour well Greg tips to Christian called in us twenty three north on after Silverlake road near Brighton\nGot an accident blocking you're left lane kind of crafts on six Ninety six east on after I two Seventy five on your left shoulder traffic sponsored by ... stone and listen to the Tripoli damn camps still a slow go because of all of the road worked is on I Ninety six the Jeffries west bound\nW. W. J. news time six feet teams on for trafficking whether together on the AIDS Katie looking at a problem on us twenty three\nYes north on after Silverlake wrote a reported crash near brightened this one is lucky you are left lane traffic is sponsored by I'd be doubled the unique\nLooking through the ... still is logo on I Ninety six the Jeffries westbound catching left lane blocked from warned I Ninety four from I Ninety four\nIn sections to Davis an avenue your two left lanes are blocked it is supposed to be moving out of your way though you're very heavy from the Seventy five lodge interchange and heads of the six Ninety six east on exit ramp to Greenfield disclose tonight from nine\nUntil ... am tomorrow morning now it's time for the national electrical contractor associations construction and alert on grass at north and south on between Fifteen mile road and joy roadwork skin to block two lanes each way that starts at nine to nine to five am tomorrow morning are you an experience slices journeyman electrician looking to grow your career and a better environment\nThe eye BWI unique a team has opportunities now great wages benefits secure retirement and advanced training it's all part of the ivy eat up all the ... of a I'd be W career learn more and I beat up all the careers dot org the best contractors the best electricians\nPeriod in Seattle downloaded give twenty four hour ... center ... W J news radio nine fifty\nAnd traffic and whether together is sponsored by Michigan Medicare specialist the update now from a family heating cooling electrical weather center and Bryan Thompson\nOr in for a dry stretch your weather through the rest of the work week but it is going to be pretty chilly for the most part a freeze warning in effect for tonight says there'll be some areas or ... or a clear to partly cloudy silo thirty four downtown but many suburbs near or below the freezing mark and those are the coldest months into the twenties tonight blustery\nFifty five on friday a little bit milder with a mix of sending clouds I'm active other major biologist Bryan Thompson on W. W. J. just running on\nFifty Medicare open enrollment is going on now let Debbie strip your Michigan Medicare specialist cleared the confusion whether exclusive free Medicare review she's the expert you need on your side call to for a two two seven oh three four seven to visit Michigan Medicare specialist dot com\nOn news radio nine fifty to\nThink I'm wreck film and here's what's happening at six forty one [noise] Detroit\nPolice chief James ... says the medical examiner's office now working to identify the bodies of eleven infants found in a drop ceiling of the closed ... funeral home on Mac avenue he says some had dates on them both criminal and civil investigations are underway\nThis just in Microsoft cofounder Paul Allen has died at the age of sixty five he'd been suffering from non Hodgkin's lymphoma more at the bottom of the hour\nSpotlight in Sterling Heights WWE Jay's mayor Monday segment today featured Mayor Michael Taylor who spoke to the construction on hold and mountain roads\nI drive whole wrote almost every day it's a mess and I'm knocking on wood that that's going to get done but uh it looks like Paul wrote it looks like all the construction projects in Sterling Heights are going to be done before the end of this construction season so very good news there\nIs like the recent road workers lockout ... Taylor says progress a long haul and mounds was little or not affected one of the longest running shows on Broadway back in Detroit this week\nThe Tony Award winning musical Chicago's at the Fisher theater starring American Idol finalists Broadway star and YouTube sensation Todd recall a slick criminal lawyer ...\nMore apt to be a great actor he also got swag because believe planned it able to manipulate a room full of perfectly sane adult into believing these stories that are so unbelievable and calling for characters and wanting to root for people who\nAre vicious murderous is at the end of the day and so I ain't got the main thing you have to have the top of that you have to be a great actor and just a little bit of slack\nChicago's at the Fisher Theatre opening tomorrow night\nRunning through Sunday the twenty first W. W. J. news time is six twenty two airline fees could\nBe taking off and life insurance coverage is falling short memory Feldman with Feldman report on W. W. J. news radio nine fifty\nYou want a larger airline seat that will cost more do you want to sit closer to the front of the plane there could be a new charge for that what about baggage fees you don't mind paying the twenty five bucks per bag well some airlines are starting to charge more and some are raising baggage fees during peak flying times like holidays\nIt's all part of maximizing profits and the airlines and get away with it because passengers are willing to shell out the extra money\nHow much extra about fifty seven billion dollars just last year\nGoing going may eventually be gone life insurance offered in the workplace less than half of all employers offer the coverage and years ago eighty percent of workplaces offered it industry trade group say sixty million us households have coverage but they still are about two hundred thousand dollar short of what they'll really neat should the primary earners suddenly be gone\nWith the Feldman report I'm Marie Feldman W. W. J. news radio nine fifty [noise]\nIt's the twelve kids they give away on W. W. J. news radio nine fifty this our keyword is wander text the word wander W. A. N. D. E. artist seven to eight one your chance to win one thousand dollars message in day to re supply remember don't text and drive\nWhitney what a spot that burglar when he's case in your home or after he said asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option legit check in from anywhere using blinked smartphone app so you know when your kids get home from school they'll contracts you know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio over offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions applied\nAnd you know an ad from dad save money on car insurance when you bundle home an auto with\nProgressive yeah to another way to save money don't find those are expensive coffees every morning and then you can save up for a I don't know really nice dress shirt just saying it's great that you feel comfortable here at work but you know an adult walking\nProgressive cats from becoming your parents but we can see if you money when you go home and progressive casually insurance company for other insurers just coming off a little stricter situation W. W.\nJ. six twenty five time for business from the suburban Cadillac of Troy business desk bussing by platform in wealth management Jeff Ballenger as our Bloomberg Business report\nStocks were lower at the end of a volatile Monday sessions without Jones industrial felt eighty nine points or a third of a percent to twenty five thousand two fifty the NASDAQ close sixty six points or ... percent lower the S. and P. five hundred last sixteen points or six ten percent\n... of northwestern mutual wealth management does not see fed rate hikes or trade tensions being a drag on the domestic ... economy of\nThe leash on inflation is much longer this time and they will continue to tighten with a velvet touch trade concerns have moved from a global concern the one that has focused on China\n... says geo political concerns usually end up being short term blip on the path to hire equity markets\nGeneral Electric has come up with the initial designed for what could be the first commercial supersonic aircraft engine in decades\nIt uses a twin shaft twin fan design it could lead to the development of private planes and jet liners that fly faster than the speed of sound I'm Jeff ... with Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interest sponsored by plant Moran wealth management the at Chrysler closed at sixteen twenty five gain of ten cents and American Axle game four cents closing it Fifteen Ninety ...\nThose who go home to change and those who roll with the times\nWrangler makes genes for the second group\nThe trend setters the mavericks the leaders of the pack\nThose who are found by nothing\nFrom bull riders to rock stars from work life and nightlife\nYou roll with the times yeah so do we\nWith new styles and great fits\nFranklin real comfortable genes\nPlenty every hearing you win out you can see where we the capital in the for ... for every cash back on dining and entertainment like celebrating and for you to get [noise]\nWhen you when you recruit or courtside during refined [noise]\nGoing out you have formal are introducing\nWendy what a spot that burglar when he's case in your home or after easy when asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let you check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts know subscriptions totally affordable and blink works with Alexa\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras\nVisit blink protected dot com slash radio for offer details that's blink project dot com slash radio link is an Amazon company limited time offered terms and conditions apply\nWhether God window the only one factory and Michigan Building commercial great windows designed to last whether guard even guarantees them for life called eight hundred three seven seven eight eight eight\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years ... technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlink cameras systems are back in stock and right now there are Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio over offer details that's blink project dot com slash radio is on Amazon company limited time offered terms and conditions of\nJane used by six thirty eight rather good weather together every ten minutes on the AIDS what are we looking at this time Katie\nScribes we've got to crash on I ... and you're left so they're not much of a delay behind air traffic is sponsored by van Johnson law looking through the ... at the ride home still seeing some major slowdown than I Ninety six Jeffries west bound you left lane is lots from warned I Ninety four\nBetween I Ninety four and Davis an avenue to left lanes of blacks\nBut through the ... I can see that their work crews are getting those blockages out of the way you still slow\nFrom after the Seventy five lodge interchange in heads up the six Ninety sixties down exit ramp to Greenfield is going to be closed at nine tonight until five am tomorrow morning if your car crash victim you deserve a fighting chance to get you back on track vengeance and law will fight tirelessly to get the justice you deserve\nCall one eight five five vent fights today and put a champion in your corner in the idol downloaded twenty four hour traffic center Katie for W W ... or any of nine fifty\nThe accuweather forecast now in traffic and whether sponsored by Detroit princess riverboat years meteorologist Bryan Thompson\nOvaries warning is in effect for tonight says it is going to be a brisk in cold or die with areas or frost one with a clear to ... to low down to thirty four downtowns the coldest outlying areas will drop out of the twenties denied muster in Chile tomorrow ... fifty for only drop to forty tomorrow night as there will be more clouds around\nI as a reinforcing shot up some colder air moved in and they'll lead to a brisk and pretty cold day on Wednesday with mountains of sun I only forty aids and there'll be a hard freeze somebody's bonds Wednesday nights and those are more sunshine for Thursday and friday still chilly but turning a little milder than Wednesday high fifty two Thursday in up to fifty five on friday\nI'm active other meteorologist Bryan Thompson on W. W. J. trying to get on fifty\nThe current conditions in Ann Arbor this hour we've got to sunny skies and forty eight degrees\nIt's fifty in Sterling Heights Taylor at fifty one forty eight at city airport and fifty one at Detroit metro traffic whether together every ten minutes on the apes around the clock and your next report less than ten minutes away at six forty eight\nThis flu season one ... shot to make a world of difference so you can protect yourself and so you're close talking co workers out\nFighting neighbors two month old niece [noise] that's my Walgreens and Dwayne Reed have specially trained pharmacist that have provided over sixty million flu shots and two thousand ten at night for your flu shot today with his ear dollar co pay with most\nInsurance because protecting the world starts with protecting your ... just as it's nice you know one subject to avail ability said Asian health related restrictions may play\nPlenty every January\nRemember thinking mom had ice in the back of her head like a super power was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home is like having ice everywhere\nCameras or why are free set up in minutes and run on to double A. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package sleeves and wanted to alert you if a stranger is working around the yard\nAnd parents love blinks live feed auction electric checking from anywhere using your blink smartphone app so you'll know when your kids get home from school\nBlinks cameras systems are back in stock and right now there are Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is on Amazon company limited time offered terms and conditions applied\nW. W. J. new signs six forty two it's\nA redo along I Seventy five in Oakland County it begins Tuesday along one lane following the ice Seventy five modernization project the phase\nThat was a late last year\nUm has found to have pavement failing sagging because of some settling in\nThe outside lane southbound Seventy five it's only about two hundred feet or pavement\n[noise] so where is the one lane going to be Jeff ... communications director for the Michigan department of transportation says between south boulevard in Adams road beginning Tuesday evening through Sunday night contractors will foot the bill W W J news time six forty three\nWell the red wings still searching for their first when in Michigan Michigan State getting ready for the big game Saturday\nThis flu season one ... shot to make a world of difference so you can protect yourself and so you're close talking co workers helping\nDiving neighbors two month old niece that's my ... and ... read it specially trained pharmacies that are provided over sixty million shots in Sudan says by for your flu shot today with a zero dollar co pay with most\nInsurance because protecting the world starts with protecting you are plump green justice is nice you know one that's being subject to availability state Asian health related restrictions may play\nWhy do you every time you went out you can cash in the capital when the for ... for me the cash back on dining and entertainment light in their first hate to walk them all you\nAnd for for cash back when you take your kid museum for the first time what what he's doing I spent [noise]\nNo matter your reason for going out now you have formal are introducing new theater card can capitalize on four percent on mining and for for ... terms applied capital one bank usa NA\nDo see go home to change and those who roll with the times\nWrangler makes change for the second group\nThe leaders of the pack\nThose who are found by nothing\nFrom bull riders to rock stars from work life can nightlife\nYou roll with the times yeah so do we\nWith new styles and great fits\nSprinkler real comfortable gee\nWell the market numbers or turn lowered today the Dow finished down to about eighty nine will\nBusiness report from ten minutes six forty five it's time for sports rhyme only big week ahead for a football here Michigan Michigan State\nI ends with a week off hadn't to Miami still to try to figure out which team is this is this the team\nThat beat the Packers and patriots the one that got embarrassed by the jets I think it's more than one that got embarrassed by the jets honestly the lie and certainly had higher expectations and what we've seen so far during their two and three start but you look at when they played the patriots and when they played the Packers again it's not about who you play with sometimes when you play them\nThey got 'em on the right weeks and give them credit they've got the victories but now they've got to go to Miami a team of four and two on the air Greg this week the Chicago Bears and over time over the weekend\nSo it's going to be a big game for the lion's they will not have them all Agnew on defense nor special teams he was placed on injured reserved today that the teams that they're hoping\nThey can bring it back in December and put them in the middle of a playoff push\nYou mentioned Michigan Michigan State though of course the countdown to the back yard brawl on Saturday is underway today Jim ... speaking before a mark Antonio takes the podium tomorrow and Harbaugh so that is often said why and certainly putting the best football their careers\nAnd he has a very confident team heading into this game he was also asked how close Michigan is to reaching their full potential after winning six in a row\nHas a coach you're starting to to have a good we're we've done we've done this so far now if we could just get this was better so uh you're always striving for and chasing to ... you can be\nI don't forget you can hear more of ... during Inside Michigan football which will come your way right here on WB Jay starting in about Fifteen minutes\nAgain mark Antonio will speak tomorrow but spartan safety a car you will is picked up an honor today he was in the big tents defensive player of the week\nBaseball playoffs continuing tonight game three cs from LA it's the brewers and the Dodgers that series tied to the game of peace first pitch under an hour away and the red wings still looking for their first when they're in Montreal to take on the Canadians here in Ninety seven when the tickets starting at seven ten\nWith sports Fifteen and forty five pass each hour Brian Wally ... news radio nine fifty\nOh effects Ryan traffic and whether it emitted W. W. J. news time six forty seven I\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles way tougher\nThat's why parents trust blink blinked video cameras are motion activated so placing them around your home because like having ice everywhere\nBlink cameras or wire free set up and minutes and run on to W. batteries last up to two years Bree in technology\nPut a blink camera on your front porch to spot package thieves and wonder alerts you for strangers walking around your yard\nAnd parents love blinks live feed auction the electorate chicken from anywhere using your blink smartphone app\nSo you know when your kids get home from school\nBlink cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio for offer details that's blink project dot com slash radio like as an Amazon limited time off our terms and conditions applied", "show_name": "Greg Bowman", "year": "2018", "city": "Detroit", "day": "15"}