{"month": "10", "state": "MI", "station": "WWJ", "content": "We'll see some showers in a thunderstorm later with a low near fifty nine tomorrow mostly potty warmer with showers in the morning tapering off by the afternoon and when you're Seventy four and for Wednesday cloudy warm and find your eighty right now at Detroit metro airport it is cloudy it's fifty six degrees\n... where do you do see a\nGood morning I'm Jackie ... at the top stories I had two people found dead in a fire at a home in Hamtramck\nA local judge on the hot seat on Charlie sanctions\nAnd knew this mid day President Trump is handling a new trade deal will have more from CBS News that's coming up next we'll check sports at eleven are actually at twelve Fifteen and your money coming up a twelve twenty five to doubt Jones industrial average is that two hundred sixty three points and now we go to CBS News at twelve noon [noise]\nDot com\nCBS News on the hour sponsored by their works relief\nI'm Steve Case in President Trump calls it the most important trade deal his administration is may live to Washington and CBS the Steve Dorsey the U.S\nMexico Canada agreement replaces NAFTA President Trump says the new deal will transform the country into manufacturing powerhouse with protections for us car companies and drug maker\nThis landmark agreement will send cash in jobs pouring into the United states and then to North America good for Canada good from Mexico instead of jobs\nLeaving for overseas the president also says farmers will benefit opening up new export markets for wheat poultry in theory Mr Trump plans to sign the agreement by the end of next month Congress will still need a rabbi it's deep\nSenate Democrats say they're not sure the FBI can do what it needs to do to investigate sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh by the end of the week Connecticut Democrat Richard Blumenthal\nThe White House seems to be micro managing and stray cat doing an investigation that must uncover facts and evidence\nThirty seven percent and a CBS News poll say Kavanaugh should not be confirmed by the Senate thirty five percent say he should be it's a summer day in Las Vegas one year after fifty eight people were shot and killed at an outdoor concert\nThings events began with an emotional sunrise remember either governor Brian sons of all of the shootings took something from us\nThat we can never ever put back\nAlso speaking was Mrs Smith whose sister was one of those killed let the light and your spirit continue to shine don't let it go out at the end ... will release each of them carrying the name of one of the victims Steve ... CBS News Las Vegas\nAmerican James Allison shares the Nobel Prize for medicine with a Japanese researcher to suit who ... their work revolutionized cancer treatments Alison spoke this morning of the MD Anderson Cancer center in Houston the\nBasics are just sort of turf forever I work really impact people was just over ...\nOne expert says the research bother to has saved countless lives the Trump Administration is challenging California's new net neutrality law scene that ensure\nNow it's becoming a state's rights debate where the federal government says that because the Internet crosses state lines by its nature then it can't be regulated by one state\nStreet right now the dollars up two hundred fifty six\nThat because the Internet crosses state lines by its nature then it can't be regulated by one state\nWall Street right now the dollars up two hundred fifty six points salmon as that goes ahead to thirty to listen to CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] watching it on the number one\nMorning\nGood afternoon and thank you so much for joining us on this Monday it is October first and I'm Jackie paid for WWE Jay news radio nine fifty\nBrain will gradually taper off this afternoon but it remains Claudio uncool the highest sixty three separate just returned to the seventies tomorrow the ... the weather forecast is coming up\nRight now we have showers and fifty six degrees that Detroit metro airport W. W. J. news time is now twelve o cream a local judge on the hot seat today amid allegations of an affair and visits to the salon WWE chase Charlie liked and has the story\nJust voice started today by the traditional tenure commission over allegations that a Livingston County district court judge ... burden violated ethical rules variety of ways she was put on the state and then ask questions about whether or not she had her step schedule manicure pedicure while she was on the bench\nThere was also an allegation that she had an affair with the lead detective in a murder case I was hearing scheduled to the last\nTwo weeks if the judge is found to violate of certain ethical rules it will be the Supreme Court that will\nUltimately set some kind of penalty which could help the judge lose her job\nOutside the district court in Livonia Charlie ... total you James radio nine fifty\nWayne County prosecutor Kim worthy announcing charging decisions involving two in may gets in the course and west land W. W. J. said he reporter Vicki Thomas's live in local and Frank Murphy Harlem justice with details Vicki\nBecky Wayne County prosecutor Ken worthy announcing charges against so ... and two paramedics that allegedly failed to render medical aid to William Marshall up in their ... says Marshall was convulsed they for over an hour and a jail cell\nBut EMT the rye but failed to check is vital by others are just a mess the EMTs rather than\nShort time later Marshall did pass away and another\nAnd make that case the out of course worthy not seeking charges and that that the rank order back in the summer of ... Seventeen now have more details coming up in the library port at the bottom of the hour recording alive and local Vicki Thomas W. W. J. news radio nine fifty\nAll right thank you I'm Vicky WWE said new time is now twelve o five controversy today over a new Detroit fire policy which dictates that fire trucks uh don't have to use lights and sirens on some runs\nWWE face center Mickey alive and look what the story central Jackie Detroit fire commissioner ear Jones before any trade city council the public safety committee this morning he's\nExplaining that policy called code to go to\nDoes not mean to time it means respond immediately\nBut it doesn't mean\nWe use of life concerns or more to\nResponded dishes it means that however you should not disregard traffic control devices should not drugs at the center of\nJohn says they don't want to create an emergency one responding to an emergency he fails at herring off to every scene with lights and sirens wearing could do just that union officials argue that this new policy\nI Want to create an emergency one responding to an emergency he fails at herring off to every scene with lights and sirens blaring could do just that\nUnion officials argue that this new policy is dangerous reporting might Sandra McNeil WW chain news radio Nineteen eighty two people found dead in a fire at home in Hamtramck Detroit firefighters were called to a house on ... street near Joseph Campo and the Davis in this morning around seven thirty they were able to put out the fire\nIn the process of doing a search a found the two of bodies on the second floor of a ... a during the firefighting operations we had one firefighter who fell through the floor burned out for 'em or injured his elbow and was taken to Detroit receiving hospital\n... a Detroit devotee fire commissioner David for now says arson investigators are now on the scene and it's not clear how the two victims died and it or not they were killed before the fire started injured firefighter is expected to be OK\nI'm any van left unlocked and running in a driveway and Clinton township was stolen while a four year old child was still inside police detective lieutenant Eric ... telling WWE jaded the vans owner picking up another child or was picking up another child from her grandmother's\nAnd the Fifteen miles grows back area this morning when she looked out the window and saw the than speed away\nTo counter to the police of the put out a or B a well for the vehicles are checking area few minutes later the ... uh we had several calls to end that there was a young child a walking around in that area fourteen male aggression\nWitnesses describe this aspect as a black male and black clothing at the wheel of the red Chrysler town in country with a crack in the back bumper next to the license plate which is ... and you won four or five five if you see the van please call nine one one\nWWE Jay news time now twelve away [noise]\nTraffic and whether together every ten minutes on the aid from the idol them motor group traffic center brought to you this hour by portion of the motor city and here's Tracy McAfee\nAnd we're watching a few more slow down to Jackie starting with an accident now along with mine I Know before at nine miles the left shoulder is lots now also through the triple a GM came keeping an eye on east bound metro parkway and Van Dyke the right lane or block to do to that accident\nSwitching gears here to east on either side effects expressed lanes affidavits in the left lane and shoulder remained block\nWe do have work sounds underway including he thought I had before at Belleville more work along with found I made before Dickerson with that right lane closed and along north on him to end the entrance ramp from Palestine sewer there it's close from me I don't doubt motor group twenty four hour traffic center I'm Tracy McCaskill WWE Jane news radio nine fifty\nRight Tracy that accuweather forecasts now live from accuweather meteorologists have Samuel Hi Dave\nAnd just kind of had that in there okay\n... how how does not and yummy\nOkay well he's got enough funds to pushing their progressive gets review from becoming your parents but we can save your money when you do risk insurance companies will use other insurers just coming off a little stricter situation [noise]\nW. W. J. news time now twelve Eighteen traffic and whether together on the eight saying here's Tracy McCaskill and Jackie chicken\nThe triple a jam camps this time around still watching an accident was fun I made before nine mile\nThe left lane and shoulder remain block we also have an act of it now long north ... seven mile right shoulder blocked another on the flip side south on Seventy five and eight mile\nAnd along north unintended ... and early or accidents still have cars on the right shoulder now it's time for the national electrical contractor association construction alert or keeping an eye on road work was fun I ... a decrease in the right lane disclosed also\nWe have the right and left shoulders close with this work along with mine I met before at the exit to Michigan avenue from the motor group twenty four hour traffic center I'm Tracy McCaskill W. W. J. news radio nine fifty\nAnd that accuweather forecast now for making whether meteorologist Dave Samuel from the family heating clean electrical weather center rain tapering off otherwise cloudy and cool this afternoon with the high near sixty three and it is cloudy and we have light showers and fifty six degrees at Detroit metro airport\nOn news radio nine fifty to\nCBS News special report President Trump sympathy for Supreme Court nominee Brett Kavanaugh he's gone through over the last three weeks his incredible President Trump speaking in the rose garden a few minutes ago as the FBI investigates allegations of sexual assault against Kavanaugh from the Nineteen eighties\nOf a man who has really you know you look at his life until this happened what uh what\n... Congress will pass the new deal perhaps as late as late November CBS News special report on Vicki Barker\nAnd you're listening to WWE Jay news radio nine fifty chargers announced today involving an inmate death in ... he probably\nCould attend worthy announcing charges against a wet lands police sergeant and two paramedics that allegedly failed to render medical aid for William Marshall in there or these says Marshall what's called volt they for over an hour and a jail cell\nA short time later Marshall died it's another inmate death cause a case out of course from last June worthy not seeking charges WWE gays Vicki Thomas we'll have more coming up at twelve thirty\nGeneral Electric CEO and chairman John Slattery being ousted after just a year on the job at the century old company plan or he took over for a long time CEO Jeff ... in August of twenty Seventeen but the company has been beset with problems as it tries to reshape itself\nIt revealed substantial setback for its power unit which will lead to a twenty three billion dollar charge\nW. W. J. news time is now twelve twenty two [noise]\nMore and more women are getting into the field of medicine open universities Dr Linder Gillum says the landscape of the medical field is changing wording\nTo the American association for medical colleges for the first\nTime in history there are more women entering our us medical schools than men\nIn twenty Seventeen more than fifty percent of the Twenty one thousand students entering medical school were women the number of women in residency programs is growing end Dr ... says women are entering the field from diverse backgrounds to\nRace religion I'm there doesn't seem to be any barrier there in terms of um moving women through the pipeline regardless of religion and even a race and ethnicity\nDr Gillman says they see that diversity in Oakland universities William Beaumont school of medicine Laura ... W W J news radio nine fifty\nAnd education today is sponsored by Oakland University\nMake your corporate holiday party different this year book it now on the Detroit princess river voted their heated and ... you can celebrate any party political fundraiser or birthday all year long cruise with them Saturdays or Sundays for lunch or dinner called eight seven seven D. E. T. B. O. H. T. or Detroit princess dot com\nAnd traffic and whether together sponsored by Detroit princess river\nThe all new radio job job that is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access to radio stations you love you know we'll see your favorite stations and\nOthers do you based on you as a news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nW. W. J. news time is our twelve twenty three that means it's time for the twelve K they give away I W W J news radio nine fifty it's ours key word is dad text dad da de to seven to eight one for your chance to win a thousand dollars remember messaging data rates apply and don't text and drive\nHi my name is Michael I became a heroin addict at a very young age and high school I didn't think there was any hope for me since I've been here I've got my life back um drug free and that is a miracle\nThis is Jeff bombs all our life challenges the only long term faith based residential recovery program in southeast Michigan no medical insurance required\nGraham in southeast Michigan no medical insurance required team challenge Detroit Toledo in Flint for addiction call aid for for three five five L. I. F. E. or go to ... dot life\n[noise]\nW. W. J. new sound is now twelve twenty five time for business from the suburban Cadillac of toy business desk right now that that was that two hundred Fifteen\nPoints at at least have already has our Bloomberg Business reports investor seemed relieved with the agreement between ... and the as the the founder Elon Musk will stay on as CEO but we'll be removed as chairman of the electric carmaker the settlement comes after mosques August tweet that he had secured funding to take tests private\nTo stock up Seventeen percent\nA group of leading economists is warning the U.S economy will tumble into a recession in two years Bloomberg's any doubt you'd ice has more\nAmerica's economy is flying high just now but what goes up must come down two thirds of business economists expect the recession by lake twenty twenty excite us trade policy is the greatest risk followed by rising interest rates in a potential plunge in the stock market\nA source tells Bloomberg twenty first century Fox plans to release a PG Thirteen version of dead pool too in theaters in time for the Christmas Holiday it's a ... a few extra dollars out of one of the company's most popular film franchises\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nThe all new radio job job at is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love you know will save your favorite stations and\nOthers do you based on your list of news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBuddy of rates go down your rate drops either way you win call us today at eight hundred quicken or go to a rocket mortgage dot com\nRacial upheaval only about on certain through your victory lumps cover costs me permission conditions equal housing winter licensing office effects animal is number three thirty initial conditions are exclusion may play\nAnd was no page from the diary of law\nDo diary that goes to this house is protected the progressive but that doesn't mean it's a hard balance would you explain that radiator like clanking sound for the moon colored light in the hallway that's gone by morning maybe he never bundled home in auto and he's doomed to suffer an eternity without the state is\nSleeping average Seventy percent on car insurance when you're going to home in order for progress that we owe right the wind casualty insurance company and affiliates discounts not available at all stick their situation\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political tide gas covering the very latest news\nAcross the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\n\nWhether guard window is the only factory in Michigan Building commercial grade windows designed to last whether guard even guaranteed them for live call eight hundred three seven seven eighty eight eighty six [noise]\nW. W. J. news time now twelve twenty eight track again\nYeah eight eighty six [noise]\nW. W. J. news time now twelve twenty eight track again whether together on the AIDS and here's Tracy McCaskill\nAnd Jackie checking the triple a gym camps here we're still watching an accident west one I knew before nine mild a left leaning shoulder a block\nThis delay is growing we are backups now why six Ninety six now aside from that\nI never worked film that I made before including ... founded Belleville where the right lane is closed more work along with them and I said before affecting that the editor to us twelve Michigan avenue up until three PM more accidents along north on I Seventy five it's seven mile and one along south by Seventy five and eight mile yet another\nCell phone I Seventy five blocking the ramp to west bound I Ninety six\nFrom the idol download a group plenty for our traffic center I'm Chrissie McCaskill WWE Jamie's radio now I'm fifty\nWas in my family they never graduated\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list is a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWas in my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne finished high school diploma\nI could not have done it alone especially the future is really\nNo one can give them alone if you are thinking in your high school diploma you find free adult education in near you finish your diploma dot org run he went and only generally to the nation and the and you know\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council [noise]\nHow do you have a DJ new started out twelve thirty eight traffic and whether together every ten minutes on the eighth and here's Tracey\nAnd Jackie chicken the triple a jam cams this time around we are still watching this accident was fun I knew before at nine mile a left leaning shoulder blocked with backups too I ... now an accident on twelve mile attach road\nHas the roads closed it through that stretch though do keep that in mind if it happens to be on your route also still watching the left lane and shoulder blocked along ... express lane but they're made in\nThe sun I Need to fix that I Know before the rights center lane now blocked by an accident also yet another accident cell phone I Seventy five blocking that ramp to west sound I net effects from the idol download a group twenty four hour traffic center Tracy McCaskill WWE Jane news radio nine fifty\nAnd that accuweather forecast from accuweather meteorologist days Samuel\nWe have a very well defined front of a boundary located just to ourselves so that's where the warmer air is bottled up or main to ourselves today a meanwhile will be left with a cloudy skies\nThere has been rain around and will continue to be right especially nor the portions of Detroit metro as we head into the afternoon this rain will be slowly lifting northward\nSo will tend to dry out by the end of the day temperatures will slowly climbed through the fifties too high up sixty three\nAnd four tonight will see a war for lifting through and that'll bring a few showers and thunder storms however most of this rainfall\nConfined to the pre dawn hours so we'll be dry most of your Monday Night below fifty nine degrees and tomorrow we'll see morning showers and even a thunderstorm that'll mostly and by the afternoon the high Seventy four Wednesday and Thursday will be very warm ... and the upper seventies who around eighty or rain likely friday though\nThey are looking at cloudy skies light rain falling fifty six degrees that Detroit metro airport traffic and whether together sponsored by bridge down which down engineered Dr guard tires and take a puncture and keep running fifty miles after a flat\nWhich drives our tires you can get to a safety or you can get to the safety on a flat instead of being stranded on the side of the road so rest easy and let bridge down Dr guard tires give you peace on the road\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne finished high school diploma\nI could not have done it alone I see the future is really\nNo one can come home alone if you are thinking in your high school diploma you have now signed free hit on education and your you finish your diploma dot org running with a Dollar General litter the nation and the and you know all\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I try\n\nTo bring you the news of these watch never stops one of the Michigan association of\nOn Wall street the Dow Jones industrial average is that the two hundred two points and that is that twenty and the S. and P. five hundred days at fourteen we will get the full check of your money coming up at twelve fifty five\nTimes now twelve forty five time for sports and here's Ryan Willie\nJacket with a tiger season now in the books rented to Iran garden higher joined Ninety several and the ticket today to talk about the years that he was very impressed with the effort is team showed all year long as a young players will benefit from going through a season like this also talked about next year in wouldn't commit to ... becoming the team's fulltime ... when he returns from injury\nOr CEOs still I mean what are your free trade and to see how his daughter and we'll see how everything progress guy can really do you do that that's all we don't have much much at first we resolve builders we use you know other guys are probably you know our first listener I can tell you the\nStaying in major league baseball will have to gain one sixty three today the cubs and brewers squaring off in the central tie breaker that gets underway and about Fifteen minutes the Rockies and Dodgers meeting of the you know ... four o'clock the teams that lose today's game to the meeting tomorrow night in a wildcard match up\nStarting to the NFL after Florida the cowboys and Dallas yesterday lives are trying to turn their attention to Sunday's match up with the Packers at Ford Field and quarterback Matthew Stafford telling Detroit Lions dot com after the game a big reason why Dallas and a lot of success against him because Troy couldn't get the run game going\nKnow the majority of the game was stuck in the box in their favor you know trying to stop the run and um you know or go to a you know that a good job or early ... runs it popped um they didn't show making somebody else means and going from there and in the Senate football you know women in Iran\n... runs it popped um they didn't show me and some of those things and going from there and in the Senate football you know women in early grades and weeks other weeks or you know they're going to you know puts in resources up front to make sure you don't then the day off and just about growing points was too\nWeak for meanwhile comes to a close and I'd Broncos playing host the chiefs on Monday Night football you can hear it on ... on the ticket starting at seven thirty in the game times but announcer Michigan's October thirtieth match up with Wisconsin from the big house they'll play underneath the lights at seven thirty\nWith sports Fifteen and forty five passed each hour I'm Ryan woolly dog eat up all ... news radio nine fifty\nAnd we'll check traffic and whether together now\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list of news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWell I'm Glad you enjoyed it but I think it's that had back in\nKilling I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nShort fast and your neighborhood teenager had the foresight to find a neighborhood park or green space in ... in the U.S Forest Service\nW. W. K. news this hour twelve forty eight traffic and whether together on the eight sponsored by higher ed Dunn dot com and here's Tracey and Jackie\nChicken ... this time around we're still watching here\nOr an accidental on twelve mile untapped robot good news the route has reopened the accident on the west bound for nine mile has cleared four smelly still watching on here is fun I may be fixed the express lane that it made\nThe left lane and shoulder remained block I met he thinks he's found at I met before\nWe still have the right of center lane block that collision also there are still problems on cell phone I Seventy five and eight mile with a left shoulder as lots south when I find that ramp to west on I ... I lost my enacted and we still have reports on the right shoulder block north bound em ten at evergreen\nAnd Jackie taken the triple a jam came as this time around watching a Jack knife semi now there's a long list but I may be for it I two Seventy five\nThe left lane and shoulder a block and that too much of a delay there now will certainly keep an eye on it but it emergency crews on scene flooding here is affecting each ... that I met before keep that in mind is on I ... that I Know for the right center lane blocked by an earlier accident and still one here along south by Seventy five blocking that ramp\nTo west bound ... from the motor group twenty four hour traffic center Tracy may have WW Jane news radio nine fifty and\nThe accuweather forecast from accuweather meteorologist dean divorce for the rest of today rain tapering off otherwise cloudy this afternoon it'll be cool with the high only near sixty three and four tonight cloudy and mild some showers and a thunderstorm later with a low near fifty nine right now a Detroit metro airport still raining it's fifty six degrees\nThe news ... news radio nine fifty to oh\nGood afternoon I'm Jackie page and these are the top stories that had a new Detroit policy will stop fire trucks amusing lights and sirens on some run is getting negative feedback today will have the story for you coming up\nA local judge in the hot seat WWE case Turley Lincoln will explain and President Trump announcing a new trade deal with Canada and Mexico alive is CBS News with a very late\nDot com\nCBS News on the hour sponsored by their works relief I'm Steve cave and President Trump attacking Democrats in the Senate he says we've been unfair to his Supreme Court nominee Brett Kavanaugh and he says he wants the FBI investigation into sexual misconduct allegations to be comprehensive but he wants to be done with speed\nI think the FBI should interview anybody that they want within reason\nAnd he says he has an open mind but indicates he's with capital all the way\nWatched a man saying that he did have difficulty as a young man was drink the one question I didn't ask is how about the last Twenty years have you had difficulty last Twenty years 'cause nobody said anything bad about it\nSince say he should be elevated to the Supreme Court the president's comments came at a Rose Garden event where he praised the new U.S trade deal with Canada and Mexico\nThis landmark agreement will send cash in jobs pouring into the United states and into North America good for Canada good from Mexico instead of jobs leaving for overseas agreements\nDesigned to replace NAFTA Congress will have the final say no to Las Vegas\nOn fifty eight of us were released for each of the people who died in the concert mass shooting one year ago today Nevada governor Brian Sandoval we cry\nWe grieved and we resolve to become Vegas strong in one year later we're Vegas stronger\nOverseas three days after an earthquake in Indonesia one man was pulled alive from the rubble of collapsed buildings Asia correspondent Tracy says we're also dealing with the aftermath of assume nominee\nThe twin disasters devastated the city of ... are crowded buildings like mosques and malls collapsed\nTrapping people inside until Sunday night cries for help can be heard from the rubble of the ... hotel where officials believe fifty people could be buried under the debris flow some crews are still racing to the survivors mothers have turned to the green task of collecting body\nMore than eight hundred forty people have been confirmed dead James Allison got the news and a phone call from his son he and a Japanese researchers shared the Nobel Prize for medicine both hailed for their work that has led to cancer treatments smoke\nYou know you know there's a basic science is to see where I work actually end up Twenty years later actually a really really helping her share of\nAllison's drug helps extend the survival of patience with late stage melanoma Wall Street right now the Dow was up two hundred points this CBS News\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam get their works relief today and the pain relief ... your local pharmacy or their works relief dot com\n[noise] washing never saw on Detroit's number one news\nRadio nine fifty to holding a [noise]\nGood afternoon and thanks so much for joining us it is Monday I talked with the first in I'm Jackie page for now that he'd have a DJ news radio nine fifty\nBy these guys this afternoon with more rain rain all live north of Detroit metro later in the afternoon a cool day with a high sixty three that's as cool as we are this entire week the complete accuweather forecast of coming up\nAnd right now in Detroit metro airport it's cloudy and fifty seven degrees that you'd have a decay news town is that one out free and fair visits to the hair salon it's all part of a story of a local judge in the hot seat today now that he'd have any case that Charlie liked to live and local to explain Charlie\nI'll tell you what he does actually a lot to explain in the hearing is just getting underway right now we're in the law voting your district court but it's a judicial tenure commission against judge Theresa Brown I'm she's a Livingston County district judge but this is where they're having the hearing\nThe hearing is over multiple ethical violations that if they're proven true the Supreme Court could remove the judge\nFrom the marriage and the judge is saying that the allegations must be taken in context but Jared calls he said that his father was convicted of first degree murder despite the fact that judge Brennan failed to disclose that she was having an affair with the leap police officer in the case\nA mirror forever you know to see that justice takes place and uh you know she had a lot of wrong I was calling her courtroom ... especially in my father's case drunk while ski and if she gets on if they find charges against her or she is qualified and taken off the fast and it shows a hole for my father and his case and getting a return\nShe gets um if they find charges against her or she is qualified and take it off the ... and that shows a hole for my father and his case and getting a retrial\nThe father's cases appeal you know they're trying to get it appealed a bottom line that I Am told that this hearing could take two weeks reporting\nLive here alone yeah Charlie lying to double BJ news radio nine fifty W. W. J. news time is now one oh four charges announced in connection to an inmate suggests that W W J city reporter Vicki Thomas live and local with the details Vicki\n... county prosecutor can worthy charging less land sergeant Ronald Buckley and EMTs Matt because sola and Leah Maynard with involuntary manslaughter and misconduct and office the charges stem from the death of William Marshall last December\nHe had been in the lock up after being arrested for cocaine and marijuana possession worthy says Marshall had convulsions and itself for an hour and a half and even though he was dragged out of the cell by the paramedics no medical attention was rendered\nSergeant Buckley did not send Marshall to the hospital and he left them in the jail without monitoring monitoring him with us from higher period of time the two EMTs they denied him medical treatment and abandoned him in the jail after he requested a system the defendants are all presumed guilty and\nShe says they're presumed innocent until proven guilty reporting live and local at Frank Murphy hall of justice Vicki Thomas W. W. J. news radio nine fifty\nW. W. J. new time now one of six Detroit city council committee today taking aim at eight new Detroit fire policy that dictates lights and sirens or not to be used on some non emergency runs now that he'd have to chase center McNeil live in local with the story Sandra Jackie the public safety committee grilled fire commissioner Eric\nJones on the policy that went into effect at the end of August Jones says there were Seventeen accidents involving fire trucks with lights and sirens last year he believes based on similar policies in other towns this new policy will cut down on accidents city council person Jeanette ears not so convinced\nThat she was studying this for a year we don't have a cost benefit analysis we don't have a risk so we don't have any things that are just before the CBP truth this is ... anything so I don't know what you were studying in the year\n... says she understands separating runs into emergency and non emergency but [noise]\nYou use it as to whether someone is the one or two and quite honestly that's heavy burden to put on a person and make those sporting\nLives Andrew McNeill W W chain is radio nine fifty arson investigators at the scene of a Hamtramck home after two bodies were discovered on the second floor of the house on ... street near Joseph Campo and the Davis in\nDetroit deputy fire commissioner David for now says it they put out the fire and that's when they discovered the victims he says the fire was intense\nDesert staircase was burned away so it you know and I'm I'm sometimes you get a fire started on the first floor and that happens and I'm but I'm like you said that this particular point we don't know where it started going out started but it is under investigation\nUh Detroit firefighter who fell through the second floor down to the first was injured he was taken to Detroit receiving but he is expected to be okay [noise]\nWWE changes time now went away traffic and whether together every ten minutes on the age from the ... group traffic center brought you this hour by Audi of Rochester hills and here's Tracy McCaskill\nJackie we're still watching here jak semi this long was found in fourteen I two Seventy five the left lane and shoulder remained blocked emergency crews are on the scene now over to some\nOr Jack knives semi this long west on him fourteen and I to Seventy five the left lane and shoulder remained blocked\nEmergency crews are on the scene now over to some flooding here along east bound six Ninety six I think I met a fork and after use caution they're also still watching along ... rode the right lane closure until three for roadwork\nCell phone I Seventy five the ramp to what's on I'm Eddie fix remains blocked by an accident and yet another eastbound I maybe fix it I said before remains there with the right center laying a block from the idol download her group twenty four hour traffic center I'm Tracy McCaskill WWE James radio nine fifty\nAnd that accuweather forecast from accuweather meteorologist stay Samuel\nWe have a very well defined frontal boundary located just to ourselves so that's where the warmer air is bottled up or main to herself today a meanwhile will be left with a cloudy skies there has been rain around and will continue to be arraigned especially nor the portions of Detroit metro as we head into the afternoon this rain will be slowly lifting northward\nW. W. J. news time now one Eighteen traffic and whether together on the eighth and here's Tracy McCaskill and Jackie chicken\nThis time around we are watching here a few flow down then this report sponsored by ...\nThat'd be for connector slower traffic here on the west on I said before between Van Dyke and I Seventy five\nAnd time now for the national electrical contractor association construction alert where we are watching fill some work here along the I Ninety four west about the exit to Michigan avenue us twelve there the right and left shoulders up at a closed until three\nBut the expertise in scale of ID W electricians Nico signatory contractors to work for your commercial public industrial or residential construction project or more at powering Michigan's future dot com that as contractors the best electricians period from the motor group twenty four hour traffic center Tracy McCaskill WW Jane news radio nine fifty\nAnd that accuweather forecast from the family heating cooling and electrical other centers the\nRain gradually coming to an end this afternoon a will and from South to North across Detroit metro then we'll see lingering clouds go up as a high only sixty three states mostly quantity tonight below\nFifty nine will be another rather showers and even a possibility of thunderstorms late tonight is the first part of tomorrow otherwise tomorrow afternoon just a lingering shower or will be warmer with a high of Seventy four Wednesday cloud some sunshine the high approaching eighty or ... will swing through the area Thursday morning bringing more showers\nThursday Afternoon partly sunny with the hype Seventy seven quality with Maureen likely friday the high sixty eight\nUm accuweather meteorologist Dave Samuel L. W. W. J. news radio died fifty\nAnd right now it's still cloudy fifty five in Canton fifty three and the only fifty six downtown and ... metro airport it's cloudy and fifty seven degrees\nC I F again whether together sponsored by Detroit princess riverboat make your corporate holiday party different this year bucket now on the Detroit princess riverboat they're heated and close so you can celebrate any party political fundraiser or birthday all year long\nCruise with them Saturdays or Sundays for lunch or dinner all eight seven seven D. E. T. B. O. H. T. or at Detroit princess dot com\n[noise] on news radio nine [noise]\nGood afternoon I'm Jackie page and these are the top stories at one Twenty one and Detroit city council committee criticizing a new Detroit fire policy that dictates lights and sirens are not to be used on non emergency runs\nFire commissioner Eric Jones is that there were Seventeen accidents involving fire trucks with lights and sirens last year and he believes it based on similar policies in other towns it could cut down on those accidents here city council person Jen uh Janey errors\nYou off as you've been studying this for a year we don't have a cost benefit analysis we don't have a risk assessment we don't have any things that are statistics for the city the truth this is ... anything so I don't know what we were sitting in the year\nThe policy went into effect at the end of August the U.S Canada and Mexico salvaged a free trade deal overnight that was on the brink of collapse Canadian Prime minister Justin Trudeau says with rising questions about NAFTA\nHe has determined Canadians would remain United and emerge stronger and that's what happened with the United states Mexico Canadian and Canada agreements\nThat sort of agreement that will be profoundly beneficial for our economy for Canadian families and for the middle class\nThey announce the agreement on a replacement for NAFTA just before the midnight deadline imposed by the Trump Administration [noise] W. W. J. news time is now one twenty two\nIt is about politics this is the rules of the CBS News radio network preserve both or works relieve\nThe friday elevator standoff between two sexual assault victims of some ... was one of those moments that symbolizes the unfinished business between men and women in this country Kellyanne Conway comes with the president said on CNN that she thought it was unfair for them to use their pain to get some of their flick to change his vote on Brett Kavanaugh as she revealed that she herself\nPresident said on CNN that she thought it was unfair for them to use their pain to get Senator Flake to change his vote on Brett Kavanaugh as she revealed that she herself had been sexually assaulted but the painful as it was she blames the perpetrator not capital\nYou know I Want those women who were sexually soccer they were fighting Catholic ... ...\nShould not be about politics you said for foods for both for taking full and yet\nThe Senate is not a courtroom professor Ford cars and trucks with Kevin in jail just to keep them off the Supreme Court and that process is about politics how was it that so many people who revere the founding fathers seem to hate the system is designed the constitution says the president is free to a point that he went to the court qualified or not provided enough senators vote yes\nThere are certainly free to listen to their conscience before voting but we should also expect the for the sake of reelection they may press mute once in a while that is where the two women quarter ring a senator and getting him to change his mind\nYou know if highly paid lobbyist could do it and they do why not that they were also the CBS News radio that were\nTo experience relief or muscle cramps and your legs and feed used their works really fast acting foam give their works released today and the pain relief violate your local pharmacy or their works relief dot com\nW. W. J. news time now one twenty three [noise]\nAt the twelve K they give away I W W J news radio nine\nFifty this hour's key word is cookie text cookie C O o K I eat a seven to eight one for your chance to win a thousand dollars messaging data rates apply remember don't text and drive\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be on writing subscribe and download today on radio dot com and I to\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nW. W. K. news time now one twenty five time for business from the suburban Cadillac of toy business desk and right now the Dow is up to hundreds sixteen poison as that got plenty to the as simply as a Fifteen and Alisa Peretti has our Bloomberg Business report [noise] the new\nTrade deals for the U.S and Canada could spell relief for car manufacturers thousands of miles across the ocean Toyota and Honda or among car makers that would have the most to lose by any additional terrorists\nThey build a vehicle in Canada for the U.S those include the rats for and that's ... best selling sport utility vehicles which comes to the U.S from Canada or Japan\nUs factory activity retreated a bit after setting a fourteen years\nDirected the rebound in September a separate report finds two thirds of us business economists look for a downturn to begin by the end of twenty twenty with arrest looking to twenty Twenty one or later for recession that from the national association for business economics\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nThe all new radio job job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love you know will save your favorite stations and\nOthers do you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political podcast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nSeventy Seventy changes time now one twenty eight traffic and whether together on the AIDS here's Tracy McCaskill\nJackie checking their AAA jam came this time around still keeping an eye on this Jack knife semi this along with one I met before at the guy to Seventy five going after the left lane and shoulder remains block we have traffic floor in the area but no significant backups at the moment\nA seven to eight one for your chance to win a thousand dollars it's well okay they give away is brought to you by we fix money dot com neither emergency cash a check out we fix money dot com for more message and date of rights apply\nAgain whether together every ten minutes on the eighth and one thirty eight and here's Tracy McCaskill\nAnd Jackie this report sponsored by Ben Johnson law we're still uh watching the Jack knife semi here along with him for a team that I two Seventy five the left lane and shoulder remain block emergency crews are on that theme\nNo significant backups they're fortunate lay now over the west on I may be for between ... and I can I Seventy five some slower traffic we also advise and you'd watch for slow down here an accident on ice Seventy five the Chrysler rap as it turns to ice Seventy five the Fisher again use caution when using the ramp and watch out for some slower traffic\nThrough that stretch right now car crashes aren't about\nThe vehicles involved there about the people and\nThat to Ben Johnson it's fighting for everyday people just like you who just one justice call one eight five five then fight today because everyone deserves a fighting chance to get their life back on track\nMe I don't know motor group twenty four hour traffic center Tracy McCaskill WWE changes radio nine fifty\nAnd that accuweather forecast now from accuweather meteorologist stay Samuel\nWe have a very well defined frontal boundary located just to ourselves so that's where the warmer air is bottled up or main to ourselves today a meanwhile will be left with a cloudy skies there has been rain around and will continue to be right especially in or the portions of Detroit metro as we head into the afternoon this raid will be slowly lifting northward\nWill tend to dry out by the end of the day temperatures will slowly climbed through the fifties too high of sixty three\nAnd four tonight will see a war for lifting through and that'll bring a few showers and thunder storms however most of this rain fall\nConfined to the pre dawn hours so we'll be dry most of your Monday Night below fifty nine degrees and tomorrow we'll see morning showers and even a thunderstorm that'll mostly and by the afternoon the high Seventy four Wednesday and Thursday will be very ... and the upper seventies who around eighty\nOr rain likely friday though that a whole temperatures back into the upper sixties this was accuweather Samuel on W. W. J. news radio\nW W J news time is now one forty\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation to go back to school every day after work with straight to school and it paid off\nAt age twenty six Corinne finished high school diploma\nI cannot have done it alone especially the future is really\nNo one can minimum alone if you were thinking of ... your high school diploma you have now signed free adult education and your you finish your diploma dot org run humid a Dollar General litter nation and the younger all\nThe all new radio job job that is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love you know will save your favorite stations and\nOthers do you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nFor anywhere\n\nPresent them with her to gather on the AIDS and breaking news keep up to date on the road\nNewsworthy nine fifty you're W.\nW. W. J. news time is not what forty one bad weather canceling Detroit's slow roll bike ride tonight slow roll officials say that they agree with the Detroit police that flooding and wet cold weather\nMay not clear up and it's not good biking whether they are there will be an event motor lists city bicycles from five to seven pm to pass out patrolling member sure are patron member shirts [noise]\nW. W. J. news time is now one forty two the hunt for that missing hike or goes on in a sprawling national park you're CBS is the case in\nOhio a woman who's missing in Great Smoky mountains national park along North Carolina's border with Tennessee fifty three year old ... suit Clemens was last seen on Tuesday while hiking with her daughter park official ... Campbell\nRight now we're really focusing on the ... area since we have now kind of cleared and walk to most of the trails haven't found her and so it takes a lot of people and a lot of time to just comb through that lens\nGay over the weekend more than one hundred people canine teams and aircraft for used in search Steve Cape and CBS News\nW. W. J. news time now one forty three\n[noise] CBS eye on veterans presented by their works really it's available to some patients that department of Veterans Affairs medical centers treatment for hair loss eligibility though depends on what's causing a vet Toulouse hair\nIf it's from something that happened to you in the military or even for a medication that the da is giving you to treat something then you can have your own is taking care of for free at\nThe medical center connecting vets dot com reporter Jonathan ... hangar tells us primary care docs at the VA want veterans to let them know about your loss\nIf you ignore the fact that you're going bald you could be ignoring other diseases too so the absolutely wants you to come in and talk about\nMore women vets than you'd think or dealing with hair loss the VA studying whether they're having to have kept their hair pulled back during military service might be one cause\nJazz Henry connecting vets dot com for CBS News\nTo experience relief or muscle cramps and your legs and feed use their works really fast acting foam get their works released today and the pain relief ... your local pharmacy or their works relief dot com\n... percent we should help you do insurance stuff\nOut of your budget to Boston\nTo tell us when you want to pay for insurance and I hope you find out you know you're going to get you get out and you don't you don't you don't mind\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\nYeah but you have any news time there's not one forty five that means it's time for sports and here's Ryan lily\nJacket with a tiger season and the books manager on guard and higher on not ease up on the ticket today talking about the years that he was very impressed with the effort is team showed all year long that the young players will benefit from going through a season like this also talked about next year though and he wouldn't commit to ... becoming the team's fulltime ... returns from injury\nOh so you always still I mean what are your free trade and to see how he's doing and we'll see how everything progress guy can really do that so we don't have much much at first we resolve builders were used you know other guys are probably you know are the first place I can tell you the\nDang a major league baseball though there's two game one sixty three is on the schedule today the cubs and brewers squaring off the you know central tie breaker that game scoreless in the third the Rockies and Dodgers set to meet you know west type record today at four o'clock\nTeams that loose today's game by the way will demean and tomorrow night in a wildcard match up over the NFL after falling to the cowboys and Dallas yesterday the lines are turning their attention to Sunday's game with the Packers from Ford Field the quarterback Matthew staffer told Detroit Lions dot com big reason why Dallas and a lot of success against them is because Detroit could get the running ain't going\nYou know the majority of the game was I'm stuck in the box in their favor you know trying to stop the run and I'm In our guys did a good job early had some uh runs that popped um they didn't show making somebody else we can go on from there and in the Senate football you know in in\nIn a really great some weeks other weeks a you know they're going to you know puts in resources up front to make sure you don't at the end of the day often says about scoring points which the new one\nWeek for a while to come to a close to the Broncos playing host to the chief shooting here in uh Ninety several and the tickets starting at seven thirty in the game times but announcer Michigan's October thirtieth match up with the Wisconsin out of the big house to play underneath the lights at seven thirty with sports Fifteen and forty five passed each hour I'm Ryan ... news radio nine fifty\nHey Sean Spicer and every mid term elections since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique and saying you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nPlease stop taps stop ... and that's one spot by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting as a\nI'm going to return the kayak\nThe all new radio job job that is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access to radio stations you love you know will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate and we're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nAnd then for Wednesday it will be mostly cloudy warmer which hours in the morning tapering off by the afternoon and height once again near Seventy four right now it's cloudy and it's fifty seven degrees that Detroit metro air force\nThe news much never style radio nine year old are you\nGood afternoon I'm Jackie page and these are the top stories ahead with Greg Bowman and workout on President Trump says that he has a very open mind regarding the FBI investigation into Supreme Court nominee\nAnd with great Bowman and Brooke gallon President Trump says that he has a very open mind regarding the FBI investigation into Supreme Court nominee Brett Kavanaugh I Want them\nTo do a very comprehensive\nInvestigation [noise] CBS News will have much more coming up at a local judge on the hot seems wrong and going on or\nOff for some of my father's case I'm Charlie lined [noise] and a different road workers disputes will explain following CBS News at two o'clock\nDot com station [noise]\nBS news on the hour presented by CBS is the neighborhood\nI'm Jim ... the Supreme Court began its new turned today with eight justices says the nomination of Brett Kavanaugh to the high court remains in limbo amid the sexual assault allegations against him and the FBI investigation of those allegations it was a hot tub I give President Trump's morning news conference\nThe president's dismissing criticism from Democrats that the scope of the probe is too limited he says it's up to the Senate not him to determine what the FBI investigates\nI think the FBI should interview anybody that they want within reason\nMr Trump also says he doesn't think Kevin allied or mischaracterized as drinking habits\nI can tell you I watch that hearing and I watched a man saying that he did have difficulty as a young man was drink\nSteve Dorsey CBS News Washington President Trump has reached a deal on that rework North American free trade agreement with Canada and Mexico\nThe agreement will govern nearly one point two trillion and trade which makes it the biggest trade deal and the United states history and\nCanada which had been playing hardball on trade with the U.S is describing the deal is a victory which maintains tariff free access for the majority of Canadian exports President Trump says he's not all that confident that Congress will ratified the deal saying it might rejected for political reasons\nServices today in Las Vegas marking the anniversary of the costs are should be the lead fifty eight people to court county sheriff Joe Lombardo\nWe learn that we're not defined by our fears but by our we'll to overcome them calm was brought to chaos and the generous outpouring of support restored our sense there were more good in the world than there is bad\nWell several hundred people attending that sunrise ceremony including survivors families of victims sand the first responders\nOr the Nobel Prize for medicine was handed out today to American James Allison and Japan's ... for their research into ways the immune system can be manipulated to find cancer Allison's worked focused on pro teams the doctors breaks on the immune system\nI'm a basic scientist I did not you're there to re studies to charter church after I got into it because I Want to know how the cells were in New York\n\nForever garde being charged with assault related will fight it uh queens strip club back in August spokesman says there's no evidence to she calls anyone any harm\nAnd they expect the matter to be resolved expeditiously emergency services officials\nOr the man taking selfies along the flooded Potomac River fell into the great falls and survive\nMan suffered some serious injuries on Wall street the doubt is up one eighty to this is CBS News\nCatchall do comedy premieres would Cedric the entertainer in ... in the neighborhood and David Williams' junior and happy together followed by new episodes of magnum PI and bull tonight on CBS\nWash never stop on Detroit's\nBy new episodes of magnum PI and bull tonight on CBS\n[noise] washing never saw on Detroit's number one they\nWere the only\nGood afternoon and thanks for joining us on this Monday it's the first day of October ...\nAnd I broke Alan ... W W J news radio nine fifty\nBrain will gradually taper off this afternoon but it remains cloudy uncool the highest sixty three temperatures returned to the seventies tomorrow the complete accuweather forecast is coming up\nRight now cloudy fifty seven degrees at Detroit city airport W. W. J. news time ... three\nCharges announced today in connection with an inmates death W. W. J. newsworthy fifties Vicki Thomas has the story for\nA swing county prosecutor Ken worthy announcing charges against ... police are jet Ronald Buckley in two paramedics who allegedly failed to render medical aid to William Marshall of ... he had been arrested on cocaine and marijuana possession charges\nMr martial can vote for almost an hour and a half with no medical attention on no one's thinking the cause of death with cocaine toxicity and the alleged conduct these defendants in this case shows an inexcusable and criminal disregard for human life\nAnd another inmate case out of ... worthy not seeking charges and the death of Frank quarter back in the summer of twenty Seventeen thinking Thomas W. W. J. news radio nine fifty\nA local judge facing a disciplinary hearing over allegations she had an affair with a police officer who was the lead investigator on a murder case in her courtroom here with the story is W. W. J. legal analysts Charlie lengthen\nProtesters outside of disciplinary hearings for judge Erica job is holding a sign saying judge Theresa Brown in Livingston County lied under oath Eric ahead her four children taken away from her by judge Brett I'm because she believed the judge didn't like her attorney that attorney just ran against the judge in the last election\nI was her second family court case ever and she took my children from me and I want to make sure she knows that I'm here because I told her I was never going to stop being a thorn in her backside\nJudge Brennan admitted in a hearing today that she refused to disqualify herself in her own divorce case the Syrian could last two weeks in Livonia Charlie lying to W. J. news radio nine fifty\nVoter say yes to legalizing marijuana just how much money will that generate for the state W. W. J. Lansing bureau chief Tim ... joining us live and local with the answer forced him\nTo the question is how much money can you raised with ... in this should be pushing for a yes vote on ... all one indicate such five hundred twenty million dollars but we should point out that is over five years so when you look back it's about a hundred million bucks for a year\nUnder this proposal if Michigan voters say yes thirty five percent of whatever the profits are go to ... percent to schools and Fifteen Percent or local governments in the west to the state of Michigan there's a ten percent excise tax\nAnd a six string sales tax on part of the bogus so yes and the latest poll says fifty five percent of them are prepared to do just that reporting line from ... W W J news radio nine fifty\nW. W. J. news time to a six a major endorsement for democratic candidate for governor Gretchen Widmer former\nPresident Barack Obama throwing his support behind the former senator he says Whitmore has spent her whole life getting real results for hardworking Michigan Anders and the state's middle class families need a governor who knows how to get things done with ... against the current state attorney general bill ...\nAs you heard on CBS News goodbye NAFTA hello us MCA that's the name of the tentative trade agreement roots\nYou're all bell shooting\nAs you heard on CBS News good by NAFTA hello us MCAA that's the name of the tentative trade agreement reached by the U.S Canada and Mexico that would replace the north American free trade agreement in twenty twenty upon ratification\nDr Sheila ... distinguished professor of management at waltz college says the new deal includes a greater share of auto parts made in North America which could be good news for the U.S workforce but there's more\nWorkers like thirty percent say hold on we'll hear how to be done by\nWorkers earning sixteen dollars an hour and of course that's a lot more than we're paying workers in Mexico so I suspect wages for North American workers are going to rise\nRamos says that's still depends though on us automakers being able to make a profit\nRescues the rescuers and dot courtesy vans were pulled off metro Detroit freeways at midnight when the contractors deal with the state expired emergency road response were asked to stay on temporarily until the new contractor could step in early next year spokesperson Jeff Cranston says they're now in talks with that contractor to bring the vans back\nAnd got his shouldn't regions that you have the service or metro and a couple of those counties university university primarily it's us toiletry ...\nClients and says the dispute has not effect courtesy van service and living in sin and washed in our county\nW. W. J. new sent to always rather good weather together every ten minutes on the AIDS from the ... group traffic center brought you this hour by BMW of Rochester hills\nAnd chasing McCaskill that rain causing some problems\nRight we're watching here through the triple a jam games is Jack knives semi this funding fourteen and I to Seventy five the left leaning shoulder remains locked now they are emergency crews on the scene\nBut traffic flow in the area but not as significant delight to deal with also watching here along the ice Seventy five the Chrysler the ramp to Seventy five the Fisher still blocked by an accident moving more cruel on north when I Seventy five from burner to granted where the left lane is closed up until two thirty were also continuing to monitor here\nA traffic along six Ninety six was found between ten and two Seventy five not doing too bad all clear as well along or thought in thirty nine between\nWhich today and free start financial give you one hundred fifty dollars when you open a boomerang rewards checking account with direct deposit\nIt pays to belong to a free star financial credit union insured by the in the UAE from the idol down motor group twenty four hour traffic center and Tracy McCaskill WWE Jamie's radio nine fifty\nEvery accuweather forecast now family heating cooling electrical weather center Dave Samuels the\nRain gradually coming to an end this afternoon a will and from South to North across Detroit metro then we'll see lingering clouds\nGo up as a high only sixty three states mostly climbing tonight below fifty nine will be another rather showers and even a possibility of thunderstorms late tonight in the first part of tomorrow otherwise tomorrow afternoon a lingering shower\nWill be war with the height of Seventy four Wednesday clubs and sunshine the high approaching eighty or ... will swing through the area Thursday morning bringing more showers Thursday Afternoon partly sunny the hype Seventy seven quality with Maureen likely friday the high sixty eight um accuweather meteorologist Dave Samuel L. W. W. J. news radio night fifty\nRight now it's cloudy and fifty seven degrees in Allen park we do have a light rain reporting selling loop here where it is fifty two it is fifty three and Sterling Heights in fifty six India born\nOn news radio nine fifty\nAfternoon I'm ... and I ... a gallon here's what's happening at two twenty democratic candidate for governor Gretchen Widmer receiving play the endorsement today former president Barack Obama throwing his support behind the former senator\nPresident Trump says he thinks it's fine if the FBI wants to interview Supreme Court nominee Brett Kavanaugh who's defending himself from sexual assault accusations\nI think so I think it's fine if they do I don't that's up to them uh I think that he spoke very conclusively and very well I think it's been a very rough period of time I guarantee that I had a period of time like this\nInvestigation expected to last for a week more to live up to date from CBS News at two thirty one\nPollsters say it's not yet clear how the rec having a debate may filtered down to next month state elections as we hear from W W J Lansing bureau chief ... make it could impact the female vote\nOn how they're brought Kevin I'll say that plays out in Washington and could have an impact pollution\nOf what judge may say in an FBI investigation I just think this is going to drive the president calls I think that that could well imminent that we don't know yet we'll take another few days in terms of the national polling to see how people react\nHe was interviewed on off the record reporting from Lansing tips ... W W J news radio nine fifty about ten thousand volunteers expected to take part in the end it will be unification effort on Detroit's west side today work will be conducted in the neighborhoods surrounding central academy in high school\nReally there's something for everybody that there are a lot of what your skills are a lot of what your experience as it goes up to ... or ... years of age and we're going to be great for like ... like plant trees planted radial building a shelter if you don't want to do physical labor come out it was\n... founder and chief executive of life remodeled the group organizing the six day effort which covers three hundred city blocks\nAnd the twelfth they give away coming up in just one minute\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nHey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I too\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne is I school diploma\nI cannot have done it alone I see the future is really right for me\nNo one can alone if you were thinking of managing your high school diploma you have now signed free adult education classes near you finish your diploma dot org running with a Dollar General leaders and Asian and the and you know we can use\nTime two twenty three [noise]\nIt's the twelve kids they give away on W. W. J. and he said the United states he and his hours key word is team text team AT T e am to seven to eight eight one for your chance to win one thousand dollars messaging data rates apply and remember do not text and drive\nBig rally on the market dial up two hundred points your money's next W. W. J. news time to twenty four\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nConey ... how about a taxi\nHere in nature had the foresight to find a neighborhood park or green space meaning you ... the U.S Forest Service\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax\nThe all new radio job job that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll send your favorite stations and\nOthers are you based on you as a news and information you rely on me even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nWGN use up to twenty five to for business from the suburban Cadillac of drug business\nAnd at least so frankly has our Bloomberg does his report and happy Monday Elisa thank you\nBroke and Greg and it is a happy Monday on Wall street we've got all three of the main averages hire the Dow up two hundred Fifteen points are almost one percent\nNow that gaining for and the S. and P. adding fourteen points not too far off its highest ever level right now it said twenty nine twenty eight the number to beat is twenty nine thirty one the Bloomberg W. W. J. Detroit index of weakness there off into the red\nPresident Trump is celebrating a trade deal with Canada and Mexico that will replace NAFTA saying to vindicate his strategy of threatening tariffs on trade partners he's predicted the agreement will easily pass Congress the deal makes modest revisions to NAFTA which Trump continues to call a disaster\nPapa John's founder John Schneider acknowledged in court today that he has confidentiality agreements with at least two women but didn't say what those packs cover\nSchneider was testifying in a case over his request for files related to his ouster as the pizza chains board chair one of the nondisclosure agreements involves a twenty four year old female employees of affirmed that worked on papa John's advertising stock in the company is thinking about three percent\nI'm Alisa parental with a Bloomberg Business report on W. W. J. news radio nine fifty\nHey Sean Spicer and every mid term elections since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWas in my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work with straight to school and it paid off\nAt age twenty six Corinne finished high school diploma\nI cannot have done it alone especially the future is really\nNo one can the diploma alone if you were thinking of managing your high school diploma you have now signed free adult education classes near you finish your diploma dot org regime and a Dollar General literacy and Asian and the and he'll go\nWell I'm Glad you enjoyed it but I think it's that it had back in\n... I'm sure they'd be careful getting of a\nI'm going to return the kayak\n... how about a\nShort passage from your neighborhood here nature had discovered the force that or to find a neighborhood park or green space near you ... the U.S Forest Service\nListen and imagine\n[noise]\nIf it's five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text\nWhen you have protests ethic and whether they gather and taking McCaskill a new problem\nRight we're watching the new crash here broke it's along the Jeffrey ... D fix your local ramp too in thirty minutes don't feel freeway blonde by the crash also for the triple a GM Kansas still keeping an eye on this jak semi\nEmergency crews remain on the scene of what found him fourteen and I to Seventy five the left lane and shoulder remain blocked over to I Seventy five the Chrysler ramp too I Seventy five the Fisher still blocked by an earlier accident and west on I ... for the extra to liver noise still has work\nProblem right we're watching this accident here broke along I Seventy five and this report sponsored by the Detroit princess now this accident is along I Seventy five at north bound the exit two north line\nIs blocked by the accident as well we have a crash on the Jeffrey ... local lays that ramp sue him thirty nine to Southfield freeway block the right shoulder but especially field is jak semi west bonding fourteen FBI two Seventy five connector I maybe six interchange there\nWe still have emergency crews on the same downtown and accident on ice and defined the Chrysler rams who I Seventy five the Fisher again still there\nYour corporate holiday party event this year will get now in the Detroit princes riverboat they're heated and in close you can celebrate any party political fundraiser a birthday all year long cruise with\nAny party political fundraiser a birthday all year long cruise with Detroit princess this Saturday or Sunday for lunch or dinner called eight seven Seventy eighty boat or Detroit princess dot com boom the motor group twenty four hour traffic center Tracy McCaskill WWE Jane news radio nine fifty Robin Weber are sponsored by buffalo wild wings\nEars the uptake of Dave Samuel well we have a very well defined in front of a boundary located just to ourselves so that's where the warmer air is bottled up or main to ourselves today are meanwhile will be left with a cloudy skies\nThere has been rain around and will continue to be right especially nor the portions of Detroit metro as we head into the afternoon this rain will be slowly lifting northward\nSo will tend to dry out by the end of the day temperatures will slowly climbed through the fifties too high up sixty three\nAnd four tonight will see more from lifting through and that'll bring a few showers and thunderstorms however most of the rightful\nConfined to the pre dawn hours so we'll be dry most of your Monday Night below fifty nine degrees and tomorrow we'll see morning showers and even a thunderstorm that'll mostly and by the afternoon the high Seventy four\nWednesday and Thursday will be very ... and the upper seventies who around eighty or rain likely friday though the whole temperatures back into the upper sixties this is accuweather ... W W J news radio like fifty\nRight now in Mount pleasant we do have showers reporting currently fifty one degrees at Detroit city airport is cloudy and fifty eight at Detroit metro it is cloudy and fifty thousand\nFive dollar gain pitchers cocktails cheeseburgers and brought swim football is on do you have to be buffalo wild wings price participation very\nComing outside W. W. J. do you pay more attention to your phone or your job well if you do that can make your dad depressed will have that story coming out\nThe all new radio job job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you listen to news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nWith twenty five percent off on new enough to Seventy percent off previously refreshing you really need a better reason to party we don't think south or new court furniture clearance interact with more than nine thousand square feet of\nNew and previously in these furniture and acorn for your home and all that so far from one Ninety nine Ninety nine cents at some Ninety nine Ninety nine dining out some two Ninety nine Ninety nine and more freezes prizes and find all weekend long entertained only court furniture clearance are wondering nine for sexually Jackson memorial highway for online that court Clarence furniture dot com\nPress wasn't together on the A's and breaking news for up to date on the road every\nNews radio nine fifty W. W.\nW. W. K. news time to forty two\nYear pay more attention to your phone or your dog a new vet UK study finds that could make them feel lonely and isolated [noise]\nIt's a constant battle between paying attention to man's best friend for checking out the latest Youtube video on demand state with device [noise]\nI get in that hey what are you doing my lab willing to\nPay attention to me yeah exactly a new study shows dogs may become more anxious and possibly even suffered from doggy depression due to our overuse of smartphones\nUsing all he looks at me like\nI'm On a theory\nThat is reporter Greg are goes with the story\nWWE news times you've already three it's time for your eye on tech [noise]\nIncluding of course smartphones and watch it driving isn't alone all over the major carriers are working on higher speed five gee or fifth generation networks that are provide faster and more reliable service at home and businesses and institutions and of course\nWhile we're on the move Larry Magid CBS News [noise]\n... to experience relief or muscle cramps ... used their works relief this fast acting film has proven to prevent and relief footed leg cramps gift or works relief\nToday and the pain relief violent Walmart CBS Rite Aid at Walgreens pharmacies or their works relief dot com\nThe all new radio jak combat is available now\nIt's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political type gas covering the very latest news across the country and will provide listeners with unique and say you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I do\nRight now the cat was that two hundred and four but the NASDAQ his down six to check of your money in ten minutes\nSomebody's ... to forty five time for sports and ride really well we started sip on the line who lay it again last week and uh that we have to pour it out again it looks like one in free I don't think that's going to get anywhere full\nNo air and Aaron Rodgers and company is coming to town on Sunday and it was funny I was talking to reporters just you know when I came here this morning I mean it would only be the lions right that may be the patriots and the Packers before going into a bye week and then lose to the teams that they lost to of course talking about the jets\nAdult in the season the forty niners and the cowboys yesterday but that's what's on tapping alliance coming up Sunday it's Green Bay Packers and trying to rebound and that lost yesterday to the Dallas Cowboys map Patricia telling Detroit Lions that time that this is a tough one to swallow them\nYeah football's a hard game you know it's a lot of go through a lot of emotions that took him down but you can stay focused you can stay in the moment and uh you got to go out and execute and that's that's the way the game is that is was Japan line in this game between winning and losing the teams are so\nCompetitive we matched every single week and um you know you gotta you gotta just go out and if you every minute every second of the game which way to communicate\nWait for me to come to a close ally Broncos playing host of the chiefs on Monday Night football you can hear the game of Ninety seven when the tickets starting at seven thirty\nMajor league baseball has two game one sixty three zone today cubs and brewers currently going at it and you know central ... game tied at one in the six from Wrigley Field the Rockies and dad are set to meet you know ... first pitch just after four\nThe way the teams that lose today's game will meeting tomorrow night's wild card game\nAnother week another word from Michigan chase ... has been in the Big Ten school defensive player of the week for his effort in nine tackles an attack against north western will ... an ounce or game time for October thirteenth match with Wisconsin from the big house they'll play underneath the lights at seven thirty\nAnd don't forget limits on Michigan football coach them horrible right here on W. B. J. starting at seven o'clock\nWith sports Fifteen at forty five passed each hour I'm Ryan ... W W J news radio nine fifty\nSports sponsored by the Detroit regional chamber of like a traffic and whether or not\nJane news radio nine fifty sports sponsored by the Detroit regional chamber look at traffic and whether or not\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council ...\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves wiping solution and more consumers energy part of a small business bulls covering Michigan businesses save energy and money was consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] W. W. J. new side\nIs to forty eight time for trafficking whether on the AIDS and taking a capital what are you watching what some slow down to your book starting with a couple of accidents in this report sponsored by the carpet guys\nSo we still have along the Jeffries westbound locally that might not be six the ramp to him thirty nine to Southfield blocked by an accident also through the ... watching a couple of problems on I Seventy five first\nNorth on I find the exit to North lined the right shoulder every block\nDowntown in an accident on south about Seventy five blocking that ramp to you I Seventy five the Fisher instilled this Jack knife semi this along with finding protein at the guy to Seventy five I think\nRight we're watching here this jak semi broke this long list on him fourteen FBI two Seventy five I think the interchange it had been just a minimal delay there but now all lanes or block\nAnd drivers are being forced to exit I two Seventy five\nAside from that I think the Jeffries eastbound after him fourteen accident as now on that right shoulder another ... diligent here north but I have and they find the exit to North line still blocked and if you work life were roadwork ... Belleville rover the right lane is closed but that should reopen here within the next few minutes\nFrom the motor group twenty four hour traffic center Tracy McCaskill WWE Jane news radio nine fifty where the accuweather forecast\nRain tapering off miles a day with a couple of ... hours at a thunderstorm low fifty nine buddy warmer tomorrow with a show or the high Seventy four body warm Wednesday with a high of eighty right now at Detroit metro airport fifty seven degrees at two fifty nine\nWhy should we never saw a news radio nine fifty you know the afternoon I'm ... and I'm from Dallas\nPresident Trump authorizes an expansion of the FBI investigation into sexual misconduct allegations against back now that I'm Alive update on the way from CBS\nMisconduct caring for a local judge will have detailed\nVersus just in a third person has now died following a house fire in East Point our standard ... CBS News coverage of the world and then [noise]\nDot com\nIt's three o'clock\nCBS News on the hour sponsored by getting loans\nI'm Jim shown to be President Trump says it's up to the Senate desert the ground rules for the FBI investigation of his Supreme Court nominee Brett Kavanaugh\nMy White House will do whatever the senators want I'm open to whatever they want the one thing I Want to speed\nAnd the president has today authorized the FBI to expand its probe into cabin on correspond to bill recall\nThe letter from Democrats who sit on the Judiciary Committee says that they are concerned that the FBI investigation into Kavanaugh will be too limited in scope\nThey say that in addition to the allegations by Christine Blasey Ford to other allegations of misconduct by Deborah Ramirez and Julie sweating it should also be investigated letter even goes on to list the witnesses that the FBI should speak with including Ford Ramirez sweat neck and Kavanaugh's friend mark judge they'll write talk CBS News Washington\nCanada's prime minister Justin Trudeau Haley know rework the map to as a victory for his country\nIt's an agreement that will be profoundly beneficial for our economy for Canadian family\nFamily members and first responders correspondence ...\nFor the families of the victims this anniversary is bringing back memories of unspeakable loss I miss my daughter so much I miss my daughter and mentally person Debbie Davis joined other families taking part in an early morning sunrise remember there were\nPrayers also moving rendition of songs but it's through their hearts like you'll never walk alone\nOr this evening one of the ultimate tribute to this gambling neck of the keys along the Vegas strip will go door for them and CBS mostly in Bali, Indonesia [noise]\nSearch and rescue and recovery operations continue in areas hard hit by friday seven point five magnitude earthquake and the resulting\nShould nominate the death toll has topped eight hundred forty and thousands of been left homeless corresponded been tracing\nA lack of heavy machinery and these coastal areas is slowing efforts to remove rubble and potentially save lives meanwhile twelve hundred prisoners have escaped from three different prisons that were rocked by this earthquake authorities are so focused on the search and rescue operation they don't have time to try to track them down and\nMany people are suffering from a lack of food and water as well as medical supplies on Wall street the dollars up to Nineteen the NASDAQ has gained three this is CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender MLS number thirty thirty\n[noise] washing ever saw on Detroit's number one\nForty or fifty holding and holding a\nGood afternoon thanks for joining us on Monday October the first time director Roman\nAnd I broke a gallon for W. W. J. news radio nine fifty\nA mild night ... thunderstorm laid the complete accuweather forecast coming up\nRight now cloudy fifty six degrees at Detroit metro airport W. W. J. news time three uh three\nNow you buy with regard windows\nWere watching a big problem along a portion of I two Seventy five this afternoon W. W. J. newsworthy United fifties Katie joining us live and local with the latest from the twenty four hour traffic setter Katie\nIn Livonia and fourteen west sound right at the two Seventy five I Ninety six interchange all lanes are blocked with a Jack knife semi traffic is being forced on to I two Seventy five traffic is backed up\nTo affirm before Newberg on the west bound Jeffries your next updates at three awaiting the twenty four hour traffic center Katie for WWE Jane these radio nine fifty\nYou this afternoon a third person has now died from a house fire over the weekend in East Point W. W. J. news radio nine fifty sander McNeil live and local with a story Sandra\nBrooke Thirteen year old Myra dose of that because the only member of her family to escape the fire that killed her parents\nSteve and just mean a fire officials say the fire that tore through the home on the street near ... appears to have an accidental it was neighbors called police when they saw the flames my had been in critical condition at children's hospital since that fire on Saturday today she died of her injuries tens of thousands of dollars have already been raised in a gold fund me account\nAnd the results of the family reporting might seem to me Neal W. W. J. news radio nine fifty\nOfficer and two paramedics have been charged in connection with the death of a man who suffered convulsions a local jail but was not taken to the hospital William Marshall died from cocaine toxicity of the west and police lockup in December\nWake County prosecutor Kim worthy says our general Buckley insisted that Marshall remain in jail and the paramedics Matt\n... a disco law and Leah Maynard where president\nA ... and Leah Maynard where president\nTo offer them today with two ... one of involuntary manslaughter negative perform a legal duty which they Fifteen year ... we are charging each of them with a second of misconduct in office which is a five you're falling\nIn a separate case no charges will be filed and the death of a man at any course police jail in June of twenty Seventeen\nAs you heard on CBS News the new trade deals with the U.S Mexico and Canada could be good news for American workers according to one business expert\nDr Sheila run as distinguished professor of management at last college tells W. W. J. the new deal once ratified and put into effect by twenty twenty calls for more domestic labor and content in the auto industry\nA car or truck has to have Seventy five percent of the content made\nIn Canada Mexico or the U.S and that's larger than the current laughter which has about sixty two and a half percent that is a real big boost for\nUs worker ... cautions that will depend whether auto companies can't afford to work under the new provision that still need approval from all three countries\nWill not a good day to break down and metro Detroit freeways especially now that the MTA courtesy vans were pulled from service in a contractor dispute and ducks Jeff ... says the end of their contract with emergency road response ask them to stay on until the new contractor came on line at the end of January\n... current under decided they were just going to end the service today we're open talks with regard to service in metro but we're going to show people that will continue to monitor the freeways with the cameras and tried to alert law enforcement\nQuestions were earlier raised over emergency road possible connection to the Detroit towing scandal the grandson says that had no bearing on the decision to change contractors\nOn bell aisle and now there are major renovation project is underway WW Jane is fifty John ... joins us live and local with more good afternoon John\nHi broke our listeners may recall that it was twenty Seventeen that the DEA and are from the state completed a structural engineering study of eight of the most prominent buildings here on the island and it was determined\nThat portions of the twenties steel truss says that support the conservatory do notice appalled house needed replacement due to rust will that work started today this\nProject I'm going to be at one point nine million dollar investment to do the structure of Paris that\nPart um state parks department was able to provide nine hundred thousand dollars of capital outlay money from the parks budget and then we're partnering with the ... in junior foundation there I'm donating a million dollar grant\nThat's Amanda tread well with the DNR who says work on this particular restoration project is expected to run through next April from ...\nJohn Hua W. W. J. news radio nine fifty W. W. J. news time through wage time for driving and whether together every ten minutes on the age from the motive of traffic center brought you this hour by Motor City many\nKatie a big problem at one of our major interchange it yes in Livonia all lean to block the jak next semis and fourteen west bound right at the two Seventy five I Ninety six interchange drivers are going to be forced off\nAnd I to Seventy five looking through the Tripoli jam cams traffic savvy in and around the interchange new slow coming from I Ninety six west bound the Jeffries\nAt the van on I Ninety six the Jeffries freeway he's found after and fourteen got an accident on your right children not much of a delayed behind it also a crash on the Seventy five north on exits north line\nIt's on the right shoulder of that Rand enough you see a problem on the road to give us a call in the WWE Jacobson line at two forty forty three six W. W. J. in the out of them motivated\nSoldier of that ran up you see a problem on the road to give us a call in the WWE Jacobson line at two forty forty three six WWE Jay in the downloading of twenty four hour traffic center Katie for WWE Jane is ready of nine fifty\nRoad between fourteen and Eighteen mile roads road work does black to write lanes in each direction that's going to go through November ... twenty four hour traffic center Katie for WWE Jane is ready to nine fifty\nIn traffic and whether together sponsored by hiring them dot\nCom now the accuweather forecasts from their family heating cooling and electrical weather center with meteorologists Dave Bowers\nGreg broker we're looking at a cloudy skies here tonight to the road we buy out a couple of showers in those under storm after midnight law about fifty seven and do this will be a bit of rain tomorrow morning otherwise it's mostly cloudy but a warmer day actually some twenty degrees warmer we've got the Seventy forty after the clouds\nA warmer day actually has some twenty degrees warmer we've got the Seventy forty after the clouds the bar and I both fifty six and Wednesday or getting close to eighty despite a lot of clouds Thursday looks like a spotty morning shower and then the breaks the son of the afternoon a high Seventy five and a couple of showers friday high sixty eight\nThis is accuweather ... hours on do W. J. news radio nine fifty and right now fifty four degrees in West landed it's fifty two in class and\nThe all new radio jak combat is available now it's a totally new experienced it was listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nOn news radio nine afternoon on red film\nAnd I'm from ... a big mess along and fourteen to ... completely closed at the IT Seventy five I Ninety interchange due to an overturn semi truck drivers have to avoid the area\nPresident Trump says he has an open mind when it comes to the FBI investigation into the sexual misconduct claims against Supreme Court nominee Brett Kavanaugh\nI Want to be comprehensive I actually think it's a good thing for judge Kavanaugh I think it's actually a good thing not a bad thing I think it's a good thing now with that being said I'd like it to go quickly and the reason I'd like to go quickly very simple so simple because it's unfair to him at this point\nVery latest in a live up to date from CBS News at three thirty one\nToday the first day of the hearing for a local judge over allegations she had an affair with a police officer who is the lead investigator on a murder case in her courtroom W. W. J. legal analyst Charlie Lincoln reports\nLet me see county district judge Theresa rather than in a hearing to determine if multiple ethical violations would want removal from the bench\nThe judge said that the allegations must be taken income tax but Jared ... said his father was convicted of first degree murder despite the fact that the judge failed to disclose that she was having an affair with a lead police officer in the case\nOf mirrors or you know to see that justice takes place and uh you know she had a lot of wrong of us going in her courtroom uh especially in my father's case in your own ... and if they find charges against her or she is qualified and take it off the bat and that shows a hope for my father and his case and getting every trial\nThis disciplinary hearings could last two weeks in the bone yet Charlie line to W. W. J. news radio nine fifty\nW. W. J. new century twenty two it's time for the Feldman reports\nSome families the worst of times can get even worse because somebody bad is watching I'm Marie Feldman with the silver report on WW Jay news radio nine fifty\nA. R. P. says be careful when a loved one dies sad as it seems scam artist are out there to rip off grieving families\nThey know the more information you put in the obituary the more information scam artist can see and use\nA A R P cautions that crooks can often purchase or figure out a person's Social Security number to open a credit card account with their name and apply for loans and even file a tax return to collect refunds the first five digits of a Social Security number can be linked to a time in a place of birth\nThey say eight hundred thousand people a year or targeted after they die because nobody checking their credit reports\nAlso as sick as it seems some recall attempt a burglar rise homes of the deceased since the obituary often gives the place and the time of the funeral they know the family won't be home they just cracked the case like this in Massachusetts if possible have a friend or a neighbor keep an eye on the house with the film\nW W a news time three twenty three [noise]\nWell ... they give away on WWE Jane is we do and I took the end this hour is key word is paper takes paper PA P. E. R. to seven to eight eight one for your chance to win one thousand dollars message and data rates apply and remember don't text and drive\nWell rally on the markets today but ah we've turned mix this hour your\nMoney next W. W. J. new son three twenty four\nThe all new radio job job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll save your favorite stations and\nOthers do you based on your list of news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political part gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right so Dr and download today on radio dot com and I do\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nIt stopped ... a message ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nW. J. news time he was\nFive time for business suburban laboratory business that\nBad right now the Dow is that two hundred and eight to five hundred twelve and the NASDAQ down one police of renting has our Bloomberg has this report\nGreg and broke investors seemed relieved with a deal that's been reached between Tesla founder Iran must and the S. E. C. mosque will stay on as CEO but we'll be removed as chairman of the electric carmaker the settlement comes after mosques August tweet that he had secured funding to take Tesla private the stock up Seventeen percent\nA group of leading economists is warning the U.S economy will tumble into a recession in two years Bloomberg's any doubt you'd ice has more\nAmerica's economy is flying high just now about two thirds of business economists expect the recession by lake twenty twenty beside us trade policy is the greatest risk followed by rising interest rates in a potential plunge in the stock market\nA source tells Bloomberg twenty first century Fox plans to release a PG Thirteen version of dead pool too in theaters in time for the Christmas Holiday it's a ... a few extra dollars out of one of the company's most popular film franchises\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nAnd well I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting of a\nI'm going to return the kayak\nHow about a factor in\nHere nature had discovered the forest that or to find a neighborhood park or green space near you ... the U.S Forest Service\nThe all new radio job job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access to radio stations you love you know will save your favorite stations and\nOthers do you based on you're listening to news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nWe extensive damage north I'm In Rome used radio ninth busy they're definitely\nA tornado poorly when Seventy cars banning trailer spinning we only speak to our\nWinter you're from a power sharing\nThe road construction project will be firing back up at that three weeks lockout has finally come to an end\nOlder you don't need a GED [noise]\nTime twenty eight have for traffic and whether together and Katie a bit of good news yes\nIn the voting the Jack knife semi not blocking all lanes now is just luck in the left lane and shoulder them fourteen west bound right after that\nThe eye to Seventy five I Ninety six interchange looking through the ... slow coming from the west bound Jeffries before the van also slow coming from South on I two Seventy five\nI two Seventy five north soundtrack but you can exit six miles west bound to get around this and take that Sheldon south to get back to and fourteen westbound on I Ninety six the Jeffries freeway eastbound after and fourteen\nDemocrats and you're right shoulder also an accident underwrite chilled right somebody five Northam eleven mile and we're watching Iraq on the thirty five north on exits north minds on the right shoulder of that accident\nAnd we got to report it crashed on Ryan road right before Eighteen mile road that's Ryan road north bound in Sterling Heights and it's like you know left lane and tips there's mark and John called in about that in the idol downloaded give twenty four hour traffic center Katie for W. W. J. news radio like fifty\nGot a record and the right shoulder on the ice Seventy five north on exit to North mine also in Sterling Heights I reported crafts on Ryan road north bound before Eighteen mile road like you know left lane and reports of traffic lights not working correctly in St Clair shores on ten mile road\nAt the Ninety four eastbound exit ramp\nFive dollar game day pitchers cocktails cheeseburgers and brats when football's on you have to be a buffalo wild wings prices and participation may vary in the ... twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nAnd now we check in with accuweather meteorologists have hours and Dave uh pretty cloudy out there but it looks like the rain May of tapered off of that\nYeah the at the moment to Brooke or the Reno would we have on a ... for the raiders off to our north\nOr so and I think we're probably going to get through most of the evening or quietly uh we do have a different kind of hung up on our back yard which is why we're in the mid fifties the moment though the temperature tonight will actually be going up instead of down\nA will probably be up around sixty two sixty three degrees by daybreak\nAh but I was this war from those who have northward through the area but it will trigger a couple of showers or the thunderstorm late tonight or probably a drive through the evening that into tomorrow it's much warmer were calling for Seventy four degrees little bit of rain in the morning and then those clouds the rest of the day stays cloudy tomorrow night and Wednesday but it's pretty mild\nA low of fifty six and a high winds they Seventy nine degrees\nThursday It's MORNING shower and then those breaks the sun's still are getting a well above normal high about Seventy five and cloudy on friday a couple of showers and the highest sixty eight\nThat's what we'll do we're in a loaded for these fifty to a Pontiac to the port city airport fifty six of metro airport with clouds in the northeast would at seven so that he wasn't really ... to stave Bowers onto W. J. news radio by fifty\nAnd this is where you hear trafficking whether together every ten minutes on the eight year next update coming up at three forty eight those Google Maps are getting smarter will tell you about that in the middle\nAged Sean Spicer and every mid term election since the civil war the president's party of London average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure to be careful getting out of a\nI'm going to return the kayak\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n[noise] hey Sean Spicer in every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting as a\nI'm going to return the kayak\nHow about a taxi\nShort fat from your neighborhood here in nature had to find ... ... us service\nOn the AIDS and breaking news first came up to date on the road\nNews radio nine fifty you're done all the\nTime we forty three Google adding real time information to its maps Google's Genevieve park says we updated that helps to take the unpredictability out of your commute\nNationwide we saw that it can be a kid I think the personal longer than you think they will be when you get in your car\nBecause of accidents construction or weather delays the new commuter to objects you ride to and from work in real time it'd vices alternate routes if there's a delay it also integrates with spotter fondue to music Google Play an apple to help soothe the\nCommuter nerves Jody Steel for CBS News Pittsburgh\nWWE news time to forty three and it's time for just Gilbert car chronicles sponsored by ice in front of the Paris ...\nMay not be exhibiting of the terrorists auto show but they're making a lot of news on this side\nOf the Atlantic this is Jeff Gilbert with the core chronicles today from Paris board not saying much about new joint ventures with VW and India's Mahindra but speaking in Dearborn last week CEO billboard says that's only part of their restructuring\nYou know we don't ever live on a partner to fix things for us we have to fix our own in a way to get her own house in order for\nBut expect to hear more about the partnerships soon\nThere's no question that partnership or can help with capital intensity and things like that so uh is you know we've we've uh announcer Mahendra partnership a VW partnership and as we think about new business model going forward as a sexual the up and down the more partners for\nNot commenting on reports or could be as many as twenty four thousand jobs cuts here in Europe but the company has said that most of its restructuring will take place over ... is what the chronicle\nToday from Paris I'm jumped Gilbert W. W. J. he's really going to do\nThe all new radio dot map is available now it's a totally new experienced in towards listening at your finger\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\nHey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and eye to\nEye we're looking at a mixed market will take\nForty five ... for for what's happening right before I got\nTo the cowboys yesterday in Dallas ... Sunday showdown with the Packers from Ford Field week for meanwhile comes to a close to ... rock was playing host to the chief somebody like football you can hear the game of nutty several on the ticket starting at seven thirty\nThere's two game one sixty three is on this afternoon and baseball cubs and brewer squaring off in the you know central tie breaker Milwaukee though on top three to one this one now in the bottom of the eighth any from Wrigley Field the Rockies and Dodgers set to meet and you know what type break or just about Fifteen minutes\nBy the way the teams that lose these games are meeting tomorrow night's wild card match up in the game time has been an ounce for Michigan's October thirteenth game was Wisconsin for the big house deployed underneath the lights at seven thirty\nShades and one of its also collect you know war today he was saying the victims co defensive player of the week with sports Fifteen and forty five passed each hour I'm Ryan ... W W J news radio nine fifty traffic and whether in one minute\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne finished high school diploma\nI cannot have done it alone especially the future it's really ...\nNo one can implement alone if you were thinking of managing your high school diploma you have now signed free adult education and your you finish your diploma dot org brand name of the dollar general leaders and Asian and the ...\nWould you be Jay do scifri forty eight five for trafficking whether together I'm here\nIn Katy the crashes clear but it is still a slow them well this is Jack knife semi still black port partially blocking the left lane it it is black and the left shoulder enforcing was found that I two Seventy five Ninety six interchange\nTraffic is slower from Farmington wrote coming from the Ninety six Jeffries a freeway west bound and you're slow in and around the interchange traffic is sponsored by UPS door\nJane is ready of nine fifty the accuweather forecasting\nPowers that funny mild this evening with a couple of the showers anti under storm later on\nLow fifty nine cloudy warmer tomorrow showers in the morning at a high Seventy four and body warm Wednesday with high of eight\nFifty six AT Metro now at three fifty nine\nTo ... watch never diverse sneezes radio nine busy being the only good afternoon\nI'm Greg moment and I broke Alan ... an expanded FBI investigation into sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh I Want\nThem to do a very comprehensive\nCBS News they'll have a ... plus ... sergeant and two EMTs facing manslaughter charges and the death of an inmate the two EMTs\nThey ... him medical treatment I'm thinking Thomas and concession on local freeways causing send people to quit their jobs are Jason Scott will have a library learn\nDot com it's four o'clock [noise]\nCBS News on the hour sponsored by capital one\nI'm Jim shouldn't of any President Trump is authorized the FBI to expand its probe into the sex allegations against Supreme Court nominee even as he was defending Brett Kavanaugh again in today's news conference this is our seventh\nOf the man\nWho has really you know you look at his life until this happened what a what a chain she's gone through what his family's gone through the\nTrauma more from correspondent del ray cook a Justice Department official tells CBS News the White House did authorize the FBI to expand the background check on Kavanaugh to include anybody that it thinks is necessary to help but claims of sexual misconduct against the Supreme Court nominee\nAlthough they can expand the investigation that official says the seven day timeline still apply President Trump\nSays he doesn't know if Congress will ratify his reward North American free trade agreement St politics could get in the way but he's getting thumbs up from Canada and Mexico on the deal\nThey need me invite in Mexico city in his Twitter account Mexico's president called the robot NAFTA deal a win win win in Mexican television interview hit chief negotiator recalled how impossible that future at ... at the beginning of the Trump Administration in the end he said\nAll me countries when because free trade will continue\nLas Vegas marking the anniversary of the concert shooting the left fifty eight people dead and hundreds injured\n[noise] hundreds attended a somber sunrise ceremony including governor Brian Sandoval remember\nThose who lost their lives and their families and friends who no longer have the blessings of their loved ones\nAnd they were prayers songs speeches and fifty a dubs were released at that ceremony one of several memorials and events marking the anniversary\nA manhunt is underway in Tennessee for a murder suspect that police believe shot and killed another person this morning in an attempt to hijack a truck it'd be three year old Kirby Wallace was originally wanted in an attack last week that let the woman dead in her husband's seriously injured steward county sheriff Frankie gray\nConsidered to be dangerous with a group that the other day when we were looking for him he is accused of a one murder and possibly the second\nHijack truck was found crash this morning they believe Wallace is now on foot\nA man taking a selfie alumni flooded Potomac River slipped and fell into the great falls in somehow survive pulled from the fast moving water by several bystanders flood warnings remain in effect for the area of the national Park Service has closed off several areas along the river due to hazardous conditions on Wall street the end\nWarnings remain in effect for the area of the national Park Service has closed off several areas along the river due to hazardous conditions on Wall street the end of the day gaining a hundred and Ninety nine points as ... on the CBS News\nCapital one quick silver card or an unlimited one point five percent cash back on every purchase everywhere that's all there is to it just unlimited one point five percent cash back on everything you buy what's in your wallet\n[noise] washing never saw on Detroit's number one\nForty or fifty only going to be a\nGood afternoon thanks for joining us on Monday October the first time ...\nAnd I'm broke Allen for W. W. J. news radio nine fifty\nMitt arraigned tomorrow morning otherwise the mostly cloudy warm day the complete accuweather poor gas coming up\nRight now cloudy and fifty nine degrees at Detroit city airports W. W. J. news time for all three\nIsn't up to an earlier story on W. W. J. a third person oh they're the result of a house fire over the weekend in East Point\nFire officials say the flames from the fire the tour through the home on Nevada street near toll for on Saturday were powerful it was the neighbors who called nine one one Thirteen year old mia ... was the only member of her family able to escape the fire that killed her parents Stevens has made\nMe a who had been in critical condition a children's hospital died today from her injuries tens of thousands of dollars have already been raised in a goal funding they account\nFor the right dose civic family\nMeantime an investigation after a large house fire in Hamtramck this morning when Detroit firefighters put out the flames at the home on ... street near Joseph Campo and the Davison deputy fire commissioner David for now says they discovered ... bodies upstairs this\nParticular point uh we we we don't know if the if the victims are male or female or and we don't know all the circumstances but it is under investigation\nFor now says a firefighter was injured after falling through the second floor he was taken to Detroit receiving but is expected to be OK\nCharges announced today in in ... death case on a Westland W. W. J. newsworthy going fifties Vicki Thomas with the story\nWayne County prosecutor Ken worthy charging less land sergeant Ronald ... EMTs Matt deco so law and Liam Maynard with involuntary manslaughter and misconduct in office\nThat charges stem from the death of William Marshall last December he had been in the lock up after being arrested for cocaine marijuana possession worthy says Marshall had convulsions and itself\nFor an hour and a half\nEven though she says he was dragged out of the cell by the paramedics no medical attention was ever rendered\nSergeant Buckley did not send Marshall to the hospital we left them in the jail without marshals on with us from higher period of time the two EMTs they deny him medical treatment vantage him at the jail after he requested assistant\nVicki comments W. W. J. news radio nine fifty\nWetland police chief justice did Ruth ... says the officer involved from Maine suspended pending investigation into the death of William Marshall after the investigation judge ... says quote we will take the necessary discipline up to and including termination of the officer he offered his apologies to the Marshall family\nAnd that's courtesy bans off metro Detroit freeways still further noticed the contractor emergency road response pulled them off the road at midnight when their contract expired even though ... asked them to stay on 'til the end of January with a new contract or starts patrols\nSpokesperson Jeff grandson says it's not clear when impact this will have on the miners in trouble\nThe federal government funding these kinds of things specifically to try to eliminate congestion help eliminate the closing backups that occur especially heavy congestion science in the morning and it was it\nJust a little closer backups that occur especially during times in the morning and it could have an impact as much and we just hope that we can get this resolved\nGrasses that will keep a closer eye for breakdowns through their freeway cams on alert police to help\nW. W. J. news time for a six of those surveyed twenty three percent of metro Detroit or say they've left a job due to bad commute W. W. J. news radio niceties Jason Scott joining us alive and local with the details Jason ...\nHow 'bout that twenty three percent that figure you mentioned isn't only based on major construction project correct\nAnd it doesn't fly all factors for people who are doing a car pool that includes people who have public transportation that they use to get to work\nDetailing the numbers is and shoot a staffing executive with human resources from Robert have\nEleven percent of people that that their company is not allowed to work from home which obviously would cut the kidney without all of the way eleven percent also said their companies have started to pay for parking so if that was something you know on top of the commute that may have that as a stress factor for them it's no longer now compared\nTo other large driving markets the Detroit area is on par with twenty three percent of commuters saying they've left the job over driving reporting lived Jason Scott W. W. J. news radio nine fifty W W Jane who's done\nFor a waist size professor whether together every ten minutes on the aid from the motor traffic center brought to this hour by portion of the motor city\nAnd let's check in with Katie and Katie has the driving in fourteen\n... Jack knife semi still blocking a left leaning shoulder and fourteen west bound FBI two Seventy five I Ninety six interchange looking through the ... dam camps who are slower coming from Newberg on I Ninety six the Jeffries westbound now the ... five west bound ramp too I two Seventy five southbound closed Michigan State of\nMichigan said please have confirmed as a roll over semi that needs a fuel transfer and others could possibly be closed until tomorrow morning we'll let you know got an accident and I Ninety six the Jeffries freeway east on right after and fourteen on your right shoulder downtown a crash on the lodge freeway north on ramp to the Davison freeway eastbound\nIraq on the Seventy five north on access to\nNorth line now that it's right on the right shoulder of that ramp and six Ninety six east on right before Van Dyke\nTips or dance or there was a construction barrel in your center lane\nAnd in Sterling Heights still watching that reported crashes slowing down Ryan road north bound before Eighteen mile road block and you're left lane in the idol downloaded twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nTraffic is sponsored by British stone Firestone in Livonia and fourteen was found that the two Seventy five I Ninety six interchange jak next semi blocking the left lane and shoulder\nGot a wreck on the Southfield southbound ramp from out of Dr downtown a crash on the lodge freeway north on ramp to the Davison freeway eastbound also wreck on the Seventy five north on access to North line this one on the right filter that six Ninety six east on before Van Dyke\nAre reported tips or Dan called into the construction barrel rolling around in your center lane now it's time for the electrical workers local fifty eight construction alert\nI Seventy five north on between simply road and north line construction block the left lane bridge stone engineered drive car tires\nTakes a puncture and keeps running fifty miles after a flat with Dr car tires or you can get to safety on a flight instead of being stranded on the side of the road so rest easy and the Brits don't drive guard tires give you peace on the road in the adult downloaded give twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nBack your weather forecast now family heating cooling electrical weather center and the power so\nGreg Brooklyn we ever fertile system which is hung up near the Ohio line now this is actually going to drift northward a little bit during the night a it's a warm front so temperatures will actually be study are slowly rising will probably be in the low sixties of daybreak they had a couple of showers and above the storm expected especially after midnight\nLittle bit of rain for the morning rush otherwise it's mostly Guardia there need much warmer I about Seventy four degrees of all back into the fifties the tomorrow night or Wednesday mostly quality warmers still but it's a dry de la high about Seventy darn\nThursday also getting into the seventies or we're just a spotty morning shower could even see some breaks us on Thursday Afternoon they're brought him back to a disgrace guys\nThey're getting into the seventies or we're just a spotty morning shower could even see some breaks loose on Thursday Afternoon and brought him back to just ... guys and a couple of showers would live sixty eight this is hockey with Rudy Rob Steve Bowers on WGN news radio nine fifty\nIt's cloudy and fifty seven in ... for ... fifty each right\nWhere do you do\nGood afternoon I'm reading them ... year old ... die at your house fire over the weekend she was the only member of her family to escape and they'll send me paint has already raised thousands of dollars for loved ones will have more details on the bottom of the hour\nThat'd be I investigation into the sexual assault claims against Supreme Court nominee Brett Kavanaugh now underway they don't have much time it will only last a week at the request of the Senate majority committee joining us live to talk more about it now Daniel Robert C currently serves as the police chief in Franklin one cell the job of special agent in charge\nOf the FBI in Detroit thanks for being with us today a Daniel so what what kinds of what kinds of things will the FBI be looking for here and certainly a week less than a week no he's not much time is it to find out something\nSo you know that it's not unreasonable to get it done in a week what they will do is they will pull agents off of other case work and get it done within the timeframe that's been a dictated by the president so they'll\nThey'll get it done you know there's there's fourteen thousand special agents in the FBI spread across the country so there'll be sending leads out to all of those offices that are affected that have individuals that need to be interviewed those party goers are other\nOther witnesses that ah the may have some information about this case and and they will certainly give it the highest priority\nHow crucial is it that someone like Mark judge cooperates\n[laughter] well in terms of the background investigation and that's all this is for the FBI it's reopening of a background investigation and so they're not going to make any conclusions when they get done\nWhat they're going to do is they're going to interview all of these folks and I assume Mr judge would be high on their list based on on the testimony before before the Senate committee\nA what they'll do is they'll ask him a number of questions and record that in a typical FBI narrative format that report is called an F. D. three oh two and then they'll ... they'll summarized their findings and report that to the to the White House who is the one who requested the investigation so they're not going to be making any\nSort of judgment as to whether there's criminality or not they're going to allow the committee and the White House to do that\nTalking with Daniel Roberts uh currently police chief of Franklin former special agent for the FBI\nSo there's been some conversation a Daniel around drinking and whether or not that could have been an issue for the Supreme Court nominee now is that something that the FBI agents would look into whether or not someone had or has a drinking problem whether they may have suffered blackout something like\nYeah absolutely uh if it is or something that would have risen to a problem for that person to function as a job that the difference is this is quite a number of years ago but\nBecause most people in their position are are in touch with or have access to the most sensitive information in the United states government it's very important to know about their their problems are medical issues or other concerns in the past and that would include drinking problems if it is in fact a problem and that's\nAnd that's one of the things that the witnesses that they interview should be able to give a good light on that aspect and in terms of does that actually lived with them and worked with closely with them and things like that they should be able to come up with a uh\nGood light on that aspect in terms of those that actually lived with him and worked with closely with them and things like that there should be able to come up with a a a good idea as to whether or not there is a problem there\nSo you know you didn't mention medical problems so does come into play with issues like this\nWhen normally what you're doing if you have an applicant for a sensitive position like this they provide waivers to the FBI unto others saying that basically you can look at everything\nIt's kind of the requirement of getting a top secret like for example during my twenty five years with the FBI I over the top secret clearance which meant basically my life was an open book\nAnd that is because the the national security aspects of that job a trope any other concerns that you might have so um yeah I Would say that he probably sign a waiver saying it's OK to delve into his history a and get all of the details of that to see if there's any problems or\nThanks very much Daniel Daniel Roberts currently police chief or Franklin former FBI special agent we just got word today by the way that the Senate majority leader Mitch McConnell says the Senate will vote on the Capitol nomination this week and it is [noise]\nTime for the ... they give away on W. W. J. news radio nine fifty this hour is key word is gift tax gift G. I. S. T. to seven to eight one for your chance to win win thousand dollars messaging data rates apply and remember do not text and drive\nFor twenty five time for business suburban Cadillac of Troy business desk sponsored by Michigan schools in government credit union\nAnd at least have renting has our Bloomberg Business report and I'll leave so we kind of saw rally today\nWe did ... particularly early in the session and then it kind of fizzled out although the Dow in essence he finished higher and the S. and P. during the day did touch a fresh record here's where we finish at the close the Dow up one hundred Ninety three points the NASDAQ down nine points for about a tenth of a percent\nAnd the S. and P. upper eleven to twenty four twenty five the previous record high twenty nine thirty one so we're still within a few points of that high water mark the Bloomberg W. W. J. Detroit index lower by more than half a percent President Trump is celebrating the trade deal with Canada and Mexico that will replace NAFTA\nFainted vindicate his strategy of threatening tariffs on trade partners he's predicting the agreement will easily pass Congress yuan mosque can stay CEO at tests flood wall street likes that\nA settlement with the S. E. C. over his tweets about taking the company private does say he's not allowed to be chairman for at least three years but he can keep that CEO job Tesla shares rallied Seventeen percent to finish above three hundred ten dollars\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nSocks and local interest sponsored by plant ran wealth management I GM gained forty six cents close that thirty four dollars and Thirteen cents American Axle last six cents they close at Seventeen dollars and thirty nine than\nThe all new radio jog John that is available now\nIt's a totally new experience was listening at your fingertips we made it easier than ever to access to radio stations you love you know we'll see your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nAnywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's gonna be All right and subscribe and download today on radio dot com and I to\nThey're kind of water main break on ... road north on between Ninety six and ... it's affecting all lanes and tips to Brian called that and making your corporate holiday party different this year book it now on Detroit princess riverboat\nThey're heated and close you can celebrate any party political fundraiser or birthday all year wrong all year long\nCruise with the with them the Saturday or Sunday for lunch or dinner called eight seven Seventy TBO a tea or Detroit princess dot com in the downloading of twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nNow we check in with accuweather meteorologists games hours and days have a little chilly and cloudy and rainy but that's all going to change right\nWhere and certainly will broke yeah we're temperatures going to be some twenty degrees higher tomorrow or we only made it to the mid fifties here today in fact the the temperatures are actually going to be rising through the night\nSo it's a warm front that's actually going to be lifting northward and that's also what's responsible for the rain we've gotten the forecasts but are still quite at the moment the only shower activity on the ... the writer up around sagging all across the region\nOr so we get through the first half of the night I think a dry then I could see a shower to even a thunderstorm in the early morning and I like I said temperatures are there going anywhere they actually climate few degrees through the night\nAnd the bar we jump all the way to Seventy four degrees still cloudy and a little bit of rain during the morning or mostly cloudy but warm tomorrow night and Wednesday Wednesday we actually are close to eighty\nA Thursday there can be a spotty morning shower little sun adapt to do is to get to the mid seventies that's slightly cooler but cloudy again on friday with a couple of showers high sixty eight\nFifty two degrees of Pontiac fifty port city airport and fifty six of metro airport a lot of clouds in the north east would've nine this is I keep the ... the state of ours are do W. J. news radio and I took the\nAnd this is where you hear trafficking whether together every ten minutes on the eight year next update coming out that for forty eight\nGood news for Michigan drivers no more of those driver responsibility fees will explain\nThe all new radio jak combat is available now it's a totally new experience which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and downloaded and radio dot com and I\nWas the other on the AIDS and breaking news came up to date on the\nNewsworthy nine fifty\nEveryday news time for forty two today marks the end to those existing driver responsibility fees house speaker Tom Leonard says individuals' stripped of their licenses due to the fees can apply for reinstatement\nI can think of no better way to ensure that we are developing talent in our state than making certain that three hundred thousand people get their driver's license suspect now through the end of the year the state is waiving fees associated with reinstatement\nLeaving your job over a bad\nFilthy from Robert have shows twenty three percent of Detroit area workers have done just that\nWell thirty five percent of Detroit professionals reported that at our travel to and from the office has improved over the last five years Eighteen percent said that the trick has gotten worse\nAnd shoot business caffeine executive with Robert ...\nObviously the construction has been a little back to happy or more recently you know I think the last couple of years and years prior which has definitely slowed things down but there is also a lot of people working right now and I think that that's made a difference it also\nNationally Detroit is on par with other large cities which also have twenty two percent of drivers saying they've left a job over there Dr W. W. J. news time for forty three [noise]\nMonday the knife color right now it's euphoric three five six five o seven eight with a pair of tickets to the Detroit red brings home opener against the Columbus\nBlue jackets and little Caesar's arena this Thursday October poor\nAgain the number to call is too for eight three five six five zero seven eight good luck\nAnd we'll talk sports coming up in a minute W. W. J. new side for forty for\nThe all new radio job job that is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on you're listening to the news and information you rely on even when you are near radio you can take their station when you're on the go\nDownload the all new radio dot map on your smartphone\nOr anywhere\n[noise] hey Sean Spicer in every mid term election since the civil war the president's party lucked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I ...\nWell the markets are closed mixed today but again for the Dow\nFrom the Bloomberg Business report in ten minutes\nW. W. J. news time for forty five minutes time for sports and let's check in with mine really\nWell broke with a tiger season and the books manager Ron garden hire an Audi said one of the ticket today talking about the years that he was pretty impressed with the effort is team showed all year long with the young players will benefit from going through a season like this also talked about next year and wouldn't commit ... becoming the team's fulltime da when he returns from injury\nWhile it's still I mean what are your ... and to see how his daughter wants to do everything for groceries and really you know that that's what we don't have much much at first we resolve builders were you know other guys are probably you know part of the earth but it's like to tell you the\nStaying in major league baseball there's two game one sixty three than the schedule today one already in the books that was the brewers picking up a three to one victory over the cubs win you know central ground\n[noise]\n\n\nThat audio courtesy of ESPN cubs however not limited with the lost all the way the loser the Rockies and Dodgers matchup in the wild card game for Chicago tomorrow Colorado in LA battling it out to the west side of right now right now the game of scoreless in these third\nWild card game for Chicago tomorrow Colorado in LA battling it out to the west title right now right now that game of scoreless in the third\nEver fall into the cowboys yesterday in Dallas lie is trying to regroup and they turned their attention to Sunday's game with the Packers coach map Patricia speaking today said TJ laying a concussion protocol ... continue screaming day to day with his shoulder injury week for me welcome so close to the Bronx was playing host the chief someone like football you can hear it on ... on the ticket starting at seven thirty\nIn the game times but announcer Michigan's October thirteenth match up with Wisconsin the big house deploy underneath the lights at seven thirty\nWith sports Fifteen and forty five passed each hour I'm Ryan ... W W J news radio nine fifty\nSports sponsored by the Detroit regional chamber will hit the roads and check the forecast traffic and whether or not\nThe all new radio job job that is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and they're going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nListen and imagine\n[noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a text stay alive don't text and drive\nStopped ... unless it's ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nW. W. J. new signs for forty eight percent of your weather together on the eight\nAnd Katie a couple of problems out there and find me didn't hills also it's the landing\nYes in ... before Easter right up there here on street a reporter crashes blocking a left leaning shoulder and looking through the ... dam campus because of slow and heavy from after us twenty three in Farmington Hills the ... to ... to Seventy five southbound\nClose with a roll over semi that as a hazmat situation and this ramp could possibly be closed until tomorrow morning\nHills the anti west non ... Seventy five cell phone closed the rolled over semi that is now has met situation\nAnd will probably be closed until tomorrow morning got an accident on ... street in ... sucking your left lane and looking through the damn camps in the motor twenty four hour traffic center ... radio nine fifty\nI Am the actor weather forecasting viruses bloody mild Lucy being with a couple of ... hours in a thunderstorm late ... fifty nine cloudy warmer tomorrow with showers in the morning tapering by the afternoon at a high Seventy four eighty degrees on Wednesday fifty six good metro\n... never style or stops news radio nine fifty to ODU afternoon I'm\nRed Bowman and I broke a gallon although expected this week on Supreme Court nominee Brett Kavanaugh\nYou listen carefully must ... practically hear the sound of the Democrats moving the goalposts\nCBS News is next with alive update also ahead what will judge on my hot seat\nThat a lot of wrong before you know or ... percent my father's [noise] I'm Charlene ...\nBut first the hazmat situation in Farmington Hills will explains why bullies sports in Fifteen will have the latest on the uh gave one sixty three where you nice to\nRadio dot com\nIt's five o'clock\nIn the news on the hour we'll get lured presented by Sarah works relief\nGood Monday and how you know all the right how do we have we can expand its investigation into sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh she'd be as a Steve Dorsey is in Washington the White Houses now authorized the FBI do include anyone it deems relevant to sexual misconduct claims and its investigation\nI Want it to be comprehensive I actually think it's a good thing for judge Kevin ... I think it's actually a good thing not a bad thing I think it's a good thing now with that being said I'd like it to go quickly\nThe FBI use rushing to meet a seven day deadline to conclude its investigation which began last friday here's Republican Senator Jeff flake speaking to a crowd in Boston we certainly want the ...\nTo make sure that that happens Steve Dorsey CBS News Washington Senate majority leader Mitch McConnell says a vote on Kavanaugh will come this week with a much more in the story on tonight's CBS Evening news more reaction today to the new U.S Mexico Canada trade deal President Trump made the announcement this morning\nThe agreement will govern nearly one point two trillion and trade which makes it the biggest trade deal in the United states history\nCanadian Prime minister Justin Trudeau said they made it difficult compromises but said ultimately it's a good day for Canada\n\nSurvivors and family members of those killed in Las Vegas marks one year today since the worst mass shooting in modern us history it took fifty lives and injured hundreds more\nI miss my daughter so much I miss my daughter and then\nAt a sunrise ceremony Nevada governor Brian Sandoval paid tribute we cried\nWe grieved and we resolved to become Vegas strong in one year later we're Vegas stronger\nA flock of ... was released each bird burying a leg band with the name of one of the fifty eight people killed American James Alison and Japanese researcher to sue ... sure the Nobel Prize in medicine for their work which led to a breakthrough cancer treatments Allison says he never saw recognition for his work\nSome basic scientists to verify worked really impact people is just for ... for surface everybody's dream\nThe treatment hardest is the body's own immune system to attack tumor cells he was known as the Frank Sinatra of France\n... Charles as ... died for his romantic ballads as newer began his career as a songwriter for Edith piaf and\nWent on to have a blockbuster career that spanned ate decades Charles as no more was Ninety four years old on Wall street today the Dow closed up one Ninety three the NASDAQ was off nine the S. and P. rose ten points\nThis is CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works released today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never stops on Detroit's number one needs\nTo go now to only going to be a\nGood afternoon thanks for joining us on Monday it's the first of October I'm right bill\nAnd I'm Brooke ... W W J news radio nine fifty\nA mild night ... hours in the storm late to complete accuweather forecast coming up\nRight now cloudy fifty nine degrees at Detroit city airport W. W. J. news time five of the three regatta\nHas bad situation going on in Farmington Hills Michigan State police say crews are transferring the fuel from it overturned tanker before they can bring it up right it's happening on the west out in five ramp to south by two Seventy five rap expected to be closed for about twelve hours drivers asked to avoid the area\nThe search continues for suspects he's still a mini van from the driveway and Clinton township this morning with a four year old child still in the back seat police detective lieutenant Eric rank he tells W. W. J. the mother left the van unlike in running and she went to see her grandmother near fifty mile road and gross back the little girl in the back was dropped off at fourteen male aggression\nThat is a busy area is rush hour traffic and we're a reports that she was a had put herself in the roadway at one point was uh was in traffic so that could have been a been a really really terrible situation\nPolice now say the Chrysler town and country was found this afternoon anyone with information about the case should contact that Clinton township police\nNow say the Chrysler town in country was found this afternoon anyone with information about the case should contact the Clinton township police\nHeats up due to an earlier story on W. W. J. a third person now dead as a result of a house fire over the weekend in East Point\nPart officials say the flames from the fire the tour through the home of Nevada street near total for on Saturday were powerful\nIt was the neighbors who called nine one one Thirteen year old mia ... was the only member of her family able to escape the fire that killed her parents Steven judge made a mayor who had been in critical condition a children's hospital died today of her injuries\nTens of thousands of dollars have already been raised in a goal fundamental account for the widows of family\nMichigan needs to step up its game and fire prevention that's the message from state fire marshal Kevin ... as the governor proclaims October as fire prevention month\nJust to give you an idea of how much the facilities or the state in the UP last your age or the year there's been so far this year\nNationally Michigan consistently ranks in the top tier of states with a high number of residential fire fatalities in the first nine months of this year alone Michigan's home fired that's total has already reached Ninety percent of the total fire deaths recorded during all of twenty Seventeen\nChargers announced the connection do what I made the W. W. J. news radio nine fifties Vicki Thomas says the story\nWayne County prosecutor can't worthy announcing charges against ... sergeant Ronald Buckley in two paramedics who allegedly failed to render medical aid to William Marshall of ... he had been arrested on cocaine and marijuana possession charges\nMr martial can vote for almost an hour and a half with no medical attention on no one's thinking [noise] the cause of death with cocaine toxicity and the alleged conduct these defendants in this case shows an inexcusable and criminal disregard for human life\nAnd another inmate case out of ... are worthy not seeking charges and the death of Frank quarterback in the summer of twenty Seventeen Vicki Thomas W. W. J. news radio nine fifty\nW. W. J. news time five or six a local judge facing a disciplinary hearing over allegations she had an affair with a police officer who was the lead investigator on a murder case in her courtroom here with this story is W. W. J. legal analysts Charlie ...\nProtesters outside a disciplinary hearings for judge Erica job is holding a sign saying judge Theresa Brown in Livingston County lied under oath Eric ahead her four children taken away from her by judge Brett I'm because she believed the judge didn't like her attorney that attorney just ran against the judge in the last election\nI was her second family court case ever and she took my children from me and I want to make sure she knows that I'm here because I told her I was never going to stopping a thorn in her backside\nJudge Brennan admitted in a hearing today that she refused to disqualify herself in her own divorce case is hearing could last two weeks in Livonia Charlie ... W J news radio nine fifty\nW. W. J. news time is now five oh wait\n... weather together every ten minutes on the age from the motive of traffic setter brought you this hour by Audi of Rochester hills\nAnd Katie it is still a test drive in Farmington Hills yes if you want to take the and a five west bound ... two Seventy five south found this ramp is closes rolled over semi it's got a hazmat situation and it will probably be closed until tomorrow morning we will let you know got a crash on I Ninety four west on after Greenfield\nIt's on your left shoulder also an accident on the Seventy five north on exit to North line it's lucky you are right lane and shoulder of that accident in Ypsilanti I Ninety four east on right after ...\nAnd then on the Seventy five north on exit to North line it's lucky you are right lane and shoulder of that accident in Ypsilanti I Ninety four east on right after Huron street a crash has been cleared they'll look into the ... hour slower from after us twenty three\nAnd I'm fifty nine eastbound highland road right after last in got an accident is black and you're right lane and shoulder tips from Michael called that in an in with some reported water main break is fighting back road north down between I Ninety six in Pontiac trail and still does traffic lights that are slowing down Michigan avenue between slapped\nAnd Miller that's in Dearborn in the idol downloaded give twenty four hour traffic sensor Katie for W. W. J. news radio nine fifty\nAnd the exclusive accuweather forecast now into a meteorologist Dave Bowers joining us led looks like rent for a little warm up this week\nIsn't rocket where he said in comparison to record racial upheaval only balance or thirty or parts of transactions called er Cox information conditions equal housing lender licensing office he said and unless they were thirty thirty additional conditions or explosions may apply\nA newsstand five eight teams sizes driving whether together\nSeven now got Iraq that slow down and a reporter disabled vehicle on I Seventy five north on a jazz learn on your right shoulder\nHas traffic slowing down because there's that attire came off the car and everybody has to stop and look traffic is slow and go from before university\nTips you can call that and still a crash on the thirty five north on exits north mind it's like in the right lane and shoulder of that and still some slow down as I can see through the triple a jam comes on I Ninety four east on after Huron street this crash is out of the way though you do you're still slow and go\nFrom after us twenty three and now it's time for the national electrical contractor associations construction alerts and coming up\nOn Wednesday Garfield road is going to be close and I'm fifty nine for about ten days again that's going to start on Wednesday in the idol downloaded give twenty four hour traffic center Katie for W. W. J. news radio night fifty now the accuweather forecast for the\nFamily heating willing and electrical either center\nThat was going to be cloudy mild tonight will see a couple of showers even though a thunderstorm after midnight temperatures will be steady or slowly rising into the low sixties and then to borrow a bit of rain in the morning otherwise mostly cloudy high Seventy four or we dropped back into the fifties tomorrow night to under mostly ... guard\nA Wednesday unseasonably warm despite a lot of clouds eyes Seventy nine\nThursday looks like a some spotty shower activity during the morning and embrace of Sunday afternoon a high about Seventy five air we end the weaker was still grace guys friday and a couple of showers a high sixty eight um accuweather Rudy Rob is Dave ... hours on do W. J. news radio nine fifty\nCurrent conditions in Ann Arbor right now cloudy and fifty five degrees it's fifty seven in Farmington fifty nine at city airport and fifty six AT Metro\nTrafficking whether together every ten minutes on the eight year next update coming up at five twenty eight\n[laughter] how newsworthy nine fifty to only in the afternoon I'm\nGreg bill and I've read a gallon of pleasure in Farmington Hills is expected to be there for a while and Michigan safely say it feels Hank are overturned on the west side and five ran says southbound icy Seventy five I Jason Scott is on the scene and we'll have more in a live report at five thirty one\nGuarding to majority leader Mitch McConnell a vote on Supreme Court nominee Brett Kavanaugh will come this week he questions whether Democrats would ever be satisfied with the FBI investigation into the man no matter how rigorous it is I don't know\nThe goalpost will be on the move on our respect or side of our callers\nAre these documents are just this is ever about body and the truth anybody believe that\nBorn alive update from CBS News at five thirty\nOne motors say yes to legalizing marijuana just how much money will generate for the state W. W. J. Lansing bureau chief in school that takes a look\nThey've Michigan voters say yes to legalize pot and they'll also be saying yes to the tune of about a hundred million dollars additional for the state treasury the group pushing a yes vote put out a press release saying the number is five hundred twenty million but that's over five years so it cut it back to per year as a hundred million dollars\nThat money would be divided up between the roads schools and local government right now in the polls fifty five percent say they're willing to vote yes forty one percent are saying they'll vote no\nTeams could extradited you W J news radio nine fifty\nMichigan six percent sales tax will now be collected on all items including those purchased on line for retailers outside of the state annually two hundred million dollars in extra revenue expected to be collected by the state following a U.S Supreme Court ruling in June which overturned decisions impacting online sales tax collection so\nExtra revenue expected to be collected by the state following a U.S Supreme Court ruling in June which overturned decisions impacting online sales tax collection so where should the extra rubber there'd be spent the governor recommends it enough fixing Michigan's wrote\nW. W. J. news time five twenty three [noise]\nTwelve kid they give away on W. W. J. news radio that he is ours key word is football tax football at all oh T. P. A. L. L. kids seven to eight eight one for your chance to win one thousand dollars messaging data rates apply and whenever you not tax syndrome\nSo it's a big gains on the Dow Jones today but a mixed market overall your money's next WWE gene news done by twenty three\nThe all new radio jak job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party it locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... when I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWas in my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty cents ... like ...\nI could not have done it alone especially the future is really right for me\nNo one can take 'em alone if you are thinking in your high school diploma you had in mind for you know education is near you finish your diploma dot org run he went and knowledge and ... and the annual drum\nListen here to listen you understand more\nOr they don't understand clearly\nNice to have\nCareer field day after day more\nW W J news done five twenty five for business from the suburban Cadillac of Troy business desk and Jeff Ballenger heads are Bloomberg Business report\nStocks closed mix the index that started about higher across the board after trade negotiators announced a replacement for NAFTA\nThe Dow Jones industrial gained one hundred Ninety three points or three quarters of a percent the NASDAQ closed nine points lower a loss of a tenth of a percent the S. and P. five hundred rose ... percent\nJill carry hall Merrill Lynch prefers large cap stocks to small caps\nThere's a perception that small cops are more insulated from trade but they're the one area of the market hasn't been pricing in any risk they've started to under perform we think that will continue\nCarry hall says the U.S still look strong relative to the rest of the world United Continental Airlines placed orders for nine Boeing ... Dreamliner jets the wide body planes will become part of the carriers long haul fleet the order\nStress sponsored by plant Rand wealth management or lazy boy clothes that thirty dollars and Ninety seven cents with the loss of sixty three cents do tea energy lost twenty nine cents they closed that one hundred eight dollars and eighty four cents\nWell up to that problem on the uh them five ramp who in Farmington with traffic and whether or not\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six green initiatives I school diploma\nI could not have done it alone I see the future it's really right for me\nNo one can alone if you were thinking of ... your high school diploma you have now signed free adult education landed near you finish your diploma dot org run humid a Dollar General litter nation and the\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves wiping solution and more consumers energy part of a small business falls helping Michigan businesses save energy and money which is consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nHey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and they're going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... unless it's ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nWW Jane ... weather together every ten minutes on the age sponsored by master grabs heating and cooling\nAnd let's hit the road with Katie in Farmington Hills the empire was found ... Seventy five southbound is closed due to roll over semi looks like tomorrow morning before that reopens I Seventy five south on at fourteen mile road\nGot an accident blocking left lane and children to the ... you are slow and go from before Rochester road in the ... twenty four hour traffic center Katie for WWE taint his radio nine fifty\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council ...\nW W J news time five thirty eight Traficant whether together every ten minutes on you\nAnd let's check in with Katie in Farmington Hills the un five westbound ramp tie to Seventy five cell phone closed with a roll over semi this has meant situation and there will be closed until further notice on the last ... got a crash that is lucky you are right lane and shoulder and traffic is sponsored by Detroit princess riverboat\nOn I Ninety four west bound after Greenfield a crash on your left shoulder\nAnd looked into this really damn games you're heavy and slow from Michigan avenue and then slow or from I Ninety six with the ... with a ride home added in their eyes Seventy five south on fourteen ... wrote an accident blocking you're left lane and shoulder has your slower from\nAfter big beaver got Iraq on the Seventy five north on entrance ran for fourteen miles wrote a broken down bus on the lodge freeway north on service Dr Read after Claremont this locking left lane and tips to Tom called that in and still a crash\nA reported on I'm fifty nine highland road east on right after last in road\nLocking your right lane and shoulder make your corporate holiday party different this year book it now on the Detroit princess riverboat\nThey're heated and close to you can celebrate any party political fundraiser or birthday all you're wrong long cruise with us Saturday or Sunday for lunch or dinner called eight seven Seventy eighty ... eighty\nOr Detroit princess dot com and the out of their motive twenty four hour traffic sensor Katie for W. W. J. news radio nine fifty and now the weather forecast with meteorologists have our\nBattery working his way northward through the region tonight so this will allow temperatures to be steady are slowly rise in the low sixties by daybreak man on the front also generating a couple of showers above the storm after midnight a store\nMuch warmer after seeing fifties today and tomorrow we get to Seventy four\nMostly quality tomorrow night and Wednesday low fifty six Wednesday despite all the clouds we get close to eighty\nThursday a couple of mourning showers it into some sort of the afternoon I Seventy five it looks like a couple of showers friday otherwise gray with a high sixty eight this is accuweather ... stay Bowers are W J news radio nine fifty\nWhere you have a rain reporting in Mount pleasant currently fifty degrees that Detroit metro cloudy and fifty six that Detroit city airport is cloudy and fifty nine turning disaster into dollars will explain lose continues\nThe all new radio job job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on you is your news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and they're going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nTo gather on the AIDS and breaking news first came up to date on the\nNewsworthy nine fifty to all the\nWWE news times by forty two joining disaster into dollars for charity CBS News correspondent Pam\nColder report you may remember the U.S flag that was shredded in the wind as Hurricane Florence hit the north\nCarolina coast it was flying over a light station called frying pan tower and to our own or Richard Neal says on average had had a hundred thousand views during a live feed the day before the storm hit the fly now been auctioned off to raise money for the American Red Cross\nNeal said Ninety six people dead on the tattered flag and the winning bed was just under eleven thousand dollars ... CBS News\nWWE news time by forty three education today sponsored by Oakland University\n[noise] more and more women are getting into the field of medicine open universities Dr Linda Gillum says the landscape of the medical field is changing leading\nTo the American association for medical colleges for the first\nTime in history there are more women entering our us medical schools than men\nIn twenty Seventeen more than fifty percent of the Twenty one thousand students entering medical school were women the number of women in residency programs is growing and Dr ... says women are entering the field from diverse backgrounds\nTo race religion I'm there doesn't seem to be any barrier there in terms of a moving limits through the pipeline regardless of religion and even a race and ethnicity Dr\nGillman says they see that diversity in Oakland universities William\nBeaumont school of medicine Laura ... W W J news radio nine fifty\nThe all new radio job job that is available now it's a totally new experience for listening\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list saying if the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere [noise]\n[noise] we're watching a a problem that's going to be with us fairly for several more hours here involving\nThe M five ramp\nIn Farmington below the death rather good weather\nHave you ... times five forty five minutes for forests and that means it's time for ...\nWell Brooke it's also time for two game one sixty threes and we're getting them today one though already in the books and it was the cubs falling to the brewers three to one out of Wrigley Field for a Milwaukee to when they're first then I'll central crime for the first time since twenty eleven\nThe loss will not have the cubs be eliminated from the playoffs though they'll not play the loser of the LA Colorado matchup and tomorrow night in a wild card game Rockies and Dodgers currently going at it from LA right now LA is on top to nothing in the fifth\nOr in the NFL performed the cowboys yesterday down in Dallas lions turning their attention to Sunday showdown with the Packers from Ford Field and despite throwing for three hundred and seven yards and two touchdowns like Matthew Stafford telling Detroit Lions dot com he'll shoulders some of the blame in this one\nYou're not going to get up to a fast start ... maybe it's naturally a little bit earlier in the game and and go from there but a brother where ... got to clean things up or ... today and um you know what you got to find a way to go more points than\nEchoed map Patricia also speaking today said the Jay Leno is now in concussion protocols ... continues to remain day to day with his shoulder injury week for also gets going tonight or at least come so close to the Broncos playing host to the cheap somebody Night Football you can hear it a Ninety seven when the tickets starting at seven thirty\nAnother week and another award for Michigan chased one of its name the Big Ten school defensive player of the week the team also announcing or October thirteenth match up with Wisconsin will be seven thirty kick out of the big house also don't forget will have Inside Michigan football right here on news radio nine fifty what Jim horrible that comes your way starting at seven\nWith sports Fifteen and forty five passed each hour I'm Ryan woolly W. W. J. news radio nine fifty\nThings right and we will update the situation on the roads and also the forecast with traffic and whether in\nHey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news is across the country and we provide listeners with unique inside you can't get anywhere else everything's gonna be All right subscribe and download today on radio dot com and I chose\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on and even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere [noise]\n\nListen and imagine\n[noise]\nIt takes five seconds\nDo you doubled Eugene used on five forty eight times for weather together um [noise]\nAnd let's hit the roads that Katie well we've got that ... was found ramp closed\nIts the anti war spawn ramp tie to Seventy five south honor roll over semi that has created a hazmat situation is has it closed until further notice traffic is sponsored by three star financial credit union\nOn the ... freeway north on seven mile an accident like the right lane and shoulder as you slower from before Mick Nichols I Ninety four west on after Greenfield a crash on your left shoulder has your heavy and so from before Michigan avenue as far as I can see through the ... and also I Seventy five south\nDown at fourteen ... wrote an accident cleared still heavy from before big beaver and we still have that rack on the Seventy five north on entrance ramp from fourteen mile road\nAn accident on your left shoulder has you slower from Michigan avenue also a broken down by sunlight freeway north on service Dr Sony down its register clermont and it's like a year left lane in the town motive twenty four hour traffic center Katie for the daily radio nine fifty\nYour weather forecasting viruses flooding in mild couple of showers of a thunderstorm late tonight or fifty nine cloudy warmer tomorrow\nIn Seventy four cloudy very warm Wednesday with a higher ... fifty six degrees of metro\nTo news watch never saw that news radio nine fifty to use the only thing I'm correct moments\nAnd I broke out in the White House gives the FBI the green light to expand it sexual misconduct ... Supreme Court nominee Brett Kavanaugh I Want\nThem to do a very comprehensive\nCBS News will have a live reports hazmat situation expected a type traffic in Farmington Hills for some time or Jason Scott was alive and local details left the link\nBetween risky behavior in teens and a lack of sleep I Dr deanna like details of a new study not thrive lily sports in Fifteen minutes\nSee\nNews on the hour sponsored by del small business\nFind Pam Coulter President Trump has ordered an expanded FBI investigation of sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh CBS as bill re cough has the latest\nThe order to expand the background check on Kavanaugh came down within the last twenty four hours the Justice Department official confirming to CBS News that the FBI will be able to include anybody get deems necessary to vet claims of sexual misconduct even beyond that Christine Blasey Ford allegation\nThe lawyer for the second man in the room during the alleged assault of blondes before and says mark judge has been partially interviewed by the FBI the Supreme Court opens its new term one justice short CBS as Jim Crawford\nThere all the big cases on the horizon and you've got to abortion you write gay rights you about immigration but right now they haven't taken them yet so they've got kind of a budget I don't want to say here on earth but they're not the kind of cases that are going to really divide the jets that has divide the country\nPresident Trump calls the new trade agreement with Canada and Mexico a breakthrough for American workers but prime minister Justin Trudeau thanks Canada also got a good deal\nIt's an agreement that will be profoundly beneficial for our economy for Canadian family\nThan for the middle class\nMr Trump is awarded the medal of honor to army medic Ronald sure the second floor risking enemy fire to treat numerous injured soldiers in Afghanistan in two thousand eight\nFor more than six hours Ron bravely face down the enemy not a single American died and the brutal battle thanks in great measure to Ron's heroic\nActions looked ones gathered to remember the victims of the shooting rampage in Las Vegas country music festival a year ago today\nFor the families of the victims this anniversary is bringing back memories of unspeakable\nLoss I miss my daughter so much I miss my daughter and then the person ... Davis joined other families taking part in an early morning sunrise remember there were prayers also moving rendition of songs but through their hearts like you'll never walk alone\nLaws and all\nThis evening one of the ultimate tribute ... the more keys along the Vegas strip will go door to be for them and CBS\nMostly in Petaluma Indonesia\nRescuers recovered a man who was trapped in a collapsed building three days after an earthquake hit the city more than eight hundred and forty people were killed the Dow gained a hundred and Ninety three today NASDAQ fell nine this is CBS News\nDo small business technology advisors no there's nothing small about your business they provide one on one partnership and reliable ... went into court process\nCBS News do small business technology advisors no there's nothing small about your business they provide one on one partnership and reliable del PCs with intel core processor to get this done called eight seven seven by Dale\n[noise] wash never stops on Detroit's number one they\nWere holding and holding on to be a\nGood evening and thanks for joining us on Monday October the first time Greg Bowman for W. W. J. news radio nine fifty\nRising temperatures today with a couple of showers and a thunderstorm after midnight the complete accuweather forecast coming up\nRight now we've got a lot of these guys in fifty seven degrees of metro trafficking whether ... W W J news time six oh three got a hazmat situation going on in Farmington Hills W. W. J. news radio nine fifty\nIs Jason Scott is there he joined us live in local where the update Jason [noise]\nYup it's along the ... five westbound ramp on why two Seventy five southbound brag a it's a fuel truck this tanker took a tumble rolling off the back of the ramp down into Russian into a wooded area\nState police officials on scene here telling me the driver is okay no other injuries were reported now yes this is a hazmat situation the way a western Wayne County fire department is on the they're the ones pumping the fuel out of that overturn semi its tank anyway and into\nSmaller trucks to get the fuel out of this scene now what there is no leak at this moment but an investigation is ongoing a number of officials on scene either side of this ramp which will be remaining close for a number of hours as we've been reporting at least in the morning hours of Tuesday\nAgain the rap is closed the hazmat situation that's him five west bound to two Seventy five southbound reporting live in Farmington Hills Jason Scott's W. W. J. news radio nine fifty\nAnd us courtesy vans or off metro Detroit freeways still further notice contractor emergency road response pulled them off the road at midnight when their contract expired even though I'm done I asked them to stay on until the end of January when the new contractors starts patrols\nSpokesperson Jeff ... says it's not clear what impact this will have on commuters in trouble\nThe federal government these kinds of things specifically to try to eliminate congestion help eliminate ways being closed and backups that occur especially heavy congestion fires in the morning and it could have an impact it's really difficult to say how much and we just hope that we can get this resolved\nGrandsons says they'll keep a closer eye out for breakdowns through their freeway cams and alert police for health officials that the secretary of state's office they traffic was up at offices across the state today as Michigan officially ends driver responsibility fees W. W. J. newsworthy nine fifty Sandra McNeil live in local where the story Sandra\nGreg in a compromise every tax bill the governor agreed earlier this year to forego that these added on top of the normal fines for certain drivers at Penn says those opposed say they were putting a burden on motorists\nEspecially those trying to get to work three hundred thousand drivers though to combine six hundred and thirty seven million dollars in these fees and visual say most of which they probably would never have gotten back well Mary Jacobs got her license back today at the secretary of state in Livonia\nOh it's amazing I haven't had my licence I'm like five years so it's awesome heartless\nDifficult because I had to get rides back and forth to work how much money was washed away thirty five hundred state\nToday's also for going to one hundred and twenty five dollar reinstatement pie from licenses to the end of the year reporting might see Andrew McNeill W W Chinese ready on Ninety\nChargers announced a dead end in and made to death case out of West land W. W. J. news ready line fifties\nAnd you W Jane is ready on I ... the\nChargers announced a dead end in and made to death case out of West land W W J news ready line fifties Vicki Thomas with details swing\nCounty prosecutor Kim worthy charging less land sergeant Ronald ... EMTs Matt deco so law and Liam Maynard with involuntary manslaughter and misconduct in office\nThat charges stem from the death of William Marshall last December he had been in the lock up after being arrested for cocaine and marijuana possession\nWorthy says Marshall had convulsions and itself for an hour and a half\nEven though she says he was dragged out of the cell by the paramedics no medical attention was ever rendered\nSergeant Buckley did not send Marshall up to the hospital left them in the jail without Muslims with a little higher period of time the two EMTs they deny him medical treatment Bennett him in the jail after he requested assist\nEconomists WW Jane is radio nine fifty\nWest land police chief Jeff ... says the officer involved remains suspended pending an investigation into the death of William Marshall after the investigation drew six says we will take the necessary discipline up to and including termination of the officer he offered his apologies to the marshals family\nToday the first day of a hearing for a local judge or allegation she had an affair with a police officer who was the lead investigator on a murder case in her courtroom here's W. W. J. legal enlist early lengthen\nLivingston County district judge trees a run in a hearing to determine if multiple ethical violations would want removal from the bench\nThe judge said that the allegations must be taken income tax but Jared ... said that his father was convicted of first degree murder despite the fact that the judge failed to disclose that she was having an affair with a lead police officer in the case\nI mean you're forever you know to see that justice takes place and uh you know she had a lot of wrong it was going in her courtroom uh especially my father's case ... ski and if they find charges against her or she is qualified and taken off the badge and it shows a hole for my father and his case and getting a retrial\nThis disciplinary hearing could last two weeks in Livonia Charlie ... W W J news radio nine fifty\nW. W. J. news time is now six oh wait it's time for trafficking whether together\nEvery time that I saw the AIDS from the automotive or traffic center brought you this hour by BMW of Rochester hills and Katie's still looking at that a problem on\nAnd take a look at the accuweather forecasts no family heating cooling electrical weather center day Bowers little battery\nWorking his way northward through the region tonight uh this will allow temperatures to be steady are slowly rise in the low sixties by daybreak and the other front also generating a couple of showers thunderstorm after midnight\nA still a bit of rain during the morning rush otherwise tomorrow it's mostly cloudy and indeed much warmer after seeing fifties today the bar we get the Seventy four\nMostly cloudy tomorrow night and Wednesday low fifty six a Wednesday despite all the clouds we get close to eighty\nThursday a couple of mourning showers and into some Sunday afternoon high Seventy five it looks like a couple of showers friday otherwise gray with a high sixty eight this is accuweather meteorologists have Bowers on W. J. news radio nine fifty\nTemperatures really move much here in the last few hours still cloudy and fifty six that city airport fifty five in Garden City cloudy fifty seven degrees now at Detroit metro\nNews radio nine fifty\nFor the evening I'm Greg Coleman here's what's happening is six twenty\nWest bound in five wrap this up to Seventy five in Farmington Hills expected to be closed for about twelve hours through the white hazmat situation Michigan State police say a fuel tank or overturned on the west in five ramp dissent bone to Seventy five or ... Scott is on the scene he'll have more to live report coming up just after six thirty\nFBI's reportedly interviewed mark judge he was said to be in the room according to Christine Blasey Ford when she was sexually assaulted Rebecca ... is former district attorney for a New York says this makes sense\nThat things sacrifices that the FBI is going to get at Fox and I definitely identify and assess however fire had during the hearing the FBI would just get a phone thing that we're getting out of different I have to bear which well maybe had a different\nDetails it alive or update from CBS News at the bottom of the hour meantime FBI investigation is underway and read cover those claims of innocence in the wake of multiple accusations of sexual assault and binge drinking\nOr meantime FBI investigation is underway and read cover those claims of innocence in the wake of multiple accusations of sexual assault and binge drinking speaking live on W. W. J. current Franklin police chief and former special agent in charge of the FBI and Detroit Daniel Roberts\nExplains the process for interviewing key witnesses including mark judge who was allegedly there during the assault of Christine Blasey Ford\nWhat they'll do is they'll ask him a number of questions and record that in a typical FBI narrative format that report is called an F. D. three oh two and then they'll summarized their findings and report that to the White House who is the one who requested the investigation so they're not going to be making any\nSort of judgment as to whether there's criminality or not they're going to allow the committee and the White House to do that\nRobert says the deadline is friday should be enough time for the FBI to finish the background check W. W. J. news time six twenty two it's time for the Feldman report\nFor some families the worst of times can get even worse because somebody bad is watching I'm Marie Feldman with unfiltered report on W. W. J. news radio nine fifty\nA are pieces be careful when a loved one dies sad as it seems scam artist throughout their a rip off grieving families they know the more information you put in the obituary the more information scam artist can see and use\nA A R P cautions that crooks can often purchase or figure out a person's Social Security number to open a credit card account with their name and apply for loans and even file a tax return to collect refunds the first five digits of a Social Security number can be linked to a time in a place of birth\nThey say eight hundred thousand people a year or targeted after they die because nobody is checking their credit reports\nAlso as sick as it seems some works will attempt the burglar rise homes of the deceased since the obituary often gives the place in the time of the funeral they know the family won't be home they just cracked the case like this and Massachusetts if possible have a friend or neighbor keep an eye on the house with the film and report Emory Feldman W. W. J. news radio nine fifty\n[noise] W. W. J. news time is six twenty three [noise]\nIt is the twelfth they give away on W. W. J. news running and I'm fifty\nThis hour's keyboard is walk tax the word walked W A L K seven to eight eight one your chance to win one thousand dollars again text walk to seven to eight eight one your chance to win a thousand dollars message and data rates supply remember though don't text and drive\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only valid uncertain thirty year fixed rate loan scholar cost information and conditions equalizing Leonard licensing off at the state's animal is number three thirty initial conditions are exclusion may apply\nAnd now a page from the diary of slow\nYou die any there's something about protecting people's homes to progress that inspires me because I just had an idea for a book about it was originally an idea for a movie based on a plane and ... the idea of how you can see when you bundle home an auto may not be the best idea from duck\nSaving average is Seventy percent on car insurance when you went home and auto through progressive media radio commercials I guess we'll never know progressive casualty insurance company and affiliates discounts not available in all states are situation\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list it's a news and information you rely on even when you are near radio you can take this station when you're out\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nW. W. J. news times six twenty five [noise]\nTime for business suburban Cadillac of Troy business death sponsored by master craft heating and cooling jet Ballenger has our Bloomberg Business report\nStocks started the week with a mix sessions now Jones industrial gained one hundred Ninety three points or three quarters of a percent closing a twenty six thousand six fifty one\nThe NASDAQ closed nine points lower a loss of a tenth of a ... percent the U.S in the five hundred rose ... percent equity strategist Joe carry hall at Merrill Lynch is upbeat about us stocks\nThe U.S still looks like an area of strength relative to the rest of the world even though valuations and gotten more extended but us earnings are still strong fundamentals are still strong\nCarry hall says her preferences for large kept stocks\nShares of General Electric rallied after the conglomerate named a new chief executive gee you shares closed up seven percent\nJohn flattery was ousted after just over a year and the CEOs post Larry Cole is the new CEO effective immediately called won praise on Wall street for overseeing a turnaround that dinner her corporation\nI'm Jeff public ... with Bloomberg Business report on W. W. J. news radio nine fifty\nBucks a local interest sponsored by ... ran wealth management gee I'm close to thirty for Thirteen gain of forty six cents or a pool last twenty seven cents closing up one Eighteen forty eight and fifth or bank last twenty cents closing a twenty seven Seventy\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nShy fast neighborhood teenager had to find out who I can find a neighbor had ... or ... years after the arrest of course there to\nListen and imagine\n[noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... unless it's ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council [noise]\nSon six forty eight it's time for trafficking whether together every ten minutes\nOn the AIDS Katie what's the latest on that has met situation well it will be this ranch going to be closed until further notice because the ... too high to Seventy five south down as it is close because\nFurther noticed because the ... too high to Seventy five south than\nIt is closed because of this roll over semis a hazmat situation son of fuel spill and does it feel to transfer that they have to do\nAn accident on the last three way north on rent to Myers is on the rate soldier that ramp\nAlso crass I Ninety four west bound after Greenfield and this one on your left shoulder traffic is slower back to Michigan avenue but it is moving and looking through the ... at the last of the slowdown of this evening on north on I Seventy five to an eight and twelve miles roads and south on I Seventy five\nWell I'm Glad you enjoyed it but I think it's that had back in\nKilling I'm sure they'd be careful getting as a\nI'm going to return the kayak\nHow about a tax the\nHe I Need to head the fined by the way to find any talk or green space meaning you can find us going to have it\nMinutes on the apes Katie what are we looking at\nWell the anthem was found ramp too high to Seventy five south on closed with a relative or semi this is a hazmat situation the ramp it will be closed until further notice\nTraffic is sponsored by Ben Johnson law got a broken down vehicle on the ... freeway north on rent the Myers it's on the right shoulder that ramp I Ninety four west on if they're Greenfield a wrecking your left shoulder and looking through the ... not much of a slow down behind it\nAnd telegraph north on before seven mile an accident blocking you're right lane tips to Frank called that and now fear into your car crash victims you deserve a fighting chance to get your life\nBack on track then Johnson level fight tirelessly to get the justice you deserve call one eight five five vent fights today and put a champion in your corner in the idol downloaded twenty four hour traffic center ... W J news radio nine fifty\nBe active weather forecast now and meteorologist Dave ours\nAre cloudy skies at night a couple of showers and even a thunderstorm late temperatures will actually be slowly climbing into low sixties by morning when we look for much warmer day tomorrow or cloudy with a bit of rain during the morning I about Seventy four\nDays rather cloudy tomorrow night and Wednesday but dry low fifty six and warm on Wednesday with the high Seventy nine Thursdays is spotty warning showers and then some breaks the son of the afternoon with a high somebody bought\nThis is I keep up with a review by the state of ours on D O W J news radio nine fifty\nIt's cloudy and fifty five in Ann Arbor fifty six now it's city airport commerce township it fifty eight\nFifty six and know vie cloudy and fifty seven at Detroit metro trafficking whether together every ten minutes on the AIDS coming up on news radio nine fifty will take you to Paris and the auto show or ought to be a reporter Jeff Gilbert says technology playing a big role there that's the\nConsumer's energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small businesses electric and gas customers\nSeem on smart thermostat they'll leave evolves wiping solution and more consumers energy part of the small business bulls covering Michigan businesses save energy and money was consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nAnd you know an ad from um\nMoney on your car insurance by bundling home in auto with progressive [noise] hey is this call in here that it doesn't bother me doesn't bother me advantage is just kinda curious because if it's the equipment or something that that's fine it's just what kind of chilly\nProgressive can see from becoming your parents but we can see if you money when you know of course the insurance company affiliates other insurers just coming off a little stricter situations\nThe all new radio jak job that is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list to get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nPress again whether together on the apes and breaking news first came up to date on the road\nNews radio nine fifty to all the\nTechnology playing a bigger part in all of those shows in the Paris other show which gets underway tomorrow is no exception W. W. J. ought to be a reporter Jeff Gilbert in Paris with the story just report sponsored by Ayesha and\nYou know the DJ ought to be a reporter Jeff Gilbert in Paris with the story just report sponsored by I shouldn't say\nThis is a little bit of C E S right in the middle of an auto show there's one whole hear what the ... show was filled with tech exhibits lots of self driving shuttles at that base services in the like magnet vice president in Simmons says the line between tech and auto is boring\nI think the industry as they still do number of years ago sees that change coming and I think it's important dial up to half we need to understand the demands a lot to be so that we can respond sweat economically with Iraq technology has a lot of times\nWe auto show in Detroit has also added more of a tech so goes over the years covering the Paris auto show I'm Jeff Gilbert W. W. J. refer to yo nine fifty\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves piping solution and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy on com forward slash marketplace consumers energy count on us\nThe all new radio dot map is available now\nIt's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate in dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I can\n... time for sports Ryan willy with home coming I guess Jim are bomb will be celebrating a little extra milk for chocolate milk\nHe uh he loves milk we know that eats a Syria with Gatorade and he does some unconventional things but he has Michigan said coach and he picked up by compromised victory on Saturday gr against north western today though kind of turned some heads\nThat is Monday presser as of course they're preparing for the homecoming game this Saturday against Maryland He was asked what home coming meant to him and his answer was kind of out there\nOf course we're all going to me I was one of the great words in English language a\nAnd a homecoming people coming back from the richer union or\n[noise] a get together of a of a family and and that's one of a tough words in English language southward\nIndeed you can hear more Jim whereabouts an idle sit down for Inside Michigan football right here on your home or Michigan football news radio nine fifty starting at seven in the meantime chased one of its has been able to make ten so defensive player of the week with the team as announcer October thirteenth match up with Wisconsin will now be eighty seven thirty ...\nMajor league baseball game one sixty three today one though in the books brewers beat the cubs three to one at Wrigley Field that's when the central crop for the first time since twenty eleven Rockies in Dodgers going at it from LA right on the Dodgers on top five nothing that one of the bottom of the seven cubs will point\nThe season will come to a close tonight from Denver Broncos bringing the chiefs here that one on Ninety several on the ticket starting at seven thirty with sports Fifteen and forty five passed each hour I'm Ryan woolly W. W. J. news radio nine fifty\nAre thanks rival check out the drive including a problem here on the up and five connector ramp trafficking weather coming up in a minute\nWell I'm Glad you enjoyed it but I think it's that had back in ... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nTeenager had the foresight to find any red or green space than you can find U.S Forest service\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nShe won't smart thermostat they'll leave evolves wiping solution and more consumers energy part of a small business ... helping Michigan businesses save energy and money was consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nThe all new radio jak combat is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nW. W. J. news time is six forty eight it's time for traffic and whether together every ten minutes on the eighth let's go check the roads are gates including the problem here on the five ramp\nYes in Farmington Hills the anti west bound ramp too high to Seventy five southbound is closed because of rollovers semi that has a hazmat situation going on\nNow this ramps going to be closed until further notice we'll let you know traffic is sponsored by the Detroit princess riverboat an identity for west honest or Greenfield an accident on your left shoulder and looking through the ... that much of a slow down behind that", "year": "2018", "show_name": "Greg Bowman", "city": "Detroit", "day": "01"}