{"month": "10", "state": "MI", "station": "WWJ", "content": "And we're still watching to suck on Woodward from eleven to nine mile a moving work crew there with the left lane block that could wrap up here within the next Fifteen minutes from the idol down motor group twenty four hour traffic center I'm Tracy make us feel W. W. J. news radio nine Fifteen\nThank you Tracy that accuweather forecast from accuweather meteorologists that they send your old breezy turning cooler this afternoon crowds breaking for sunshine temperatures falling into the sixties right now Detroit metro airport and it's still cloudy and\nThe turning cooler this afternoon clouds breaking for sunshine temperatures falling into the sixties right now Detroit metro airport and it's still cloudy and sixty eight degrees\nFor news watch members diverse at sneezes radio nine fifty to all these gay and\nGood afternoon I'm Jackie page these other top story that have a ... gallon the FBI report about allegations Supreme Court nominee Brett Kavanaugh sexually abused women three decades ago is complete and I am ready to the CBS News with a live report next to this just in\nReligious leaders here in Detroit calling for an end to water shut off with that [noise]\nDot com\nThe news on the hour presented by CBS is Murphy Brown I'm Jim ...\n[noise]\nProtests continuing in Washington DC against the Brett Kavanaugh Supreme Court nomination even as Republicans say the FBI probe found no evidence to back up to six allegations against him\nIt looks to be a product of an incomplete investigation that was limited or perhaps by the White House I don't know\nCalifornia Democratic Senator Dianne Feinstein Martin correspondent Nancy ...\nSenators Susan Collins of Maine said that she felt that it was a very complete investigations she does not share and the Democrats concerned that perhaps\nEnough people weren't interviews on good sign for the Republican leader and for Brett Kavanaugh and then you have Jeff Flake who said that he took a look at the report and he didn't find in his initial review\nAny additional corroborating information that would put some on this scale for Christine Blasey Ford and her allegation\nWe're learning more about the man who allegedly shot seven law enforcement officers killing one yesterday on chip\nIn pursuit of Florence South Carolina authorities say the man who opened fire on law bit upscale neighborhood was Seventy four year old Fred Hoff gets officers went to his house to serve a warrant to bother me an allegation that are twenty seven year old person at the home sexually assaulted a foster child\nThere Hopkins or disbarred lawyer with a history of run ins with cops the Justice Department has announced indictments against seven Russians said to be members of a military intelligence agency involved in a global hacking conspiracy John ... is the department's top national security official\nIt is evidence from the allegations in today's indictments that the defendants believe that they could use their anonymity to act with impunity in their own countries and on the territories of other sovereign nations to undermine international institutions and to distract from the government's own wrongdoing China\nBeing accused of putting tiny ships the size of a grain of rice in equipment made for Amazon and apple and possibly other companies ships that were allegedly part of an effort to steal us technology secrets\nInflationary fears of spoke to investors today after a string of record closes the yield on a ten year treasury note roast a three point one eight percent that is a seven year high economists huge ... this\nWas a big rise in interest rates that quite frankly it caused a cause a little bit of a scare shall we say the kind of ripple through Wall Street it's a deep concern to lots and lots of folks professional investors as well as individuals\nAnd again on Wall street the dollars now down three thirty seven an as dark off one Seventy nine this the CBS News\nOn CBS critics are calling Murphy Brown groundbreaking legendary and iconic don't miss Candice Bergen new episode of Murphy Brown\nTonight on CBS critics are calling Murphy Brown groundbreaking legendary and iconic don't miss Candice Bergen new episode of Murphy Brown tonight on CBS\n[noise] washing ever wanted frozen number one\nForty nine holding it don't mean to be a\nGood afternoon and thanks for joining us this Thursday October the fourth time ...\nAnd I'm broke Allen for W. W. J. news radio nine fifty\nThe cold front is through will finally get a taste of follow this afternoon with gusty winds the temperatures falling through the sixties they complete accuweather forecast is coming up\nRight now ... sixty seven degrees at Detroit metro airport W. W. J. news time two or three\nDeveloping news this afternoon a federal grand jury indicted Detroit city council member ... on one count of conspiracy to commit bribery and two counts of bribery\nThe news coming down this afternoon from the U.S attorney's office which alleges the thirty five year old ... soliciting and accepted bribes in the amount of Fifteen thousand dollars in cash and free auto body work\nFrom a local business owner in exchange for helping delay or prevent the city sailor property of the business owner believed he owns\n... faces up to ten years in prison at a fine of two hundred fifty thousand dollars for each other to bribe recounts and up to five years in prison and find a two hundred and fifty thousand for the bribery conspiracy count called his office within the hour for comment found a councilman in according to a staffer but on a ...\nA rally held today calling for a halt to water shut offs in Detroit WW day said he beat reporter Vicki Thomas with this story\nBad many of them religious leaders of various face gathering here along the waterfront for prayer ahead of a news conference on water shut off here in front of the period of Detroit statue\nMonica Lewis Patrick led the rally\nAnd the paper that\nHousehold that I've been set up and that's\nWhy we don't want an apartment that provides water took one look at Michigan even called ships whale\nProbably find out what to\nDo with money\nOne that's not available to those that don't harp\nOn Vicki Thomas WW Jane is radio nine fifty\nThe Detroit water and sewage department meantime says there are multiple options for customers who are facing a potential water shut off WWE Jay's Michael Cohen joining us live and local with that part of the story Michael\nOh good afternoon great department tells us that so far this year twelve thousand customers have been shut off but over Seventy percent of their service restored plenty of Mobley the deputy director and chief engineer for the Detroit water and sewage department she says low income residents have help available to cover their water bills\nMaybe I was before the water residential assistant for Iran that is a minister Wang metro community action agency that threat infection more than eight million dollars has done that for low income residents and payment of their water bills including hunting repairs\nMobley says that when you legal account shut offs are excluded they're only about a thousand a Fifteen hundred customers will have their service currently shut off Michael Cohn importing lived for W. W. J. news radio nine fifty\nW. W. J. news time she was sick it's a new update to an earlier story on W W J uh west land police sergeant has been fired as he and two paramedics or rain today on charges of involuntary manslaughter in connection with the death of a jail inmate\nWW Jane is an activity center McNeil live in local with the soy Sandra prosecutor can't wear these tests\nOh and Terry manslaughter in connection with the death of a jail inmate WW Jane is ready and I said the sentiment he'll live in local with the soy Sandra\nProsecutor cameras and he says thirty five year old William Marshall and other inmates pleaded for help as he fell ill and fell into convulsions after he was jailed\nLast December tap worthy says while Wesley insurgent Ronald back like called for mass both he and the paramedics sensed it around and watched as Marshall was dragged out of his sale seizure it on the ground for over an hour Buckley in paramedics ...\nAnd ... and we are Maynard were arraigned on charges of involuntary manslaughter and willful neglect of duty they've been placed on fifty thousand dollars bond meanwhile my science police chief ... fired Buckley today saying he's completed an internal investigation and it revealed that Buckley violated department policy\nReporting might Sandra McNeil W W Jane is ready and I'm fifty\nSlight change being made to the policy involving Detroit fire trucks going on runs with lights and sirens blaring firefighters associations been fighting the policy and after a meeting yesterday the fire department decided they will have lights and sirens on when going on all fire alarms in runs like downed wires are accidents whether it up their initial reports of injury\nThe code one in code to designation not going away but fire engines will still have lights and sirens on no when going on most runs\nA Sterling Heights man is in custody after a standoff with police this morning after threatening to shoot and kill a bail bondsman officers were called do a whole month Angeline drive in the area Fifteen mile road and Ryan are on a forty five this morning lieutenant Mario ... says the forty five year old says back then barricaded himself in the house for about forty five minutes before being arrested\nIs a biologist bonds that so that's for sure and then obviously we're going to continue investigation on to see if there's anything else if you're the violation was bought we have all the rest of the subject before on fire charges for different type of his of his\nNationality says there were other people in the home during the standoff although none were children the bond was executed on several federal and local pending charges\nW. W. J. news time to oh wait it's time for trafficking whether together every time that it's on the AIDS from the out all the motive of traffic center brought you this hour by Audi of Rochester hills\nAnd we check in with Tracy McCaskill\nAnd broke we are watching a couple of a slow down here along I ... first was fun I maybe six that can like road\nThe left lane and shoulder or block also through the triple a jam Kansas keeping an eye on the Jeffries I maybe six was found moving here between Detroit and deliver annoyed traffic moving pretty well but we do see an accident west on I ... for\nA Detroit and live on your traffic moving pretty well time now for the electrical workers local fifty eight construction alert\nWe do have a long and thirty nine to Southfield north on ramp to Ford road or he found is also closed at Ford wrote Ethan ramps to the south field north and south bound closed here as well\nUntil five PM now we have been watching some construction was found I now before from started wrote him sixty left wing closure there also someone I Seventy five for my Ninety four to three Seventy five there was an update because this has now been moved to two thirty with the right lane closures continuing through that spot from the idol download or group twenty four hour traffic center\nI'm Tracy McCaskill W. W. J. news radio nine fifty\nAndy exclusive W. W. J. accuweather forecast the update family heating cooling electrical\nWeather center Dave Samuels gusty winds Reagan some folic here this afternoon temperatures will be falling slowly through the sixties with clouds at some sunshine mostly clear and cold tonight well below forty four do temp thirties and some outlying areas clause return to the will be a ... hour or two especially later in the day the high sixty two\nSaturday clown some sun it will be warmer the high approaching eighty I Can't rule out another shower maybe a thunderstorm in the afternoon why Sunday more clowns and son with the hype Seventy three than war again Monday with a high up Seventy nine this has accuweather meteorologist Dave Samuel on W. W. J. news radio nine fifty\nRight now and you Baltimore is sixty one degrees in low period is fifty nine and in Ann Arbor it is mostly cloudy sixty seven with wind that's up to fifty miles an hour\nAnd your chance to win a thousand dollars in the twelve did they give away on W. W. J. news radio nine fifty coming up at twenty three past the hour\nOn news radio nine fifty to should afternoon\nI'm director and I've read gallon stories that you Twenty one of ... and has now been fired as he along with two paramedics are charged with involuntary manslaughter in connection with the death of a jail inmates Ronald ... is accused of ignoring inmates who pleaded for help\nAnd the jail inmates ... is accused of ignoring inmates who pleaded for help and they were sex\nProtestors gathered outside the Supreme Court to voice opposition to the Supreme Court nominee Brett Kavanaugh rape survivors such as this Alaska resident worn Republican Senator Lisa Murkowski to listen to them [noise]\nYou believe survivors matter\nLeave survivors\nLatest in a live up to date from CBS News coming up at two thirty one\nState of educators are gathering documents in the Michigan attorney general's priest sex abuse investigation W. W. J. news radio nine fifty Charlie lumped in with a follow up\nCatholics are speaking out now that search warrants I've been issued by the attorney general for clergy files possibly involved in sexual abuse Aaron Patterson she's got two kids at shrines Catholic school she was a little cautious about priests\nNo I mean I wouldn't have them alone with a priest but that that the situation that wouldn't you know with the safeguards and everything and the rules that are in place here in\nYou know any Catholic school or any you know a lot of schools period\nAnd job at the ... and he's got three kids a shrine he says he investigates you must go on\nThis has to be the end of this controversy they need to clean house but you need a thorough independent investigation and find the root of all evil and get it get rid of it\nNo title that for the attorney general's investigation in Royal Oak Charlie ... W W J news radio nine fifty\nW. W. J. news time used to twenty two\nI'm Deborah W. J. server to just seen that with a look at what's hot around town you love camping you may want to head to Novi this weekend the twenty ninth annual fall\nDetroit RV and camping show today through Sunday at the suburban collection show place hundreds of recreational vehicles campground information RV rentals and more Kevin Hart bringing his irresponsible\nTo our town this weekend little Caesar's arena tomorrow night had seven big weekend for the Detroit symphony orchestra Leonard slack and opens the season with\nSir Edward el ... enigma variations tomorrow night Saturday Night and Sunday afternoon at orchestra hall the annual zoo booze starts this weekend at the Detroit Zoo and Mary not scary\nHalloween event for you and the kids magic like music extreme pumpkin carving demonstrations Thirteen station trick or treat trail tomorrow Saturday and Sunday the Detroit Lions hosts the Green Bay Packers on Sunday one PM have a great weekend reverted just seeing that W W J news radio nine fifty\nW. W. J. news time two twenty three [noise]\nWhile K they give away on WWE ... radio nine fifty this hour is key word is mood text mood M O O D did seven to eight one for your chance to win win thousand dollars messaging data rates apply remember do text and drive\nMassive losses piling up today on the market your money's next the bell down more than three hundred points W. W. J. news time to twenty four\nThe all new radio jak combat is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list of news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nOr anywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season\nThe all new radio job job that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love you know we'll save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWell I'm Glad you enjoyed it but I think it's that had back in\nTime I'm sure to be careful getting of a\nI'm going to return the kayak\n... how about a factor\nThat short hair from your neighborhood here nature had discovered the far side or to find a neighborhood park or green space near you ... you escort service\nDJ new century twenty five time for business from a suburban Cadillac Detroit is the death\nPenalty is if I had her Bloomberg visits real Ford and Lisa what a difference a day makes\n... right broken Greg we are seriously lower here the Dow is dropping three hundred thirty eight points are one and a quarter percent\nWell you know yesterday at this time we were just about Seventy points away from twenty seven K now we're at twenty six thousand four Ninety five NASDAQ down more than two percent or one hundred eighty four points and the U.S in the lower by thirty nine\nThe Bloomberg W. W. J. Detroit index also falling about one and a quarter percent Wall Street's focus is shifting the treasury yields and they're a multi year highs tech real estate and consumer shares are getting battered\nChina used a tiny chip to attack U.S companies including apple and Amazon Bloomberg Businessweek reports Chinese intelligence put the chips into their systems\nAnd apple has been conducting a secret investigations into discovered them in twenty Fifteen and passed on the findings to the FBI apple and Amazon both denied the report stock and both of those companies two percent lower I'm Alisa for anti with Bloomberg Business report on W. W. J. news radio nine fifty\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nIt stopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six green initiatives high school diploma\nI could not have done it alone uh see the future it's really ...\nNo one can minimum alone if you are thinking and managing your high school diploma you have now signed free adult education classes near you finish your diploma dot org run humid a Dollar General litter nation and the and he'll draw\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nThe crashes blocking the right lane and shoulder traffic heavier from Van Dyke also through the triple a jam cameras watching slow down this uh between the interchange is they're both east and west bound I met before affected\nBetween again those entertain just downtown west on I ... from downtown and to the airport area not too much of a delay there in thirty nine to Southfield north on ramp to forward road east disclosed\nUnion offer some of the best at the rate you'll find with as little as five hundred dollars open at twenty three months the D. and start earning two point seven annual ... visit MSG the you doubt or to get started from the idol download or girl twenty four hour traffic center I'm drifting McCaskill WWE Jane news radio nine fifty\nTrafficking whether sponsored by John Legend in concert\nAnd the accuweather forecast pretty breezy turning cooler the rest of the afternoon look for temperatures to fall through the sixties\nClear in quite chilly tonight or forty four downtown in the upper thirties suddenly outlying areas tomorrow cloudy and cool\nWith a shower at a high sixty two then clearly much warmer again Saturday with a shower and a high close to eighty degrees or recapping for this evening is going to be clear and Chile with the Los falling into the thirties and forties right now sixty seven at city airport in sixty seven AT Metro\nCome spend the holidays with John Legend and his a legendary Christmas tour coming to the Fox theater on December sex get tickets friday at ten am at like nation dot com and the fuck cedar box office\nLooking for more consistency when it comes to your wireless service bills will update that story when the news comes in\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you as a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has blocked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nShort fasten your neighborhood here in nature had to find that hard to find a neighborhood ... ... us car service\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... message by the by the national Highway Traffic Safety Administration project yellow light noise and the ad council or\nWhether to gather on the AIDS and breaking news first came up to date on the road\nNews radio nine fifty W. W.\nW. J. news time to forty two bits legislation which would standardized permits fees and land use for wireless service providers at a\nHearing today in Lansing AT and T. Michigan president David Lewis calls it beneficial for the entire state\nWe're talking about five gee capabilities four times vehicles were talking about first Nick capabilities for first responders were talking about the ability to meet\nFour times vehicles were talking about first capabilities for first responders were talking about the ability to meet the future now in order to do that we have to have that infrastructure in place and this legislation allows us to do it on a statewide level\nMeantime Eighteen ... already committed more than a billion dollars over the next two years in five gee technology\nW W a nice time to forty three it's time for your eye on tax\nI on tap with Larry Magid [noise]\nA lot of people use the recommendation services like Yelp and trip advisor to find out what people think about certain types of products or services\nTrouble is you have no idea who the people are who are weighing in but what if you could get recommendations from friends and acquaintances that's the idea behind a new smartphone app called likewise which was funded by Microsoft cofounder Bill Gates\nThe likewise app which runs on both Iowa and Android helps you find recommendations for such things as restaurants TV shows\nMovies and books from people you know and trust Larry Magid CBS [laughter] see\nDo you experience relief or muscle cramps ... used their works relief this fast acting film was proven to prevent and relief for the leg cramps give their works really today and the pain relief via would Walmart CBS Rite Aid and Walgreens pharmacies or their works relief dot com\nThe all new radio dot com at is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas covering\nThe very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right subscribe and download today on radio dot com and I can\nRight now the market is down they'd go down to hundred and eighty seven and has had gotten one hundred sixty one we will I check all the numbers for you with the Bloomberg Business reporting ten minutes\nTo forty five it is a time for sports right only done it a little Caesar's arena do they have a proper nickname for el ca I guess people call it for the red wings opener tonight it's it's a young team Ryan's I got five rookies I understand\nYeah they're going to have five guys least nine guys are the age of twenty five they're going to five guys making her debut tonight\nGreg so this is certainly one of those years that they may not be the most entertaining team as far as when the losses are concerned but they're going to be a growing seeing this is the most\nUh young guys they've had on a squad since reading that so back in the Nineteen eighty six season last starts it gets to Columbus blue jackets a team that's actually own Detroit as white they've won six in a row against the wings over Detroit is fair really well at home opener is they won their last five straight dating back to the Joe Louis arena\nAnd Bill Arkin says despite most experts that big already picked against the wing is one of the three worst teams in the league the team doesn't see it that way\nPeople are counting sowed everyone's comics out but you know why not it's new to game season we're we're looking at right now in game one here\nUh I Know if we win or you know people will see how they do and if we lose the immediately go to our ever going to go first\nI Know if we win or you know people will see how they do and if we lose the\nImmediately go to our area in the first overall pick but it's just the way it is and it's just the you know the way the way it is I guess so ah we don't think like that we have a lot of pride in this room you know we have a lot of good players we have a lot of skills so ah let's let's do it let's make a run and\nYou can hear the game will run out several and the ticket for getting coverage goes away it's seven ten they will drop the puck at seven thirty now the lions once again going to work out to nail apart today continuing to get ready for Sunday's game with the Packers they did get back with your blood new set of yesterday due to an illness\nTJ laying Eli Harold my Roberts never lost an all remain sidelined week five also gets going today from New England Patriots play host the culture that what on CBS Sports radio twelve Seventy starting at age\nThe baseball playoffs continuing today the divisional series getting underway with the U.S from Milwaukee the brewers bringing the Rockies first pitch at five thirty seven LDS get started at eight thirty seven tonight out in LA the Dodgers played hosted the Braves\nWith sports Fifteen and forty five passed each hour I'm Ryan woolly double ... news radio nine fifty\nWill hit the roads in check the forecast the traffic and whether in one minute\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty cents Corinne I school diploma\nI cannot have done it alone I see the future it's really ...\nNo one can get them alone if you are thinking and changing your high school diploma you have now signed free education is near you finish your diploma dot org running like a Dollar General literacy and Asian and the ... the only\nHey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nW. J. news time to forty eight trafficking whether together on the AIDS\nAnd chasing McCaskill has it right on Ninety four and we're still\nWatching a slow down their brook in this report is sponsored by Greek town casino so chicken ... we still have traffic heavy from before grass you'd hear due to this accident along westbound ... boulevard the crash remains on the right shoulder\nPlease stop ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nHaving a new scientific da time for traffic and whether together on the eighth and you're facing\nAnd we're watching here through the AAA damn came on I ... after us twenty three a crash isn't that right shoulder they're trying to heavier from Michigan avenue the accidental on west ... east grand boulevards dawn\nBilking some slower traffic in Ann Arbor west on metaphor between Michigan avenue and to just after us twenty three from adult are motor group twenty four hour traffic center I'm Tracy McCaskill WWE Jamie's radio nine fifty the accuweather\nForecast and they've Samuels says clear quite chilly tonight was forty four down to the upper thirty some of the outlying areas bloody cool tomorrow with a shower and high sixty two much warmer Saturday with a shower at a high up Seventy nine right now at Detroit metro airport cloudy skies sixty seven degrees it to Fifteen on\nThe news much never diverse sneezes radio nine fifty to all these all these gay and\nGood afternoon I'm ... and I'm broke Allen Republicans say the FBI report on Supreme Court nominee Brett Kavanaugh says no wrongdoing Democrats say the FBI hands were tied\nWhat happened here was finally the White House free jak [noise] isn't that\nDot com\nCBS News on the hour sponsored by we're getting loans\nI'm Jim ... Democrats are accusing the White House of manipulating the FBI probe into sexual allegations against Supreme Court nominee Brett Kavanaugh\nWhat happened here was finally the White House or a jacket this investigation\nConnecticut's Richard Blumenthal the investigation finding new evidence to back up the allegations Senate GOP leader Mitch McConnell is no way anytime we did would\nSatisfy the Democrats oh they've always got a reason while the goalposts needed to be moved further down the ... responded Nancy\nCourt according to the White House the report does not corroborate Christine logging for its claims that she was sexually assaulted by judge Kavanaugh in Nineteen eighty two Democrats point out that most people who might have been able to corroborate lodging for tests\nHe loves his ... he gave it as oh\nTwo of the wounded officers have been released from the hospital one officer and three sheriff's deputies remain hospitalized\nFor silt and Florence south through a lot of Seventy four year old Fred Hopkins the suspect in the shooting of seven lawman one fatally is it this far to lawyer he's been charged several times in recent years according to public court records including disorderly conduct in twenty four team\nA U.S soldier killed in Afghanistan corresponded bill ...\nPentagon officials have not released many details end of the death of the soldier citing the need to notify the family first seven service members have now been killed in Afghanistan this year\nThe Pentagon says there are about fourteen thousand us service members overall in Afghanistan more than twenty four hundred U.S forces have died in the Seventeen year old war America's longest conflict bill re cops CBS News\nWashington the ATF says the car explosion in Allentown, Pennsylvania last weekend that killed two men and the child was a murder suicide orchestrated by twenty six year old Jacob ... lawyer special agent Don Robbins and\nAll the letters indicated that Mr Schorr was to blame you took blame for the first two that we see the indicated that he intended to target is to home and and then one of the other letters were able to confirm they intentionally also the tape and tended to take his son with him\nA school bus crash in suburban Dallas killed one child and injured three others the bus carrying forty to middle school students crashed and burned it ended up on his side in a ditch no other vehicles were involved on Wall street the Dow is now down to thirty two they share of CBS News\nNational mortgage lender Quicken Loans apply simply understand fully mortgage confidently licensing all fifty states equal housing lender and MLS number thirty thirty\n[noise] wash never saw on Detroit's number one they\nWere to go now to holding on to be a\nGood afternoon thanks for joining us on Thursday the fourth of October I'm Greg Bowman\n... W Jane is radio nine fifty\nChillier tonight down into the low forties in most cases it will see some showers tomorrow the complete accurate the forecast is coming up\nRight now mostly cloudy sixty six degrees that Detroit metro W. W. J. news times we owe three rape\nVictims in St Clair county of a man of goes by the nickname Jaycee are being asked to come forward W. W. J. news radio and fifties Jason Scott joining us live and local with the latest on this story Jason\nYeah Greg James Carlton Riley who has been convicted an answer for ten years for criminal sexual assault before\nHe was arraigned yesterday on two counts of first degree CFC with a child under Thirteen Years old since being released from prison back in Nineteen Ninety nine sixty two year old Columbus township man had spent some time in the city of war and because of that sheriff's officials believe there could be other rape victims in the area\nCurrently being held without bond Riley will have a probable cause hearing next week reporting live Jason Scott's WWE Jane news radio nine fifty\nUpdating an earlier story on WWE jail less lampley sergeant and two paramedics have been rained on charges of involuntary manslaughter in connection with the death of the jelly mate last December\nProsecutor Kim where they says sergeant Ronald Buckley and paramedics Mattis cola and Leah Maynard failed to help thirty five year old William Marshall instead standing around and watching while he had seizures on the floor luckily meanwhile as fire today by ... police chief who has an internal investigation says Mike Lee found that followed department policy\nRelated deaths richer record highs the state releases new numbers today W. W. J. news radio nine fifty Sandra McNeal is live in local with the store\nOpioid related deaths richer record highs the state releases new numbers today W. W. J. newsworthy like fifty Sandra McNeal is live and local\nWith the story saver Greg Lynn ... is with the Michigan department of community health which released those numbers today on the overdoses in the state and twenty Seventeen\nThey one thousand nine hundred and forty one opioid related deaths are the highest that we ever recorded in Michigan and a two thousand and sixteen we had one thousand seven hundred and eighty six opioid related deaths\nAnd she says that's nearly a nine percent increase over twenty sixteen substance on part of the increase can be attributed to new counting methods but really this is just an issue as we know across the nation reporting mind Sandra McNeil W W Jane is ready on a ...\nA federal grand jury has indicted Detroit city council member ... Linda on one count of conspiracy to commit bribery and two counts of bribery we get the story from WW Jane is waiting to see St John who in\nThe news coming down from the U.S attorney's office alleging the thirty five year old ... solicited accepted bribes and the amount of Fifteen thousand dollars in cash as well as free auto body work from a local business owner in exchange Leland was to help delay or prevent the city's sale of property the business owner believed he owned Leland faces up to ten years in prison and define\nOf two hundred fifty thousand dollars for each of the two bribery counts in addition to five years in prison at a fine of two hundred fifty thousand dollars for the bribery conspiracy count\nA call to his office for comment found a councilman end according to a staffer but unavailable John Hewitt W. W. J. news radio nine fifty\nW. W. J. news time through six and water shut off from the city that's the call at a rally today in Detroit W. W. J. city beat reporter Vicki Thomas will do to\n[noise] people gathering protest or water\nShut offs I asked Reverend Edwin row if he's had a chance to talk to Mayor Mike Duggan or water department director Gary Brown\nConversation with people who lie to you than people who won't give you information the\nW. as he tells me there are one thousand to Fifteen hundred people who currently have their water service shut off road goes on to say\nWhat we could have had a plan that would allow them to pay what they could afford\nTo have turned their water back on the city gets more money\nAnd I just don't get destroyed who's mayor Izzie\nFishers how is it ours Vicki\nThomas W. W. J. news radio nine fifty\nIn response the Detroit water and sewage department says there are multiple programs to help those who are struggling to keep up with their water bills ... is the deputy director and chief engineer of the Detroit water and sewage department\nThere have been about twelve thousand service interruptions this year Seventy one percent of those accounts were were stored and two thousand approximately two thousand accounts were found to be illegal\nMiddle East I shut up procedures are initiated when customers are delinquent for sixty days and have an overdue balance of more than one hundred fifty dollars\nW. W. J. newsstand thrill ways it is time for trafficking whether together every ten minutes on the AIDS from the motor group traffic center brought you this hour by BMW of Rochester hills\nAnd we say good afternoon decade he and his logo in Ann Arbor Katie\nGood afternoon Bruce Greg in Ann Arbor I Ninety four west on right after us twenty three and acts than on your right shoulder is causing traffic to be slower from Michigan avenue and ... called that and looking through the ... jam camps and some slow down ... south bound for fourteen ... road\nTo six Ninety six on six Ninety six east on these lower from before I Seventy five to Ryan and Seventy five north on traffic is picking up between eight and twelve miles roads and we've got roadwork that may change around to Southfield freeway north bound ramp to Ford wrote\nI Seventy five Northam traffic is picking up between eight and twelve now roads and we've got roadwork that may change around the Southfield freeway north bound ramp to Ford road east bound closed also the Ford route Ford road east on ramps to the south field north and south bound\nBoth closed until five PM see a problem on the road to give us a call on the W. W. J. tips in line at two forty four to three six W. W. J. in the adult that motive twenty four hour traffic center Casey for W. W. J. means radio nine fifty trafficking whether sponsored by bridge down\nAnd trafficking whether sponsored by north felt numbers nobody home designed center\nAccuweather forecast family heating cooling electrical whether setter in John very\nChilly here tonight mostly cleared out a forty four upper thirties in the suburbs um for tomorrow will turn out mostly cloudy total showers around mainly in the afternoon I sixty to shower thunderstorm in the early ... fifty eight\nSuburbs I'm for tomorrow will turn out mostly cloudy total showers around mainly in the afternoon I sixty to shower thunderstorm in the early ... fifty eight O. C. gladly for Saturday warmer ... Seventy nine ... Sunday I Seventy three wars Monday soldier so many afternoon I Seventy nine\nThis is accuweather meteorologist John fear it will be usable you Jay news radio nine fifty\nJust seen some sunshine and how it is currently sixty one degree that Detroit city airport is cloudy and sixty seven at Detroit metro it is mostly cloudy sixty six degrees with wins out of the north that Thirteen miles an hour\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a tax the\nTeenager head to the point that I like to find a neighborhood park or green space meaning you ... your body temperature in the U.S Forest Service\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty cents green is my school diploma\nI could not have done it alone I see the future it's really frighten me\nKnowing that I'm I'm Alone if you are thinking in your high school diploma and you have now signed free adult education landed near you finish your diploma dot org running with a Dollar General litter and Asian and the ... all\nThe all new radio job job that is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you're listening to the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone now\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nOn news radio nine fifty you'd\nAfternoon I'm Greg Bowman and I've read ... with the arraignment of St Louis county man on criminal sexual conduct charges involving children police are now searching for more victims sixty two year old James Reilly appearing in court today he's accused of assaulting an eight year old and a Thirteen year old\nDoesn't seem like the weeklong FBI investigation into the Supreme Court nominee Brett Kavanaugh revealed anything new Democrats say there was enough time to properly investigated well Republicans say they're confident Senate Judiciary chairman Chuck Grassley says he feels good\n... said that we're going to do everything we can to stop this nomination and you can look back in eighty seven days and you can see that everything but whether he's qualified to serve has been brought up\nCBS News with more than ... three thirty one\nOne luxury carmaker is not convinced about electric vehicles W. W. J. ought to be a reporter Jeff Gilbert with this story from the Paris auto show\nSaudi Mercedes and jaguar all have high end\nWas viable option in Europe are so are the majority of Lexus vehicles sold\nHere in Europe or hybrids and the Toyota brand here is nearly half hybrid covering the ... show five job Gilbert W. W. J. radio nine ... [noise]\nThe twelfth they give away on W. W. J. news really good on fifty this hour he wrote a shark affects the word shark S. H. A. R. K. seven see waited one your chance to win one thousand dollars messaging data rates apply remember do not text and drive\nW. W. K. news time until you're twenty three it's time for the film and report\nOf pop up message on a computer screen that's not ... not a gimmick but it is worth mentioning here I'm already filled in with the film and report um W. W. J. news radio nine fifty\nI've visited the site where they offer you a free credit reports and your credit report dot com and before I could do anything on the site there was a pop up message an important one for us to always remember quoting now although this website is very secure the wireless network that you're using to get the site may not be\nIf you use your mobile device your personal information including your Social Security number may be at risk\nWe recommend that you use a regular computer to get your credit reports well\nThat's a great message to always remember a site may be secure but the way you get there may not be very important if you're transmitting sensitive information the site again for free credit reports and you will credit report dot com with the Feldman report I'm Marie Feldman W. W. J. news radio nine fifty\nThe all new radio jak combat is available now it's a totally new experienced it towards listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party has left an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nOf your Jane news time three twenty five time for business suburban Cadillac of Troy business desk\nAnd right now the Dow is down two hundred and thirty five the NASDAQ down one hundred and fifty four and I asked him the five hundred down twenty seven at least a friend who has our Bloomberg Business replied\nInvestors are selling out of the government September jobs report which we get tomorrow morning Bloomberg's any doubt you'd ice reports\nOver the shore of all the data could be affected by the impact of Hurricane Florence over the longer hall the outlook remains bright Bloomberg economics us payroll games in excess of the labor markets natural growth rate should know unemployment even lower weekly claims for unemployment benefits of the lowest since the late Nineteen sixties\nApple and Amazon had both denied reports from Bloomberg Businessweek\nThat their citizens contained malicious computer chips inserted by Chinese intelligence according to the report a top secret investigation has been underway since apple discovered that ships in twenty Fifteen and quietly informed the FBI later Amazon independently discovered the chip and also reported it\nThe chips supposedly found in super micro hardware are suspected to have been used to spy on U.S companies and their users\nI'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nThere's I'm Alisa parental with Bloomberg Business report on W. W. J. news radio nine fifty\nWell I'm Glad you enjoyed it but I think it's that had back in\nTime can we can sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nTeenager had discovered the force by the way to find a neighborhood park or green space near you you can find U.S Forest service\nThe all new radio job job that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list is the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor anywhere\nHey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour long weekly political pod cast covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be on writing subscribe and download today on radio dot com and I do\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty six Corinne initiatives I school diploma\nI could not have done it alone especially the future is really right for me\nKnowing that I'm I'm Alone if you are thinking in your high school diploma you have now signed free adult education is near you finish your diploma dot org running with a Dollar General literacy nation and the ...\nCentury twenty eight time for a traffic and whether together every ten minutes on the eighth and here's Katie in Ann Arbor\nI noted for west monitor us twenty three across any right shoulder looking to the gym Kansas lower from Michigan avenue in the adult downloaded give twenty four hour traffic center ... W J news radio nine fifty than the accuweather\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nTraffic of weather together every ten minutes on the\nCage he I Ninety four Phyllis logo yes in Ann Arbor I Ninety four west on after us twenty three a crash on your right shoulder looking to truly damn Kansas lower from before Michigan avenue traffic is sponsored by the Detroit for instance riverboat and I to Seventy five north on after Warren an accident on your left shoulder has these slower from before Ford rode\nAnd rode where it's going to cause some delays on Southfield road between twelve and Thirteen mile roads\nOnly or right lane the outside right lane both north and south bomb will be open\nAnd this is going to go through mid November\nMaking your corporate holiday party different this year book it now on the Detroit princes riverboat\nThey're heated then enclosed so you can celebrate any party political fundraiser or birthday all year long cruise with them the Saturday or Sunday for lunch or dinner called eight seven Seventy TBO eighty or Detroit princess dot com in the adult that motivated twenty four hour traffic center ... detainees radio nine fifty\nBad the accuweather forecast lie meteorologist or John ... temps going down and then right back up again John\nYeah absolutely a little bit chilly are out there for two nights guys will turn out mostly cleared out a forty four Web upper thirties and a few suburbs and for tomorrow turning out mostly cloudy probably drawn to start but we'll see couples showers around the moral especially in the afternoon\nA high sixty to ... to ... hours on the shore up especially later on down to fifty eight Saturday mostly bloody warmer a thunder storm of the areas especially during the afternoon a thunderstorm can be strong ah Seventy nine mostly Bloody Sunday I Seventy three\nMore than you would Monday a thunderstorm in the area of the high Seventy nine or another ultimately fifty four percent when northeastern Fifteen ... thirty poorly falling oh we've got Pontiac at sixty one in our sixty seven\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nAnywhere\nMother to gather on the eighth and breaking news first came up to date on the road\nNewsworthy nine fifty W. W.\nW. W. J. news times forty two law enforcement officials getting an update today after a car explosion near Philadelphia ATF field of vision special agent in charge Tom Robinson says this was a murder suicide\nOrchestrated by twenty six year old Jacob Troyer\nWe're confident that I'm sure where acted alone at this point uh he's not a I'm involved with any groups or the FBI has confirmed a there was a story out there one of the subjects may have been on a watch list somewhere there has been from that's not accurate\nMoyers toddler son and friend also died in the blast in Allentown\nIt is time for ... car comical sponsored by ice in\nThese old barns bed yet this is Jeff Jeff with with the chronicle today from the Paris auto show\nDiesel used to be big here in Europe the Volkswagen scandal hit justice new regulations were coming into play but keep your power train chief Michael Winkler says there is still a place here in Europe for diesel\nWith the latest the mission regulations you're sixty temp diesel so not only clean in the in the last what they are really also keen on the road and this has to be proven by as we call it ... and finding emissions but\nKeep your ears slowly jumping on the electrification bandwagon and it's not just about being green\nTo be honest if you drive to view 'cause they also Elizabeth fun to drive it's not only about ... but it's also about emotions about driving the vehicle which is due to the ... it's quite good to talk to\nKids first TV is an electric version of the Niro which has traditionally sold\nAs a hybrid what the core chronicles today from the ... show five Jeff Gilbert W. W. J. who's really going to move to\nHey Sean Spicer and every mid term election since the civil war the president's party has blocked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and they're going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I can\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nPlease stop ... unless it's ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council [noise]\nWell I'm Glad you enjoyed it but I think it's that had back in\nKilling I'm sure they'd be careful getting out of a\nI'm going to return the higher\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I was\nFifteen minutes away from the closing bell right now the gal down two hundred thirty points of your money in just ten minutes\nThree forty five it is a time for sports Brian Willie down in little Caesar's arenas for the red wings home over there that I write\nYeah grab the red wings looking to make it six straight wins here in their whole officers they bring in the blue jackets here to the L. C. A. and prior to the game really just about a half hour the team's going to hold their third annual hockey town red carpet walk\nThat's current and former players walked through the Chevrolet plaza to enter else yeah you don't need a ticket to that it's free to the public and again that was started for Fifteen\nThe team though is encouraging fans that are pointing to come down to tonight's a season opener to be in their seats by seven Fifteen that's the witness the pregame light show and of course the official introductions you can also hear all the action will run out several on the ticket\nStarting at seven ten ads for the lines every once again going to work out today in Allen park continuing the game plan for Sunday showdown with the Packers down at Ford Field they did get back Lou Gehrig born who set up yesterday due to an illness\nDJ laying Eli Harold Michael Roberts never lost and they'll all remains sidelined why do golden Tate also talked about what a win this weekend to do with the team's mindset heading into their by week\nUm it it would be a huge 'cause [noise] you know when this when you get to enjoy this one for a little bit longer you got a little break ins or you lose that you're thinking about it until next them back on the field we want to get this one and besides that visual game you know I I like to make a counter counter to\nIf we get this winter winter for the last two games Wayne in my mind so we're a rubber fantastic weaker practice a resort or start up today had a good week a good day or is going to remember the other\nWeek five also gets going to die from New England Patriots playing host the culture that went on CBS Sports radio twelve Seventy starting at eight and the baseball playoffs continuing this evening nationally divisional series getting underway starting with the brewers and Rocky's Milwaukee first pitch at five thirty seven the Dodgers in braids will square off out in LA first pitch their eight thirty seven\nAmerican League divisional series won't start until tomorrow with sports Fifteen and forty five passed each hour I'm Ryan ... W W J news radio nine fifty split sponsored by the Detroit regional chamber and all the traffic and why they make\nThe all new radio dot com app is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on and even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere\nListen and imagine [noise]\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nHi sixty to warm up Saturday up to Seventy nine sixty eight AT Metro at three fifty nine\nTo ... watch never style or sad news radio nine fifty to ODU afternoon I'm\nGreg Norman and I'm broke Allentown stories that had ... I have been caught nominee Brett Kavanaugh's confirmation on Saturday\nIn just about destroyed it good versus\nCBS News they'll have a live reports a dust up over local campaign ads are judge you and we'll have the details live and local\nPlus experts on it kicks in our in metro Detroit I'm Dr deanna light town coming out\nSports at four Fifteen the red wings open the whole season tonight at little Caesar's arena\nRight now cloudy and sixty degree\nRadio dot com it's for the\nCBS News on the hour sponsored by capital one I'm Jim ... hopefully we're forty eight\nHours away from having a new person on the screen for\nSenate Judiciary chairman Chuck Grassley pointing to Saturday's full Senate vote on Brett Kavanaugh now that an FBI investigation has turned up no corroborating evidence on those sexual assault allegation I feel very good about where this\nNomination is right now no I don't say that from the standpoint of counting votes I say that from the standpoint of the qualifications are this candidate\nDemocrats including New York's Kirsten Gillibrand say the FBI pros throttle by the White House\nThey didn't want to\nCome really didn't get to the bottom of what happened and judge Kavanaugh is a procedure\nWill vote will be held tomorrow Florence\nSouth Carolina city in shock after Wednesday evening's ambush of police Jim ... is there\nThirty seven thousand who called the city home are trying to make sense of the shooting up seven lawman one fatally mayor Steven will Kayla\nI've spent the last twenty four hours only half the leaving the stark reality of what is it for\nSeventy four year old print Hopkins is accused of shooting at sheriff's deputies and police officers as they tried to serve a search warrant at his home the Vietnam veterans bragged on line about having expert target shooting skills Jim Crow sewer CBS News Florence South Carolina\nA Justice Department says seven members of a Russian military intelligence agency had been indicted for allegedly being involved in a global hacking conspiracy justice security chief John ...\nI Hope that through today's charges which fall far from the electoral arena of our fryer charges we can further educate ourselves as to the scope of the Russian government's disinformation an influence campaigns\nChina's being accused of planning super small microchips the size of a grain of rice electronics manufacturing for companies like apple and Amazon with the intent of stealing technological secrets\nAssuming that this really is an indication of a step up in terms of\nThe cyber warfare that's going on it it could have really big ramifications down the line for the way the tech industry works she nuts insure it's unclear how many of these ships actually got into apple Amazon or how many of these servers are affected that's one of the things we don't know\nIt doesn't seem as though it's affecting consumers so and that's a good news there\nThe equipment was manufactured in China for us based super micro computer or germ LA on the death of one Romero and he was the hotel bus boy who came to senator or if the ... Robert F Kennedy said when he was assassinated at that end bash at her hotel in Nineteen sixty eighty was sixty eight years old this the CBS News\nThis is the CBS News brought you buy a new capital ones saber card earn ... percent cash back on dining in entertainment to present a grocery stores and one present and all other purchases once in your wallet\n[noise] washing never saw on Detroit's number one\nForty or fifty leading into\nGood afternoon thanks for joining us on this Thursday October the fourth time ...\nAnd I'm Brooke island for W. W. J. needs radio nine fifty\nChillier tonight a lot of places will get back to the thirties and we'll see some showers tomorrow unsettled through Saturday to complete actually with a forecast is coming up\nNow mostly ... sixty six degrees that he trained to the airport wins out of the north at forty miles an hour W. W. J. news time for like three\nThe election is on the horizon the campaign back and forth on the race for governor continues with Republican bill shooting calling out his Democratic opponent over an ad W. W. J. news radio and fifties John Hewitt live and local with the details here John\nGreg he's actually pointing out two elements of the advertisements that he's taking issue with specifically dealing with Michigan's pension tax and insurance coverage for preexisting conditions Mr ... says he is always fought to protect pensions and he will continue to fight to eliminate the pension tax and that he will support healthcare coverage for those with preexisting conditions\nThe opposite of what he claims Gretchen ... her campaign at least is putting forward in advertising\nJudy labeled himself the comeback kid just over one month away from election day\nWe're going to let on election day for a number of reasons one is issue of uh uh you know reducing taxes and making sure that if people get to keep more what they are and the government takes less election may\nLowering auto insurance rates in third grade reading scores and uh uh the real central question is are we going to go for the going back\nNow some of the polls were hitting Greg say that Mr ... double digits behind of likely voters with likely voters to Gretchen wherever he claims he's about six or seven percentage points back either way he has some ground to make up with roughly one month ago reporting live and local in Detroit John Hewitt W. W. J. news radio nine fifty\nIt's an update you a story we've been following out of Detroit and we're learning more details about the bribery allegations against Detroit city council ... who was indicted today WW Jane is waiting I says he's Seventy Davis live and local with the latest Stephanie\nAnd broke I just read through the indictment and according to the U.S attorney's office councilmen gave Lee land in May of twenty seven teams met with this business owner to talk about helping this man in an effort\nTo keep the city from selling his property in exchange the businessman within give Leland Fifteen thousand dollars well during this meeting ... allegedly told the businessman that quote you should ask for thirty thousand but said I'm nice to you in quote us attorney Matthew Schneider when\nIs the only person in this today's indictments who's an elected official whose church and the allegations are essentially that he accepted bride money in exchange for his official acts which are or were votes in the city council Detroit\nIt's alleged that a legal and collected on that Fifteen thousand dollars around Seventy five hundred dollars the indictment also mentioned another person ... grubs who was used to transport they said the money from this business owner to count mentally land reporting live in Detroit Stephanie David W. W. J. news radio nine fifty\nRally held today calling for a whole to water shuttle soon Detroit W. W. J. city beat reporter Vicki Thomas has the story\nMany of them are religious leaders of various face\nThere is a various face gathering here along the waterfront for prayer ahead of a news conference on water shut off here in front of the spirit of Detroit that you\nMonica Lewis Patrick led the rally\nAnd the fact that [noise]\nI don't know how that happens in this\nWell we don't want it apartment in Michigan [noise] even called ships giant whale\nWe find ourselves what to\nDo with money\nOne that's not available to those that don't hop on Vicki\nThomas WW Jane is radio nine fifty\nThat he tried water and sewage department meanwhile says there are multiple options for customers who are facing potential water shut off so far this year twelve thousand customers have been shut off that over Seventy percent had service restored plenty ... the deputy director and chief engineer of the Detroit water and sewage department\nShe says low income residents have help available\nThrough maybe I was before the water residential assistance program that is a minister Wang metro community action agency that threat than that and more than eight million dollars has been set for low income residents and payment of their water bills including hunting repairs\nMobley says excluding accounts that were shut off because they were illegal there are only a thousand to Fifteen hundred customers currently without water service\nW. W. J. news time for a way it is time for driving whether together every ten minutes on the aid from the motive for traffic center brought you this hour by Motor City many and let's\nCheck in with Katie in Ann Arbor good news I Ninety four west on after your ... through this crashes and clear though looking through the ... dam camps are still slow and go from South Huron street\nAlso sing the afternoon Dr pick up on us twenty three north and south found between Boston not avenue in Plymouth road traffic is sponsored by X surgeon looking through the ... at the ride home I two Seventy five north and south I'm picking up\nBetween six and eight mile road and also six Ninety six you're slower from orchard like wrote to the two Seventy five I Ninety six interchange\nReady for a bad cold and flu season knowing when it's the flu can make a big difference and knowing when to call the doctor\nThe best way to tell that the flu is the best way to tells of the flu brings a fever so be prepared for the thermometer you can trust the extra Jim temporal scanner in the ... twenty four hour traffic center Casey for W. W. J. news radio nine fifty and the exclusive\nW. W. J. news time for a fee [noise]\nDie for trafficking whether together on the eight sponsored by higher ed Dunn dot\nCom and Katie a new problem\nOn six Seventy six east founded this crashes right after Coolidge and it's on the left shoulder now right after this crash roadwork has traffic heavier to Ryan so you're a heavy six Ninety six east bound\nFrom before Woodward to Ryan and now tips to rocky called and he said at the traffic lights they're not working correctly at seven mile at the end ten service driving Detroit's on things down now it's time for the electrical workers local fifty eight construction alert I Seventy five north down from simply the north mine only one lanes going to be open\nStarting at nine to nine to five am tomorrow morning and then again it's going to go\nAll weekend long starting friday at night and roadwork will cause delays in Beverly Hills Michigan Southfield the roads between twelve and Thirteen mal roads only you're outside right lane both north and south time will be open that's going to go through mid November in the adult that motive twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nNow the weather forecast for the family heating cooling and electrical others that are\nChillier tonight mostly cleared out of forty four upper thirties in the suburbs I'm for tomorrow will turn out mostly cloudy total showers around mainly in the afternoon I sixty to shower thunderstorm in the ... fifty eight\nO. C. gladly for Saturday warmer a thunderstorm around I Seventy nine ... Sunday I Seventy three wars Monday thunderstorm in the afternoon I Seventy nine\n... accuweather meteorologist John fear ... news radio nine fifty\nRight now in Ann Arbor we've got sunny skies and sixty seven degrees sixty two over in Grand Rapids is sixty degrees in Flint sixty six now it's city airports sixty five and loan ya and partly sunny sixty eight at Detroit metro\nNow on news radio nine fifty to oh good afternoon\nI'm Greg boom and I ... a record number of opioid deaths in Michigan the health department says one thousand nine hundred forty one is the highest number they've ever seen that's in nine percent increase in twenty sixteen\nDemocrats and Republicans both adjusting wrapped up FBI investigation into sexual assault allegations against Supreme Court nominee Brett Kavanaugh while Democrats say it's incomplete Republicans are feeling more confident adding it was all just a smear campaign\nAnd they were pretty much anything they want you to go to ... to do so you know robberies and really never knew\nThat his Wisconsin Republican Senator Ron Johnson mourn alive update from CBS News at four thirty one\nNext week Jason ... W W J news radio nine fifty\nCatholics in metro Detroit reacting to attorney general bill ... investigation into how Michigan Catholic dioceses have handled clergy sexual abuse of minors searches executed on Wednesday a diocese in Detroit lands in Grand Rapids Saginaw Marquette Kalamazoo and Gaillard\nJonathan ... father of three children to attend the shrine Catholic school in Royal Oak\nAre there certainly is an image problem the\nCrimes that they are investigating are\nInexplicable I'm terrible and by an institution that old itself out to be a beacon of light and goodness in the world so a whenever you tarnished that and then cover it up a it's kind of a double whammy and so yeah there is absolutely and I'm a trouble\nMany of the dioceses have been conducting training and background checks for more than Fifteen Years along with instituting sexual abuse reporting procedures W.\nW. J. news time for twenty three [noise]\nIt's it's well K they give away I W W J news radio and I think at the end is ours key word is cheese techs chief the H. E. I. C. seven to eight one for your chance to win one thousand dollars message and data rates apply remember their ... syndrome\nWhat we saw the fall off on the market today look at your money next W. W. J. news time for twenty three\nThe all new radio job job that is available now it's a totally new experienced it with listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers do you based on you're listening to the news and information you're relying on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nOr anywhere [noise]\n\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has blocked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting as a\nI'm going to return the kayak\nConey ... how about a tax the\nTeenager head or the force by the way to find a neighborhood park or green space meaning you ... the U.S Forest Service\nA second woman has come forward one of her or\nWe can use seen what's happened to the FBI cirrhosis signed\nIn here I Believe are telling the truth\nAmbitious con artist every day has been on mass headed off as the best that today as saying before the United nations we allow happened to be there and I am innocent to\nYou W J\nW. W. J. news time is four twenty five\nFor business from the suburban Cadillac of Troy business death\nPenalty to find he has our Bloomberg Business reporter Dana Lisa what a day\nYeah that's about it broken grad we saw deep losses the Dow fell two hundred one points and settling at twenty six thousand six twenty seven NASDAQ lost almost two percent\nMore than one percent real estate and consumer shares were hard hit and tech was under pressure the sole bright spot where for and that financial after the ten year yield poked above three point two percent for the first time in seven years\nThe number of layoffs announced last month surge forty four percent from the month before that from placement firm challenger gray and Christmas\nUs based employers reveal plans to slash nearly five hundred fifty make that fight fifty five thousand three hundred jobs in September let's make it any worse than it was but nearly half of that came from one place as a response to the switch to online banking options Wells Fargo said it would cut about twenty seven thousand jobs\nCould allow features in the red today finishing you're Seventy four and a half dollars\nI'm Alisa parental with a Bloomberg Business report on WW Jay news radio nine fifty\nCents a local interest sponsored by plant ran wealth management General Motors close that thirty four dollars and twenty six cents with a gain of twenty six cents mascot last forty cents closed at thirty six dollars an eight cents and world full closed that one hundred Thirteen dollars in Ninety three cents with the loss of forty four cents\nAnd we'll check out the ride for you and the forecast drive again whether in one minute W. W. J. news time for twenty seven\nThe all new radio job job that is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love you know will save your favorite stations and\nOthers do you based on your list of news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nAnywhere [noise]\n[noise] hey Sean Spicer and every mid term elections since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political part gas\nCovering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nW. W. J. news time is now for twenty eight\nWhether together and Katie what are you watching we just picked up a crash on I Seventy five north on after nine miles on your right shoulder and traffic is low from before the Davison freeway already with a ride home I six Ninety six\nEast bound right after Coolidge got a crash on your left shoulder now after this crash some roadwork this clearing out of your way is causing traffic to be heavy to just pass Ryan and we've got reporter traffic lights not working slow me down in Detroit at seven mile wrote in the end ten service drive\nAnd rode workers are going to cause you delays Southfield road between twelve and Thirteen mile roads only you're outside right lane\nBoth the north and south bomb will be open this is going to go through mid November and until five this afternoon the Southfield freeway north on ramp to Ford wrote eastbound disclosed also the Ford wrote road east bound ramps to the south field north and south bound closed again that's still five this afternoon\nNow if you see a problem on the road give us a call and the W. W. J. tested line to forward for two three six W. W. J. looking through the triple a jam camps in the downloading of twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nReactor weather forecast meteorologist John fear exist clear and chilly tonight low forty four down to the upper thirties some of the outlying areas tomorrow cloudy and cool with a shower at a high sixty two mostly quality warmer Saturday more humid\nWith the ride home added in there and we have reported traffic lights not working ... down in Detroit at seven mile road and the and ten service Dr\nMaking your corporate holiday party different this year book it now on the Detroit princess riverboat they're heated and the closer you can celebrate any party political fundraiser\nOr birthday all year long cruise with on the Saturday or Sunday for lunch or dinner called eight seven Seventy T. B. O. H. T. or Detroit princess dot com in the idol downloaded give twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nAnd the accuweather forecast now the update and meteorologist or John ... yeah real seesaw here or does it looks like go to cool down and then the warm up again\nYeah absolutely kind of a chili night out there for tonight but nothing really out of the ordinary for October down to forty four tonight and be in the upper thirties a lot of suburbs tomorrow clouds a work back and again during the morning probably dry for most of the morning but then we'll see some showers move in by the afternoon\nAnd a few showers will be around tomorrow afternoon into tomorrow night thought about sixty to some showers and others don't or like down to fifty eight warmer for the weekend or mostly cloudy for Saturday couple showers under still run I Seventy nine Sunday mostly cloudy I Seventy three still warm Monday maybe an afternoon thunder storm a Seventy nine\nOr another ultimately forty eight percent when north of Thirteen ... thirty four and more modern rising Pontiac you're cool sixty but Ann Arbor sixty six metro sixty eight go down to forty four this is active but there's John ... W J news radio nine fifty and\nTogether every ten minutes on the AIDS and all these on line whenever you need it at W. W. J. news radio dot com\nComing up on news reading a nine fifty or we're going to take you to Jeff Gilbert at the Paris auto show and he says Chinese carmakers getting ready for the U.S market\nWell I'm Glad you enjoyed it but I think it's that had back in\n... I'm sure they'd be careful getting out of a\nI'm going to return the kayak\nHow about a taxi\nTeenager head to the point that I can find a neighborhood park or green space meaning you about your body temperature in the U.S car service\nConsumers energy invite you to check out our small business marketplace the energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers save on smart thermostat deli the bulbs wiping solution and more consumers energy part of a small business pulls helping Michigan businesses save\nEnergy and money which is consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nPresident whether to gather on the apes and breaking news first came up to date on the road every\nNewsworthy nine fifty\nW J you sign up\nTransforming JFK international airport in New York governor Andrew Cuomo says it will go from an aging facility to a world class air travel has been a seven year\nThirteen billion dollar transformation he says the improvements will increase the airport capacity by at least fifty million passengers a year it\nCurrently handles about sixty million annually conception is expected to begin and twenty twenty the first new gates are scheduled to open for years later with most of the project completed and twenty twenty five\nChinese carmakers gearing up for the U.S market WWE Jay ought to be reporter Jeff Gilbert has details from the Paris although show\nChina's G. U. C. which at a big exhibited Detroit has a large display here in Paris too despite uncertainty about trade they see the U.S is a potentially big market Edmunds analyst Alister Weaver says they're not alone\nThis very day future of this by there's a lot of bronze that at the moment most people would ... but I guarantee in in ten years time they weren't all all survived the run ... but some of these problems are going to be household names ...\nChinese brands are hiring global auto industry veterans do at experience to help them on the west at the ... show I'm Jeff Gilbert W. W. J. for your own move\nAnd the red wings getting ready to open their season will take it a little Caesar's arena with sports coming up and just a moment\nThe all new radio jak combat is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you were saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect she'll be sure to download my new podcast everything's gonna be All right beginning in October ... an hour\nHe first fits just about an hour from now doctors and raise me last week off out in LA with first pitch at eight thirty seven\nWas four Fifteen and forty five pass each hour I'm Ryan ... W W J news radio nine fifty\nAnd will hit the roads for Catholic and where their next\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off and eat anything green is my school diploma I could not have done it alone I see the future is really\nNo one can alone if you are thinking in your high school diploma you have now signed free on education and your you finish your diploma dot org run he made a Dollar General litter nation and the\nConsumers energy invite you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat they'll leave evolves wiping solution and more consumers energy part of a small business pulls helping Michigan businesses save energy and money was consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy Conan us\nThe all new radio jak combat is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on you is it a news and information you rely on even when you are near radio you can take this station when you're on the go\nThe traffic is very heavy coming from six Ninety six west pounded orchard like road and in Madison heights got a broken down vehicle Sonia down on John are north on at eleven mile\nBlocking lanes tips are Dennis called that and that if you see a problem on the road because it's called the WWE tips are lining up to forty forty three six W. W. J. N. E. downloaded give twenty four hour traffic sensor Casey for example the devil detainees ready in Nineteen fifty knock\nYour weather forecast and John fear excess clear chilly tonight was forty four downtown upper thirties in the outlying areas cloudy cool tomorrow with a shower high sixty two Seventy nine on Saturday sixty eight that with metro\nThe news watch never diverse sneezes radio nine fifty to old ... afternoon\nI'm ... and I'm broke a gallon senators gearing up to vote on Supreme Court nominee Brett Kavanaugh selling a weeklong FBI investigation into sexual assault claims CBS News will have ... plus child\nRape victims are asked to come or I'm Jason has gotten [noise] also ahead Virginia Republican or a local bill shooting falling out an attack\nFrom the ... campaign it's just more they're misleading about an ad that is just not true I'm John ... CBS News coverage of the world bank\nRadio dot com\nIt's five o'clock [noise]\nThe CBS News on the hour with Jeff blower presented by their works relief\nGoods Thursday Afternoon a procedural vote tomorrow in a full Senate vote on Saturday to confirm Brett Kavanaugh to the Supreme Court that is the plan for Republican lawmakers after they say an FBI reports on no corroborating information on sexual assault allegations made against Kevin a Senate Judiciary committee chairman Chuck Grassley says it's time to vote\nThis person is very well qualified a person that believes in the principles of due process the presumption of innocence and readiness to serve our recognize so judge Kavanaugh should be confirmed on Saturday\nSenator Dianne Feinstein the panel's top Democrat says the FBI report is incomplete\nDemocrats agreed that the investigations so should be limited we do not agree that the White House should tie the FBI's hands it's simply not credible to say that public testimony in last week's hearing is a substitute for interviews by FBI agents\nWe will have much more of this story and tonight's CBS Evening news many in Florence South Carolina are still reeling following the shooting of seven police officers one fatally late last night we're learning more now about the suspect\nI'm ... and Florence south you're allowed to the man accused of opening fire on law enforcement officers\nIs Seventy four year old Fred Hopkins ... lawyer Hopkins is in the hospital and unable to speak to investigators because of a head injury he's faced criminal charges several times a recent years the most serious paying a disorderly conduct charge in twenty four team\nTo the search remaining officers have been released now\nAsian that Russia would actually extradite or any of these people to face trial or face charges in a U.S court room that is part of an ongoing effort by the Justice Department can name and shame folks who hacked even on the half of foreign governments\nIndonesia's disaster agency says the death toll from last week's earthquake and tsunami there's no reason to one thousand five hundred and fifty H stocks took their biggest drop in two months due to fears over rising interest rates financial advisor to Johnson\nSome investors say this rising interest rates implies that this cycle this positive front and stock prices it's probably going to end at some point in time and maybe it's a good time to take some money off the table as the expression goes\nThey don't feel two hundred points the NASDAQ was up a hundred and forty five the U.S in the sink twenty three this is CBS News\nTo experience relief or muscle cramps and your legs and feet used their works really fast acting foam get their works relief today and the pain relief violate your local pharmacy or their works relief dot com\n[noise] wash never saw on Detroit's number one\nThe only\nGood afternoon thanks for joining us on Thursday October the fourth time read booming\nAnd I broke a gallon for W. W. J. news radio nine fifty\nChillier tonight down into the low forties in most cases and we'll see some showers tomorrow the complete accurate the forecast is coming up\nWe are seeing some sunshine I teach metro airport currently sixty eight degrees W. W. J. news time five other during\nThe election on the horizon and the campaign back and forth of the race for governor continues with Republican bill shooting calling out his Democratic opponent over an ad W. W. J. news radio and fifties John Hewitt has details from Detroit\nSaying he is in Detroit to set the record straight bill shoot him making an appearance with the Detroit police officers association\nTook aim at an attack ad being run by his Democratic opponent Gretchen whatever that ... says miss represents his position on Michigan pensions somebody Judy says he has long fought to protect and will continue to fight to eliminate the pension tax if he is indeed elected governor\nThe rank and piracy of a former senator witness to a runner misleading ad that's not accurate to imply state that I support the pension tax that's just not true\nRecent polls including one just yesterday show shoot he's still trailing by double digits but he disputes that saying he has polling data showing he's about six percentage points behind either way ground to make up roughly one month away from election day in Detroit John ... W W J news radio nine fifty\nDetroit city council ... cues and taking bribes has been indicted this afternoon WW Jane is ready nine fifty Seventy Davis joins us live and local with the latest could afternoon staff\nThey broke the U.S attorney's office alleges that gave Leland beginning back in May of twenty Seventeen conspired with one of his campaign workers to list the grown ups to solicit and accept the bribe a Fifteen thousand dollars in cash from a businessman who needed ... help\nThe businessman in dispute with the city over property wanted Leland to either delay or prevent the city from selling the property\nLeader now is facing one count of conspiracy to commit bribery and two counts of bribery us attorney Matthew Schneider\nWe and the Justice Department will continue to look at all aspects of bribery or corruption in the public because that's our mission our mission is to protect the public to protect the taxpayers and we're going to root out corruption no matter where it is\nAnd Leland faces up to ten years in prison and a sign of two hundred and fifty thousand dollars for each count of bribery and up to five years in prison it and signed up to fifty two hundred fifty thousand four\nSome in the final two hundred and fifty thousand dollars for each count of bribery and up to five years in prison and signed up to fifty two hundred fifty thousand for the other charge bribery toucan conspiracy count reporting live in Detroit Stephanie David W. W. J. news radio ...\nW W J news time\nFive of her\nProtestors today calling on the Detroit water and sewage department the stop shutting off service to low income residents in the city W. W. J. city bit reporter Vicki Thomas says more\nA couple of hundred people gathering here calling for the city to implement a water affordability planned among them Reverend Dr joann Watson a former city council member\nIt won't go away and I'm so glad that the they sent me an interfaith community diverse community it up and he is not today in front of the spirit that choice\nDemocratic nominee for Congress the sheet it totally but\nIt's hard it's hard for us to stand by and for myself to see a sense of urgency to give you know a big tax break the Ford Motor company for a building that's been empty for decades and when we have a public health crisis when the access to water is not available to just really real people that want to do the right thing to pay but just can't afford it\nVicki Thomas W. W. J. news radio nine fifty\nIn response that he tried to monitor insurance department says there are many steps being taken to reduce the number of shut off the department's deputy director and chief engineer ... says so far this year twelve thousand shut up have been executed but over Seventy percent has been restored a vast improvement from the past\nThe number three years ago was almost forty thousand account or service had been interrupted we also have online uh and ... for the payments appliance so we've made a huge number of strive to try to improve customer service there used to live out the door when there were certainly interested and you don't see those same lines anymore\nMobley says that the department is also working to help low income residents making plumbing repairs to their homes and in that infrastructure problems in older houses can cause them to have higher than average water bells\nExperts in addiction everything from the opioid epidemic to marijuana developing you know vie for a conference on treating addiction W. W. J. health reporter Dr ... says more\nWhile the opioid epidemic is front and center experts say the next public health concern especially among young adults is vaping Raymond Waller is the director at ascension brightened Center for recovery\nSo something is not only nicotine with marijuana and there's a lot of different uses for these what tomorrow devices there's a lot of bird that we are creating another crisis\nWilliam ... with the hazel and Betty Ford foundation and Minnesota shared his story of addiction to let others know recovery as possible\nThere's anybody out there who's struggling no you're not alone\nKnow that it's okay to us and know that if you ask for help you'll get recovery musicals happens in Michigan every single day\nFrom the delta dental health desk Dr deanna lights W. W. J. news radio nine fifty\nW. W. J. N. used on five oh wait time for your weather together every ten minutes on the age running out all the motives of traffic center brought you this hour by portion of the motor city\nOrchard lake wrote coming from six Ninety six west bound traffic is sponsored by buffalo wild wings got an accident on the night before east on entrance ramp\nFrom liver annoy and this is on your right shoulder and we just picked up another crash on east bound I six Ninety six is right after college and it's on your right shoulder in Taylor telegraph sell some\nAh before you're the wick road crashes slowing down black and Elaine in Madison heights a reporter broken down vehicle John ... hour north bound at\nEleven mile this was back in the lane and traffic lights are out in Taylor at eureka beach daily touched their Sarah called that one and now it's time for the national electrical contractor associations construction alert\nAnd so a Bert ... Beverly Hills I was gonna say south fields on south Philly road between twelve and Thirteen mile rose only you're outside right lane north and south bound will be open and I was going to cause delays through mid November in the idol downloaded go twenty four hour traffic Center for W. W. J. news radio at fifty\nNow the accuweather forecasts for the family he didn't growling and electrical weather center\nChillier tonight under mostly clear Scott out a forty four upper thirties and some suburbs\nRural turning out mostly clouded probably drive the morning we'll see some showers around during the afternoon I sixty to\nShower soldier so many area tomorrow night especially later although fifty a couple of showers and thunder storms in the area Saturday much warmer ... Seventy dollars mostly cloudy Sunday I Seventy three warm and humid Monday thunderstorm in the afternoon high Seventy nine this is active with everybody around just John fear ... W J news radio nine fifty\nNow partly Seventy six\nThis is actually but there were the urologist John fear W. J. news radio nine fifty\nRight now partly sunny sixty six degrees in Ann Arbor him in a row it is mostly sunny and sixty seven and then it is sixty one\nFive dollar game day pitchers cocktails cheeseburgers and brought when football is a you have to be a buffalo wild wings price and participation very\nNewsworthy or nine fifty afternoon I'm Gretel\nAnd I've read gallon distressed in body has been pulled from the Detroit River police in Windsor say was discovered near festival ... at riverside drive and ... street over there and investigation just beginning president\nTrump echoing several Republicans expressing confidence in Supreme Court nominee Brett Kavanaugh he spoke to a cheering crowd is the deep planed in Minnesota they had a rally in Rochester\nWell judges [noise]\nDemocrats feel the investigation wasn't thorough enough the latest in a live up to ... from CBS News at five thirty one\nLocal experts say more people are seeking help for eating disorders and it appears to be in part due to the me too movement WW Jane is waiting in a fifty cent or McNeil\nReports psychologist Christine ... says there are no hard numbers but she and her colleagues have noticed an increase in those seeking help for eating disorders often she says they can be related to trauma such of that experience by women in sexual assault\nEating disorders though she says are complex with environmental factors also playing a role as well as biology for some people it's in the genes\nNobody causes an eating disorder so a lot of times significant others or parents will blame themselves we know that's not true so no one person causes need this order and the person who's sick is also not response or it's not a choice it's not something that are intentionally choosing to do no quite the opposite the people that we work with are suffering a great\nDeal designer was co founder of the new ... square like in Bloomfield Hills there is an open house for the public Sunday from noon to two senior W W changes radio Ninety\nOne luxury carmaker not convinced about electric vehicles W. W. J. ought to be a reporter Jeff Gilbert with the story from the Paris auto show\nOut humorous eighties and jaguar all have high Andes these are the show what relaxes brand experience manager Michael ... says they have no plans yet and not well electric for less than one percent of the market\nAs that change gets project to change over the next five to ten years than you'll see that will have a presence wherever it makes sense for consumers want us to be but today without a doubt the most viable option in Europe or soldiers are\nThe majority of Lexus vehicles sold here in Europe or hybrids and the Toyota brand here is nearly\nHalf hybrid covering the Paracels show ... W W J ...\nW W J news time five twenty three [noise]\nIt's the twelfth they give away on WWE Jane is made unite fifty and this hour's key word is bark text bark B. A. R. K. to seven to eight eight one for your chance to win one thousand dollars message and data rates apply and remember don't text and drive\nOr has no co pay trauma diary of\nYour diary there's something about protecting people's homes to progress at that inspires me because I just had an idea for a book well it was originally an idea for a movie based on a plane inspired by a pocket but the idea of how you can see when you bundle home an auto ... may not be the best idea for a book\nShe been averages Seventy percent car insurance when you went to home in order for Russia maybe or radio commercials I guess we'll never know reserve casualty insurance company and affiliates discounts not available at all stricter situation\nThe all new radio dot com that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list saying it's a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party is locked in an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I to\nW. W. J. sent by forty five time for business suburban Cadillac employed business that sponsored by fled Iran wealth management\nJak Ballenger has that Bloomberg Business report\nStocks took a pounding the Dow Jones industrial spelled two hundred one points or three quarters of a percent close at twenty six thousand six twenty seven\nThe NASDAQ close one hundred forty five points or one point eight percent lower the S. and P. five hundred last twenty four points or a ... percent\nShares of Barnes and noble rose Twenty one percent on reports of potential suitors for the bookstore chain and people are still upbeat Bloomberg's consumer comfort index edged hire this week to a new Seventeen year high\nBut the people in the corner office was turned a little less optimistic over the summer the conference boards measure up CEO confidence declined and the third quarter interest rates on thirty year and a Fifteen year fixed rate mortgages to lower by a hundredth of a percent this week\nFreddie Mac says the average rate on the thirty year fixed rate home loans for points Seventy one percent\nThe average I'm the Fifteen year ... point Fifteen Percent\nI'm Jeff village or with Bloomberg Business report on W. W. J. news radio nine fifty\nStocks of local interest sponsored by plant Moran wealth management for your Christ they're closed at Seventeen dollars and fifty five cents a lawsuit Fifteen cents and lazy boy I lost Seventy three cents closing at thirty dollars and sixty two cents\nImagining a better bank starts with looking at the savings rates most banks offer in saying really\nCapital one is building something better you can open a capital one savings account with one of the nation's best savings rate from anywhere like here for here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere that's banking re imagined what's in your wallet for consumers only offered by capital one and a member of the copyright twenty eight and capital one\nAnd you know an ad from um [noise] my home in auto with\nProgressive and have on your car insurance [noise] excuse me maybe we should add in the word money so they know that they're seeing and money\nAnd then in K ... hello just now to me OK well he's\nGot enough funds to pushing their progressive can't see from becoming your parents but we can see if you money when you go home and progressive casually insurance companies really us and other insurers there's not a little stricter situations\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off at age twenty four Karim ... is a nice little coma I could not have done it alone I see the future is really no one can\nThe all new radio dot com that is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list is a news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n\n[noise]\nWWF news time by twenty eight I protest began whether together every ten minutes on the AIDS in years K team's\nGotta broken down vehicle on I ... for no vi rode his bike in the left lane and shoulder and with the ride home traffic is heavy and slow for more to like road\nComing from six Ninety six westbound on six Ninety six eight founded the Coolidge gotta crass underwrite children looking through the ... the ride home already has traffic heavy and so from telegraph in Seattle downloaded give twenty four hour traffic center Katie for W. W. J. news radio not fifty\nLooking to the gym camps in Seattle download a group of twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nAnd the accuweather forecast now the update and the the forecast now and meteorologist John\nFair chillier tonight I mostly cleared out a forty four upper thirties in suburbs rural turnout mostly caught a couple of showers around mainly in the afternoon a high sixty two mostly clouded Martin I couple to showers with a bumper sticker around especially after midnight below fifty eight\nYou showers and others around Saturday some show can be strong highly upper seventies near eighty ... Sunday I Seventy three Monday clients and set up a storm in the afternoon I Seventy nine ... brothers John fear can WW Jay news radio nine fifty\nBy now sixty four degrees in Sterling Heights it's also sixty four and cat and\nWell this Michigan a high school students may have found a new way to campaign for votes but to may not have been the right way to do it that\nThe all new radio job job that is available now it's a totally new experienced it which listening at your fingertips we made it easier than ever to access to radio stations you love now will save your favorite stations and\nOthers to you based on your list your news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nOr anywhere [noise]\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has lost an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's going to be All right beginning in October ... an hour long weekly political tide gas\nCovering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nDecided to metro area\nFor the use of it is a new time five forty one [noise]\nOf anti or in county high school student may have found a new way to campaign for vote [noise]\nDeal with campaign slogan a chicken in every pot might be updated to be some pot in every pot belief in Michigan say a Seventeen year old high school cheerleader try to use marijuana laced brownies at an effort to be voted homecoming queen\nAfter getting a tip police got three brownies from students at Hartford highschool incentive to a crime lab for testing authorities said the cheerleader at our mother will be interviewed once they return from a trip Pam culture CBS News\nW. W. J. news time five forty to education today sponsored by Oakland University\n[noise] nine years ago open university admitted its first year medical student when they become doctors do they stay in Michigan hoping universities Dr Linda Guillen says some doom and others don't those reasons and range from that type of\nTraining they want to get in and some state because it's the type of training they want to get here\nSometimes they do leave the state for training and come back Dr ... says she had her training on the east coast and then returned to Michigan to raise our family\nWe see any of them actually finishing up their training now\nOn the east coast and then return to Michigan to raise her family\nWe see any of them actually finishing up their training now heading back ah contacting saying they're coming back to practice\nDoctor Gillum says she enjoy seeing her former students in Michigan hospitals Laura by now W. W. J. news radio nine fifty\nMost of my family they never graduated high school so I'm trying to break that barrier my daughter Brooklyn was also motivation for me to go back to school every day after work went straight to school and it paid off\nAt age twenty cents Corinne my school diploma\nI could not have done it alone especially the future is really right for me\nNo one can give them alone and if you are thinking in your high school diploma you have now signed free adult education classes near you finish your diploma dot org Brian he went a Dollar General litter nation and the and you know all\nThe all new radio job job that is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list and I get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot map on your smartphone\nFor anywhere\nHey Sean Spicer and every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October ... an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I can\nImagine a better bank starts with looking at the savings rates most banks offer and saying really capital one is building something better you can open a capital one savings account with one of the nation's best savings rate from anywhere like here for here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere bats banking re imagined what's in your wallet for consumers only offered by capital one and a member of the copyright twenty eight and capital one\nWhere the big problem I Ninety six west bound for nobody eroded disabled vehicle Sloan you download checked trafficking whether in three minutes\nW. W. J. news time\nFive forty five is diverse force today Ryan will be found to be a little Caesar's arena for\nRed Wings over there and we're was just\nThe other the buck here will seize\nArena at seven thirty there Greg sevens and of course the pregame over a Ninety seven won the ticket as the wings in the Columbus blue jackets of course Red Wings a young team this year and any of the guys are says was such a young team it is up to the vet helped guide the youngsters along\nI mean you know the the way I see it as a you know when I when I first came in Italy you know a lot of the older has been kind of just what to do some little touch here and there are about you know\nMaybe maybe guys tendencies on the other team or what they like to do um you know I remember looking at the lineup before every game and you know ... or biggie record say like you know watch watch this guy he likes to smooth over you know there's a lot you know and the power play they're like\nFor this play stuff like that so you know it's I think it's just little things like that and um you know and try to make you feel comfortable as we've had\nA Columbus does come in on a bit of a hot streak against Detroit they've won the last six that are over the wings of a dominant home they'll withhold openers they've won five straight you can again here it on several on the ticket at seven than if you're coming to the games are asking fans ... seat by seven Fifteen for the special pre game show\nYou got a seven than if you're coming to the game they're asking fans to be in your seat by seven Fifteen for the special pre game show\nThat's been alive that wants to go with your workout sedate Allen park continuing to get ready for Sunday showdown with the pack from Ford Field they did get back with your borders set out yesterday due to an illness DJ laying you I Harold like Robert de never lost an all remains sideline\nWeek five focus going tonight in the NFL New England playing host of the Colts that one on CBS Sports radio twelve seventies starting at eight\nAnd the baseball playoffs continuing tonight National League divisional series getting underway it started with the brewers Iraqis Milwaukee looking just under way it's ... and the second Dodgers and Braves ... out in LA first pitch there is an eight thirty seven\nWith sports Fifteen at forty five pass each hour I'm Ryan ... J news radio nine fifty\nWill tell you about the problems you need to scare around and how chilly it will get this evening with traffic and whether it makes\nThe all new radio jak combat is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list of news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\nHey Sean Spicer and every mid term elections since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be alright beginning in October Katie Palestine I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... a message by the by the national Highway Traffic Safety Administration project yellow lights noise and the ad council\nW. W. J. new signed five forty eight trafficking whether together on the eight\nAnd let's hit the roads with Katie and a couple of channels not KTBS uh traffic is sponsored by credit ... disabled vehicle that's Loni down there is now on your left shoulder though\nIt's I Know the six ... before no vi road with the ride home traffic is very heavy and slow from before or to grow down six Ninety six west down as far as I can see through the triple a jam cams six Ninety sixty Spanish Coolidge a crash Sunday right shoulder with the ride home you are heavy and slow in pockets from before telegraph\nAnd the accuweather forecasted John fear exists clear quite chilly tonight was forty boredom celibacy thirty some of the outlying areas buddy cool tomorrow with a couple of ... hours of the high sixty two much warmer Saturday with a show or the high Seventy nine right now at Detroit metro airport sixty six degrees at five Fifteen\nOr the news much never saw a news radio nine fifty to old ...\nAnd I broke ... Republican skim the confirmation insight for Supreme Court nominee Brett Kavanaugh and it\nJust about [noise] destroyed [noise] good [noise]\nAt least for a key senators have yet to reveal their votes CBS News will have a live report\nAlso coming up a Detroit city council member has been indicted on bribery charges\nAnd red wing season opener festivities underway downtown John ... CBS News covers a world\n\nIt's six o'clock\nNews CBS News on the hour sponsored by Dell's small business I'm Pam Coulter\nActress Amy Schumer was among scores of people arrested during a protest of Supreme Court nominee Brett Kavanaugh and his Senate office building a confirmation vote is expected Saturday an endangered North Dakota Democrat Heidi Heitkamp plans to vote no\nWe aren't in that kind of situation but I Do think that in several instances there was problems with this testimony based on the facts as we know\nDemocrats called the FBI report on Kavanaugh a sham a whitewashed and a cover on CBS this bill re cough Republicans Senate Judiciary\nRepublicans like Senate Judiciary committee chairman Chuck Grassley said they saw no corroborating evidence or the FBI background report on Brett Kavanaugh that would backup Christine Blasey Ford's accusation that he sexually assaulted her in the Nineteen eighty two house party Grassley angrily slam Democrats for very nearly destroying comment on his words and\nSeriously damaging the credibility of the Senate as an institution in the process\nPolice in Florence County South Carolina continue to process the crime scene where a Vietnam veteran and disbarred lawyer allegedly shot set in law enforcement officers killing one police chief Alan Hi lurk paid tribute to officer parents' car way and the other officers who were wounded\nCops with their badges on every single day and they know for tragedy could away from the kiss their wives against their husbands I guess the significant others for the thoughts that they're going to return with everyone to protect the city so they're going to protect the\nApple and Amazon are denying a Bloomberg report that their data center equipment was targeted by malicious computer chips inserted by Chinese intelligence scene that ensure\nIt's unclear how many of these chips actually got into apple Amazon or how many of these servers are affected that's one of the things we don't know\nThe reports that Chinese spies had placed the chips inside equipment used by about thirty companies and some US government agencies\nA new study found women who took low dose aspirin had a twenty three percent reduced risk of getting ovarian cancer compared to women who did not take aspirin steady coauthored Shelley to Roger\nWe hope that this will open up a conversation for women with their physician about taking aspirin for prevention of cardiovascular disease considering that it may also prevent um of airing cancer in San Francisco\nArea hotel workers went on strike to demand job security in higher pay in one of the most expensive areas of the country the ... two hundred points today this is CBS News\nDo small business technology advisors no there's nothing small about your business they provide one on one partnership and reliable del PCs with intel core processor to get business done called eight seven seven by Dale\n[noise] wash never saw on Detroit's number one\nForty or fifty to only going to be a\nGood evening and thanks for joining us this Thursday October the fourth I'm Greg moment for W W J ... fifty\nEarlier tonight and then we'll see a few showers for tomorrow the complete actually with the forecast is coming up\nAnd the current conditions in Ann Arbor right now we've got sixty three degrees sixty six at Detroit metro trafficking whether ... W W J news time six oh three developing news this hour and investigation\nAfter a body is found floating in the Detroit River Windsor police officers were dispatched to the area near festival plaza riverside drive and ... street around three thirty this afternoon police have not yet released any information\nUm the victim we're learning more details about the bribery allegations against ... who was indicted today W. W. J. news radio nine fifty Stephanie Davis says the latest according\nTo the indictment counseling Caitlin it may have twenty Seventeen met with a business owner to talk about helping them and in an effort to keep the city from selling his property and it it just changed the businessman would give Leland Fifteen thousand dollars in cash during this meeting Leland allegedly told the man that he should ask for thirty thousand\nBut that he was being nice us attorney Matthew Snyder\nConstantly Lynn is the only person in this today's indicted\nAnd he should ask thirty thousand but that he was being nice us attorney Matthew Snyder\nConstantly ... the only person in this today's indictments who's an elected official who's charged and allegations are essentially that he accepted bribes money in exchange for his official acts which were votes in the city council Detroit\nIt's alleged that leads collected about Seventy five hundred dollars the indictment mentioned another person illicit grownups who was used to transport the money from the business owner to count mentally Lynn if convicted Leland could get up to ten years in prison for each bribery count in Detroit Stephanie David W. W. J. news radio mine safety\nOn the campaign trail Republican gubernatorial hopeful bill shooting made an appearance at the Detroit police officers association office on Jeopardy student in Detroit\nHe took issue with an ad being run against him shooting says advertisements by the campaign for Democrat Gretchen woodwork claiming he does not support a rollback of the state's pension tax or health care coverage for those with preexisting conditions are untrue\nWe're going to lead on election day for a number of different reasons one is issue of uh you know reducing taxes and making sure that if people get to keep more of what they are and the government takes less election may lowering auto insurance rates in third grade reading scores the real central question is are we going to go forward to going backwards\nRecent polls including went out this week so shooting double digits behind with her but she says his polls show him only about six or seven points behind with roughly one month to go to election day\nAnd water shut off in the city that's the call at a rally in Detroit today W. W. J. city beat reporter Vicki Thomas with the details\n[noise] people gathering for a prayer protest over water\nShut offs I asked Reverend Edwin row if he's had a chance to talk to Mayor Mike Duggan or water department director Gary Brown\nConversation with people who lie to you and people who won't give you information the\nW. as deep tells me there are one thousand to Fifteen hundred people who currently have their water service shut off road goes on to say\nWhen we could have had a plan that would allow them to pay what they could afford\nTo turn the water back\nOn the city gets more money\nAnd I just don't get destroyed who's mayor is he\nSure as hell isn't ours Vicki Thomas WW Jane is radio nine Fifteen\nIn response the Detroit water and sewage department says there are multiple programs to help those were struggling to keep up with their water bills but Lindsay a Mobley is the deputy director and chief engineer of the Detroit water and sewage department\nThere has been about twelve thousand service interruptions this year Seventy one percent of those accounts for restored and two thousand approximately two thousand accounts were found to be a legal\nMobley says shut up procedures are initiated when customers are delinquent for sixty days and have an overdue balance of a hundred fifty dollars or more\nTo the big night at little Caesar's arenas the red wings at the ice for the first game of the season W. W. J. news radio nine fifties John Hewitt is there he joins us live in local with more the excitement building down at the el ca John\nIt certainly is Greg and wings fans looking forward to this opener tonight against Columbus embassies in ahead Derrick and currently block made the right into a from Grand Rapids actually their season ticket holders even though they live across state and youth movement or not optimism is high with these two\nI think we at least making the rounds on lab you're say playoffs or buy\nA lot of new faces on the roster though oh yeah oh yeah\nI'm excited that good or bad that they've got some you [noise]\nYou're say playoffs or buy a\nLot of new faces on the roster though oh yeah oh yeah\nI'm excited that good or bad that they've got some you\nThey got a lot to learn but I think they can do it but then a couple of years we were building our team though it\nA lot of new faces indeed the wings roster will have names like rats Musa ... chronic leading some excitement to be sure as to what's ahead because frankly people don't know quite what to expect wings blue jackets seven thirty tonight the puck drops over on our sister station of course Ninety seven on the ticket\nAnd all that much more just a few moments with Ryan willy who's inside the arena coming up at six Fifteen in sports reporting live local outside of L. C. H. John ... W W J news radio nine fifty\nW W J died\nSix days away it is time for trafficking whether together every ten minutes on the age probably out all the motor group traffic center brought to you this hour by Audi of Rochester hills and hello Katie problem on us twenty three\nLearn more at powering Michigan's future dot com the best contractors the best electricians period looking to the ... dam can't stand the idol downloaded give twenty four hour traffic center Katie for WWE Jamie's radio nine fifty\nTrafficking weather is sponsored by John Legend in concert now the accuweather forecast family heating cooling and electrical weather center and John fair\nChillier tonight I mostly cleared out of forty four up or thirty cents of suburbs\nRural turnout mostly go out a couple of showers around mainly in the afternoon a high sixty two most excited about ... hours of the thunderstorm around especially after midnight below fifty eight\nThe showers and under so around Saturday some shows can be strong highly upper seventies ... eighty ... Sunday I Seventy three Monday clients are subtle thunderstorm in the afternoon I Seventy nine this is accurate there's John fear WW Jay news radio nine fifty\nAnd the current conditions now in love own you this hour it's sixty eight degrees Taylor at sixty seven sixty one at city airport sixty six degrees at Detroit metro\nCome spend the holidays with John Legend then his a legendary Christmas tour coming to the Fox theater December six got tickets Rodney ten am it lived nation dot com and the Fox theater box office\nNow on news radio nine fifty to all the\nGood evening I'm Greg Coleman here's what's happening at six twenty developing news of bodies been pulled from the Detroit River police in Windsor say it was discovered near festival closet riverside drive and go yo street on the Canadian side and investigation is getting underway\nProtest outside the Supreme Court today to voice opposition to Supreme Court nominee Brett Kavanaugh rape survivors such as this Alaska resident worn Republican Senator Lisa Murkowski to listen to them\nYou believe survivors matter\nLeave survivors\nRepublicans say the FBI investigation was Thoreau they're confident going into a vote the latest alive update from CBS News at six thirty one insect there county rape victims of a man of goes by the nickname Jaycee even asked to come forward\nJames Carlton Riley who has been convicted and served ten years for criminal sexual assault before was arraigned on Wednesday of two counts of first degree CFC with a child under Thirteen Years old\nSince being released from prison in Nineteen Ninety nine the sixty two year old Columbus township man had spent some time in the city of Warren because of that investigators believed there could be other rape victims\nCurrently held without bond Riley is due back in court next week Jason Scott W. W. J. news radio nine fifty\nW. W. J. news time is six twenty to your chance to win a thousand dollars in the twelfth grade they give away a news reading and I'm fifty coming up in one minute\nA pop up message on a computer screen that's not an ad and not a gimmick but it is worth mentioning here I'm Marie Feldman with the Feldman report on W. W. J. news radio nine fifty I visited the site where they offer you a free credit reports and your credit report dot com and before I could do anything on the site there was a pop up message an important one for us to always remember quoting\nNow although this website is very secure the wireless network that you're using to get the site may not be if you use your mobile device your personal information including your Social Security number may be at risk we recommend that you use a regular computer to get your credit reports\nWhile that's a great message to always remember a site may be secure but the way you get there may not be very important if you're transmitting sensitive information\nSports well that's a great message to always remember a site may be secure but the way you get there may not be very important if you're transmitting sensitive information the site again for free credit reports and you will credit report dot com with the Feldman report I'm Marie Feldman W. W. J. news radio nine fifty\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... unless it's ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council [noise]\nAnd it's the twelve kids they give away on WWE Jane news radio nine fifty the hours keyboard is truck\nTax the word truck T R U C K seven to eight aim on your chance to win one thousand dollars again text truck to seven to eight eight one for your chance to win one thousand dollars message and data rate supply remembered do not text and drive\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small businesses electric and gas customers\nSeem on smart thermostat they'll leave evolves piping solution and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy on com forward slash marketplace consumers energy count on us\nForeign\nRobert Robert somebody burned down my she shed no one burned down yes she she had Sheryl ... really victim because my she she had burning off in the backyard here she was struck by lightning Cheryl thriving State Farm cover my she shed what she said she turned out shelter hideaway Robert oh yeah that's card\nYou hear that I'm getting a new she she er she she asked can we stop says she said now\nThat was the one that here to help lifestyle right safe time talk to an agent today\nI'm Jay foreigner CEO of Quicken Loans America's premier home purchase lender we've created a new way to protect you from unpredictable interest rates are exclusive ... shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked\nBut you've rates go down your rate drops either way you win Carlos today at eight hundred quicken or go to rocket mortgage dot com\nRacial upheaval only about on certain three year fixed rate loan precaution permission and conditions equal housing Leonard licensing office he takes animal is number three thirty initial conditions are exclusion may play\nBut it takes a lot to get excited about back but most facts cats they be twenty percent parts and accessories that's twenty ...\nTwenty percent of oil filters twenty percent off virtually anything you can fit inside the Ninety nine cent Napa reusable bag so tell your buddies there's a bag they just have to check out quality parts couple people snapping participating up\nOut of our stores last was last minimum ... excluded supply offering seven thirty one Eighteen\nW. J. news time is six twenty five time for business from the suburban Cadillac of\nThat Jeff balance or with our Bloomberg Business report rising treasury yields raised worries on Wall street stocks close sharply lower the Dow Jones industrial fell two hundred one points or three quarters of a percent twenty six thousand six twenty seventh\nThe NASDAQ closed one hundred forty five points or one point eight percent lower the U.S and the five hundred last twenty four points or eight tenths present Mike Wilson of ...\nTo view about what has to come next year\nWe think Nineteen is going to be fairly disappointing in terms of the gross relative expectations I think the the fed tightening as part of the narrative\nWilson says the impact of inflation on corporate cost structures has not been factored into the outlooks for twenty Nineteen\nThe government's September employment report will be out in the morning the labor department's tally your first time claims for unemployment benefits fell by eight thousand two hundred seven thousand last week crude oil futures closed at Seventy four dollars and thirty three cents a barrel\nI'm Jeff problems you're with Bloomberg Business report on W. W. J. news radio nine fifty\nSocks of local interest sponsored by plant Moran wealth management General Motors close to thirty four twenty six but the game of twenty six cents mass go last forty cents a closing at thirty six dollars in aid sense an oral pool closed at one Thirteen Ninety three a loss of forty four cents\nConsumers energy invites you to check out our small business marketplace\nThe energy efficiency products in our stores are available exclusively for consumers energy small business electric and gas customers\nSave on smart thermostat Kelly the bulbs type insulation and more consumers energy part of the small business bulls helping Michigan businesses save energy and money visit consumers energy dot com forward slash marketplace consumers energy dot com forward slash marketplace consumers energy count on us\nJay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith the rate shield you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down\nYou get to lower rate with ratio we really have you covered\nHere are more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage origin nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing ratio\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nBasin right where he said in comparison to record racial upheaval only balance or thirty or perjure transactions ... information that conditions equal housing lender licensing office he said and unless they were thirty thirty additional conditions or explosions may apply\nImagining a better bank starts with looking at the savings rates most banks offer and saying really capital\nOne is building something better you can open a capital one savings account with one of the nation's best savings rate from anywhere like here for here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere that's banking re imagined what's in your wallet\nFor consumers only offered by capital one and a member of the icy copyright twenty eight and capital one\nGoing to win that here to help life though right tastes I talked to an aging today\nImagining a better bank starts with looking at the savings rates most banks offer in saying really\nCapital one is building something better you can open a capital one savings account with one of the nation's best savings rates from anywhere like here for here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere that's banking re imagined what's in your wallet for consumers only offered by capital one and a member of the copyright twenty eight and capital one\nW. W. J. News I'm six thirty eight from whether together every ten minutes on the eight send the Katie what's the latest on us twenty three\nIn the heartland area Greg us twenty three north on if they're Clyde wrote a crash now they're at W. W. J. testers have been calling in saying you're only getting by on the right shoulder\nTraffic will start to slow down for you right after high knee road\nAnd fifty nine ... got a wreck their slugging all lanes with traffic slowly getting by on the right shoulder looking to the truly dams\nTraffic is heavy and slow from before Rochester wrote in tips to Ross called that in in Dearborn got a broken down vehicle and I Ninety four west on if they're Michigan avenue blocking left lane his shoulder you slow and heavy from I Seventy five with a ride home and on I Ninety six the Jeffries west on your local lanes your exit the Greenfield\nGot an accident black and the left lane in the idol demo to go twenty four hour traffic center Katie for W. W. J. news radio nine fifty\nThe accuweather forecast now let's get the updates and meteorologist John fair\nChillier tonight clear to partly cloudy out a forty four upper thirties and some suburbs right a start tomorrow the clouds of work and then we'll see a couple of showers around mainly in the afternoon I just sixty two couples showers a short amount ILO fifty eight more minutes\nThe airport sixty one sixty six at Detroit metro traffic and whether it's sponsored by Methodist children's homes society foster today data work coming up on news radio nine fifty we'll check back with Jeff Gilbert at the Paris auto show them\nListen and imagine [noise]\nIt takes five seconds to send a text and for those five seconds\nYoure driving blind life is worth more than a tax stay alive don't text and drive\nStopped ... and that's ... by the national Highway Traffic Safety Administration project yellow lights noise and the ad council or\nThe all new radio dot com app is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers do you based on your list and they get their news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone now\nAnywhere\nBreath again whether together on the eighth and breaking news first came up to date on the road\nWith news radio nine fifty W. W.\nW. J. news time six forty two transforming JFK international airport in New York governor Andrew Cuomo says it will go from an aging facility to a world class air travel hub in a seven year Thirteen billion dollar transformation he says the improvements\nWill increase the airports capacity by at least Fifteen million passengers a year currently handles about sixty million annually construction expected to be getting twenty twenty the first new gates are scattered all open for years later with most of the project completed in twenty twenty five\nChinese carmakers gearing up for the U.S market W. W. J. ought to be a reporter Jeff Gilbert with details from the Paris auto show\nChina's G. A. C. which at a big exhibited Detroit has a large display here in Paris too that's why the uncertainty about trade they see the U.S as a potentially big market Edmunds analyst Alister Weaver says they're not alone\nThis very day future of this by there's a lot of bronze that at the moment most people ... but I guarantee in in ten years time they went all the old civil either an old ... but some of these problems are going to be household names\nWaivers as Chinese brands are hiring global auto industry veterans do at experience throughout the launch the west at the Paris auto show I'm Jeff Gilbert W W J ...\nMove that are getting ready to start the red wings new homes season that little Caesar's arena will take you there and then\nHey Sean Spicer in every mid term election since the civil war the president's party is locked an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and we provide listeners with unique inside you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I chose\nThe all new radio dot com app is available now it's a totally new experienced it puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list and they get the news and information you rely on and even when you are near radio you can take this station when you're on the\nThe all new radio dot com app is available now it's a totally new experience that puts listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list to get the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com app on your smartphone\nFor anywhere\n[noise] hey Sean Spicer and every mid term election since the civil war the president's party has launched an average of thirty two seats in the house of representatives and two in the Senate We're in for what will be a wild political season and there's going to be plenty to discuss and debate and dissect\nShe'll be sure to download my new podcast everything's gonna be All right beginning in October ... and I was an hour long weekly political tide gas covering the very latest news across the country and will provide listeners with unique inside and you can't get anywhere else everything's going to be All right and subscribe and download today on radio dot com and I can [noise]\n[noise] well we wound up on the losing side on the markets here we will update the Bloomberg Business report plus we'll check the situation here us twenty three after Clyde road and the [noise]\nThe things are clearing up six forty five it's time for sports and heading down to the little Caesar's arena Ryan Willie\nYeah Gregor right wing sees an opening up tonight they're playing host of the Columbus blue jackets down a little Caesar the rain or Detroit looking for a six straight home opening victory you can hear it on the civil on the ticket starting at seven ten baseball playoffs also continuing tonight nationally divisional series getting underway it's starting with the brewers and the Rockies from Milwaukee\nDodgers embrace me and I'll play in the night kept tonight at eight thirty seven American League divisional series won't get underway until tomorrow\nLions wants to can missing TJ laying Eli Harold Michael Robertson but that the last of the practice today but they did get back your blood is set out yesterday due to an illness week five of the season kicks off tonight from New England Patriots playing hosted the coach and catch that game over on CBS Sports radio twelve Seventy starting at eight\n... Fifteen and forty five pass each hour I'm Ryan wall e W W J news radio nine fifty\nAnd we will update us twenty three the other problems on the roads with traffic and whether together coming up next W. W. J. news done six forty seven\nStates on\nThis is bill finally got me bill watched that Rick Clark street crater the mother of all potholes oh yeah year after wrecking year it's the people in this town they try to fill it but it always returns becoming good but you know stay far gotcha to\nPenn trash talking about oh\nYes yes I Am going to win that here to help lifestyle right hey sign talked to an aging today\nImagining a better bank starts with looking at the savings rates most banks offering saying really capital one is building something better you can open a capital one savings account with one of the nation's best savings range from anywhere like here for here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere that's banking re imagined what's in your wallet for consumers only offered by capital one and a member of the icy copyright twenty eight and capital one\nNow but no this month a two pack of Napa night vision had lamb says up to ten dollars off cause with ball comes longer knights fan\nVisibility luckily our head lamps up superior elimination which helps reduce the chance of an accident [noise] see better drive safer with up to ten dollars off a two pack Napa night vision had less wealthy parts ... people snapping or no\nThe three north on if they're Clyde wrote this crash has been clear they'll look into the damn campus here are heavy from\nAnd fifty nine and traffic is sponsored by vent Johnson law also another accident just cleared and I'm fifty nine eastbound at mound\nAnd that was blocking all lanes and traffic is still slower from after Rochester wrote in Dearborn get a broken down vehicle I Ninety four west on after Michigan avenue slugging it left leaning shoulder traffic is so from I Ninety six I Ninety six the Japanese west on your local acted to Greenfield\nGot an accident blocking us left lane and we just picked up a crash and I to Seventy five it's north mounted each course road and this one on your right shoulder\nIf your car crash victim you deserve a fighting chance to get your life back on track vengeance law will fight tirelessly title it tirelessly to get the justice you deserve call one eight five five vent fights today and put a champion in your corner in the adult downloaded give twenty four hour traffic center ... devil DJ news radio nine fifty", "year": "2018", "show_name": "Greg Bowman", "city": "Detroit", "day": "04"}