{"month": "10", "state": "TX", "station": "KTDH", "content": "David Massachusetts wide open their job and the audio do and in your direct social\nTwist re jumpers written a book called the number of them get produced dedicated to enhancing the quality of life in the community service it was a real of live music and\nGet free rooms on\nChi chi one eighty nine point three in Kansas City the home of St Joe [noise]\nThey'll check us out on my Facebook and all the usual places and follow me on Twitter will screen joined us that we can Public Radio's jazz comedy jam\nReminding you to check out the live music than your neck of the one that's where it's always joke\n\nWhen you discover H. P. P. R. connect you'll find a variety of informative enlightening and entertaining programs from National Public radio the b._b._c. World Service American public media and others thought provoking programs like Ted radio hour\nTravel with Rick Steves and radiolab will stir your imagination and expand your horizons to see a complete schedule and listen online visited at H. P. P. R. dot org\n[noise]\nIs Ninety One point five eighty ... eighty nine point three Katie de ... uh service the high plains public radio available everywhere at H. P. P. R. dot org you can help ensure the reliable operation of our Web stream\nTed radio hour travel with Rick Steves and radio by will stir your imagination and expand your horizons to see a complete schedule and listen online visit is at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie de ... uh service the high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving your signal monitor to Inquirer or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or coal eight hundred six seven eight seven four four four\n[laughter]\nFrom New York's ... living room it's radio dialogue with John ... if you drink vocal or to be a luxury Jessica my last game\nOh oh\n\n\nFrom high top Lexington Avenue here in the deluxe living rooms another edition of reading radio landlocked I'm jumped it's really I'm Jessica Malesky here we are back in the deluxe living room beautiful tumbled day here in New York City certainly it went to the\nFlea market went to the farmers' market and build New Yorkers today yes we were and I it leads me to the first one I wanted to play you probably got the same song on your list well let's hear it All right so here's this all\nReally on on that\n[noise] makes the lowdown on\nLike some long list of All right\nYou\nHave them on how well [noise] but like\nI'm a\nThen when I\nWatch people [noise]\nThey you know you saw that in\nYou\nKnow what I mean yeah I mean [noise]\n...\n\n[noise]\nOn the little\nOne of the\n[noise] you\n\nKnow\nTo me that\nDo um\n[noise]\n\nHow was that that we were singing event as we were walking round flea markets next right looking in all kinds of junk was surely horn and Sunday in New York it's an older record of hers and are\nQuite nice actually quite lovely Shirley Horn yes are you in the past week and up until next week or a jury duty yes I Am actually is airing I may be off the off the show you've you're doing your civic\nResponsibility I give you lots of credit for that especially if you're ...\n\n\nHow was that that we were singing that as we were walking around the flea market your next right looking in all kinds of junk I Will surely horn in Sunday in New York it's an older record of hers and are\nQuite nice actually ... like Shirley Horn yes are you are in the past week and up until next week or a jury duty yes I Am actually is airing I may be off your shoes off the potential if you're doing your civic responsibility I give you lots of credit for that actually\nGet ears so seldom home for a week but the funny thing about it is that the the two days into the trial you started talking like\nAtticus Finch it keeps the two days in to a jury\nAnd you'd think that you're a lawyer I actually took a the idea that uh they I was an integral part of the entire proceedings [laughter] well you are I'm actually you remembered the jury but anyway I applaud you for ... you know the beauty of it just even when you think about Sunday in New York uh is getting on\nA a subway every morning and going down to center street and seeing all these wonderful New Yorkers who've been golden jury duty or don't want to be there and yet when you get on it you go\nOh we're doing something very very very important and it really is part this is how our democracy what exactly which leads between excellent can I play it yes it's a firm Fiorello it's the Oscar Peterson trio in politics and poker [laughter] on radio deluxe\n\n[noise]\n\n\n[noise] [noise]\n\n\nNurse so I'm not I'm\nUh\nI'm I'm [noise] I'm just turned on\nAnd\n[noise] [noise]\n[noise]\n\n[noise]\n... do you why\nIs a very very ...\n\nTo be the [noise] they do ...\nDo worry the ...\nThe\nWell that's terrific that was curtailing directly called all about that because the and that was current element to me it's a wonderful a continuance of the band I I got to work with them in Thailand or\nIt'll be two years I guess this December and they're wonderful they're where somebody doing a very good job of keeping that\n[noise]\nOh that's terrific that was ... to record called all about that DC [noise] and that was curtailing with a baseball fan it's a wonderful a continuance of the band I I got to work with them in Thailand a it'll be two years I guess this December and they're wonderful they're\nWhere somebody doing a very good job of keeping that found alive there are all those people who you know keep pot healer dance company alive and keep\nYou know make sure that Jerome Robbins choreography is done exactly the way it should've been and the you know just to know that there's some people out there who know what that sounded and they want to make sure that it's kept there so we can still enjoy it\nAnd you know like for years the Glenn Miller bans I Believe their biggest tour was always a tour of Japan they were the Glenn Miller sound still like a very captivating sound and they are is that there was a ... a a company I guess that keeps the Glenn Miller band going in and up to date and\nSparkling my my friend Joe French is saying with the Glenn Miller band in the eighties to win all over the world with them but they they have\nThose you know I don't know what you call it but I don't want to say it's a foundation but it's more like you know the company there's uh uh the family or wherever make sure that that's being really well it's got to be somebody who had the ears you know yeah she's a ... I mean we know that they have the arrangements but still you know just the\nSound like you know what I'm saying yes I Do because I don't [laughter]\nMichael ... I don't know if he has a new I guess he has a new record coming out but he released a single uh when I fall in\nLove a sounding very smooth like now that can call 'em in a beautiful arrangement I think it's out in November the actual record with cold love but this is Mike ... singing beautifully when I fall in love on radio deluxe\nMm [noise]\n\n\n\nWhen I've for ... [noise]\nAnd it will be for over\nYou know ...\nOr ... never for [noise]\n...\n[noise]\n... [noise] like fish [noise] love them very fearful\nIs good [noise]\nI scream or injuries [noise] you live [noise]\nSeem to go\nUm\nWhen I Do too much\n[noise] will be [noise]\nJust big ... and I ... to ... to ...\nUm\nWhen I gave much of\nThis will be ...\nOr ...\nYou know the\nI'm going to be home with\nMy ... na\nYou see that we\nDon't or ... or ...\n\nAh you know\nWhy it jams\nWhere this was no\nLiars borrow ... around the world who\n...\n[noise]\n\nMm\nThat's a great arrangement beautiful right yeah my glasses way yes but to put a little cash down on that one so that's good um [noise] I Believe that may have been the last song that Nat Cole sang on television\nReally his last TV appearance was the Jack Benny show I think a year before his death it's like January\nOf sixty four he died in February of\nSixty five and uh I\nSaw that he was going to be on TV are ...\nYou know you can find the Jack Benny show now and and uh I saw that it was his last show and he was on with a very young boy named Jimmy Bradley junior James Bradley junior who ended up playing drums\nFor Chuck Benji on a theory was five years old playing drums on this show well and the other appearance to get made Nat Cole made was with a Billy Preston well I Believe yeah they sing blueberry hill a lot of television shows that are interesting\nAnd uh I\nSaw that he was going to be honest I DVR it you know you can find the Jack Benny show now and and uh I saw that it was his last show and he was on with a very young boy named Jimmy Bradley junior James Bradley junior who ended up playing drums for\nChuck may and June and here he was five years old playing drums on this show well and the other appearance you'd made that call made was with a\nBilly Preston well\nI Believe they sing blueberry hill on a television shows is very interesting anyway but that's a little to do what you can access now we're watching it all day we actually played a private party last night dicamba always there yeah we were saying how this summer we were watching you're watching the dicamba Joe a friend who's ready to stare\nWhich was so exciting because with our daughter yeah I just so we have to watch this and there was British they're talking about how we did things but then they showed the clips now this Nineteen Seventy and here was Fred Astaire say twenty five years twenty five\nTwenty years plus later getting applauded for the little like each show the scene where they dance on the uh what do you get some ... ah you're all the world to me I think it's just so and\nThere I mean just at the end at the end they come back the lights go up and everybody just applause and keeps deploying and he stood oh you know he didn't never heard that you know so it was very interesting to see I just thought it was interesting can be plenty yes so here is Fred Astaire singing your old world to me on radio deluxe\nEvery man that'd be legal you\nUm [noise] every ... you know [noise]\nEverything that the young gay right now that\nEvery well the new you well\nKnow my parents didn't they didn't really may [noise] you knew your mom still read a book written about\n... ...\n... ... and then\nWhen I die\nEnded up by\n\n\nThe the the fly\nTo a nine to birds from Britain and\nBlow\nMy\nWay of all I'm reading\nA no fly you lay it in the mood then when\nI die drowned out by\nThe\n\n[noise]\n\n[noise]\nJim Lovell\nDi di di\n...\n\n\n\n\n[noise]\n\nMm [noise]\nEvery day to\n... it\nOnly\n\nDid I\nRead my man died died\nBy in my\n\nFamily [noise]\n\n[noise]\nNo\nThat was a from a new record Rosetta vitro a from a record called tell me the tree singing that beautiful I'll fly away and of course\nThere are Mazie for ... back to before ... and maybe later on like other uh\nAnother Merrill maybe with her wonderful ... than the nearly they have a duo records do actually just wrote them I said what's your favorite song that you sing with Meredith he hasn't really back so let's see what happens well uh in the meantime\nYou're is Nancy Wilson from the great American song booking dearly beloved radio to [noise]\n\nOf the any\nAny I see some [noise]\nSome where and have a new\nPhony angel\nKnees\n[noise] a\nLater age you\nThings could have made the guinea any [noise]\nI Know that ah the\nI see [noise]\nSome where and have a new\nPhone Lee angel\n[noise] knees\n[noise] a\nLead choose you\nI think they need the game [noise]\nI Know that on the\n\nKnees jeez did leave [noise] the the\nThe\n\nCheese\nCheese\nThey leave the keys me is\n[noise]\n\n\n[noise]\n\n\nThat's Nancy Wilson from a culture called the great American song book and dirty water yeah for me it was all great song great\nSingers we saw when I was a ... I'm thinking maybe I was sixteen there was a place called the Oakdale musical theater\nIn Connecticut willing for Connecticut it's\nStill there I think we always pass it on the murder rate it used to be like a tent yet I think no it's a ... actual structure a but it was a big tent or an everybody came and I had an internship there and did all kinds of stuff I met ... and um oh my God\nCarol Channing oh my goodness oh everybody I mean it's just amazing but Nancy Wilson came and I had to ... her her microphone record because it was in the round and she sort of\nYeah and I thought I Would see Wilson is you know like here I was listening to rock and roll and boy did she blew me away plus she was stunning also to look at the\nCouldn't have been nicer I got to hear ah she's saying for with sharing his uh\nThat was one of his birthday parties that we that we played for Carnegie Hall she's saying things we did last summer 'cause she made a little record with George and it's just oh you did a little record with George like well maybe we'll hear coming into the next year maybe we'll start with little Indian summer collective peace will looking forward to it I'm John thrill you are just\nA couple if this is radio dogs\nJoined H. P. P. R. radio read her book clubs twenty Eighteen fall read as we breathe\nNew life into the theme aging death and dying our final book can't we talk about something more pleasant by New Yorker cartoonist Raj chat as an illustrated\nMemoir the minds of dark topic for the inevitable humor that comes with taking care of one's aging parents\nHere a new book by each week at H. P. P. R. dot org by clicking radio reader\n... into the next year maybe we'll start with little Indian summer kind of peace ... well looking forward to it I'm just it's really you are just a couple and this is radio to\nJoin H. P. P. R. radio reader but plus twenty Eighteen fall read as we breathe\nNew life into the aging death and dying our final bucks can't we talk about something more pleasant by New Yorker cartoonist Roger ... is an illustrated\nMemoir that mind that dark topic for the inevitable humor that comes with taking care of one aging parents hear a new book by each week at H. P. P. R. dot org by clicking radio reader but under the feature menu or catch them on air Mondays Wednesdays and Fridays during MORNING EDITION and all things considered\nIt's beginning to look a lot like fall across the high plains with pumpkins on porches and the smell of firewood feeling beer which means it's time for H. P. P. our phone number ship campaign [noise]\nWell H. P. P. R. understands the importance of uninterrupted programming we also know that without listener contributions to service would not be possible through H. P. P. R. you gain knowledge and grow community so please give today at H. P. P. R. dot org\nIt's radio in the box with John pits really Jessica Malesky [noise] [noise] [noise]\nSo do\nYou do yeah so\n... that come\nA ...\n... a ...\nSee so many Germany\nDreams we've fashion when some\n\nOne new\n... ... ... ... ...\nIt was yeah to watch you\nSome on the news broke\n... words\nThat some bloody\n\nDa da\nDa da da da da da\nDa\nDa da\n\n[noise]\n\nH. P. P. our listeners keep public radio strong from Nebraska Texas five states widen long\nFrom Colorado to Kansas or Oklahoma to we need your support we rely on you so if you count on this service each day and night it's time to contribute to keep up the fight to the Flint Hills the flat lands on a recurring breaks you'll hear in that news stories and none of them fake keep H PBR going don't send it to the morgue\nGain knowledge grow community give today at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n[noise]\nFrom high top Lexington Avenue here and the deluxe living room it's the second half of radio deluxe I'm John ... really I'm Jessica ... I'm so glad you're here just to come all ask each of us who are here\nIt would be disastrous [laughter] as you can tell but shows that I've done by myself I did one the\nI was on the dock doing a show one day unbelievable I don't know how that all happened we unless we're like at the Carlyle or something which you're going to be at the Carlyle yeah we're going to be later on in November but you're going to be there with Michael McDonald yeah and you kind of doing like Michael McDonald unplug thing and I cannot wait to see that\nYeah that's how we fund that's the two weeks before we go on is that the early early to predict a receptive everybody gets a last week about the last two weeks of October and were the first two weeks in November wow oh that's going to be that's really fun oh anyway I'm ... I didn't need to be plugging your stuff that uh we we it's rare that we're here in\nNew York city on the weekend and uh\nIt's been great yeah looking around and seeing everyone\nNot rushing you know everyone with their cups of coffee and their baby strollers and you're getting pumpkins and we walked around the reservoir and and just sort of the\n... different degrees of runners Taipei yes New Yorker and some type B and C I F been noticing well of course I don't you don't have to be New York to be anxious but\nThere is this thing I Would like to start documenting more up which is I refer to as the anxious New York anxious resting\nFace [laughter] which is if if people just rush by you you know in the middle of the day we just like the ... looks like they're they've seen a tragic accident and they're just going to work with the the two things that are you sort of pet peeves of mine but singular alone\nIn single everywhere actually not singular it's it's a universal thing and it sounds the phones it's like I always had a a anywhere you're walking and you're ... you're going and you're just moving along like I have to run down a jury duty I've got five minutes to get there I Know I got to go through the security\nWhich is where people just rush by you you know in the middle of the day we just like the ... looks like they're they've seen a tragic accident and they're just going to work\nWith the the two things that are you sort of pet peeves of mine but singular alone\nIn single everywhere I actually got like singular it's it's a universal thing\nAnd if phones the phones it's like a anywhere you're walking and you're\n... you're going and you're just moving along like I have to run down a jury duty I've got five minutes to get there I Know I got to go through the security thing I'm getting a little nervous\nAnd there's that person right run who's deciding maybe I Want to hear lady good God I Know and just look really in the headphones and ... or checking faced with and just it all but not in any and you're trying to get around it I Can't\nDo that had to go out to Princeton because remember brands working on new wonderful\nPiece that I've gotten to be a part of really really good but we were doing a little reading of it at Princeton and for some reason I just got on the subway too late and if I didn't get on that train to Princeton from Penn Station I Would have to take a new part to Princeton New Jersey and and that would not have been good [laughter]\nSo I literally with like I was like Dustin Hoffman and taxi driver literally rushing through Penn Station Robert and Robert Deniro saying I'm\nWalking here walking walking [laughter] everybody's other leveled at three minutes to get on there like a ... just\nA woman doesn't have a certain age screaming I'm walking and because I'm a man of certain age I I forgot what the other one that I was my other complaint was so couldn't couldn't have been that bad [laughter] yeah we don't need to hear any more complaints have enough to complain about so you know what to pick up the uh to pick up the pace here\nI'm going to begin segment for what the ... sisters from them called bet your bottom dollar now\nHere's your choice just come all ask you do you want to hear him singing cheaper scrapers or\nThe blonde disown heart of glass I think I'm going to go deeper [laughter] you when the ... sisters a deeper scrapers on radio deluxe\nSome butter I'm Better at it um but I Do about that [noise]\nI don't care what the weather map that ran the\nYoung men [noise] and\nI don't have the weatherman vine plan the way I got\nNamed when my kids you know\nShe really there's no way you can read the\nKey things the way you can do and they all died young yeah now they don't really know died he\nHow they get that job you need to do\nYou know we love me [noise] my [noise]\n\nWay beyond me\nI'm really not that rare Donilon\nDidn't do that we\nDo know that [noise] na na na na na na na na na na na that in a\n\nBall movies and\nAnd they know that in a way to get done Don\nDude I didn't\nKnow that the na na na na na na na na na na na na na\nNa na\n[noise] and [noise]\n... the landing and the Donald Keene well me and my kids\n\nNot in the\nOh\nMy God yeah team do you know\nThe ... sisters from bet your bottom dollar now you were just say that they did that so hard to Glenn how blessed\nI just listened to the share of them like not going to play it because every rule Yelena but she did a a record of all of a song oh\nRight yeah it's fantastic [laughter]\nAnd you know what my ... year it's like I Can't have breakfast in have share you know in ... she it's so good what she did and she's like Seventy years old but she just did all these other covers it's great I've been to play for you it's the kind of record you want to put on in clean your house\n[laughter] been tested\nWell you know we're talking about New York\nRunning around New York things that happen in New York or here is a New York so whenever rosy Cooney played the New Yorker closing on all the time was will you still be mine or what she called classic New York so it's it's a medicine time a day or\nSo that it from her conquered collection of songs Rosemary Clooney on radio deluxe\n\nYou love and make no runs in\nGeneral strolled along with them and then\nReally is to me and my\nWhen cabs don't drive around them are\nNo windows license\n\nAnd John Makin jumping on main bombing\nPretty I mean they\nRocket and rhythm that's Lorraine Feather from a town called cafe societies that her newest one no this is an ... an old white one of the first ones I think I'm this is the Duke Ellington song that she right leery I Know that CD but she posted something on Facebook about maybe not up yet I Know there was a new\n\n\n[noise] next time into people's pharmacy and ancient practice from India is getting enthusiastic support in the U.S yoga is trendy they can also be used therapeutically we clicked for can senior citizens gain flexibility\nAnd strength by practicing yoga your questions and calls about yoga and the next people starting to see a live call in show Saturday at\nSix am central [noise]\n[noise] this is Ninety One point five Katie ... eighty nine point three Katie de ... service the high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support jab at H. P. P. R. dot org for details [laughter]\n\nFrom New York's favorite and most deluxe living room it's radio deluxe with John ... if you drink vocally you luck Jessica Malesky\nOh oh\n\nWorld is a\nDime\nA dime vehicle mile Mormons that's right I don't read the whole reason\nMan show\nWell well it's a\nHoney there is no way you'd be really in in uh we live in a way to get to heaven\nObserved didn't go away to get a sweetheart way to get away\nAnd then maybe you lie\nWas it oh no well\nThey really don't know the reasons why\nA reason then adopted in ... [noise] I mean a new day no me either\n\nI've eaten a new then raising the\n[noise]\n\nUm and then the new one and then being we all in the same way I read\nI haven't been no you\nTo ... you understand that\nShow a very good job\nWhile it's a\n\n\nLot it up\n[noise]\nMy atop Lexington Avenue here in the living room with another edition of radio deluxe I'm John ... really Jessica ... we just hear justice that was a ...\nA CD from Madeleine Peru called secular hymns or sort of like secular [noise] oh yeah [laughter] ... it's a it's a fun record and she has made a record in a while and the voices got deeper a but there's a lot of fun\nThings on it and to stick yeah well are you I'm well I missed you last week I snuck down in the dark I didn't even know it until people started writing\nMe well you were a working on some music and I didn't want to disturb you and I knew we needed to do a show so I took the those little machine\nWhat Donald Duck played a little guitar literally went down to the dog which is quite beautiful we're in the Indian summer face yeah it was beautiful and we're back in in New York City\nYeah running back and forth it's nice\nIt's one of those days where it would be ideal for\nWhat's happening while I was on the dock last week I was like oh ... little breeze ... and all of a sudden you're walking around New York and my head spinning him it's like hot muggy crummy we're talking about the weather will charities that had the wonderful Judi out all up stings dogs now you know I mean it\nWas funny because you said there are taping attorney said will have a new sting record up up up about an end Don our producer was like I didn't know she didn't know what the reference was sting he thought it was some sort of form of recognition is Andre music that's being record all is that an industry term but it's actually the artist it's called the sting variations\nAnd it's a wonderful and uh this is the only ... take on message in a bottle on radio deluxe [noise]\nAnd [noise]\n\nThe [noise]\nThe the don't want you to be [noise] [noise] the last few weeks into [noise]\nSoon [noise] and then as soon as\nI\nGet mine and Jim\n[noise]\n\nMine is a\nGood thing to do that to the people\nThat had happened to my computer right now entered the time you pay me to\nGet your kids don't read\nAnd and just to do\nOther than that ... to ...\nI Hope that they get mine and a ... ... ... ...\n\n...\n... ...\n... ...\n\n... [laughter]\nJust this morning don't we don't really want to know that you have to promise not\nHungry I guess we just looking\nFor oh\n\nBut then again on and\nJust to name down and just do the name of God or just even you know do do they\n[noise]\n[noise] [noise]\n\n\n[noise]\n\nThat would lead buildings from a wonderful CD well in my\n... because he's so good yeah you really love the we believe will be always say that and here he is playing a song that he wrote with that are the ones that song with Harry Allen is some hope but in bloom I think it's\nCalled the scope and Larry ... Harry but did you truly one of my favorite records they have they have a little girl named both musical romance the highest daughter but didn't bloom now rebuilding Harry Allen radio to\nIn\n\n\n\n\n\n\n\nIn that great love that record yeah but the so called but just blew a written by Larry Golding speaking of metal through Larry we don't know it's really not look through\n'em that's great those records it's such a great sound yeah yeah he plays Oregon on them and so on debts wait till the end of time yeah let's play the okay you're going\nTo dance to me to me a nearly we're learning ...\nThey need to panic Caroline gathered in the ... for them to live like ten nine and then send me my home now\nThen they mean to me and saying no no no\nIn the damn so mean just really I mean that's the wrong\nLake Mead CEOs nearly as well in the ... ... ...\n... you know\nLike they do in ... that have been\nA show named Lola knew what I\nReally ...\nMe to be the and you know love\nTo dance to me to the new the new uh do you\nDo then to me too long planning for no more than ... pounds\nGangs name they can that man man but I mean there is no\nWe need to learn more so much trouble with that\nDay and to me to me and you can do you love\nMundane to me to do and don't know\nTo the children\nWho are looking to ...\nThat in ... you know all over it fit in charge of\nIt's me kind of the year and\nYou know and love\nDang me choosing\nThey'll you know when\nBegan to me to you viewed in the name to buy a plan\nMe through the panic but you know they seem to me in\nTouch with your name and catch me when", "year": "2018", "show_name": "Radio Deluxe", "city": "Dalhart", "day": "13"}