{"month": "10", "state": "AL", "station": "WAPR", "content": "Been and then you see an SUV police SUV pull up to the side of him and\nYou see a police officer officer Jason Van Dyke jump out and at that point you see the man he's beers away from officer Van Dyke ever so slightly and with that officer Jason Van Dyke started shooting [noise]\n\nAnd you can in the video see the man spin around as he it hit and fall to the ground and the bullets just keep coming\nBack\nWhen it's finally over you see an officer come over and kick the knife away from the man's hand\n\nTurned out that the person on the street was on a man it was a boy he had just turned Seventeen years old his name was ... McDonald ... someone who had\nWas someone who had had a difficult\nYoung life when he was born his mom was a teenager herself he ended up in foster care repeatedly he had been diagnosed with P. T. S. D. at a very young age he was someone who was in juvenile detention and had his share of problems\nThere was a sense I think that you find in a court records about him that he was a resilient person right before he was shot his principal said that he was going to school and he was you know behaving well and in fact with even giving some people hugs\nHis mother was trying to regain custody of him at that point so there were some signs that things were more looking up [noise]\n\nThe McDonald's death to play it just a few months after\nThe death of Michael Brown in Ferguson, Missouri another case of a white police officer shooting a black teen you would've thought that would climb McDonald death would have\nDrawn a ton of attention but it it actually didn't infected through almost no attention and Chicago reports from police had been that he behaved aggressively that he may be lunge that the officer\nPolice said this was a clear cut case of self defense\nDuring a three inch knife and he apparently ignored officers orders to stop\nPolice officer saying that look one Donald lunge towards the officer Van Dyke\nWas sense was that the police had behaved in self defense and the case and Chicago sort of moved on ...\n... there was somebody in by law enforcement who had seen the dash cam video or knew of the dashcam video\nAnd tipped off an independent journalist and said hey you've got to see that video it's it's terrible from there there was a crescendo of interest and getting a hold of this video\nThere is a video from one fleets car that may actually showed the clearest angle fat has not been released and filed our own freedom of information request with the Chicago police department asking them for any dash cam video\nThose who have seen the video say it is explosive and freelance journalist Brandon Smith has filed suit to have a video released\nThe city fought to conceal the video though even after the wall Street Journal the Chicago Tribune and freelance journalist all filed for us\nOld boy a request for its release at the city said that they couldn't really sit because it was part of an ongoing investigation\nWhich was true but it also meant that the city was able to delay the release through an election Mayor Rahm Emanuel was seeking a second term in office that spring and the delays went on and tell a point at which the city was finally sued for it and\nIt wasn't until Thirteen months later that a judge said look you have to release the video it needs to become public\nBut just hours before the video was released\nWe're charge Chicago police officer Jason Van Dyke with first degree murder and the connection of the shooting death\nOf the climb down in the county prosecutor called the press conference he announces that she's bringing charges against Jason Van Dyke\nWith these charges we're bringing a full measure of justice that this demand\nAnd there's some skepticism in the cargo about the timing of all the why bring charges now just before the release of the video\nThroughout the course of our investigation has seen the video on a number of occasions and I can tell you it is graphic pitted filing it is chilling and I have absolutely no doubt that this video will tear at the heart of all Chicago\nAnd so when the video finally comes out\nIt had an instantaneous\nProtesters\nFilled the streets of Chicago following the release of a video showing a police officer shooting a black teenager\nThere are people marching on the street [noise] within a matter of a few hours [noise]\n\nThey were furious that this hadn't been released sooner they were furious that it happened at all and I just don't know when they were furious that there have been so many shot\n[laughter]\nThere was something about the sheer number of shot sixteen shots that no one could really make sense of [noise]\n\nPeople don't like the city had been keeping the information from them [noise]\nAnd there are plenty of people who felt like this was a cover up [noise]\nThe daily it's supported by ... online test prep for the A. C. T. S. A. T. G. R. E. N. G. mat that's designed to improve scores students can get video lessons practiced question an expert support on line prep smart go far and enjoy the ride at ... dot com\nAnd buy T Rowe price offering a strategic investing approach that examines investment opportunities first hand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nRead every one for the daily with my little borrow your own listener supported Alabama public radio service of University of Alabama\nSupport for Alabama public radio comes from our listeners and in part from the sponsors\nRed mountain entertainment presenting Bob Dylan and his band live encountered this Wednesday October seventeenth at this anger theater immobile tickets available now insult at ticket master dot com\nThe exchange offering co working space in the heart of downtown mobile including private offices team offices conference rooms a full kitchen and cafe into balcony overlooking downtown membership options at exchange to zero to ... I\nCan tell guard association featuring the work of festival artist Jane Morgan income tax hotel indigo gallery in downtown Tuscaloosa with an opening reception friday November second from six to eight PM in the lobby of hotel and to go\nWe aren't Alabama public radio\nThe daily it's supported by carbon night offering secure data protection solutions for businesses including automatic back up for servers advanced point protection high availability and disaster recovery solutions and automated data migration learn more at ... dot com\nAnd by ... bourbon handcrafted in small that just for a full flavor sipping experience forty seven percent alcohol by volume Elijah correct Kentucky straight bourbon whiskey bars town Kentucky they wisely drink wisely [noise]\n\nThe dash cam video was released the fallout was pretty immediate and pretty significant Superman curbing I began to destruction on Sunday this morning I formally asked for his resignation the police superintendent was fired Kevin Fox on the streets and commit Anita Alvarez the county prosecutor\nCuter lost her reelection bed the mayor says hundreds of tasers have now been shipped to Chicago and then he expanded the availability of Pacers\nWith the police department reeling from some controversial officer involved fatal shootings the mayor and his top cop promised change\nAnd then they started looking at other reforms that could be made about how police use ... we found at the Chicago police department engages in a pattern or practice of using extensive more it triggered a local task force investigation into the department and a U.S Justice Department investigation\nAnd on the basis of this exhaustive review the department of justice has been in the Chicago police department engages in a pattern or practice of using excessive force and\nAs much as I Love this Joe blow for decided not she [noise]\nThis rama manual the mayor announced that he would not seek a new term in office he had said that it wasn't about the liquid McDonald shooting but there are a lot of people who would tell you that the dash cam andme Kwan McDonald death left a huge mark on his tenure as mayor [noise]", "show_name": "The Daily", "year": "2018", "city": "Selma", "day": "12"}