{"month": "10", "state": "AZ", "station": "KJZK", "content": "Going to go next to your ... on the program kilter cafe with mark yellow gr at ... for [noise]\nNine points one man in Ninety One point three ... plus ...\nYou're listening to the Arizona community radio network an eighty nine point five K. Jaycee a drink Prescott bally Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven K. J. C. K. Kingman Boulder sitting\nIn a translator cake to one seven ... months park in Ninety One point three FM\nFrom or what their result of public radio in keeping the following program\n[noise]\nTo come because they have to start laughing\nAnd finding new to add to put the jokes to your day and this is mark Gallagher enter junior the best coach cruising around the world from October cafe\nHow [noise]\n\nChris power of the family we listen to the ladies of Celtic music some of our favorite female singers that we are great I got to be true in the\nPast twenty two years on the air\nNo we we\nReally any\n\nSay\nAnd they live in the new the early\nWould you he was a\nHad a\n\nNa\nMan\n\nReally\nIn a way that we [noise]\nReady to\nMe\nTell you\n\n\nWho's who\n... her name\nThe home and\nThen\nHe\nDid he\nLou\n... I don't I don't know what are\nCrazy\n\nDon't want to learn Korean Thursday and\nBob Dole\nAmount on there\nIsn't a\nJob as a I'm\nSorry I'm too I'm a real a\nBlue ...\n\nBrain when when I got my car on the other\n\n\n\n\n\n\n\n\n\n\nFor cancer can you walk around the world and\nHow about something in the region today Marilyn shares that recipe for one thing you're twenty five new ice cream recipe\nSure\nSure\nOr a little depending on your fresh chopped blindly freshly squeeze lemon juice and blended altogether and then a cream maker decorate that according to manufacture structure\nGet all the details visit the daily dish at Tony is kitchen dot com\nSupport for the Arizona humidity radio network is provided by God it was all wear chef's very barb and step prepared delicious lunch and dinner Andres and exotic tapas for your body blows your enjoy the patio and the whole bar with happy hour weekdays live music Thursday and friday with jazz\nOn day four reservations goal for four or five Seventy it's oh God it was ... three sixty west Goodwin street just steps from Charlotte old museum it's beautiful do do impressed gets ... and friendly place to meet\nAnd going to go back to live from Boulder, Colorado which he told radio host Nick end Helen forced her\nMeeting I point\nPoint one in Ninety One point to me in and get on\nYou're listening to the Arizona community radio network an eighty nine point five K. J. P. A. Drake packet bally Ninety point one K. J. C. P. Prescott Chino valley Ninety seven kj the cake Kingman Boulder City Nevada\nAnd on translator K. to one Seventy eighty ... park in Ninety One point three eh than\n\n\nI Am a town hall and he'll have the Rocky Mountain town budgets again some time now\nWinner Susan Martin and currently living in Brooklyn\nJoined me now to help her make our own hey\nNick [noise] everybody [noise] man man [noise] welcome to the\nTown hall the cool solar powered musical medical you're\nThe foothills of the Rockies we got it all this week we've got some great music some great songwriting singing good stories of\nLife's challenges and hurdles and redemption and reinvention we're going to meet a woman who grew up in poverty and then through tragedy she fell into addiction in prison only to come out with a determination to help others\nWe've got a songwriter Oklahoma grew up in a religious household only to discover punk rock as a teenager and then go on to write\nSuch great honest and pointed songs that are\nThat he makes people cry we've got a young woman who's been playing the violin for almost all her life and uh she went to India to study with a masters went to Texas to hold her skills of personal John moral and\nHe was born in Texas grew up in Kentucky until he was about ten and then you move with his family to Oklahoma where he's still lives he's been writing songs and listening to record since before he was a teenager he got into punk rock music as I said that he\nGot into rock and roll bands and finally started recording making really great records he's just released his poor solo record\nAnd he's a remarkably honest I'm and us writer and singer performer and folks have been reading about a minute every publication from Rolling Stone to the New Yorker he's been on the Late Show with Stephen coal Baron because very dedicated fans were good reasons please help me welcome first person who's a detailed John moral and\n[noise]\n[noise] [noise]\nSo blues down in a bad guy\nKnow those were all kind of just characters that I vaguely was aware of that you know we would learn in school about like famous Oklahomans something\nHere those names and uh [noise] but you know I I didn't become fans of those icons till the past ten years or so but but for me were growing up in Tulsa really made an impact on my music was the current music scene there and the song writers that are coming out of there right now\nLike you mentioned you had John full right on the show and and I'm ...\nEvans ... from the ... and there's a lot of really good song writers and good musicians and so it was being a songwriter kind of running the same circle as those guys I always knew I wanted to really do my best yeah\nWill you been doing okay by the way 'cause you have you been doing great [noise]\nUm [noise] in case you [noise] in case\nYou just tuned in you're listening to get down here with John moral and uh did they teach you in school elementary school about famous Oklahomans in ended that list include like will Rogers or Woody Guthrie yeah uh\nLearning much about them I just remember like\nSeeing a video and school in fifth grade that was just was like a list of ... it probably there was probably some other stuff in the video but the part I remember was like J.K oh Leon Russell you know\nAnd I think Woody Guthrie in will Rogers and I won't Gary you've seen was on there and\n[noise] I Wonder if they edit the list ever [noise] yeah like now that\nYou know now that Oklahoma's Oklahoma and in Woody Guthrie's the socialist that he always was whether if they take 'em off a list of ...\nI think they would put them back on the list now I think it's coming back around like\nThat or you know I'm Glad era [noise] there's a there's a giant\nMural of him in Tulsa right downtown where everybody can see it and nobody thinks twice about the giant mural of a socialist and\nFormed a red states in America I'm all for\nThen I think there is to go through museum is airlines and now the Bob Dylan collection is moving there so that threat Tulsa is rock and in so many ways um let me ask you a little bit about this thing called folk alliance OK so a folk alliance is kind of like a a trade show for tender souls\nOr something like that [noise] it's a gathering the above musicians\nAnd singers and songwriters mhm happens once a year I've been a few times that they have hotel rooms where people set up right and ... and they just kind of display their wares and yeah you just wandering around the hotel rooms and\nYou play like a twenty minutes it you know she played for songs maybe and [noise]\nAnd then you run to another hotel room and do the same thing and try to you know ten times a night every night the whole time\nBut the idea is you're hoping to get a gig right they're open like a book that some ... yeah you can kind of like network with people and maybe somebody will see you that\nDoes have concerts and\nIt's both a collegial and ... it seems like you know yeah yeah but um but you had a good experience there not too long ago\nI did yeah I met my wife there so that was ...\nI don't need to go back I got everything\nOut of it [laughter] [noise]\nWell it's it's cool that that worked out that you guys about each other and and you got married and and this was all happening one less thing I Know Rachel Maddow is a huge fan of yours or your parents know Rachel Maddow is [noise] um\nNot sure if they do I think I I jokingly tweeted one time\nOr say that in there and be something that Rachel Maddow said something nice about me and I said that's the first time my dad has ever agreed with Rachel Maddow\n[noise] but [noise]\nI don't know if he knows he Rachel Maddow is but that would still be true regardless [noise]\nWell she is among many who are fans of yours Jon so thanks for stopping by we'll get back to music welcome back to deal with John ... thank\n[noise]\nUm [noise]\nI'm\nSure they are allowed to do in the ... ...\n\nMan\nDo\nDownload\nThem really run\nIn the back of a man who\nMay or may be\nMay\n\n[noise] [noise]\nAll of them down down\n\nDown down\n\n\n\nReally they say\n... do you\nBy\nRadiation man man\n[noise] [noise]\n\n\n\n[noise]\n\n\nJohn John John with us we're going to be a vote on the record\nIn case of Oklahoma John moral and there'll be back police more music later on the show [noise]\nThis\nHorse in each town is made possible by silk the charter sponsor changed the course the program was co created with National Geographic to restore water in critically water stressed ecosystems you can learn more about silks commitment to the environment and to plant based nutrition at silk dot com\nBy the ... foundation building stronger community through the bohemian qualities of creativity and imagination\nOn the weather though he Meehan foundation dot oh Archie and by\nOur diverse family of NPR affiliates community station\nCollege and commercial stations as well as their international stations and podcasts subscribers worldwide you're listening to eat out\n[noise]\nMm\nMm\nForce or this is John John moral and just going to be back later on in the show and coming up a great ... singer songwriter from Texas now living in New York Phoebe on his here and we'll be out in just a bit but before we get back to music we're going to introduce you to somebody\nWe get to know what the hell of a listener\nSomebody every week we get to do this we get to meet somebody who was literally stepping up and making a difference in their hometowns or beyond these are often volunteers and people we find out about\nAll kinds of ways but these are small stories I'm an offer they add up and make a real big differences were inspired by these every single time or or excited about this when it comes to tell you about this week's each even award winner\nThank you Nick citizen Burton was born in the Nineteen fifties and the housing projects of Los Angeles for world changed in an instant winner of five year old son was killed consumed by grief and without access to professional help\nSusan self medicated becoming addicted first to cocaine than crack\nShe was eventually arrested and for Twenty years cycle in and out of prison unbelievably Susan was never offered therapy or addiction treatment during her periods of incarceration", "show_name": "Snap Judgment", "year": "2018", "city": "Kingman", "day": "15"}