{"month": "10", "state": "AZ", "station": "KJZK", "content": "Every one of the future for for ... or something you Richard if that's what it does\nGet all the details visit the daily dish at Tony ... all the ... but with mark yeah like ... and ... [noise]\nNine points one asked him in Ninety One point do we have him on the\nYou're listening to the Arizona community radio network an eighty nine point five K. J. ca Drake Prescott belly Ninety point one K. J. C. P. Prescott Chino valley Ninety seven K Jaycee came came in Boulder City Nevada\nAnd a translator cake to one seven ... park in Ninety One point three at them\nFrom North west or result of public radio in keeping the following program\n\nTo\nTo the cockpit to start laughing\nInviting you do out of touch the jokes to your day I'm just a smart Gallagher and your tune into the best shelters nominal terms Celtic after\n[noise]\n\nThere are ... million Irish living in Ireland and over forty million claiming Irish ancestry around\nThis our work can be got bad we are following the Irish around the world\nIn a while to get out I guess a lotta is bothering about economic and brothers\nBut here I Am\nAround here that I have a law\n\nHere that we make sure yeah I just don't\nFind them ... or ...\nOther you know he was mom\n[laughter]\n[noise]\n\nOver the hum my\n... great didn't blew 'em the u._k. did to a high degree I became when mall from Donnie ... cousin Jimmy came along with me on\nWere you wait a\nMe or other Don do my part to be ...\nLike a father and my little\nCome with me you know he will bring de them\nWill sit down\nI Will build earlier um on\nYou made all\nA boy there's not a\nWorry a man\nI\nMe ...\nI'm my\nOwn car and I\nThem are on their\nNa na\n\nYou're connected to cut the cafe in my name is pat laughing about my ... and this hour on kinda cafe we are traveling around the world kind of a loop the base immigration show following the Irish and the Irish music as to travel with Britain\nAustralia an emerging and we open up this show with two songs to capture the pride and joy of the Irish as they started to make their way into your worst\nBoulder Donahue in England and will do the solid man in New York and the bullet Donahue was performed by a new group was here at ... cafe to Kenny and I let you get to where the Kennedys or from we happened to like them a lot and they're currently touring extensively in Denmark and in Holland\nAnd of course ... performed by the great ... of the jumps and and then had a wonderful ... career for the last Thirty years or more\nHe was heard there was the chief films and highly Maloney on ten whistle well I'm going to continue on\nWith the immigration thing this time we're going from Ireland to the United states and the typical immigration song called the shores of American and this is both the song of meditation and a statement of purpose\nAnd the song is also played and John F. Kennedy presidents from losing them and the museum's exhibits of Kennedy's trip to Ireland so let's take a listen to the Irish horse from their CD called the shores of America\nThe shores of American [noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] a\nYour\nWay or the way they are about ... about the\nBad they\nI'm\nI mean I don't want to be your last name [noise]\n\n\nYawn or anything you know\nNow I'm not the right to the dollar\nKnow I\nTo live by their guy I don't know what\nI entered the guy by the time\nYeah\n\n[noise] yeah well\nI\nLike I I don't\nFinding\nStayed in Australia for that song by the stones called Boston e bay and that was about a willing person going to Australia many of the Irish were not willing they were transported there and I'd like to stay a shout out to all our listeners don't underage Seymour in Australia\nIn the nineteenth century the Irish emigrated because of the greatest time and and then the twentieth century emigrated from work and then the twenty first century Ireland has had its ups and downs that's ... times and it's lean times I Believe are lost some of the Irish immigrants have found a way back home\nKept me right now as she says she's going back\n\n\nThen but I Know better\n\nThan the\nNo\nNo no\nNo no no no no no no man you need\nTo Bernie\nThe the\nThe devil in the boat on snow\nBut then we\nYou know we\nWe ran had known to be read like\nThat\nThere is\nA good\nWay to\nA\nThe\nTangles\nGoing\nBack in time when you [noise]\n\nYou're connected to the cafe um we'd be back right after this\nSupport for Prescott public radio was provided by ... and keep Kendall at the frame of night and the art store both in the heart of historic Prescott the frame and I had to twenty west ... street provide high quality cuts the Matty and picture framing from family photos to works of art you'll also find a fine art gallery featuring local artists in all media\nThe arch start at five thirty seven north six straight is a phone line art store offering to complete\nSelection of our materials for digital artist in both Judy in three D. media classes are offered at the store and painting drawing sculpture ceramics kids art classes and more the frame and I and the art store in downtown Prescott find them on line at Prescott art store dot com\nSupport were rescued public radio was provided by cable one providing TB everywhere\nGet more out of your cable TV experience with TB everywhere standard cable customers had access to fifty plus cable networks that you can enjoy watching from your computer your tablet or smartphone to learn more go on line do cable one dot net that cable one in ... by Celtic ... should have\nWith no real time to wipe out the way you look\nOf the greatest kept the wreck cars ever made the poll if I should fall from grace of God\nThat was ... films are failing\nWritten by bill ... of the ... and of course from nearby ... and ... well not every story has a wonderful through ending when they immigrated from Ireland to the United states the next song is certainly along those lines despite pinball puree it can seem to be a true story it's all about somebody who has\nPlenty of land and then lose it all comes to immigration to America loses his family got like a strong job here for the Irish it's called ... ... ...\n...\nPretty much in the ... the\n\n... I mean I Am Jane oh we're\nYour friend years or more\n... at the\nOur children that are the ...\nAnd have you been they just shut down all of God's how\nBond shirts churn within\nI'm fine already covered ... or\nTime for the minor or turn on\nOver ... over here in\nThe brain lead players from all\nOver the\nWith some skills and the ...\nOver ...\nOver ... ... ...\n...", "year": "2018", "show_name": "Snap Judgment", "city": "Kingman", "day": "08"}