{"month": "10", "state": "AZ", "station": "KJZK", "content": "\n\n\nThe ... Center for the arts is a nonprofit company committed to promoting the art in king the group is renovating the street theater which will be the center for culture creativity and community\nIf you'd like to contribute time or money please been abused street theater dot com or call Christina Mickelson three eighty five three one nine five to three eight\nYou're listening to the Arizona community radio network on eighty nine point five FM kj the egg Drake Prescott valley Ninety point one K. Jaycee Pete Prescott Chino valley Ninety point seven to ten K. J. C. K. Kingman Boulder City Nevada\nAnd translator came to one seven ... pi Flagstaff months park at Ninety One point three FM\nSupport for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of Williams on interstate forty walk among the deer feed them right out of your hand yeah hundreds of animals that cause elk buffalo girls camel cool watching Monday kangaroo llamas Rainier and more the Grand Canyon dairy farm near William with a low around forty three\n\n\n[noise]\n[noise]\n\nLeave it to Kenny Baron to come up with something terrific he did just bear the tunas called by law\nB. A. I. L. E. by day\nType of dance originating in South America\nFrom guinea ... the cold concentric circles with Kenny on piano ... base Jonathan Blake on drums Mike we're ... the trumpeter Dana Stevens on sex guinea Baron riding most of the tunes on this twenty Eighteen release on Blue Note\nBut there were a couple of things that the Kennedy did not write including reflections by the longest smoke and Kenny does a beautiful solo version of reflections on this CD [noise]\nWell we welcome you you're listening to jazz were saved won delighted to have you with us please stick around for some great music\nTrumpeter Bruce Harris is up next the CD is called beginnings Bruce doing some standard things on this CD some things that he wrote even attuned by prince it's called do you live but we're going to hear a tune by bus Powell no check on the front seat\nNa\n\nNa na na na\nNa\nNa na na\n\nNa na\nNa na na na\nNa na\nNa na na na na na\nNa na na na na na na\nNa na\nNa na na na\nNa na na na na\nNa na na\nNa na na\n\nThe world war two\nDo tomorrow [noise]\nWhen you're\nTo get\n\n\n[noise]\n\n\n\nJohn Coltrane now you\nDon't master Flay of course by the great jazz trio live at the village ... guarded Nineteen Seventy seven heck Jones piano Ron Carter base at Tony Williams on drums\nAnd before that Bruce Harris from his CD beginnings Bruce the trumpeter also a composer on a couple of cuts here but we heard a buzz power to them called no J. couldn't from sees\nA night with friends is Bruce on trumpet three sex is Dimitri by yep ski on Alto Andy Farber on tenor Frank but see a baritone and the rhythm section Micah white ... Columbus stickler space and pizza no strength on drums for Bruce of CD called beginning\nYou're listening to jazz with the wind and just a couple of minutes something very special from the great arrow garner from back in Nineteen sixty four in Amsterdam that coming up please stay with us\nHuman county library is hosting small business workshops presented by Andrew Tilghman this week there'll be the treat by your customer and it'll be despite afternoon from three to five at the main library twenty nine fifty one south twenty first Dr you can find further details you my library dot org\nThis is Thirteen twenty am Puerto radio K. O. F. A. and border radio easy ... or a service of Arizona western college for more than forty five years\nTen percent chance of showers in human today mostly sunny skies hind you're eighty nine twenty percent chance of showers in the evening was partly cloudy skies Milo around Seventy one in Kingman fifty percent chance of rain mostly cloudy skies hind you're Seventy eight\nIn the evening fifty percent chance of showers mostly cloudy skies low rent fifty one in Prescott say sixty percent chance of rain mostly ... guys behind you're Seventy tonight fifty percent chance of showers mostly cloudy skies lower I'm fifty one in Flagstaff fifty percent chance of showers partly for these guys are high and you're sixty five\nTonight forty percent chance of showers mostly Claudia low around forty three\nEven county library continuing their small business workshops series presented by business librarian Andrew Solomon this week teachers find your customer friday afternoon October fifth from three to five at the humane library twenty nine fifty one south twenty first drive more information at you my library dot org\n\nWe have something released in conjunction with the el garner jazz project to project began in two thousand Fifteen of course dedicated to the performances and music of Eric Garner\nThis performance from Nineteen sixty four November seventh in Amsterdam in Holland that the concern about beautiful concert hall it'll garner ... trio at the time it was already Calhoun on basic Kelley Martin on drums\nThe CD on ... avenue label is called night concert the great Earl garner doing my funny Valentine's here it takes them a while to get into the recognizable the more the melody but he's having a lot of fun and the audience has fun with it to\nYou may hear a slightly out of tune piano from time to time but no matter terrific performances here from Eric Garner and his trio my funny valid tied [noise]\n\nJackie terrorists and then he has trio with a piece of music that I guess sums up both very busy Parisian thoroughfare that's the name of the to Parisian thoroughfare\nJackie tourists than on piano Sean Smith on base in Iraq Harlan on drums from Jackie's CD on Blue Note cold smile\nWe hope you are smiling hope the music puts a smile on your face you're listening to the great American music we call jazz my name's Dave want it's a pleasure to bring it to you here's Joe Henderson with Billy string orange drawing room blew\n\n\n\nAnd I know that number\nThan you know\nWere\n\nWith\n\nDay\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\nYou're listening to the Arizona community radio network on eighty nine point five FM K Jay Z a trick Prescott tally Ninety point one F. M. K. J. C. P. Prescott Chino valley Ninety point seven F. M. K. J. C. K. Kingman Boulder City Nevada\nAnd translator K. two one seven eat the Flagstaff months park at Ninety One point three FM\nThe ... Center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the Beale Street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson that three eight five three one nine five to three eight\nFor the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary and Valentine, Arizona thirty miles east of ... historic route sixty six to ... rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day no divide except you day out historic route sixty six\n\n... like I said I'm here with you we can great music lined up for your next hour the masters and gel Riley\nAlso my plate and more let's start with the war in the ... song interpreted by Madeleine Perot\n... ... ... when the\nShadows of falling and I'm running out of Iran to keep me in the hot tub while\n... you didn't mean no new and then as we need we need a new law school one\nMm\nMm Mm to\nMe I wake up and then the crazy then you need you hug\nDoes it mean leaving that they call when all and then keep me and you know a little while\nNo no no no\nNo he man you are not well\nNa na na no need to be in a\nKinds of when you do in those things around the house we need to be using to me and my\nMom tiny like the new ... new a new low lie\nTo me I thought it would have made to New York ... you know when you come to keep them\nNow we read next to you\nKnow president Jean\nKing made a little\n... but they really do need ... in your son was\nNa allow me\nKeep me in a whole lot around\n\n\nWoman\nWho\nAre on\nA I'm Chris I'm Eleanor everywhere the mouse and you're listening to under current\n\nNa\nNa\nNa her and her job\nAnd [laughter] and\nAnd it may get right back and\n\nAny\n\n...\nNa na\nNa na\nNa na\nAny\n[noise] na na na\nNa na na na\n\nHappy man\nI mean\n\n\n[noise]\n[noise]\n[noise]\n\nIn\n... job with the bone in bed have been a while to being a real man go do the bad last this is pretty sure the guy to a hell of a star with his grandpa money in that job that you want to do is just to be the hard\nThing to be you know it may\nWell do you go the ... the last minute and and and now looking to\nThe the ... locked the door in the dark on a board of business do do they are they really are you a little bit on the bard\n\nWith gray\nWe've got to start\n\nYour\n\n\n...\nThe rain\nNa na\n...\n\n\nAnd you\n\n\n\n[laughter] [noise] uh no [noise]\nAnd\nOn for a way and\n\n\n\nThe\n... but\nUh uh the uh ... ... ... ...\n... ...\n... ...\nAnd ...\n... ...\nMan a man\n\nMe a glee holes and he goes to the bar\nThat the military hardware\nTo weaken the kid I\nClose to a\nMan of\nOr\nWho\n[laughter] [noise] so ...\nA young man\nMan a\nCome on you know\nYou don't let them\nNa na na na na\nThat is his role whichever from Mali you're listening to under current\nMm Mm\nMm\nBut you're saying and then\nThings you can remember\nWhat your kids in\nThe San Fernando I'm On the ...\nThe one thing I Know\n\nSay\nShow\nThey have\nIt's going\nRemember\nNo no no no but you know how\nSaying\nTo show you\nSaying\nIs still here a little a\nBit of a\nNamed or they\nCan\nDo on the\nAnd uh\n[noise]\nUh\nNo [noise] no I'm saying\n[noise] [noise]\nNo\nI'm On a\n...\n\nNa\nNa na na\n... mile\nMile\nLot\n...\n...\nWhat a great song about electric cars that isn't being selfish and the ideal in front of that has come out and they gave us only love each with its Last Train from Alaska with ... now and\nHeather Maloney with iron oh it's ... I got to be and I and if you're just joining us welcome from Austin, Texas here's Greg Trooper on under current\nMan\nDreams about you\nWe may have been known\nBe Ryan no\n... ... ...\n...\nLast minute there and I\nHuge in the evening news\nNa na\nThat you may know\nYou knew things no\nShe dreams about it is\n[noise] ...", "show_name": "BBC World Service", "year": "2018", "city": "Kingman", "day": "03"}