{"month": "10", "state": "AZ", "station": "KJZK", "content": "Of their life savings and pull mellow day poll you my name's Jill\nYou're listening to the Arizona community radio network kind of eighty nine point five FM cages he drank Ninety point on FM cages E. pi Prescott in Ninety point seven F. M. K. J. C. K. can support for the Arizona community radio network is provided by\nGrand Canyon defined eight miles east of William's on the interstate forty welcome any here see them right out of your hand see hundreds of animals that elk buffalo or else camels collecting Lindy kangaroo my mixed Rainier and more the Grand Canyon fire near Williams support for the Arizona community radio network is provided by\nKeepers of the wild nature park in animal sanctuary and Valentine, Arizona thirty miles east of payment old historic route sixty six to ... five rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day not divide except you Jay audience do recruit sixty six\nFine public radio programs you enjoyed that inform enlightened editor Jane ... to June in radio dot com that church for ... at the Arizona humidity radio network said listen any time on your smartphone [noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\nThat is vibe or phone is still wear and on guitar mark ... bowl and\nThe Duke Ellington plastic of course it don't mean a thing if it ain't got that swing and that is from bill CD called sir Duke\nAnd when I first saw the cover of this CD I thought oh he's doing the Stevie Wonder to surge Duke no he's of course referring to Cirque du as in LA too and there is all Duke Ellington music on this CD\nAnd we hope you enjoy that you are listening to jazz with the age one a couple of more vibe or phone us coming up stay with us\n\nMy name's Dave one you were listening to the great American music we call jazz and it it's great to have you with us here ... CD walk of fire\nAnd more or less a tribute or maybe a direct tribute to bags the great fights player Milt Jackson this has been zone composition called bags mood\n[noise]\n\n[noise]\nFor\n\n[noise] for\nWhat beautiful playing from Gary Burden on vibes chick Korea piano at the new guitar while he hangs on drums and the pollen on base and ... to futures it's from the CD like my\nGreat playing and I love what brains was doing all over the drums and so everybody was so when you could actually here in counting or grunting a little bit as he went on white far and away the oldest of all five players there\nRoy was there at the foundation of bebop with Charlie Parker dizzy Gillespie to learning is monkey played with the mall\nAnd it just shows how open minded he is that he's willing to join the next generation and the generation after that came after him and the founders of modern jazz well you're listening to jazz with Dave's one and we have a lot more to come please stay with us\nAWAC Maduro men's and women's soccer teams will be having a home double header against Phoenix College and he took place tonight with them and kicking off at four thirty in the woman at seven this will take place at the WC soccer field on the east side of the campus behind the gym you can find further details at ... dot com\nBusiness Thirteen twenty AM radio can US state AM radio waves eat dog or a service of Arizona western college for more than forty five years\nSunny skies and humid today hind you're eighty nine mostly clear in the evening with the low around sixty seven in Kingman mostly sunny skies stay high near Seventy seven when gas up to twenty five miles per hour\nForty percent chance of showers in the evening was mostly cloudy skies mellow around fifty six in Prescott thirty percent chance of showers cloudy with a high and you're sixty eight Ninety percent chance of showers in the evening with the low rent fifty eight in Flagstaff fifty percent\nChance of showers cloudy hind you're sixty in the evening eighty percent chance of showers low around thirty nine\nThe San Luis library is deliberating she read week with the book these photo contest and the viewing of a film adaptation it'll take place between Monday October eighth through Saturday October Thirteen at the St Louis library which is located at ten Seventy five north sixth avenue in families for more information you can contact us at night to wait\nThree or four seven six nine zero\nGuitarists Peter Bernstein is up next with three great friends bread meld on piano Christian McBride on base then Gregory Hutchinson on drums\nThis is from a to C. D. set on the smoke questions label called signed live and it was done live at these these club Coca Cola in New York in twenty Fifteen get ready for this here's Peters tune called all too real [noise]\n\n\n\n\n\nPeter Bernstein live at disease collect Coca Cola and twenty Fifteen and he was too cold all too real\nAnd are real good group there with Peter on guitar bread mailed out on piano Christian McBride on base that Gregory Hutchinson on drums from this to CDs that on the smoke sessions label called science live\nYou weren't listening to jazz with ... and it's great to have you with us we're going to take things down quite a bit now\nWith the great jazz trio in this instance the leader is Hank Jones as it always was for the great jazz trio the bases curious George ... and a drummer we heard earlier in the hour where he hates\nThey did a CD dedicated to songs that were associated with Billie Holiday gold flowers for lady day we're going to play a cut\nTheir rendition of a song that lead a recorded less than a year before she died with the great Duke Ellington out alive concert at the plaza hotel in New York City the Tunis called don't explain\nAnd if you haven't heard Billie Holiday and Duke Ellington do this together on that album seat that out it is utterly a chilling and beautiful\nJust rendition is beautiful to here's the great jazz trio which don't explain\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\nYou're listening to the Arizona community radio network on eighty nine point five FM K Jay Z a Drake Prescott valley Ninety point one at ten K. cheesy cheap Prescott Chino valley Ninety point seven to ten K. J. C. K. Kingman Boulder City Nevada\nAnd translator K. two one seven ... pi Flagstaff month to park at Ninety One point three SM support for the Arizona community radio network is provided by\nMartin's funny Chrysler dodge cheap ram and key at twenty six twenty east anti divine in king then you can depend on Chinese for find selection of new and pre on cars trucks and SUVs were quality cars and trucks really do cost less the inventor and shop online acumen dodge dot com\nSupport for the Arizona community radio network is provided by uptown United drug where you'll find friendly knowledgeable garbage that was more than eighty years of combined experience for the board of Health News discount coupons key medication information or to refill your mail order prescription log onto uptown United road dot com Serbian king minute golden belly\nShower so low around thirty nine\n\n... nine year with you with great music coming up we'll hear from dirty projectors for Iran says all and\nAnd Robert LA let's begin with cats know between Roseanne cash can't know AK Kevin more extensive this song\nThe women of our society in my opinion our greatest on tap natural resource underutilized underestimated and misunderstanding he can't know and Roseanne cash on that degree\nNot [noise]\nAnd do that and we do do do they\nNot have been\nThat we're more\nDo you did you do then do you fear\nThat the\nDuring the break the back and\nUs from\nJob that we've got the term we're\nWe need to\nBe a team and\nShe's got to know\nGot the bill\nDry do not know that they're you know [noise]\n[noise]\n\n\n\nRemain calm and then when\n\n\n\nIs\n[noise]\n\n\n\nThe show we see them ...\n\nAnd then the world\nWe're like swimming um er visits on the currents thank you for listening\n[noise]\n[noise]\n\n[noise]\nThe ah yeah\n... ... the um\nThe main way\nRead the\n\nWhen the phone to see\n\nHands up the phone and\nWe ran the and\nTimes in my\nYou know created a\nIn July we are\nWell not just a\nMercy and John ...\nNa\nNa\nNa\nNa na or\nI mean\nMaybe\nLater in\nThe rocky or ...\nI mean you know I\nSay no\nNo no\nThe\nOnly ...\n... ...\n...\nThe Nazi na\nNa na\nThe\nJob\n[noise] I see\nSome\nName\n\nThe Rockies tours come inside\nMe and I\nKnow that the\n\nNeed for more money\n\nThan needed to be clean because they they were two\nMen like him no no no\nNo no no\nIn\nMy senior year I saw um [noise] maybe\nWhen\nThe Iraqis to find\nMe is that the\nNext year\nThen he [noise]\nMain the main\n... free\nGame\nMay get my ... and buy it for you\nKnow I really like they do is go\n\nOn the east coast [noise] civilized theme song\n\n\n\nThis is an hour George and you're listening to under current\n\n\nTo it no no I didn't\nMake the night there was a collie again not that and I\n\nGirl in New York for the\nLast thing I mean like Pennsylvania then money that hang\nCan\n\nThe\n\n\nRather that big screen name\nLike getting it sounds like a man\nWhy they believe in them dirty habit\nChange one thing I don't\n\n\n\nWhen you can keep you on the tank\n\n\nNah nah\nThat was Florence and the machine with Patricia\nInara George gave us young adult here was Frederick night with interpretation of been more since into the mistake\nAnd parents along with somewhere over the rainbow you're listening to a new currents I'm do you like I did not and if you're just joining us welcome ... Robert Ellen\n\n\n\n\nYou know people from ... to\n... the new black man the back a little later\nShe do\nIs that it's worth it to your mom and\nMy ex used to be ...\nHere in the camp she's hack Hannah blames Sudan being who he is right now I'm reading here who read back when the\nKing Hulu\nAm I doing here in in in ghost town\nThe reason I Know I\nMean and you can't go right now and she\nMade any\nRerun later non changing\nReno ... lack of\nDream way I'm paying ... billion\nDream about dreams where the main reason that the man in\nThe\n[noise]\n\nYou're listening to the Arizona community radio network on eighty nine point five cages Drake Ninety point one of them cages BP Prescott and Ninety point seven F. M. K. Josie cake can\nSupport for the Arizona community radio network is provided by\nKeepers of the wild major bark at animal sanctuary invalidate Arizona thirty miles east of ... historic route sixty six to ... by rescued exotic animals lions tigers cougars dancers leopards monkeys in more open every day no divide except you day is do recruit sixty six [noise]\nOn she's all that we're talking with new mom and entrepreneur shell Baker business communications is all about using technology to create communication\nJoining she's on the radio for women on Saturdays and Sundays twelve thirty right here I'm Prescott public radio [noise]\n\nIt's ... like I said I'm here with you some great music that I picked out for you this next hour something to lift your spirit will hear from Aaron Lee passion Carolyn rose the mavericks and minute trial and let's start out with the great Bonnie rate [noise]\nNa\n\nStill\nMay change what they do\n[noise]\n\n[noise] ah but\nThat ain't no\nGod [noise]\n\nLa\nNa na\n\n\n\n\nDa da\nDoes Madison award Madison lord of the mama bear and you are listening to under current ...\nIn me and my mother\nGiven a chance to\nNot sure I\nMean my watering\nStone win the\n... good but\n\n\n[noise]\n\nYears there any\nBack\nAbout their their sons\nAnd [laughter]\n[laughter] [noise]\n[noise]\nVery\nMe either [laughter]\n\n\n...\n\n\n[noise] [laughter]\n\n[noise] [laughter] no\n[laughter]\n\nNo\nWas signed into law\nChanged at all\nYou could say yeah I'm a breeze\nStony based around the\nHere so ... been here all\nThe sheer stall\n...\nWe rent\nMan\nYou still out there\nIt that way at\nYou wish for their stories\nIt'll never change time they're going to\nJust have huge coal mining\nI Can't stand\nMan\nLeaves me that she used to tell me the\nStill the people\n[noise]\nYou\nRight [noise]\n[noise]\nKnow\n\nDa da\n\n\nDa da da\nDa da\nDa da da da da da\n\nDa da na na na na na na na\nNa na na na\nNa\n\nVe been may be the moment in the building\nThen on the\nLights on it and stuff like you know by the time all the gas and the ... no longer than\nThat I worked at a time of year\nWhen they try and\nGet away from the way you know I Hope that\nThey gave him\nThe health care not\nHarder and harder\nI'm not sure about the\nThink that if they\nYou mean by\nLike okay we're going to be okay\nGot a\nIs being endangered I hear your name\nAgain going I\nPatty Iraq in ... and all\nAnd she's very like I thought\nAbout being on the air and the parking\nTalk about the virus\n\nBeen wearing a\nWay\nHey we don't\nKnow how bad man on the\nDay [laughter] [noise]\n[laughter]\n\n[noise] [noise]\n... for a minute chow in front of that accordion a singer and songwriter Mary will do love the lord known as ... like that\nGave us for those to like each funky and it was the mavericks with damned if you do and Carolyn rose with Jeannie becomes a mom it's ... and if you're just joining us welcome I'm ... now\nHere's GM's living with the Joneses Patterson trio\n\nYou're listening to the Arizona community radio network on eighty nine point five cages EA Drake Ninety point one of the cage AGP Prescott and Ninety point seven is M. K. J. C. K. Kingman\nKilling plans simply by looking at them you\nThere are friends that can turn those bums to a rich green do simply\nTo be part of the club by email had\nNor gee stone struggle but most to stop killing plant\nO. R. G. [noise] usually is transitioning to pour more diverse energy marketplace new technologies new business now much more open to Arizona energy ... is a new program to help you be more aware of the better informed and making your institution that viewpoint from across the\nCountry that you can find me and he joined me from Inside Energy transfer in one PM Saturday and Sunday [laughter]\n\n\nHe's ... he had like I said I'm here with you with some great music queued up for the next hour well here in New one from Paul McCartney seven horse Clara nova and Tracy ... let's start with Rob in Fort on under current [noise]\nMay have heard\n\nIs now now\nYou know\nNot even from\n[noise]\n\nOf math but as far\nAnd give out what\nThing that ...\n[noise]\n\nOh yours is Brian Jay from the ... you're getting down to the sounds are under current\nA I'm a\nDa da da\n\nDa\n\nDa\nDa\n\n\nDa da da da\nDa\nDa da da da\nDa da\n\nDa da\n\nMa na na na na\nNa na na na\n\nAnd\n\n\nNa\nNa\n\n\nNa ... my\n... year old oh\n\n\n\n\n\n\nI'm\nThat's going on and I'm Renee that\nI'm not ... main Mina\nBut we we\nDo you mean\nTwo na na na\nNa na na\nHey hey ho\n\nDa\n\nDa da da dum la\nDa dum\nHe's got the new one and\nThen\nThese\n\nGood thing\nI Know well I don't\n\nThan I Am now\nTo get some of the stuff\nGoing\nKnow\nI Know you've gotta thank\nI'm by no\nThe men's\nThat they go on\nAnd on the real world\nCan you be\nTo be under the ... [noise]\nBut I guess one of\nKnow\n\n[noise] [noise] that's an interesting one that I just found my strength up from the euro lounge two thousand three ... and ... I mean that they the plan it that\nThe last inhabitant up the planet\nYou find that even if we give us a new one cook it\nAnd it was ... by with electric and Mr relief and Philippe chair at\nWith steadfast gets into currents I'm ... and if you're just joining us welcome from ... California the local you have banned a senior Indians here's Tracy Lee Nelson yeah I'm\nOther\nAh yeah\nNa na\n\nNa\n... races yeah\nWow\nMassaging down the\nUm\nI work\nGosh we've got\n[noise]\n\n[noise]\n\nYeah I Know that live\nHere and where\nI didn't even\nAnd I thought it was a little that\nWere gone object dum dum\n\nDum da da da da da\nDa da da da da\nDa da da\n\n\nDa da da da da da\n\nDa da da da da da\n\nDa da\n\nNa\nI you\nKnow middle but I don't know\nAt all you know middle aged\nKnow not only do better I don't know\nI'm just not I don't know but I don't\nAnd so\n\n\nAnd\nNeal but nah no", "year": "2018", "show_name": "BBC World Service", "city": "Kingman", "day": "06"}