{"month": "10", "state": "AZ", "station": "KJZK", "content": "The service of Arizona western college\nBroadcast on the Arizona community radio network at age ... find that than changing the a drink Williams now do you plan on FM changes the ... get Ninety point seven F. M. J. D. C. K. king that in Ninety One point three asked them Flagstaff\nAnd you must sunny eyes near Seventy eight north northeast when ten to Fifteen miles per hour today mostly clear tonight lows around fifty\nYou're listening to the Arizona community radio network on eighty nine point five FM kj Drake Prescott valley Ninety point one K. Jaycee Pete Prescott Chino valley Ninety point seven ... came in Boulder City Nevada and translator K. two one seven ... Flagstaff months park at Ninety One point three FM\nI kept with the plants but we get our ivory feathers campus grass the most adjusting about grasses this door Panthers grasslands perfectly and the landscape long stocks of ivory plumes helped tall about forming green foliage waters garden center Eighteen Fifteen iron springs road in Prescott were people who love I regret says they love to show\nSupport for the Arizona community radio network is provided by uptown United drug where you'll find friendly knowledgeable garbage that with more than eighty years of goodbye to experience for the board of Health News discount coupons key medication information or to refill your mail order prescription log onto uptown\nYou not to draw dot com serving ... minute golden valley\nTo look into these are\nDown and I'm finding other war\n...\nVery within the ... so\nI was standing in now\nOf well\nSo ours Sheila now\nYou\n\n\nNa\n...\nFor a major shift ...\nNa\nNa\n\nDollars you know\nAnd ... ...\nI'm no nah\nNa\nHim oh\nAnd no and no\n\n\n\n\nShowed it on the\nOther way down and\nDa da da da\nDa\n\nDa da\n\nDa da da da da\n\n\n\nDa\nDa\n\nNa Virginia yeah\n\n\nMean you\nNa na\nI bet ya ya\n\n\n\nMe and\n\n\nAnd\n\n\n\n\n[noise]\n\n\n\nAnd\n\n\nUh\n\n[noise]\n\nWhen you might hurt on you know top forty radio or ... box or something like that as a down without along instrumental in the middle part Tom\nGreen to hear again the doors for what about fifty one years ago the modern single version of light my fire knew from Bob scared just down in Virginia\nIt's a great people on that album Charlie Sexton a door grandma and we saw him live just recently Joe fantastic barrel projects it will be weeks on base I mean just\nPlus musicians all around them and he just killed a scare\nFrom out of the blues the new album max cross to grow and it was struck rejoicing you might get an artist do Miller with hurricane it's undercurrents gray Keith Richards on the way and and the string bean now\nFrom his new album back in business this is chicken back to Georgia\n\nWho\nWere in a guy who\nMe she learned in the jungle\nTell\n\nArgues me Robert de\nNiro\nSo I don't\n\nConstruction\nMaybe\nMom thanks\n\n\n\n\n\nNow where else started doing\nSpring and my mom's current news ...\nIs\nKnow there's a lot of\nOne of the\nYou're", "year": "2018", "show_name": "BBC World Service", "city": "Kingman", "day": "16"}