{"month": "10", "state": "AZ", "station": "KJZK", "content": "You're listening to the Arizona community radio network on eighty nine point five FM kj the F ... tally Ninety point one K. Jaycee Pete Prescott Chino valley Ninety point seven offend kj ... came in Boulder City Nevada\nAnd translator K. two one seven E. pi Flagstaff months park at Ninety One point three FM the ... Center for the arts is a nonprofit company committed to promoting the arts in ... the group is renovating the Beale Street theater\nWhich will be a Center for cultures creativity and community if you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nGrand Canyon defined eight miles east of William's on the interstate forty walk among the deer feed him right out of your hand the hundreds of animals that elk buffalo curled camels Kuwaiti Mindy kangaroo ... Rainier and more the Grand Canyon near farm near when\n\n\n\n\n\n[noise]\n\nLive on what the saxophone and Michelle the true she on the piano on John Coltrane Central Park west\nYou're joined a jazz with Neil ... this is the honest Tom Cole\n... ...\n... ...\n\n\n\n\n\n\n\n\n\n[noise]\n[laughter] [noise]\n\n\n\n\n\n\n\n\n[noise]\nSo\nI Know\nThat\nThey can\nDo at home\n\n\n\nSupposed to\nBe asked to\n\n[noise]\n[noise] [noise] [noise]\n[laughter]\n\n\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n...\nThat\nShould be in a\nShe\nShe does she [noise]\n\nOr\nShe\n\nSome\n\n\n[noise]\n\n[noise]\nShe started showing\n...\nUh\n[noise]\n\n\nShe'd shifty shifty\nShifty\n\nShifty\n\nYou know\nWhat they write Miles Davis ... Nineteen sixties here's the latest from VJ higher\n\n\nA\nMan\n\nThe\n\nThen\n\n[noise]\n\nThe latest survivor Boehner's Steve melt then here's the liberation music collect [noise]\n\n\n[noise]\n\nYou're listening to the Arizona community radio network on eighty nine point five FM K Jay Z a trick Prescott valley Ninety point one of them cage ACP Prescott Chino valley Ninety point seven F. M. K. Jay Z cake Kingman Boulder City Nevada\nAnd translator came to one seven eat the Flagstaff months apart at Ninety One point three at\nThe center for the arts is a nonprofit company committed to promoting the arts\nIn king the group is renovating the Beale Street theater which will be a Center for culture creativity and community if you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson got three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nKeepers of the wild major bark at animal sanctuary in ... Arizona thirty miles east of ... historic route sixty six to ... rescued exotic animals lions tigers cougars Panthers leopards monkeys are more open every day now divided up Tuesday historic route sixty six ... lower ... thirty eight\n\nAlready to ... ... ... walking around you here we have so much music to share the shower Damien or rather the black keys\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHer way\nDog and my mom my mom\nSure what\nThe story I Want to research and the guys are going to the burger treatment but\nMaybe they should marijuana Mexico on natural reports for starting them every day you might be one of those shows let's just go to Tom ... the most extreme ones that\nThe truth but there was never bring them up\nI Will\nAnd we go to\nGive my left arm watch\nLot on you know the woman from from my mom I mean when\nDrink while they're\nOne does not three stormed they put them in the top Iran from St John Marshall ...\nFor yesterday\nAre now are where\n\n\n\nDown\n\n\n\n\n\n\nOne knew\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMade in ...\nWhen the main main gene news that I knew what you don't\nA minor\nIn Miami the\nWe're in Ohio and\nChanging China you're in a\nAnd buying a\nAnd\n[noise]\nWe're no\nOh\n[noise] under current na\nNa na na\nNa [noise]\nYeah\nI went oh\nOut when\nDon't\nMean\nI'm\nAt all\n[laughter] yeah I\n... ...\n\n... you mean Judy ... that\n... to go read this email from\n[laughter]\nNa na na\nNa na na na\nNa na ve teasing and\n[laughter]\n\nRunning for [laughter]\nI I Am today and na na\nNa na\nNa\nNa\nNa na\n[laughter]\nHow many people [laughter] director\n[laughter]\n...\nTrial na\nNa na na na\nNa\n\nNa\nNa\nNa na na na\n[laughter]\n... hours\n[laughter]\nThey trying\n\n\n[noise]\n[laughter]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "BBC World Service", "city": "Kingman", "day": "05"}