{"month": "10", "state": "AZ", "station": "KJZK", "content": "\n\nI listening to the Arizona community radio network on eighty nine point five FM AJC a trick Prescott valley Ninety point one K. Jaycee Pete Prescott Chino valley Ninety point seven to ten K. J. C. K. Kingman Boulder City Nevada\nAnd translator came to one seven ... Flagstaff months park at Ninety One point three at\nThe center for the arts is a nonprofit company committed to promoting the ... the group is renovating the Beale Street theater which will be a Center for culture of creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson three eighty five four three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of Williams on interstate forty walk among the deer feed them right out of your hand the hundreds of animals up close elk buffalo boroughs camel cool watching Monday kangaroo llamas Rainier and more the Grand Canyon near farm near William\n\nDon't\n\n\nNo no no\n\nNo no no no no\n\nKnow how to set up\n\nNa na na na\nNa na na na\n\n\nNa na\n\nNa a\n\n\n[noise]\n\n\n\n\nOh\n[noise]\n\nNo no\nNo no no no\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\nThat is the music and the playing of Walt wife's call the tuna it's called blue was combination walk whites go fund sects branch or read on Oregon then Jill is on vibes and steep stick on drums from all the deep called the way you see it [noise]\nWell this was the way we say it welcome you are listening to jazz with Dave ... one were to why did I have you with us we hope you can stay around for a lot of the great American music we call jazz because we've got plenty of it right here\nWe hope you're doing very well we have the sand Jones melt Lewis big band up next trauma Nineteen sixty nine recording originally out I'm a solid state label it was reuse your gun speedy on the blue note label it's called Central Park north here is bad the arrangement of that ad released jibes I'm Bob [noise]\n\n\n\nNa\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nNa na na\n\n\nNa\nThat way\n\n[noise]\n\n\n\n\n\n\nNa na\n\n\n\nThe ... empty jazz collected a greater range better Miles Davis is Joshua by ... the fiber bonus there the entire are that they get all the you know on on the ... debates on Trade Center\n\n\nYou're listening to the Arizona community radio network on eighty nine point five ... than ... a Drake Prescott valley Ninety point one at ... Pete Prescott Chino valley Ninety point seven to ten K. J. D. cake Kingman Boulder City Nevada\nAnd translator came to one seven ... pi Flagstaff months apart at Ninety One point three FM\nPicking the center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the Beale Street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com more call Christina Mickelson three eight five three one nine five two to three eight\nSupport for the Arizona community radio network has provided by\nKeepers of the wild nature bark at animal sanctuary in Valentine, Arizona thirty miles east of ... historic route sixty six to ... rescued exotic animals lions tigers cougars Panthers leopards monkeys and more open every day no divided up Tuesday audience do recruit sixty six\n\n... like I said I'm here with you wish you great music lined up for the next hour we'll hear from Madison dream Paul McCartney happy new album let's start out with this\nFrom arcade fire [noise]\nAh\nSome ...\nPeople be me they can\n\nNa na\nIn this current\nShia ... where the data is being\nMaking the gray\nGray Randy bring in the check\nI mean there were they they they\nHad it in and around\n\nKnow the man in the\nGame\nBeing an hour\n... and\nRead it man and he showed on to them\nHere and my family\nOr may\nNa na na na na na na na\nNa na na\nNa na na\nOld were you\nAnd then on a\n[laughter] and I\nHer na na na\nNa\nNa na na\n\nNa\nNa\nAnd\nLA or on\nI'm yeah I'm a man and\nHim out on a number on them\nAs they are not a medical man man but we don't want any more and\nIn it ... me and then it would to me ...\nMe\nOn that you know like\n...\n... ...\nAnd buy a new\n\nA no\n\n\n\n\nDa\nDa da\nA\nOn\n\nA\nOr there are ... oh why oh why oh why\nOh why oh why oh why oh why oh\n[noise] [noise]\n\nAbout my during the ... for us to shut down the chain I Do not\nBy then ... ... s\nThat the judge and stay well the\nMan I ran into no\nI Know what\nI\nLittle we know\n[noise] [noise]\n[noise]\nOr\nMom dad I'm sitting\nIn\nYour body has\n\nI\n\nWhat do we know\n\nNot sure I can go\n\nOr you know my gosh how bad I\nHas\nThing to be really you know people\nWho will review guns don't believe the ... aboard the\nLeave the ... lack of Georgia and the dog on a board of ... to do in a bar is the man and a little bit on the ...\nWhen a new\nWe all like to\nWith\nJob\n\nA chance in their schedule then that can take did he go again\nMan around that\nDown\nThat let's take another shot and then you\nOut and then they go\nAmy there with him cats down he was hunch brothers with jumbo and Paul McCartney gave us a new song off his new album each station despite repeated warning it's undercurrents I'm got to be at a\nLower rain and the Caesar around the corner but first years hating failures with with the foster\nDik dik dik\nBank\nNotions from nature you know jumble\nWe're ... we're you know when you learn\nDown live down there were written in\n... and\nVersion do you do the pain laid down you were\n\nAnd\nStrangely calm down on\nYou know my son drew these\nBeen\nBreaking the law\nI lay down you\nA\nTo jump\nStart a lay down and you were\n\n\n[noise]\nReally are so many women and\nNoble going to be you\n\nMy\nI\n\n\n", "show_name": "BBC World Service", "year": "2018", "city": "Kingman", "day": "17"}