{"month": "10", "state": "AZ", "station": "KJZK", "content": "And listening to the Arizona community radio network on eighty nine point five that than kj Drake Prescott Sally Ninety point one at ten K. Jaycee Pete Prescott Chino valley Ninety point seven to ten K. J. C. K. came in Boulder City Nevada\nAnd translator K. two one seven eat the Flagstaff months park at Ninety One point three at the ... Center for the arts is a nonprofit company committed to promoting the art\nSinking the group is renovating the Beale Street theater which will be a Center for culture creativity and community if you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nGrand Canyon define eight miles east of William's on the interstate forty walk among the deer feed them right out of your hand the hundreds of animals that cause elk buffalo girls camel cool watching Monday kangaroo mama's Rainier and more the Grand Canyon deer farm near William\n\n\nPyramid the tune co written by Duke Ellington and his trombone as one teacher told\nAnd perform there by Trump voters Nick singer for new CD nor rival joining Nick on bass clarinet because he knew all Victor ... piano eloquence guitar deep Baron on base and you may McBride on drums\nHello and welcome you're listening to jazz what they want it is a pleasure to have you with us stick around for a lot of great music\nSo Loni is monk and he was legendary quartet with Charlie Rose Santana which word on base Frankie done lop on drums up next this from Nineteen sixty three of live performance in Tokyo bench just wait\n[noise]\n\n\n[noise]\nShe [noise]\n\nShe\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise] [noise]\n\n\n\n\nA piece by bill Evans written in memory of his\nFather turned out the stars\nBill Evans there of course on piano Jim Hall on guitar and that is from the album inter modulation\nJames Isaac's wrote some terrific notes for the real issue of this album on CD back in Nineteen eighty seven he begins by saying here is a Jew will the glittering discover fees of the pianist composer bill Evans and the guitarists composer Jim Hall\nPerhaps one should call it er modulation softly glowing jam\nFor its radiance does not blind but reflects instead the subtle brilliance of to master craftsman who also happened to be great artist\nBoy that sums it up right there but the final line\nJames borrowed a line from the Frank Sinatra classic one for my baby and one for the road\nThe final sentence whatever the hour it's quarter to three\nAnd there's no within the place except you and Jim Hall and bill Evans that's the feeling you get throughout inter modulation recording in Nineteen sixty six but the music will never be dated\nSpeaking of music there's a lot more head you're listening to jazz with Dave ...\nSt Louis high school offers a college career and military fair it's a chance for students to learn about opportunities available to high school graduates Wednesday morning October third at nine thirty at the St Louis campus multi purpose room twelve fifty north eighth avenue in San Luis for more information you can contact K. A. W. see\nThanks for listening to radio Thirteen twenty am a you know we have to broadcast on the\nRadio network in Prescott king that accent and Williams\nRain across the key WC listening area today beginning hearing ... fifty percent chance of brain was cloudy skies in the daytime high an eighty six degrees in Kingman today about sixty percent chance of brain with cloudy skies to end high today around eighty degrees\nUnder storms likely for Prescott today as well about Seventy percent chance mostly cloudy skies their daytime high of sixty eight and sixty percent chance of rain today in Flagstaff area mostly cloudy skies their hive sixty five\n\nIn the county library continuing their small business workshops series presented by business librarian Andrews the woman this week teachers find your customer friday afternoon October fifth from three to five at human main library twenty nine fifty one south twenty first drive more information at you my library dot org\nLet's go to Vancouver British\nColumbia but the spike will never trio this was the recorded that live in Vancouver in December twenty sixteen with spike on piano Tyler Mitchell on base and Anthony ... drums the CD is called old at least the two is called sweet Georgia brown [noise]\n\nTo feed them\n\nIt often does he need to be looking into what they need each individual\nBe\n[noise]\n[noise]\nOh night\nIn Tunisia\nRecorded there during presumably a night in Japan actually\nThat was from the juice to Concord Jazz festival in Japan in Nineteen eighty eight the rate brown trio and at night in Tunisia ray of course I'm based gene how about a piano there and it's re gave credit to Jeff Hamilton on drums the CD is called bam bam bam\nAnd before that from the spike Mueller trio we Georgia brown the CD called old on the east coast spike on piano tire Mitchell on base and Anthony ... on drums\nYou're listening to jazz or they want to hear is Dr ... Smith on piano and I saw\n\n\nFrom it\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five FM kj the egg Drake Prescott valley Ninety point one F. M. K. Jaycee Pete Prescott Chino valley Ninety point seven offend kj ... Kingman Boulder City Nevada\nAnd translator came to one seven ... pi Flagstaff month to park at Ninety One point three FM\nThe king the center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the Beale Street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eighty five three one nine five two to three eight\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary in Valentine, Arizona thirty miles east of ... historic route sixty six see over one ever jeopardy by rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day no divide except you today about historic route sixty six\n\nAlright it's under current in some great McGregor welcome friends lots of music on the way so try fish tank ensemble black prairie Courtney Barnett\nAnd right now the little league this is way down the road\n...\nNa\nNa na na\nNa na and over and\nWay down to the\nHey you know I mean and\nOf our ah our\n\nAnd our you know\nOrdering na na na na\nAA\nAnd uh\nYeah I hear your car na na na\nNa na na na we're down\nNa na\nNa na na na na\nNa na na na na\nNa na na\nAdvent of\nRight now and I know a bigger\nAnd married a\nMan and a\nNa na na na na na\nNa na\nThe\n\nAs I\nThe snow\n\nNo not really I'm\nOther than a turtle\nWere\n[noise] ...\nThey were being\n\n\nMaybe you know the man no matter\nHave the fun out\nAnd\n\n\n[noise] you\n\n\n...\nAll the\n\n[noise]\n\n\n\n\n\n\n\n\nA\n\n\n[noise]\n\nDo\n\n\n\n\n\n\n\n\n\n...\nBoom from her middle\n\n... the whole\nBoom boom boom boom her in\nCan she can\n\n\n\n\n[noise]\nThe the um\n\n[noise] [noise] Hi this is on the east side when black but it was okay I'll Try it yeah Hi this is an ally Senator John were black very new thing to under cars do\nYou live in London\nWhen my mom you know I'm a ... [noise] you know\nI [noise] I don't know I Will\nSay God\nYou know\nMy mum she do\nMan on the man\nShow you're on the [noise]\nOh\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nThey\nThere\nAre three ...\n[noise]\nCarried away a\n\n\n\nYou're a liberal\n[noise]\n[noise] na\nNa na na na na\n\nNa na na error or if they didn't know\nA\nScramble [noise] ...\n\n\n\n\n[noise]\nAnd\n[noise]\nNa [noise]\n\nNah\n\nNah nah nah nah nah\nNah\nNah\nNah [noise]\n[noise] [noise] nah\nNah\n[noise] na na\nNa ...\n\nOh that's my job I just joined it from the\nClinton is try to capture what to sender tweens and then back to back kind of see each other on cars a big\nRound texture gets you sound really cool indigenous wake up precinct on global before that with Turkish March from the album samurai were Serbia\nAnd it was for the John misty would be nice it's under current should be just joined us welcome lots of music store had like this one from Caroline Rose from the new album woman\nIs a genie becomes in la\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\nThen and then another one\nThe\nAm\n\nWhole\nYou\n\n\n[noise]\n\n[noise] [noise] oh\n\nNa\nNa\nNa\nNa\n\nWas a man I was we went in the budget will be men they gave us the either the man she found another way to make it so when the name of not the shop and three oh", "show_name": "BBC World Service", "year": "2018", "city": "Kingman", "day": "01"}