{"month": "10", "state": "AZ", "station": "KJZK", "content": "Everyone in the kitchen right now on music city route live from the factory\nHello I'm ... and this week's piece of roots music from Nashville recorded fresh October fourteenth twenty Fifteen of liberty hall climax is with a very clean sounds of dirty kitchen\nThat's the band Mandel innocent singer Franks all of them a long time favorite of ours out of the DC area\nIs group has been named IBM a instrumental band of the year thanks to incredible skills mandolin guitar and banjo it's always great news when he and the boys are on the bill and as a bluegrass heavy night in general with emerging talents will hear from striking young artist to mingle er to legend bluegrass from our base playing dad and the local scene in Palo Alto California\nWas formal training at the Berklee College of music\nHer name's Molly title and she's a rare combination of singing songwriting an instrumental virtual city [noise]\nI'm just fascinated by her guitar playing in her fresh voice and up in the first said we'll hear from North Carolina family band who sounded a lot more edgy than their name mountain faces coming up shortly\nWe also enjoyed a set by a couple of brothers who grew up in both LA and world tendency that makes for its own kind of fusion Jim Lauderdale is with us again as musical hosts we had a lot of fun on this evening so let's let Jim get things started [noise]\nAre you doing [noise]\nWell hey here's a song I've been kind of on the role of doing stuff for my new album called soul searching that just came out a few weeks ago and here tonight I'm Sorry available here tonight yeah it is and uh and hey will be tomorrow night maybe you're going to say something later about you know\nSo what about any further ado here's the tune of that record call worth the wait\n\n... ...\n... ...\nOne of the white and I'm Don\n...\nWho's the late ...\nNews day out and down waiting around the ... race raised him man is dealing with all my will fill that gap hands on black that\nDon't go in 'em long\nTime in June ... ...\n... ... ... yeah you\nKnow\nAnd ...\n\nI'm In a\n\n\n\n\n\n\n\n\n\n\n[noise]\nLive\nAnd you're you're on a very special way\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSupport for this public radio station is provided by the king would underwriters\nSupport for Prescott Public Radio's provided by\n... listen to your local reliable source and Bobby county for wireless Internet ... service it cut the cord by your communication services by telephone to your high speed why fight that keep you keep your number learn more because we don't water it took ... three three two not the ... century three do not\nSupport for ... public radio was provided by\nMarch twenty Chrysler dodge ram in key at twenty six twenty east Andy divide and king then you can depend on ... fine selection of new and pre on cars trucks and see these were quality cars and trucks really do costs less sea and the terrain shop I might add humid dodge dot com\nSupport for ... public radio was promoted by John United drug where you'll find friendly knowledgeable garbage that was more than ... years of Dubai experience for the board of Health News just going to budge key medication information or to refill your mail order prescription log onto up do\nYou not to grow dot com serving two minute goalie belly up do you do you draw dot Gov\nSupport for public radio was provided by cable one providing TV Everywhere get more out of your cable TV experience with TV Everywhere standard cable goes to have access to fifty plus cable networks that you can enjoy watching from your computer your tablet or smartphone to learn more go online to cable one dot net\nThat cable one in ... county [noise]\nNine point blank in Ninety One point to me at ... am\nYou're listening to the Arizona community radio network an eighty nine point five K. J. ca Drake pets get bally Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven K Jaycee came came in Boulder City Nevada\nAnd on translator cake to one seven ... park in Ninety One point three FM\nFranklin upon shot things are on stage and let's get back to the music\nKnow that you're leaving me\nLeaving no\nShoes they\nGeneva me\nDo is you're asking me\nThis dial my I have to do that\nYou can do\nAnd I\nA lot of the\n\nGod I\nJack [noise] I get a\n[noise] Iraq [noise] go ...\nSo kids coming from California we grew up there but when we come back here to Tennessee it was always going home\nI'm always say we're going home for Christmas so we're going home for Thanksgiving or the summer wherever it was so for us we're always coming home to Tennessee So our grandfather\nWas a farmer and we would run around the land and we kind of grew up as kids coming this land is it is there's a lot of history to er nurse family we played a Memphis last night in a bunch of our family was there and this really cool place you know that's kind of the special to be able to play music and the stones about our childhood\nWith our lineage was pretty special so we're in this thing were loose on now\nUh this is called outside ...\n... they\nThen\nBig back yard\nShow\nA night she\nKnows too late to do\nThe gas tank out\nThey do what you choose\nOn them ... and then all\nThe time as cheating and\nThe house you have to do\nFind the gas tank\nThey do and once you choose to do\nThat you choose to do\nDid jeez man man\nNew\nI think she been\nThe ground\nMan a\nI [noise]\nI used to play with us for the first time ever\nI was did you go forward over here and get the\nAnd when\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSupport for this public radio station is provided by these sixty six underwriters support for Public Radio's provided by Barry oh no the drive through wildlife adventure bark at Arizona you buy in bulk and goats and sheep and black mayor for new safety uncovered over your primary vehicle\nOr travel go watch America at the end of you were to Arizona like forty at highway sixty four in Williams, Arizona dot com\nSupport for it publicly provided by the Grand Canyon here for ... miles east of Williams on interstate forty walk among the deer and treat them right out of your hand see hundreds of animals\nAre close to buffalo boroughs gamble on Monday kangaroo llamas she go to read you read more and more online at ... dot com the Grand Canyon do for\nSupport for it publicly provided by keepers of the wild nature bark at animal sanctuary in Valentine, Arizona thirty miles are used to historic roof sixty six to ... by rescued exotic animals lions tigers\nCougars answers leopards monkeys in more open every day you know divide up Tuesday historic roof sixty six\nLike the one hand and I get my hands on\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\nYou're listening to the Arizona community radio network on eighty nine point five FM K Jay Z a trick Prescott valley Ninety point one of the cage ACP Prescott Chino valley Ninety point seven to ten K. J. C. K. Kingman Boulder City Nevada\nAnd translator came to one Seventy Pete Flagstaff months park at Ninety One point three at the ... Center for the arts is a nonprofit company committed to promoting the art sinking the group is renovating the Beale Street\nTheater which will be a Center for culture creativity and community if you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson three eight five three one nine five two to three eight\nSupport for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of William's on the interstate forty walk him on the deer feeding him right out of your hand yeah hundreds of animals up close elk buffalo girls camel cool watching Mindy kangaroo llamas Rainier and more the Grand Canyon deer farm near William\n\nMhm\n\nNa na na\nNa na\nNa\nNa na\nNa\n\nNa na\n\n\nNa na\nNa na na\n\n\n\nNa\n\n\n\n\n\n\n\nNa na\n\n\n[noise]\n\nNah\n\nNah\n\n\n[noise]\n\n\n[noise]\n\nThere is pianist Harold may burn leading a quartet with Eric Alexander on tenor net reads on base and the great Jimmy cop on drums all great musicians here as a matter of fact if there is someone lovely year then you\nAnd that is from Harold CD called two dogs and be love terrible ...\nUh one of the unsung heroes as far as I'm concerned how playing with just about everybody going back to the Nineteen fifties in through the Nineteen sixties and seventies with people like Lee Morgan here it's great to see in leading its own group onto mugs and beat loved\nHello there you're listening to jazz with each one we are so happy you joined us here's Russell Malone from my recording he did when he was still in his early twenties\nThe album or CD is called black butterfly\nAnd here is the opening cut which show Russell points out in the book with notes was recorded in Nineteen fifty nine sessions with the great Wes Montgomery west of course an idol or I'm a leader for wrestling with just about any other guitar player\nBut here is the opening caught on Russell CD black butterfly it's called jingles\n[noise]\nBassist Alexander classy and a very different version of what are you doing the rest of your life\nAlexander the bases cook was in Waco guitar David costs on piano\nAnd a mock would feel junior on drums the name of this the CD is standards what are you doing the rest of your life and the great Ron Carter wrote a couple of paragraphs for the book like notes\nThe first reads the new comprehensive agency crossword dictionary defines standard or standards as normal typical and regular\nBut this recording standards what are you doing the rest of your life by Alexander ... anything but standard and that arrangement by Alexander proves that\nThe number of standard things out here you must believe in spring so in love by a Cole Porter\nAlso a couple of things that might not be considered standards but are certainly in the jazz and blues around the corner by McCoy tighter and how about this Michelle by John Lennon at Paul McCartney great stuff from Alexander classy\nYou're listening to jazz with dates wind here is more great stuff let's go back to the late Nineteen seventies for this rate Bryant and his trio with Sam Jones on basic ready taint on drums\nThe album was released cold all on the Pablo label called all blue was and he was the opening cut to stick with it for\n\n\n\n... brown the one and only and then he green on piano\nJazz Hamilton on drums and of course did you must be to own on Bob with us from Racine deep don't guess\nAnd as we said before we played the ... done in a studio a recording studio in West Hollywood in April of Nineteen Ninety four but they invited some enthusiastic gas and it all worked out very well you're listening to jazz what stage what your guitars Jim Hall too cold for air\n\nNa na\n\n\n\n\nNa\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\nNa\nNa na\nNa\n\n[noise] no no no no\n...\nThe guitar artistry of Jim Hall\nAt a tune called up for air this from Jim CDs something special\nAlong with Jim Larry Golding some piano Larry also wrote the too weird and speed must be no on base I certainly enjoy hearing this trio in the early nineties about the time this recording came out as a matter of fact and by the way Larry ... is the keyboard is the pianist\nOn a Grammy Award winning album with another guitarist John Schofield country for old men Larry is the lending his expertise on that recording is well\nYou're listening to jazz with Dave's one\nWe heard Benny green on piano earlier a little bit ago which ray brown in his trio than he\nIs a long time friend and patriot and colleague of the basis we're about to hear Christian McBride then he stopped the pianist on this CD but Christians big band certainly does bring it home as a matter of fact the name of the CD is bringing it\nAnd we're going to hear McCoy diners to say that route\n[noise]\n... [laughter]\n\n\n\n\n\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five FM K Jay Z a Drake Prescott valley Ninety point one F. M. K. J. C. P. Prescott Chino valley Ninety point seven F. M. K. J. C. K. Kingman Boulder City Nevada\nAnd translator came to one seven eat the Flagstaff months park at Ninety One point three eh than\nThe ... Center for the arts is a nonprofit company committed to promoting the arts in ... the group is renovating the Beale Street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com more call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary and Valentine, Arizona thirty miles east of ... historic route sixty six to ... rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day no divide except today audience Dora group sixty six mostly quality in the evening elope round thirty eight\n\n... ... for the next hour I picked out some great music which I think you'll really enjoy well there's two little feet Conaway ... enough to live there\nAnd let's get the ball rolling with Baylor slack and Abigail washed parent [noise]\nYou\nBring it down\nGoing back\nThen they throw\nTo leave her being\n\n\n... you can you bring you down\n\n\n[noise] to\nBe be\nRainy [laughter] you know from\nMe here's your song\n\n\nOur our our our um\nNa na na\n\n\nNo ...\nNo ... no\nWho\nAre in the\nKnow\nOf\nThe\n\n\nRunning on the\nMaking\nOn the same you know\nFair to say that\nAnd down and they say they are\nNo\n\n\n\nTo spend you\nKnow there are good\nLearning a\nThe\nI'm Renee I began um um\nMe and my family in\nSanta Fe on man\nKnow man now than I\nBeing\nUp to I mean\nTime and I know I didn't\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nGood class I don't really mind ain't nobody around a lot of me [noise] and\nThen they don't make a living in a lot of that in the mountains and nobody noticed a\nLittle bit but I'm not\n\nI'm not sure what you mean like [noise]\n\nI got a bank the dolphin stopping you drive but how\nYou want to get them both Tom how can we talk about the meaning of the others around but have\nBeen me but to me to become an all out and\nI actually\nDon't know how they can do that is how do you think they can actually\nMake it no I don't know I didn't have anything to say about\nMiles either going to stay there isn't\n...\nA la la la la\nBut a boutique or you know\nWhy you say you're saying yeah you pay a ... ... ... they say hey\nI'm a I'm a lot a\nBridgette guy you know why am I saying your right hand say hey yeah but I Know you buy\nAnd train\nYears Marty how your\nYou're hearing drain by you know\nYeah I mean are you ... to\n\nD the\nAre you there yeah I mean yeah while you're there you know try you\nHearing is paying\nNa na na na na\nG. God are you start off worrying hey hey why and I\nYeah how do you have\nYour dog dies mom we\nMobs by young lawyer\nA I die you blow on\nI ask where are you a very tiny yeah now you're going\n... by around\nA\nEarly in the white area yeah not sorry you know very am paying\nNa na na na na\nGee God are you there are worrying hey you're in a a wire and saying hey yeah ...\nYeah yeah\nVe got high you\nKnow why you have\nTo work for\nUm maybe\nBut\nIn than any man\nYou don't need to do a lot of news\nThey keep in\n\n\nTo the news and she had\nAll these may\nWell have been\nPounding tiny\nThings\nYou do like to\nMean you\n[laughter]\nYou\n[laughter] [laughter]\nI don't know how\nMuch\nCan you\n\n\nMom do you see my friends about from getting tired of\nWaiting for me to just across the mama ... someone asked him a lot of God\nI Know\nKnow you're trying to\nYou know I'm a science I think you know\nThe bars close it and you feel like Paul and I'm I'm Carrie\n\n[noise]\n[noise]\n[noise] [noise]\nMan you God\n[noise]\nMe\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] no\nNo no\n\n\n[laughter] I\nKnow\n[noise]\n\n[noise]\n\nWow what a great version of we are young featuring fun and the ... mice throws\nWhich is a star studded group a beautiful wonderful musicians with the distinctive rhythms and sounds of go by it's recorded by an all star cast of legendary musicians in fact\nIncluding when I was just social clubs by buddy the daughter and I might eat the why did you find is that the French singer Christine and the queens gave us damn what must a woman do\nWhat do you end up ... critique to our current administration with Tangerine man and it was Conway with woman you've been listening to a new currency and if you're just joining us welcome here's Patty Larkin on under current\nOh no\n\n\nNo\nWell do you know\n\nNo\nI'm the I'm\nLike\nOh my ...\nNo\nNo\nI don't really\n\nKnow who can make you\n\nYeah let's say\nYou\nOh\n...\nMaybe you know Israel you know I ... you know\n... ...\n\nHe he ...\n\nAround and come back again by so\nIn\nMay and I believe for a long\n\n\nGoing\nTo leave me in Iran\nAnd\nYeah you do a lot of good and then you know", "show_name": "BBC World Service", "year": "2018", "city": "Kingman", "day": "29"}