{"month": "10", "state": "AZ", "station": "KJZK", "content": "You're listening to the Arizona community radio network on eighty nine point five ten K. Jaycee Drake Ninety point one of them PJ repeat rescue and Ninety ten minutes and AJC cake\nCan support for the Arizona community radio network is provided\nBy Grand Canyon deer farm eight miles east of Williams on interstate forty walk among the deer feed him right out of your hand the hundreds of animals that cause elk buffalo boroughs camels who watch the movie kangaroo llamas Rainier and more the Grand Canyon deer farm near William support for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary enveloped joined a result of thirty miles east of the middle of historic roof sixty six so you over ... rescued exotic animals lions tigers cougars dancers leopards monkeys in more open every day no divided up Tuesday historic route sixty six\nBy the public radio programs you enjoy that and for middle aged editor date logo to tune in radio don't go to church or gay Jay Z eight at the Arizona humidity radio network that looks at any time on your smartphone\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nNo no no no no\nNo no\n\n\n\nThink I had something we all\nShould do at one time or another in our lives speaking for myself I Know that's certainly true\nI think I had was the name of the two and it's also the name of the CD from Trump bonus and composer Steve Davis who put together a supporter\nSex tests for this recording Stevens the trombone us of course we also have Steve Wilson and Jimmy green on sex and ... does the Wilson plane flew down a couple of cups here\nEvery one of those the pianist Peter Washington on base and Louis Nash on drums all good friends and colleagues getting together for Steve for thinking ahead and\nWe're delighted you talked to join us you're listening to jazz what they want welcome aboard least stay a board with us\nWe hope you're doing very well and we hope the music makes things even better for your tenor sax bandstand bill and up next Sam has a rioting of music onto CD called out in the open it all works very well things by Horace Silver\nOrder Antoni ... Carlos Joe Beam and how about this Jimi Hendrix here's Hendricks is two and a third stone from the sun\n\n\n\n\n\n\n\n\n\n\n\n\n\nBoom\n\n\n[noise]\n\n... ... ... [noise]\n\n\n\nFor tech firm fiber Florida's Ben ... then part of the group there are new faces from the CD straightforward\nJosh Lawrence on trumpet Roxy cause some sex then I'm vibes therapy I feel a lot of piano Peter render base and Denise peroxide drum you're listening to jazz but they won\nAnd Mr Evans\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five FM cage AC a trick Prescott Sally\nNinety point one F. M. K. J. C. P. Prescott Chino valley Ninety point seven F. M. K. J. C. K. Kingman Boulder City Nevada\nAnd translator K. two one seven ... five staff amongst park at Ninety One point three FM support for the Arizona community radio network is provided by\nMartin slimy Christ that God's tape ran in key at twenty six twenty if any design and can you can depend on science where quality cars and trucks really give costs less the terrain shop online at ... dot dot com\nSupport for the Arizona community radio network is provided by uptown United drug\nWhere you'll find friendly knowledgeable pharmacists with more than eight years of combined experience for an important Health News discount coupons key medication information or to refill your mail order prescription log onto uptown United drug dot com Serbian king Lenin golden valley\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five FM cages and drink and you point on that sound cage AZT resident in Ninety point seven is a cage easy K\nCan support for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary and Valentine, Arizona thirty miles east of England or historic route sixty six she over one number two Seventy five rescued exotic animals lions tigers cougars Panthers leopards monkeys in more open every day now divided up Tuesday historic route sixty six [noise]\n\n\nHiring really how\nHow\nDo you like eating out are complicated life she radio so women on Saturdays and Sundays thirty\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis is Richard talks and you're listening to on the current American music with across\nThen share in the ... been in there who\n... they\nCan bring in some way to\nP. E.\nWe\n\nThe\n\nDreamers the well\nBeing well\nSome\n\nThe line\n[noise]\nA new one from the great Richard Thompson that's do all these tears along pie you that's Thirteen rivers two thousand Eighteen release Nico case last Hawaiian of out beyond and bird streets at the top of that sat with betting on this time\nIt seemed to currents I'm ... and if you're just joining us welcome here's Mike Stevens and I'll ... I'll throw stuff with you ain't no good\n\nYou remember\nAnd what are known and unknown in the ...\nWithout being mobbed they're ready to take\nMy daughter you Monday other I'm\nAm and I know\nYou know are there any\nThe\nTheir mom\nDad you got any bad law degree when you said you're\nThe one we're about middle with well you know the more\nWe don't know\nYou know doing all\nAnd the minute he gets ...\nMiles\n[noise]\nDo they want to\nReally loving really my little\nLeave me\nAlone levine\nWe\nWe ...\nMe a lot of money you don't know whether they just didn't know that much [noise] [noise]\n[noise]\n[noise]\nNo but there are some NATO\nAre like I can do about music and bass and a steak and\nWhy in marathon Texas and key P. T. Z. in Port Townsend Washington this is native voice won the Native American radio network\n[noise]\nYou're listening to the Arizona community radio network on eighty nine point five okay Jay Z a drink Ninety point one F. M. K. J. C. P. Prescott a Ninety point ten minutes okay Jay Z cake ...\nKilling plant somebody by looking at them you know\nWere you there are friends that can turn those bums to a rich Greenville simply\nTo be part of the club by email at\nNo more genes don't struggle but most of the new stop killing plant with\n... years known a transition into his poor more diverse energy more complacent with new technologies ... been some snow in much more involved in the Arizona energy ... is a new program to help you be more aware and better informed and making more in the decision with viewpoints from across the\nCountry energy I'm listening\nTo join the ends on energy projects in one PM Saturday and Sunday you're on TALK radio [noise]\nSeven\nIt's an ... year like I said I'm here with us some great music lined up for you we've got darling side coming up Greg last well worry dolls Last Train and more\nLet's start with Boston this lake street dive which plays a really gender bending blend of Neal so and pop rock the singer Rachael Price and drummer Mike ... brief are joined by bases Bridget Kenny and trumpet playing guitarist Mike make duck Olson\nOh\n\n\nI\n[noise]\n[noise]\n[noise]\n[noise] [noise]\nThat's\n\n[noise]\n[noise]\n[noise]\n\n\n\nNo\n\n\n\n\n[noise]\n[noise]\n[noise]\nHey this is only an from Donald side and we expect to be here with us under cars\n\nAround me and I ran long maybe already\nAnd on NATO or\nDelaying remembering that no\nNo no no no no no\nWe're we're a much stronger or na\nNa na\nNa na\nNa na\nNa na na na\nNa na na\nNa na na na\nNa na\n\nNa\nNa na and [laughter] [noise] [laughter]\nAnd why\nThey're going\nIraq and my mom word where oh\nBoy\n\nKnow [laughter]\n[noise]\n\nOur our our ...\n[laughter] and I you know\nAnd if you're\nNow [noise] [noise]\n[noise]\n[laughter]\nKnow they just\nNa na na apple\n[noise]\nAnd\n[noise]\n[noise]\nDish\n\nWith ... ... s a\n\nThe ones that they can find\nLess bar was warmer she Raymond\nHours a\n\nRemain o\n\nA\nA\n\n\nI'm saying [noise]\nYou know\n[noise]\nNo no no\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\nDown there\nYeah\n\n\n\n\nThe\nGrabbing\n\nOn the on\nThe no\nNo\nI mean the the\nAnd you know\n\n\n[noise]\nNa na na na\nNa\nNa na\nNa\nFun [noise]\n\n\n[noise]\n[noise] nah\nNah\nNah nah\n\nNah nah die hard\nEarned\n\n\n[noise]\n[noise]\n[noise]\n[laughter]\nHe\nCreate a\nThey say they're\nNot the country [noise]\nCan look when\nDo in the show\nUnder\n[noise]\n\nThing and I'm\nGreat I think Korea they turn\n\nAnd then they come to\nTo write\n\nTo understand [noise]\n[noise]\nYeah yeah\n\n[noise] yeah yeah\n\nThen when I go\nOver\nSure\n[noise]\n\n\nThat was to hurt with compass Mexican Institute of sound and toys select the name of that song was crazy conscience mighty or take out in front of that with the liberty Last Train gave us radio star and he was worried off with bless your heart\nIt's undercurrents I'm ... and if you're just joining us welcome for him when scientists ... here's Sophie out today Mm\nMoving by anything\nLive in\n\n...", "show_name": "BBC World Service", "year": "2018", "city": "Kingman", "day": "13"}