{"month": "10", "state": "AZ", "station": "KJZK", "content": "Thank you so much questioning fixing the Alexander emphasis jar\nYou or to to K O FAU Warner radio there twenty am and border radio easy dot org beyond the broadcast on the Arizona community radio network at eighty nine point five FM can't daisy a drink Williams Ninety point one of them\nCan you do the ... press get Ninety point seven FM changing the cake king met in Ninety One point\nYou're listening to the Arizona community radio network on eighty nine point five FM K Jay Z a trick Prescott valley Ninety point one at ten K. J. C. P. Prescott Chino valley Ninety point seven FM kj ... Kingman Boulder City Nevada\nAnd translator came to one seven ... Flagstaff month to park at Ninety One point three at\nThe ... Center for the arts is a nonprofit company committed to promoting the ... the group is renovating the bills street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson three eighty five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nGrand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feed them right out of your hand the hundreds of animals up close elk buffalo boroughs camel cool watching Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near William\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n...\n\n\n\n\n\n\nThat's the only changed sex and no I don't know why they call it that they don't sound crazy to me nothing on him just about the music on this recording called don't blink\nTo written by will Campbell the saxophonist in this cooperatively led group something called the swing your and the strength or so when the ban Mike ... burn sealer on trumpet and some other jazz educators from around the country is the second ...\nMade up of teachers here's Horace Silver\n\n\n\n\nWe\n\n\n[noise]\n\nUm\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nUm\n\nDo you mean\n\nMe me me me me\nWell\nGift so\nJustice self\n\nTake a deep breath\nBy the Trump bitter or Davis before that we heard the latest from pianos Danny ... this is also fairly recent from a large ensemble led by John bend or\n[noise]\n\n...\nAnd all\n\nThis is better radio show us they Yuma\nThirteen twenty am and bought a radio waves the daughter or your service of Arizona western college we also broadcast on the hour we're going to community radio network at eighty nine point five Amsterdam Jay Jay Z a drink Williams Ninety One one is Pam kj deep deep ... you're\nListening to the Arizona community radio network on eighty nine point five FM kj Drake Prescott valley Ninety point one at ... feet Prescott Chino valley Ninety point seven to ten K. J. C. K. Kingman Boulder City Nevada and translator K. to one Seventy Pete Flagstaff month to park at Ninety One point three FM\nThe king the center for the arts is a nonprofit company committed to promoting the arts in king the group is renovating the Beale Street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com more call Christina Mickelson three eight five three one nine five to three eight\nSupport for the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary and Valentine, Arizona thirty miles east of ... historic roof sixty six she over one ever jeopardy by rescued exotic animals lions tigers cougars dancers leopards monkeys in more open every day no divide except you de ... historic route sixty six\n[noise]\n\nAnd she\nThinks she's\n\nTwo years old\n\n\nKnow I think\n[noise]\n\n[noise]\n[laughter]\n\n\n\n\n\n[noise]\n[laughter]\n[noise] [laughter]\n\nYeah [laughter]\n\n[noise] [laughter]\n\n\n\n\n\nI don't see how that works\n...\nThe thing is there's no\n\nAnd\nI\nSpinning straw\nAgain\n...\nThere and I'm looking up\nIn in the ad in\nAnd he\nLaughed and\nI'm locked\nWrite in which\n... ... ... ... well\n\nAnswer to\nDa\nDa da\nDa da\n\n\nDa de\n\nDa de ... keep your luggage\nAnd they need to do after ... ...\nYeah oh yeah [noise]\nMy family\nAre not coming down [noise] should\nThey\nShould have done nine there should be a\nOh\n\nMy God\nWhoa\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nHow are you sure you're aware of what we used to come over the long haul changing your\nInstead we breathe\n\nWatch what you want to be turning in every\nYear Neal industry insurance that you\nCan you can be can be done on\nCan in\nI got to change for\n\nThe drive to drink in the basement tree you don't want to bring out the\n\n\n\n\n[laughter]\n\nJust cuts off just like that [noise] Santana to chew from Santana for spirit nation with children and our secret\nYou know think about that when you read the headlines and which are Thompson do all these tears belong to you from his new what Thirteen reverse\nGive me some energy if you're traveling with keeping your weight but don't be afraid to stop and stretch you walk around and get the blood flowing change drivers 'cause I don't know I just got off a long road trip\nIt's amazing how tired you can get without realizing it fresh out get out there stretch yeah to undercurrents and a mark buffet has ... we'll get to that in just a minute\nVicious Thirteen twenty am foreigner radio can you away and border radio a C. dot org a service of Arizona western college for more than forty five years\nLonely ...\nI Know I Know I Know\nWay to run out of hand and da da da da da da da da\nDa da da da\nDa da da da da\nNa na na ... yeah\nYeah I saw\n...\nMan I Know yeah\nNa na na na na na\nCamera na na na\n\nHey this is ... and you're listening ...\nYou know\nNa\nNa na\nNa\nGoing to change your\nNa\nNa\nNa na\nNa na\nNa\nNa\n\nCourage rose over the ... from bill Leo ... bones Tara Boston, Texas ... four hundred unit Cumberland Gap and testing agreed okay this is the deaf where\nWe were more than I think we did yeah we're smart enough good news from this new went down the road wherever\nShe just joined just walk in the CIA undercurrents Greg ... here and ... they're all different kinds of places who thing about radio is it brings together at the same time\nSo the Quakers suburban soccer mom all the cousins on the rez everybody listening together and enjoy music so we are one big country after all and it's our subpoena this last year from Jeff Shaw from you know how it works on this is my own on the underground\n[noise]\n\n\n\nIt\nCan be no\n\n\n[noise] [noise]\n\n\n[laughter] [noise]\n\nLa\nLa la\n\n[laughter] oh\n[laughter]\n[noise]\n...\nThe lead the\n\n... ...", "show_name": "BBC World Service", "year": "2018", "city": "Kingman", "day": "19"}