{"month": "10", "state": "AZ", "station": "KJZK", "content": "You're listening to the Arizona community radio network an eighty nine point five K. Jay Z a trick Ninety point one of the cage ACP rescue and Ninety point seven F. M. K. J. C. K. can\nSupport for the Arizona community radio network is provided by\nArizona the drawing through wildlife adventure park in Williams, Arizona you buy a boat and go big orange she'd been black bear for listing the uncovered of your private vehicle or troubled go watch political Barrett cubs up good William ... gum [noise]\nOn she's on that we're talking to\nA boarding brush creed studio located behind with your own Prescott it's a place for winning can get together with\nAnd the compromise with science will talk to her said that ... was great community and helps even though we talked to suck among us get crappy joined us for she know that radio for women on Saturdays and Sundays at twelve thirty rate ... public radio [noise]\nThat's good mostly sunny a high and you're Seventy breezy in the evening about twenty miles per hour wind gusts with mostly cloudy skies and a low around forty six\nIn Flagstaff a slight chance of showers partly sunny a high and you're sixty mostly cloudy with low around thirty nine in the evening and you would see sunny skies a high and you're Ninety degrees partly cloudy in the evening alone around sixty seven\n\nIs ... like I said I'm here with you with some great teams lined up for this next hour including ones by Judy Collins marrying the cast one Richard Thompson and the McCrary sisters first stop here's one from hand\nIt was written by Elvis Costello here's the angels won of where my red shoes [noise]\nSince ... well\n\n\n\n\n[noise]\n\n\nAbout\n\nNow\n\nHi this is arrogant start and you're listening to under current sometimes are Native American music on here to a [laughter]\nWe just next film in there\n\n\nSee me holding\nMe and I'm only\n...\nBe the flu when\nHe\nBurned by the uh\n\nComes a day or\nLabor ... yang\nIn and do you know we're\nDon't like\n\n[noise] na\nYou know being warm um\nMe ...\n\nAm\n[laughter]\nAnd\n... ...\n...\nMe to be used in the clouds\nA ... a ...\nAnd just like that who was you know\n...\n... because the main road through the woods in\n... son\nBy ... and ...\nAnd then you'd be right about now\nIn the toilet and I both on the new ... the ...\nBoard your curriculum posted some in the dirt in the in the midst of state and\n... ...\nDiameter studded no more than\nA hundred billion towards the light at\nJane Lynch does risk the\nThe ... steps to leave\nTo show you know\nBrand civil war there's\nAnd this\nTime so it's we you and your lab\nThey may have\nPaid for a\nYou're saying you away you\n\nThat he may have\nNa and\n\nTry and\nBy the way he could do\nTo the age of\n\n\n\n\n\n... ... I\nLove that new Richard town to Nelson Thirteen reverse that was the storm won't come from that album which was I Know immortal orcas jar with honeybee and finding that\nAnd Mary and the counseling with things we said today it's undercurrents I'm ... and if you're just joining us welcome to the short one from the great gospel group the McCrary sisters on a ... oh\nGentleman\nWho\nYo\n\nDa da da da da\nDa da da da da da da da\nDa da\n\nDa na\nNa na na na na na na na na na\nNa na na na [laughter] so\nThank both you know they don't know who\nYou're with a lot in the ... the child that she didn't know who do\nYou read any do you then the\nNext pope na\nNa na na na na na\nNa na na na na na\nNa na\n\nNa\n[noise]\n\n[noise]", "show_name": "On the Media", "year": "2018", "city": "Kingman", "day": "20"}