{"month": "10", "state": "RI", "station": "WEAN", "content": "Care and keep our highways say um\nHigh end in Compton for over Thirty years you know the records America's most red trucking business [noise]\nNow every week who watch me and my co host Jessica Rose as we bring you the only weekly news show creative just ... joined us for all the breaking news affecting the trucking industry along with are awesome rid of the week both on the record dot com is the one from not you're not going to want to have\nThem be he traveled down the highway so tune in every week and watch the news channel by going to the record dot com [noise]\nAnd we should be from the New England truck solutions to the news I mean I Am six thirty WPRI Conan accumulate almost\nCeased cave lawn care whether senator here's your exclusive accuweather forecast\nClear to partly cloudy skies and I've done a fifty seven partly sunny and warm or for tomorrow afternoon shower I Seventy seven and damp cooler Monday mostly clouded by just sixty four with the BP heroes exclusive accuweather on meteorologist John fear [noise]\nAccuweather on the voice of southern New England news telling six thirty seven F. L. W. B. R. O.\nSouthern New England weekends on news talk six thirty seven have doubled you pay our oh\nThese twisted these warped he's unelectable and he's on the radio Saturday mornings at eleven AM he's John Laughlin the former congressional candidate retired army helicopter pilot here to take a look at politics pop culture that\nTwenty first century life John Laughlin every Saturday from Lebanon am till two pm on the voices southern New England news talk six thirty seven have him W. P. R. O. the\nFollowing paid program is sponsored by two lights media it's for basic entertainment and informational purposes only and is solely responsible for its content it does not necessarily reflect the views of cumulus media it's management or staff\nThe following of hate advertisement by purity products these statements have not been evaluated by the FDA this product is not intended to diagnose and treat your will prevent any disease [noise]\nHi there and welcome to health line I'm your host pat Campbell and we are sponsored by the find folks who'd surety products\nOne of my favorite gas is on the line we got Chris kill him also noticed the medicine hunter Sandy by now CNN polls Chris the Indiana Jones natural medicine because he's constantly scouring the globe searching for natural remedies\nYou may have seen criticizing the doctor on a show or maybe on PBS or CBS and also on Fox News where he does a health segment he's been featured in New York Times and\nAlso on ABC's twenty twenty anti Christ is joining us today to discuss not one but three of the hottest nutritional ingredients out there on the market today even better he's teamed up with purity today to give away a complementary bottle to everyone out there in the listening audience so do not I repeat do not changed that dial\nFirst a quick introduction curriculum is an author and an educator he's written fourteen books he's conducted research over thirty countries again he's been on with Oprah and friends and Dr oz Chris welcome back to the show\nThank you so much pat it's always a pleasure to have a great conversation with you\nNow most of us are super busy these days we want to stay healthy but quite frankly it can be daunting\nYou know with all the different supplements out there not Chris you've traveled all over the world learning about different natural remedies so you really know which ingredients to look for so tell me this besides a good multi vitamin it's official maybe a few other things go into the three super high nutrients you've been so jazzed about lately\nWell I'm happy to do that pat the three super nutrients as we like to say are a group the extract a tumor Rick extract called Kirk human\nAnd an extract from red wine called ... there trawling apropos of what you said about my traveling around the world I've extensively\nInvestigated the isn't their host countries so I've been in the green tea plantations of China and India and worked with top researchers of this ingredient in those countries with\nTwo ... I've been deeply involved with to emerge researchers in India and seeing all of that and with red beret trial I've worked with scientists in Europe\nAnd also in California and she lay on South Africa all of which are major red wine producing areas so I've had the opportunity to investigate these things in the field and meet with the top scientist than my conclusion is that\nGreen tea Kirk human from to recruit and ... from red wine are remarkable health financing agents that\nHow would you like motor joins twenty Eighteen trucks with the here for only one Ninety nine drawn will say hello to forge twenty eight gene Ford F. one fifty best run for the best price anywhere just one hundred and Ninety nine dollars for only a blood forward and he joined Narragansett\nDo your your madness if I can see it that way because you combine these things together because they have a synergistic effect they make each other worst when you go in a real game changer\nWell you know when I look at the is there actually isn't a reason path to\nPut them all in separate product they do go very well together as you said they're all food\nDerived so it's kind of like you can make a salad if you choose out of many vegetables you don't just have to have a bowl of lettuce or a bowl of cucumbers and well that's a little bit simplistic the fact is that all of these are very very rich in\nGroups of protective compounds that are both\nAntioxidant so they actually retired the aging process of the cells in our bodies\nAnd protect our organ systems till they maintain a healthy inflammatory status in the body and this is really a big breakthrough I also like the idea that people can get a concentrated supplement of green tea extract curriculum and extracting resume or a trial\nIn one product with truly meaningful amounts of each one and not have to go out and basically by a shopping cart full of stuff\nNow let's dive into the headlines and the research especially on the green tea because it's absolutely amazing\nI Know when he shouldn't have been using it for thousands of years for healthy aging but what you've seen recently in the press you know you told me the nutrition research journal and it's July twenty twelve issue revealed the green tea significantly increased\nPlasma anti oxygen activity in whole blood get assigned to recap\nSome of these headlines of chill me while you're such a green tea advocates\nOkay what you just said about increasing plasma antioxidant activity is really critical there are many antioxidants that people consume\nThat don't actually wind up in the body or they don't wind up in the body in any significant amount the green tea antioxidants which we know are among the most highly beneficial antioxidants in the entire world are very well absorbed they improve\nPlasma antioxidant activity that is the blood concentration of antioxidants so what happens is you get this great concentration\nOf antioxidants substances which a protective compounds floating around in the body and protecting the cells of your body your organs\nEvery part of your body from premature destruction due to exposure to environmental pollutants and things in the diet with regard to the whole blood glue to fire on when we take in\nThe right antioxidants and not all antioxidant compounds are the right antioxidants our bodies produce more of its own super protective compound called glue the thigh on\nSo you've taken the green tea extract\nYou build the antioxidant activity in your blood and you also cause your body to produce this enormously beneficial very well studied very powerful protective substance called glue to fire on so\nIt is remarkable this isn't something that most high antioxidant foods or supplementing gradients do but it does happen with a concentrated properly made green tea extract\nRight let's switch gears and talk about this human which is number two on Ulysses by the way these three ingredients are all found in the new green tea combo formula would be offering free bought on a few minutes we'll talk to me about the human would you smelled C. U. R. G. U. M. I. N. now most people haven't heard of it\nBut scientists and researchers know which one of the most powerful supersedes on the planet you can positively influence our D. N. A. maintain joint comfort healthy inflammation in more can you share some of the incredible headlines on human and tell us why you use this we talked about this off year a few minutes ago just patented\nB. C. M. Ninety five formula of\nKirk human which seven times greater insurance\nOkay well first of all I think well people might not know the term ... Kim and they may well no ... which is a yellow spice and it shows up in curies and\nIt's part of the five thousand year old in the ... system of medicine I've been studying ... and that's derivative ... since the Nineteen seventies\nAnd I'll say this right off the bat that they are almost no plant materials in the world as extensively studied is this a couple of thousand studies can be found in the scientific and medical literature\nHow would you like motor joins twenty eight gene trucks with the here for only one Ninety nine drawn will say hello to forge twenty eight gene Ford F. one fifty best Russell the best friends anywhere just one hundred and Ninety nine dollars for only a blood forward and he went into a newer handling\nShort ... explains some of the top benefits as well\nWell I mean you could for example drink three cups of good concentrated green tea each day\nEat at least one really rich curry made with a lot of tumor accrued and drink a couple of glasses or red wine you could do that every day most people will not do that every day but they still might want the benefits of\nThree of the biggest superstar protective health and Hansing nutrients on the entire planet\nSo when I call this a daily short cut I'm simply saying that\nYou can get in a capsule and a good liquid soft gelatin capsule what your other wise half to get by drinking a few cups of tea eating at least one large you know tumor Laden curry every day and drinking a couple of glasses of concentrated red wine\nAgain we're talking with Chris killing the medicine hundred now in this new green T. C. R. formula purity it's really about the research share it with some of your favorite studies in the headlines on the ... that we didn't get to yeah I Know this is one of your favorite ingredients for joint comfort and even for brand new\nWell I especially like\nThe liver protective heart protective and joint modifying properties of this stuff the liver is our greatest detoxify Oregon and we know that we're constantly bombarded by toxins in the environment in fact\nBlood studies show the newborn babies contain two hundred and ... pollutants in their blood at the time of birth so we need a functioning super healthy very strong liver\nWe might not think about our livers that much but we need that and we know that Kirk human protects the liver at detoxify deliver it keeps it strong from a cardiac standpoint it's highly beneficial for the heart\nIt's very good for maintaining healthy cholesterol and healthy platelet levels\nAnd from a joint standpoint we have in numerous ... studies showing overall improvement in joined health and relief and stable inflammatory activity better joint mobility as a result of taking Kirk him and\nI like the brain protective studies as well you know I think everybody wants a sharper clearer mind and Kirk human delivers solve this so\nI regard it as one of the single most important things that you can put in your body and I'm very well aware pat but most people are not going to eat enough rock tumor Rick route to get the benefits that they should and that they can get from a concentrated ...\nI don't want to remind people to call now to get started with the free bottle green tea she are dirty products this is their unique green tea formula would see Kirk human and the ... spiritual you ... today just before Ninety five for shipping coal now our freedoms are standing by one eight hundred\nFor nine nine seven five zero five again one eight hundred\nFor nine nine seven five unify right back to the show 'cause I don't want to get to technical here but these ... oxygen green tea or classified as wholly females and there really aren't super powerful and well respected by scientists\nBut in his green T. C. R. formula there's more it's got the green tea ... human the risk variants needs to be talked about\nFlash grape seed extract behind bars bio lab annoyed vitamin C. you talk to me about this is ray of really super anti auctions in ...\nWell yeah I won't say that we kind of went over killed but I Will say that we really really developed in the fish and comprehensive program here\nGrape seed extract and pine bark extract both contain a group of highly specialized antioxidant compounds that not only do much of what I've already described but also enhance the physical integrity of tissue in the blood vessels and the skin\nSo we put those in there for\nExtra boost in antioxidant activity but also for a specific type of activity that isn't as much addressed by the green tea the curriculum and then there was there a troll the bio flab annoyed and\nHence the overall activity of vitamin C. and vitamin C itself is one of the most important nutrients that we can possibly take in so I Would say that we were very very thorough you know when we went through what could be in this product we said you know what would happen\nIf we put in grape seed extract pine bark extract ... noise and vitamin C. we realized that we would have an utterly superior form\n... group wants your car any make any model blood pays more than anything around because we're a certified buying center had will buy yours even if you don't buy hours logged onto our car buyers are tough\nI Love this green T. C. R. combination formula and remembered the CPR stands for Kirk human inner spiritual loved that was his complimentary bottled today our listeners you get started for free that's great value what what people expect to pay if they bought all of these separately in the store\nWell I think if they bought high quality products that contain the thin greedy and they'd be into it for about Seventy five bucks or so possibly even eighty yeah so they wind up spending\nAppreciably more than they're going to spend on the green tea see our formula and they still wouldn't get the grape seed extract they still wouldn't get the pine bark extract the ... the vitamin C.\nAnd Chris what kind of results can people expect to see what can they expect to see a once they start taking just wanted to\nI think that people will feel greater joint mobility and comfort\nI think they'll feel more energy\nBecause these ingredients also help to stabilize and maintain natural healthy blood sugar control I think they'll have more sustained energy throughout the day and I would just suspect that people will have an experience of greater vitality when you detoxify the body\nWhen you have a more highly functional immune system you just feel more energy and better overall it's kind of you know like those days when you get up and go wow I feel great this is a while I feel great formula\nNow Chris the green tea see are limited history to provide you bought three cups worth of green tea and each to cancel serving plus you get the anti accident with one of several servings of fruits and vegetables plus\nYou get the ... of several servings of red wine and the joint comfort in brain function benefits the Kirk human I mean why are all in one formula in the last two minutes talks to me about this short cut to better health and why you want everyone listening to this program to home now so that complimentary bottle green tea see are\nOkay fortunately\nThere's and the man's body of science that has been growing steadily for the past Twenty years and it's really rich science now we know that of the various plant derived substances that exist green tea extract Kirk human extract and resveratrol extract or at the\nAbsolute top of the list of protective vitality and and seeing overall health promoting compounds there just isn't anything like these there in the green tea CRC our standing for Kirk human interest fair trial product in meaningful amounts people will take this product it will be\nRapidly broken down in the system very well absorbed they're going to feel the difference you're going to feel energy you're going to feel more vitality or just plain going to feel better kind of more fluid and in that flow of good health so I Want people to experience that and\nGiven that they can get a free bottle I'm also not saying that put yourself at great risk and spend a lot of money I said no try it free let the product speak for itself\nChristian was always fascinating information we appreciate your insight thanks so much\nThank you pat it's always a pleasure to speak with you\nThere is an incredible free bottle offered today on charities amazing new green tea CPR super formula here city hall purity products right now one of the first thousand polish today just the four Ninety five for shipping\nWhich is one hundred percent refundable if you're going to rush you any complimentary bottle of green T. C. R. formula for you to put to the test you try you be the judge it's that simple Gertie knows that once you experienced the benefits ... you're not gonna want to miss a day of taking it that's why they're willing to send you a free bottle today so call right now operators are standing\nBy dial one eight hundred for nine nine seven five zero five that's one eight hundred for nine nine\nSeven five zero five degree in D.C are delivers a combination of green tea\nPlus ... bc um Ninety five Kirk human and ... in one easy to take liquid soft you do it for your energy level you're focused mental clarity your cardiovascular health to support healthy dieting immune defense joint comfort in so\nMuch more to claim your complimentary bottle Paul now one eight hundred for nine nine seven five zero five\nWhen little catch this re bottle offer is not available in stores and you won't find it online either only through purity products by calling this number today limited one free bottle per household please call now one eight hundred\nFor nine nine seven five zero five one last time for those running down slowly here we go one\nEight hundred for nine nine seven five zero five\nWhat's your Chevy GMC Honda daycare Toyota and super all have in common they're all in for Steve for your own condition at what point and he's written a generic Kansas I tried over two hundred free on cars all make all models and incredible prices are going to flood auto John job now\nHow have you bring about the situation\nI Know that Christian Science can enable all of us to know and feel God's healing love and present thinking of the children we hear about in the news I often ... and large understanding of home\nWho are true parent is which I have learned to be our father mother God\nI learned a good lesson about this many years ago when I was teaching a group of second graders this class had thirty four students to students who lived with both of their parents\nOne lived with her mom was a single parent the remaining thirty one were led by their parents to live with someone in the neighborhood who was unrelated to them\nSometimes there'd be four or five unrelated children living with a neighbor and sometimes as many as twelve children\nThe parents would come once or twice a year to visit these children these parents were migrant workers who've traveled up and down the east coast from Virginia to Texas they picked whatever was in seizing cotton pizzas strawberries et cetera\nAnd this situation was so sad to me that each day on my forty minute drive home after school I found myself in tears I couldn't imagine being separated from parents are being herded like cattle\nSeemed to me that they were abandoned each day regardless of my tears I Would turn to the Christian Science pastor which consists of two books the Bible and science and help with key to the scriptures by Mary Baker eddy I went to the books for comfort\nI knew from genesis one in the Bible that God made man in his image and lightness and John one tells us that God is spirit some man is spiritual not material\nAs the image and likeness of God man could never lack of father mother his love\nOr a home\nI research the word family father or mother sons and daughters and I knew that God's was everyone's father mother but the thought of being left with a stranger was overwhelming as I researched and came to the Bible verse\nSaid at the solitary and families I also reminded myself of Mary Baker eddy words\nGod as a father and our mother her minister and the great position he has man's only real relative in heaven on earth\nI realized that these children had never been abandoned by God his love was constantly with them caring for them the children who live together even though they weren't related or especially caring for each other this hostile as proof of God's care\nAnd then one day I overheard some of the children who live together talking with each other about the special than or they had had the evening before\nNeighbor caring for them had cooked their favorite meal\nThe words God says the solitary and family that's from Saddam sixty eight first six came to thought\nI realize that these children had not been abandoned God had directed their parents to choose someone who would give them the proper care\nAnd then I realized they had shelter clothing food and most important proof of God's tender love and care well needless to say I should know more tears I just rejoice than hearing from them about things those caring for them did for them\nWell gee what a great insight into really who are two parents you know kids from your own life where you felt like oh\nWell yes I have in my own experience when I felt I had nobody that could help me and I had no place to live in that situation was such that I had to move out of one place and was to move into another\nBut my son's hadn't come through in the place I was going to would not accept me so I had all my stuff loaded on a truck the movies that he put it in storage but I didn't know where I was going to go and I was sitting literally on the floor in an empty house train about parenting and about God being the father and mother\nWhat came to me was a quote\nIn the first church of Christ scientist and missile any Mary Baker eddy says if we say that the sun stands for God than all his race collectively stand for Christ and\nEach separate race from men and women it occurred to me when I was thinking about that that God was the father and we were his\nWhat we can in southern Rhode Island's Vermeer luxury do learn your dream Lincoln's which was one of the Lincoln Lincoln him do we do and I'm only twenty leading members would have never given bone marrow Marjorie [laughter]\nAnd I told her you know I didn't really know because they didn't know if they'd hold the place of what she said oh I Know somebody and she wrote\nOn addressing the name and a phone number on a piece of paper and she said give me a minute I'll run home and call them\nThen you can call which I did do\nAnd she had a garage apartment I Lived there for almost a year she was helpful to me and I was helpful to her it was another sense of family of being parent it by God being guided this new home and another time my daughter after her sophomore year in college and went with two of her roommate\nTo visit a third roommate\nIn Bermuda and their her family owned a hotel there so they ACT UP and went off the ... when they got there\nThey found out that their friend and her family had gone on vacation so they couldn't stay at the family's hotel but they put their money together and they they went on the other side of the island and they rented a room\nWell they got up the next morning and they went to the beach and when I came back they found a room had been ransacked the all their money had been stolen they don't have any money\nThey hadn't eaten that day and my daughter called me in tears because they didn't have any place to move to they didn't have a place to go then I have any money to go with\nThey couldn't even change their plane tickets because it took money to rebuild your flight\nSo I told her that she needed to turn to what she had learned in the Christian Science Sunday school and that we would pray about it and what came to me was that I realized that God was her parents that he sheltered and provided for her every name she was his image in line that\nI realized that the er and false responsibility on my part we're trying to be in charge so I Would have to say no to both I told her to find a quiet place to prey so she went to the beach she said she was sitting there she was bad on her tears when a man came up to her and ask her why she was crying\nAnd she told him what had happened and he said is\nThat all he owned a five star hotel on another part of the beach and he said for she and her friends to get their thanks to come and he would give them a room there which did and they stayed there for the rest of the week and he never would accept any pay and he also invited them to come to dinner that evening\nSo they had food and then the next day one of the room mates receive the money which was enough money for them to have food for the rest of the time but it was such prove to me that God never stopped caring for all of his children\nGod is a caretaker and that means that we're not just only cared for but we always have home that parenting and Homer simultaneous in\nThe Bible Paul says in him we live and moving have are being that's an act and to me that's the definition of family and home and that's true for all mankind\nWow Well Jane thank you so much for being with us today and sharing your incite\nThank you read it so much for the opportunity\nI've been speaking with Jane Nixon\n... in Georgia [noise]\nAnd with me now to continue our discussion about being parents to by God is Christian Science practitioner ... Agnew thanks for joining us today Kirsten oh I Am so grateful to be here with you\nWell I Know you had an experience that really talked to a lot about who the real parent is can you take us back to the beginning and tell us what happened\nI certainly can I've been a single mom for the whole time raising my son and my son because\nI was the only breadwinner was a latch key kid\nThen his senior year in high school I lost the place where I was teaching\nI also lost the place where we're living and had to move a town away so I can continue teaching and learning in income\nSo we talk together all the possibility of him being able to stay with one of his friends and parents who he was very close to an because he was a senior in high school and had been there for his high school years\nI wanted to be sure that he could continue there with his friends and graduate there\nHowever that was the beginning of our separation and the strange men that would last Twenty years so during\nThat there should be junior CSI hotdogs and I've been in for Steve free old tradition of what religion are against this sense right over two hundred real for our own role models out in front of me verses do for a job now\nEt cetera into cancer screening and prevention technologies cervical cancer is caught ... er H. P. V. that it can be prevented with HP need vaccines have tests and H. P. D. test\nEarly diagnosis leads to expand it treatment options and higher survival rate speak with your doctor or nurse about how you can best protect yourself\nTo learn more about talents eliminate cervical cancer campaign pleased that the women in ... dot org that women in ... dot org [noise]\nFrom the New England trucks solutions to the news I mean I Am six thirty WPRI station [noise]\nKavanaugh in Haiti quake I'm Christopher cruise red capital is now the one hundred fourteenth justice of the U.S Supreme Court as he took the oath of office last night protesters chanted outside the court building\nTrickle down there the hangar or need right now there are\nHundreds of protesters walked out there pushing hard or responded\nMiguel mark as a magnitude five point nine earthquake has shaken northwestern Haiti damaging homes at church and at least one hospital there are injuries and damage and local media reporter at least ten people have been killed\nThe Washington Post is reporting that turkey believes a prominent Saudi Arabian journalist who is also a columnist for the newspaper was killed at their study consulate in Istanbul the poster boards the Turkish officials are saying that uh Fifteen member team came from Saudi Arabia and that it was a pre planned murder\nWere already a quarter of the way through the NFL season correspondent Joel Ramsey has the schedule for week five\nThere was a big match up in Kansas City between the\nFord oh jeez and three and one jaguars to other three are going to beat him since the bangles and dolphins well through struggling franchises we're losing records hook up in Pittsburgh with us from falcons later today there's a rematch of last year's NFC championship game between the Vikings and eagles in\nPhilly and the undefeated rail travel to Seattle defeats the Seahawks tonight if Dallas and Houston tomorrow Drew Brees goes for the most passing yards of all time when the Redskins and saved we're Monday Night football I'm Joel Ramsey\nBosnians are voting in a general election today that could be won by a pro Russian nationalist experts say if that happens it will strengthen the country's ethnic divisions which cost a brutal war a quarter century ago\nI'm Christopher cruise\nI'm Nick ... a select quote agent with the true story that could save you hundreds of dollars a year a woman named Linda just called her husband re has a three hundred thousand dollar group life insurance policy but it's changing jobs and can't take it with him\nWell I stopped the many highly rated term life insurance companies we represent like credential and mutual grandma and found re who was forty one and takes medication to control his cholesterol a ten year five hundred thousand dollar policy for under twenty seven dollars a month\nThat's almost twice the coverage for less than half of what he had paid if select quota hasn't shop for your life insurance you're probably paying too much for your free quote recall\nEight hundred to Ninety two eighty eight thirty three that eight hundred to nine to eighty eight thirty three and eight hundred to Ninety two eighty eight thirty three or go to select quote ... since Nineteen fifty eight we shot and you say\nGet full details on the ... moved on how much commercials are depending on your health issue in the family is going to be up on all state\nBrett Kavanaugh begins hearing cases on the bench for the U.S Supreme Court on Monday\nThe opener for this term is an age discrimination case Mount Lemmon fire district versus Quito and evolves to Arizona firefighters who claim they were discriminated against because of their age the second case the court planes to hear Monday is why or how their company versus U.S Fish and Wildlife Service or what most called the frog case only\nAbout one hundred of the ... go for frog live near a pond and Mississippi the government wants to try and save the species by returning to their native breeding grounds but the whole building giant owns the land as part of its temper writes DJ ... Washington\nYesterday President Trump told reporters on air force one that he is a hundred percent sure that the woman accusing Brett Kavanaugh of sexually assaulting her when they were in high school named the wrong person\nTrump said one of the reasons he chose Kavanaugh is quote because there's nobody with a squeaky clean past like him drop also said he believes a speech he made in which he mocked the accuser\nLooking for work our credit not very well isn't it taught you find out what ... what were the generic as that of the best financed reader reader will prices in cars with zero percent if your for somebody to much you can be driving all the boards also models interest free fall on the job\nFor plus years experience acute care certification indeed have a huge pool of amazing candidates and screen or tools that help you find\nYour most qualified applicants and then the Irish shortlist of unicorns see we're more than three million companies road was using the higher post your job and do dot com slash higher indeed the world's number one job site source comes for two of his\nAttention all authors Beijing is looking for authors have you read the book and want to get it published fish publishing world you know your book into bookstores and Brazil online at Amazon apple I do in other outlets they handle all aspects of the publishing process for you\nBringing ... publicity copyright and editing go eat under advisor or one thirty six eighty nine now for your free author service you get that seat hunger advisor or one thirty six eighty nine for your free author certainly should get again eight hundred bonds or one thirty six eighty nine or ...\nOr ... with a true story that could save you hundreds of dollars a year a woman named Linda just called her husband re has a three hundred thousand dollar group life insurance policy but\nIt's changing jobs and can't take it with him while I was shocked the many highly rated term life insurance companies we represent what credential mutual Omaha and found re who was forty one and takes medication to control as cholesterol a tenure five hundred thousand dollar policy for under twenty seven dollars a month\nThat's almost twice the coverage for less than half of what he had paid to select quote hasn't shot for your life insurance you're probably paying too much for your free quote call\nAte hungry tonight to eighty eight thirty three ... eight hundred to Ninety two eighty eight thirty three eight hundred to Ninety two eighty eight thirty three or go to so called dark um since Nineteen sir we shop you\nGet full details on your emotions what we'll do complex commercials where you're coming out to shrink the rubble hosted [noise]\nGood morning I'm Deborah Perry CEO of YWCA Rhode Island and the guest host for Deborah zero my guess is Lucy real the director of prevention and communications for the Rhode Island coalition against domestic violence she has been in the movement to end domestic violence for\nMore than Fifteen Years and currently oversees the coalition's public awareness effort\nManagers grant and provides training and technical assistance today we're going to talk about the coalitions do public awareness campaign for domestic violence awareness month and a state wide survey they conducted to learn more about community attitude towards domestic violence thanks Lucy for joining me\nGood morning thank you so much for having me I'm really excited to be here this morning\nSo what compelled the Rhode Island coalition against domestic violence to conduct this survey so our\nCoalition has historically invested in being strategic about its communications where it gets a core part of what we do in order to educate the public on the dynamics of domestic violence\nBut also just shift community attitudes that um put barriers to folks that are experiencing violence on some victim blaming attitudes and so for us\nWe thought it was really important as a communications team two years ago we made the decision to invest in working with a consultant called M. A. M. A. I. consulting and um\n[noise] part with them to get a better sense of what to violent just currently no\nUm as a result of all of the education that we've been doing and our strategic communications where have we made a dent what do people know about this issue um and so we decided to partner with them to put this survey together and I'm really excited about what ...\nWhat we've been able to learn can you tell us a little bit about how the survey was conducted and how did you determine who should be surveyed sure so\nWe really um were intentional\nAbout wanting to reach Rhode islanders that not only that were connected with the coalition but beyond that right so we didn't want to just reach our supporters and our allies but we really wanted to reach all segments of Rhode Island\nUm and so what we did was we are put out an online survey we took out ads in the newspaper\nI'm offering incentives for Amazon gift cards um once I'm a month\nTo get people excited amend motivated to participate in the survey when we\nA we had about ... we wouldn't noticing a pattern that we were reaching\nI'm mostly women mostly white women um and mostly I'm well educated women it um and so we decided that we were going to take a second approach to not just the online survey but then also um we did some uh interest\nWhat does your every junior ... Toyota and so we're all having all they're all in for Steve free old tradition of any religion or whatever that's right or to offer free over our role models incredible versus although I Do for a job at all\nWhat for six months ago when they\nWelcome back to amazing woman I'm Deborah Perry sitting in for Deborah zero my guess is Lucy Rios the director of prevention and communications for the Rhode Island coalition against domestic violence she currently oversees the coalition's public awareness effort managers grant and provides technical\nTraining and assistant\nSo we've been talking about your new public awareness campaign which is based on the recommendations from the survey how would this campaign implement these recommendations\n[noise] um well we are really excited to launch this year's campaign um again like I said that survey uh gave us a clear direction about the six areas that we could work on and we decided as a coalition that\nUm and with our member agencies a that was the changing people's um knowledge about what constitutes abuse with the area that we wanted to focus for the next few years and so we took we partnered with um the ignorance which is an advertising agency in\nThe state of Rhode Island and we shared with them um some of the things that some of the findings have been sharing with all of you where folks um the community doesn't really understand you know that telling a partner what to do all the time or pressuring a partner\nTo stop doing certain activities are hobbies are things that they like or isolating them from from their family and friends that that is a form of abuse those are really red flags they are\nAnd so what we want it to do is create a campaign that did exactly that that made it so that if folks were uh people in the community where over sharing something that it would make them pause and stop and think that maybe there's something more going on here\nAnd so we decided with\nThe campaign on we were going to come up with a a several different a tagline to have the community think about it I hear that all the time 'cause there's some could something more be happening here sure sure\nAnd so one of the um campaign tagline that we're going to be using that you'll be seeing across the state will is um\nAre you now and the subjects in that hitting meaning so really focusing on hitting meetings um so you'll also see a shadow on that says well I control where you go so even though\nThe burden is saying where are you now are really what they meet what they mean is I get to control where you're going I deserve to know where you are at all times and if I don't there's a problem I can really visualize that that's that's a great message\nYeah so we're really excited to um get feedback from the community about that and hopefully it will resonate um\nWith with the ...\nCan you described some wore red flags I Know you were talking about it a little bit but something people should really pay attention to if they're not currently doing so and how you're campaigns going to further that message sure I'm\nSo ... some of the things again that should be red flags for folks is just a partner that totally demanding to know\nWhere someone is all the time or controlling who they talk to or where they go someone a partner who's constantly putting someone down I'm calling them names\nUh you you can jokes at their expense um and just saying oh I was just kidding or oh I didn't really mean it but but the hitting again focusing on the campaign message around abuses and always that obvious um that some times simple statement has a ... meeting we know when sometimes folks say\nI was just joking they really mean I meant to hurt you oh I see that to control you\nUm and so those are some uh some additional warning signs of out again put there'll be more happening in this relationship\nAnd then the next step being what can I Do about it\nRight and what what can you do about it to help someone that you see in a situation like this yeah\nSo if someone if you suspect that someone is being abused um whereas experiencing violence in their relationship one of the most important things to do is expressing concern directly to that person and let them know look I'm not trying to\nBe in your business I'm I'm concerned because I Love you and hear the things that I'm noticing that make me\nFeel concerned about you I'm not just saying you are abusive relationship but just expressing like here's what I'm noticing I'm noticing that\nLooking for work are critical outbreak will isn't a ... for for the new religion or whatever that are best for prices and cars with zero percent or if your for somebody to much you can ... also models interest free for all just dropped all\nThe ... when the person is ready to be able to access to services that they need or just to even get more information about is this really happening to me is this what's going on\nIt sounds like a effective way to reach people listening responding I'm stating your observations and then being there for them\nYeah and expressing concern I think is just such an important piece because so many times um we ... you may notice something I'm In for ... for lots of reasons or we might feel like I should just not getting involved or it's I don't want to offend my friends or it's really not my business\nUm and so what we're trying to do is change some of that we want people to like\nFollow their intuition and say okay something doesn't feel right about this let me do let me take an action and that can mean so much to somebody who was in the situation that somebody cared enough to say look\nI'm concerned about you and I want to be able to help if I can if there's any way I can\nWrite instead of just witnessing something and silence talkative person about it so important\nYeah 'cause then it becomes normal right then it's like oh I witnessed I overheard this awkward situation of this ... possibly controlling um or humiliating situation and I just let it go as if\nNothing happened and so that normalize is that this is okay and so what we want to do is say no this isn't okay and do we as a community we were going to step in if we see it happening\nGreat advice Lucy if you're just joining in on Deborah Terry I'm guest hosts for Deborah zero who's running for state rep Jamestown Middletown\nMy guess is we've seen Rios from the Rhode Island coalition against domestic violence and we're discussing the coalition's new public awareness campaign for domestic violence awareness month and a state wide survey they conducted to learn more about our community's attitude towards domestic violence\nSo how can the general public get involved and help\nYeah well I didn't want to take the time to talk about October because this is the months that we've launched or a public awareness campaign and there's so many ways in which would I Would just can get involved in on preventing domestic violence in addition to supporting all of our member agencies of events uh there are tons of 'em community events that are happening\nAt a training so our coalition is putting on one on October sixteenth about bystander intervention that I Am facilitating sigh welcome every was to come and participate in that\nBut we also I'm going to be leading the state house this year purple\nUm the week of October sixteenth\nAnd ah we haven't done that in a really long time um but we decided to do that this year because we wanted to have a statewide visual I'm for that for for the island hurts and really bring people together um as a way to promote healing in our community um\nAnd really to get people motivated inspired to to take action I'm Around some of the the messages that were putting out with our campaign this year\nWhat's the significance of the color purple he said you're going to leave the state house in purple\nYes so traditions are color the domestic violence color is purple though we have um been using a are ... the coalition's color is she'll and we've been using a more he'll color 'em through the no more campaign\nUm which is a national campaigns that unifies both domestic violence and sexual violence um but this year again because we are focusing\nOn what constitutes abuse of what constitutes domestic violence we thought it was time to bring back um the purple and that is going to be a the the prominent color and theme of um of the month and hopefully of the year\nAnd you also talked about in October you're going to have a bystander\nIntervention a program being offered can you tell a little bit more about that in the details\nSure as so again it's not a long shot but it's like we're we're trying to respond to the communities need 'em so they have told us we want to learn more ways that we can get involved in more ways where we can intervene that safe\nAnd that supports the victims of abuse so that Cheney will be very interactive I plan to do very little talking and hopefully getting folks of in the room to ... to to brainstorm to role play about ways in which they would intervene given different scenarios um that I'll be sharing with folks in the room\nUm so yeah it's really about giving each other chips I'm to intervene in a way that's safe um and support victims\nCan I sign up on your website or is there a number to call yes so if you visit um our website which is a R. I. C. A. D. V. dot org you can go in our training page and you can register their um you can also I'm Paul our coalition\nHow would you like motor treads twenty or gene truck over here for only one I mean I Will say hello to forge twenty eight to ... the best for the best price anywhere just one hundred and Ninety nine dollars for only a port board and he's footage ordinarily have it\nOne way that we are again continue to support the growth in the learning of the folks that are in the field I'm trying to work on a supporting victims in preventing this issue from continuing to happen um but there is a small fee I Believe it's twenty dollars and that don't quote me on that [laughter]\nLike making me virtually not on the same property as the customer so again another example is I on the Appalachian after they run around the ... that is private property not owned by the city of work but the city of work is eligible off taking any receiving that those electricity back\nIs is there a significant cost savings for the municipalities to get the ah get their energy that way obviously it's to change from DC day see that's the cost and obviously for a company there has to be a profit in there but as it is there substance is their savings through going through sustainable\nThey're absolutely as I can tell you with all the ... I mean it's always free right [laughter] it's up there working and we're not doing anything\nTo write a great question absolutely I mean with our project that we have installed projected to save our partners of a seven Seventy five million dollars with the costs of twenty five thirty years right and it's not just electricity savings also\nIf the town if that's all facilities in that town a city that particular mean Pelosi human as well over the course of twenty five to Thirty years so it's too bad knee stream and then also a third rising stream which I call it's hot enough problems has attract after deal really the best to you as the account can have\nThe town owns a landfill ... rent payments of the course of twenty five years they have electricity benefits or the ... had a team so for twenty five years they have three streams of revenue\nAnd surprising Charlotte somebody would cut the best deal\nRoads [laughter] where are you in a great doubt the great job I I I guess\nA forgive the lack of a term with solar but the sky's the limit in terms of this again I think the bigger issue was finding a place to put the solar solar panels I'm currently a ... is there any estimate how much do you how much solar is actually adding to the\nTo the to the power production or across the state it's got to be a small amount as opposed to the natural gas or and for you know power that's coming from outside the\n... I Can't do the exact number but I I Can't tell you that we haven't we reached our one thousand megawatt goal to govern in school yet right\nRight now we have under construction around sixty megawatt okay which is over a hundred thousand panels right up to date so that there's a lot going up in the market very active around and\nBut we haven't you know we haven't reached the government's goal yet but I'm I'm sure we well\nRight absolutely and ... the big issue is with the the renewal there's the the double effect we talk about the approach they were kind of joke in a little bit about you know the sunshine in the sky but\nIn reality the issue of renewables and ... and the climate change issues obviously that we're having that that the the the the invisible we're not so invisible costs to using fossil fuels for energy\nThat's a big deal right I mean that's that's that's the same as we can calculate right right right right\nYou're listening to the commuters community on these radio stations Lindsey McGovern is the guest of the program she's vice president of a southern sky renewables they are the are the regions largest developer and the solar\nWe're the ah northeast premier developer would say for solar and we had the largest sold over here and islands as an edge we have over a hundred thousand panels installed today and that number keeps growing each day you know to have a lot on construction space\nHere in Rhode Island where locally they didn't weren't Rhode Island I've raised here and lived here my whole life right\nWill continue the discussion coming up with Lindsay again to use the vice president southern sky renewable energies you're listening to the cumulus community on these radio stations are taking for joining us and we'll continue the conversation coming up in just a moment\n\nDamp early today with clouds unexpected result in some sun and warmer this afternoon high Seventy six a shower late this afternoon or this evening otherwise mild tonight with some drizzle low fifty seven much cooler tomorrow dampers well with ... with W bureaus exclusive accuweather meteorologist Kerlikowske\nAccuweather home of voice from southern New England news talk Ninety nine seven out for him and I am six thirty W. B. A. R. O. [noise]\nNews talk six thirty seven have him W. B. R. O. along with WPRI twelve\nBy witness there was more sense with newsmakers panic secular swing coverage on a Sunday nights as sick as White House and the interviews with southern New England some politicians and other newsmakers then at six thirty join host ten mixing Suzie showcases emerging businesses interviews with business leaders and owners and highlights the stress\nNewsmakers a sex offender executive suite at six thirty Sunday nights on news talk six thirty that's not a nine seven ... W. B.\nR. O.\nHow would you like motor treads twenty or gene trucks will be here for only one I mean I Will say hello to forge twenty four more surgery so fish for the best price anywhere just one hundred and Ninety nine dollars for a full year what board and they went into and there were ...\nOf the southern sky ever knew all energy Lindsey McGovern is with us their leader or just a solar energy developer here in the state Lindsey welcome back there to protect us thanks I like to uh have you have you in here to discuss this issue for for working people get more information on what's going on with the with your from southern sky as well as\nAbout just the general issue of solar energy and renewable energy yourself where can people get more information about what you're doing because if you see the projects especially some of the wind fills you up some overhead views the they're\nThey're the people will know when we look at it you would look at them really from above ... pretty pretty small project\nRight so you can go to the office of energy resources for and they had a lot of information on renewable energy and theater and Ireland and in particular sores all\n... and again for more information southern Scott you have a website to observe\nSome ceremonial energy that\nKind of put that in southern cover noble energy in your search engine it'll come right up there you have a number of high profile projects right now or in terms of of western grants them\nOr we see right near the airport as well but you're in a number of tones of across the suit here what what what goes into actually developing a each site what makes it good for fruit for for solar farm development and what what goes into a developer you've you've done this in a number of communities across this for\nSure we ... we wish we certainly have what goes into it is as a as a broad question but what I can say that can give you the best analogy I like to give people it's like a real estate developer developing an office building right they find out where he's a vacant land for they permit\nThey hire consultants and lawyers to help them develop develop that particular building\nThey hire a contractor build a building and once it's built they find tenants to occupy the Occupy that building but\nWe do something very similar we find vacant property young and develop a solar facility on that property and be fined instead of a tenant we call it an off taker is an album off take her to stay around could be a hospital and ... and not for profit and his ...\nState agencies educational institution right Roger Williams at Brown university okay and they bring it altogether\nRain altogether and then and then national grudges or a huge component that too because of the interconnection process and they build infrastructure and once we haven't built they put it on line and flip the switch and reproducing kill ours\nAre you doing you're doing that right there and how many how many projects in Rhode Island oh so do you hope right here just generally speaking home whether you're a good couple anyway well\nYeah it's a we have several uh sixty lost you there and saw the under construction right now in communities we worked with our city of war city of Cranston town of Johnston I Do not Providence linking austerity often anymore [laughter]\nBut but it's a sort of Rhode Island as well and there were different incentive programs for for for each state like Massachusetts or a number of things as well\nYeah Massachusetts Massachusetts has a few centers that run island and I have one is they have solar energy credits at they place a high value to for landfill and brown fields so it encourages developer as to develop solve problems on land sales and brown feels\nAs opposed to Greenfield so matches has done that in the past and they also\nAllow a eligible off takers to be private institutions such as the the alleys of the world and CBS wherever island is not there yet but I'm sure they will be because Rhode Island the program they have his ... truly mimicked Massachusetts program right\nTo work with communities themselves because you know low terms projects like these are you know we all find everybody is all in favor of\nOf things like wind power and solar power and great and it's wonderful until it's located right next to me so how do we how do you how do you work with people that are concerned about are concerned about being around you know those facilities sure\nSure so I'll give you an example the solar system that's on the airport connector but we we met what first off we we met with the mayor ... mayor\nA format ... element to see if they would support so if I'm On on a brown failed and because it was originally a lot not for development typically brown hands lentils you can't develop we're able to get the support and a\n... from it for a solar farm for that particular project and also a huge factor ... huge factor is\nCoordinating with around ... am and making sure they're on board um if it's a landfill around the house or maybe even the Graham Greene failed in ... and has wetlands\nAnd lastly we have neighborhood meetings or meet with a neighbor's one on one to make sure that they know what's going on where communicating\nRhode Island's number one border you are is setting the standard again and again for borders over one hundred brand new Ford Escape for just one twenty nine from us that's like one twenty nine Vermont flood of every color every option and everything you're looking for like four dollars are\nPart of the state I Would think anyway there'd be next to a large number of solar panels probably a little bit better than the the big power plant I guess we are very Jeff wherever you fall on that issue I think it's a little bit harder to shorten those in as opposed to\nHow would you like motor trends twenty Eighteen truck of the year for only one I mean I Will say hello to forge twenty Eighteen Ford F. one fifty so desperate for the best price anywhere just one hundred and Ninety nine dollars per month only at point forward and he joined Narragansett\nAs far as a child ... expression like Tchaikovsky is not crackers now with more music and dance in every bite dry original flavor or new sugar blown ferry feed your kids the arch visiting Americans were the arts that or to learn how the aren't ask for more you by Americans for the arts the foundation and the ad council [noise]\nFrom the New England trucks illusion studio in Tucson I mean I Am six thirty WPRI accumulation [noise]\nNew justice deadly quake crime Christopher cruise Brett Kavanaugh has been sworn in as a Supreme Court justice it happened yesterday in a quiet private ceremony not long after the narrowest Senate confirmation and nearly a hundred fifty years and it's just correspondent Linda Kenyan\nRepublican John Cornyn says the confirmation process for Brett Kavanaugh traveled a bumpy road there is no lower road than the one we have been on top Senate Democrat Charles Schumer says there is one more avenues that can be used to effect change\nChange must come from where change in America always sneak in\nThe ballot box Kevin are now at the ranks of conservatism courting can affect the American landscape for generations\nKevin all was confirmed by a fifty to forty eight vote at least ten people are dead\nFollowing a magnitude five point nine earthquake that shook northwestern Haiti last night homes churches end at least one hospital had been damaged Saudi Arabian officials are denying the report in the Washington Post but a prominent Saudi journalist was killed at the country's consulate in Istanbul, Turkey\nThe newspaper reports the Turkish officials believe about Fifteen member team came from Saudi Arabia and but it was a pre planned murder or the writer who\nIs also a contributor to the post Seattle Seahawks safety Earl Thomas is out for the season and do add insult to injury he's also being fined by the NFL\nEarl Thomas was find more than Thirteen thousand dollars by the league for giving the middle finger while being carted off the field last Sunday and Arizona injured his leg and the third quarter and make a gesture towards his own team's sideline as he was being taken off the field Thomas's in a contract dispute with the ... and the injury may hurt is value in free agency\nThomas suffered a broken leg bringing his season to an end I teach ...\nDairy Sanchez Homer twice as many as a hero to not go pitch the New York Yankees bashed the Boston Red Sox sixty two last night to\nTie their American League division series that one game of peaks line Christopher cruise\nIndeed knows it's hard to find qualified candidates when you're hiring it's like finding a unicorn boy you posted job on indeed it's easy to find people with skills you need a nurse practitioner for plus years experience acute care certification indeed has a huge pool of amazing candidates and screen or tools that help you\nFind your most qualified applicants and entire shortlist of unicorns see one more than three million companies worldwide using deet to hire post your job and do dot com slash higher indeed the world's number one job site source comes tour to visit\nThe national debt is now over twenty million dollars what happens next rising inflation drops into the dollars by some experts say and other crashes coming you can't fight this not with stocks or bonds but with gold and silver coins and then I arrive from Augusta precious metals\nCoal eight five five eight five eight five eight oh seven and learn how an IRA backed by physical gold and silver can hedge against inflation calling us too precious metals right now at eight five five eight five eight five eight oh seven and get a free gold Ira guy called eight five five eight five eight five eight oh seven\nThe debut of the new space sects and Boeing crew capsules had been pushed off until next year ...\nSays the first commercial test flights will not happen later this year as initially planned but we'll instead happen in the new year with a January target date for a shakedown of space access dragon capsule no one will be a board that flight Boeing is aiming for a march trial run for its star liner capsule which will also be unmanned\nThe hope is those flights will be followed by flights with cruise in the summer with space X targeting June and Boeing August\nBy that time eight years we'll have passed since astronaut last\nRocketed into orbit from the U.S since two thousand eleven United States has had to rely on Russian capsules to get to and from the international space station I'm Johnstone and we're\nFollowing this developing story of magnitude five point nine earthquake shaking northwestern eighty at least ten people did\nFind Christopher cruise [noise]\nI'm Nick ... a select quote agent with a true story that could save you hundreds of dollars a year a woman named Linda just called her husband re has a three hundred thousand dollar group\nWas like in his southern Rhode Island's from your luxury dealer featuring Lincoln's explicit letter of Lincoln and Casey Lincoln Lincoln MTV and they all knew twenty Eighteen Lincoln Navigator for Lincoln if there were against it unparalleled luxury impeccable surface\nThe coverage for less than half of what he had paid if select quote hasn't shop for your life insurance you're probably paying too much for your free quote call\nAte hungry tonight to eighty eight thirty three ... eight hundred to Ninety two eighty eight thirty three eight hundred tonight to eighty eight thirty three\nMore go to so I called a ... since Nineteen fifty eight we shot and you get full details on the example miles is what will dot coms on commercials or ... or depending on your health issue income levels\nSouthern New England we kept on TALK six thirty seven W. B. R. O.\nC.'s twister before he's unelectable and he's on the radio on Saturday mornings at a level yeah he's ... the former congressional candidate retired army helicopter pilot here to take a look at politics pop culture that twenty first century ...\nJohn often every Saturday Night live and I am still do the voice of some ... ... talk six thirty seven have around\nW. P. R. O. following program has been paid for by Massey an associate it is for entertainment and basic informational purposes only solely responsible for its combat it does not reflect the views of cumulus media WPRI oh it's management or stuff [noise]\nThis is Matthew ... money happy to have you with us today making most have joined by Massey as I Am each and every week his phone number as we start our program on today for the euro won three three three eight thousand each and every\nWeek our focus is retirement how to plan for a successful retirement\nYes has more than Twenty years experience he can help you he has some great tips and strategies if you beginning to think about this next phase of life\nWhile you're in the right place\nThis week is going to be no different we're going to share some really great nuggets of information for you as you began this journey to him through retirement that never again to reach out to a job for zero one three three three\nEight thousand now most of us did learn in physics Newton's third love notion right for every action there's an opposite and equal reaction it shows this really great symmetry in nature forces occurring in pairs and housing interact with one another\nIt's great to understand how that can be applied to everyday life you know there's two sides to every story so to speak\nThe cool thing is they can also be applied to finances in other words there are forces out there that can lose your financial portfolio there are also opposite an equal forces were called the what ifs today ready to bring your finances down\nSo with that in mind Jeff going to help us walk through some affected financial strategies to help protect their retirement savings against eight ... what is so ... we're going to get the ball rolling here maybe since we're talking Newton we should get the apple rolling what do you think\nA good point that's a funny one you're clever your Glover\nYou of course like a law of nature the what is a really more of a when you know the market will go down we don't know when prices will go up eventually and so on\nToday we're going to start with some macro events that can rein in our bottom line the first is what if interest rates continue to rise\nWell most no the the risk of interest rates going up as a bond prices will move in the opposite direction of the interest rate so if interest rates go up blonde guy who's come down the streets were dumb blonde I was ... pretty like with like a seesaw or teeter totter\nThe other issue with bonds is the maturity or duration you\nKnow how long before the bond reaches maturity and you get your money back\nThe longer that is or the father out that is the more price sensitive the bond becomes if you have to unload the bond prior to mature you know the good news is if you are able to hold on until maturity you are entitled to get all of your original investment back\nSo if you bought a ten thousand dollar bond\nEven during the term it could lose value because interest rates going up but if you hold on to it it's a maturity you'll get your ten thousand back\nFrom the bond issue so that's always important to keep in mind so\nAs a plan or as a manager we we want to move towards shorter duration and shorter maturity is because we feel it's much better for the portfolio than keeping a longer maturity or something that has a a duration that's further out\nSo Jeff how do we protect ourselves ban against rising interest rate\nWas like in his southern Rhode Island for a mere luxury dealer featuring Lincoln's explicit lighter of Lincoln and Casey Lincoln Lincoln MTV and the all new twenty Eighteen Lincoln Navigator for Lincoln of Narragansett unparalleled luxury impeccable surface\nHit for anybody to take so if you've got all of your retirement funds\nIn the market directly at risk in the market wealth and maybe now is a real good time to take a peek at other alternatives that you may have\nTo help avoid those big losses when the market does have its next big correction now we know it will likely happened nobody knows when you know let's let's be clear about that you know my crystal ball spinning the closet for a long time because\n[laughter] it doesn't work [laughter]\nDrive but there's no real value and looking at it [laughter] it's kind of like that\nUm so it's important to understand that market corrections are typical you know you should expect them you need to be positioned accordingly I'm a nice thing to do is to have a cash reserve so if the market where to drop down severely and that's where you were drawn your income from\nThen you can shut that off and maybe drawdown on your cash account instead\nAnd that way you're able to take care of what your what your financial needs are without invading the account that the market is taking down and down in value\nMm okay so I'm hearing you talk about the market here saying stop panicking right don't chase trends don't get worried when you flip on the news and everyone's in a tizzy\nRight exactly right so it it's so important if you have a will lead plant in the market corrects it really should not cause you to lose sleep if you have a well laid out plan\nJust conceptually we'd like to take a portfolio and split it in half half we want invested in the market directly so we can take advantage of those good years in the market but\nHalf of it we want to have it in protective positions with the market does drop substantially that half of your portfolio doesn't go down in value so that's that's very important and we do that by mixing\nYou know insurance face products with investments and we think that is the better way to go and you know recently a Yale professor from you or Roger ... and and the people follow the market the recognizes name because he's really a big name and the investment world\nCame up with a report that showed that the bond alternatives that we use\nOur the place that you should be considering placing your money as you go forward because the bombs having a negative impact with rising interest rates which we know are happening\nWe've had increases already we're expecting more this year we're expecting more next year so I've been positioning like that for years so you know I kind of joke and say well you know Gail finally caught up with me [laughter]\nThis is the way that I've been doing it for a few years now they act\nYeah for the exact same reason so now I just take this report and say look you know here's a report from a professor from Gail that says what we're doing is what you should be considering as you move forward\nYou know so think about that there's a lot of power when I'm somebody of his stature and his team did research over Ninety year period of the stock market and did the analysis they came up with yeah these are the places you should be putting your money so I think it's pretty cool because it really\nBacks up in third party information in a very from a very credible source some let's say you know they have a pretty good and then\nI got to get people might say oh yeah I remember them yeah [laughter]\nWhat it's all good so if you like to hear more about that that report specifically\nA number of years for a one three three three eight thousand we'd love to hear from you have you in for an opportunity conversation to see if we might be able to help you and your family with your retirement planning and hopefully with some tax mitigation some income planning perhaps some legacy planning whatever is important to you at this stage of your life\nOur number here again is for one three three three eight thousand if you have two hundred thousand more for your retirement please call\nBoy you mentioned Roger ... and I I'm familiar I have followed him wow what a brain what a guy you know he really is I just take a cut above and I've been really impressed with what he's he's sad especially lately about the market\nOh he is on and has been credited to doing so much very detailed analysis about the stock market over decades and decades of time and uh you know thankfully I had the opportunity to be at a conference where he was actually one of the guest speaker so very impressive guy has incredible brain and a wealth\nOf knowledge studies that he's pulled together over all these decades of time that he's been working you know analyzing the markets smart people are really cool [laughter] you know it's it's\nYou know it's kind of interesting that we took on the nerds and high school but those are the those are the people that everybody\nWhat auto group wants your car any make any model what pays more than anything or around because we're a certified buying center at will buy yours even if you don't buy ours log onto our car buyers are tough\nReally really top tier school in the city and there are students section started chanting that's all right that's okay you're going to work for us one day [laughter]\nOh that's funny talking about nerds inaction right or that that that is funny though [laughter]\nAnd probably true\nYeah [laughter] God Bless the NATO they they understand the bigger picture [laughter]\nIt's not just about went on a basketball game and although you know being in competitive sports is his can really help people develop\nAs people and have a good sense of\nYou know it takes effort to get what you want a I think that's the bigger picture when it comes organized sports if you want to win then it takes effort it takes practice it takes rehearsals you know you've got to be there you go to put in the time just like being a good financial advisor this does not happen overnight\nYou know I've been licenses Nineteen eighty seven so I have a wealth of knowledge and that's why I wrote a book recently you know it's a messy on money how to plan protect and make your money lasts for life your guide to retirement and that's the books that that if you'd like to get the book and go to Amazon dot com\nOr you can download a Kindle version for a hard copy version whichever you prefer\nA short money it's like ten bucks or sixteen bucks roughly um that's pretty cheap when you look to retirement planning the wealth of knowledge that I've kind of poured my heart into that book so that I can get as much information out to our listeners as possible\nI Love this book yes it it really is a wealth of info for people beginning to think about retirement just a great place to start if people want more information about that book about what you could do for Dan in their retirement future what would you encourage them to do today\nWell they can go to ... dot com and there's a spot to buy the book without connect you directly with Amazon\nAnd I think that would be one of the best investments you can make you know even if you don't want to work with a professional it gives you a great deal of information that you can actually tried to put a put together a plan yourself and obviously we don't recommend that because obviously we have more experience than you would on your own\nAnd a lot of our bigger clients this is interesting one of our bigger clients who handle their own investments up to retirement realized the amount of time that it took them to watch dog their investments\nAnd this one case comes to mind specifically and there was a big case and it's kind of an unusual case for he gave us a million up front to work with he finally retired and he's had his four oh one K. where you had another million and he just slipped out across the table you suggest I Want to retire from taking care of this too so I Want you to handle is for me\nHe said I Want a Gulf [laughter]\nThat's what I Want to golf and he golfs like every day I remember calling in one day I call on a cell phone it was in his mid February now obviously that's cold around here and you know the answers the phone and it's kind of breathing heavy I said do you okay\nSo yeah I'm On the golf course I said it's forty five degrees what do you mean you're on the golf course [laughter] now you will see me on a golf course under like sixty degrees because to me I'm a farewell the golfer\nAnd I'm not going to go out and try to prove my ability to withstand cold playing golf I did that in the army I did my cold weather training in the army I Know what I can do and what it takes to survive but you know I don't put to work on a golf course [laughter] oh I was like\nWow he was serious and so he really wanted to just enjoy retirement and party now is giving up the investing side\nRight and and for me you know so heartwarming when we have a case like that\nAnd we know we're making a dramatic impact on their life\nBecause in his in his mind I fried up hours per day that he would spend watching his investments looking at this readings of taking care of that we're now he just hands it off and go here\nIt's not worth it for me to do it on my own I have much more important things to do and then since he retired grandchild now on the scene so they have more time to enjoy their family so it it's just hot one has just love that kind of stuff because if they're happy\nAnd my goal is to help people achieve their financial goes for retirement so that they can be as happy as they can be so I Know we kind of went a little off track on the the topic of the today show\nHere's here's what I think is important for you our listeners our number here as four oh one three three three eight thousand\nIf you're getting close to retirement or even if you're already in retirement if you just want to get a second opinion to see how things are a number of years for one three three three eight thousand we will take you through our trademarked proprietary process start to finish which begins with an opportune\nHow would you like motor trends twenty Eighteen truck of the year for only one night I mean I Will say hello to forge twenty eight Ford F. one fifty a best friend for the best price anywhere just one hundred and Ninety nine dollars per month only at Ford in eastern edge or never gave it\nA lot of people have misconceptions about annuities and it's really unfortunate because in the right place a portion let me repeat a portion of your money\nShould be considered for an annuity because of what it can provide you it can provide you safety against stock market downturns can provide you're guaranteed lifetime income you can't get that anywhere else but in those types of guaranteed insurance products\nBecause guarantees are always by the claims fang ability of that insurance company so you want to work with a good company know our listeners they might be real sharp with what they're doing but\nYou cannot go directly to an insurance company and buy a product you have to go through an advisor\nSo it just makes sense that you work for the professional because then you've got everybody you know as a as a professional taking it like having arrows and your quiver I have a lot more arrows and Mike wherever then you have access to\nBecause of our licensing that allows us to do certain things that you as an individual can't do so it's important to work with a professional that you feel comfortable with that you feel you can trust you know ask your friends who are they working with get a referral\nOr give us a call we'd be happy to give you a second opinion is that what you're a current advisors has been doing and are you on the right track and you might very well be and on occasion we do an analysis and we say you know what you're in great shape you may be tweak this week that but you're good to go\nAnd ... isn't that beneficial\nEither way and we're if we find that you know things really outright for you to maybe it's time for change and maybe just the the plan didn't keep up with your your timeline heading towards retirement our number here is for one three three three eight thousand if you save two hundred thousand or more for your retirement\nWe'd love to hear from you come on in and have an opportunity conversation with us\nAnd it is complimentary so there is no charge for the process that we take you through and we have a trademark process soup to nuts as the old saying goes so we can show you exactly where you are today and then potentially build a plan for you to help you achieve your financial goals\nGap you mentioned securing our funds from are guaranteed sources that they had an ad that word guaranteed I imagine there is that why do you find that list that addresses a scary thought as not having enough guaranteed find whatever may arise right\nLike you know and that's it seems like a simple question but that can go into so many different offshoots um you know the real issue\nThat I see is the biggest major unexpected expense would be medical you know what if you or your spouse gets really really sick and retirement\nYou know did you protect yourself and what I mean by that is when you reached an age sixty five did you sign up for Medicare and when you actually retired did you sign up for Medicare part B which handles doctor visits but more importantly beyond that\nDid you buy a supplemental plan because the supplemental plans really cover all the other expenses the Medicare part a and B don't cover that is a dramatic\nProtection that you can build in what in my opinion is pretty short money your part B\nPremium right now is about a hundred and thirty four dollars a month a very a supplemental plan for somebody sixty five is about a hundred and fifty dollars you need a drug plan which might be twenty or thirty bucks a month and then you've got everything covered I mean that is an amazing coverage for what amounts to about three hundred bucks a month\nWhen you look at buying their own plan might be eight hundred nine hundred thousand a month plus you got co pays and deductibles and everything else were for three hundred a month under this plan it's going to cover all the deductibles and co pays\nSo it's very important than the other part of that if you get really into his long term care\nNow nobody wants to go to a nursing home let's face it nobody ever wants to go there we want to get care in our house if we needed and then maybe move onto an assisted living facility and then at the final\nStage of life so to speak transition to a nursing home for hopefully the shortest amount of time so it's important to not ignore what that expense could look like right now in Rhode Island it's about a ten thousand dollar per month expense and ... about half that for assisted living\nSo when you look at it it's a big exposure that you can cover that risk with a good solid insurance plan now we ensure our cars we ensure our homes we ensure our lives in case we pass away many people insured their income in case they get\nWhat their Chevy GMC ... Toyota and Subaru all have in common they are all in for Steve free own tradition and fought for Denise religion Narragansett that's right over two hundred three on cars all makes all models and incredible prices are going to flood auto jobs now\nThat one of them will need long term care before they pass away\nThat's a huge huge risk so why not him that risk over to an insurance company in exchange for print them just a simple way to look at it we do like the hybrid plans and if you're concerned about long term care please call us for a one three three three eight thousand\nWill sit you down with one of our advisors that can kind of stuff you through the whole process and show you what the real numbers look like and what are your premium might be for for a reasonable uh insurance plan to protect against long term care expenses\nA number here again is for one three three three a thousand we look forward to call\nThe final segment gets into some of the personal what if that could potentially financially the rail our retirement find out what they are with kept up next [noise]\n\nIt used to be easy to create a retirement strategy worked forty years save money live off that money for a few years during retirement things have changed for many retirees reliable income is harder to come by we're living longer than ever so that chunk of retirement money now needs to last still eighty five\nNinety who knows maybe even a hundred\nDon't be along called Massey and associates geek Massey and associate Jake offers no obligation retirement income strategy sessions Jeff's team will dig into your unique situation at if possible designed a custom strategy to help generate the supplemental retirement income you need\nAll Massey an associate's in right now to schedule your retirement income strategy session\nFor one three three three eight thousand that's four oh one three three three eight thousand\nInvestment advisory services offered only by duly registered individuals' through eighty wealth management Elsie [noise]\nIf you have a crystal ball that can predict the future you don't have to listen to this message for everyone else please pay attention my name is Jeff man I'm the founder of Massey associate thing we've witnessed than almost unprecedented rise in the stock market over the past few years I don't have\nA crystal ball but I've seen market corrections firsthand and I've seen what can happen when those markets crimes now is the time to find out how your investment\nPortfolio might performed during that next market down term called today to schedule the visit to find out which investment strategies are best for you not just for today but well into your retirement years we think it's important to get started by getting to know each other so call us today at four O. one\nThree three three a thousand to see if we can help with your retirement planning ... three three three eight thousand once again for World War three three three eight thousand\nInvestment by preserving that offered only by the registered individuals they're able to management I Love the\nIt's just nasty on money making most jak here with the founder and president of Massey ... says he had\nJust nasty here's the phone number to get in touch today for zero one three three three eight\nThousand and we mentioned jets brand new but if you'd like to learn more go to the website nasty and money dot com that's N. A. S. S. E. Y. nasty and money dot com and yet you address this proposition of not having enough money if the health issue or to a rise\nI Want to continue on that more personal type of what ... what's the next one\nThe real serious one is you know what if I die you know of course that is a when not if\nYou know I get that part but what happens to your loved ones endure a state when you pass away\nYou know especially if you are the main breadwinner or\nWhat I call the financial spouse is I have financial and non financial spouses it sounds like they don't or they don't have the capacity to handle the finances is just one has handled it throughout their marriage in one house so it's important to protect that non financial spouse especially\nTo be organized so you know I had a case early this year where her husband passed away and\nBright lady but she always handled the finances he was he was in business with his brother and he was very methodical and he had everything he knew he was passing away because he had an illness and he had everything in spreadsheets\nAnd she came in with pages of information that said okay this is what he did for me he laid it out like this and I said you know you are so fortunate that he did this for you because can you imagine\nIf she being the non financial spouse all of a sudden", "show_name": "WPRO Morning News", "year": "2018", "city": "Wakefield-Peacedale", "day": "07"}