{"month": "10", "state": "RI", "station": "WEAN", "content": "Was like in his southern Rhode Island's premier luxury dealer featuring Lincoln's explicit light up of Lincoln and Casey Lincoln Lincoln and Casey and the all new twenty Eighteen Lincoln Navigator what Lincoln of Narragansett unparalleled Marjorie impeccable surface\nThat they could you comment on our news traffic whether we can talk on the nine seven and I am six thirty W. B. R. O. prominent cumulus they should [noise] from the\nRevolution selfless news centers is is that the news at eight o'clock is we digest Jean Val is said to the story going back to the seventies Joe ... is only in Rhode Island right\nPleading no contest the simple assault case in connection to it then teenage speaker of the house Nick Matty yellow and the neighborhood dust up a lot more to second first though let's get down to the Florida Panhandle they're facing a potential hit from a category for hurricane hurricane Michael top winds now hundred forty miles an hour CNN's Natasha ... has more from Panama City\nStorm is dangerous and if you don't follow her warnings from officials this storm could kill you\nHurricane Michael is threatening a huge three hundred miles of coastline some Florida Alabama from road there already turning into reverse President Trump is declaring an emergency opening up federal disaster aid ahead of the storm\nWe're very well prepared FEMA's ready we're already\nActually we got the wealthy high of a problem with the fact that the ticker flooding caused widespread power outage\nThousands of National Guards men at hundreds of Florida State troopers are on alert ready to head and life threatening situation our priorities get a real life saving in Panama City Beach Florida ... reporting but of\nCourse to keep you up to date very latest here in the weather station hurricane Michael it's firms expected they were pretty quickly up the coast could bring a period of praying to us in southern New England much more as the head to the south and east that'll be coming up tomorrow into a friday\nOn NPR oh twenty eight pain election central quite a couple of days here over the P R O stories emerging the campaign trail joke trailer this morning confirming his story spoke to my ...\nD a simple assault charge connection to a neighborhood fight in the Nineteen seventies with a dead\nYoung teenager committee yellow what a neighborhood disputes this is an old are you in Rhode Island sort of story\nAnd Joe cello tells us took to play on the case of his later filed now he is laying the blame for Allan Fung the emergence of this story says Allen phone doesn't want to talk about that fatal accident and he was involved with that was a story that came out during the twenty fourteen campaign don't\nKnow for drunk whether it was on drugs we don't know anything about it and that was fun doesn't want to talk about it he said it was one of the mistakes he made his wife\nAnd then again that is ... just a moment ago there was a appears being sent to Yemen funk Suzie fully disclosed that back in the last campaign and he says this story\nIn regard to the teenage speaker of the house shows joke true love is unhinged by the way children many of those looks it's better to hatch it became friends up there\nAt the state has got a new poll this morning Providence Journal NBC six local NPR comfortable leads Democrat Gina Raimondo Sheldon Whitehouse their reelection campaign talking about this trailer story here in ... New York show on a Tuesday Afternoon we hear the story of a young Republican going to be removed from a leadership post why oh\nShe's not going along with the party line here still heroes balls that Gary\nHero collector richer so she didn't decide on who to support until the channel twelve debate but Richard tells WPRI rose Daniel ... at the debate GOP candidate Allen fun wouldn't answer many of the question she had a joke trailer did and his replies squared with her conservative values\nSomething as simple as he would answer the questions on and I when he didn't answer the questions I liked what he had to say in terms of his attitude for pro life on his press ...\nYoung Republicans chair Jonathan keeps us going against the nominee is going against the fabric of the party richer says she supports GOP candidates other than fun removal could be confirmed and the young Republicans officers meeting on line via social media early next week balls and Gary WPRI new they should\nOf course full coverage continues elections central Ninety nine seven FM am six thirty W.\nP. R. oh a couple of other stories we're following his advice and as they did a piece of equipment malfunction on route six and the jumped in situ in line this is calling causing big delays has has a cold plain or they're trying to fix that victory is going to a much more on the traffic updates again that is on one of the local highways here we're six\nThey're having issues again with a piece of equipment later today the ACLU expected to announce legal action tell a city schools in Providence seeing courts regard to that school bus drivers drag both sides reporting progress in mediated talks Tuesday not enough to end the workout\nCanada where do you want to go to have a good time north to the border candidate is going to become the second country to legalize the adult use of marijuana they starts on Wednesday of next\nHow would you like motor trends twenty Eighteen truck of the year for only one I mean I Will say hello to forge twenty Eighteen Ford F. one fifty the best for the best price anywhere just one hundred and Ninety nine dollars per month only at point forward and he joined there were against it\nActually beat the Yankees three games to one I'm a\nBit more exciting than we want to ruin a hold them off a little exciting but here we are celebrating a number two [laughter] [noise] that's very spiritual\nGoing down is rather lengthy beard Craig came Berlin a site that we all could\nRecall\nHe was on the end they'll be networks sucks will stick on the ... American League championship series game one on the way Saturday Night the Yankees\nThey are headed home\nComing up as the news continues Rhode Island's anchorman got more of the day's top stories on the way boy that isn't only in Rhode Island story Joe shrill oh rough up a teenage Nick Merritt yellow and it's a campaign issue more than that store your reaction coming up next the latest on the highways Elliott has more than a hurricane W ...\n[noise] from the WPRI road traffic center pose a a very heavy right here in front of us on Ninety five north bound from the airport connector all the way up to reach and you've got so traffic ... the third Bruce ... Ninety five heavy to the ...\nAnd all the way into downtown Providence towards one forty six merge one forty six ounces backed up to Lincoln woods gets up and go traffic um well I didn't find westbound the heavy coming in from seekonk all the way down to the Washington Bridge\nGot slow traffic on the return north of reach six six the slowest ten heavy traffic on the sixteenth connector two Ninety five north ... thirty seven up towards the playing field pike\nAnd it is slow on reach six he's found out through Johnson approaching the area of two Ninety five to that construction zone and if you see a traffic problem called the W. P. R. O. Providence auto body traffic tip line four to one of the U. P. R. O. and with the region right now traffic reports on W. P. R. O.\nPolicies have long hair and whether senator dean do they only partly sunny warm and humid hot eighty clouds tonight Mormon you below sixty eight tomorrow not as warm but you've lived with periods of rain on Seventy two friday breezy and cooler animals the clouds sunshine sixty three Saturday partly sunny high fifty five Sunday becoming probably fifty eight\nBut WPRI rosy clues about you rather eat at all just always Abrams\nWhether it's brought you by Paul Massey by happy with Paul message one price guaranteed peace of mind you'll never over pay Paul Massey dot com eight or six mid week\nI'm kind of like\nHow big does expecting I really was thinking we were going to get pretty much nothing but looking at that they're kind of makes you wonder\n[noise]\nListen I don't know what she was watching because we all know for a week that Florida is going to get away\nWith a storm sodas a tropical storm that dumped up to a\nCategory one moment after the Gulf yesterday morning it was a category three in the morning it's a category for and about three or four o'clock Pensacola Panama City the hell is going to start to feel it meteorologist on alert down there there's going to be a big one big storm surf highway and a lot of damage\nTo be the first category for to do so on the land mainland of the United states in the month of October since hurricane hazel did back in Nineteen fifty four so that alone tells you the rarity of such a storm this late into the season and only point oh nine percent of all hurricanes set of every in fact the U.S have done so as a category for\nWho I hate when they say that word hazel that's one of those that's one of those in history hazel like this one is Michael and he's coming in the afternoon\nWe do have shoulders available and we've got twenty four hour news coverage of local news coverage telling people where to go what to bring a to make sure that they've got you know their medicines 'cause they're not going to be medicines there we got special lead shelters so we are fully repaired we've been through these things before but uh you know\nWe really don't know what's gonna happen until it happens and hopefully will not be as bad as we think it's going to be but I'm afraid it may be\n\nAll right the the president tweeted out last night uh here in Florida get out get out now we're looking for the president's tweets we don't really see much yesterday the president was preoccupied by the surprise announcement\nThat Nikki Haley his UN ambassador is leaving him at the end of the year he didn't seem too upset about it that used to rhetoric she's great she's going to be working for me campaigning but it's time to go and she knows when it's time to go President Trump with Nikki Haley yesterday both of them in the oval office\nA fantastic job and we've done a fantastic job together we've solved a lot of problems in the process of selling a lot of problems at the beginning or North Korea was a massive\nLooking for a car credit not great well isn't it time you financed with blood was born in east Greenwich and they were against that have the best financed raising prices in cars with zero percent if your for Seventy two months you can be driving on affords also models interest free log onto what auto dot com\nDone it's slowly shrinking if you call ... co contracting today just about any outdoor painting or repair project on your home or business will get on the schedule this year but you have to call Tom now add lobster contracting have the conversation with Tom now before the days are shorter called Tom now one eight hundred painting\nTime changes everything for me becoming a single father of two young kids it changed my ability to use my timeshare the frustration of not being able to use it was compounded by annual maintenance fees that nearly tripled over a three year period I was desperate to get out\nAfter searching online for selling my timeshare or get out of my time share it just looked like one scam after another I needed a real permanent and legitimate way to get out of this for good\nI'm brand and read the founder of timeshare exit team we will get you out of the time sure you can't use or can't afford anymore we get people out safely legally and permanently we are more successful because we have more solutions call timeshare exit team\nToday for a limited time timeshare exit team will be coming to your area sit down face to face review your time share ownership situation and find the right solution for you visit timeshare exit team dot com or calling for for nine nine six exit scheduled today that said for for nine nine six exit or timeshare exit team dot com\n\nThat's just fine jewelry drink yourself treat yourself to something special because they've got whatever you want to but they're beautiful necklaces bracelets earrings rings and\nTerrific watches they've got the brightly watch over ... the brightly that's the aviators preferred watch high quality beautiful and they've got about ... and they have a price point for whatever meet your budget whether you're spending fifty five hundred and fifty thousand over there they'll take care of you everybody gets the same treatment\nPolitic you hear me off your cup of coffee I sit down and relax and let's see we have here feel they also have their own design cetera they've jewelers crafts people in the store every day you\nCan see them walking right through the window there they are they do repairs and they make up their own beautiful jewelry you just throw a little sketchy you tell them what you want to if you see something in the case that you'd like changed it taken the back and they get the job done right there it's an old it it's a old fashioned ways is still the best\nThey have jewelers right they're making it up in the store ... jewelry store stand alone two hundred Jeff a symbol of on board where they've been cultivating relationships since Nineteen sixty ... dot com\n[noise]\nFrom the WTO road ... center [noise]\nSo we have a still a busy traffic here on Ninety five north bound return to their wrist avenue and still kind of slow begging for civil of our Ninety five sounds phone is still slow from lung still am and they also busy downtown one Ninety five west but I'm Still pretty slow coming in from St ... backed up to ... street on forty six ounces so slow down town and\nThe two Ninety five or this will be north bound traffic as you travel up towards the playing field pike is jammed up and backed up towards ... thirty seven\nAlso have slowed traffic out of reach six and John stood approaching\nThe area of two Ninety five because of a road work zone in there and if you see a traffic problem called the W. P. R. O. Providence auto body traffic Jeff lam fortune WPRI role in this report is sponsored by Providence auto body certified by more manufacturers than any other collisions that are in Rhode Island\nAnd is on the accurate pro first college will repair facility and whether you're a regional right now traffic on words on W. P. R. O.\nC. skate long hair and weather center today started over there is a fog otherwise partly Saudi warming you is very high eighty clouds women use ... sixty eight drawing on this one was today about human ... Seventy two friday breezy and quite a bit cooler animals the clouds the sunshine high sixties free without ... rather I made it all decided\nRon Paul right Elliott and the weather is sponsored by a car John ac and heating save on your energy bills and increase your comfort this winter yeah it's around the corner with a high efficiency heating system called car John today at two three two Ninety four hundred\nAnd twenty three on a busy ones they mid week we're watching a hurricane and Florida category for it's really going to walk that area so if you know somebody of property down there get in touch today right now do it now before they lose phone service electricity or things like that new poll out coming are among the forty eight percent Allan Fung thirty four percent she's opened up a lead over him\nJoe ... five percent not sure eleven percent\nWho gets three percent others one percent for the compassion party that's the marijuana people and I'm sure all my friends over there you go to court they come up a a will Gilbert he gets one percent and a duck to ... percent okay\nI had trouble when Allan Fung on and they're pushing back against this bill they said it was a bad poll wasn't done\nWhat auto group wants your car any make any model blood pays more than anything or around because we're a certified buying center at will buy yours even if you don't buy ours log onto our car buyers are tough\n... running against them last night both of them faced off in the debate on WB you see are friends of WB Z Channel for providing this report\n... started the first debate by time governor Baker to President Trump especially his support for Jeff deal over Elizabeth Warren\nGovernor Baker just said his loyalty is to the Republican ticket even\nIf that means sending someone to the United States Senate who would do everything in his power to under ... a woman's right to choose\nBaker responded by distancing himself from the parents or\nMy views on Donald Trump or quite well known I didn't vote for him and I work with other governors and senators Republicans and Democrats to fight back against this cuss the Affordable CARE Act for which we were successful\nTo debate venture into national grid and the ongoing walk out of more than a thousand of its workers at\nThe national grid workers I think had been treated reprehensible ... by the company who was locked them out stopped paying them stop their health insurance coverage and we've\nPut them in the same room or to see if we can ... their differences and get them to hammer out an agreement [noise] um I'd love to be able to say we've been successful in doing that\nOn transportation Gonzalez went after big or for the poor performance of the MBTA and said he would be new taxes on the wealthy and college endowments to pay for upgrades\nWith the lack of urgency and the fact that system hasn't been fixed I'm surprised that commuters haven't revolted and started a petition to change the name of the tea passes from Charlie card to where's Charlie ...\nWe have a plan to spend eight billion dollars over the next five years on the stuff on the tea that's going to improve the bus system the commuter rail and the rapid transit system and that's where our money should be spent\nBaker relaxed in that debate is going to have been worried about the head but who knows much he could he could actually start to measure the drapes it's eight twenty six\nRyan and his family had visions of building their dream home in New Hampshire and they were trying to figure\nOut the best approach I'm terror granted ... they called the Nathan Clark team to discuss the sale of their home in Warwick and immediately knew that they have the right team Nathan Clark and the team lifted the home put the full weight of their marketing behind the lifting and generated multiple offers\nImmediately on the property Bryan and his wife are excited to accept\nAn offer that was seven thousand five hundred dollars more than asking\nThe team approach with seamless and within forty two days the property closed and Bryan and his family are currently constructing their new home in New Hampshire Nathan Clark guarantees to sell your home it's simple\nYou and Nathan just sit down and you both must agree upon a price and time of possession and if the home doesn't sell he buys it at the agreed upon price call the only agent I Would call if I needed to sell my home Nathan Clark at\nFour O. one two three to seven\nSix six one that's two three to seven six six one remember Nathan steam serves Rhode Island Massachusetts and Connecticut\nHi Kevin Mahoney here with New England truck solutions and north Smithfield too proud to say that when New England industry leader and detailed production installation animals\nFor a true one stop shop because we all aspects of the job without having to outsource any ways specializing in vehicle rats and fleet changes [noise]\nIt was one of the few graphic companies in New England that off the highly acclaimed three M. M. C. aspirin warrants\nOne six five nine zero zero zero\nAlthough on line to any trust solutions that\nMay have ruined ... joined us Monday in October Fifteen for our toy and comics discovered auction over three hundred and fifty bucks of collectible toys and comic doors open at three PM for a preview auction starts at six at art gallery at sixty three fourth avenue grants\nAnd remember we're always seeking consignment of comics and toys now's the time to catch\nCalled Bruno ... five three three Ninety nine eighty or visit our website ... dot com\nThat be a year and a year\nNow more new suite Jean Valentine day from the New England solutions to the news talking on United seven of them and I am six thirty in the UP are\nAlso skills we really don't know\nI found the moderator the debate you show\nWe don't allow them open a smoke filled yeah no I\nA boy run out of the politics who I saw a ticket to this I get more and more than just getting [noise] Hamilton by the way it's kind of the Boston listen to this [noise]\nNow what gets me getting Hamilton down here I think after Boston something's coming over here you can't get a ticket the Hamilton up there unless you've got a lot of money because ticket master bought up all the tickets than that\nHow would you like motor trench twenty gene trunk of the year for only one I mean I Will say hello to forge twenty a gene for that one fifty self destruct for the best rice anywhere just one hundred and Ninety nine dollars per month only a plug for it and he went into a ...\nA competitive way to the head of the health care or when he met a choice between the or with a program that we're still good offers or a Thursday or was it so we we've got to a head of the ... one of them that are you in these\nI Want to just nail this down they have consistently said that you have not fully funded your four one K. you up in late making the payments all the money isn't there I don't know what else to say your response to that is what\nAre we supposed to that is simply not true uh we've we've had no problem with probably this is a ... or ... or what\nIt is but we just couldn't do Martin looking after which were rectified they were an administrative nature where every company in America who admitted or with a program\nAs it is relative to a ... a month and I think that we're getting the right data in the right Bertie numbers getting the right numbers I think on my company is a good we've got eight people\nAre this is a company out was the only so but\nThere are many things that are and I pretty much are easy you got an issue with your or when a program\nA New York wearing again there is greater than they are they're nothing other serious they\nGot to be I'm lucky I never had a problem with my four one K. and I work for the ... that had a fidelity things like that [laughter] but\nI never had a problem with that but you know what you're saying if I these bus drivers listen to your telling that the money you're entitled to was put in Europe or one day on time and it's there that's what you're saying\nIt's required by law okay\nHi Frank thanks for coming on and it sounds like you're making a little progress and I went over so we'll see what the next time you got to meet you know\nThere's no time to be a better when I was a there are all conversations are offering and who we are the are you from the resolution here in the burden your\nMarket Frank McManus speaks first doing Frank thanks vacation\nIt's like forty one if you're just joining me I Want to go with a story involving Joe ... end of the salt\nA many many years ago and there's an interesting Rhode Island twist to it it really is only in Rhode Island I'll tell you that story next\nYou an accent when in dollars it's coming up in those ... dream of news news [noise] Ninety nine seven and I am six WPRI\nThis report is Raj you buy Monroe must were breaking service cartel scanned in your way\nProbably didn't have my friends have been meeting scheduled for every car in traffic right now she didn't want to change for just fourteen Ninety nine including the infection and I'll and our allies\nLook smaller than a gathering or in large parties for you one hundred and eighty nine in China in ... one resin plane crashing\nThan in any one of one of venue that can handle it off from wedding\nParty in the ... one red light and dark section of renting and an elegant ... second in command gathering to weddings up to wonder if your need again when you are deemed you're offered him have catering to finding a parking\nAnd just really handicap accessible seemed really\nThan called forcing seven Seventy one years ... Seventy one year or visit our trainers dot com the faster\nThe rhythms of George Bush with bills on when we'll be joined Rhode Island harmonic\nReal run well tell me and she conducts musical\nPeople were sensation of the deal\nBy takeover and the white\nTickets were just going\nFor a one to four\nOver twenty some that's improper editor casual rush hour sponsored by a meeting of insurance on the\nWings Rhapsody in blue we'll go we'll see you on hold on\n\nDiabetes high blood pressure anxiety meds everyone's on them if you're a fifty year old male maybe it'd be fee or even with type two diabetes a million dollars of term insurance my only cost you about two hundred bucks a month of\n... life insurance is out there called term provider and speak with big Lu at eight hundred for a one fourteen fifty eight\nWhat their Chevy GMC Honda daycare Toyota and Subaru all have in common they are all in for Steve free own condition at what for Denise religion they're against it that's right over two hundred three on cars all makes all models and incredible prices are going to flood auto John John now\nPakistan and I ... on the Vietnam War memorial but these are more than just means testing than they are ... ... men in the ... visit the Vietnam inland moving long November first mining into high school and I'm just never forget the sacrifices aiming\nFor more information and become ... visit our Facebook page bring the Vietnam long hunting and then\nThe EPA says there are acceptable levels of contaminants that are allowed in your water if your food was acceptable eat contaminated would you eat it so where is the comfort in knowing that acceptable\nContamination are in your water you wouldn't have to worry about this if you had a water filter company filtration system protecting you and your family twenty four seven called the water filter company today at\nFour O. one to nine for twenty four hundred for a free consultation for to visit one or filtered company dot com\nJust got to take some ... ones is prince spaghetti they up in Boston but Wednesday\nIs Jean Val sent the day of the original telling a bakery in Johnson their ears especially mentioned by name too many ... owns a dollar all large cows owns two dollars packed packed with ham and cheese and pepperoni\nTwo dollars until they sold out gene ... dead the original Italian basically what about uh I I I could I could just end it right now\nWhat about the original telling a bakery you can smell the aromas beautiful all along out what happened right across from saint ... home with a pizza chip mini cows on spinach pies breads and rules don't forget about the cake Boston Rhode Island downs nephew Rob downstairs make whatever you want just like TV just like TV drama picture\nJumble sketch he makes it\nAnd now you can use ... eats how about this you know what's original but they're up to date ... each use the up they'll rip blue stuff right to your house and you can ship meeting they make a cross country anywhere forget about sending a salami there boy in the army is twenty Eighteen send the pizza chip\nThe chip at Dartmouth do it the original Italian bake reaching bumped Sandy date today Medi Cal zones too for a buck up large big ... stuffed with nobody want two dollars and as long as they lost eight forty six\nYou aren't any of your first which Rhode Island's anchorman Jean Val is empty\nOh you heard it here today you heard it is today oh boy did with the story was floating around and a slim unless you're living now this thing down story was true will hit a kid back a long time ago back in the seventies Iraq to ... let me check this out [noise]\nSo sure enough I called throw in a job just member yes it's true what happened\nIs that when I was living on ... street in Princeton years ago and I had two neighbors on either side of me\nAnd one neighbor uh the parents want to\nWait for a weekend or a day whatever it is and I have young kids at home\nAnd all of a sudden some of the neighborhood kids came over and they were banging on the door of this neighbor's house trying to get the kids to come out whatever they were doing the banging in banking and making all kinds of commotion it's real is that I was outside and I went over\nAnd I you know was trying to break it up and say come on get outta here you're making a lot of noise typical neighborhood stuff\nThey say one thing led to another maybe words or exchange and I was flailing my hands because I'm a motion and when I talk and I've come on get out of here and he said I inadvertently accidentally kept\nA kid maybe he was twelve Thirteen Years old at the time this was in the mid seventies right true though he estimated was about thirty three years old so he's outside getting rid of the kids come on get outta here make a lot of noise the parents aren't always that uh my arms or fly in and very like tap a kid\nAbout twelve Thirteen Years old okay ... thanks nothing like well the parents that are kids that ... top they took it another way they took it as a whack you hit my kid they went to the police they found the sub charge against trailer he went down turned himself in or went for the book and whatever it is they charge them simple assault\nYou said I wanted to put this thing behind me I pleaded no contest no low contend tree that has no jail time anything like that no sense it was a minor thing\nAnd uh he pleaded he said I you know at the time I wanted to put it behind me I pleaded no contest to a simple assault charge years later the whole thing was expunged which we do in Rhode Island expungement means the court has no record of it anymore goes away it disappears advantages from the court records\nAnd things like that police record but doesn't that us from people's minds they can still call a reporter and say hey I got a little story I Want to tell you about the guy running for governor\nYou know who he you know who he hit I said who who was the kid turns out the kid was George ... other neighbor none other than\nNick ... yellow twelve Thirteen Years old\nWhat auto group once your car any make any model blood pays more than ... around because we're a certified buying center and we'll buy yours even if you don't buy ours log onto our car buyers on Tom", "year": "2018", "show_name": "WPRO Morning News", "city": "Wakefield-Peacedale", "day": "10"}