{"month": "10", "state": "FL", "station": "WMFE", "content": "Hi I'm off on taking all of our president and general manager of maybe point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called the fire with Dr and this is how we do it now have you been to the family\nDoes your support all uninterrupted programming but donating a dollar a day W. M. S. dot org or cold one hundred Seventy five twenty twenty\nNow with unemployment near record lows what does the recovery look like Tibet advantage in the world is often in area I'm Ari Shapiro in Michigan with views of the economy and the midterms this afternoon on all things considered from NPR News [noise]\n[noise] oh\n[noise]\nStray listening this off the noon ad for for all things considered here\nOr not he point seven support for Ninety point seven news comes from site and bacher energy bars a honey Allman snack coated in German chocolate that's a source of fiber in protein and just their gluten free\nSite and back or energy bars are available at food stores or supermarkets throughout central Florida\nNot even seven W. M. F. he FM Orlando Melbourne Daytona Beach [noise]\nA Florida Man is under arrest after suspected mail bombs are sent to high profile Democratic Party figures former presidents and critics of President Trump's just ahead the latest on this investigation in what authorities know so far then later [noise]\nLots of amendments or on your November ballot two of them deal with gambling and job racing how should the state regulator maybe even phase out these industries\nThis is the Florida round up from W ELL are in public media in Miami and W. J. C. T. public broadcasting in Jacksonville I'm Melissa Rhonda Thomas in his office we [noise] you can join the conversation at three o five nine five Eighteen hundred here on the floor to round up we'll be taking your phone calls after the news [noise]\n\nLive from NPR News in Washington I'm Lakshmi saying the Justice Department says one person's in custody in connection with suspicious packages including confirmed letter bombs addressed a prominent Trump critics across the country NPR's Ryan Lucas has more\nA law enforcement official tells NPR the individual was taken into custody in Florida where some of the twelve known suspicious packages were discovered no further details were immediately available on the individual including the suspect a connection to the packages\nTV footage from the town of plantation and South Florida shows officials from the FBI NYPD and other law enforcement agencies put in a blue tarp over a white van at a parking lot to talk of the vehicle away\nThe Justice Department has scheduled a news conference for this afternoon to provide more details on the case Ryan Lucas NPR News Washington\nUnits that says it's working with Mexico to care for the migrant children who are part of the caravan of Central Americans traveling north to the U.S border it says the children need access to health care clean water and general protection on the long Journey Through hot temperatures and rainy weather\nThousands of people make up the caravan many say they're trying to escape poverty and violence in their home countries but it's an surge in what they will encounter if they reach the U.S border the Trump Administration has ordered hundreds more troops to support border patrol\nThey're already more than two thousand members of the national guard at the border\nThe U.S economic growth is still Roebuck is the latest numbers from the Commerce Department reflect that NPR's Camila Domonoske says the economy grew three and a half percent in the third\nQuarter the increase in the real gross domestic product is more or less what economists had expected it shows strong growth driven by consumer spending and government spending\nQuarterly growth was not as high as the blockbuster numbers we saw earlier this year when GDP grew by more than four percent in part that's the cause of changes in international trade as terrorists can still this is a strong showing for the U.S economy the country is on track for the best annual growth since two thousand five\nThese numbers are closely watched as this is the last GDP update before the mid term elections ... NPR News\nThe Turkish prosecutor reportedly is formally requesting the extradition of Eighteen suspects from Saudi Arabia in connection with Jamal ... death earlier this month\nThe U.S base Washington Post columnist she was a critic of the Saudi Government was killed inside the Saudi conflict in Istanbul Saudi crown prince Mohammed bin Salman denies he ordered or had knowledge of cars show jeeze murder but Saudi Arabia's western allies say they find that hard to believe investigators say they suspect\nThat could show gee whiz torture killed and dismembered his remains have not yet been recovered at last check on Wall street the Dow is down three hundred forty two points this is NPR News\nI'm Michelle Martin I'm Kelly McEvers Ari Shapiro your voice when he was under the law for many Chinese cell there\nAnd my name is David Draine co host of MORNING EDITION you know there's something you hear when you turn on public radio it's the sound of voices across the world the sound of information the sound of a nation's listening to Kevin why do you listen\nI literally listen to anything or not in the eye when I'm Talking to friends and family the phrase I've been listening to NPR yesterday and it's something that I find myself repeating over and over and over again I find that diverse in different groups of people are listening to NPR they're getting real news [noise] real information on NPR\nReal new and real information or great Lewis and they're also great reasons to call or go online and you and when you do you make of synthetic stories and voices from around the country possible and best of all you make your own voice heard so called go online and make a contribution to the station\nToday and thank you if you're hearing my voice well then you are a listener the question is are you a member become a member today please help support Ninety point seven W. M. F. you during this silent Dr\nMake financial contribution on line of W. M. F. U. dot org or you can call one eight hundred Seventy five twenty twenty in fact you\nSupport for Ninety point seven news comes from goodwill industries of central Florida goodwill is committed to helping veterans who are homeless unable to find work or feeling lost by providing counseling that enables them to find jobs of he'll goodwill uses donations to fund programs that give people a second chance donation locations and information\nAvailable at goodwill CFL dot org support\nFor NPR comes from NPR stations other contributors include a log Meehan makers have go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more at go to meeting dot com and the listeners who support this NPR station\n[noise]\nWelcome to the floor to round up I'm Melissa rocks in Jacksonville my co host in Miami Tom Hudson is off this week and a Florida Man is under arrest in connection with those suspected mail bombs that were sent to a high profile political figures in the Democratic party and prominent critics of President Trump now\nSo far authorities have confiscated twelve of these devices to more of them today they've been center\nThe bar for Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways Akron care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nOthers were learning at this hour that the men under arrest is in his fifties and lives in ... Florida David ... a reporter for the Miami Herald joins us now with what we know about the investigation so far David thanks so much for being on the floor to round up when a state wide\nGood afternoon how are you\nI'm well thanks thanks for being with us and as we talk about the arrest of a Florida Man in connection with these suspected mail bombs we want your calls and questions from anywhere in the state give us a call right now at three o five nine nine five Eighteen hundred that's three o five nine nine five Eighteen hundred\nOr tweet the show right now at Florida round up\nAll right David so the arrest was made a couple of hours ago I understand what to authorities know so far about the suspect\nWell we're still I'm sure they know a lot more than they disclose so far off but what we do know is that a\nFew days or a man in his fifties lizard aventura Florida he was arrested at an auto parts store ... as bad as being towed I'm Still unclear what is politically digs are\nOff but uh\nBut we do know from our sources that DNA was found on the on the envelopes of the pack is um\nAnd so that she has a criminal history because obviously where the the fly that it's a you know the match at stuff that gets to be able to look for [noise] so that's all we know so far it's delivered food rations\nShoulder or at a press conference they're going to have said you're going to have\nA mid afternoon around three thirty\nYour outlet the Miami Herald has reported that FBI agents with the joint terrorism task force have been questioning this man is that correct\nYes yes she is the big question that the FBI Headquarters and\nAh and yeah we we still don't know the outcome of it but I'm sure we'll also learn more students have to scramble around we have a candidate a of of a challenge but we're still trying to conserve it at a ...\nWell yeah I mean it's actually selling that I my my mind's even goes in that direction as it\nIs really symptomatic of what's going on you or you know I I Am highly educated you know professor I don't I don't like linking the place is a study to find myself going on these\nThese ... but just imagine what's loving the minds of millions of people is the what's going on you know it's either as mentioned ... and ... or conflict and loads of them look but you know\nAnd I take your point I I think people because of where political climate is I think you're right that many Americans are\nSpeculating in all kinds of ways and I I appreciate you sharing your thoughts about that a ... that's wrestling that's Russell in Boca Raton we will have to weigh David as you said you just learn more from the authorities they're going to be giving a news conference in South Florida later on this afternoon meanwhile lots of calls here on the floor to round up\nFast is in Jacksonville he best go ahead\n\nHi Beth are you with us yes can you make [noise] yes go ahead bats how\nYes I'm I'm In we have five I'm used to call the police or the FBI if we received a suspicious half what would make a packet of how could they know the forest [noise]\nYeah that's a great question thanks for that David over by a ... ... what do we know about how these packages were intercepted in what does constitute a suspicious package\n[noise] [noise] um well clearly they they all have similar um they all have similar uh markings after we're on high fond stern or a printed out label so they can look for that um they have a bomb sniffing\nDogs that I'm not a you know that can detect these types of devices so I Know they were doing sweeps last night um and uh so you know they they're sort of a pattern and they're all very similar so you'd have to be able to find them differentiate down from you know the average Amazon package\nAnd you know the postal inspectors I mean that's that that ... that is that if somebody's actors were found out I mean literally ... billion a day that's going through there so it's so it's it's no small task sure and\nNow haven't they've determined that some of these went through New York and some went through a block of Florida is that right\nYes well that that's also walk up to ... um is is basically a store to store what are you still we wouldn't have been post Marc there like wherever started them wouldn't have started Sam\nI'm from the air but they would have ended up there because whether they got returned to whether they I'm uh I'm just went there on on the out found um I think it's a uh\nFor Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nIt's three o five nine nine five Eighteen hundred across the state here on the floor to round up\nAs a suspect is arrested in South Florida in connection with those suspected pipe bombs that were sent to a twelve different figures are all connected with the Democratic party including two former presidents let's go now to Jean in Orlando hey Jane thanks for holding you're on the air now go ahead\nI just want to make a comment I think we have to remember that the president was elected as a minority president electoral college and the majority of Americans did not vote for him\nSo it's encouraged people to come very much one sided for or against the president or or I get ill or the Democratic party and the root cause of tribalism of course\nA hate just you know just regard for that justify every one but I think we have to remember that President was elected in ... elected president to the electoral college and that he's just purging tribalism in our country\nJane thanks a and I I think that is an important point it's certainly on the Democratic side it has a ... it's driving voter turnout in the mid term elections it's driving anger at the president\nIt's also driving Republican supporters to uh be ever more supportive of the President Jimmy Jimmy in Jacksonville oh we've dropped Jimmy let's go back to David over by a\nA with just a minute or two to go before the break David\nA ... you know you hear the emotion and the calls are and as you pointed out the fact that people are following the story so closely as we get right up to the midterms in Florida with this\nHard fought governor's race in this hard fought Senate race both of which are hanging by a knife edge it's so uh unfortunate that an incident like this has ratcheted up the political tension even more in this country\nAs you said it's important it's important for everyone to just take a breath and wait cheap to learn more uh you can you ah share any more about ah what you're going to hopefully learn later this afternoon or from the authorities\n[noise] um well I think that we're going to learn\nThe political leanings of this person and you know it's possible that I'm In one way or the other ... you could just be someone that you know like so discourse sort of anarchists ties I mean I'm I think that's something everyone wants to know um but at the end ah\nYou know it's going to be a criminal act that they're going to want to prosecute it so they don't want to build a good case um and uh and I suspect you know the the the terrorism investigators you're very very good\nUm and you know they've had experience with that experience here in Florida with these types of connections over the years so um I think this will just only make things more divisive um but\nYou know it's going going that way for a long time so\nI don't unfortunately a fortunate yeah wonderful reporting\nBy you and we thank you so much for joining a statewide with this ah just learned information about uh the suspect uh from\nFlorida and he's found David ... with the Washington or rather with the Miami Herald this is a Florida round up more to come including those ballot amendments that smacks [noise]\n\nThis is my viewpoint seven billion movie I'm Schoenberg to look at the forecast for your friday in the middle weekend\nShowers and storms are pretty likely to be as a cold front comes through temperatures going to be in the eighties but to ... to about Seventy and then we have some pretty good changes a cold front makes its way through tonight temperatures we'll be right around ... low temperatures will be over fifty sunny skies Saturday and Sunday\nAnd a cold front going to move Monday Night keeping temperatures in the upper seventies show looks good for the weekend\nSupport for Ninety point seven news comes from the lake wheels museum presenting the forty third annual ... festival this Saturday and Sunday October twenty seven twenty eight on the shores of lake whales this event is open to the public and celebrates the communities history with heritage arts historic tours and other family friendly events more city of like whales dot com\nSupport for Ninety point seven news comes from\nCareer source Florida dedicated to helping business is growing compete Florida flex training grants are available to help quickly trained newly hired employees growing businesses can apply for a quick response training grounds at career source Florida dot com\nHi I'm Jeremy opposite of here and now W. M. F. E. has provided central Florida with more than just the news station is also featured in depth information about the people and cultures around you please consider a gift of a dollar or two a week to help W. M. F. E. the number to call is one eight hundred Seventy five twenty twenty or go on line to W. M. F. E. dot org\nFor decades [noise]\nI'll come back to the floor to round up by Melissa Ross in Jacksonville Tom Hudson is off today well we're going to shift gears a bit here but still remain focused on the November six general election if you live in Florida when you go to vote you will be confronted with twelve ... twelve\nStatewide ballot measures to of which deal with gambling\nNow there's a lot to get into these measures and uh they can be a little confusing all of the amendments frankly but the one involving gambling in dog racing are particularly closely watched\nWere so lucky to be joined by Eric Cirque his hand he covers gaming and other regulated industries for political Florida and he joins us from our sister station W FSU in Tallahassee Eric thanks so much for being with us\nThanks for having me\nNow we're talking about amendments three and amendments Thirteen let's go numerical order and look at amendment three take a listen to this\nFor decades gambling issues were decided by Florida voters\nPoliticians that power for themselves\nAmendment will return the power\nOkay is that true Eric will amend the free return the power to the people when it comes to gambling\nI Wish there was an asteroid what fed up with our commercial larger morning I'm One of the issues that are that are ... in the ballot language other people see when they when they read the ballot on November sex\nUm that it's just a ... or ... immunize the seeds of tribe to tribe a seminal tribal Florida which has the casinos here in the state two of them are going through some major uh renovations to become resorts essentially Vegas style resorts\nUm they don't have to go for this a statewide referendum Bob that amendment three what would require of mutual is if they want to go for\n'em to da da da da da da da da da da da da da and love you know left to fend for themselves with the wolves or something [laughter] so um you know it's it's ... it didn't seem nearly as a ... a stressful as a as a first thought\nYeah and I do know in some at some tracts dogs or had been\nHad been given drugs uh it's certainly a controversial topic as we speak with Eric ... political Florida about these gambling amendments one involving casino gambling one involving dog racing\nAnd if you're just tuning into the Ford around if we're just trying to educate olive you the voters out there about what these amendments would do a and we want to know what voters and colors out there or think\nAbout dog tracks in Florida you know Florida is one of a a minority only a handful of states that is still doing dog racing and due to a cork in the law the dog racing and then the gambling facilities are intertwined we're going to talk a little bit more about that on the show\nAs well and take your calls as we continue talking election stuff here on the floor to round up from Florida public radio\n\nOkay let's go to Cathy and braid into now Hi Cathy go ahead\nHigh on that God let a terrible like Eric they live in cases they are not taken out by um I talked to people who have I got it down I have friends that have adopted them I have friends that worked at her and all\nThat where the dogs are manufactured they'd gotten racing and the dogs are not in good shape and how long it take God out of the rate was ... little stopped using it got mad at at all I've been doing that grassroots went out for a long time this\n... stop ... about ... ... ...\n... what's your campaign tell me about that\nWhere we've been getting out and spend grassroots campaign so we've been doing a pounding the pavement I talking with people and letting them know what Thirteen that's about and what's going on\nUm we were appalled right now with the early voting starting for where I'm at the polls were being our guest is that we're supposed to a hundred feet away but we are trying to educate people\nOn why did he happened to the guy and we really need to stop using them as a commodity it's not healthy they hurt them out there getting killed some are electric cured it\nAt a terrible terrible life ready for a dog\nThat's all right how do you think about but let's take the dogs out\nThanks Kathy Kathy in Bradenton a and you know Eric a rash of celebrities are getting involved have you seen this in amendments search team in Florida Ellen DeGeneres other big names in Hollywood or are urging Floridians to vote yes on amendments Thirteen ... for those that are just too\nYeah oh yeah right right uh but it would what would you is it would see greyhound racing just be discontinued in the state by the year twenty twenty and since eleven of the nation Seventeen greyhound tracks are in Florida naturally the focus of the celebrities is right here on\nFlorida and what are your thoughts about all of the animal rights activists and celebrities that have really a\nGotten involved in this cause\nI I think at the end of the day the philosophy here and I you know I work closely a popular culture with both sides whether it be the the the store to ground association and also great to tell you which is a greyhound a breakdown advocacy group out of a out of Boston\nI'm In actually I just when I just threw them facility in Sanford I called my I called the ... and I told him what I saw and I said it just seems like it was you know just a little one step up like an animal shelter will get a you know public animal shelter and you go to Iraq we doesn't exactly what you wanted to see because\nNow think about that would you want your dog to be living the life and I and that's right there is the is the philosophy and then and there was it was curious as to which I think it's as if\nShe says ... distract you know a lot of the trucks and the state or are probably going to be the same condition but it's it's that working dog condition and you know is the you know hanging out in these changes with love pizza with a remnant of curbing on the floor that I think the dogs I saw you know five or six times a day [noise]\nYou know and I think the great UK wants you know once people to compare that to how they're home pets it's my my dog at home who's a trap and she happened to be a rescue dogs she sits in air conditioning all day and and you know ... to run outside\nYou know I think that's ... Mr deal to do is just kind of what you know dog should be living not kind of life and not not in this working dog um setting but then of course the trainers are saying the dogs love it and the dogs are happy and I did the dogs were happy when I saw them I mean\nI'm a bunch of to um to the woman and breathed into her point I mean a lot of these changes in safety measures were only a implemented a few years ago after um a lot of a lot of pushing from the legislature and also from from\nAdvocacy rights groups and for whatever reason they didn't they didn't want to until they you know we it was only two dozen Thirteen started getting dog death reports in like ... yeah ... one of the one of the printers\nFor Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care\nIncluding nine hospitals ten emergency rooms ten urgent care location in forty six outpatient centers more information is that to Orlando Health dot com calls\nAs we talk about amendments Thirteen up or down on dog racing in the state phasing it out or keeping it we want to hear from you\nAnd we will get to those calls right after the break [noise] [laughter]\nThis is my viewpoint siblings that with you and mostly I'm Schoenberg do you look at the forecast for your fly the weekend showers and storms are pretty likely to be as a cold front comes through\nTemperatures going to be in the eighties to cool off to about Seventy and then we have some pretty good changes a cold so it makes its way through two nights temperatures we'll be right around the eighties low temperatures in the fifties sunny skies Saturday and Sunday\nAnd a cold front gonna move Monday Night keeping temperatures in the upper seventies so looks good for the weekend\nIt's been a full two years since we first run or less intrusive soil fundraising hold the soil withdrawn and this is how we do what now WM every family\nShow your support for I'm interrupted programming donating a dollar a day to the W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty [noise]\nSupport for Ninety seven news comes from aggressive appliances a family owned company that has been selling installing and servicing appliances and central Florida since Nineteen eighty depressive appliances specializes in luxury brands and features galleries of life working kitchens learn more and aggressive appliances dot com\nAggressive appliances a deeper commitment to appliances and the people who doesn't\nSupport for Ninety point seven news comes from the lake wheels museum presenting the forty third annual ... festival this Saturday and Sunday October twenty seventh and twenty eight on the shores of lake whales this event is open to the public and celebrates the communities history with heritage arts historic tours and other family friendly events\nMore city of like whales dot com\n[noise]\nWelcome back to the floor to round up I'm Melissa Ross in Jacksonville my co host Tom Hudson is out this week and lots of calls as we speak with Eric sir kissing a political Florida about gambling and dog racing in the state a couple of amendments that will be on your November ballot\nCertainly people get very intense and emotional about animal rights and the treatment of animals which is why this greyhound racing amendment amendment Thirteen has generated a lot of attention including from quite a few Hollywood celebrities will that make a difference in your vote well let's get to a few of your calls right now\nLots of folks waiting on hold from all across Florida Kyle is in Lakeland, Florida hey Kyle how are you this afternoon go ahead\nI'm doing great how are you OK thing my my comment deals with um [noise] the people opposing Thirteen\nThere's a large community of like dog ... competition people such as like agility rally hurting who believes that the wording in the amendment leads to her any time based competitions in the future might be able to be like stripped um for dogs compete in those even when they're not humane such as like him race auto racing\nOkay thanks for that Eric\nFrom I think that actually the the amendment protects that I think there is one of them is that that are there's one there's one ... dog racing band that comes to mind in Nineteen Ninety six of the Iowa legislature passed a law that would be an old dog in the evening and even ... has to do with the dog they they they banned it\nSo I don't know if you've ever been to a a dash on racial wiener dog race or sometimes they have um security those were banned too so now now as of last year and now the lawmakers are trying to figure out how they can get that back in there it was too expensive\nThis actually as far as I can tell them from the interviews that I've done just would just impact wager greyhound racing in Florida it would affect the loving trucks would we have here in Florida\nUm it gives them the option ... they can stop doing that can stop doing the library says as early as a as a as junior as general two dozen Eighteen or they have until twenty twenty so it's I think it's focused enough so that is not going to impact other areas of uh of you know would dog competitions or some other friends there's there's French of beauty and training and what not\nUm but there are some concerns from like the n._r._a. about how uh some other ... in the in the amendment that might affect other things that people really aren't aware [noise]\nGotcha okay surely in Ocala hello surely what are your thoughts about amendment Thirteen", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Orlando", "day": "26"}