{"month": "10", "state": "FL", "station": "WMFE", "content": "For Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nAge our life and change our schedule is changing his scheduled to be in Pittsburgh today but not everyone wants them there and I'm Ari Shapiro reaction to the president's trip this afternoon on all things considered from NPR News [noise]\nStay listening this afternoon at all for all things considered here or not he point seven\nSupport for Ninety point seven news comes from saint ... one hundred percent begin happy for St ... Eakin happy fruits or is that free Clinton and lactose free smack available in two flavors black current and passion fruit Satan buck or happy friends are available at food stores or supermarket throughout central Florida\nNot even seven W. M. F. E. FM Orlando Melbourne Daytona Beach\nWhen is sanctuaries attack where do you turn\nThere's been a long time off from from the good stuff and we have to remind us also do some of the pain than our previous truly tested guided everywhere\nGot in it and get in that place God as forever our hearts\nHas got to me that this person we wash our hands of being able to stop the next person\nIn the wake of the mass shooting at a Pittsburgh synagogues three people who've experienced violence against their place of worship share how their faith helped them through tragedy I'm tending to Vegas and this is the takeaway also we're hearing from parents how do you talk to your kids about violence in our country\nAnd we just sort of talk about what's going on in people's lives get turned them so long we talk to them about being vigilant about the people that surround you we don't shy away from conversations we don't try to hide what's happening to take away we'll be right back after these headlines [noise]\n\nLive from NPR News in Washington I'm Lakshmi Singh funerals for the victims of the shooting at a Jewish synagogue in Pittsburgh over the weekend or getting underway today NPR's Sarah McCammon reports from Pittsburgh the two youngest victims will be laid to rest after joint surface\nCecil in David Rosen thought were in their fifties and were attending a religious service when they were killed friends say the two who had intellectual disability found a supportive community at the tree of life synagogue rabbi check diamond to once led the congregation remembers that brothers as a constant presence at services in study groups\nLike giving my study group at the end of the Europe say a prayer book was the president and they were carried around with them wherever they want and they're very proud of it they brought a lot of joy or they were full of laws that they really had a um president's community in general the Jewish community and they will be missed by by all of us\nServices for the rest of the victims will be held throughout the week Sarah McCammon NPR News that spark\nAnd well some people say they would support a visit from President Trump others say just the opposite side accusing him of ... messages of hate protesters are preparing for President Trump's visit to Pittsburgh\nThe president says he is considering in order to end the constitutional right to citizenship for babies born in the U.S to parents who are not us citizens NPR's Joel Rose reports Trump has tried to make his immigration crackdown the focus of next week's mid term elections\nTrump made the remarks in an interview with ...\nWith the only country in the world where a person comes in has a baby and the baby is essentially a citizen of the United states for eighty five years with all of those benefits ridiculous it's ridiculous and in fact\nMore than thirty countries around the world offer birthright citizenship\nThe fourteenth amendment to the constitution guarantees the right to citizenship for all children born in the U.S when pressed on whether he can change that Trump says quote there saying I can do it just with an executive order unquote\nThough it's not clear when or if Trump would issue such an order if he does it will certainly spark a legal battle the full interview airs this weekend on ... on HBO Joel Rose NPR News\nIt's nearly midnight in Indonesia with no rest for the many searchers scaring the job is safe for victims of Monday's plane crash ally in an airplane was carrying one hundred eighty nine people when it crashed\nShortly after takeoff so far at least twenty four bodies have been recovered from the waters there remains has been transferred to Jakarta for identification as NPR's Julie McCarthy tells his fish very little hope that anyone could have survived this crash\nIn Jakarta, Indonesia as presidents greeted grieving relatives looking for answers rescue crews worked through the night searching for the wreckage of the Boeing seven thirty seven max eight and updated model of Boeing's widely sold jet the c._e._o. of lying air sort of the new planes are flown only since August had an unspecified technical issue in a previous flights\nThat's NPR's Julie McCarthy reporting this is NPR News\n\nI'm off on taking all of our president and general manager of your station Ninety point seven W. M. F. E. and this is our silence Dr\nSpin a for two years since we first tried this less intrusive style of one reason and this is how we do now W American family fallen drives are no longer the new kid on the block but a tradition we are committed to keep things as long as we raise the money needed to pay for programs you listen to deal with\nYour contribution today helps pay for public radio news programming without the pressure of commercial interests Ninety point seven W him if he is powered\nBy you show your support now for uninterrupted public radio news and programming or making a donation right now for support news that matters as a singer from your bank account for credit card will send you a player Ninety point seven W. M. F. the customs socks how 'bout contributing thirty dollars a month\nYou will become the power behind the news you use you'll make a statement wherever you go together we have come a long way with the silent style the fund raising\nMore programming and less fundraising can only sustain with your participation contributed W. M. F. he's out of work will call one eight hundred Seventy five twenty twenty\nAnd thank you support for Ninety points that news comes from the school in Jacksonville, Florida a place to live and study with students from all over the world and still go home on the weekends information about five and seven day boarding and campus tours is available at ... dot org\nBowls all things possible\nSupport for NPR comes from the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and ... solutions learn more see three I O T dot AI and the ... foundation at ... dot org\nThis is ... W. M. F. E.\nThe forecast calls for dryer temperatures at least for a couple of days we've got the dry season underway our temperatures while they're very nice are going to go up for a couple of degrees you'll see them climate little be seasonable range loaded mid eighties over the next couple of days moisture slowly creeping into Thursday at forty percent chance of rain coverage friday a sixty percent\nBehind that flood drier areas coming our way again for the weekend we'll see highs and the seventies and lots of sunshine for your weekend\nThe bar for Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\n... park and walking in Pittsburgh [noise]\n\nStarts in his room [noise] and they want to address for the moment so my political leaders who are here ladies and gentlemen it has to start with you as our leaders\n[noise]\nOne day after a man stormed into the tree of life synagogue killing eleven worshipers and injuring ... Pittsburgh rabbi Jeffrey Myers addressed a crowd of more nursing\nThe attack in the gunman armed with an A R Fifteen assault rifle had posted anti Semitic messages on social media\nIt has been called the deadliest attack on the Jewish community in us history and it's not the only place of worship that is experienced such harm\nSeems to ... like you you've come to establish the Dutch not supposed to happen assuming garbage was supposed to operate in churches Pence was temple movies or um secret police was sanctuary long rule\nOver the past few years have been a number of deadly shootings at places of worship across the country some motivated by race or religion is I'm not in twenty twelve six people were killed in a shooting at a stick and pencil in Oak Creek Wisconsin\nA white supremacist shot and killed nine people in a historically black church in Charleston South Carolina in twenty Fifteen and nearly one year ago twenty six people were killed in a church and the tiny town of Sutherland Springs Texas but temples ... churches and synagogues are supposed to be white\nLiterally sacred spaces safe places where worshipers are surrounded by family and community members and where they can be at their most vulnerable\nWhen that feeling of safety is ripped away what comes next to\n\nThe search for a path forward for religious communities after an attack this is the takeaway\nThat we become as monsters as the shooter if we demand that retribution Huston it's very difficult to cause I struggle with it but ultimately I have to learn to forgive who's auctions to forgive him if I really hope to grow\nMany corporate as the president to face always wins foundation pretty ... is the author of the gift of our wounds and deacon Kevin McCormick is the principle of the very in high school and Roman Catholic\nDeacon in Long Island Mindy pretty and Kevin thank you all for sharing your experiences and your thought what an artist thank you thank you very much\nThe takeaway is supported by YouTube originals and roadside attraction presenting vibrant lab starring Susan Sarandon as a mother struggling to free her captured journalist son also starting math Omer and eat he found out in theaters friday\nAnd babble European made language learning program babbled teachers practical conversation and Italian Russian Swedish and other languages available in the opposite shore or online at B. A. B. B. E. L. dot com\nFor eleven people were killed in a Pittsburgh synagogue President Trump held a campaign rally\nWe can't live evil change our life and change our schedule\nIs changing his scheduled to be in Pittsburgh today but not everyone wants from there I'm Ari Shapiro reaction to the president's trip this afternoon on all things considered from NPR News [noise]\nStay listening to solve the noon ad for for all things considered here or not he point seven\nSupport for Ninety point seven news comes from the tightest do water resources conservation program\nReminding Titus Stillwater consumers that irrigation is limited to just once a week starting Sunday November for more information on irrigation restrictions is available on the water resources conservation pages at ... dot com\nNot even seven W. M. F. ... FM Orlando Melbourne Daytona Beach\n[noise] missing the take away with hands you know make [noise]\nNow we returned to our coverage of war in Yemen a conflict partially divided by the Saudi Government some eight million Yemen he's currently depend on emergency food aid to survive and un officials say that that number is likely to rise to\nFourteen million which is half of Yemen's population last week the New York times published extensive reporting on the state of the crisis along with unflattering portraits of young children wasting away from\nHunger Declan Walsh with the reporter behind that\nPeace and he joins us now from Cairo where he's the times bureau chief Declan thanks so much for taking the time\nFor Ninety point that the news comes from Orlando Health ... whatever whenever and wherever Orlando Health is dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six patients that tastes more information is that to go into health dot com\n... when a group of grill is called the ... from northern Yemen seize control of the capital and then starts to move across the country seizing more territory and just ... just come to the Saudis who six months later in March twenty Fifteen starts to air strikes a campaign of air strikes\nIn Yemen and effectively setting the war in motion as it stands now\nIn order to find out who these from power decided to see the movies as proxies for Iran because these are she is or they practice a form of shoes them\nBecause they have received some weapons supplies from the Iranians studies have been fighting the war principally by air for the last three years they've already got almost twenty thousand airstrikes against\n... and also economic target in the country and that has brought a great deal of criticism of Saudis because\nHousing of civilians have died and those airstrikes and I may have wrote recently accusations of war crimes on the parts of the United nations against the Saudi led coalition the other part of the Saudi led campaign to oust duties as being a range of\nShooting the to the economic measures that the Saudis have imposed on territory that is controlled by the who the ... in an effort to\nUh it offensively in an effort to isolate them but we just had the effect of really falling very heavily on the country's ... million population because those same\nMeasures have objectively contribution to crushing the economy and that's what we've seen in the last couple of months the collapse of the country of Yemen already very fragile economy\nYou're reporting I'm In the New York times was accompanied by some pretty devastating photos taken by Tyler Hicks I'm probably get the New York times of young Yemeni children on the brink of death by starvation can you give us a sense of how and why that decision was made to include those photos and the reporting\nWell we're certainly some of the most shocking pulled it I think at the time says used in recent years on the decision to use them was not taken lightly and reporters have said often is now we tend to\nErr on the side of caution and publishing very graphic pictures but there were a couple of very compelling reasons and to to publish these pictures and the one I think was that these photographs constitute a very shocking reminder of the time and has no new\nDifferent consciousness there's an idea the bomb it or something that happened in the Nineteen eighties in Ethiopia or perhaps\nA in places like Somalia in two thousand and eleven and these are really a reminder that in in this day and age a very severe starvation is reality in Yemen and the second factor which I think was probably the most compelling one is that this is very much ... this is not about potential your mom make bomb and\nThis is not a humanitarian catastrophe that as a result of a natural disaster or of a naturally occurring shortage of food in these areas\nOn the country when we were travelling through Yemen and in many of the times we visited the store is full of food the problem is that nobody are very few people can afford to buy it because the country's economy has the devastation of the economic devastation is a direct\nProduct of the way that the war has been waged largely by Saudi\nSaudi led coalition some of the decision they have taken by withholding reads from a million civil servants in government controlled and who'd be controlled areas have not an absolutely devastating effect on the local economy as well as the plunge into the value of Yemeni currency at\nThose kind of decisions have meant that people have far less money than before and the money they have is worth Spock\nOr that I'm for people who are already living on the brink this has nothing to push the edge\nAnd I was going to say was talking to Declan Walsh of the New York times and he's joining us from Skype in Cairo Declan what is the international community's response to this and what is has it been so far and has it been sufficient because to say that there is food and yet there's this famine happening it just seems devastatingly cruel\nWell over the last uh over this summer the international community response has focused largely on the effort by the Saudi led coalition to capture a poor it's called the data\nThat's the gateway for about three quarters of international humanitarian aid the entrance Yemen so a lot of the concern has focused on ensuring pressuring the competition that fighting should not reached a port\nAnd stop the supply reaching the country but increasingly now because of the nature of this bomb or the\nThreatened to bombing and the problem with the cops the economy a lot of stress now he's on trying to pressure the parties to impose measures that would allow the economy to repair\nItself somehow and give him any chance to buy the food that they need to stay above starvation\nDeclan Walsh is the New York times bureau chief in Cairo and there's a link to his reporting on Yemen at the takeaway dot org Declan thank you so much\nMy pleasure [noise]\nFollowing this weekend's deadly shooting at the tree of life synagogue in Pittsburgh we're still hearing from view Howard's new processing the shooting and do you feel like hated on the rise in our country\nI think Chris I'm calling from Florida\nAnd yeah I think hate us on the rise because we have an erotic emotional president that loves drama and and media that's always used the if it bleeds it leads thought process and that kind of people getting swayed and excited by it so yeah it's getting down\nHello my name is ... and I'm calling from ... California [noise]\nAnd I do believe that have gone awry\nHowever as a yoga teacher I'm inviting my students to continue to live with an open heart\nPractice tangle for compassion in our affairs and to invoke forgiveness love an abundance towards all being even those who would hate are far less otherwise our feelings increase anger and there will ever well I have to believe that eventually sanity will be restored\nHi this is living from ... North Carolina there has always than hate so we have to rise above that and be the best person they can be\nIt has to love our neighbor support our families and look out for each other we also have to teach and show our children how to respect others and how to be responsible citizens\nThanks so much for calling in you can always leave us a message at eight seven seven eight might take I cantina Vegas and this has to take away [noise]\nTo portray the takeaway comes from babble European made language learning program battled teachers practical conversation in Spanish and French German and other languages\nAvailable in the app store or online at a VA B B. E. L. dot com\nThe pro ballot measure one crowd has raised a little over one million dollars but because there's no public polling on this I really don't have a clear sense whether all that money that the people who are against the initiative have raised\nWhat impact that will have at the ballot box it's it's hard to tell at this point\n... Elizabeth ... a reporter with Alaska Public media and laughed as energy death thing from a from his thank you [noise]\nFourth of the takeaway comes from babble language out the teacher's real life conversations in a new language\nLike Spanish French or German battles ten to Fifteen minute lessons are available in the app store or online at babble B a B B. E. L. dot com\n\n[noise] you are listening to that takes away from WNYC NPR I've public radio international collaboration with ... radio in ... and [noise]\nIn two thousand and four hurricane Ivan bowled over an oil rig belonging to tailor energy setting off a massive oil spill on the coast of Louisiana that's been growing steadily for fourteen years everyday the scientist and feeling between three hundred seven hundred barrels of oil into the Gulf of Mexico\nTaylor Energy has cleaned up some of the mass but they've also been suing the government to avoid a full\nClean up on the site and if the spill is not\nStop soon it's on track to become one of the worst in us history Michael ... is a reporter with the Associated Press and he's been reporting on the Taylor oil spill for years Michael thanks for joining us\n... to this spill started in two thousand and four and it's now back in the news because the Justice Department had an independent analysis about this tell us about that what did they find\nWell they found that the weak appears to be a much worse than either the company or the government itself has been saying for many years the latest estimates which were put together by independent researcher from Florida found that between ten thousand thirty thousand gallons of oil is leaking daily\nFrom multiple wells around a platform that toppled over during hurricane Ivan in two thousand and four\nAnd the reason why this is an issue now after all these many years is that your energy company based in New Orleans that doesn't have the assets anymore is essentially only exist to fight the spill is trying to recover hundreds of millions of dollars that it set aside years ago to try to end this leak they want the money back\nThe government says no you need to do more to finish what you started here down below the surface and the Gulf\nObviously there's a money issue here but what is it about this bill that why is it taking so long for this to stop this looks like it's an environmental disaster that's been going on in our own backyard\nWell hadn't gotten a lot of attention until recently that that's true the company's position is that basically look this is not any different than the natural seeps that occur out there out in the Gulf of Mexico that are harmless that's their position\nIs are they right about that though\nWhile I mean that's I think that's open to debate certainly end of the government's position is very different that that does pose a potential threat to the environment and that they have to go out there and do it they can the problem is\nIs that when that hurricane rolled through and knocked over\nThe uh drilling platform it also buried the underground wells under mountains of a settlement that they cannot go in simply dredge without risking somebody's life that's the company and with the company says no company did kill some of the well they said but\nThey said there's nothing more can be done without causing tension greater risk if they go in there and they\nPick the sediment away could make the week even worse possibly so there's some there's very little degree and it seems like between the government\nAnd the company about what needs to be done next but the government believes that something can be done and they I Believe are going to order the company to do something else on their below the surface I'm\nJust wondering the Taylor oil ... back in the news but its rivaling this BP oil spill in twenty ten I Can't forget the images of the BP oil spill anywhere like on loop and I'm Wondering how this is affecting the environment differently than the BP oil spill didn't twelve ten\nAnd twenty bend the BP oil spill as we all remember we were kind of transfixed by images of this billowing wave of crude oil coming out of the bottom of the sea for ... it was coming out all at once you know over the period of grad I Believe three months or so but\nThat massive amount of oil came out all at once and that has you know oil birds on the seashore and it created an environmental catastrophe and in this case this has been a slow motion environmental problem with a tailor energies it's seeped out slowly and\nI'm not a scientist but I've been told that the damage and the effect is far less serious what is staggered out in the oil can be weathered by waves and water and it doesn't have quite the same impact also the company has said that there is no evidence\nThat this oil from the tail ... is reaching shores about twelve miles off the coast of Louisiana and these flicks stretch for miles every day or almost every day\nDon't flex also have an impact on the environment whether we can feed them or not I mean who's supposed to make sure that this is an environmentalist\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and how we do we now have you been to the family\nDoes your support all uninterrupted programming donating a dollar a day W. M. S. dot org or cold one hundred Seventy five twenty twenty\nDamage and then the government says differently that there's at least the potential for damage to the ecology out there you know as much oil and birds on the shore there's ... there's other marine life out there that could be affected by these persistent and chronic weeks\nSo we know the Taylor Energy is suing the federal government what else are they doing we understand that one of the former owners we do is a prominent philanthropist in Louisiana\nYeah so the sailor name or his best known probably in Louisiana for a program called tops the tea and top switches financed free college tuition for many families over the years that this is a couple [noise]\nThe methods of their own said busted a lot of money in um helping other people millions of dollars in flattery work was Stiller or his widow is also a very influential political figure donor too many congressmen and senators and she had hired\nLawyers or to lobby on Capitol Hill to try to get the company a break so it's still a flight to ongoing both in court and also a separately the company tried to petition or somewhat obscure government agency\nTo give it a relief from this long standing orders that it had to do more\nDown below the street for in terms of growing or intervention well to try to kill underground well so there's two front but primarily it's become is about money and about how much more than you spend ... be able to spend down below the surface\nMichael ... is a reporter with the Associated Press Michael thanks for joining us for having me for\nReached out with scientists working around the Gulf about the Taylor oil spill bird and ask for a marine geologist at the University of southern Missouri told us that he thinks sailor energy should not have to clean up the site\nThat they should fund scientific research to study the leak there about twenty oil blowout and federal and state waters every year professor at first as a scientist can use the Taylor oil spill to examine the impact of the oil how the sea floor community response to it\nHow it interacts with plankton and how oil is transported from the surface floor\nProfessor asked for also said some scientists have requested intentional releases of oil basically creating a bill in the Gulf to study these effects but the Taylor psych could be a good compromise\nWhat do you think about solutions like this join the conversation on our Facebook page or tweet us ...\n\nMore for the takeaway comes from babble European made language learning program level teachers practical conversation and Italian Russia Swedish and other languages available maps or or online at B. A. B. B. E. L. dot com\nAnd buy YouTube originals roadside attraction presenting diaper club during Susan Sarandon as a mother struggling to free her captured journalists time also starting math Omer and eat he found out in theaters friday\n\nTwo hours after eleven people were killed in a Pittsburgh synagogue President Trump held a campaign rally\nWeekend led evils change our life and change our schedule\nIs changing his scheduled to be in Pittsburgh today but not everyone wants to embarrass I'm Ari Shapiro reaction to the president's trip this afternoon on all things considered from NPR News [noise]\nStarted listening to solve the noon ads for for all things considered here or not he point seven\nNinety eight point seven W him if he is here for you date you and be out you can be here for Ninety point seven W. M. F. ... in the same weight support news that matters with your own going monthly get from your checking account or credit card\nThank you for joining us for friends talking face with the three like guys I'm Nicole ... one minute before seven o'clock station for fresh air that's coming up next\nYou're listening to Ninety point seven capital you ... the ... from Orlando Melbourne in Daytona Beach\nSupport for Ninety point seven news comes from Florida Hospital where they are committed to a whole new way of health care on January second Florida Hospital will become known is at the end health\nWith a belief that health care should be built around your life easier to navigate and more personal it's the advent way of caring for you learn more at at the health dot com\nHi this is John bus decker to me Ninety point seven W. M. F. E. is what public radio is all about solid reporting on issues that affect central Florida\nI dare to listen and support the station because local matters joined me as a member during this silent Dr ... hundred Seventy five twenty twenty or visit W. M. F. E. dot org\nFrom WHYY in Philadelphia and Terry Gross the fresh air can age Jonah Hill co star a superb as money ball and the wolf of Wall Street\nHe wrote and directed the new sound mid nineties about a group of skate boarders in the mid nineties that's the period when Jonah Hill was skateboarding but he says he has never great\nBecause to be ready to skate boarding you have to be willing to slam on your face down stairs on concrete over and over and over and over and\nWriting and directing had always been his ambition to be taught to acting after taking an acting class in which he was told he was really good I compliment can reroute you for sixteen years\nYou find the right complement for the right\nFor Ninety point at a news comes from Orlando how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care\nIncluding nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com lead to the civil rights movement [noise]\nFirst news\nLive from NPR News in Washington I'm jak sphere brothers Cecil and David Rosenthal where you live ... in Pittsburgh today as part of the fabric of the local Jewish community\nThere'll be YDF Katie my reports the two men who had developmental disabilities were killed in the shooting Saturday loved tree of life synagogue\nWouldn't coffins were loaded into a hearse mourners crowded around and you can\nThink\n... is David ... helping set up\nAll he had to do was lead services their friend Bob Goldstein says it was seized those custom to lag it's thinker and tell people you better go to services\nWe're taking a cough and I I gave him when he gets me all the time\nYou better voters services not some interviewed member of\nFamily and friends say David Was quieter industrious worker fascinated by police I'll see so visible in politician who want it to be involved with everything rabbi Myers thanked brothers parents for sharing them with the community services he said won't be the same for NPR News I'm Katie my hair in Pittsburgh\nPresident Trump says he wants to and automatic birthright citizenship for babies born immigrants not authorized to be in the U.S does call for the Justice Department to look at the idea from made the call during an interview with Axios news on HBO and says he's considering signing an executive order\nWe're the only country in the world where a person comes in and has a baby and the baby is essentially a citizen of the United states for eighty five years with all of those benefits to ridicule us it's ridiculous and\nActually it turns out that is not true more than thirty countries worldwide offered birthright citizenship while experts are questioning Trump's legal authority to limit what is currently a constitutional guarantee with output consent of Congress\nNotorious Boston gangster James Whitey Bolger was found dead this morning in federal prison in West Virginia Dave Mistich of West Virginia Public broadcasting reports on official for a union representing prison guards says Bolger was killed\nThe U.S heroes prisons says Bolger was unresponsive at eight twenty in the morning Richard ... is president of the American federation of government employees local for twenty ... an apparent homicide based on information from responding guards\nThe FBI was notified in an investigation has been initiated the eighty nine year old had been transferred to the ... century near Morgantown West Virginia the day before his death he was serving a life sentence for racketeering money laundering possession of unregistered machine guns and other convictions\nThe mob boss turned FBI informant has been sixteen years on the lam before police caught up with him in two thousand eleven for NPR News I'm Dave missed itch in Morgantown West Virginia\nConsumers up here the more confident this month the conference boys as a consumer confidence index rose more than two points on Wall street stocks jumped that I was up four hundred and thirty one points today you're listening to NPR\nJournalists across the country covered local news and all those stories about your city's culture town hall and changes in your community there are all connected I'm Jeremy Hobson and local journalism means going into your neighborhoods schools and barber shops to talk to you\nWhen you link all those stories together you get a vivid picture of our country its people and the challenges we face take for an example education\nSchools across to Oklahoma had been closed for nine days and\nIn North Carolina thousands of teachers are expected to march on a state\nCatchers in Arizona are headed back to their classrooms today after six days of protests at the state Capitol in Phoenix\nYou can hear the bigger picture when you listen to NPR and when you give each month you help support local stories that unite our country keep the stories that connect our country coming become a sustaining member now\nAnd you can do that by calling one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG your generous supportive a dollar a day during this violent Dr make sure the reliable need to know information on that point seven WMA free\nStains exactly where you expected to be please call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot orange and once again one eight hundred Seventy five twenty twenty and things\nSupport for Ninety point seven news comes from Westminster towers as senior living community in downtown or land now offering maintenance free living with services including dining housekeeping twenty four hours security and transportation\nThe community offers active living as well as assisted living in skilled nursing care available when needed more at Westminster towers Estelle ...\nSupport for NPR comes from NPR stations\nContributors include logged me in majors or go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more I'd go to meeting dot com and the ... foundation\nWho are listening to Ninety point seven news I'm Nicole dark and crashed and and you forecast mostly clear skies through this evening with no showers expected overnight lows in the upper sixties for tomorrow mostly sunny day this guy's remaining clear and afternoon hides in the mid to upper eighties\nOvernight lows back in the mid to upper sixties under rain freeze guys that are expected for any trick or treating it might be taking place\nA twenty percent chance of rain on Thursday climbs to higher than fifty percent for friday\nThis is fresh air and Terry Gross my guess Jonah Hill became famous for playing a high school student and the comedy super bad that was just one of his comedy films along with a forty year old virgin knocked up and funny people that was produced and or directed by John ...\nHill received after nominations for best supporting actor for his dramatic roles and money ball and the wolf of Wall Street this year he co starred in the ... film don't worry he won't get fined foot and he starts with Emma Stone in the Netflix series maniac\nJonah Hill just made us directing debut with the new film mid nineties which he also wrote it's about a subculture skate boarders in the mid Nineteen nineties the period when Jonah Hill was a self described not great skate border but hung out with a group of much better skate boarders\nThe film isn't autobiographical but it draws on his memories\nThe famous told from the point of view of a boy played by the eleven year old son ...\nWho wants to be a skateboard and be accepted by the older skaters he admires\nThe take life threatening risks with skate tricks and stunts and spend the rest of their time smoking drinking and trash talking the skaters I played by pros but the skaters they play are unlikely to get anywhere they have no money no connections\nJonah Hill welcome to fresh air congratulations on a movie when did skateboarding mean to you when you were in your teens\nNo ambassador for skateboarding and skateboarding so sensitive to being portrayed in film by outsiders and that's understandable because it's often for church but when I was maybe nine or so\nThe bar for Ninety point at a news comes from Orlando how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nBoom and I think a lens that I ended up seeing a lot of life through which is you know taste in music close um treatment of authority and just a sense of perverse closeness I Know it just made an imprint on me\nSo I'm the group uh skaters who you were friends with our aspired to be friends with what was that culture like\nAnd watch skateboarding is a natural draw to someone who takes hits whether inflicted from someone else or themselves\nWhy do you think it's a natural draw for somebody in that position\nBecause to be graded skateboarding you have to be willing to slam on your face downtime stairs on concrete over and over and over and over and over again and there's something\nPunishing about that in self punishing about that and there's a\nGreat reward that is true we earned even if it's just for you where are you willing to do that when you wanted to skate\nVery briefly in a time where I think I invited pain but I quickly grew out of inviting physical pain in my life\nAnd more emotional [laughter]\nGood for you [laughter]\nYeah I'm\nI'm cars aren't age cars are inside [laughter] I started ... yeah and just a general recklessness which are related to when I related to this kid's loneliness and so even though this is it my story I wanted to show someone going through deep\nPain and a real sense of hope through community even if that community has deep flaws to it like small mindedness prejudice massage any\nThat for this kid it's still provided something hopeful and perhaps these young men will grow up and on learn some of this stuff\nWould you have a dream of getting on a skateboard now\n[noise] ah yeah I Dream about it every night I honestly Terry when I tell you I Would trade a lot in my life to be able to do certain tricks\nRight okay I shouldn't use or dream would you unreality [laughter] ever considered an escape are now\nI landed a kick foot in front of our cast and crew in order just a out of being so excited and exhilarating by everyone skating but be to just prove that this is something that at one point was a massive part of my life\nLet's take a short break here and then we'll talk some more if you're just joining us my guest is Jonah Hill and he's just written and directed his first film and it's called mid nineties and as you can tell from our conversation\nIt's said among a group of skate boarders in the mid Nineteen nineties we'll be right back and we'll talk about some of the films he starred in\nAfter the break this is fresh air\nNinety point seven bills you ever ridden capital steps back in twenty ninth gee this hilarious show will be coming to really be put on Thursday February twenty puts them\nShow your support by one drive and get your tickets to the\nBusiest W. M. F. E. dot ORG for coal one eight hundred seven eight five twenty twenty [noise]\n\nThis is fresh air and if you're just joining us my guess is Jonah Hill and he's known for starring in movies like Superbad money ball and the wolf of Wall Street\nI Want to ask you again about all The Simpsons scripts that you wrote when you're a kid did you ever try submitting one of them\nI Know I wrote letters to the writers and I never heard back but I never tried submitting then would you be willing\nTo share a story line or a joke from one of your early ...\nHere's what I'll say I think the strongest episode was I was in a file since a young age and my parents were incredibly ah\nLet's just say how would I put it they encouraged me or let me watch movies beyond my age because they saw how interested I was in film\nSo perhaps ignore the content matter if certain so [laughter] but I maybe should have waited to see till I was older so I had seen the godfather to really young age because my dad's favorite movie and\nI wrote The Simpsons godfather spoof\nWhen I was probably like nine or ten that I think is uh\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called the fine with Dr and this is how we do it now that you've been happy family\nDoes your support for uninterrupted programming but donating a dollar a day the W. M. S. dot org or cold one hundred Seventy five twenty twenty\nEver for a nine year old [laughter]\nWho was\nMarge was Don Corleone [laughter] because of nine year old I was like Marge is so much smarter and quietly smarter than Homer\nSo she would be the chess player sort of quiet low key chess player that would become the Don no excuse me she's Michael\nSallah OK okay barges Michael a grandpa Simpson is is Don he dies right away though so Marge is Michael wait at home or fan\nNo Homer see that would be that would make margin Homer siblings so even in my nine year old mind I knew that was not going to work so Homer is a K [laughter]\nI'd like to ask Diane Keaton vice [laughter] where are you gonna go legit you know [laughter] but ah Lenny and Carl homers friends from work were when he was afraid to do and Carl was sunny\nAnd I don't know I mean it's not actually clever but for a nine year old I was like wow it's interesting that you have the M fishing or the or or even I guess the wherewithal to know who would be the character equivalent of who I just\nThink about story and character in that way and to make connections between things that I think that's pretty great what are some of the movies that were beyond your age as a kid that your parents let you watch because you love movies so much\nI'll tell you a story that I I find interesting because\nI mean I saw everything I devoured film I continue to I Love it so I'd ran through so many films and I would go to the newsstand and you know your parents take you to the magazine than when you're a kid and you flip through magazines or if there's a magazine she on the corner and they're out another place or something\nI Would look through the film magazines I was just so interested so I Would ask them often can I see this film can I say this I mean most of the time they say yes or basically came down to two films that I wasn't allowed to see [noise]\nUm they said we're so mean you you don't even realize how lucky you are you cannot see kids and you cannot see a clockwork orange well\nKids is all about kids similar to the kids in your movie\nAnd if you're a seminal movie in my life kids with a huge influence on me as a filmmaker but this film is in the opposite of kids were kids is so beautiful and it's ... and it's the world ending tomorrow burned in the world down\nAnd this film mid nineties is all about connection and hope\nEven if it's dysfunctional connection and hope and\nThose are the two movies I wasn't allowed to see so of course I made it my mission to see both of them right away I think I was eleven or twelve how did you do it um a friend of mine who ... who was older had both cassettes at his house\nAnd I saw kids and I was like I Love skateboarding I Love New York this is about kids skateboarding in New York I completely was too young to understand the AIDS subplot or main plot I guess\nAnd so I completely wasn't affected by that so I was just like this is the greatest movie I've ever seen in my life it wasn't till I was older that I understood\nThe HIV aids plot Marta ... couldn't win over my head so I just took wow this is subversive and this is dangerous you know [noise]\nAnd then I saw a clockwork orange and I had to go to my parents like a shell of a child and be like you are right I saw it [laughter] he just her and her and I need to talk to [laughter] I was like\nYou know like a ... and what he was tell them that I just obey them but I was too shook up not to speak to him about what I had seen what's your view of the most about the film\nI think the raping ultra violent was just too of course it was to have you show so hard to watch it as an adult let alone a kid what are your parents say to reassure you [noise]\nWell first of all they were like you should listen to us because we're telling you this do for a reason yeah and then of course did it for many many years and realize they were trying their best\nI think ultimately it did make me braver as an artist in life because I Do think about that and I think ultimately there's something about me that draws me two\nThings that are difficult and maybe I'm uncomfortable with comfort and I think my acting career says that when I really dissect it as well\nMy guest is Jonah Hill he wrote and directed the new film mid nineties about a group of skate boarders in the mid Nineteen nineties we'll talk more after a break\nAnd marine car again will review a new book about Emmett Till a fourteen year old African American whose murder in Nineteen fifty five in Mississippi galvanized the civil rights movement\nI'm Terry Gross and this is fresh air [noise]\nKnew about our family foundation supports WHYY is fresh air and commitment to sharing ideas and encouraging meaningful conversation [noise] support for NPR comes from this station [noise]\nThis is fresh air and if you're just joining us my guess is Jonah Hill you know him as an actor but now he's a screenwriter and director in this directorial debut is called mid nineties and set among a group of teen skate boarders in the mid nineties\n[noise] you know it's been interesting to like first do you kind of like I'm coming to manhood on screen 'cause she was started in your teens I'm super bad you a lot in your early twenties\nYeah and and now and like in the past I don't know a bunch of years five six seven years\nYou've got to play more dramatic roles you know in films like will for Wall Street and Moneyball how did you get the word out\nTo film directors that you were interested in making the transition to more dramatically [noise]\nIt's just by choices\nYou know um I had seen the puffy chair which I loved and I reached out to the ... brothers after super bad came out I was like I Would love to work with you\nAnd they gave me this part and Cyrus which is a film that I Love is that um was a great experience with John ... who told me\nAnd then in ... and then Bennett Miller was making money ball and Catherine had talked about me to ban it and then then it's off Cyrus and Kashmir money ball\nAnd then in the interim ah\nI continue to do some comedy films that were funny and fun\nAnd then uh\nI had heard about the wolf of Wall Street and I asked you audition\nAnd um\nI knew that was going to fight to get that part but I I knew I wanted that part really badly and then when I wanted to write and direct I think I had\nA lot of opportunities to do that if I wanted to make a mainstream comedy\nUh\nAnd when I really thought about it I was like wow things in my life are happening that are intense and am I going to be happy\nJust doing what is expected of me or what my heart really want so I have to figure out who I Am I have to figure out how to love who I Am\nAnd I have to figure out what my voice is as a filmmaker and when I looked to my heroes like Mike Nichols or Barry lemons younger people that started out in comedy and ended up having great filmmaking careers\nI looked at their first films and a lot of times they came from a really personal place and they weren't just funny they were they felt like life and they felt like all the pain and joy of life\n[noise] why don't you hear a\nScene from a Wolf of Wall Street which was directed by Martin Scorsese\nAnd written by parents\nWinter who was also the show runner for the HBO series Boardwalk Empire\nAnd so this this this is a movie that I'm a based on the story of Jordan Bell Ford who was a corrupt stockbroker who made his fortune in penny stocks schemes\nAnd eventually went to jail for for fraud and in this scene Jordan played by Leonard Leonardo DiCaprio is in a diner and he was approached by Donny Adolf played by you\nWho eventually becomes a business partner but this is their first meeting\nUm so you start the scene [noise]\nAnd I try\nThe bill for them to actually I guess you call around\nOn the other thing I think we live in\nTwelfth floor for your for civil affairs are real lives right was it [laughter]\n[noise] ...\nJones Russia you summarize [noise] there's a lot of money\nYou know do a wreck for myself I'm trying to put it together from Mexico and build on December\nUnderstand how much money [noise]\nOn us Seventy thousand last month [noise]\nI'm Serious\nAnd unfair to see how much money [noise]\nFor told you so many thousands of technically Seventy two thousand [noise]\n\nYou show me a taste for Seventy two thousand dollars on like what my job right now and I worked for you [noise]\n\nEverything's fine and it was when I quit\nAnd he he quit his job was a little weird I mean I just met the\nGets officers as a visitor while the things about him to like phosphorus and white life I got to deal with your wife back the storms with Cleveland is just to look more wash\n[laughter] okay so this is seen as Leonardo DiCaprio and my guess Jonah Hill from\nThe wolf of Wall Street um what did you learn from working with Martin Scorsese on ... street\nI see so many things I guess the main lesson I learned was that it's okay not to judge or characters to just show their behavior as people\nAnd the characters in his films often do really ugly things\nAnd you still find humanity in there\nAnd I like how unabashedly\nAn unapologetically she shows human behavior for better or worse\nWhich is something you've tried to do and you're in a movie\nWhich is I think something that really speaks to me in art in general and something I'm going to strive to do if I'm lucky enough to get to make another film and something that I tried to do in mid nineties\nIf we don't want to be back to The Simpsons I mean our kind of you as a terrible father ... light it terrible father [laughter] you can be viewed what he audio is really loving big hearted person right so you know it's like I guess I'm interested in the gray area\nSo this weekend this Saturday you're going to host Saturday Night live November third\nSo I'm going to play an excerpt of a Saturday Night live sketch that you when you hosted in twenty fourteen and it's the sketch that most to me by surprise and when I say me I mean me personally so you played a six year old who's with stepmother\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fire with Dr this how we do it now that you've been happy family\nDo you support uninterrupted programming but donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nAnd has played by NASA bear and she's trying to make you stop [noise]\nInappropriate inappropriate listening to NPR over my nightmares will take place in Syria and Terry Gross [noise]\nMaybe we're not going to train whistle every one of them [laughter] [noise]\nOkay say [laughter] I was shocked and in light of the name check unless you know [laughter]\nThere's so many layers to why that is humorous through here at this moment is so funny um I think the idea of a little kid who behaves like an old insult comic the whole thing was like\nHe like an old man but he's still a little kid so the fact that he has to listen to NPR it's incredibly boring to a kid even though he's so aware to talk about the show with such detail and understanding\nBut that actually that character came about years and years ago I did the first time this is my fifth time and I guess I hosted first for Uber bats are probably like twenty three or something\n[noise] um\nAnd I was at dinner a few weeks before randomly with with um bill Hader and Eddie Sandberg and I think ... oh Seth Meyers is there\nAnd a bill Hader and told a story about a go into a Benny hard on his home town and there was a kid who he couldn't tell whether the kid was like six or like forty [laughter] and\nWhen the when the chef did his trick the kid lean back in clapped his one hand against the table almost like Tony Soprano style I think I just started\nDoing the kid is if you were like an old Catskills comedian and then that's where when I got there a few weeks later we were like oh we should try that as a sketch and then we ended up doing it a bunch of times\n[noise] well ... thank you so much for coming on the show it's been great to talk with you\nThank you to\nJonah Hill wrote and directed the new film mid nineties\nAfter we take a short break marine card in will review a new book that and it tell a fourteen year old African American who was murdered in Mississippi in Nineteen fifty five the outrage that followed became a catalyst in the civil rights movement this is Russia", "show_name": "Fresh Air (NPR)", "year": "2018", "city": "Orlando", "day": "30"}