[{"month": "10", "state": "NY", "station": "WAMC", "content": "Go peek strings East Hampton in Massachusetts specializing repair and restoration as well as the purchasing sale a vintage string instruments including electric and acoustic guitars and violins Seventy five years combined experience go peek strings dot com\nYou\n\n\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W are you any ... W am cage the Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC NHCD Ninety three three candidates Harry W. A. N. C. H. D. one oh three\nNights high kinda Rogan WAMC wage do you want to buy one great Barrington W W E S H ... kids go W. A. N. D. H. D. Ninety point one Stanford W ANR eighty five\nBrewster and WAMC am fourteen hundred Albany\n[noise]\n[noise] [noise]\n[noise] [noise]\n\nStreaming support for WAMC comes from Albany med now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\n[noise]\nBut I don't\n\n\n\n\nKnow and welcome once more to the gym Coakley judge show you have a whole bunch of new CDs to play for you tonight\nStarting off with Trump Buddhist Marshall ... and the WD are Big Bend this has been out of cologne in Germany where was recorded and this is his arrangement you know it's like the re harmonize version of a Greek tune called easy to love\n\nStreaming support for WAMC comes from Albany med now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\n\n\n\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nMm\n\nThis can't be love because I'm so well no no no no real time\nThis can't be love I get no legal\nOr not and and just hearing me\nTo become not\n\nStreaming support for WAMC comes from Albany ... now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\n[laughter]\n\n\nS John Schofield on guitar from the new album called combo sixty six mature Clinton at the piano to shut the archer on basic bills Stewart on drums John colds that one gang swing sons were little combo sixty six to me but\nHe was letting group from Boston called el echo your joined here by trumpeter Claudia ... for competition called not bossa nova ...\n[noise]\n\n\nStreaming support for WAMC comes from Albany met now will win the match for each family children's emergency Center for ill and injured children more information at AMC dot edu\n\nStreaming support for WAMC comes from Albany med that will open the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\n\nThat's clothing over ... to get started with the group el echo record over in Boston the album is called two worlds and that was called bossa nova gay Claudio here's a quick look at the uh jazz calendar and the capital region tomorrow morning a group called ultra facts will be doing a workshop\nAt the center at the springs street gallery in Saratoga and then later in the afternoon it around one o'clock there'll be doing a country with a ... a toga\nAlso tomorrow morning Janine ... Kirk will be doing a she'll be Bruce ... evening it moves on house Joe ... people's pope\nAnd jazz about town as part of the Pittsfield jazz city jazz festival jokes aren't you know does the brunch tomorrow morning and prime it Saratoga national and how ... or ... trio will be at salt and char\nOn Monday afternoon Tim Wilson will be leading the second of his jazz history programs at Union College studying in about one fifty in the afternoon he promises a sixteen piece Big Bend to demonstrate swing that afternoon\nAnd Tuesday night Chuck land will be leading a trio at caffeine in it was a great vibe or phone us Joel luck on hand\nOn Wednesday the royal eleven men a gun jazz trio will be entering ... John is busy don't Pete to legal will be at the blue plate the handled in St jazz company in ... Seventy two hot tub of Saratoga trail will be a hamlet ghost and Joe ... will be at the people's pub\n\nFound them from coming from a ... I remember a\nStreaming support for WAMC comes from Albany med now will in the mastery family children's emergency Center for ill and injured children more information at AMC dot edu or\n\n\nJust\nStreaming support for WAMC comes from Albany med now will in the ... family children's emergency Center for ill and injured children more information at AMC dot edu da\nThey're handed and and\n\nStreaming support for WAMC comes from Albany bed now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu\n\n\n\nIn", "show_name": "Tim Coakley Jazz Show", "year": "2018", "city": "Albany", "day": "07", "locations": [["Massachusetts", 42.36565, -71.10832], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Germany", 51.5, 10.5], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Boston", 42.35843, -71.05977], ["Claudia", -11.45086, -54.99828], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Boston", 42.35843, -71.05977], ["Saratoga", 43.08313, -73.78457], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Massachusetts", "Albany", "Albany", "Albany", "Albany", "Albany", "Boston", "Albany", "Albany", "Boston", "Saratoga", "Albany", "Albany", "Albany"], "out_country": ["Germany", "Claudia"], "in_state": ["Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Saratoga", "Albany", "Albany", "Albany"], "out_state": ["Massachusetts", "Germany", "Boston", "Claudia", "Boston"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "And from del mar farmers' market three thirty two can would avenue local and organic farm products baked goods their tradecraft Saturdays from nine to one moving indoors to school's cafeteria starting November third del mar market dot org\n\nThis was Northeast Public radio WAMC up ... points ... points reruns from Utica there'll be William ... W almost storage the only one southern Middletown WC yellow ... do you see any energy Ninety three three temperature\nHarry ... what else are we going to come to regret WAMC which do you want to buy one great Barrington W. W. B. S. H. D. ... it'll be ... ... and are idiots by\nBrewster WAMC Graham fourteen hundred Albany\n[noise]\n\n\n[noise]\n[noise]\n\n\n\nAnd welcome once more to the gym Coakley just show this is our annual\nStreaming support for WAMC comes from my dog hardest dot com or no joke ... dog hornets invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with well crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\n\n\n\n[noise] no\nNo\n\n\nNo\n\n\nStreaming support for WAMC comes from my dog hardest dot com or don't choke ... dog hornets it's best just to make walks easier for both dogs and humans no need to pull no need to tug walk your dog with well crafted in the Berkshires since two thousand six\nThousandths of reviews at my dog Curtis dot com\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\nStreaming support for WAMC comes from my dog hardest dot com I don't show no polls dog hornets is that just to make it easier for both dogs and their human no need to pull no need to tug walk your dog with well crafted in the Berkshires since two thousand six\nThousandths of reviews at my dog Curtis dot com\n\nStreaming support for WAMC comes from my dog hardest dot com and don't choke nope ... dog harness it did to make it easier for both dogs and humans no need to pose no need to tell you what your dog with was crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\n[noise]\n\n[noise] oh\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\nOr\nThat's by proponents Lionel Hampton with a tune called trick or treat ... my many album Clark Terry was on trumpet their lungs ... tenor Hank Jones at the piano milk hidden I'm based in ... junction on drums\nNext up on our Halloween shows in up in an album by Mike Benedict in ... which has a Brian ... notes on tinder sex Chris patient on trumpet Bruce sparse at the piano like Lawrence on base and Michael Benedict I'm comes this is a two written by ... third called Frankenstein\n\n...\n\n...\nStreaming support for WAMC comes from my dog hardest dot com and don't choke ... dog hornets invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with well crafted in the Berkshires since two thousand six\nThousandths of reviews at my dog Curtis dot com\n\nStreaming support for WAMC comes from my dog hardest dot com and no choke nope poll dog harness invented to make it easier for both dogs and humans no need to pose no need to tell you what your dog with less crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com [noise]\n\nMe me me me me me me me me la la la la la la la la la la oh she'll be but do do do do do do do shooting people booed ooh boat who ...\nTheir ranch in blood or ... with\nYelling and screaming when one of them are are\nThere is no during nine\nMonsters lead such interesting low\nThey live in\nThey paid their you\nKnow brothers sisters moms are dads are why\nI'm not lying monsters leads to the gym duress thing you see them coming down the street [noise]\nYup better not have time to your\nSteam your ... tear you apart\nLimb from lamb\nLoin zero\nYour brains and he joins remains they'll like show up with a ...\n\n... what are you doing here with the children and again I children go oh in the same pay the ...\n\n\nStreaming support for WAMC comes from my dog hardest dot com and don't choke nope ... dog harness it did to make it easier for both dogs and their humid no need to pull no need to tell what you're dealt with was crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nNa\nThat's real Sutton a piano with a ... a tune called them like Bruce drink and I think that fits into our Halloween children nice\nAnd next weekend we're going to have and that Cohen quartet performing at the concert series of police for jazz at Unitarian universal societies connected and that's the last country to the season and it ... next friday night\nAnd here she is with her fellow or notice ... very to do our shores nightmare\n\n...\n\n\nStreaming support for WAMC comes from my dog hardest dot com and don't you know pull dog harness that did to make it easier for both dogs and humans no need to pull no need to tell you what your dog with well crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com [noise]\n\nThat's Annette Conan are fellow clarinet is a key duty Rivera unclear and it's doing already ... nightmare\nAnd Annette ... will be at a place for jazz in Schenectady next friday night also next friday night ... and the new lowdown will be doing a swing dance at Albany Elks lodge\nRob Lindquist will be a ... mark toast trip and the Dixie boys will be the moves on house Rick Ross off will be leading a quartet at nine maple avenue to hug publisher toga trio will be a prime mature told the national David Fisk street will be at the speech easy speak easy and George ... will be at this decade in\nNext Saturday Night the hot tub of Saratoga trail will be at the blue hen Scott best Simpson will be leading a quartet at nine maple avenue rich Syracuse and make these limit will be a number of ten and great Barrington\nThe new age will be sick he Japanese steakhouse George mosquitoes trio will be at the speak Egypt Saturday Night\nSometime ago sex it's one of the split Phillips in pianist loose thing got together to make an album called slipping Stein with Michael Moore on base which miles on drums this year's goals of my dream\n[noise]\nStreaming support for WAMC comes from my dog hardest dot com I don't you know pull dog Curtis is that just to make it easier for both dogs and their humid no need to pull no need to tug walk your dog with well crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com na na", "show_name": "Tim Coakley Jazz Show", "year": "2018", "city": "Albany", "day": "28", "locations": [["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Syracuse", 43.04812, -76.14742], ["Egypt", 27.0, 30.0]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Syracuse"], "out_country": ["Utica", "Egypt"], "in_state": ["Albany", "Syracuse"], "out_state": ["Utica", "Egypt"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "At the Van Dyke lounge Schenectady November seventeenth Michael Benedict dot com and from Gordon fire equipment reminding listeners to check fire extinguishers and smoke detectors during the October national fire prevention month servicing and providing fire extinguishers in the Hudson Valley Gordon fire dot com\n[noise]\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W are you one eighty nine points reruns in Utica W. A. M. cage de nine point nine Kingston W. O. S. R. H. D. Ninety One seven Middletown WC yell HD Ninety One nine Plattsburgh WC an HD Ninety three three cannot ...\nW. A. N. C. H. D. one oh three night talk on the road got W. A. M. U. H. D. won all five one great Barrington W W E S H da da na na ... W. A. N. D. H. D. Ninety point\nOne Stanford W ANR eighty eight five Brewster WAMC am fourteen hundred Albany\n[noise] [noise]\n\n[noise]\n\n\n\nAnd welcome once more to the gym ... show\nStreaming support for WAMC comes from my dog hardest dot com or no joke nope poll dog or did it did to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk to walk your dog would love that the reviews at my dog dot com\nMm\n\n... ...\nUm\n\nDa da\n\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com I don't choke nope poll dog hard is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love that is the reviews at my dog Curtis dot com\nMm\nMm\n\nMm\nMm\nMm\nMm\nStreaming support for WAMC comes from my dog Curtis dot com I don't choke no pope yogurt is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\n\n[noise]\nThat's a trick from a recent album by guitarist Sergio peer euro ... new Brazil too cold for gene six week it was ... Elvis I'm drawing a Rico somebody out on sex for\nNo need to pull no need to walk your dog would love that is the reviews at my dog Curtis dot com oh\n\n\nOr\nThe Trump voters John ... do we get to calls Mr in doubly with the I'm sure to jazz orchestra an album called down a rabbit hole on the summit label\nExcept it's or and it was a piano along with ... Berlin base in Byron landed on drums ... joined by Larry McKinney onto the next one was a nice was called grace fairy\n\n\nStreaming support for WAMC comes from my dog hardest dot com I Know choke nope poll y'all garden it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog would love that is the reviews at my dog Curtis dot com\n\n\n\nDa da ... very remembers was the son that dates and it was Larry McKinney on tenor saxophone\nHere's a look at the first part of the week\nThe last week of October in fact just about run Morning Joe ... trail what we're doing the brunch at premature token national ... will be a salt and char\nTomorrow afternoon Gino countering the new standard will be at the gilded a library and at five o'clock pagan build the lady will be doing the jets desperate was it the first ... churches connectivity tomorrow it for the pop island big band featuring probably given she'll be at the Woodstock playhouse Robert students wishing well guitarist\nStreaming support for WAMC comes from my dog hardest dot com I Know choke nope poll dog hard is it that did to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog would love that is that reviews at my dog Curtis dot com\nThat Union College featuring a quintet playing be bumping cool jazz a stretch it one fifty Monday afternoon\nWednesday night the really good living men a gun jazz trio will be and relatives restaurant he makes me go check lamb rich Syracuse and Jeff Segal will be at the Catskill Mountains pizza company\nThe handled in St jets company had ... to Wednesday night the hot cup of Saratoga trio and Hamilton ghost jokes in will be at the people's ... pub in bronze you roll it will be at the vintage house\nNext Tuesday the capital district judge presents the art deco trio with the springs street gallery ensure toga springs\nJoe Burns funky nuggets will be a Detroit kitchen title Druze ... do well excuse me will be able to speak easy a group called completely different we stuck it in ... street jazz company to wrap it should be two of the hot tub of show took a trio at the moves on how such Thursday night to you about next weekend at a bit\nBut he was a long playing records for my collection by the great tenor saxophone his buddy take\nJoined hereby ward Michigan Cornett Hank Jones at the piano they'll get non base Mel Lewis on drums on green dolphins street\n\n[noise]\n\n[noise]\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who do her name is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com and\n\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who do her name is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com or I'm\n\n\n\n\nThat's the trick\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog would love that is that reviews at my dog Curtis dot com\nJune next friday night Patricia adults jazz colleagues will be ethical trust at those restaurants Julie has done a ... Julie Dunn ruins trail will be performing with Michael ... cafe could reach you", "year": "2018", "show_name": "Tim Coakley Jazz Show", "city": "Albany", "day": "21", "locations": [["Gordon", 34.50259, -84.95105], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Brazil", -10.0, -55.0], ["Berlin", 52.52437, 13.41053], ["Byron", -28.8339, 153.562], ["Syracuse", 43.04812, -76.14742], ["Detroit Michigan", 42.33143, -83.04575]], "not_found": ["Kingston W. O. S."], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Gordon", "Albany", "Syracuse", "Detroit Michigan"], "out_country": ["Utica", "Brazil", "Berlin", "Byron"], "in_state": ["Albany", "Syracuse"], "out_state": ["Gordon", "Utica", "Brazil", "Berlin", "Byron", "Detroit Michigan"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Nine to six to that one eight hundred three two three nine to six to\nProbably the most important telephone number ... anybody knows and then they dial extension one eighty nine\n[noise]\n[laughter]\n\nThis is Northeast Public radio WAMC F. M. H. D. Ninety four three Albany W ... eruption Utica WAMC cage de Ninety point not keep student W O s storage de Ninety One point seven Middletown WGLA chi Ninety One point nine pots Burke W. E. A. N. E. G. Ninety three point three Kennedy Harry WAMC age do you want a three\nPoint nine to ... WAMC which do you want a five\nPoint one great Barrington W W E s each de ... kids go WAMC HD Ninety point one Stanford W ANR eighty eight point by Brewster\nAnd WAMC I Am fourteen hundred Albany\n[noise] [noise] [noise]\n\n\n\nHello and welcome much more to the gym Coakley judge show where to start off tonight with the new recording by trombone is John ... usually\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope dog hard it is that do to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog hoarding it did to make walked easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com [noise]\n\nCage [laughter] [noise]\n[laughter]\n\n\n[noise]\nOh\n\n\n\nStreaming support for WAMC comes from my dog hardest dot com I Know she'll know poll dog hoarding it did to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nStreaming support for WAMC comes from my dog hardest dot com I Know choke nope poll y'all Curtis is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\n\nNo no no\n\n\n\nNamed\n\n\n...\n...\n[noise]\n\n\nAnd\nDon't\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who y'all Curtis is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com and\n[noise]\n\nDon't\n\nKnow\n...\n\n\nThat's a composition by Pearson played by pianist county huh from her new album crime zone she was joined by Walter Smith stood on tenor sex branch or no deal was struck you on drums and it wouldn't have eastern on base that's a new album on a Mac avenue label\nHere's another new album this is my vocalist tests the suit or the other one was called picture and black and white and it's\nA very uh students a vote devoted to her ancestry and her family life which is a tune actually written by Cory Turner gets knew which were cheered by Vicki burns in a fight tests the shooter it's called contemplation [noise]\nWaiting for you to\n\nWhy did that we\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope y'all garden is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com oh\nBy the memory of what they\n[noise]\n\n\n\nNo\n\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog ... dot com\nWere all\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope y'all Curtis is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nThat's kind of position by Ted Denver and called it's your light switch worse by courtship led by basis and Miller various got at the piano many Russell on section great Callaway on drums\nNext friday night the concert series of police for jazz continues with local adjust their horn and just went to Lebanon which connected either police for jazz at the Unitarian universally society and this is just me a horn and a social call habits\nYet though he gave us by\nMaybe have not my phone so I thought\nWell do you recall the old day easily have up by not that would not thing without them and I\nWay that\nWe had to do well\nStreaming support for WAMC comes from my dog hardest dot com I don't choke nope poll yogurt is it that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com", "show_name": "Tim Coakley Jazz Show", "year": "2018", "city": "Albany", "day": "14", "locations": [["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Lebanon", 33.83333, 35.83333]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany"], "out_country": ["Utica", "Lebanon"], "in_state": ["Albany"], "out_state": ["Utica", "Lebanon"]}]