{"month": "10", "state": "MA", "station": "WTAG", "content": "Business news is going to break and we're here to break it down and show what it means to your portfolio the financial exchange with very Armstrong in jugs not on the financial exchange radio network [noise]\n\nA hill from CNN Business joins us on the line right now and Paul before we get into stocks that pass along my condolences on the New York football giants looks like the engineer for ...\nIt's a it was not very not pretty\nWhich is the one person on a football field that as a patriots fans scares me more than anyone else but it it it it's\nThat I think he's ... yeah I I don't I don't think\nWe're going to have a giant patriot part three in a Super Bowl in my children children but\nThen again it has looked like this early on in seasons before for the giants and they've turned it around but\nThis one could be different tier which talked about J. P. Morgan we had a whole bunch of banks that came out uh with earnings this morning J. P. Morgan being one of them open in positive territory rolling over a little bit here right now I'm curious what your thoughts are on them in general before we get specifically to earnings yeah I mean I think\nThe numbers were a pretty solid or you know but they've had a history of beating\nA earnings usually by pretty wide amount so I think maybe um you know this was kind of expect that you're just getting a bit of a pullback or you know 'cause they didn't beat by maybe out larger amount that mean when you look at a neo Wells Fargo which actually still off on their earnings which weren't nearly as impressive I I think it was just a bar recently spoke\nWith a lot of banks the conventional wisdom is when interest rates are moving up\nBanks are typically going to do well in this case J. P. Morgan open the year hundred and Seventy dollars a share right now a hundred and seven dollars a share even though the ten year treasury has gone from two for up to almost three two I'm curious your thoughts as to why we haven't seen much movement in this ... stock price as well as other banks as well no\nIt's a great question I mean I think that there might be some concerns about the\nNegative effects of rising rates obviously you know it does make a loan to more profitable a increases margins but you do also have the demand side of the equation they now have\nA mortgage rate third year fix that you know averaging around five percent or so that might make it more difficult for people to get financing could see a a further slow down there in the housing market with already had a\nCouple of the locations where prices are starting to uh to slow or you know the the ... the increase is allowing in some cases where prices are even going down I think you know that could be a potential problem for any bank with a mortgage business large there\nFor the last five years we've seen a rise in a large number of fit in tech companies coming in and trying to under cut the pricing structure of the legacy companies like a J. P. Morgan it could be the robo advisers on that side of things that could be companies like Ben Moon pay pal on the payment side\nWhat is J. P. Morgan Chase doing in order\nTo kind of combat those types of companies and do they need to be doing more at this point\nYeah I think that is a good question I mean you do have a chicken or game with its sapphire ah you know credit card I thank God that something where they're trying to offer more benefit and perks\nTo maybe get people to stay with traditional banks as opposed to an online to shed or a mobile apps I think that's something that all of the big banks are really looking at more closely\nIs there any one in particular when you when you look at J. P. Morgan is there any company that potentially looks like an acquisition candidate for them either smaller regional banks or any kind of tech company to maybe get into that space it a little bit more heavily\nPossibly on the tax side I wouldn't rule out a deal there I'd be very surprised if not cheap\nOregon where to try and increase the backing put bread with a regional thing we have an ad [laughter] we haven't had a lot of banking you'll lately a and I don't think\nThat uh you know many of the big banks are looking to expand their deposits that dramatically especially when you got back like than they are already so large that uh you know I think that you start running into cap limits and and search for the Federal Reserve they were doing to feel\nVery good Paul we got to let you go but thanks for the time and will catch up with the next week they poll Monica from CNN Business talking about J. P. Morgan Chase\nSome continued news on the on the Sears front or as the years apparently now is trying to go through restructuring but a lot of it the lenders trying to make a push for a liquidation we got an update just a little while ago that it looks like spheres\nHas received a let's see what this is here it looks like they've received the ability I I don't know exactly what but it looks like they have the ability to stay afloat through the Christmas season right now I'm not sure if it really matters\nI mean it's probably a good thing for their lenders ... their lenders are probably just trying to really push them to get one more holiday shopping season than just close the doors January to just try to get rid of it as much as ... as much regulatory out of there you know get a little bit more revenue and then take your you know twenty cents on the dollar that you can end up with as a bond holder here\nIt it does look like there are some pretty good deals right now like I'm I'm at ... dot com forty percent off appliances or you can also have warranties not worth much [laughter] no [laughter] no you certainly can't uh you can't get much\nLarger TVs are pretty good deal or no I mean they're cheap and general right now yeah let me see if they have anything that looks good out there on the TV solid waste all black friday I mean the problem there's just me no inventory like no one's telling in the tourists ears right now\nNo I mean if you're a supplier you're not going to go toss a bunch of stuff and I see her store because you're just not gonna get paid for it yeah did you have to figure there's not much going on on that side of\nThings quickly get markets briefly all major in the sea still and positive territory to give it away some of those games as we look to see if this market can bounce back from two week days so it's Henri out for the day and votes friday so I guess enjoy the weekend and we will see you next week\n[noise] [noise]\nHey\nWe're not on\nThe box office more\nTrying to make a little on\nThe weekend comes around [noise] we've got\nThe experts to help you hang onto it this is rich car host of the financial freedom show nine AM Saturday here on news radio double duty AG financial freedom ran I don't like when we're time money on the radio five eighty and Ninety four point nine Amsterdam double duty A. G.\nHi this is ... are you a snow warrior court is looking for you to join our team experienced equipment operators CDO and non ... truck drivers and ... remembers also subcontractors with your own plow trucks and there'll be equipment we're looking for you to give us a call ...\n... more three strict some that's five or six five four three strict suburban or visit us online at ... dot com slash snow partners\nMS our peak envoys list\nPrice dealer price to be happier if your car shopping you probably heard these terms\nWhat do they mean it's so confusing well it was confusing not anymore I'm telling you about true price from ... it's a price it actually means something because it's the exact price you pay for the car you want including season accessories and basketball you'll know if you're a true prices competitive because true car shows you what other people are paying for the\nUse use radio five eighty Ninety four point nine ... family double duty A. G. W. A. T. A. G. H. D. Worcester and I urge radio station\nMichael's past of destruction permissive Brady Fox sneeze damage has been for a second day now in several states from hurricane Michael\n... through a someone's home um and then they're all over\nFox Business network chefs lock in Panama City Beach Florida and got a long\nOkay so the point is this guy doesn't even nobody's talking but he goes to the next us database any figures oh Rush Limbaugh doesn't believe in climate change do people with north but just rank amateur on professionalism but the reason I played this is is not not to mention this guy [noise]\nBut because while this guy is jumping all in my chili\nListened to this story this is from the federalist papers liberal professor says hurricane victims deserve to what thank God because they support Republicans now do you think\nThese clowns in Boston with zero in on something genuinely deranged like this\nYou know they're going to make up the fact that a bunch of people like me who know the climate change man made climate change is a hoax are somehow responsible for people having lost everything and clothing risking their lives\nDoes University of St Thomas engineering school in Minnesota thermal and fluids scientists professor Dr\nJohn Abraham he's a professor actually believe the Florida Panhandle residents deserve to get hit by a catastrophic\nHurricane because they elected climate deniers here's the headline\nIn an article written by this guy was published in the guardian not some obscure little rag or\nPenny saver this was published in the guardian on Thursday victims of hurricane Michael's voted for climate deniers elections have consequences denying science has consequences and we're reaping what we so\n\nPeople just like this are teaching your kids and they're being paid a lot of money to do it\nThis is the logic and the reasoning that he is teaching any engineering school the guy is still range this is this is hyper political partisanship disguised as science\nHe thinks that voting for Republicans causes hurricanes to hit red states and the people in red states who voted Republicans deserved to get wiped out by hurricanes for voting for Republicans\nAnd his name is Dr John Abraham a University of St Thomas engineering school in Minnesota\n\nDespite the lack of science to support his case Dr Abraham blames Michaels in tends to be on manmade global warming there isn't any evidence for it it's not the most intense hurricane ever hit the panhandle\nYet he blames the intensity or manmade global warming are needing to his subsequent claim that southern voters brought this upon\nThemselves by voting Republicans into office\nYou wonder that a state like Florida which will get humbled by Michael couldn't vote for somebody that denies climate change this doctor wrote\nPointing to governor Rick Scott and Senator Marco Rubio and his argument is that in the last Republican climate deniers or voted out of office that more hurricanes will bring more death and destruction of the ... so\nThis clown who is disguised as a as an engineering professor literally is saying that if you want to stop destructive hurricanes\nFrom the double duty AG newsroom WG a\nGene is run by my bed drink the ... what's your New England L. O. J. B. T. Q. plus film festival kicked off yesterday at the handover the mentoring conservatory for the performing arts boom screenings will run through the weekend and then on the fourteenth UMass memorial health is laying Seventeen people off from the information services department\nBlaming operating losses and changing work demand for the decision\nThey'd been undergoing several belt tightening measures\nAfter having twenty two million dollars and operating losses so far in twenty eight Jane tunnel Sean O'Malley is expanding the review and the allegations about behavior at St john's seminary in Brighton so-so hiring a downside\nFirmed replacing internal committee as leaders of the investigation WTO James ... baseball game one best of seven and LDS Dodgers that Milwaukee the latest news twenty four seven at W. Ga Ga dot com I bike that rate news radio five eighty or Ninety four point nine to have him\nWGLA gee what's there's news weather and traffic station from the double duty AG weather center here's the latest forecast\nGood afternoon everyone meteorologist pounds of awkward a gradual clearing this afternoon at high temperatures fifty to sixty degrees or tonight clear to start them becoming partly cloudy much cooler load forty to forty four of them are mainly cloudy champ showered cool I ...\nA lot of fun they partly cloudy and cool I before to fifty eight degrees you can get your weather all day long on W T he dot com\nThis week in history this week in Nineteen thirty six harnessing the power of the mighty Colorado River Hoover Dam begin sending electricity over transmission lines fanning two hundred and sixty six miles of mountains and desert to run the lights radios and so's of Los Angeles\nThis week in Nineteen fifty six New York Yankees right hander Don Larsen which is the first no hitter in the history of the world series even better there was a perfect game that is there were no runs no heads and no errors and no\nDo golf building that dream home\nNow the perfect time to talk with us about a mortgage loan\nMany options to consider find you the loan them right do\nCall a civilian storey\nThat's right it's like friday or whatever you want to talk about the folks have added that the ah the rule it's not that way Monday through Thursday you might not hear any difference as a listener\nBetween friday and then the other day but there is in terms of how we screened a program not Victoria Bissell brown retired history professor at Grinnell College which means she\nAlso taught your children [noise] Grinnell College [noise]\nWritten el that's a big name in Iowa but I I'm not I didn't I didn't bother to look where rebel\nCollege is she lives in ... Pennsylvania ... township so maybe anyway I yelled at my husband last night not pick up your socks yell not how could you ignore that red light yell this was real yelling\nThis was not why did you leave a toilet seat yelling this was thirty minutes from that got yelling\nTriggered by small fought was dismissive annoyed patronizing comment really small microwaves it triggered a hurricane I blew I was so mad I blew hard and fast and it terrifies me I'm Still terrified by what I felt in what I said\nI'm almost Seventy years old I Am a grandmother yet in that roiling moments screaming at my husband does if he represented every clueless guy\nOn the planet I announced that I hate\nAll men and I wish all men were dead if one of my grandchildren yelled something that ridiculous\nI'd have to stifle laugh my husband at fifty years did not half just stifling laugh he took dead serious like I don't have any doubt that he did [noise] I don't think this guy is probably ever laughed with his wife in fifty\nYears [noise] but that's just me speculating let me continue my husband\nDid not defend his remarks you did not defend the men he sat hunch doesn't hurt and he listens to me for a moment it occurred to me to be grateful that I'm married to a man who will listen to a woman\nThe wins calmed ever so slightly in that moment when I realized he was okay\nAnd then the storm surge wound up at me as I realized the pathetic impotence of nice men's plan to rebuild the wreckage by listening the women\n[noise] guys you really tell hopeless isn't this guy getting right that he\nBlew it\nHe listened to everything and his wife still wild up and exploded because what he was doing there wasn't\nEnough and yet there's nothing else he could have done\nAs my range rushed through the streets of my mind and I'll guarantee of most of them are one way folks toppling\nEvery memory of every good thing my husband has ever done and there are scores that you just want to say she's gotten mad hear her husband is not responsible for it\nAnd she's getting madder and madder and madder and him in the midst of him doing everything right the rangers rushing\nThrough the streets of her mind toppling every good memory of her husband she's got\nThis is in the Washington Post\nI said the meanest thing I've ever said to him don't do you share sit there and sympathetically promise to change that is what she said the meanest thing ever don't say\nThat you're going to stop yourself before your blood out some impatient annoyed controlling remark\nThis woman Seventy she still Mather husband controls her I guarantee you what's the other way round [noise]\nNo I said to him you can't change you are able to change you don't have the skills\nAnd you won't do it\nYou are you said or one of the good men you respect women you believe in women you like women you don't hit women you know raped women or in any way abuse women you have applauded him funded feminism for fifty years you were one of the good guys and you cannot change you can listen all you want but that will not create one iota\nWhat Ben this poor guy ... [laughter] what this woman is saying\nThe guy is perfect and yet he's guilty he's perfect because his perfection will not change anything\nHis being right on the money everything she wants will not matter\n\nIn the centuries and feminist movements that have washed up in a way good men have not once organized their own mass movement to change themselves\nAnd their sons or to attack the mean spirited teasing punching thing\nThat passes for male culture not once bastards don't listen to me listen to each other talk to each other on your power for once the gender war that has broken out in this country is flooding all of our houses it's rising I'm a torrent of memories that every woman has [noise]\nI\nSaid do what I said about three weeks ago that these women have this irrational hatred that man they're angry so I don't know what's happened to him but something did and that quote has been brought up and recycled all over the drive by media\nProbably because they know and hit the nail on the head but this\nLet's see if we just went after them like you can't do that will you just said I could choose to know you can't choose to stay home you can't choose to be defined by marriage relationship you can't choose to raise the kid you weren't letting down the sisterhood you're betraying the moment\nThat dates back\nTo the late sixties early seventies here comes this woman running for the Senate in two thousand Eighteen accusing\nWomen who stay home and raise kids of being leeches\nThey lead ching off her husband is there a legion from their boyfriends are just catching the checks\nAnd they're calling it feminism because they're choosing to live that life well that's not feminism\nHer opponent again the highest ranking woman in the air force first female fighter pilot Martha McSally have you seen the polling data on some of the Senate race hits looking bad it's for the Democrats are Democrats in the cabinet ... effect is is very real\nI mean it's looking bad for mansion even it's looking bad for Heidi Heitkamp is looking bad for a guy in Indiana Donnelly looking bad for this woman ... out in Arizona\nBeto O'Rourke who has gotten to the left Hollywood is throwing money at better or worse in Texas and he is continuing to lose grounded Ted Cruz\n\nI mean there are some I've read speculation that Senate race is over I don't want any of you believing that\nBody it wasn't long ago that Beto was leading crew is if you believe the polls it it looks like if if the election where today and if the polls are right that there isn't anything approaching a blue wave and the Senate and in fact\nIt is a red wave and now there's more evidence for starting to see if I have details coming up that this blue wave in the house may be a a myth\nSo we'll just have to say details coming up let me get to the phones always try to do that in the first hour on open line friday Lake City Minnesota this is Phil I'm Glad you called or high\nHigh are outside of August first aid that does and I wanted to say that then download the etched in my hype a cat and the U.S is your laughter here last year I mean you're updates the first time I heard clause knowing me I just about drove off the road it's a pleasure thank you for\nThirty here more and more than welcome sir and I appreciate that ... is our prayers are fictional gay community update name we haven't had occasion to play it recently but might revive it from the archive today just since you brought it up\nThat still hilarious beyond description\nUh I hold them back for science degree where NPR graffiti and we used to talk about ah what is the optimal kept when you hear these\nPeople or the U.S and we're talking about well the climate change everything burning up oh they never tell us what the optimal temperature is a but every time the temperature goes up a few degrees\nOr you have large swaths of Canada Russia China that are you know on and tell all turn into a better agricultural areas and we ended up a feeding more people a case in point\nA mere ten thousand years ago here enough or mid west we have this giant oil a shirt sitting over most of the country and then this wonderful thing where the climate warmed up and we have a\nThis area that's a suddenly feeding the world so every time the temperature goes up\nA little bit of a way the more people so I don't know what the what the problem is I mean\nLike oh yeah she ... the problem is they're trying to scare everybody into signing onto this because it's it's classic if you sign on to agreeing to the whole premise of climate change your green do a lot you're agreeing your to blame\nAnd that's a big one\nBecause when you agree that you are to blame then they hit you with but you can fix it you you you can make amends and how do you do that you agree to pay higher taxes you agree to become an activist you you agreed to start criticizing everybody else\nSo they get you to accept blame then you also admit that gigantic\nOrganizations are the only way to structure our lives and to protect everybody so it's it's simply a waving guilt people into accepting\nWhen they don't even know this is being done to them the premises of socialism and communism\nUnder the guise of saving the planet but your point about the optimal temperature I've expressed that in a different way over the years how do we know folks that climate conditions right now\nIn the entire history of this planet how many hundreds of thousands of years whatever it is how do we know that the temperature and the climate right now is optimal is perfect is what it should always be how do we know that\nWe don't\nIt's the vanity obese people assuming that this is the bass line this is perfection everything the veers off from here is a problem there so full of it I Can't begin to describe it away\nEvery corner of the road Raj your name as a household name Limbaugh ... speed network\nCarlo a steel worker who's married to his high school sweetheart a cancer survivor they have a special needs son Carlos just been laid off from his job losing his medical insurance to make matters worse the bank is about to foreclose on his house with his back\nAgainst the wall Carlo will do anything to protect his family directed by and starring James for Rodrigo Carlos ... is a based based bill and a bail on Amazon I tune in Google Play watch Carlos inspiring story today on Amazon high tunes and Google Play\nTonight tonight central on ABC finish the sentence from me millennia Trump is the first lady the age of ten women in the me too movement call us support or no question off limits you're not the first first lady to\nHave to deal with her husband's alleged infidelity has put a strain on your marriage tonight one of them along the Trump say let's talk about the jacket this why did you wear\nBeing ... [noise] the ABC exclusively that don't miss it tonight at ten nine central on ABC\nRadio and I got some emails rush that woman from Grinnell getting she's Seventy [noise] where does the woman that\nWhere does she do learn that kind of have [noise]\nThink I have the answer\nI don't think that's hard at all [noise]\nI Will share when we get back\nStation [noise]\nMy friend devastation NBC Brady vaccine damage assessments and search and rescue continues after hurricane Michael boxes Evan brown live in Miami\nAnd Lisa much of the panhandle remains without power and without running water congressman Matt gates represents the desk in an area we've\nShe's a doctor of some kind of psychology at Paolo Alto university well\nI have never heard of Paolo Alto university so I began to dig deep\nWhat is Paolo Alto university what do they do there and the short version of the story is it is a play is run by women\nThey count themselves as a school that prepares women to become experts in psychology their website\nTitled solve the wonderful things they can do for women and Seventy three percent of the faculty the students whatever are women never on their website is ...\nMention of teaching men about psychology so I concluded that this is a haven for women\nNow this this this professor here from um [noise] Grinnell university Victoria missile\nYeah I I I Know women my age who grew up with the Gloria Steinem ms magazine Betty for Dan version of militant feminism\n\nAnd back then it was basically about equal pay for equal work and not\nGetting married and not letting them am defined your happiness or relationship a marriage or what have you\n[noise] but where do these women come up in the ... where do they get to have I have a theory that it has to be it has to derive from the fact that a lot of its media\nI this particular woman published in the Washington Post probably\nAnd listen to NPR religiously probably read the New York times religiously probably watches CNN religiously\nAnd as a professor at a university\nThey are surrounded she is surrounded by other like\nMinded women\nThey feed on each other's bad experiences with men they retail retail story after story after story\nAnd it's kind of like all Kanye West said yesterday Kanye West said that\nIn groups of people were there isn't any male energy people are gonna go nuts after awhile\nKanye West noted philosopher and the oval office\nVisitor made that point yesterday\nAnd I think that's where this comes from I think hanging around with with the other angry politicized leftist\nWomen whatever anger there is gets\nRetold retold and it becomes more and more intense and that raises this woman does not hide the abject range the almost on contained a bull anger even for her husband who she needs is perfection\n\nThis the reason why this is Rob this is the American left folks this is the Democrat Party this is the group of people that thinks Hillary Clinton is the Hillary is one of these women\nHillary Clinton is exactly one of these women running around filled with range uncontrollable rage hatred an anger that is compressed and intensifying each and every day\nAnd I'm telling you no matter what the drive by just think it's not infectious it does not make you want to join the team it makes you think that these people are nuts\n\nIt that far out of the mainstream yet to them it is the main stream\nAnd this is not gonna sit well this is not a good day for me to move but actually it happened yesterday New York judge drops sexual assault charge against Harvey Weinstein seen\nNow we're not hearing much about this shockingly because Kanye West as eating up all the oxygen in the news bubble\nDisgraced movie mogul Harvey ... steam has won last count a sexual assault being brought against him before his trial begins according to the Daily Beast\nOn Thursday morning a judge dismissed one of six criminal counts brought against the disgraced mogul by the Manhattan da da da da da da and forced her to perform oral sex in two thousand four winds stands attorney Benjamin Brafman\nArgue that the charges be dismissed due to Evans previously describing the sex act to a witness has consensual\nA witness reportedly told this to the Y. P. D.\nSo Brafman sudden a press conference this is not about suggesting that a woman who comes forward should not be believe this is about a witness who came forward\nAnd committed perjury before a grand jury now wait a minute Mr Brafman we're coming off the Kavanaugh hearings were we were told women can't lie and we were told that women don't lie and we were told that we're not to think women lie anyway and your now\nSaying that a charge was dropped because a witness who came forward and committed perjury perjury before a grand jury\n\nNo worry Harvey Weinstein is still a creepy pervert out there still has five counts against him\nBut in this case he found somebody who was willing to sell him what he wanted him a reduced the five to six charges to five speaking of Hillary [noise]\nYou know what I'm Wondering limited if it's not bad roster real quick I have a feeling that we're going to have a Hillary Clinton this is amazing by the way this has recycling an\nOld\nStory that we have previously laughed at I Can't tell you how many what looks like okay good don't have it here no big deal\nHillary Clinton should Trump you asked Russia hacked me on national TV this is the most amazing thing and this story is another great illustration of the divide that exist\nBetween saying an insane in this country and how the people on the insane side had literally no sense of humor have none no perception of what so ever of humor\n\nHillary Clinton fired back and President Trump yesterday after reclaimed a day earlier that Clinton had engaged in a conspiracy with Russia during Wednesday nights campaign rally in Pennsylvania\nTrump told the crowd there had been collusion and he said well if you look at it when you think of it there was collusion between Hillary and the Democrats in Russia there was collusion\nThere was a lot of collusion with Russia and lots of other people by the way\nAnd he's right what he's talking about here is the Clinton campaign of Democratic National committee hired fusion GPS founded by Glenn Sampson who's refusing subpoenas to testify to Congress claiming the Fifth Amendment\nFusion GPS took the money from the Clinton campaign the DNC\nAnd went to a law firm cut out called Perkins call wave this was done to make Hillary and the DNC is money to look like they were buying a legal advice and campaign advice but the law firms then funneled money\nAfter laundering answer Christopher Steele and he then went out and created this lying stinking phony dot CA the one that has the story that Trump hired a bunch of prostitutes\nIn Moscow to urinate on a bad that had been slept in ... Hussein all and Michelle my bell oh\nThe ... is is not a single bit of it as ever been corroborated like balls the Ford story not a single bit of corroborate ... no evidence whatsoever and yet that dot CA was used to get a finds a warrant to spy on the Trump campaign\nAnd that dot C. A. is what kicked off in a truth ... special counsel investigation to try to find collusion between Trump and Russia to many of his old knows but that's what Trump's were loaded onto and Trump is exactly right the collusion here between anybody in Russia is Hillary Clinton campaign the DNC\nAnd the route is Hillary Clinton DNC to a a fusion GPS\nThen under Perkins collie and then just deals with the money still got went through a bunch of different layers before he got it but they essentially commissioned an opposition research hit piece on Trump that they tried to sell everybody was legitimate\nTrump supported miss out he'll rate goes bananas she can't believe the truth is being told about her she can't believe that they can't let this day and so she has to\nTrump is the guy that asked the roses there had me he did it on national TV Trump is the guy that he ... and they have tried to make this case\nIt's the funniest thing in the world Trump was down in Miami up his resort down there to route and this was a period of time where Hillary's emails ever sixty thousand total on her server\nAnd she told that there were legal or illegal server private server private address while she sector I state\nI remember when President Obama when he was a campaign and whatnot he was talking about uh or actually with the book\nHe spoke about how in high school he spent most of the ... days because he was trying drugs and alcohol enthusiastically yeah you never hear ever any one of the ... ever even mentioned energy\nOh that is exactly right and the ISI called him so he was in the ... these are people who went to somebody's car and they started blowing dope\nAnd fill it with the video exist one of the people were asked why isn't Obama weighing in on Capitol wiring Obama because Obama knew these videos are out there he couldn't wait in because he had admitted to much more than ... ever did your no no you're exactly right\nYeah I Know I Know that it's pointless to pointed out but at least I like to try and shove it down their throats every chance I get ... ...\nWhen I say hypocrisy is ineffective I'm Talking about only in terms of persuasion and if it ever does work to persuade we're probably will never know it one thing I've found throughout my life is when you're when you're targeting people to persuade them\nEgos are such that they never want to admit\nThat anybody change their mind they want to say they came to these conclusions themselves\nAnd they will openly reject ah any claim that somebody change their mind or talking not everybody but a lot of people in that way\nUm\nThe hypocrisy is not useless I mean it's highly entertaining and it is substantiate him um for people but in terms of of persuaded Democrats I've just found that never ever really been a tripped up by it largely because the media doesn't make a big deal [noise]\nNow the latest headlines from the double duty AG newsroom\nWG a June Israel by my bed drink investigation underway and above forty fifth bottom side of the year in the Boston area a Nineteen year old happened on ... read in Dorchester shortly after two AM yesterday and he has been releases airport limited reporting the gas emergency that result in explosions in one death\nAnd Marron back valley last month it blames high pressure natural gas released into a low pressure Columbia gas distribution\nSystem with a series of explosions September thirteenth over one hundred\nThirty structures damaged in Lawrence Andover and north Andover as a result they Fall River accused of defrauding investors officials they Jane Seoul, Korea used invest their money to pay for his own lavish lifestyle in political campaign that are you seeing a gene sports baseball game one best to seven and they'll dig at Dodgers that Milwaukee get the latest news twenty\nFour seven that W Ga Ga dot com\nI might Patrick news radio five eighty and Ninety four ... W E a G\nWebster's news weather in traffic stage and\nFrom the double duty AG weather center here's the latest forecast\nGood afternoon everyone says meteorologist pound of awkward graduate glaring this afternoon high temperatures fifty sixty sixty degrees for tonight clear to start them becoming partly cloudy much cooler lows forty to forty four of them are mainly cloudy good chance showers cool idea fifty on Sunday partly cloudy and cool ice fifty four fifty\nEight degrees and you can get your weather all day long on W E a G dot com\n\nMan on the books the insanity is all over the place here is a\nPiece in Politico today and this by John Harris and ... John Harris is one of the founders of political used to be the Washington Post me and so these are you know these are not chump change obscure wacko ... well they may be that but I mean they're not\nThey're widely no they're they're highly respected right in the mainstream of left wing activist journalists\nAnd the headline of this story Trump may not be crazy but the rest of us are getting their fast\n\nI I I don't know where to start with this I mean even the first the first line here CNN before lovemaking is not his idea of a turn on\nBut she can hardly turn it off in gross that she is in the latest unnerving gyrations of Washington so obviously these are psychologist stories psychologist couches are filling up as American seek relief from Trump anxiety disorder that's the ...\nI I don't believe this for a minute I think this may be the case in Washington it certainly will be the case the Upper West side and probably in a lot of Hollywood but nationwide people are not seeing shrinks to deal with Trump anxiety disorder\nBut yet this guy these two people think well all of America is if it's happening in Washington or New York and it's happening everywhere\nSo a psychologist tail here CNN before lovemaking not his idea of a turn on but his wife she can't turn CNN off\nSo engrossed\nIn the latest unnerving gyrations of Washington who else to blame for this but Donald Trump the president who\nExcites hot feelings in many quarters has cooled them considerably in the bed rule ... above Philadelphia ... so you got people who are going to psychiatry now blaming Trump for the fact that they both gone frigid\n\nBlaming Trump for the fact that they have lost interest in sex lovemaking quite as however you refer to it so there's still do if you're ... sought counseling in\nPart because the agitated state of American politics was causing strain in their marriage\nThe couple story was related to political by their therapist on condition of anonymity\nBut they're travails according to national surveys in interviews with mental health professionals are not\nAs anomalous as one might suppose though no even when symptoms are not sexual in nature and there is a bomb didn't evidence that Trump and his daily upper ours are galloping into the inner life of American I'm telling you these people are bonkers\nNow we've known\nThis on the fringes you know John Kerry would lose the election and down here in South Florida a enterprising psychologists was open temporary offices\nUh advertising if you're if you're suffering from Bush arrangement syndrome please come see us after John Kerry\nLost in two thousand form and this kind of stuff has been you know since Florida to a thousand it's been somewhat common here but it's it's reaching new heights new lows\nEmpirical data bolsters the anecdotal reports from practitioners the American Psychiatric Association and I'm a survey\nFound it thirty nine percent of people said their anxiety level have risen over the previous year fifty six percent were either extremely anxious or somewhat anxious about the impact of politics on daily life uh twenty Seventeen study found that two thirds of Americans see the nation's future\nAs a very or somewhat significant source\nOf stress\nOr more plausible interpretation for all of this in the view of some psychological experts is that Trump has been cultivating adapting and prospering from his distinctive brand or provocation brinksmanship and self drama\nFor the past Seventy two years what we're seeing is merely the president's own definition of normal\nIt's only the audience who finds that performance disorienting\nAnd what words Trump's not crazy but the rest of us are getting their of fast and people are going to psychiatry and paying money to be told this we tone Trump is driving them crazy\nLiterally is causing and they'll lose their sanity you thought I'd been joking around\nAndrew reading about this and I'm not we're dealing with\nPeople who are genuinely on here\nThey haven't gotten over the fact that Trump won they can't get over the fact that they're people can't get rid of the Trump the intelligence agencies the FBI that the OJ the deep state powerful people in Washington the Democratic party\nOver liable as like Dianne Feinstein Chuck Schumer can't lay a glove on Trump and there beside themselves getting rid of Republicans has never been as hard\n\nTrump signed legislation to clean up millions of tons of garbage from the world's oceans Obama didn't do this\nPresident Donald Trump added his signature till the save our cities act on Thursday green lighting and initiative to clean up eight million tons of data Bree from the planets oceans\n\nTonight tonight central on ABC finish the sentence for millennia Trump is the first lady the interview Ken women in the me too movement call us support or no question is off limits you're not the first first lady to\nHave to deal with her husband's alleged infidelity has has put a strain on your marriage tonight what role models with Trump say let's talk about the jacket this why did you wear being ... [noise] the ABC\nExclusive event don't miss it tonight at ten nine central on ABC\nI forget what can we get to see you\nJust trying to get my life back together while I'm Still happy that you're home it looks like things are going round I think that you have you and your family and all that kind of what you owe that tax that ... when my son\nIs an amazing carry that gets a free ticket like context sporting events show to currently serving military families okay the immediate family the sheets Kevin ... it's a really nice organization [noise]\nBy the way it folks I I've got two more stories that focus on the insanity of the left I mean and I'm not using the term loosely here's another one\nSusan Glasser staff writer at the New Yorker she writes a weekly\nColumn on life in Trump's Washington she writes a weekly column on life in Washington in Trump's why what life in Washington has become because of Trump once a week [noise] [noise]\nThis piece the headline I listen to all six Trump rallies in October\nAnd you should to some had it's not a reality show it's real it's a long piece but do not misunderstand\nThis lady Susan B. Glasser listed in didn't watched six Trump rallies\nAnd she is up set\nThat they're only on CSPAN she's mad that Fox is stop covering them that CNN is stopped covering them that pie MSNBC or stop covering them because she thinks they are damaging to Trump\nShe thinks if the people of this country's solve these rallies that it would be the end of Trump She points out how Trump lies all the time how Trump exaggerates all the time she totally\nMiss understands the purpose of the rally she does not exactly yes I predict that she does not get the connection or the bond between Trump attendees after rallies Trump supporters and Trump\nShe totally does not get this\nShe does not know how to listen to the Trump She does not know how to uh empathize with Trump rally at ten days she has no\nAbility to relate to Trump has his supporters do she watches these things and she is appalled at Trump personally politically he lives all the\nTime he ... he mocks people he makes fun of\nPeople he's mean\nMeanwhile people at these rallies or having the best time of their lives it's the highlight of their week to go to a Trump rally and this woman is studying\nAnd she's watching six of them so far this month and totally does not get it she\nIs missing the purpose of the rallies\nShe does not see that this is Trump's mechanism for getting past the media she does not see that this is how Trump\nNet gates and goes over the drive by me something Reagan also a master\n\nTheir masterful they are formulaic even though everybody thinks they're improv and off script they are formulaic there are segments in every Trump rally and he follows them to achieve what he says differs\nIn some cases but the point is here's a drive by media specialist ... and totally doesn't get it\nIt's the exact opposite if\nThese rallies were televised nationally\nAs they used to be\nThere wouldn't be any talk of a blue wave anywhere except in New York and\nCalifornia Rush Limbaugh America views the bombing Iraq I be worse\nMy friends like you I Am thankful every day for the brave men and women to protect our freedom and our country now is Veterans Day approaches I Want to announce that my friends at Mahendra\nAre holding their fifth annual military salute give away the winner will receive a major hindrance retriever utility vehicles that's right a brand new read my hindrance retriever one thousand gas model\nLast year's winner army captain Robert forty of Ohio is loving here's my hand and you could be next\nTo nominate somebody who is active duty or a veteran of the U.S military and to get official rules\nIs it Rush Limbaugh dot com and look for the Mahendra military salute give away\nThanks to my hindered the makers of the toughest utility vehicles on earth\nAnd God Bless all of you who protect our freedom\nTake advantage of rock bottom prices and test drive a hindrance today at the Boston lawnmower company in West borough or visit Boston lawnmower dot com that's Boston lawnmower dot com\n[laughter]\nFriday afterwards well what's new today on the free I her radio a radio\nPerfect for decorating the house or just setting the scary mood how Republicans by the playlist has joke tracks with labor inspired five we've got a\nEveryone's talking about like the famous people ... Joe Rogan experience all your favorite music all your favorite station\n\nBank anytime anywhere with the unseen checking customize just for you and sees anytime anywhere checking ... the the best\n... [noise] but she put it out and of course the media ran with it and they've had to withdraw because she had to withdraw because it wasn't true and it's\nIt's fairly common that these people on the left engage in this kind of storytelling insult mongering here it is John ... never Trump or John ... the Democrats blue wave is drying up\nOh that's not to be a disappointment\nDon't count your elections before they're hatch that's the lesson of the past couple of weeks or so called fundamentals that supposedly govern the twenty eighth teen mid terms\nStill point to a good a great night for Democrats they are the out party and the out party generally does better than the party in power\nBut\nTo generic polling question this week have Democrats up twelve and Thirteen points respectively that would suggest a so called blue wave in which most house and Senate seats in play will likely he'll Democrat and it's in line with the twenty ten of Republican numbers around now\nYet yet now we pointed out that all of these national generic polls show this gigantic way but if you go race by race if you go into the state's district by district you don't see this way you don't see the evidence in the polling\nAnd people have been asking how can this how can this disparity be how can you have a generic ballots that shows that Democrats plus proper plus Thirteen but then you don't find any single congressional race that shows Democrats plus twelve or Thirteen well it must be in the generic ballot doesn't mean much Muslims is\nHow could it generic ballot dilemma name on it by this time when you start pulling people among three weeks away from the election you start asking questions about how they're going to vote without a name and the question what do you think the result is going to be\n\nState level polls over the past two weeks showed no blue wave certainly not in the Senate\nThey suggested Democrats appear to have almost no serious chance of winning\nThe ... in the Senate that would require them to pick up three Republican seats and the whole day every other seats if they have\nThey held by incumbents that at this moment it's far more likely Republicans are going to pick up one of their seats so [noise]\nIt's [noise] let me go state by state to show her and this is all happening ... the evidence against a blue wave is primarily in the Senate\nBut\nThe conventional wisdom here is not rooted in specifics but conventional wisdom is rooted in just that conventional wisdom and hope\nThe left hopes that this is a traditional here party out of power wins big that's what they're hoping\nThey've got their generic ballot polls would say that's exactly what's going to happen but then you're going to the states state by state race by race and you don't see it see why to close races some that can go either way\n\nBut they're still hanging on to hope they are reporting the hope they're reporting hoping hoping that reporting the hope will turn the hope into reality now before we get too much in the hour\nI Need to tell you a little bit about a movie that is a opening tonight it probably has opened in some\nCities all reading of certain theatres it's God's Nell\nThe trial of America's biggest serial killer now ... is an abortion doctor who got away with the ... murders in Philadelphia got away with the wants and murder of thousands\nNobody can get the media interested in the story even after he was charged and convicted and put on trial and the reason is that correct guys now\nWhat's the worst thing that ever happened to people who want to keep abortion thought of and\nCategorized as something other than what it is the media wouldn't cover it and nor the trial very much\nThere have been a lot of people who didn't covered Michele market was one of the leaders also people at the like and Marcy of hot air was was hot on the trail of guys and I think they wrote over a hundred and sixty\nDifferent articles so the trick has been how do you do a movie about this how do you get it made me in\nMovie equals Hollywood how do you get stars had to get people to start at how do you get money to finance it how do you get made in how you get a distributed it how do you find the theaters\nThat will exhibits of thing how do you do or and they they ran into every predictable problem that you can imagine\nBut they ... and they got it done and the way they got this ... this is a movie about the trial of karma guys now it's it's it's a\nIt's a procedural moving like a procedural crop cop show crime and the cop show on TV meaning it follows a formula\nIt doesn't get overtly political it doesn't it doesn't want to limit the audience by getting political even with a trial this movie has a rating a PG Thirteen and it's about wanting abortion murder there is not a lot of\nHeart abhorrent Gore and\nViolence in the movie at its depicted in in other ways it's not meant to shock it's meant to entertain and educate it's an attempt\nTo you is a movie\nIn a responsible way to do things in movies are supposed to do entertain entertain entertain enlighten maybe inform it's not the political movie that the left would make\nAbout a story like this it can't avoid the politics but it is\nExceptionally well done for the subject matter you're you're not going to be if you go see it you're not going to be watching people advocating for a cause\nYou're not going to see a movie designed to separate you from your money in terms of political fundraising you're gonna see Hollywood professionals who happen to be pro life producing a movie about something that really happened\nA mass murder he was a mass murderer of\nPeople in the room that nobody on the left wanted anybody to know about\nWhat he did Kermit guys now was despicable but he was a charming guy even engaging smile and laugh and even and his trial it was said that he was\nCharming people now are oh buddy Nick\nSearcy directed this\nAnd I don't know anything about directing movies but I can imagine some of the challenges in in a movie like this you don't want to preach and you don't want to make your movie target but you want to be truthful about it and you want\nThe message to be delivered\nBut you don't want to turn people off you don't want people to think that you're being they're they're they're being preached or any of that\nAnd so when I looked at it I didn't I didn't see Nick Searcy use a bunch of special effects or other things to distract you just let the story tell itself and it's basically the trial there some set up\nThe story itself is all anybody needs to know the number one mass murder in America which he was never referred to as as because of course the\nLeft abortion is not even human it's a viable tissue mass or what have you uh it's got\nStars people that you know people put their careers on the line to star in this movie the odds are that they're going to have trouble getting cast and other movies having been identified with is dean Cain is one\nOf the uh the actor who plays a guy's now himself as a as an actor and I think ... commercials name is Earl Billings\nAnd for somebody that's only widely known as an actor in TV commercial this guy does one heck of a job it's probably the finest\nRole that he's played for the best performance that he's had a I Would guess or as an actor but I just want to let you know that if it if you're thinking about going to states PG Thirteen we're not talking ... we're not we're not even talking ours here so you're not\nGoing to be immersed in a bunch of\nRepulsive Gore and again it's it's thought that they don't need to do that tell the story the story itself tells itself\nThe trial of America's biggest serial killer there are a lot of people who have\nPut everything in their careers on the line to get the movie made they got it made a lot of people to put their careers with a line of agreeing to appear and start even Searcy a directing\nThe film [noise] ah\nSo now Yahoo News the American media\nIs attempting here to blame Donald Trump is Donald Trump and his open disdain and criticism of the media is said to have made Mohammed bin Salman comfortable with the fact that he could get away with murder and journalist because Donald Trump made him think it'd\nBe okay this is what the American media is now [noise]\nBeginning district you know this is just a tweet from a Yahoo guy holding cough but this don't be surprised\nIf there starts blowing up\nFrom this point forward right\nNow [noise] now the latest headlines from the double duty AG newsroom\nWG a gene is revived like Patrick investigation underway and before to the bottom side of the year in the Boston area a ninth zeroed happened on vengeance ridden Dorchester shortly after two AM yesterday and he has been ... report of a jazz emergency that result in explosions\nIn one death and Marron back valley last month it blames high pressure natural gas released into a low pressure Columbia gas distribution system\nWith a series of explosions September thirteenth over one hundred thirty structures damaged in Lawrence Andover and north Andover as a result\n... rubber accused at the flooding investors officials they Jane Seoul, Korea used invest your money to pay for his own lavish lifestyle and political campaign WC edging sports baseball game one best to seven and they'll dig s Dodgers that Milwaukee get the latest news twenty four seven that W Ga Ga dot com\nI Mike Patrick news radio five eighty or Ninety four ... W E a G\n... news weather in ...\nFrom the double duty AG weather center here's the latest forecast\nAfternoon everyone meteorologist pound of awkward gradual clearing afternoon high temperatures fifty to sixty degree weather night clear to start them becoming partly cloudy much cooler load forty to forty four of them are mainly cloudy camp showered cool I ... and on Sunday partly cloudy and cool I before to fifty\nEight degrees you can get your weather all day long on W. A. T.\nT. dot com\nSame\nBig of a head over to the bottom\nAll the basalt face more\nWe trying to make a little on\nThe weekend comes around [noise] we got the\nExperts to help you hang onto it\nThis is rich car host of the financial freedom show nine AM Saturday here on news radio double duty AG financial freedom man I don't like what's happening in return money one news radio five eighty and Ninety four point nine FM double duty A. G.\nHi this is snow plows Steve are you a snow warrior Eli I cook is looking for you to join our team experienced equipment operators ... truck drivers and ... crew members also subcontractors with your own plow trucks and there'll be equipment we're looking for you to give us a call was Bible wait\nSix five four three strict seven that's finally ... or visit us online at L. E. R. excite dot com slash snow partners\nThe law he number DAS\n\nGuy [noise] kind of Kenya [noise] can't get no satisfaction of stone in Nineteen sixty five boroughs before we got back to the phones one quick\nThing there's a an NBC opinion piece\nThat uh has appeared in opposition to the gods now moving\nAnd here's the headline with his taste legal abortion is vilified by the pro life cause no movie which inadvertently shows that dystopia\nOf a post ... America so\nWhereas we have a bunch of journalists trying to blame Donald Trump\nFor inspiring Mohammed bin ... murder aids so a Saudi journalist\nNow we have this NBC piece which is basically saying\nThat what this movie is inadvertently showing is what will happen if abortion ever becomes illegal guys like God's noble springing up everywhere\n\nThat guys now could not have be calm the mass murderer he became\nIf uh\nShouldn't have been legal which is a crock he did his monitoring after abortion become legal\nBut they're trying to say everybody you know you better you better not get what you wish for here because have you ever if you ever get abortion you ever roe versus Wade overturned you're going to have people like guys know popping up left and right which misses the entire point of this movie\nBut that's not a surprise at opponents would try to miss cast what's going on with this tweet saying that\nThe crown prince may have felt embolden by Trump's anti media rhetoric to murder a journalist [noise] yeah that happens in this country right we have a history of murdering journalist Donald Trump got who wants to first\nWas the first hurdle is the Trump a quarter to be killed for the company told me [noise] he's irresponsible jackass says okay head back to the phones a gym\nIn Jupiter, Florida right up the road great to have you with us or Hi\nHey thanks rush rush I'd that down in Miami last week 'cause I work I pass by what is to be the ground breaking up the largest mall in the United states and it got me to thinking\nI said to myself this is off plus the underwater two years ago it was all close to the underwear all of Miami a it was based on a two thousand it's seven Nobel Prize winning award winner Albert Gore predicted with full of Miami manmade global warming you know the rising sea level twenty feet\nWhich would be underwater and I just got to think well you know he's not good at predicting the future maybe can explain the past or someone please explain how about twenty thousand a year in a way that you know\nThis is really a great point and you're you're you're making a really great point here and and because it you're right on the money out Gore had said\nJust in general that current shorelines and he has he has mentioned Miami in South Florida in Manhattan he has predicted when they are going to succumb to rising sea levels would be underwater and he did say\nAbout Miami\nThat it was only a few short years that Miami certain parts of it would be inundated by rising sea levels and one of the places where he said so they are breaking ground on one of the biggest malls in the country do you have to ask yourself\nWho in their right mind would go out and get the financing and make all\nOf the decisions and hire all the architect everything else has to be done to build a gigantic mall only to realize it's going to be submerged underwater in a few years who would do this\nWhat kind of responsible planning commission would permitted what kind of developer would waste is money the plate is nobody really believes that where does mall is being built is going to be inundated by rising sea levels anytime soon\nThere's a there's another analogy to this ... Gulf Stream which\nIs a manufacturer of one of the largest most popular corporate aircraft in America the gulfstream series there's the G. five fifty ... about forty five ... four ... four fifty\nOr when they announced they were going to build the G six fifty the G six fifty as a like a foot wide or at a little bit taller um has a massive range days of the art interior\nAnd they announced this at a time\nWhere the media was telling us that we were on the verge of running out of fossil fuels and that the supply of fossil fuels finite\nAnd we were going to have to do something real fast because we're losing votes will be up to start conserving and fossil fuels it's a good thing anyway because they caused climate change and so forth and I asked myself why would Gulf Stream I happen to know the c._e._o. at the time\nI said why are you guys doing this if you how you're going to power this jet how are you ... if there isn't going to be any kerosene refine which is jet fuel jet a if you're not going to have enough jet fuel for anybody who buys this plane to fly it why are you going to make it\nSo well what you're hearing isn't true", "show_name": "The Rush Limbaugh Show", "year": "2018", "city": "Worcester", "day": "12"}