{"month": "10", "state": "NY", "station": "WAMC", "content": "Lumber yard dollars for tickets and from graduate studies that any new polls educating the next generation of computer scientists for the Hudson Valley new poll dot edu slashed graduated for applications [noise]\nThis is Northeast Public radio WAMC up and made the Ninety point three Albany doubled you argue energy Ninety point three bumps in Utica WAMC ... point nine Kingston doubled you will which are edgy Ninety One seven Middletown W. U. C. L. A. G. Ninety One Ninety\n... Ninety three three ... W. A. N. C. H. D. one oh three no anti counter real good WAMC ... five one great Barrington W W E S H da da na ... W ... Ninety\nOne Stanford W ANR eighty eight by Brewster WAMC am fourteen hundred Albany\n\nFrom American public media [noise]\n[noise] [noise]\nMy yard anger and yours truly the arena rock\n'n\nSurrender mind ... I Know\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nEmployee owned an independent\nBaptist kept clients financial interests for since Nineteen Nineteen\nAbout carbon I offering data protection solutions for businesses is including\nHigh availability in disaster recovery and data migration\nBy Sierra Nevada Brewing Company\nTo be here in San Francisco\n[noise]\nJust breathing breathing deeply [noise]\nOh I Wish you folks home could see what we're all thing right now just look deeply into your radios\nIt's a lovely side a lovely I think it everyone here and everyone back home listening in radio land for making our dreams come true yet another year we are back [noise]\n\nLong and ...\nNew friends Aerosmith to archery is hardly strictly bluegrass [noise]\n\nWhich is totally appropriate here at hardly strictly bluegrass\nThe Golden Gate park [noise]\nHard to put into words just how special this festival is but it's my pile\nSteve Earle put it\nIt's the most free live music reaching the largest number of people on a yearly basis anywhere in the universe that I Know of\n[noise] and\nI get to see my friends we get to see our friends here it's so nice nice to see all of you to see all of you [noise]\nThere's also usually a stricter there's usually a drinker\nBut that's beside the point I Know the question on everyone's mind today is how was my summer I had a great summer thank you for asking I spent a lot of time on a tour bus with my fellow punch brothers drinking my ties because they\nParalleled with the news cycle and I got to spend many happy afternoon on a playground in Brooklyn pretending to be chase from\nSometimes if I was lucky my son would like to but I also spend a lot of time this summer\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nYour memory about Mr Rogers\nWon't you be my neighbor have you seen it\nWell\nHave you stopped crying yet for\nAll the tissues on delta flight three Ninety were not enough to soak up my parents were not an official consider this my formal complaint twenty five thousand bonus miles deposited into my count on to cover it\n\nOn a serious not there's been a lot of confusion lately about what it means to be a map a real man Fred Rogers was a real man\n[noise]\nAnd I never thought [noise]\nI never thought I'd want my son to be more like a daytime TV star who played with puppets than a Supreme Court nominee [noise]\n\nOr the people who've\nTo where she's change going to turn this thing\nGo when they\nReally ah she'd go\nDaddy as you go\nFamily in the ... known\nNeed to\nWe want to do and don't really necessarily bleed red blue\nSeason [noise]\nMade me sad\n[noise]\n\nMm\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nMinus ... boy John gentlemen's channels from bars to begin with the harder so the lover\nMan\n\nThat's Joel thank the\n\n\nStreaming support for WAMC comes from Albany med now will win the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nCome my\n\nWell\n\n[noise]\n[noise]\nDon't know\n\nI just\nCome out [noise]\n\nBig [noise]\n\n\n[noise]\n\n[noise]\n\nMisfortune of the show is brought to you by San Francisco board of you are in them in our new slogan prince let's go in for you you love recipe taking visit does fresh seafood in great Nightline\nIn San Francisco is suffering you I'm a software engineer and father to San Francisco it's for you know visual artist dinner like San Francisco is for you I'm an ER doctors studying to become a Buddhist monk\nSan Francisco is definitely for you\nDo I make you feel like\nStreaming support for WAMC comes from Albany med now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu for you\nI'm a studio musician in transcendental meditate or was counting on the days till November sick like an advent calendars [noise]\nSan Francisco\nI use cloth diapers and walk sandwich bags\nYou know it's for you\nGo to the doctor because I've discovered the healing heart power of quartz crystal\nThan friends for you baby hey do you want to be a part of the new economy ... get on your computer and check us an\nIdle limited my carbon footprint and I agreed to a new test every year it's\nI'm a kind of guy looking for a place to live that slightly more expensive than Manhattan but as an LA\nSan Francisco and definitely for you\nDowntown and make two hundred and fifty thousand dollars a year and can't afford a studio apartment in Douma maybe Oakland is for you [noise]\nVolunteer on a ... because I live off my parents' trust fund\nSan Fran for years I'm a Reagan who wants to be buried in a mushroom back\nI had an eyebrow total monthly made it a few friends\n\nAt the time a number of our stations need to take a break until their listeners what station they're currently listening to and what the weather is like in a place where they currently are we'd like to take that opportunity to play a piece of music\nThat comes from where we currently are this week's local break features the great Oakland band tower of our [noise]\nUh [noise] what is hip [noise]\nBut I just think that one\nThe last saw him well that was made by the time you're done how can you\nHe did\nDon't set\nStreaming support for WAMC comes from Albany med now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu and\nAbout it\n\nNear here from Livermore performing arts center October twenty fifth ladies\nPlease take a moment to join me in welcoming for the first time as musical director the secret to wizard himself Mr Mike Elizondo no [noise]\nFor some folks are my for his contribution already and we're really lucky to have him with us all\nSeason long and hey we're excited to announce a brand new segment\nThis season one that runs contrary to my nature is a control freak\nWe're calling it three minutes of the improv three minutes of improv [noise] we have no idea what's going to happen\nBut I Know that it's one of the great pleasures of my life to play music with Mike Elizondo surfer this first installation\nOf three minutes of improv we're going to say a timer for three minutes start playing\nAnd see what happens\nWish us luck this is a beautiful place right\nHow does it sound in your heart and had to end figures you\nRight now being in this place\nIs is this your first shows ... move your mouth you know I think you got to take this from Chris that'd be ... I think you got to take this one man it's it's it's all you\nAlright alright tough tough but fair I'm okay\n\n\n[noise]\nMm [noise]\n\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n\nFor a minute to ... [noise]\nI Can't believe that my life including it's getting to do something\nBut or bring you\nThe Lindsay Buckingham show [noise]\n\nHad a ...\n...\nCan dream\n...\n... now and\nTreaty you won a\nOh\nGo\nI'm no longer my\nI\nDid yeah\nOh\nYeah\nOh my God\nCan he\nSees\nYou clearly yeah\nStreaming support for WAMC comes from Albany bed now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot E. D. U. ...\n...\nThe ...\nYou try to\nAnd ... and\n... the\nWhole\nMan yeah\nSo a a\nAnd have them\nThe\n... yeah\nBall then bowl or a nurse\nI Know a good job I\nAnd I'm ... ...\n...\nHas a ... a\nSpecializing in homes in Saturday's Woodstock Kingston and beyond ... real estate dot com twenty well real public has great parents and Massachusetts seasonally inspired public that now offering traditional would fire near pilots and pizza catering menu and that works at twenty will load\nMerit bookstore no broken independent bookstore hosting book clubs author events workshop than children selection dedicated to both the toy merit bookstore Dakar live from here banned [noise]\nA dark time and [noise]\nAnd this is about to be [noise]\n\nTo be that um you know that\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu the\n[noise]\n\nGift and it does it does you know this does he had he would\n\nThe next song is called by\nThat means to move forward and that's where we got to go no matter what [noise]\nTo get back home these something\nOh I just want to fall in line\nI don't think\nNot mess it up\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWoman or man\nRight [noise]\n\nThing [noise]\nThey [noise]\nThey say that\nThese some ... [noise]\nOne lately\nMan\nBut do you\n[noise] [noise] [noise] [noise]\nThen he said oh God\nDon't know or I'm\nIs ... times and I don't\nOr any you know\nNow\nAny day now Mm\nWind\nBreakdown strange\n[noise]\n\n\nStreaming support for WAMC comes from Albany med now will be in the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n[laughter]\n\n\n\nNo matter what I Would always be a reunion\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nIs nothing short of a ray of light as one might expect upon hearing her music such a\nThem they fall due to the\nFor the models oh [noise]\nGot to be\nLibya or read [noise]\nPublish off his birthday segment with the one and only Julian wild\n[noise]\nTo stay\nYou know whenever I get down about the world I remind myself that it contains a whole lot of Gillian ...\nThere's a piece of profound to music by going all out for any occasion including this one\n\nGuy\nStreaming support for WAMC comes from Albany med now will be in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nMan in the\nAh your goal is gone away\nWell why not go please don't you\n\n\n[noise]\n[noise] [noise]\n[noise]\nSo is that it's time for an instrumental this instrumental brick is supported by Sierra Nevada beer crafted to be instrumental to your weekend\n[noise]\nSupport comes from animal farm foundation a nonprofit training and donating shelter dogs to help people with disabilities teach life skills to be incarcerated and work with law enforcement animal farm foundation dot org know Linda WAMC performing arts studio\nPresenting a range of concerts bill theater a discussion\nFor the capital region the Linda dot org\nBarrington Stage Company Pittsfield, Massachusetts presenting Tennessee Williams is glass menagerie a classic way where reality and delusion collided miss during family drama\nThrough October twenty first Barrington thing she died on the tank teaching museum and art gallery in Skidmore College present in Davis when we're dancing\nI get ideas opening with a gallery talk with the artist\nA public reception follow ups over twenty four pm get more dot edu slash pay\nAnd from the art museum that Canada Jim Carrey resenting harvest beets October Thirteen to benefit the museum\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nLive music ticket information at our kill museum dot org [noise]\n\nGold gold rush for a\nFor our target is on the Federal Reserve critic over\nOn the guitar [noise]\nYou had seen her on ... and you can check out her jaw on Comedy Central it's done very funny and the only\nIt became for music and I'm telling jokes what's going\nOh I always wanted to say that for him to come true\n... ...\nWhat do you do me so\nFor one thing you\nYou\nMm\n[noise]\n[noise]\nOh\nThis is my favorite but\nIt's my favorite clarify he is so how old are your what what's my tight skinny\nDreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu hey\nGuys welcome back I'm Chad can start you off with some drinks tonight\n... yes yes that will have a bottle of the house red please and thank you how you\nBet I'll get that out you guys ... okay thanks [noise]\nUm [noise] and I may I\nPoint out to you that you were just totally rude to my favorite server uh may I point out to you that your favorite server just called this guy is\nYou guys he said it twice I didn't even notice of course not we've been called dies our entire lives we don't even hear it anymore but once you start noticing\nIt it's than men are only a few days ago my nephew from his high chair was saying to me and my mom well what are you want from you guys Thomas and that's not funny [laughter] but come on women\nCall each other guys all the time that's the point where all too happy to be like she\nWas in with the most valued gender is cool he's coming back\nFor a guy's house read for ya but you guys like to a place first or oh ths outfit so that's a little spill there okay oh man oh boy I thought there goes my apologize\nIt's fine it's not really why don't we just order um I\nHave like the all of the book a teeny place yeah the ... for the woman and I another woman with like the ... okay\nOh get that right in and again those are I guess yeah [noise]\nI might put this fork in my ... crushes over in magic and if you walked up to a table as dudes and was like hey gals can I say often during their fight there would be a free gang fight they'd be like what do\nYou just call laws\nChic dude let's go pee on ... yeah\n[noise] you\nNever thought about that you know I think it's weird that the mom carried the baby for almost a year you know read her life and childbirth and then we named the kid after the dad in one of the dad do the equivalent of ...\n[noise] but you're right their names are on everything yeah every street I walked down is named after him in every building I Walk into is named after a man when I was born I was named after a man and if I ever marry all have the option of changing from being named after one man to be named after a different man\nMan James Brown was right it's a man's man's man's man's world [noise]\nIt's just three man says it's a man's man's man's where I could have started with man's man's man's man oh you're thinking of as a mad mad mad mad world oh I Am\nHere's one beyond say who runs the world okay who'd win in a fight between beyond saying James Brown Green Bay would clean up dude don't call me did oh sorry\nVicky joke you hear some fresh bread for ya but be careful the plate is hot [laughter] just like you to come on [laughter] hey I'm maybe this is to forward but ah I see you in here a lot I was I was wondering if maybe you'd like to get coffee sometime\nOh why oh Chad that took some over read oh I'll tell you what is that if you have a single friends maybe we could double date with you gals\nUh I don't know what's happening right now\nI was just wondering if you'd like to go out and get some coffee\nYou know what she'd like how about a little R. E. S. P. E. C. T. were not lesser than we are tired of being called guys at the end versus\nStreaming support for WAMC comes from Albany med now will in the mastery family children's emergency center a place for ill and injured children more information at AMC dot E. D. you know [noise]\n[noise]\nIt's gotta be more at all [noise] Serino broke\nY'all\n\n... ...\nYou know yeah and hit me he yeah\nAnd made me see well I'm\n... yeah\nKnow going back to the\nKeys\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot E. D. you", "year": "2018", "show_name": "Live from Here", "city": "Albany", "day": "06"}