{"month": "10", "state": "GA", "station": "WNGH", "content": "Serving Augusta and feel sorry this is gp be we're in Eighteen station service of Georgia Public broadcasting Andre Dawson it's a minute before the our ten o'clock one a is next and eleven o'clock\nThe feel sorry this is G. P. B. where an Eighteen station service of Georgia Public broadcasting Andre Dawson it's a minute before the hour of ten o'clock one age is max and eleven o'clock it's on point on G. P. B. S. G. be moved out of work on the next fresh air\nI Believe this nation shouldn't committed cheating the goal of landing a man and the more\nWe ... who directed the new movie the first man I met Neil Armstrong the first man to walk on the ...\n... also wrote and directed la la land\nPressures this afternoon at three here on G. P. V. I. N. G. P. B. news dot org\n[noise]\nNinety seven point seven FM WG P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\n\nMachine we made this mess and now we have to clean it up and time is running out a new report gives reasons for concern\nFrom W. A. M. U. and NPR in Washington DC is ... ... [noise]\nHey there I'm Joshua Johnson today on one a controlling climate change the report is clear at this pace are warming planet we'll show major signs of irreversible damage by the year twenty forty we know what to do but that's not the problem the problem is getting the world's governments to do it\nHow do we overcome the political challenges of fighting climate change and how much do individual actions like planting trees or going vegan really make a difference in saving the planet\nWe love to hear from you email one\nAt a at W. A. M. U. dot org comments on our Facebook page or tweet us at one egg [noise]\n\nFrom NPR News in Washington on corporate Coleman hurricane Michael is a little more than fifty miles off the Florida Panhandle with top sustained winds of one hundred forty five miles per hour it's a category for storm very close to a category five\nSome parts of the Florida Panhandle man Big Bend region could the storm surge between nine and fourteen feet enough to swallow some homes\nFlorida governor Rick Scott is urging people who've been told to evacuate to leave now listen to local ...\nAnd up to swallow some homes Florida governor Rick Scott is urging people who've been told to evacuate to leave now\nListen to local officials do not want to be the person who survived the storm just to put your life or your family's life at risk after passes because you didn't listen to local officials [noise] during the storm first responders cannot come out and said you it's too dangerous [noise]\nNow is it time to prioritize to keep your family's faith do not take chances\nThe storm is expected to crash into Florida in a few hours then rocket north through Georgia and the Carolinas before ... into the Atlantic ocean\nMeanwhile Georgia's governor is issued an emergency declaration for hurricane Michael from member station W. A. B. E. and Atlanta ties named ... reports the state is bracing for the storm this week\nA state of emergency is now in effect for Ninety two counties in Georgia and head of hurricane Michael governor Nathan Deal says the state's watching the path of this storm closely\nFears that those southern county is all one is going to be most likely impacted and we will put in place all of the provisions related to an emergency declaration were just hope that it is not too severe and that it does not last too terribly long\nThe emergency declaration is in effect for seven days already Atlanta's Hartsfield Jackson international airport has canceled forty five flights today for NPR News I'm this name ... in Atlanta\nThe Russian foreign ministry says five party talks involving the United states north and South Korea China and Russia are needed to ease tension on the Korean Peninsula\nMatthew bother reports from Moscow stayed comments rather statement comes after Chinese and North Korean deputy foreign ministers met their Russian counterparts today in Moscow\nIn a statement released following the conclusion of meetings with the Chinese and North Korean diplomats Russia's foreign ministry now says the multilateral talks or the way forward the three parties also said and the joint statement that the United nations should begin looking at using sanctions on killing young\nAs part of a coordinated process toward denuclearization under President Trump the U.S has been actively engaging North Korea to end of the nuclear stalemate\nFollowing secretary of state Mike Pompeo's recent visit to pee on young\nSouth Korea said that North Korean leader Kim Jong who was planning an imminent trip to Russia for NPR News this is Matthew Bodner Moscow\nOn Wall street stocks are sharply lower the Dow was down two hundred sixty two points or one percent the NASDAQ has down nearly two ...\nMatthew Bodner Moscow on Wall street stocks are sharply lower the Dow was down two hundred and sixty two points or one percent the NASDAQ has down nearly two percent this is NPR\nLive from the GPS newsroom good morning I'm Dawson just ahead on one a what can individual private citizens due to stave off the looming and disastrous effects of climate change we'll talk about that\nBut first in the news a new Associated Press University of Chicago pull relief to today shows that nearly eighty percent of Americans\nAre concerned that the nation's voting system might be vulnerable to hackers that is roughly unchanged Trump concerns about election security just before the twenty sixteen presidential election but with a slight twist two years ago it was Republicans who were more concerned about the integrity of the election this year it's Democrats\nCity officials from Stockbridge appeared before the state Supreme Court yesterday to stop a referendum that would split the city in half the new city of eagles landing would be formed by the ... thing about half of Stockbridge and combining the land with unincorporated portions of Henry counting\nAttorneys were Stockbridge say the November referendum violates the state's constitution by asking voters to approve to ballot question simultaneously one question asks voters to approve the annexation the other asks them to approve the creation of eagles landing city attorneys for eagles landing say the questions are calling for two separate changes\nAnd Clayton State University is launching a new digital academy the launch pad academy is funded by three uh three hundred thousand dollar grant from Atlanta based marketing company mail chip\nSport if the coursework students will build software to address a problem that the Clinton state community faces from Georgia News Go to Jean ... be news dot org and follow us on Facebook and on Twitter we are at gp be news [noise]\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and as a ... who pair premiering October twelve on prime video\nGp whether large sections of the state or under weather advisories into Thursday as hurricane Michael moves across the state in the southwest a hurricane warning has an effect along with a tornado watch for Albany Valdosta fifth and in other cities\nMaking America as doubling in other parts of south Georgia or into a tropical storm warning a flood watches also in effect from South and central Georgia all the way up to Athens and he expects sustained winds\nExpect sustained winds of up to forty five miles an hour wind gusts up to Seventy across portions of central Georgia some areas may get six seven inches of rain\n[noise]\nThis is one day I'm Joshua Johnson in Washington ten to fourteen years\nThat's how long you and I have to do something about our changing climate now it's hard not to sound melodramatic reading the latest findings from the Intergovernmental Panel on climate change\nTo limit global warming we will need and the reports words quote rapid far reaching and unprecedented changes in all aspects of society unquote\nThe estimated cost fifty four trillion dollars\nThere is no precedent for pulling off something like this and the report says we are rapidly approaching a point of no return but if we can make changes now we can limit the warming of our planet is there the political will for different countries and industries to come together\nOr should we just start taking lots of pictures of coral reefs now so we can tell our kids are all about them when they're gone\nJoining us to discuss it is Coral Davenport energy and environment reporter for the New York times Karl welcome back to the program\nHi great to be with you and in Tucson, Arizona one of the authors of the eye PCC report Diana Lieberman is a professor of geography and development at the University of Arizona professor Lieberman welcome\nGreat to be with you we also welcome your questions and thoughts about this report and about the prospects for ... fighting climate change effectively email us one a at W. A. M. U. dot org tweet us ... when a or comment on our Facebook page\nLet's begin Doug professor live from and if we could with a comment from the chair of the IPC the group behind this report we suddenly he's part of what share leaf said at the conference where the report was released\nClimate change is occurring already and affecting\nSystems and I believe it was all around the world [noise]\nDegree of warming math has\nTremendous benefit and admitting to at one point five even sensors in terms of eradicate public as well as a kid in sustainable development [noise]\nProfessor maybe a good place to start will be to put the power of a degree in to contacts ... we'll be talking a lot about one point five degrees Celsius and two degrees Celsius and to point seven ...\nSo maybe a good place to start will be to put the power of a degree in to context ... we'll be talking a lot about one point five degrees Celsius and ... and keep on some degree Celsius\n[noise]\nSupport for G. P. B. programs comes from our listeners\nAnd middle Georgia State university offering a fully on my master's degree and information technology with concentrations in critical infrastructure management cyber security and digital forensics middle Georgia State visit M. G. A. dot edu slash IT\nDoes your busy life keep you from staying informed TPP has you covered you can listen live the TPP news dot org and on your smart home device follow us on Facebook and Twitter ... G. P. B. news [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that matter to you on the beach if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\n\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information or at bona dot com\nAnd from the navy and committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations math ... dot com slash NPR\nThis is one a I'm Joshua Johnson we're discussing climate change and how long we have left to stop or a warming planet from going past a point of no return and what we can do about it there is what we can do but are we willing to do it\nWe're discussing it with the University of Arizona professor dying of liver men who helped contribute to this new report and Coral Davenport who covers energy and environment for the New York times you've already had quite a bit to say we got this\nThey're dying of liver men who helped contribute to this new report and Coral Davenport who covers energy and the environment for the New York times you've already had quite a bit to say we got this message from Andy who was an oyster farmer in Alabama here's what end the left in our inbox\nWhen I moved here in Nineteen eighty there were marshes or Easter shrimp crabs and dozens of fears now much of that has gone\nI've got my first appearance on each well it was destroyed two weeks later by Hurricane Isaac rebuilt a lawsuit again tonight in twenty Seventeen and then again to Gordon and twenty eight team now I'm watching my approach\nHandy thanks very much for writing in sorry to hear about what's been going on with your peers and I know that hurricane Michael is very worrisome it is just about\nTo hit the Florida Panhandle so I Know that you're watching that very very closely I Wonder professor liver men if you could speak to part of what Andy\nSaid I've seen a lot of my friends on line saying the climate change and people say there's no climate change and look at these hurricanes that we've been having it how much should the average person be packing things like hurricane Michael\nDirectly to what we're seeing from from climate change there's still a lot we don't know about the cycles of severe weather but what do what would you say to people like Andy who are worried about this kind of thing\n[noise] it's all about let's heartbreaking I had paid ... ...\nThat we can't say that the American\nDirectly related to global warming but we can say is that ... these ... increasing as a result of global warming because no amount of atmosphere had no energy can hold more water ... are\nThe chances that based on the extreme events sweaters harkens or extreme rainfall all heat waves are increasing with every little bit search warming\nLet me get to a few more of your comments Sarah emailed I feel overwhelmed by the talk about climate change\nAnd don't feel like there is a unified voice out they're letting families no what concrete steps they can take to make a difference for our family this has led to ever present feelings of helplessness anxiety and guilt about the choices we make every day Sarah we will be talking about some concrete options in just a moment but let me get to a few more\nThoughts that have come in the far Joel emailed\nYou should stop framing this as what will politicians do politicians reflect the people that voted for them half the voters in the U.S read Donald Trump\nYou should stop framing this as what will politicians do politicians reflect the people that voted for them half the voters in the U.S read Donald Trump's tweet that global warming was a Chinese hopes\nAnd voted for him anyway that just goes to show how important the issue as to the people in this country\nColder before I Wonder if you could respond to Joel's email I mean the president has committed to taking us out of the Paris Agreement he kind of questions the provenance of the agreement by saying well who wrote it up let me see eroded mental believe it does Joel have a point\n[noise] uh well in in terms of um Paul policies being the policies that address climate change on the U.S really isn't a\nA distinctive place right now I think I'm Around the rest of the world we do see an expression of will by leaders\nTo um enact policies to limit greenhouse gas emissions I think that there's a lot of questions on how strong this policy is actually are um you know the analysis shows that they're they're not strong enough to limit or I mean even to that that initial two degrees but do you in the U. S.\nUm what we see is President Trump not only you know essentially questioning that the basic established of of\nClimate change but but also moving to undo existing climate policies I'm President Trump has already moved forward with policies to undo regulations on greenhouse gas emissions from power plants on undo or weekend um regulations on greenhouse gas emissions from cars\nUm and he had said that it is his objective to promote the use of coal burning coal is one of the leading contributors to greenhouse gas emissions\nA President Trump wants to promote the use of coal in the U.S and abroad um one of the findings of this report is\nThat in order to um limit greenhouse limit climate change to um you know to to to the sort of least destructive\nUm level of warming\nUm the use of coal will have to uh basically go down to zero\nI'm by by twenty fifty so we have basically no more on just about no more coal and and and and it is you know that that it that is an extremely disruptive policy recommendation um there's no question that there are industries and people who will be harmed who who will have their\nLee disruptive policy recommendation um there's no question that there are industries and people who will be harmed who who will have their livelihoods disrupted by policies that go in that direction and not\nLet me just once I started to shore call but I I Wonder in terms of the politics behind this and I hear you on I I totally hear you on how disruptive is is it's all like coal is so interwoven in the network of America's energy grits kind of hard to just take it all out I Wonder though in terms of the voices on the world stage who\nWe we know that there are voices who are saying well poll it'd be really hard to pull out to get the sense of there's anyone in the world stage saying tough our planet has only home you light pole tough we got to get rid of it deal with the phone you are ... so Jerry Brown the governor of California for sure\nYeah and many of the ... the president of France has sought to kind of a step in and um\nHe he's trying to carve out a place for himself as a as a leader on climate change it's it's not difficult for France to take that position because France um doesn't really use coal um so but but but we I mean we absolutely see world leaders saying you know this is what what needs to happen um\n... in China it's very interesting because um China is the world's largest\nUm greenhouse gas polluter and is a massive user of coal at the same time we're ... the Chinese government has moved forward with I'm actually in acting um prices on carbon ah they're they're they're an acting a cap and trade system that would force\nUm carbon polluters called polluters to essentially pay a tax or if the um I did in in order to pollute which is designed to drive the market away from from greenhouse gases an idea that was invented in the United states but as\nI'm considered sort of politically toxic here in China they can implement it by ... they don't have to deal with Congress voting against it as I can do in the United states\nDoing it again it's more about that idea of carbon taxes we continue in just a moment but let me get to a few more comments Brian emailed we have no leaders anymore with their skills or courage to do what's right regardless of the political cost we\nWill keep polluting as long as the price of fossil fuels is low would be interested to hear from some of you listening who you trust who you think some of the leaders are politically in this country around the world who you believe\nIs low would be interested to hear from some of you listening who you trust who you think some of the leaders are politically\nIn this country around the world who you believe are sincere in their pushed to do something significant about climate change is there anybody that you think is for real and saying that we're going to make this happen or maybe if you were active with\nA politician or a government leader or a government agency it's doing something tangible that you feel people should know more about we love to hear from you what gives you hope\nThat climate change is something that is actively being worked on where you are email is one a at W. A. M. U. dot org by the way we've been talking in terms of degree Celsius yes I Know where we are if you need a little conversion\nOne point five degrees Celsius we mentioned one and a half degrees and two degrees for those of you don't have a conversion calculator in your head one and a half degrees Celsius is about two and a half to point seven degrees Fahrenheit and two degrees Celsius is about three and a half degrees Fahrenheit about three point six degrees anyway\nGood at ... dot org and click donate and thanks so much for your support of Georgia Public broadcasting [noise]\nSupport for G. P. B. comes from our monthly sixteen years\nAnd Hartsfield Jackson airport offering a new ATM rewards program participants can earn points for parking dining and shopping and redeem them for miles hotel stays in more complete information at age ... dot com slash warts\nYour support allows ... to bring you great weekend programs that are both informative and fun like wait wait don't tell me asked me another planet money kick out our entire radio programs scheduled at gp be news dot org [noise]\nThe magna Tucker ... coming up with an at some point when Korean born Nicole Chong looked in the mirror she saw a girl who didn't look anything like her adoptive parents [laughter] she tells the complicated story of trans racial adoption in a new memoir all you can never know what's coming up in the next ... from NPR's\nFor just this morning at eleven here on G. P. B. [noise]\n\nSupport for NPR comes from this station and from love me in makers have go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com [noise] and from the alliance for lifetime income or not\nTeachers to help people stay focused to get work done learn more and go to meeting dot com\nAnd from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement [noise] more at alliance for a lifetime income dot org\nBack down to our conversation with Coral Davenport of the New York times in University of Arizona professor dying of liver mint we got a number of messages from you in terms of how you are trying to make an impact with the fight against climate change here is a little mash up of two of the messages we got this is Amy from Chesapeake and Jeff in Michigan listen\nI'm getting a thought [noise] ... ... ... ... and that they have to stop the path of destruction Iran\nI pessimism comes because I Believe that what's happening to the world is happening at a corporate level and I'm Still\nMore companies get on board and care about the environment it feels like we're kind of on the inevitable path um two thousand forty will be here before we know we will reap the consequences\nThanks Geoff an Emmy for sharing your thoughts with us ah speaking of the corporate path there are some corporations who are taking a position in the fight against climate change including with regards to the carbon tax Melissa tweeted\nChina uses more than twice as much coal as the U.S hard to believe some carbon tax is going to make much of a difference considering their population let's talk more about carbon taxes with one more of our guests joining us from London\nTed holstead is the chairman and CEO of the climate leadership council Ted welcome\nWant to a [noise] good to be with you Joshua what is the climate leadership council [laughter]\nIt is a group a that is co founded by a white actually the brought us climate coalition in us history to back in national solution is pushing for a carbon tax or all the money is related to the American people in the form of ... of ... of a dividend\nWho were some of the backers of the council where does the funding come from so um the council is ah does not accept corporate contributions but our founding members include four of the uh oil majors the largest car manufacturer in the United states the largest utility\nA major is the largest car manufacturer in the United states the largest utility but also the largest a solar company in the United states a very broad coalition it also includes two leading environmental groups and opinion leaders from across the political spectrum ranging from\nBen Bernanke key to Janet Yellen to Larry Summers\nAnd of course our plan is named after former secretaries of state James Baker and George Schultz the Baker's shoulder carbon demands plan but Joshua let me clarify we have there is a separate spin off organization that has a lobbying organization and that now has corporate funding including from Exxon okay\nAnd they just connect with the organization or use it as a spin off but it's still a connection in any way or completely separate\nUh it is a separate organization that is the advocacy arm of the climate leadership council so the council develops this groundbreaking breaking plan were all sides wind and Americans for carbon dividends which was co chaired by\nFormer Republican Senate majority leader Trent Lott and a a center bro that group lobbies for this plan and it now has money from oil natural gas solar wind and nuclear power interests\nCold ever Fort let's take a step back before we get into the plan that the climate leadership council is advocating more specifically defined this term carbon tax for what exactly is a carbon tax shores\nSo um\nThe idea of a carbon tax is um ... each ton of carbon dioxide emitted into the atmosphere um you can put a price on how much economic harm it causes\nUm and at ... and I ... and important note on that as the the economist who came up with with that idea his name is William North house he's a professor at Yale I'm was just awarded the Nobel Prize for this idea on Monday\nOr the same day that the IPC came out with this report which heavily sites I'm professor north houses work\nUm so he came up with the idea of\nEvery ton of carbon um traps heat in the atmosphere and you can put a price on how much each kind of carbon hurts a the global economy um and and there's a range for how much that costs that it it can range from um fifty dollars a time to a hundred dollars a time when\nI'm you know there there's there's debate about about how much\nUm actual harm it can cost at once you sort of place that\nOn to a hundred dollars a ton um you know there there's there's debate about about how much\nUm actual harm it can cost that once you sort of place that price on carbon um than you are can essentially um create attacks I'm at a price on carbon or attacks on carbon that you would impose upon polluters of carbon dioxide no we do\nKnow a lot of carbon cruel I Want to be really clear in terms of who the taxes paid on I mean if I Am a car maker do I pay the pollution from automobiles does the carmaker\nPay a carbon tax for producing the vehicle that belching out carbon dioxide or does the oil company pay the carbon tax for finding the gas alone to turn a plea\nMost likely you pay at a as a car driver I'm looking and and and and you you would so um we don't have carbon taxes in the U. S. um so in some ways this this is sort of um\nYou know and intellectual debate although other countries are are are working are sort of further along on this but the idea is\nUm if this would affect how you drive it would probably um be taxed based on how much carbon monoxide would be produced by burning 'em by burning gasoline show it would most likely be added to the cost of the gasoline that you put in your car so if you're going to put in\nAnd it mounted gasoline in your car that would produce a certain amount of carbon dioxide when you burn it that would raise that tax would raise the price of your gasoline and the idea is then you would be motivated to buy a car that use less gasoline essentially that that's how it would\nDrive the market so consumers would want to buy electric cars would want to buy efficient cars\nNot because not out of some sort of\nA moral sensibility but because actually a a a price on carbon would make it cheaper to use an electric car it's a it's a powerful in the market signal\nTo hosted the yesterday Exxon Mobil committed money to lobbying Congress for a price on carbon give us a sense of what the plan involves and why it's getting support now\n[noise] so um the bigger shields carbon difference plan is based on four pillars of the first is a robust carbon tax starting at forty dollars per ton which would actually be the highest carbon tax of any\nA leading emitting country all the money would go directly back to the American people in the form of a carbon dividend\nWhich means that the vast majority of America\nBut go directly back to the American people in the form of a carbon dividend which means that the vast majority of American families including the most vulnerable would win economically from this plan\nAnd a third pillar is that we would trade a high price on carbon in a growing price on carbon\nFor some of the carbon regulations simply because a carbon tax is a more cost effective way to solve climate change\nWho I just wanna make sure I understand so the plan if the plan went into effect there would be a tax on the carbon that I Am it with my car or my motorcycle or whatever and then that the revenues from that tax would come back to me as a taxpayer in the form of a of a dividend is that what she called\nYes so a family of four would get approximately two thousand dollars per year\nIn dividends and here's how the system would work the more you pollute the more you pay the less you pollute the more you win so Seventy percent of American families would come out economically ahead and that's what's so transformative about the dividend concept which is that we can have\nThe most effective climate lever which is a carbon tax in a manner that is popular populist and equitable for the American people\nHow much of that money would be spent on environmental programs are planting forests or doing research on cleaner energy with all of it just come back to us as taxpayers", "year": "2018", "show_name": "1A Plus", "city": "Chatsworth", "day": "10"}