{"month": "10", "state": "GA", "station": "WNGH", "content": "I'm trying to heal for all things considered this afternoon from forty seven here on TPP\nServing view food and beyond this is gp were an Eighteen station radio network of Georgia Public broadcasting Andre Dawson it's a minute before ten o'clock so good to have you along today\nThis is gp we're in a dream station radio network of Georgia Public broadcasting under dos and it's a minute before ten o'clock so good to have you along today one a is mixed on G. P. B. S. G. P. B. news dot org\nAnd the next fresh air going up with an accent mother who was addicted to heroin\nAnd raised by grandparents who gain legal custody the captain Jarrett jak ... about his new graphic memoir for young adults hate kiddo how I lost my mother found my father and dealt with family addiction it's nominated for a National Book award he also does the lunch ladies\nSeries China\nShares that ... you can listen live on line and keeping dot org [noise]\nNinety seven point seven FM WG P. B. S. W. GBH the rural part of Georgia Public broadcasting radio network [noise]\n\nFor climate change is solid put support for that evidence is\nHow do we change the climate of the climate change debate [noise]\nFrom W. A. M. U. and NPR in Washington DC is one egg [noise]\nEither I'm Joshua Johnson today on one a how to discuss climate change is one of those topics that make people digging their heels and argue like crazy a big issue wrapped up in deeply held beliefs so of course that means the discussions tend to go nowhere will get tips on debating climate change in a productive way\nWe shift gears to the British royal family's new baby a light hearted story comes at a heavy time in the u._k. is this just a distraction from breaks it or something\nWe love to hear from you email one day at ... am Utah board or tweet us at\nLive from NPR News in Washington I'm corporate Coleman hurricane cleanup continues along the Florida Panhandle the death toll across several states remains at Seventeen people\nBut dozens of other people are still missing and rescue teams and loved ones are continuing to search for them and ... on the low long reports tens of thousands of homes are still without\nUtility companies are scrambling to repair downed power lines across the region Florida governor Rick Scott has been sending extra cruise to help by clearing debris from roads visuals a warning residents devoid touching downed wires run Florida's panhandle\nAcross the region for governor Rick Scott has been sending extra cruise to help by clearing debris from roads officials are warning residents devoid touching downed wires run Florida's panhandle hundreds of families now without homes are continuing to shelter in schools and community centers\nHundreds of National Guard members from Florida and other states are helping to lead search and rescue efforts and Bain Gulf counties to various hit hardest by hurricane Michael ... along NPR News Destin, Florida\nSecretary of state Mike Pompeo is in Riyadh Saudi Arabia he's met king some on to discuss the case of missing Saudi journalist come out ... shaped Turkey's government believes he was murdered inside a Saudi consulate in Istanbul NPR's Michel ... is traveling with secretary in Riyadh\nOr State Department spokesperson said that determining what happened to the show is of great importance to this administration they want to sit down face to face in ... in here on their side of events before rushing to judgment about anything um and you'll remember that the president himself has\nBeen very hesitant to to speak out too strongly about the Saudis also he says that you know he doesn't want to upset lucrative arms deals with this out is NPR's\nMichel ... and in Riyadh news reports have indicated the Saudi Government is considering saying that ... died during an interrogation gone bad NPR has not confirmed those reports\nTalks remains sold over the United kingdom's exit from the European Union known as Brexit there's fresh speculation UK and ... negotiators cannot reach a Brexit deal Teri Schultz reports from Brussels a key meeting is set for tomorrow\nEuropean Council president Donald Tusk some indication letter to a new leaders\nWarned them to prepare for a no deal scenario that use your status of the border between a member Ireland and Britain's Northern Ireland remains the biggest sticking point you prefers keeping Northern Ireland in its customs union\nTo avoid setting up checkpoints the urge to block traffic and trade but Britain's Brexit minister Martin calling in and says any customs arrangement involving continued a new regulations would Only Temporary\nOff without a huge victory was on the area\nTalent and still says Britain does want a deal Latvian foreign minister and goes and cabbage puts the odds of that at just ... fifty for NPR News I'm Teri Schultz in Brussels\nOn Wall street stocks are all up sharply the down S. and P. five hundred and announced that indices are all up more than one percent\nIt shows and brought on Wall street stocks are all up sharply the down S. and P. five hundred and ... indices are all up more than one percent this is NPR\nLive from the TV news remind melon Reinhardt a new United Nations report says we have a short window to address the long term effects of climate change and that immediate action is required by governments and corporations around the globe but it seems people still can't get together on whether climate change is happening or not one age takes a look next but first a look at Georgia news\nNew degree program at Augusta University is strengthening Georgia's reputation as a destination for cyber education GBDs screwed often has more\nThe new bachelor of science in cybersecurity engineering was approved by the board of regents last week it makes the universe would be the only one in Georgia and one of just a few in the country to offer the degree you provost Dr Gretchen Kaufman told W. R. D. W. TV that\nWhile most cyber security programs teach sophomore security only just wouldn't include hardware design and construction\nWe have a number of students who have for a while now says if a if we had an engineering degree around that they would really be interested\nYou plans to hire twenty new faculty members with twelve in place on the program launches next fall for GDP news Andre Dawson in Augusta\nA historically black college in Augusta has lost a lawsuit seeking to preserve its regional accreditation\nA federal judge ruled against pain college and its lawsuit against the southern association of colleges in schools the Atlanta based a credit agency put paint on warning and two thousand eleven after a number of financial management problems\nLosing accreditation could cut off students access to federal financial aid and make it hard for them to have academic credit except as other schools\nThe southern association of colleges in school says pain has thirty days to appeal the ruling or lose accreditation\nIt's ten oh five\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org [noise]\nIn the forecast the coach will stay dry but the rest of the ... the showers today isolated thunderstorms are possible over central and portions of north\nEarly this evening I Will be in the seventies and eighties and northern parts of the state it couldn't get up to Ninety southern Georgia today there's a slight chance of rain tonight across the St Louis in the sixties in northern in central Georgia arrested they will see lows\nThe state it could get up to Ninety southern Georgia today there's a slight chance of rain tonight across the St Louis in the sixties in northern in central Georgia the rest of the lowest in [noise]\n[noise]\nThis is one day I'm Joshua Johnson in Washington Leslie stall of sixty minutes is a renowned journalist but there's one thing I'll bet she's no better than you are debating climate change it came up during her latest interview with President Trump\nI Wish you can go to Greenland\nAh watch these huge chunks of ice just falling into the ocean raising the the level and you don't know whether or not that would have happened with or without man you don't know when you're a scientist your scientist that no no I Am now does that disagree with that you know I I was thinking\nWhat if he said now I've seen the hurricanes situations\nI change my mind that really is climate change and I thought wow what an impact what an ... I'm not denying climate change\nBut it could very well go back you know we're talking about that and even if they say that we had hurricanes that were far worse than what we just said with Michael says that they say I mean they do say that and then but what about ninth scientists who say it's worse than ever\nClearly climate change it's tough to discuss despite overwhelming scientific evidence of its existence\nOr maybe because of that evidence\nI mean think about it if someone tried to hit you over the head with a bunch of facts and figures surprisingly confident that they are right and you are wrong\nHow would you feel\nOr if someone flat out refused to hear you out despite the facts being really clear and just dug in their heels to avoid feeling like they lost an argument\nWhat would that be like we want to elevate this debate to change the way we talk about climate change and we want to hear from you where do you stand on the issue and what is it been like discussing it with people whose views are different from yours what's worked and what has not email us one a at\nW. A. M. U. dot org comments on our Facebook page or tweet us at one egg joining us from K. U. L. W. public radio in Seattle is Sarah ... a research associate at the University of Washington she holds a PHD in ecology from\nAnd joining us from K. U. L. W. public radio in Seattle is Sarah ... a research associate at the University of Washington shields a PHD in ecology from UC Davis she also founded the ... Institute a group that empowers leaders to tackle climate change Sarah welcome to want to say\n\nSupport for ... comes from our monthly sixteen years\nAnd Callaway resort in gardens Georgia's authentic outdoor escape offering to championship golf courses the scenic Lakeview course and the mountain view course\nTwelve time hosted the PGA Buick challenge more Callaway Gardens dot com and Carter's still tourism inviting music lovers to the Carter's bill blue grass and folk festival October twentieth and downtown Carter spelled two stages local foods craft beers in a safe kids some for creative play more visit ... dot org [noise]\nHey this is David Greene host of MORNING EDITION I'm here to talk with you about that poking feeling the one that keeps reminding you support public radio you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station or you have to do is call and you might even receive a tax\nDeduction G. P. dot org slash cars or call eight seven seven GP the one car and banks\n\nSupport for NPR comes from this station and from super featuring the all new three row ascent with feeding for up to eight and a choice of secondary captain's chairs love it's what makes us Subaru was Subaru learn more at Subaru dot com\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more infidelity dot com slash wealth fidelity brokerage services ... and from Americans for the arts\nIs one a I'm Joshua Johnson we're discussing climate change and what we discuss when we discuss climate change with Sarah my re founder of the ruined Institute and Paul blitz so a promissory electric\nJoshua Johnson we're discussing climate change and what we discuss when we discuss climate change\nWith Sarah my re founder of the ruin Institute and Paul blood cell a promissory a lecture at American University Center for environmental policy we love to hear from YouTube wherever you are on the spectrum of belief with regards to climate change what kind of conversations\nAre you having with people in your life about climate change have you been able to win anyone over\nHave you had any arguments that just went sideways tell us what this conversation spin like for you comments on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org we know that for quite a few if you're discussing climate change can be difficult\nSo have you been giving us your suggestions\nFor what has worked for you or what might work\nMelissa writes for my Bible friends I remind them that we are called to be good stewards of the earth\nNothing the environmentalists are suggesting would cause harm from my fiscally conservative friends I talk about the economics green power is more profitable and this is the future economy more jobs better jobs saving the earth for their grandchildren is way down on the list [noise]\nWe also heard from some of you who are dealing with the difficulties of discussing climate change Caitlin left this note in our inbox\n... world actually than I Am in a room\nI'm very interested in protecting the environment and\nClimate change\nI Want to know ways in which I can better explain myself to others are just regular people who might not have the education that I have\nAbout climate change because from where I'm standing at plainly ... what's going on and it just seems like we really need to come together and actually make a change or there's going to be a really bad and\nCaitlin thanks very much for sharing your thoughts with his poll I Wonder how you would respond to Caitlyn particularly because I think sometimes if I may just outdoor comment the terminology often gets us in trouble I mean some people use the phrase climate change some people say extreme weather as some people say global warming and\nJust beginning to get on the same page can be one of the core problems of talking about all this\nIt's a great point we need to recognize that the good news is we have the solutions to address this problem the technical solutions the energy solutions with a policy solutions won't we lack our political will and consensus around action we know that we have\nTrey solutions with a policy solutions what we lack our political will and consensus around action we know that we have to ... global emissions by twenty twenty and go to zero net carbon by twenty fifty turns out we have the technologies renewable carbon capture\nA electric vehicles and many others to make that happen if we make a real push but it is going to take a huge push likely made during the Cold War I Wish the country would come together over this expression of American leadership\nLeading the world again to safety I think that's possible but when one party in the United states it's a nice factual information over twenty year period then elected president who almost campaigned on it it becomes very difficult to engage with that and I think voters\nMay reflect that in this midterm election George\nTweeted as an environmental health scientist I focus on telling people about the immediate and local clean air health benefits that will go to people in locations taking action to address climate change pollution and reducing fossil fuel burning irrespective of opinions on climate\nKatie emailed my family has vacation to Mexico beach in Florida for twenty plus years and we have many friends and loved ones from Panama City who have lost everything meaning in hurricane Michael\nMy father is it this believer of climate change and it's been very upset about losing a place we love so much he won't consider that just maybe there is a greater sing at play here what is it going to take for this to change how do we those who are convinced that is happening change the way we talk about it and rather than shutting down the conversation\nNurture it Sarah how would you respond to Katie\nGosh that's a really really great question and I can feel that the pain that she then and the laws that her family is\nStruggling with to describe it and you know\nThis is this is the peace around recognizing how difficult information as like I got exposed to the science of climate change when I started graduate school and it took me like I think the earth to integrate the scale of difficulty of that information and it it\nPeople can get exposed to that that science of climate change and it ... they can be in such a vulnerable place that it's actually potentially dangerous for for students and people who are struggling with mental health issues so\nThey can be in such a vulnerable place that it's actually potentially dangerous for for students and people who are struggling with mental health issues\nSo the the way that we unpack this I think\nIs through and through relationship and trust and empathy um because as we interact as individuals and we come to terms with the scale of the change and the crisis you can have a lot of really basic emotions and fear anger um [noise]\nI ... all of these pieces that are we all ... away from those very challenging emotions and often when we feel those emotions we shouldn't into our part in corners\nWhere we think we know the way the world is and we we become ever more entrenched in our existing world view and that's why being honest that yeah this is a really difficult conversation and that's exactly why we're having this conversation is one of the ways to start\nSyria if I could just doing it a little deeper on that I Wonder if this idea of being empathetic and being a little compassionate might also speak\nTo the conversations with folks who feel very fatalistic I mean it's hard not to read the latest report from the UN's climate change which we discuss last week on this program and not feel like well we're all going to die anyway\nWhy bother run up your credit 'cause they're not going to be radical act you know what I'm saying like it just feels like an intractable problem and I wonder if maybe a little empathy for folks who feel that way would go a long way\nWhy am I so yeah I get it and I I Want to remind remind us that as we sit\nWith the privilege of western lifestyles and we look at the science that we've invested public money into you know remembering that we're living a science fiction fantasy right now and we can look to human history and see that there are many other cultures around us\nAnd specifically in the U.S Native American and indigenous Native American people\nWho have already experienced the kind of cultural eradication that we are looking at down the line on the the consequences from climate change we can look at the stories of human tenacity\nAnd how people struggle and survive through massive massive shift we know these stories and we can inform our strengths and resilience our courage by looking at the stories of for example the water protectors and the people who are standing at the front lines right now saying the earth is press\nOur strengths and resilience courage by looking at the story that for example the water protectors and the people who are standing at the front lines right now saying the earth is precious we only have one planet and we're all going to show up and\nAnd informed that ... you know the public's eye of the necessity of staying in this place and and things vigilant\nI Would just go ahead go ahead ... but oh I Would just add that the the fatal ism is a reasonable reaction if you don't know the full range of solutions that there's a lot of good news here\nTwo years ago we eliminated one of them six main greenhouse gases it will no longer exist on earth Twenty years from now with the good golly agreement to phase out HFCs\nTurns out there three or four other super pollutants like methane and black carbon\nIf we can reduce these quickly about three times the current rate we can limit near term warming and prevent run away climate change\nIf you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty four\nCrews are still working to clear roads and restore power do not attempt to handle or cross damage power lines report them to your power company immediately\nAs survivors and Baker Decatur Doherty early Miller and seminal counties are eligible for disaster assistance through FEMA those residents should file claims with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six two [noise]\nAnd they can check her body coming up with an excellent point NASCAR great Dale Earnhardt junior competed for Eighteen season along like a checkered flag he had his share of high speed crashes and in his new memoir racing to the finish my story\nEarnhardt opens up about concussions fears and why he ended his storied career he'll join us that's coming up with an excellent point from the NPR joined us from point a morning eleven right here on June ...\n\nThat's coming up with an excellent point from NPR News from point in the morning and I'm not I'm right here on the ...\n\nSupport for NPR comes from this station and from logged me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more is go to meeting dot com\nAnd from ... am committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations math ... dot com slash NPR\nBefore we get back to our conversation we would love your help with tomorrow's program about being Native Americans\nMassachusetts democratic Senator Elizabeth Warren recently announced that a DNA test has confirmed what she said all along that she is indeed of tribal heritage the test was a ... back to President Trump who mocked her for claiming that heritage and refer to her as Pocahontas\nCritics including some tribal leaders said direct ancestry matters more than DNA testing in this regard\nIt's just one of many issues that may have Native American voters talking head of the midterms if you are Native American what has claiming your heritage meant to you what tribe or are you part of and how does that factor into your life\nLeave us a voice mail eight five five to three six one a one a now if you're not Native American then share what your heritage means to you especially if it's something you learned about a little later in life what did you discover and how did it change you\nTell us your story eight five five to three six\nOne a one a or you can leave us a radio quality audio files through our app won a vox pop will share some of your stories tomorrow on one day\nBack now to our conversation with Sarah my ... and Paul blitz so let's get in a few more of your questions and comments before we move on Noel tweeted I teach clients to think of anxiety kind of like sugar a little gives you energy to get going and too much shuts down and drains you\nNeed to keep it at that middle area I guess let's get back to Arlene's question on our website and and a poll I Wonder if you could respond to her a lean rights so if you change people's minds what then I see a lot of people\nYes let's get back to Arlene's question on our website and ... and Paul I wonder if you could respond to her a lean rights\nSo if you change people's minds what then I see a lot of people who believe in climate change to do nothing to try to mitigate it in their own personal lives\nThere still driving around in gas guzzling SUVs owning their ... mentioned houses with a thermostat turned up not recycling not cutting back on meat and dairy basically waiting for someone else to do something it's like someone else's tomorrow not ours\nNo doubt personal action is important not least so that you're not hypocritical when you advocate policy and political action but let's be clear that it will take large policy action to reduce emissions in the United states and globally\nTo make the United states once again a global leader and cutting emissions to solve this problem we have to the biggest thing you can do personally\nFor climate change action is to vote out people who won't take it and vote and people who will and I don't mean trust Democrat and Republican because within those parties there are a few Republicans who acknowledge like uh the congressman from some South Florida um but\nThere are many more who deny it on the Democratic side there are some who are not strong enough and do not advocate serious policies\nWe have to recognize this is\nAn imminent threat to people's public safety national security and economic well being as all the recent hurricanes wildfires have shown we need to vote\nI think one of the kind of saving grace of the er at this point in the conversation is that we we do need to deal with U.S policy issues but\nJust being able to have the conversation and a useful successful way I think that's a form of progress as well you just get people kind of pointed in the direction of being willing to do something so by the by way of kind of wrapping up I Want to go through a few comment objections to the basic argument around climate change and sort of role play how one might respond to those\nFor example be tweeted I often run into these excuses if a warming is happening why do we still have winter and we've been told for decades that bad things would have happened ... years ago but they haven't Sarah how would you respond to that\nWell I mean bad things are happening right now so [laughter] they had to have it in that um that those protections are coming through I mean all of the pieces of protection that we have seen around temperature and carbon concentration thing we are able to do a very good job that project\nHe says the projections that we have seen around temperature and carbon concentration I mean we are able to do a very good job at projecting a the impacts of climate change on the ground and and that's the state of the science right now it's it's phenomenal\nI guess you should not just that we're having winter but we're having like day after tomorrow winter like we're having super winner\nRight and and so like [noise]\nYes and there is cut and so there's complexity and how the regional climate and the season out of different places are influenced by the day that the on the Arctic weather system basically a\nCollapsing and how and how that changes North American climate and so we do see these complexities and why\nOn people get confused right because they like well wait a second this is a massive storm but this is the fundamental distinction between weather and climate\nClimate ... we can measure climate for the last you know ... million years right and the the the climate for earth planet has been ... oscillation between glacial an inter glacial states abrupt warming and to enter glacial followed by slow cooling into glacial states\nSo that pacing of glacial enter glacial warming that cold to warm structure that was fundamentally paste by changing geometric relationship between the earth on Sarah\nBack a little young other changing geometric relationship between glacial and enter glacial stayed last me it's so cool it's amazing what it's confusing like like bring on earth for me\nOkay so in the ... million years the the planet's climate has been moving between glacial states\nWhere there's an ice on top of North American\nAnd erasing continent sea level is lower\nOn it's a colder climate on and then in inter glacial state so we are in an inter glacial right now okay and that changed that cold too warm shift\nThis on this ... thing that I'm off the leash and it's called it's like a heartbeat of earth's climate and that heartbeat from cold to warm cold too warm that heartbeat with paste by the way goals and ... of the geometric in earth orbit and earth tilt as it moves around the sun\nSo I only make sure following you boost yeah heartbeat this earth heartbeat between poll too warm\nCold War it's almost like the earth is having cardiac arrest the heartbeat is off and the pattern is not what it's been for a million years and we can trace it to us is that what you're saying that's exactly right at like ... okay that makes a youthful pattern that's been on\nI don't it's not what it's been for a million years and we can trace it to us is that that what you're saying that's exactly right at like ... okay that makes ...\nPattern that's been that's been happening for the last two million years we ... we have fundamentally disturbed that\nPattern I was saying earlier on a super high cholesterol sugar fossil fuel diet has got nor a blood pressure through the roof\nAnd um the climate system can't take that forever that will go out of control that's a perfect that's a perfect image that makes perfect sense one more thing I wanted to get to pull out and then we got to let you go shortly but\nFor folks who questioned the provenance of the science who the scientists are that came up during the sixty minutes interview who say I just don't trust the people where this data's coming from how do I know that they don't have a political agenda what would you say to someone with that concern to try to work through that\nI I understand that you can distress individual scientists but there's not a conspiracy of\nTens and hundreds of thousands of scientists around the world to create a problem actually I find it quite the opposite in many cases they're under stating the nature of the problem because they don't want to seem alarmist the truth is that the problem is here now in imminent\nAnd that that's just the factual information on the ground we have already warmed up a degree and a half Fahrenheit were on her way to well past three or even four Fahrenheit\nAnd it could spin out of control and that that's just the factual information I I I think we went with very few people actually denied about ten percent Fifteen Percent of the u._s. public actually\nDenied climate science would I think we have to do is galvanized the Seventy five eighty percent who broadly accepted into action", "show_name": "1A Plus", "year": "2018", "city": "Chatsworth", "day": "16"}