{"month": "10", "state": "GA", "station": "WNGH", "content": "Term this afternoon on all things considered from NPR News for till seven on gp being and she'd be news dot org\nServing a gun and feel sorry this is G. P. B. were an eight teams the surface of Georgia Public broadcasting under dos and it's a minute before the hour and a clock one\nServing Augusta and feel sorry this is G. P. B. where an eight team station service of Georgia Public broadcasting Andre Dawson it's a minute before the hour of ten o'clock one a is next added eleven o'clock it's on point on G. P. B. S. GB news dot org\nAnd the next fresh air Paladino he played a teen preacher and there will be blind a movie teenager who took a vow of silence and Little Miss sunshine and portrayed Brian Wilson and love and mercy\nDino directed and co wrote the new film adaptation of Richard forwards novel wildlife which stars Jake Gyllenhaal and Carey Mulligan killing us\nShares this afternoon to three on the TV and she'd be the new start [noise]\n[noise]\nNinety seven point seven FM WG P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nThe murder of journalists ... America's relationship with Saudi Arabia the civil war in Yemen what do they have to do with each other and what should be done about the\nW. A. M. U. N. NPR this is one egg [noise]\nEither I'm Joshua Johnson visiting ... Chicago today on one a America Saudi Arabia and Yemen in a tragic way ... murder may have done some good could force the world to reexamine the U.S Saudi relationship\nThat relationship affects millions of people around the world including those facing the ongoing atrocities of Yemen's civil war\nWill take a closer look at that war at America's ties to the Saudis headed how these ties could and\nPerhaps should change\nWe begin with the latest on the show you cover up and how America plans to retaliate comments on our Facebook page or tweet us at one a\n[noise]\nFrom NPR News in Washington on corporate Coleman the secret service says it has intercepted too suspicious packages one was addressed to the home of former president Morocco bomb and was discovered in Washington DC the second suspicious package was addressed a former secretary of State Hillary Clinton at her home in New York\nSecret Service says neither Obama nor Clinton were at risk of receiving the packages\nThe two candidates for governor of Georgia faced off their first official debate last night doesn't eat ... from member station WBEZ\nRisk of receiving the packages the two candidates for governor of Georgia faced off with their first official debate last night doesn't each month from member station WBUR a B. E. reports from Atlanta one focus was the right to vote\nRepublican candidate for Georgia governor Brian Kemp and democratic candidate Stacey Abrams spent part of the debate discussing voting rights Abrams says she would focus on making it easier to vote\nAs an ex governor of Georgia I Will work with the secretary of state to ensure that there is no question sets a right to vote in Georgia is not a privilege is indeed a right that belongs to those who are Georgia citizens and I will work hard to make it so\nRepublican Brian Kemp who is also currently Georgia secretary of state oversees the elections he faces criticism that he has the press the right to vote\nWhen you take all the people that had registered sit at a potential double nine or when you count people like Jesus from heaven street there on the pending list no one's keeping them from voting\nThe debate was organized by the Atlanta price club for NPR News I'm this name ... in Atlanta\nThe top health official in the Trump Administration says early new data suggest the opioid epidemic in the U.S is possibly beginning to plateau as NPR's Emily Sullivan reports overdose trends are being cited\nIn his speech yesterday Alex days our secretary of health and Human Services slated new preliminary data from the Centers for Disease Control and prevention dust increased by ten percent for twenty sixteen to twenty Seventeen those numbers stole toward the end of twenty Seventeen through the beginning of this year\nIn other words deaths aren't going down but are now at a steady rates\n[noise]\n\nPresident Trump is expected to sign a bill later today that expands medicate opioid treatment programs and support to research of non opioid pain relief Emily Sullivan NPR News\nOfficials in Japan say a journalist has surfaced after going missing in Syria three years ago NPR's Anthony Kuhn reports from Beijing the journalist who is in good health was reportedly held hostage\nForty four year old Jim pay ya pseudo turned up on Tuesday at an immigration center in southern turkey near the Syrian border Japan thanked concert in Turkey for their help with the case yesterday was reportedly taken hostage and twenty Fifteen by an al Qaida affiliate known at the time as the ... front\nTokyo insisted that it had not paid any ransom to secure Yasser does release NPR's\nAnthony Kuhn on Wall street\nKnown at the time as the al Nusra front Tokyo insisted that it had not paid any ransom to secure yesterday as release NPR's\nAnthony Kuhn on Wall street stocks are lower this is NPR\nLive from the GB newsroom good morning I'm drew Dawson just ahead on one a why is America continuing to provide weapons that are fueling the world's worst humanitarian crisis will talk about that this hour but first in the news\nGovernor Nathan Deal has ordered the state legislator let's legislature to hold a special session in November she could be Stephen Fowler reports\nThe governor has the power to convene a special session when necessary the state house and Senate will meet November thirteenth a week after the midterm election outgoing governor deals says he will ask the general assembly to meet for about five days to amend the state budget to help pay for recovery efforts from hurricane Michael\nTo legislature could also decide on a controversial tax break on jet fuel what primarily benefit Delta Airlines it's the second special session deal is called in his eight year tenure and twenty eleven he convened the legislature to redraw the state's electoral maps based on new census data for TV news I'm Stephen Fowler in Atlanta\nThe N. double ACP has filed complaints with election officials alleging that some voting machines mistakenly showed votes that were Casper Stacey Abrams registering for her opponent Brian Kemp voting machines and two counties including bar to win dodge didn't initially register the correct votes\nBill is Blake president of the Georgia N. double ACP tells us say today that the group plans to file to more complaints than bobbing building machines and Henry in cop counties\nThe complaints are on behalf of eight voters state and local election officials have come under fire from civil rights and voting rights groups over complaints about efforts to suppress to suppress black votes cap oversees the state's election system has denied any wrongdoing from Georgia News Go to GB news dot org\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with their Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video [noise]\nCPB whether partly sunny and in the seventies across Georgia today becoming increasingly cloudy overnight with low temperatures ranging from the mid forties in the northern mountains near sixty south into along the coast Thursday will be mostly clouded with showers developing in central southern and coastal regions high temperatures in the low sixties seventies\nSixty south into along the coast Thursday will be mostly clouded with showers developing in central southern and coastal regions high temperatures in the low sixties to mid seventies\n[noise]\n\nThis is one a I'm Joshua Johnson visiting WB easy Chicago Saudi Arabia's crown prince Mohammed bin Salman is under increasing pressure over the death of journalists Jamal ... G the Saudi Government says ... died during an interrogation that turned into a fist fight\nGermany has announced that it will not approve any new arms exports until further notice turkey declared ... death in its words premeditated murder and here's what President Trump told reporters yesterday in the oval office\nIt was carried out for\nCholera was one of the worst in history\nBad deal should and that\nReally messed up\nJoining us now for a brief update is Shane Harris intelligence and national security correspondent from the Washington Post Shane welcome to win a Hi Joshua\nWe also welcome your questions and thoughts about the ongoing search for the truth\nIn the death of Mr ... tea or what all of this means for the relationship between the U.S and Saudi Arabia especially if that relationship affects you personally email us one a ass W. A. M. U. dot org comments on our Facebook page or tweet us at one day\nSaying one more audio clip we should play before we dive in further and that's from secretary of state Mike Pompeo he spoke to reporters at the state department yesterday and she was part of what he said\nWe're making very clear that the United states does not tolerate this kind of ruthless action\nTo silence Mr ... a journalist through violence\nWe continue to maintain a strong partnership with the kingdom of Saudi Arabia neither the president nor I Am happy with the situation [noise]\nOur shared strategic interests were Saudi Arabia remain would continue to view as achievable the twin imperative to protecting America and holding accountable those responsible for the killing of Mr ...\nSo that secretary of state Mike Pompeo speaking yesterday he says it neither she nor the president is happy what actions are they saying the U.S my taste\nThe show so that secretary of state\nMike Pompeo speaking yesterday he says it neither she nor the president is happy what actions are they saying the U.S might take ...\n[laughter] well we're still waiting to see right now we've heard secretary Pompeo say they're going to be some visa restrictions on individuals suspects who've been identified as taking part in this operation which um I think most people see admittedly is a fairly weak measure that's not necessarily punitive to the regime\nSupport for G. P. B. programs comes from our listeners in this fast paced world you want to have access to news when you need it check out our Web site at ... dot org we've got the latest state national and international news available twenty four seven\nBut they're also in depth feature stories from across the state of Georgia you can also view video performances from great musicians in our gp music present the rates\nFor information and entertainment you can count on gp the news ... news dot org [noise]\nYou know selling a car can be a hassle but don't get as a whole different story is split I was taking off your hands or off your driveway and turn it into public radio and maybe even a tax deductions to resolve the host of marketplace here is how to do [noise]\nEight seven seven GP be one car or donate securely on line a G. P. D. dot org slash cars and thanks [noise]\n\nSupport for NPR comes from the station and from American University's ... school of business committed to business being a force for meaningful change through graduate and undergraduate degrees mission driven curriculum and their hands on approach more eco God died American dot edu\nAnd for math amazing him committed to changing alive through Matt Bai building math achievements problem solving and critical thinking skills for thousands of students every\nDay and nine hundred franchise locations mass amazing um dot com slash NPR\nIs one a I'm Joshua Johnson we're discussing the ongoing humanitarian disaster in Yemen as well as the rules that to us from the sound and the Saudi Arabia play and that was ...\nOne day I'm Joshua Johnson we're discussing the ongoing humanitarian disaster in Yemen as well as the roles that the U.S in the south and the Saudi Arabia play and that\nWas somehow Hamdani from Georgetown University we woke up more of your questions and stories as well especially if you were directly affected by this conflict we'd love to hear from you if you or Yemeni or Yemeni American or Saudi Saudi American what does this conflict and America's role in it mean to you\nComments on our Facebook page tweet us at one at a or email one a ass W. A. M. U. dot board Barbara emailed I still talk weekly by phone to a Yemeni friends in ... and ... they are living in hell and they ask\nWhy does America hate us so much why does America wants to kill us\nWhat do I say\nSome before we continue and before we bring in our next forces on the conversation I Wonder if you could just for those people who haven't been following the Yemeni civil war very clearly can you just boil down at the core of it what does this conflict about who are the fighters and what are they fighting for\nYemen's conflict is actually quite complex complex a it's a it's a conflict that has many layers to it but ultimately what you hear in the news is that's a it's a Saudi Iranian proxy war you also hear that has he got at the ... the government in Sana'a that announced itself is actually in fact\nA coup government that is run by a militia and not the Saudi Government is trying to restore the legitimate Yemeni government ah to power in Yemen now the problem with all of that as this conflict is\nFailing to do all of the things that they're saying it's a it's about for example when Saudi Arabia got involved in this conflict with the Arab coalition\nThe aim is to bring back the Yemeni government the Yemeni government has been residing in jail since the war started and uh is struggling to go back to places where there is no so see I'm bullish on the ground\nOn top of that that ... the militia and a sense has gained so much more since the war started in a sense that at first they had to share power with\nAh the former president of Yemen where you know in two thousand eleven Yemen had a revolution and I'm the president was removed\nBut he ... himself with the ... and was present for some time but uh the hair power with him now fast forward three years into the war they had killed them and and now they have their own control of the majority of the north of\nYour power with him now fast forward three years into the war they had killed them and and now they have their own control of the majority of the north of Yemen\nAnd of course the the scariest thing about this is the Houthi militia had managed to capture the Yemeni military arsenal that belong to the former government is now all in their hand\nAnd so in a sense what the war dead is complicate an already complicated political situation\nAnd it devastated the lives of millions of the enemies of for example Seventy five percent of the Yemeni population is is suffering and in need of immediate aid and depend\nOn foreign aid to kind of survive and this is a Seventy percent increase since before the war began um\nAnd I do want us all the above the population on the ground that needs help I just want to before it gets were next wars and also just want to be clear there was a sectarian part of the studio these\nThese are the rebels who kind of came after the government you're Saudi Arabia involving itself but there is the Muslims Terry an aspect to this also gives me versus Shia conflict as a proxy war right\nSo this is what's interesting and this is what a lot of people don't realize first of all the shot and Yemen are don't practice the same sect of ... that Iran practices or the Shiites in Lebanon are at all to practice\nThey practice a sect called the DSM and the ideas and is known as ... and it's really different from twelve or shall which is a ... form that's practice in Iran\nWhat's interesting is that it's the closest form of ... that resembles Sundance them a an onion and we the Sunnis there are ... and the divide isn't you know the the ... are not a minority like in other places or forty five percent of the population\nAnd so what's interesting about this you know Sunni Shia conflict is that it's entirely manufactured in a sense that of course there are differences between these those two sacks of course there are situations where they don't agree but they managed to co exist for many years now the CDs or the who the sect\nOf of you know what's happening in Yemen they're no longer practicing as they do use them as it is it seems like they're trying to politicize say DSM into kind of\nAssociate themselves more with the Iranian sect of she has ... and ... and ... has struggled to maintain its effect as it is with the influence of well how does them and set up as him coming into the country and so in a sense what you're saying is that the ...\nHas struggled to maintain its\nEffect as it is with the influence of well how does an incentive for them coming into the country and so in a sense what you're saying is that the most radical elements of those two\nAre fighting each other and so in a sense you have the presence of the new ... conflict but one thing that I really have to point out to the listeners here is that that's not the only thing going on\nI'm a huge portion of the country and the liberated territory from the control is actually demanding secession and that is something that you don't hear about in the news as much you know in the south and ever since Nineteen Ninety four people their fault that they were under occupation and the cost of secession\nAre rising day after day as this conflict continues\nI Do want to make sure we get to a voice on the ground and human but I hear what you're saying some are in terms of all of these very complex fault lines moved kind of come together to fuel the civil war today now before we came on the air today\nWe were able to get through to Sana'a in Yemen all communication into and out of Yemen is really tough but we did make contact with least grounding she's the UN's resident and humanitarian coordinator for Yemen\nLeast laid out what the conditions are like right now for those who are living and working bear here as part of our conversation that we to just a few minutes ago\nWe've gone to welcome to want to thank you very much\nCan you give me a sense just in a in a larger context how many people the un fears are at risk of famine right now\nIn game and we are worried that steps are not taken right now in order to stop the spread of hunger that we could see as many as four ... who are facing famine by the end of the year and this is why the United nations is rain the alarm bells\nAnd killing everyone that we are facing possibly the biggest famine in living memory if we don't do something to stop it right now\nWhat are some of the other health risks that you're looking at their other than just starvation and I'm sure with deprivation of a reasonable secure supply of food all kinds of other health problems also come into play right\nThat's exactly right last year the largest cholera outbreak in modern history kid came in and they were more than a million people who are suffering either from Colorado or from watery diarrhea there had never been an outbreak of such magnitude in living memory\nNow this year because of the heroic work that's being done by\nTo re diarrhea there had never been an outbreak of such magnitude in living memory\nNow this year because of the road work that's being done by frontline partners in UN agencies and officials here in game and we've been able to contain the spread of and how the Democrats have similar levels there's a lot of color in the country but it's not spreading at the rate of course last year\nThat being said when people exist for months and months\nOn supplemental rations when they are eating limited amounts of food what happens over a period of time is that they slowly start\nAnd this is absolutely what we're seeing for millions of people in this country their immune systems are weakening and that makes them highly vulnerable to infections and water borne diseases including color\nAnd just by way of contacts leaves mentioned that there are fourteen million people at the un fears are at risk of famine the population of Illinois where we are right now doing this program from Chicago is Thirteen million people just by way of contacts at least give me a sense of what a mother a father a parent has to do in Yemen right now\nJoined Emily Jones for MORNING EDITION\nFrom five to nine right here on gp\nSupport for deep ... comes from generous listeners like you our reporters have been honored with national awards from public radio news directors incorporated for our use of sound soft feature and our coverage of breaking news thank you for your support which allows us to keep you informed about stories that impact your life\nAnd show your parts of Georgia you don't otherwise hear about count on us to bring you comprehensive coverage of the state check out our website a gp news dot org ... stand with the fact [noise]\nI make the check her body coming up in the next on point we'll have a close examination of the implications of President Trump's threat to withdraw from a key nuclear missile treaty with Russia that's coming up with an excellent point from NPR\nOn for just this morning at eleven here on geography and that can be removed dot org [noise]\n\nSupport for NPR comes from this station\nAnd from Subaru featuring the all new three row ascent with feeding for up to eight and a choice so second row captain's chairs love it's what makes us Subaru was Subaru learn more at Subaru dot com\nAnd from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nBefore we get back to our conversation we would love your help with tomorrow's discussion of President Trump's taxes last in the shuffle of justice Brett Kavanaugh Supreme Court confirmation was a major investigation by the New York times it found hundreds of millions of dollars of financial benefits to the president from his father's real estate empire\nBenefits that Mr Trump had downplayed for years\nAnd it pointed to some taxes to Donald Trump may have invaded or avoid it\nWe want to revisit the story and its significance and we'd like to get your questions answered to so if you had questions about this investigation leave us a voice mail eight five five\nTo three six one a one a this investigation to the New York times more than a year to complete what\nQuestions do you have about it eight five five to three six one a one a or you can leave us a radio quality audio files through our app won a vox pop will answer as many of your questions as we can Morrow\nOne day back now to our conversation with Jane Ferguson and some L Hamdani still time to get some of your questions and thoughts about the conflict in Yemen and about the U.S Saudi relationship\nContacts through Facebook our Facebook page tweet us at one a or email one a at W. A. M. U. dot org before we continue some al Hamdani let me come back to you for a second I checked in with our audience here at W. B. easy in Chicago to kind of ask\nThem if they were tracking with us and one of the things that I think confuses a lot of people it confuses me too\nIs the nature of this secretary and aspects like several of us and we have a an array of of age ranges here students and seniors and everybody in between have heard of Sunni and Shia\nIt's ... like several of us and we have a memory of of a dream just hear students and seniors and everybody in between have heard of Sunni and Shia Muslims\nBut then that like the the sex within the sects I think that's where a lot of us kind of get lost can you\nCan you bottom line that for us what difference does it make what ... these people are with like why why does the sex one of the sex involved matter to this can you just kind of simplified force\nAbsolutely so when it comes to Yemen like I mentioned um the majority of the northern part of Yemen is historically is eighty and the majority of the southern portions of Yemen as historically shaft eye and said these can be called Shia and the\nChef ... they're called ...\nNow the ... conflict\nA kind of began years ago and then was revived recently\nUm what we see as the political importation of religious sects of what we're seeing at play as political Islam and that's what you're hearing about you know the chefs in a conflict it's not really a religious matter today it's really a political matter of allegiance to what part of the middle east are you going to support\nIn what we're seeing play out is that Iran is announcing itself as the um [noise]\nKind of the guardian if she has them\nAnd Saudi Arabia on the other hand is presenting itself to the world is the guardian of ... them and so as soon as she our is pretty much kind of people fighting for the interests of who's going to take control in the region\nAnd that's what this what's happening in Yemen you know for instance when this war started we know that the U.S and then under the administration of President Obama had struck a deal of um a nuclear deal with Iran\nAnd the sense they sacrificed Yemen by saying here you can fight Iran in Yemen but the U. S. is gonna kind of find this deal with Iran now that was a short sighted move because I think a lot of people then didn't anticipate\nThat today President Trump would come to power and then today you have an a nuclear deal with Iran\nAnd at the same time also have this devastating crisis in Yemen and so in a sense okay\nSo let me let me was I think so let me let me back up and try and repeat back to you what you just said I said I've been granted diagram everybody here ... years and watching you scribble in my piece of paper so we've got these these two sets of Islam Sunni Islam ... Islam\nOn a diagram everybody here ... years been watching you scribble in my piece of paper so we've got these these two sets of Islam Sunni Islam and Shia Islam is this old centuries old fight that has been made political you use the phrase political Islam to describe\nHow we run this kind of for political and regional power reasons trying to kind of claim itself as the the defender of the Shia Muslim faith\nAnd Saudi Arabia has kind of ... anointed itself the defender of the Sunni Muslim faith\nAnd that politicized Islam has spread into other conflicts and Yemen these factions in Yemen\nIran and Saudi Arabia are supporting these factions is kind of a battle in this larger war for the soul of political Islam is that kind of it\nHere yeah exactly and so what I'm saying is that historically and traditionally the sect of Islam that Cantonese have practiced for years are not necessarily aligned with the Saudi an Iranian ... for political reasons they are now aligning with each other gotcha\nGotcha folks here it'd be easy does that make more sense good we got some up all around and I I appreciate you explaining that I think you know part of the complication Jane Ferguson is that this is complicated I mean some wars you can't just\nBoil down to one cause but that also makes it hard\nFor us sworn in Yemen to zero in on them and and really think our T fan but your reporting has involved some of the people on the ground\nWho are dealing with the results of this larger fight for the soul of political Islam you described the story of an eleven year old girl that you encountered back in June but kind of stuck with you can you give us the basics of what happened to her\nTelling her story is one of the race for the most important reason why journalists need access to this because we have to put a face and a name and a picture to the statistics otherwise they're just a test aches and I think than we we deal with with a lot\nOf that of of of difficulty trying to get the public to understand the level of this crisis so I ... I was in ... um which is a product and sort of in northwest of of Santa and controlled by the who the rebels\nAnd that and it's meant and that's in the in the town of hijacking the capital of the province there was a hospital where like every single hospital that I've seen ... that the children\nThe rebels and uh and it's mountainous in in the town of hijacking the capital of the province there was a hospital where like every single hospital that I've seen there that the children's ward is now a de facto malnutrition wards\nAnd we were just filming there with some women and their babies' whenever a young man tall deathly thin rushed and with the with the tiny what looked like just sort of like a bundle of clothes and it was hit eleven year old sister name was ...\nAnd for a horrible few moments we really thought may mono might dying in front of us on the hospital bed she was eleven years old and way too I think twenty four pounds was what it was about what we had to what we had asked at the doctors of that and it was absolutely a\nHorrifying to watch her she you know when when a child gets so weak and so\nAmong nourished they also become so vulnerable to any kinds of infection and so they tend to get a diarrhea anyway and so even even if you do manage to get through to the and uh they get diarrhea they get devastating they hydrated as a result the whole thing just spirals\nUntil the child's body just gives in\nUm we spent some time they're filming with my own and speaking with her family\nAnd her mother eventually came the next day we were able to talk to her and we were piecing together the family's story and it is a story that reflects millions of people's stories in Yemen and it is that her father was a schoolteacher and a government school but whenever the uh\nThe government salaries stopped over two years ago\nHe his salary stop to wants people lost that level of income the government was that the the biggest employer by far the country before the war\nAnd that's not just soldiers and police that's people who work in offices that's teachers any kind of clerical work or any kind of bureaucratic work in Yemen", "year": "2018", "show_name": "1A Plus", "city": "Chatsworth", "day": "24"}