{"month": "10", "state": "GA", "station": "WNGH", "content": "Four to seven on GDP and she could be used to work serving food and beyond gp the we're in a dream station radio network of Georgia Public broadcasting under dos and it's a minute before ten o'clock\nServing view food and beyond this is gp be we're in a dream station radio network of Georgia Public broadcasting under dos and it's a minute before ten o'clock so good to have you along today one a is mixed on G. P. B. S. G. P. B. news dot org [noise]\nGreat question the gray cloud and that's a great question wow that's a great question that's a that's a great question [laughter] that's a great question that is a great question with great question\nAnd fresh air you'll hear unexpected questions and unexpected and\nFresh air is this afternoon at three on geography bee and streaming live at the new stuff [noise] [noise] Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nOr just pulling together after an attack on a synagogue\nHow are you holding up and how should we deal which acts of hate\nHim W. A. M. U. and NPR in Washington DC is one and [noise]\nHey there I'm Joshua Johnson today oh what a we check in with you on the mass shooting in Pittsburgh for some it was just one more sign that America is losing its mind for others just more proof that this country has not come as far as something could have\nWe may not be able to stop this kind of murderous rampage but we can try to understand what fuels including how it grows on line\nWill discuss that ahead but we mostly want to hear how this tragedy is affecting you and how you're responding to a\nCaller from Pittsburgh or nationwide\nEight five five to three six one a one eight comments on our Facebook page or tweet us at one egg [noise]\nFrom NPR News in Washington I'm neuron the stock market's open this morning with a moment of silence to remember those who died or were injured and attacking the Pittsburgh synagogue during worship services Saturday eleven people were shot to death they range in age from fifty for ten Ninety seven\nSix people were wounded including for police officers rabbi Joan ... is director of the religious action center of reform Judaism he's a visiting congregations in Pittsburgh to help them deal with their great that people that ...\n... is director of the religious action center of reform Judaism he's a visiting congregations in Pittsburgh to help them deal with their graves\nThat people that make a a congregation thrive on average about morning they would come together and study and tree of life\nSo ironically named um and of course there are still a few people who are a critically injured and then there are members of law enforcement so first and foremost or the families who are grieving and the rabbis locally who were posturing and taking care of their folks\nA suspected gunmen who was injured after a shootout with police is scheduled to appear in federal court this afternoon\nFifty six year old Caesar say Iraq is also expected to appear in federal court today but in Miami he's facing charges in the mailing of at least fourteen pipe bombs to critics of President Trump including several prominent Democrats NPR's David Schaper reports from South Florida the hearing today is expected to be brief\nSay Iraq is charged with five counts for allegedly making and mailing pipe bombs to Hillary Clinton ... and others from here but the case of being transferred for prosecution to the southern district of New York which is where the devices were sent investigators are fingerprint DNA and other evidence pointing to say that but they continue searching for more\nDavid Schaper reporting an Indonesian passenger plane crashed into the sea today shortly after taking off from Jakarta authorities say there were one hundred eighty nine people on board and it's likely no one survived\nAnd Germany angle America will not seek reelection AS Party chair in December but will remain chancellor as many Nicholson reports miracles decision follows major losses yesterday for her party the Christian Democrats in a regional elections\nFrom a policy head coach his I'm going to announce Monday that she will not be standing for re election AS Party chair\nAt the next CD Congress she added that she also wouldn't be running for ... Thomas chump say in twenty Twenty one Michael ... Nineteen years and ... well she will remain chance this of this administration giving up her role AS Party chair\nIt's viewed as a stepping in finding the central successor the news comes up to ... significant ground in Sunday's regional election and the states have has to have federal ... not the Social Democrats also said pulley commentators said the results were such widespread dissatisfaction with the current central administration\nFor NPR News I'm Esme Nicholson in Berlin\nOn Wall street the Dallas up three hundred and thirty points the S. and P. is up\nBut the current federal administration for NPR News I'm Esme Nicholson in and wants to write the Dallas up three hundred thirty points the S. and P. as up forty five and this is NPR News\nFrom the TPP newsroom good morning I'm drew Dawson just ahead on one a the last few days have been particularly violent in America\nWe'll talk about rhetoric racism and rage this hour but first in GDP news multiple media outlets are reporting that President Trump will stop in making this weekend as part of a nationwide series of campaign rallies before next week's mid term elections\nAnd vice president Mike Pence is scheduled to appear in Dalton groove town in Savannah this Thursday all Trump and Pence are campaigning for Brian Kemp Democrat Stacey Abrams has earned the endorsement of former president but rock Obama\nGeorge authorities say more than thirty three thousand profiles of suspected gang members have been added to a state wide database the criminal justice coordinating council announced this month at the profiles around the Georgia gang intelligence platform profiles include names affiliations and identifiers such as tattoos\nInvestigators say the database helps law enforcement agencies coordinate and track gang activity across the state\nAnd sports UGA defeated Florida on Saturday by a score thirty six Seventeen coach Kirby Smart praised his team after the when\nI'm proud of our kids had to listen to how bad they play we had to block out the noise over so nothing when right today [noise] so many things we've done a better job of\nThe sixth ranked bulldogs must now prepare for this weekend's match up against the Kentucky Wildcats the winner will claim first place and the SEC east with less than a month remaining in the regular season Georgia News Go to G. P. B. news dot org and follow us on Facebook and on Twitter\nSupport for NPR comes from NPR stations\nOther contributors include the law firm Cooley El Al pay with offices in the U.S Europe and China Cooley advises entrepreneur is investors financial institutions and established companies around the world where innovation made the law [noise]\nKeep you'd be whether a pleasant start to the work week all across the state mostly sunny and in the seventies clearing in the forties overnight Tuesday sunshine with high temperatures ranging from the low seventies in the northern mountains to the upper seventies and the southern tier [noise]\nAnd with high temperatures ranging from the low seventies in the northern mountains to the upper seventies and the southern tier [noise]\n[noise]\n\nThis is one a I'm Joshua Johnson in Washington it has been a violent weak in America eleven people killed in their synagogue apparently just for being Jewish\nTwo African American shot by a white man at a supermarket and attack being investigated as a hate crime fourteen prominent people sent home made pipe bombs for reasons that are not yet confirmed about all of them are vocal critics of President Trump\nArrests have been made in each crime the suspects left a trail of hate and pain in their weight and caught in the middle are millions of Americans maybe you among them me for sure all wondering what is going on\nAnd dreading whatever might come next\nToday we want to take some time to just absorb what's happened and consider what this says about us in our politics and our country\nFeel free to give us a call we're always open for your calls in voice mails at eight five five to three six one a one a how're you doing have these acts of violence affected you personally or politically can we do something about our public discourse is this\nThe kind of America we want to live and we'd like to give you some time to sort of think out loud about what's been going on in America lately and we love to know\nWhat you're doing to try to be part of the solution whatever you would consider that solution to be\nEight five five to three six one a one a email us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one a\nJoining us here in Studio is our good friend in the ... executive editor of the Pulitzer center on crisis reporting and to Washington columnist for the Boston Globe and they were walking back to want to thank you so much that she was joining us from NPR in New York is rabbi Jill Jacobs the executive director of true up the rabbinic call for human rights rabbi Jacobs welcome\nThank you so much for having me and Montana Public radio in Missoula Charlie ... is the senior technology writer for buzzfeed news Charlie thanks for making time for us\nThings are out of ... I Wonder if we can just work a way around first of all and just check and I'm just curious to see how everyone is doing right now in ... start with you you grew up in the area where this took place right yes I was born and raised in ...\nAnd just ... I'm just curious to see how everyone is doing right now in the early me start with you you grew up in the area where this took place\nRight yes I was born and raised in Pittsburgh and specifically in squirrel hill and I grew up a few blocks away from the synagogue tree of life and attended many ... and ... says there and even weddings\nThis is a test of emergency alert system\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\nThis has been a test from G. P. B. radio [noise]\nHey this is David Greene hosting MORNING EDITION I'm here to talk with you about that poking the one that keeps reminding you were public radio you can support the programs you loved by donating your used vehicle that old cars trucks could be worth hundreds of dollars to the station or you have to do is call and you might even receive a check to\nGo to ... dot org slash cars or called eight seven seven GP one car dang [noise]\n\nSupport for NPR comes from this station and from ... committed to changing lives through math by building math achievements problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations matinees EM dot com slash NPR\nAnd from CSP certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org [noise]\nThis is one a I'm Joshua Johnson we're discussing the recent racial religious and political violence in this country and kind of checking in with you just how you're doing where your head is at and what steps\nHey I'm Joshua Johnson we're discussing the recent racial religious and political violence in this country and kind of checking in with you just how you're doing where your head as that and what steps you might be taking to be a positive force in the face of all this negativity and hate [laughter]\nWe're speaking the Indy ... went on Washington columnist for the Boston Globe rabbi Jill Jacobs the executive director of trauma and Charlie wars ill from buzzfeed news we'd love to hear from you as well\nComments on our Facebook page tweet us at when a email one a at W. A. M. U. dot org or give us a call eight five five to three six one a one a apologies to those of you who are trying to call in on the line and we've been getting deluged with phone calls [noise]\nSome of which we've had to screen out very quickly that we're going to do our best to put some of the most useful and positive and productive calls on the air\nTo those of you who've been making that job a little bit harder I think it might be worth sharing a comment from Alexander who emailed I have a message for those who hold this kind of hate in their hearts I don't care who you are I don't care what race you are a part of what creed you follow who you voted for and twenty sixteen I Will find\nYou and I will love you\nThere's absolutely nothing you can do\nCharlie ... let's get back to ... comments on Facebook Tommy rights\nWhen speeches free and in the open people get pushed back when it is driven underground it has given legitimacy and leads to action\nOne of the sites that has made news lately is this social network called gab dot com which I don't think a lot of people had heard of before this incident what what can you tell us about gab\nAnd the kind of online footprint that Robert Bauer had there\nSo uh ... dot com is a sort of as basically a Twitter cologne um and it is was created under the premise of a maximalist free speech beliefs so the idea was a lot of you know racists bigots [laughter] we're getting kicked off of Twitter\nFor for violating put her as community standards and gab was sort of a a another refuge for them a place where you could say anything because we believe in the you know eat the absolute power of of free speech but when it ended up happening with gab is at it it became a cesspool it became a place where\nOnly the sort of worst people would go to express ideas that\nAre that we're really not tolerated elsewhere because they were hateful because they were angry I became it it has become a\nA place where white nationalism a and an extreme as bigotry\nOr because they were hateful because they were angry I became it it has become a\nA place where white nationalism a and an extreme or bigotry homophobia whatever ah has has been embraced and and uh and this was a place where the\nThe Pittsburgh shooter I'm not going to say his name or was it maybe not radicalized necessarily but but certainly able to express and have an audience for a lot of his\nI truly hateful views it was the last place where he had posted before the shooting 'em and it seems that it was it was sort of a\nA A N unproductive vent for a lot of that hatred I'm an after\nAfter um after it was clear that the shooter had been an active participant on gab there was a lot of push back a lot of people who are coming in realizing this for the first time a note noticed that at that at this place is a dark\nPlace to incubate a lot of awful ideas gab responded saying a words are not bullets in social media posts a have a body count as zero sort of saying that you know this ... free speech is different from from action\nAnd I started way they did they actually say words are not bullets\nAnyone who says that should go read the declaration of independence\nWhen it you know what's interesting about this and this is something that happens a lot of free speech communities on line that they don't really believe necessarily for speech but just in being able to say anything outrageous I is that it actually shows that that that the owners of gab\nDevalue speech to a degree if they believe that it has no consequences then then there's sort of this you know this odd warped understanding of why protected so hard if it means nothing um and and I think that that is something that that a lot of people\nDon't quite grapple with especially on the Internet\nCheckers I Wonder how you view kind of the phenomenon of of sites like get out and get us off the only place where this kind of speech proliferate online is worth noting since our program one a as named after the first amendment a quick First Amendment lesson\nHate speech is protected by the first amendment you were allowed to make hateful nasty vitriolic comments\nIncitement to violence tends to be the line whereby speech becomes curtailed so there is a case for protecting this kind of hateful rhetoric but rabbi Jacobs the Internet has given a new kind of\nSpeed and ... that I can only imagine makes makes encounters like what happened in Pittsburgh all the more worrisome folks\nI was given a new kind of speed and ... I can only imagine makes makes encounters like what happened to Pittsburgh ... worrisome folks like you\nSure it will first of all it's not news that hate speech can lead to violent actions the book of proverbs teaches us that death and life or in the hands of the tongue and that unfortunately\nHas become more and more true I've seen how true that ancient wisdom is particularly over the last two years but certainly over thousands of years of history\nAnd it's true that hate speech is protected speech that said that doesn't mean that every privately owned platform has to give everybody the right to spew such hate speech\nSo it's different when we're talking about the government controlling speech then when we're talking about whether everybody has the right to say whatever they want wherever they want on whatever platform they want [noise]\nThey also just wanted to say something about the ... that one of the to respond to one of the Facebook comments that you read\nHas been particularly over the last couple of days certainly over the last couple of years a lot of ... and it's true of course that their corners of the left where there is anti Semitism it's true that there's anger but we've seen nothing like\nThe white nationalism that we've seen from the right and what's crucial is not the question of where there's more hate I think it's clear that there's more hate on the right against Jews against people of color against algae B. T. Q. people against immigrants refugees et cetera\nAnd what's crucial is that that is being\nThat that hatred is being supported and bold and from the very top from the president of the United states that the white nationalist see him as an ally they see him as somebody who will come out after Charlottesville and talk about the very fine people on both sides\nAnd that's what's crucial we don't have a situation in which we have somebody on the left who is in charge we have somebody on the right who's the president of the United states and who is at the very least winking at the white nationalist racist anti Semite\nSometimes retreating them sometimes putting out content like the very last campaign ad before the election in which\nHe highlighted\nGeorge Soros Janet Yellen and Lloyd Blankfein and suggested that they were a part of some large conspiracy pulling the levers of power in the United states of course ... the taps into\nVery old anti Semitic\nThat some large conspiracy pulling the levers of power and the United states of course trap the taps into very old anti Semitic tropes ... yeah well I\nI'm Sorry where am I but I Do want to get a little deeper into that a lot of thought a lot of our listeners have been trying to get on that and endure I'd love to to get your thoughts with that on that I mean the president did address this during a speech at the future farmers of America convention in Indianapolis on Saturday he began his speech by talking about the shooting\nToday with one unified voice we condemn the historic evil\nOf anti Semitism and every other form of evil and unfortunately evil comes in many forms and we come together as one\nPart of the president's opening of his speech to the future farmers of America in Indianapolis over the weekend but contrast that with what the president tweeted this morning she wrote quote\nSupport for G. P. B. programs comes from our listeners\nAnd University of Georgia extension offering information and publications on healthy sustainable food from going to harvesting to cooking learn more by calling one eight hundred ask UGA one or online that extension thought UGA dot edu\nTB has been honored by the Georgia Associated Press media editor is winning the top award for radio the pacemaker award we were also honored for best specialized reporting best anchor and best newscast gp news stand with the facts [noise]\nI'm making a chocolate bar ... coming up with an extra point kindness modesty and humility gratitude and the modern age when Americans right we use these words half as much as we used to [noise] what's the cost of losing our shared civic language for virtue we'll ask the leader of the American humanist association\nThat's coming up with an extra point from NPR\nEleven o'clock this morning on GPS and she'd be moved on board\nComing up in the next time point from the NPR eleven o'clock this morning on G. P. N. G. P. B. news dot org\nSupport for NPR comes from this station and from visiting angels professional caregivers assisting adults in bathing dressing meals and light housework nationwide\nVisiting angels America's Choice in senior home care office locations are visiting angels dot com\n[noise] and from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price hero price invest with confidence\nBack now to our conversation with rabbi Jill Jacobs Charlie ... let's get some more of your questions and comments Constance in Silver Spring Maryland writes I Know this sounds weird but I actually feel some hope\nAfter the massacre it was obvious that the bigoted crude and hateful language from prominent people would end in tears we were told it was just trumping Trump telling it like it is he could be as prejudiced and root as he liked it was his right under the first amendment it wasn't his fault people looked on him as a role model\nNow that everyone sees the consequences we can all mobilize against hate speech and hate crimes and frankly it's about time [noise]\nA GW tweets hate speech is free speech if we're going to live in a free society that's how it has to be but legally acceptable behavior isn't necessarily morally or socially acceptable behavior we can fight back against hate speech with our own words are votes and our money [noise]\nBase in Chapel Hill North Carolina writes real media has to start calling out outlets like Fox News for their lives and propaganda that enables hate speech to be propagated\nNPR and other rational sources have to call out the president's lies and distortions there needs to be consistent strong resistance to the hateful divisive speech that is anti American journalists needs to be less accommodating end quote unquote fair\nTo all opinions and stop repeating without strong criticism of the president's ignorant rats if not you who make America kind again [noise]\nLet's get back to the phones and again thanks to those of you who have been patient with us on the phones we know that screening has been tough today but we've had to screen very hard with some of the people who felt like\nSharing their comments on our air we will hear from those folks but we will hear from David who's here in Washington DC Hey David what's on your mind\nHearing their comments on our air we will hear from those folks but we will hear from David who's here in Washington DC Hey David what's on your mind\nI'm well thanks for having the show I um I guess I'm I'm speaking as someone who's\nBoth religious Jewish and also very much scientific I think there's a strong feeling\nAmong a lot of us that there has been a a much lower acceptance on the left of people who have a strong religious views and a close connection state of Israel I mean I teach at a a small school here in the city and or in this in the suburbs and a lot of us didn't do feel uncomfortable on college campuses and feel that um\nYou know the express a strong and here in state of Israel or especially religious views that aren't um\nYou know but I mean about hot button social issues but as their religious views that they won't be accepted and I think that that's something that that needs to be talked about to um\nYou David how how do you deal with it when it comes up on on your campus can you give us an example of how it shows up and and how you or how the school deals with it\nBut I mean we're Jewish religious school so you know for us you know what we\nMean there are students who are you know are not particularly strongly support of Israel in one way or the other but um when our students leave this school\nAnd they often find their campuses unfriendly they find professors especially a friendly if if they want to express a pro Israel standpoint and uh so I mean while it's true I mean I don't\nThink it's reasonable say that you're seeing a lot of violence in the left and that that's true I think you are seeing and I think our students feel certain intolerance 'em when they go to college um and it's you know I don't know we we tell\nWe do tell kids probably shouldn't need need to shut up you know they set up by the you know you can't argue with every ... or\nJust kind of how you're going to have to learn to live with that kind of pick your battles I think that's a hard thing to pick\nTheir battles I sent me an I ... I don't speak for the school uh but I've certainly advised didn't do that and not\nThe non federal everything will David there Tom but can be it can be very hard to even let me\nPut that to thank you for sharing that let me put that to rabbi Jill Jacobs ... what do you make of Davis comment\nThank you day that I wanted to respond best to you and to Stephanie who are speaking about one of the the same phenomenon really I wanted to say that the first time really sorry that your son is going tree that unfortunately it's not unusual these days but of course a high school students shouldn't have to experience that kind of hatred\nAnd for both of you know I let it be very clear that there are certainly\nIt is but of course a high school students shouldn't have to experience that kind of hatred and for both of you I Want to be very clear that there certainly is anti Semitism and the left and very often it expresses itself\nAs a tax on Israel on Israel's right to exist now that's different from saying that criticism of Israel's policy is is anti Semitic which is not you can criticize any countries policies but often that criticism of Israel crosses the line into anti Semitism [noise]\nAnd as an organization that is pro Israel and also critical of many of Israel's governmental policy is we are all the time speaking out against the places on the left where\nWhere that criticism crosses the line and we have to be really clear about where those places are I have an article actually in the Washington Post that tries to lay out some of the places in which criticism of Israel is not criticism of a country and its policies but rather crosses over into\nStraight up anti Semitism and unfortunately we have seen incidents around the world in which there are people who carry out who carry a violent acts and say that they are motivated by hatred of Israel but the targets are actually choose who are shopping in a grocery store in a jewelry store in a synagogue\nAnd at the same time in the United states right now again saying that we have to call out that anti Semitism the left what's different about the anti Semitism and other hatred a race racism and homophobia and seeing a phobia and the right is it it's being supported by the government\nIt would be different if we had a situation in which there was hatred on the left hatred on the right and somebody at the top who is trying to restore who's ... who is criticizing\nAny kind of hatred and who was trying to restore civil discourse to the U. S. but instead we have somebody at the very top who is encouraging the hatred on the right and riling\nUp his people to see more of your comments ours we continue our conversation which has many recalls we can't as well just briefly wrote on our Facebook page\nI Am emotionally exhausted I was in my own synagogue on Saturday when I heard the news I was looking forward to going to synagogue to escape the news of the week now there is no escape and no sanctuary but as our nation rabbis teachers the world is a ... bridge and the main thing to remember he was not to be afraid\nTo return our Facebook page yesterday's interfaith service in ...\nYou just the world is a narrow bridge and the main thing to remember is not to be afraid\nLynn wrote on our Facebook page yesterday's interfaith service in Pittsburgh filled me with hope\nVarious religious leaders offered support strings and loved to a community crushed by its loss if anything is going to change we citizens must make it happen last night's fellowship help to bind our wounds and set us on the path for making our town better\nIndira would you react to that I feel like part of what worked [laughter] I hate to say in Pittsburgh favor but one of the things I think helped in this whole process as you described grow ill\nIf it's a kind of community that had these ties long before this happened so that people who needed to come together already had so in crisis struck they just they just rolled out and they knew how to lock arms with one another\nThat's right I mean a squirrel hill is a very ... this is one factor is a very educated community um it's right next to CMU Carnegie Mellon university and pet\nAnd a lot of the people who live and scroll hill are um you know doctors lawyers professors teachers accountants dentists it's an educated community a tolerant community and Pittsburgh overall\nIs also um you know politically liberal community and voted something like between Seventy and eighty percent for Hillary Clinton and this last election even though Pennsylvania\nUm went for Donald Trump so the community as Pittsburgh overall and the mayor I'm Bill ... has been you know talking about tolerance for a long time and that is the history of the city so that's why I Would say yes it did help in Pittsburgh favor but\nYou know all of the negative rhetoric that we have coming um we were talking about the and then the enemy of the people line earlier that the president tweeted this morning\nI'm we now know that a bomb was apparently headed for CNN was just intercepted today in Atlanta just four months ago and attack or killed five reporters and Annapolis news from the capital Gazette", "year": "2018", "show_name": "1A Plus", "city": "Chatsworth", "day": "29"}