{"month": "10", "state": "GA", "station": "WNGH", "content": "To be four to seven on G. P. B. and B. news dot org\nServing bell dust and Riyadh CPB and Eighteen station service of Georgia Public broadcasting Andre Dawson submitted before ten o'clock good to have you along today one\nAnd beyond this is a gp be in a dream station service of Georgia Public broadcasting Andre Dawson it's a minute before ten o'clock good to have you along today one age is ... an G. P. B. and gp be news dot org\n... one of the most important George elections in decades he takes place in just Eighteen days as ... as you begin to firm up your choices for political rewind Japan would insiders will be here more days a week to help guide you through raises from the top of the ballot to the bottom\nOf the ticket joined ... Jim Galloway and the mayors of Columbus in Sandy Springs today a Jew for the latest don't what is your New Jersey\n[noise]\nNinety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\n\nHere in New England the red Sox have folks eager for next week's World Series but before we settle into baseball's big game let's review the hits and misses from this week's new\nFrom W. A. M. U. and NPR this is one egg [noise]\nHey they're on Russia with Johnson visiting New Hampshire public radio today on one a it's the friday news round up President Trump continues making waves ahead of the midterms joking about a reporter who got body slammed by a politician\nMeanwhile New Hampshire voters have local races to decide oh it's been a big weekend business including more problems at the are\nAlso Florida faces a long recovery from hurricane Michael and will the booming economy help close or boiling deficit\nWe love to hear from your emails won a a W. A. M.\nU. dot org watch our video stream on our Facebook page for me to ask one egg [noise]\nBuy from NPR News in Washington I'm more of a Coleman President Trump says it certainly looks like missing Saudi Arabian journalist ... cars showed gene is dead Turkish officials have claimed they have recordings that proved to show deen was killed in a Saturday consulate an ... a charge the Saudis deny\nTrump says if Saudi Arabia is to blame the response will be quote very severe\nAfter talking about the show ... Trump attended a rally in Montana last night and praised a Montana Congress men who attacked a reporter last year and bears Don Gonyea reports\nTalking about cars show Trump attended a rally in Montana last night and praised a Montana Congress men who attacked a reporter last year and bears Don Gonyea reports the issue involved congressmen Greg gene four day\nJune ... was elected in a special election in twenty Seventeen that's when he assaulted a reporter from the guardian newspaper he pleaded guilty to a misdemeanor assault last night the president ... visited that attack calling Jean forte quote my kind of\nGuy that your body slammed [noise] president\nRecalled first hearing of the assault and I said oh this is terrible he's going to lose the elections and I said well wait a minute\nI Know Montana pretty well I think it might help him camping\nIn Arizona which has a close US Senate race Don Gonyea NPR News Missoula, Montana\nMore than a week after hurricane Michael slammed the Florida Panhandle cities and towns are facing the daunting task of trying to rebuild NPR's Debbie Elliott reports on the cleanup in Port saint Joe a coastal Florida town\nAlicia smiley and her brother are clearing out the apartment she shares with her disabled grandmother care\nHim it was inundated by storm surge and now most of their belongings are piled on the curb\nDevastating um\nIs depressing [noise] um [noise]\nYou know I Try not to think about it too far\nIt's been a lot of people come in and helping all we can do is appreciate any and everybody that comes in and\nOut thank you is not good enough power is slowly coming back but down trees into breed line just about every street in town Debbie Elliott NPR News port saint Joe Florida\nElection officials in Afghanistan are delaying upcoming parliamentary elections in a southern province and ... ports from Islam about this follows yesterday's assassinations that the powerful police chief of Kandahar the\nPolice chief was assassinated by his Buddy Guy in a brazen Taliban attack\nIn ... during a high level meeting in Kandahar to discuss security plan to parliamentary elections expected the Saturday now voting will be delayed in Kandahar by one week it throws even more uncertainty around the elections which have already been ... by deadly militant attacks and controversy\nNPR's via indeed on Wall street the Dow was up two hundred ten points the NASDAQ he's a well over ... percent it's Seventy five hundred seven\nAnd contrary to the NPR via deemed on Wall street the Dow is that two hundred and ten points the NASDAQ he's up well over ... percent at Seventy five hundred Seventy five this is NPR\nLive from the CPB newsroom good morning I'm drew Dawson just ahead on one ha it's estimated that hurricane Michael cost ten billion dollars\nLook at the week's big stories in the big bucks involved at this hour but first if he'd be be news next week a federal judge in Atlanta we'll hear a lawsuit challenging Georgia's signature matching law for absentee ballots\nAs gp be Stephen Fowler reports it's one of four ongoing lawsuits aimed at George just election system\nOn Tuesday a judge will hear the case brought by the American civil liberties union of Georgia they argue that voters whose signature does not match while on file should not have their absentee ballots rejected as a Wednesday only one hundred and Seventeen of more than Seventy two thousand ballots have been rejected because signatures didn't match\nThere are also ongoing lawsuits targeting absentee ballot rejection rates the state's pending voter list and the touch screen voting machines election day is November six for db News I'm Stephen Fowler in Atlanta\nWell as the weather begins to get colder in Georgia the Atlanta based Centers for Disease Control and prevention is warning women who are pregnant or may become pregnant\nTo get vaccinated for the flu according to the CBC changes in the immune system heart and lungs during pregnancy can lead to a greater risk of severe illness from the flu health officials say a flu shot can reduce the pregnant woman's risk of hospitalization\nBy an average of forty percent\nAn estimated eighty thousand Americans died of the flu and flu related complications last winter and making it one of the deadly seasons in recent history [noise] more Georgia News Go to G. P. B. news dot org and follow us on Facebook and on Twitter\nSupport for NPR comes from the three I owe the powering enterprise digital transformation with artificial intelligence predictive analytics and I owe these illusions learn more at the three I O T dot AI and the ... foundation at ... dot org [noise]\nYour GPA the weather forecast for this Friday and mix of sending clouds across the state with eyes ranging from the mid seventies in the northern tier to the mid eighties south and along the coast some clouds develop overnight lows drop into the sixties Saturday partly to mostly clouded with occasional shower spreading across the state high temperatures range from the mid seventies in the northern tier to the mid eighties south\nDevelop overnight lows dropping to the sixties Saturday partly to mostly clouded with occasional shower spreading across the state high temperatures range from the mid seventies in the northern tier to repeat itself and along the coast [noise]\n[noise]\nThis is one a Happy Friday I'm Joshua Johnson visiting New Hampshire public radio in Concord we often have to change the friday news roundup hours before the program heirs to account for breaking news today was no difference with a story we figured we'd better include especially considering where we are [noise]\nSporting goods store started selling Red Sox commemorative shirts almost as soon as Boston beat the defending champion Astros Houston lost its bid to return to the world series after the red Sox won last night for two won\nThe series starts in Boston on Tuesday against either the LA Dodgers or the Milwaukee Brewers at the moment the Dodgers lead their series three games to two now maybe you're a fan of none of these teams but considering how serious the midterms are\nYou can't that grudge folks for wanting a bit of a break from the news we will get to this week's big stories do including the elections in New Hampshire and nationwide the continuing recovery effort after hurricane Michael an alarming new projections for the U.S deficit\nConsidering how big all those stories are is it any wonder we started with the run for the pennant\nJoining us here in New Hampshire Public radio is the senior political correspondent Josh Rogers Josh welcome to winning good to be her back in our Washington studio is Alexandra Jaffe a correspondent for vice news tonight on HBO Alexandra welcome back thanks for having me and frankly or don't yes as a White House correspondent for McClatchy Franco good to have you with us great to be here\nWe welcome your questions and thoughts about the week's top story so email us one a at W. A. M. U. dot org\nComments on our Facebook page where you can also watch a video stream or tweet us at one at a let's begin with politics in the run up to the midterms starting in Montana where President Trump campaigned last night and she made some comments that seem to praise violence again\nAnd the run up to the midterms starting in Montana where President Trump campaigned last night and she made some comments that seemed to praise violence against journalists\nHe was speaking to a crowd of supporters when the president cheered Montana representative Gregg GM's forte for assaulting a reporter back in may here's what the president said\nThree o'clock this afternoon on gp B. and B. news dot org\nSupport for CPB comes from you our listeners\nAnd the high museum of art friday jazz returns on October nineteenth ... to Ali Ali blends African in Latin rhyme with jazz infusion into her signature sound tickets and details at high dot org and the Miller theater and Bob ... presents featuring the iconic actor singer songwriter Chris christopherson\nNovember twelfth that Augusta's Miller theater tickets on sale now at the Miller box office and Miller theater Augusta dot com\nHurricane Michael was devastating for South Georgia farmers recovery will take years some farms will never be the same\nQuarters happened down here in Georgia spent a curse word farmers lord forever\nGB reporters are in South Georgia as farmers deal with Michael's aftermath began the long road to rebuilding listen for the reports during MORNING EDITION and all things considered DVD new stand with the facts\nSupport for NPR comes from this station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one in a\n[noise] from the Alfred P Sloan Foundation bridging science technology and the arts by supporting exhibitions such as programmed to the Whitney Museum in New York City on view through a pro fourteenth more at Sloan dot org and from the sustaining members of this NPR station\nThis is one a I'm Joshua Johnson in Concord New Hampshire it's friday news round up with New Hampshire public radio senior political correspondent Josh Rogers frankly or don't here's White House correspondent from UCLA\nHey I'm Joshua Johnson in Concord New Hampshire it's the friday news round up with New Hampshire public radio senior political correspondent Josh Rogers Franco or don't is White House correspondent for McClatchy and Alexandra Jaffe a correspondent for vice news tonight on HBO we'd love to hear from you about this week's big story so comments on our Facebook page where you can watch video stream\nTweet us at one a or email one a at W. A. M. U. dot org let me get to a few of your comments including some of your commenting about this Elizabeth Warren story Martin rights do you think Native American voters will vote Republican and support Trump because of this not likely\nAndy writes I relish anything that makes Trump angrier makes him look bad and I was very happy that Warren released this DNA result\nHe showed his immaturity and lack of decorum once again when he simply replied who cares at hearing this story beat him endlessly and bring him out of his whole for all the world to see that's my desire\nAlexander I wonder if you could respond to end these combat this idea of beating the president and kind of showing him for what he really is\nI mean that was tried over and over again in the twenty sixteen election and it didn't end up working I think when you engage with Trump in some of these arguments that's what fires up his base and that's what's been his success in the past\nThat's what could help Republicans on sort of succeed in the midterms and it's a dangerous strategy for Democrats in twenty twenty I think taking the high road still seems to be the best tactic but we'll see how things play out\nWhat area will just go ahead for like a it's a very dangerous strategy I mean I just want to you know add to what Alexandros saying look this is what happened to two thousand sixteen every time a day when it during the primaries and the Republicans every time Rubio J uh\nYou know Jeb Bush all of them tried to take a Trump on in his neck of the woods kind of playing in this dirty dirty water Trump just kind of\nTook 'em out um and I think it's very dangerous or for Democrats or to try to play in those waters and\nThat's that's meant in many ways why Trump continues to be so powerful particularly in the Republican Party because so many of his own a party members leaders are afraid to take them on because he's so good at this stuff Josh will\nView it the way in which um you know the parochial entity like the New Hampshire Democratic Party is trying to stoke enthusiasm for its base coming up to the elections are founded telling that the guests so they brought up a typically these would be people\nPrivate party is trying to stoke enthusiasm for its\nBase coming up to the elections are founded telling the gifts that they brought up\nA typically these would be people you know our presidential runs for big fundraisers and big events to rally behind candidates have been you know stormy Daniels' lawyer Michael Ozzie and Alec Baldwin and they we haven't yet seen I mean typically the more traditional candidates would start arriving in preparation for twenty twenty after the midterms but\nWe've the the people who've drawn the most attention of and the people who've cast themselves as Trump antagonist and\nUh the coffers of the local Democratic Party would tell you that that's been good for them so you know the mid term to appear least favorite both sort of an all against all on the question of\nTrump another politician who at one point was an antagonist of Donald Trump on the campaign trail was Republican Senator Ted Cruz of Texas He is running for his seat again and this week he democratic he debated his Democratic challenger Beto O'Rourke\nPeople are pretty closely watching this race because it could help decide which party controls the Senate because the margin of control is so tight\nTed Cruz's ahead in the polls at the moment but as we said the race is still pretty tight and ... came out swinging in the debate he even used President Trump's nickname for Ted Cruz from the twenty sixteen election calling him lying dead at what point at one point Franco or don't is what sense do we have of how the candidates came out of that debate\n[noise] um you know I think it's it's this is one of the most fascinating races it's ... it's been the most fascinating race probably a throughout the terms and it's going to continue to be as it goes down to the wire um I mean\nThis was always going to be a long shot or for Beto O'Rourke he tried to come across early on he you know tried not to say too much about a cruise and Trump and you know he but he's been dropping in the polls and he's\nHe's had to take a new tack using this language of lion had um attacking them about saying that Cruz is only for Cruz pointing out how many communities he's visiting in Iowa but not in Texas on it's been a major shift in tone for art\nBut it's also been something that clearly he's been uncomfortable with just yesterday during the town hall he said I'm he perhaps went a little bit too far in the heat at the moment and this is not necessarily something that he wants a you know kind of the tone that he wants to take in his campaign\nWhether it'll work uh we'll see but you know there's a lot of hope for Beto O'Rourke some some hope\nAh you know kind of the tone that he wants to take in his campaign whether it'll work uh we'll see but you know there's a lot of hope for better or some some hope is like if he can actually take this tackled that maybe he could be a twenty twenty candidate but that seems like a mat seems like another ballgame\nYeah Alexander I was gonna ask you whether or not what you read was on whether this could work I mean ... I Wonder if this debate gives us any more insight into whether\nA rather progressive Democrat like over ... has a chance in a state like Texas who's you know who's governor both senators Neal reliably conservative Republicans does this give us a sense of whether he moved the needle\nI mean broadly it we have to be careful not to over emphasized debates in the midterms typically you know not that many voters watch them sometimes undecided voters do but unless there's a major gas\nThey typically don't move the needle that significantly in right now I think the polling average shows that Ted Cruz's up by about seven points which\nOn election day of Texas that's the way it typically does is enough I also think and under covered aspect of this raises the fact that Texas does straight ticket voting you can go in a box for Republicans\nAnd the strength of the Republican Party over all the strength as Governor Greg Greg Abbott for instance who's running against Ed Ed Democrat that has been pulling in the thirties and seems to be enough to carry Ted Cruz over the finish line even as better over ark\nHas been able to keep them to single digits\nI just wanna make sure we're clear on what you said Alexandra in Texas you can just mark a box of the top of the ... and says Republican and it automatically cows that vote was telling me for all the Republicans on the ticket\nYet you can basically built for every Republican all at once I'm this is the last election that they'll be doing straight ticket voting after that uh it won't be as easy\nFundraising reports from the third quarter of the year we're due this week to the federal election commission they were due on Monday and the results\nLook pretty good for Democrats and house races at least just in terms of the dollars and cents of Democrats are dominating fund raising in house seat races the challengers the Democratic challengers out raised Ninety two Republican incumbents more than six the Democratic candidates raised more than a million dollars that quarter\nIn the Senate Democrats are also outrage and Republicans ... raised thirty million dollars in the third quarter Ted Cruz raised just over ten million dollars according to an analysis by five thirty eight the Democrats ability to outspend in Senate races has not correlated with a bump in the polls\nIn dollars according to an analysis by five thirty eight the Democrats ability to outspend in Senate races has not correlated with a bump in the polls as it has in house races\nAlso glad to hear from some of you about the president on the campaign trail including in Texas Karen tweeted Trump is coming to Houston next Monday to rally for Ted Cruz Monday is also the first day for early voting in Texas [laughter]\nLet's shift gears and had to Florida where the after effects of hurricane Michael continue to be felt and seen\nThe weather channel reports the death toll at at least thirty five people with fatalities spread from Florida all the way up to Virginia now those death toll figures are bad enough but Franco what's our sense of how the recovery effort is going particularly the effort to find people who've been missing\nGather still people missing there's still people who are trying to pick up their lives um you know I think\nThe town and Mexico beach has not reported given any numbers\nUm of how many people are are missing a but there is talk of that it could likely be in the hundreds I mean this was a massive storm I'm Talking about one of the biggest storms out of the top three or perhaps by some accounts that ... you know had made\nJoined Emily Jones for MORNING EDITION from five to nine right here on jeep ... support for ... comes from generous listeners like you\nAnd J. P. Morgan Asset Management who believes on constrained thinking leads to better outcomes and entrepreneurship and investing their video series explores the impact of the un constrain spirited J. P. Morgan dot com slash on constrained\nYour support allows ... to bring you a great weekend programs that are both informative and fun like wait wait don't tell me asked me another and Planet Money check out our entire radio programs scheduled at gp news dot org [noise]\nI'm David Folkenflik coming up on the next on point a black teenager witnesses a friend killed by a white police officer that's the storyline of the new film the heat you give we're joined by the director and by young activists who told their stories of what it means to be black in America today\nThat's coming up in the next on point from if your\nMorning at eleven O. G. P. B. and B. news dot org\nMorning at eleven on G. P. B. and B. news dot or\nSupport for NPR comes from this station and from progressive insurance offering a way to buy home insurance with their home quote explorer tool\nCustom quotes in rates are available online learn more progressive dot com or one eight hundred progressive now that's progressive\nAnd from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nBack down to the friday news roundup with Josh Rogers Alexandra Jaffe and frankly or don't is still a little bit more time to get in your questions and thoughts about this week's top stories from across the country one a at W. A. M. U. dot war Josh Rogers let's talk New Hampshire for a little while there are two congressional races underway there are two districts in New Hampshire\nThe race in district one\nWill be historic kind of no matter who wins because either the Democrat Chris Pappas would become the state's first openly gay member of Congress\nHis Republican opponent Eddie Edwards would be the first black house member from New Hampshire tell us a bit more about the first congressional district as I understand that it's it's a swing district that Donald Trump carried in twenty sixteen right\nAbsolutely frightening hands party departed from two thousand eight or the GOP winning and midterm years Democrats winning in presidential years is now held by Carol Shea Porter fairly liberal Democrat who's\nRetiring I'm In ... where do you have people who are running really within the mainstream of their parties are ... has been serving in various\nElective offices for a long time he's in his late thirties he says family owns a very popular restaurant in Manchester awesome to stop for presidential candidates\nHe um he comes from Manchester which is a town the where the even the Democrats have historically been a little bit more conservative than in other parts of the state particularly on fiscal matters\nUm Eddie Edwards is somebody who has a background in law enforcement he was in the navy he at one time lived the states uh enforcement division of its liquor commission in New Hampshire we have those big highway liquor stores liquor is controlled by the state uh I was a fairly big job he of ram enforcement division and he's been a police chief [noise]\nUm you know they were pretty much\nOr so liquor is controlled by the state uh I was a fairly big job he of ram enforcement division and he's been a police chief [noise]\nUm you know they were pretty much keeping to well within the norms of their party Eddie Edwards is you know embrace to Donald Trump he every Giuliani up here campaigning with them [noise]\nUm and he's in some ways tried to cast Chris Pappas those you know part of some sort of resistance movement and saying we've got to see the nationally or you know Chris Pappas is hardly a radical guy or you know family um run restaurant ah worked I worked for Joe Lieberman when he ran for president um\nEnd of this race is one where the seat can do either way and both parties believe they have a shot\nWas also a gubernatorial race underway here at the Republican government Governor Christie new new\nFaces Democrat Molly Kelly she's won a Fifteen women running for governor across the country which is an unprecedented number the latest fundraising numbers that came out this week showed that Kelly the Democrat has outraged Sununu the incumbent Republican\nThree to one uh ... brand of New York came to conquered on yesterday to helped campaign for Kelly\nThey met with employees of the Granite State candy shop and they discussed paid family leave I'm interested in where this issue sits in terms of all the issues New Hampshire voters are considering but here as part of what happened was ...\nIt can help family happier and how we're going to help people to be more productive at work and so\nIt's a win win everywhere I go in this day I hear about the need for paid family medical leave and how important it is for people to be able to have the choices in their life\nTo be able to work hard where they're working but then to be able to spend time with the people they loved that most when they're needed them out\nThat was Molly Kelly you heard at the end senator Jill ran was at the beginning tell us a bit more about Mali Kelly is is this paid family leave issue a big one for her based on her political background her personal background will\nIt's been a huge issue for her whether it is for voters is an interesting test me she's been running pretty much exclusively on this issue um it's a challenge to somebody covering their first how many stories one can write about paid family leave my understanding as Democrats\nHave polling suggests that Governor Sununu is vulnerable on this issue he was on the record supporting a paid family leave bill that didn't make it through the legislature in part because he\nThat suggests that Governor Sununu is vulnerable on this issue he was on the record supporting a paid family leave bill that didn't make it through the legislature in part because he came out against it at the last minute or for fear that a payroll deduction amounted to an income tax which you know it was a real kind of fighting words here in New Hampshire where there's no income tax\n'em in the Democrats believe this is a need for that works for Raleigh Kelly by the end of her background at one point she was a single mother with three kids who work your way through college and that you know ... new new son of a governor brother of a U.S senator uh\nYou know doesn't understand the the stresses and strains that many working people face and you know it does get at New Hampshire has kind of a bifurcated economy uh\nUh you know boom times for people to the upper income we have budget surpluses and tax collections are up but you know the wage growth for people at the lower end of the scale\nHas not been great and this is an issue that for Democrats they feel that it kind of hits a lot of boxes and may help mobilize women which are you know he constituent anywhere for particularly here in New Hampshire how close is this governor's race whoa um [noise]\nYou know ... should win or you know we have to your terms here no governor's been talks after one term\nUh since two thousand four and part of that it had been a century so it's pretty rare that a governor doesn't get a second term as being a disaster or a really tanking economy we don't have either of those uh here polling indicates a new news up by about ten and you know you mentioned the fundraising numbers and\nMolly has outrageous Christian in three to one and the most recent reporting period he does enter the final stretch of this race with a cash advantage although for an incumbent\nWith a nationally known name he's a pretty bad fundraiser he will freely admit he doesn't like to do it so\nYou know he's only got he's got four hundred thousand she's got two hundred thousand interest groups will will add to that in terms of advertising but this is a race Democrats feel they\nHave a chance to win if if a blue wave a venture weights and they think that Molly Kelly a bite in her background but it'd be a woman is somebody who perhaps his best engineered to kind of ride away\nSpeaking of nationally known names Frank or don't is I Wonder what your senses of senator Jill a brand making this trip to help Mali Kelly is their speculation about her future maybe and twenty twenty\n[noise] there's a lot of speculation about her future in twenty twenty on I think how much is it kinda resonate as as the big question I mean obviously I there's some\nI'm twenty twenty ... there's a lot of speculation about her future and twenty twenty um I think how much is it kinda resonate is is the big question I mean obviously\nThere's so many names being kicked around ah right now or that you know it I think time will tell but there there's no question that go around is one of the people that that people are talking about and certainly are watching very closely in every move\nA that she makes 'em is being picked apart um you know analyzed a and looking for it how it could mean and how it could uh what impact that could have on twenty twenty\nLots to discuss with business and the economy this week including the U.S deficit we don't hear much about it these days but it's back in the news because the Treasury Department revealed this week but the deficit has grown\nLast year it was about six hundred sixty six billion dollars not a significant number there at all six hundred sixty six billion this week the Treasury Department revealed that the deficit has grown to seven hundred Seventy nine billion dollars gets a six year high end projection say it is on track by the end of this decade\nTo ... a trillion dollars the deficit a trillion dollars\nNo Alexander some experts are pointing to the Trump Administration for being responsible for this particularly\nThe tax bill part of the sales pitch for the tax bill for the tax cuts is it by cutting taxes business what kind of a leash more productivity the economy would boom like never before and the resulting largest would more than make up for whatever we lost in tax revenue how's that working out so far\nWell we haven't seen that yet certainly an ... fan is Republicans are arguing that that's going to take 'em you know about a decade to even out though at this rate although the economy is booming there's ... there's no way that it can make up for where our deficit is at at this point\nUm it was sort of an open secret in Washington that the real plan that Republicans were kicking around was welfare reform", "show_name": "1A Plus", "year": "2018", "city": "Chatsworth", "day": "19"}