{"month": "10", "state": "GA", "station": "WNGH", "content": "Serving Valdosta and beyond but this is CPB and Eighteen station service of Georgia Public broadcasting I'm drew dos and it's a minute before ten o'clock good to have you along today\nServing bell dusted and beyond this is a gp be in a dream station service of Georgia Public broadcasting Andre Dawson it's a minute before ten o'clock good to have you along today one eight is next on G. P. B. and G. P. B. news dot to work\nWith a little more than a week to go until election day it appears the conscious for governor remains a toss up one of the factors that will shift the balance Ryan camps or ... ... as the race comes to a close political rewind insiders will be here to break down\nEvery step on the porch to the finish line and we'll look at what's happening in other races on the ballot Congress and statewide offices joining us today too [noise] [noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome quarter but Georgia Public broadcasting radio network [noise]\n\nIt's a run up to the midterms was not intense enough now investigators wants to know if a series of pipe bombs was politically motivated against critics of President Trump\nFrom W. A. M. U. and NPR is one egg [noise]\nEither on Joshua Johnson visiting Georgia Public broadcasting in Atlanta today on one a it's the friday news round up we still do not know who sent those pipe bombs through the mail but some including the president feel that our divisive politics may be to blame\nHow close are we to finding out he did the [noise] the races for governor in Florida Georgia and New York heated up even more with some contentious debates this week [noise]\nAlso Georgia faces claims of voter suppression\nAnd Megan Kelly is out NBC's Today show\nWhat questions do you have about this week's news comment on our Facebook page or tweet us ... won a [noise]\nBlind from NPR News in Washington encore of a coalmine law enforcement has intercepted two more suspicious packages addressed a prominent critics of President Trump\nAs NPR's Miles parks reports one package was addressed to democratic senator Cory Booker and another former director of national intelligence James Clapper care that CNN\nTo packages discovered stay are similar in our parents or the other ten packages recovered this week by law enforcement one was the trust of senator Cory Booker the junior democratic senator from New Jersey\nIt just discovered stay or similar and her parents to be other ten packages recovered this week by law enforcement one was addressed to senator Cory Booker the junior democratic senator from New Jersey is an outspoken against President Trump's policies as widely considered to be considering a run for the Democratic nomination for president in twenty twenty\nThe other package was addressed to James Clapper who's the director of national intelligence for most of rock Obama's two terms as president and now my frequent appearances on CNN [noise]\nThe package address to Booker was intercept in Florida and they want us to Clapper was intercept in New York\nNone of the twelve packages recovered so far have reached the people they were dressed two miles parks NPR News\nThe brutal murder of Matthew Shepard a gay college student in Wyoming has become a symbol for algae B. T. Q. writes his remains have been in storage since his death Twenty years ago ... percent of member station WBUR AMU reports today they will be interred at the national cathedral in Washington DC\nJudy Shepard thinks her son would've approved of his final resting place\nI appreciate it can be praying practice actually ethic of the adult loving all the pomp and circumstance around the ...\nGene rabbits in the first openly gay Episcopal bishop says shepherds in tournament in a church is a healing moment for him as a gay Christian man\nI learned just this week that I Would be carrying mass ashes of that long a trial that magnificent Pedro [noise] and I can hardly talk about it without crying\nShepherds remains will be kept in the trip to the cathedral near Woodrow Wilson and Helen Keller for NPR News I'm Maggie Anderson in Washington\nThe U.S economy continues to grow robustly the latest numbers on the Commerce Department show the economy grew three point five percent in the third quarter of this year and fears ... has more\nThe increase in the real gross domestic product is more or less at a kind of messed had expected it shows strong growth driven by consumer spending and government spending\nQuarterly growth was not as high as the blockbuster numbers we saw earlier this year when GDP grew by more than four percent and part that's because of changes in international trade as terrorists can still this is a strong showing for the U.S economy the country is on track for the best annual growth since two thousand five\nThese numbers are closely watched as this is the last GDP update before the midterm elections ... NPR News\nGood news is not influencing Wall Street the Dow Jones industrial average down three hundred sixty points are one and a half percent the NASDAQ as down two and a half percent\nIt is not influencing Wall Street the Dow Jones industrial average down three hundred sixty points are one and a half percent and that that gets down to and a half percent you're listening to NPR\nBy from the GB newsroom good morning I'm drew Dawson just ahead on one a the friday news roundup looks back at the biggest stories\nBut first in gp big news Georgia's secretary of state Brian Kemp fizz asking a federal judge to suspend her order governing how elected officials must handle absentee ballots and applications that have mismatched signatures while he appeals decision\nUs district judge Lee May yesterday issued a final order instructing the state to stop projecting the ballot sand applications because of signature mismatch without first giving voters a chance to fix the problem\nMeanwhile the secretary of state's office was looking into reports of missing absentee ballot requests in DeKalb County eleven alive reports the Democratic party official notified the state that the requests were missing the secretary of state's office says they have no proof of the missing ballot requests but they're taking the complaints seriously\nIn a statement the office says it's waiting for Democratic Party officials to provide evidence on Twitter the party is encouraging people who requested an absentee ballot but haven't received one\nTo vote in person instead\nVice president Mike Pence has announced plans to return to Georgia to campaign for Republican gubernatorial candidate Brian Kemp WTO's the reports that Pence announced the November first swing through the state on his Facebook page\nRallies rescheduled that day in Savannah groove town in dealt in this will be a return visit to savannah for the vice president he was there in March with the St Patrick's Day parade\nCampus facing Democrat Stacey Abrams in a hotly contested race with the governor's office on November six more Georgia News Go to GB news dot org and follow us on Facebook and on Twitter\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com and the any AKC foundation [noise]\nYour gp be weather forecast for this Friday mostly cloudy showers moving across the state daytime eyes range from the low fifties in the northern mountains to the low eighties south and along the coast showers a gun by nightfall but it will be mostly cloudy overnight with some fog and the northern mountains lows generally in the fifties Saturday partly cloudy skies\nBut along the coast showers a gun by nightfall but it will be mostly cloudy overnight with some fog and the northern mountains lows generally in the fifties Saturday partly cloudy skies high temperatures in the sixties to low seventies\n[noise]\nThis is one hey I'm Joshua Johnson visiting Georgia Public broadcasting in Atlanta\nIt's hard not to think of what could have happened if just one of the explosive devices mail to critics of President Trump had detonated this week they did not injure any of their targets or even reach them they were stopped by police bomb squads or intercepted mail processing centers\nAnd some of the people targeted are speaking out against these acts of politically motivated violence\nA few hours after a pipe bomb addressed to John Brennan the former director of the CIA reached its destination Brennan spoke to an audience in Austin, Texas I\nRecognize that there are a lot of raw emotions and feelings in this country and very strong\nFeelings for individual political parties as well as individual politicians\nButts of this country was founded upon ah\nThe ah the foundation of freedom and liberty liberty and freedom of speech and [noise]\nI and others are being targeted because we're speaking out then we're living up to a a responsibilities as citizens I think that's again as a very unfortunate turn of events\nThat was former CIA director John Brennan speaking in Austin now today will catch up on the investigation and how this week's events might impact the nation's next big political contest\nJoining us here at Georgia Public broadcasting in Atlanta is Kathy Lohr journalist and former correspondent for NPR News Kathy welcome to the round up glad to be here joining us from gp in Macon Georgia is Adam reduce the I'm a journalist in residence at Mercer University's Center for a collaborative journalism at a welcome\nJoshua thanks for coming to Georgia and back in our home base in Washington is Eugene Scott a political reporter for the Washington Post Eugene thanks for making time for us thanks for having me\nWe love to make time for your questions and thoughts about this week's big story so email us one a at W. A. M. U. dot org comments on our Facebook page where you can also watch our video stream or tweet us at one eh let's start with this series of pipe bombs that have been sent to high profile targets across the country before we dive in\nOr tweet us at one egg let's start with this series of pipe bombs that have been sent to high profile targets across the country before we dive in big ... with a fast moving breaking story like this what we know and what we have confirmed debunked clarified is changing\nSupport for CPB comes from you our listeners and the Miller theater and Bob no check presents featuring the iconic actor singer songwriter Chris christopherson\nNovember twelfth at Augusta Miller theater tickets on sale now at the Miller box office and Miller theater Augusta dot com TB has been honored by the Georgia Associated Press media editor is winning the top award for radio the peacemaker award we were also honored for specialized reporting best anchor and best newscast gp news stand with the facts\nHurricane Michael was devastating for South Georgia farmers recovery will take years some farms will never be the same\nQuarters happened down here in South Georgia pecan farmers live forever\nGB reporters are in South Georgia as farmers deal with Michael's aftermath began the long road to rebuilding listen for the record during MORNING EDITION and all things considered DVD new than with the facts\nSupport for NPR comes from this station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one NA\nFrom home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd from the sustaining members of this NPR station\nIs one a I'm Joshua Johnson Sandra Day O'Connor was the nation's first female Supreme Court justice and the critical swing vote for much for ten years this week she announced that hurts\nHey I'm Joshua Johnson Sandra Day O'Connor was the nation's first female Supreme Court justice and the critical swing vote for much of her tenure this week she announced that her life and the public eye is over\nThe retired Justice OConnor is eighty eight years old and suffering from dementia she decided to withdraw from public life as the disease advances\nEvery current justice and three retired justice is released statements honoring O'Connor within hours of the announcement Justice Ruth Bader Ginsburg said quote\nShe strives mightily to make what was momentous for women in Nineteen eighty one year she was appointed to the court no longer extraordinary but entirely expect of all I Am among the legions of women and deferring to follow her lead unquote\nIt's the friday news roundup with Washington Post political reporter Eugene Scott Mercer University journalist in resident at a reduced the up and Kathy Lohr journalist and former NPR correspondent\nWe welcome your thoughts and questions about this week's top stories comments on our Facebook page where you can watch video stream tweet us at one a or email one a at W. A. M. U. dot org\nAdam ... before we move on to our next story I Wonder if you could respond to that tweet\nFrom Michael that reads this just further reinforces that people solely look for media that confirms their already set beliefs how do we break out of this show people that does you disagree with are still human Adam\nBoy uh I don't know\nI think uh the technologically enabled a fracturing of media is a really really significant factor in the status of our public life right now on the other hand I'm not sure that it's the causal agent um it might be a corollary uh\nI think that um you know we can talk all day about the norms of civic discourse breaking down but a nice that's very real trend\nAre actual substantive policy disagreements between Americans differences in fundamental values\nThat are really really wide and were perhaps paper over for a lot of years by the media mano culture and now we're able to see them for what they are\nI Am personally kind of amazed at that and more political violence doesn't happen in the United states given the depths of these differences um I don't think it's just in how we talk\nAnd who we're talking to and who were listening to I think a lot of what we're experiencing hears about fundamental differences in what we believed to be important in life and what we want it\nAnd who we are talking to and who were listening to I think a lot of what we're experiencing hears about fundamental differences in what we believe to be important in life and what we want government to do ...\nWe had fundamental differences forever and what we believe that but I think\nThat the increase in rhetoric I think I'm demonizing people making people your enemy making and then he was the enemy of the people has made a difference and I think that people don't generally talk to each other anymore there's not enough people that go up I mean I\nBecause of because I'm a report I talked to everybody but I Will ask people did you vote why did you vote who did you vote for people don't talk anymore that look at their phones and they are in their little bubble\nAnd Eugene I think it's important to note that and I don't know if you encounter this\nWorking for the Washington Post but certainly I Do on a program is on NPR is that the people who comments on our show or not just our fans are critics listened to I mean I understand the idea about the division but\nIf you hate NPR so much how do you know what we said on one aid to criticize us if you ate the Washington Post so much how do you know what was printed there to criticize it\nYeah and quite frankly I think that that a behavior if exemplified most from the president himself who really hate CNN but seems to watch a lot of it\nAnd it and I I'm blown away by how many people are are engaging us who don't want us to do what it is that we're doing and and it's unfortunate because I think we are a meat criticism or the media needs to be criticized we need to be held accountable but we need to be criticized well so that we can serve the public better\nGoing to keep moving from the story again just a quick caution as you listen to the coverage of this story over the weekend you please just remember the stories moving really really fast we're going to try really hard not to jump to any conclusions\nAbout what has happened there already been some details of the story that had been clarified or walk back so that's common in a fast moving breaking story like this keeping your on your NPR member station for the latest and an eye on NPR dot org\nA few more of your comments before we move on\nMatt emailed if Trump is responsible for the bombs are Democrats are responsible for the shooter at the Republicans baseball team practice both of these statements are untrue believe mass referring to the the congressional baseball game in which Republican Congressman Steve ... of Louisiana was injured\nPhilip emailed the suspicious packages may have originated in Florida but the perpetrator or perpetrators tours are not necessarily based there the Unabomber lived in Montana but traveled to Utah and the bay area to\nMay have originated in Florida but the perpetrator or perpetrators tours are not necessarily based there the Unabomber lived in Montana but traveled to Utah and the bay area to physically male his devices in order to deceive law enforcement\nAll right let's keep moving on with some other stories in the story continues to move in the next few minutes we'll certainly much no but let's talk a little bit more about politics particularly with President Trump's he was at a rally this week in Houston and she made headlines for a different set of remarks listen\nWants to not care about our country so much [noise] you know what we can do to make sure\nReally not supposed to use that word I'm a nationalist sub [noise]\nThings kind of wonder if we can get to a clear definition of this term share what exactly is a nationalist I mean there's this ... is it typically consider to be what President Trump says it is\nKnowing and neither is global if I'm a according to President Trump to to be charitable or a national it's it's just someone who put America First um but the reality is anyone with a it's a historical context of nationalism knows that it is a world view\nEmbraced on other rising I bet has led to um you know genocide and violence and separating people not like yourself or\nFrom a basis that would give them rights that uh we we deemed essential when important to human beings um and so a Trump you know early in his campaign I'm really distance himself from ... the term national that's when we saw\nA Steve Bannon associated with it primarily because uh the ... the form of nationalism back what's most a familiar with a band and in the bribe our community west vat of white nationalism which we've seen um\nYou know sweep Europe and I even hate groups in the states um and so it's it's been it's been deemed by most people to be problematic\nTo the Trump embrace it um while misrepresenting it or put him on the receiving end up significant criticism\nAdam er UC I Love you to chime in on this I Know that you are a stickler and rightly so for precision in language and I wonder what your take is on\nAdam reduce the I'd love you to chime in on this I Know that you are a stickler and rightly so for precision in language and I wonder what your take is on the use of the word nationalist versus say patriot\nParticularly because words like nationalist often heard in in phrases like white nationalism global is has connotations of being anti Semitic give us parse the wars parts of the language for us here\n[noise] I mean I think Eugene has already done a pretty good job of that I'm a I'm a little bit mystified by this whole story um the ... the idea that for President Trump to say hey I'm a nationalist is remarkable is kind of nuts to me um\nAmerica First his ... secondary campaign slogan is a perfect crystal ... of nationalism it's\nFor him to put a label on it is I think totally and consequential it would be like if President Trump got in front of a good group of people and said hey my hair is kind of weird will die we all know that um I suppose it's sort of remarkable that you said it but you know it's it's it's a truth it's right in front of us\nCritical election central covering NPR News\nJoined us for all the results on election night starting at eight Iran gp\nSupport for ... comes from our monthly sixteen years our reporters have been honored with national awards from public radio news directors incorporated for our use of sound soft feature and our coverage of breaking news thank you for your support which allows us to keep you informed about stories that impact your life\nAnd show your parts of Georgia you don't otherwise hear about count on us to bring you comprehensive coverage of the state check out our Web site at gp news dot org ... stand with the facts [noise]\nI'm David Folkenflik coming up on the next on point\nA woman's poignant obituary about her sister young Vermont mother who died from opioid addiction went viral\nSo did the response from the Burlington, Vermont police chief they both joined us and so does the author of the book dope say\nThat's coming up on the next on point from NPR on for just this morning in Lebanon GPA and streaming live and she'd be news dot org\nAnd boy does this morning at eleven on GPA be anxious streaming live and she'd be news dot org ...\n\nSupport for NPR comes from this station and from CSP certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org\nAnd from Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and beam or learn more at H. I. F. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nBack now to the friday news roundup with Eugene Scott taffy ... and Adam reduce the up this week the New York times reported that Google protected three executives over the past decade after they were accused of sexual misconduct\nYesterday Google CEO admitted that the company has had a sexual harassment problem the company says it's fired forty eight employees in the last two years for sexual misconduct so this topic is related to Monday's program it's part of our series this state we're in and we'd love your help\nThis year a number of states debated so called me to legislation that would strengthen protections against sexual harassment\nIf you have been sexually harassed or abused and felt like the laws in your state did not protect you\nWhat went wrong or perhaps\nWhat did the laws in your state do right\nLeave us a voicemail eight five five to three six one a one a Tennessee California, Maryland Illinois Arizona and many other states passed new laws this year old is your state done to protect you from sexual harassment or abuse or as the law let you down\nTell us your story eight five five to three six one a one eight or you can use our app won a vox pop to send a radio quality audio file and to keep up to date on a future topics will share some of your stories Monday when we wrap up our series the state we're in on one day\nLet's get back to the friday news roundup conversation with Cassie Adam and Eugene using this is not the first time the Trump Administration is targeted the transgender community there is this ban on trans people serving in the military that's working its way through the courts of reality start cheat when gender published an opinion piece this\nThe ministry ... targeted the transgender community there's this ban on trans people serving in the military that's working its way through the courts of reality start Caitlyn Jenner published an opinion piece this week in response to this proposed changing the definition of sex by a church as in the Washington Post she wrote quote\nThe reality is that the trans community is being relentlessly attacked by this president's the leader of our nation has shown no regard for an already marginalized and struggling community he has ignored our humanity he is insulted our dignity this is politics at its worst unquote\nNow usually we interviewed Caitlyn Jenner on this program some months ago and she said that she knows that a lot of conservatives are not very trans friendly but she appreciates it leads to being in the room and being able to talk to them about trans issues\nI also had to push back on her a little bit casinos that people in the room clearly do not want her there what do you make of her comment I mean she can't be surprised by the president's actions on this she just can't you know it's\nBeen really fascinating she uh is arguably one of the most visible transgender people in America and um has actually been criticized significantly by\nThe transgender rights community because\nUh she does not seem to be deeply informed about the political history that the community has been a fighting for ah the idea that she likes to be at the table almost implies that no one has tried to be at the table before her\nUm and and the the administration has been criticized by the broader community perhaps\nA for not being a a boat advocate of the trash under a community and and gender has been a critique for parents that have just noticed that\nOne of the things I most fascinated by a I think the story right here reveals how\nPeople in different ah identity groups can listen to the same candidate and walk away with different things in general wrote in that Washington Post op ed\nThat seat back Trump because she heard him\nInclude algae beat the communities and has a speech at the Republican National convention and she saw people applaud and so she thought he would in bats algae beats he writes\nSocial conservatives voted for Trump because they believe he would reverse algae beats he writes a that perhaps went farther than they would have liked them to go and the Obama administration so it's just one of those amazing moments about how different Americans here different banks\nTo a few of your comments before we keep moving Kirk emailed when was the meaning of gender\nAmazing moments about how different Americans here different banks\nTo get to a few of your comments before we keep moving Kirk emailed\nWhen was the meaning of gender changed to reflect the psychological state rather than a physical identity gender has always been a polite and more specific synonym for sex centers routinely used as such on birth certificates it seems that when we're talking about here is more accurately described as sexual identity rather than gender itself\nCook out take this one on actually that's not correct your sexual identity has to do with attraction gender has to do with identity sexuality has to do with who you see yourself with\nGender has to do with who you see yourself as\nOne more story related to the ... community today the remains of Matthew Shepard are settled in their final resting place\nAt the Washington National cathedral shepherd was brutally murdered Twenty years ago in the October of Nineteen Ninety eight by men who targeted the Twenty one year old University of Wyoming students for being gay his death was a wakeup call for many Americans to violence against the LDP teach you people today ceremony drew hundreds to the cathedral for a musical event\nThat included several of shepherds favorite songs including imagine by John Lennon\nLet's get to some more of your comments including about the refugee caravan and to be clear I think I misspoke earlier and said that the caravan is a possibility to care means real the troop plan is real it is possible that the care of and might not get to the border by way of misspoke when I brought that up\nBryan emailed is this column of potential immigrants really such a big deal it's not like they're trying to sneak in they're coming up to knock on our door to ask for help sounds like they're following our rules\nAnd tweeted can we please start calling the caravan of what it is a group of refugees fleeing communities destroyed by two thousand nine military coup with which the U.S had a hand also on right now is lots of your commenting on this idea of nationalism let me read a few of your comments there\nIrrepressible youth tweeted a quote from George Orwell nationalism is hunger for power tempered by self deception\nDaniel tweeted why did Trump to use the word nationalist instead of saying he was an American\nAnd Matthew tweeted or match tweeted equating nationalism with white nationalism seems that came to the right rounding socialism up to styling this on both sides are talking past each other more and more and demonizing their political opponents\nLet's talk about economic pie\nSocialism up to ... both sides are talking past each other more and more and demonizing their political opponents\nLet's talk about economic policy the president made a statement to reporters this week that he will propose a new ten percent tax cuts for the middle class the president ... vague in his timing for this to happen but said that quote will do the vote after the election\nKathy Lohr I'd love to get your sense of what this means whether this was just something to say during the midterms weather as soon as the president really has a plan to continue making more tax cuts\nThis that I hate to say this but I don't think he has a point [laughter] I think that it is I'm playing to his base maybe trying to expand his base because the original tax cut that he promised\nI don't think it's helped middle class people as was promised the first time so maybe this is an effort to do so it's an effort to get ... voters out\nFor this election and I asked them how do you see it\nI I don't think that we should even be talking about it on a news program until there's something more substantive for us to talk about an actual policy there's everything about this is just so an serious I'm right now and I think that if anything that we are playing into the president's a political a gambit by\nEven acknowledging the existence of a plan that isn't even a plan I mean to to to bring it back to what we were just discussing with the migrant caravan\nUm uh making its way through Central America this is another place where I think the way that we are talking about it is inherently a complicit in\nUm uh in reinforcing a really unrealistic and politically craven view of what's happening I'm four thousand people marching from uh the northern triangle countries' interests uh bought them all and I'll Salvador um through Mexico hoping some of them hoping to reach the United states", "year": "2018", "show_name": "1A Plus", "city": "Chatsworth", "day": "26"}