{"month": "10", "state": "GA", "station": "WNGH", "content": "To seven today on G. P. B. and she'd be be news dot org serving Richmond Hill and beyond the business gp being an Eighteen station radio service of Georgia Public broadcasting Andre Dawson submitted before ten o'clock so glad you've joined us here today one\nPhil and beyond the business GPA and Eighteen station radio service of Georgia Public broadcasting Andre Dawson submitted before ten o'clock so glad you've joined us here today one eight is max pure on G. P. B. and B. moves subtle word\nOn the ... voting rights and voting restrictions like how could Ari Berman author of give us the ballot twenty four states have implemented new restrictions disproportionately affecting minorities\nRanging from requiring voter id is to closing polling place and also tell us about the seven stage or efforts are being made to expand voting rights China\nRussia here's this afternoon at three on gp being and the b._b._c. news dot org oh\n[noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nMe free tips for being a good leader [noise] it's hard to do and perhaps that's the point maybe leadership is less of a science\nAnd more of an experiment\nFrom W. A. M. U. at NPR in Washington DC is one egg [noise]\nHey there I'm Joshua Johnson today on one a retired General Stanley McChrystal and leadership his new book argues that history's leaders are too diverse to generalize some leaders run terrorists groups or create abusive workplaces yet they changed the world could we learn from them\nWe'll speak to General McChrystal in a moment and explore his new book leader we begin with a nuclear treaty between the U.S and Russia one the President Trump says he will pull America out of\nWhat was leaving this treaty mean for us all\nWe'd love to hear from you email won a a W. A. M. U. dot org or tweet us at one [noise]\n[noise] live from NPR News in Washington on corporate Coleman Turkey's president told Turkish lawmakers today evidence strongly points to a plan Saudi Arabian operation to kill Saudi journalist ... president regiment type or two on alleged that cause showed he was murdered in Saudi consulate in Istanbul\nHe says although it's Saudi diplomatic territory it was a murder committed on Turkish soil speaking through a BBC interpreter he called on the Saudi Government for the murderers to be prosecuted in Turkey and orange and regulation from them through going forward\nSo we'll speaking through a BBC interpreter he called on the Saudi Government for the murderers to be prosecuted in Turkey\nAnd regulation from them going on is that all those are the highest level was you know will be a high likelihood will be brought to justice ... will get a punishment they\nSaudi Arabia has made shifting claims about ... fate for weeks now saying he died after a fist fight in the consulate\nNational security adviser John Bolton is due to meet Russian President Vladimir Putin today in Moscow they're expected to discuss President Trump's intention to withdraw from a major nuclear arms treaty Matthew Bonner reports from Moscow both countries have accused each other of violating it\nBefore today's meeting Kremlin spokesman Dmitry ... said that ... and we'll discuss a wide variety of issues plaguing U.S Russia relations but after President Trump on Saturday announced that the u._s. intends to withdraw from the Nineteen eighty seven intermediate range nuclear forces treaty arms control is expected to dominate the agenda\nThe treaty was credited with bringing about the end of the Cold War banning an entire class of short and medium range nuclear weapons station to by both sides in Europe\nAs golf said yesterday that food and he's eager to hear both and explain Trump's position but it is unclear that the two sides which have accused each other violations can find common ground for NPR News I'm Matthew Bodner in Moscow\nThe Supreme Court is temporarily blocking a court order that Congress secretary Wilbur Ross give sworn testimony in lawsuits over the new citizenship question on the twenty twenty cents as NPR's Hansi Lo Wang reports dozens of groups are suing the Trump Administration to get the question removed\nThis legal back and forth these leading up to the first potential trial over the citizenship question is expected to start in New York City on November fifth a lower court had allowed the plaintiffs attorneys to question commerce secretary Wilbur Ross about his decision to add the question to to twenty twenty cents as\nThe Chinese are looking for evidence to prove their claim that Ross misuses authority by adding a question that Census Bureau research suggest could harm the accuracy of the information collected from the census\nSupreme Court justice Neil Gorsuch however wrote in his own opinion that allowing the probing of roses mental process he is quote highly unusual a court order allows that Trump industry ... requests to permanently block Ross his deposition or for the Supreme Court to hear the case it's on the long NPR News New York\nWall Street stocks are lower the Dow Jones industrial average down more than four hundred points or nearly two percent\nAnd the little on NPR News New York\nOn Wall street stocks are lowering the Dow Jones industrial average down more than four hundred points or nearly two percent they're listening to NPR\nAlly from the G could be newsroom good morning I'm Dawson just ahead on one a discussion about the myths and lessons of leaders but first and she'd be news more than half a million Georgians of voted early in this November's midterm election as deeply beef Stevens foul reports that includes the Democratic nominee for governor Stacey Abrams\nNormally candidates for office cast their ballot on election day but Monday morning ... said early voting is an important process for Georgians who worry about their votes counting\nEarly in the air and have time to correct any mistakes and deal with any concern\nAnd if we not early we can bank are vetted and the vaccine day where we can't\nThe latest early voting numbers show turnout is three times higher than the last midterm in twenty fourteen ... News I'm Stephen Fowler at Atlanta\nGovernor Nathan Deal has ordered flags at the Capitol to be flown at half staff in honor of corn that county police officer Antwon Tony who was killed in the line of duty Saturday officer told his funeral is scheduled for tomorrow morning in Lawrenceville me Eighteen year old suspected of shooting Tony was killed as police attempted to take him into custody yesterday\nCobb County is considering some new regulations for homeowners who offer their property for short term rentals through online services like air being be a proposal presented to the commission as yesterday would require application fees business licenses and payments of hotel motel taxes\nThe Marietta daily journal reports the proposed new policies would not be in place prior to the super bowl at Mercedes Benz stadium from Georgia News Go to GB news dot org and follow us on Facebook and on Twitter We're at\nGp be news\nSupport for NPR comes from Fidel investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at fidelity dot com slash wealth finality brokered services allows the and Americans for the arts and Americans for the arts dot org\nYour gp the weather forecast for this Tuesday partly to mostly cloudy in Georgia today high temperatures in the mid seventies partly cloudy and solar overnight lows range from the mid forties in the northern mountains to the mid sixties south and along the coast a mix of setting clouds on Wednesday with highs and the low to mid seventies a bit warmer in the southern region [noise]\nWhat are you from the northern mountains to the ... the south and along the coast a mix upsetting clouds on Wednesday with high as ... seventies a bit warmer in the southern region [noise]\n[noise]\nThis is one day I'm Joshua Johnson in Washington the future of America's nuclear weapons has been a hot topic lately especially with the evolving relationship between the U.S and North Korea\nNow there's another change in nuclear policy that's getting attention this time involving a treaty with Russia from the Cold War it's called B. I. N. F. the intermediate range nuclear forces treaty\nIt's meant to prevent the u._s. or Russia from developing certain types of nuclear missiles but President Trump says the deal is passed its expiration date\nWhere no one said in the agreement we bonded have agreements with Russia is not going to terminate they were going to pull out\nWhat has the INS treaty meant for national security and what would it mean for the U.S to end it\nCan aid Ullman was President Reagan's arms control director when this treaty was signed he's also a former U.S ambassador to the United nations\nAnd the author of Reagan at ... forty eight hours that ended the Cold War will come back to want to thank you good pronunciation there Joshua ... where he came back yeah now spell it I Know it was on paper right here I'll put it down and just to just say I know how to sell Reykjavik I also know that some of you will have questions about the INS treaty\nNot one of those treaties you hear a lot about will get the basics\nFrom ... ate 'em in but we will be discussing this just for the first part of the program so we welcome your questions in thoughts about this right away email us one eight at W. A. M. U. dot org\nComments on our Facebook page or tweet us at one hey let's start off with just the IMF treaty exactly can you explain a little more what it did what it does and why was important at the time\nFirst of all we don't use initials because they're confused as everybody I'm right but what it is is what President Reagan did with Mikhail Gorbachev the Soviet leader in Nineteen eighty six after they\nEr during and after the Reykjavik Summit was to have a treaty that eliminate an entire class of nuclear weapons it was the first time that that ever took place and what was most important about it was a two elements Joshua\nOf nuclear weapons it was the first time that that ever take place and what was most important about it was a two elements Joshua one is that the Soviet missile\nOr the ss twenty but the Soviet missile threatened all of our NATO allies okay it was the number one problem facing NATO and the west is when Reagan became president in Nineteen eighty because there were problem recognized by President Carter before that\nSupport for G. P. B. comes from our monthly sixteen years\nAnd the University of Georgia extension offering information and publications unhealthy sustainable food from growing to harvesting to cooking learn more by calling one eight hundred ask UGA one or online that extension dot UGA dot edu\nDoes your busy life keep you from staying informed TPP has you covered you can listen live the TPP news dot org and on your smart home device follow us on Facebook and Twitter at ... news\n... will hear anything in your car I Want you to try something roll up the windows are all field inside take a good smell\nCan you smell that that was the great alone experiments just two thousand for it you should not have gone with the dollar store for that one boy you can lose that old car smell by donating your vehicle one of your favorite causes like public radio it only takes a few minutes and just like that you supported the station and well you are on your way to a life of better smell\nJoe to GDP dot org slash cars and thanks\n\nSupport for NPR comes from this station and from CSP certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org\nAnd from his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nThis is one a I'm Joshua Johnson we're speaking to Ken a dull and former U.S ambassador to the un and the author of Reagan at Reykjavik let's get to a few more of your questions about this treaty before we move on\nShe would Johnson we're speaking to ... former U.S ambassador to the un and the author of Reagan at Reykjavik let's get to a few more of your questions about this treaty before we move on to speaking with General Stanley McChrystal quite a few people ask questions\nLike what Catherine asked on our website the one eight dot org Catherine rights is this an actual treaty if it is wouldn't that be Congress's territory not Trump's\nAnd Andrew tweeted is two thirds of the Senate required to withdraw from the treaty\nThose are good questions uh and uh it's unclear and the constitution would Congress's role would be in getting out of a treaty yes this is a treaty yes it was ratified\nBy the Senate uh and uh in Nineteen eighty seven actually in Nineteen eighty eight who signed by Gorbachev and Reagan and the White House with Trump president in Nineteen eighty seven or ... but\nIt has been established over the years that to get out of a treaty that is the president's discretion in Congress has no role in that\n[noise] can you put this into a little bit more context for us I mean I I think it's hard at least for me as someone who only sees nuclear proliferation from the outside\nTo know where in my mind to hold all these different potential threats there's the threat from Russia there's the threat from North Korea there's a potential of a threat from China who knows what all terror organizations might be trying to ... closer to a nuclear weapon\nIn the scheme of things where should we put this treaty in in our minds like in the hierarchy of the various nuclear threats that the world faces where is where does it fit\nIs pretty high I'll tell you why because it's restrained by the United states and Russia against a whole class of nuclear weapons okay to me the highest in your uh pantheon of nuclear uh treaties and nuclear threats are\nThat are bound by trees as the nonproliferation treaty which really discourages countries from the spread of nuclear weapons okay we don't want the nuclear weapons to spread\nAnd are by and large that's been pretty successful Joshua or the fact is in Nineteen sixty three President Kennedy gave a speech in which he said by Nineteen Seventy there would be twenty five nuclear weapon states\nBy Nineteen Seventy okay today they're about six seven and so we've done a lot better than people expected and that gets back to Parkinson's\nDay to day they're about six seven\nAnd so we've done a lot better than people expected and that gets back to Parkinson's a to me the best law that the success of a policy is measured Best Buy those disasters that do not ensue\nAnd the ... the ... nuclear weapons was a disaster that did that and so and so that was pretty successful\nIt also seems like just the fact that a treaty could be reached between parties was was a victory I mean you know Internet connections are a little tense right now right\nIt was and certainly the weekend in record back in October eleventh and twelfth Nineteen eighty six that document in my book and thank you for mentioning it or that it will be turned into a movie probably soon a\nIs an exciting rollercoaster of up and down and emotions up as ...\nUp and down views I in what's thought to be a haunted house in Iceland that produced the treaty that we're talking about today it was a real taffy tug\nOf for the whole weekend we spent from eight o'clock at night\n'til six thirty the next morning going over the details of this and I could report to the president the next morning on the tech Tobar twelve Nineteen eighty six we have accomplished more last night in one night\nThan we have in seven years of constant negotiations with the Russians it was just a ... a weekend\nBut we move on and we'll be speaking to stay on General Stanley McChrystal at a moment about his new book on leadership and I wonder if by way of wrapping up our conversation and I could ask you about the leaders who signed this treaty Ronald Reagan ... Gorbachev here is President Reagan at that meeting in Nineteen eighty seven\nThe importance of this treaty transcends numbers we have listened to the wisdom of in an old Russian maxim and I'm sure you're familiar with it must have missed a general secretary do my pronunciation may give you difficulty [noise]\nIs do vi no pro vi trust but verify\n... yeah and some of the cities you with us today\nEvery meeting [noise] from the meeting\nA Nineteen eighty seven between Ronald Reagan and Mikhail Gorbachev or give us a sense of the leadership styles of Reagan and Gorbachev that allowed this treaty to come to fruition\nWhere when do you think of Ronald Reagan or you think of a man who is extremely decent\nYour ship styles of Reagan and Gorbachev that allow this treaty to come to fruition\nWell when you think of Ronald Reagan or you think of a man who is extremely decent and a conservative Republican incompetent he was just a very competent person or when you think of ... a\nGorbachev he was a communist uh but overall a decent person who wanted to do something at that time they were both very different from the president we have now Joshua or in the sense that um you know\nWhen I was in government uh mothers and fathers wanted their kids to grow up like Ronald Reagan maybe not the policies maybe they didn't agree with the policies\nBut the decency of demand the humbled and is the man the genuine niceness of him and today even if you're agreeing with Trump's policies which I don't but even if you do I don't think any mother father wants their kid to grow up to be like a Donald Trump or\nThis is probably sorry are probably some who city and openly quality and the president or they're hard to say\nThough there will disguise Joshua\nAnd uh the decency the kindness of Reagan who really loved immigrants in his office was decorated with pictures of immigrants his farewell address to the country talked about the wonders of wonderful immigrants coming to our country is a whole address was about immigration how wonderful it was\nHe was a fanatic about a free trade or not having tariffs at any time and he was very intense ... reduce government spending and reduce especially the deficit all those things were\nClassic conservative classic Republican and um none of them are being followed by this so called Republican\nI'm Donald Trump but anyway this style of Reagan was a style that made somebody like me very proud to serve him and very proud to be there with him on that weekend in Reykjavik in Ninety six\nKenny it'll ... author of Reagan Reykjavik forty eight hours that ended the Cold War also the arms control director for President Reagan and former U.S ambassador to the UN ambassador ... thanks for talking to us okay now learn how to spell Reykjavik an extra wide [noise] I'll work on it I think for a much very got back\nWhat two Confederate General Robert e and the Reverend Dr Martin Luther king junior have in common\nAccording to retired General Stanley McChrystal they are both leaders worth studying granted we study them for very different reasons but they did some of the same things\nThey made bold decisions that won them loyal following they were controversial within the very leadership structures that brought them into power and the revered today for what they represent it not just what they accomplished\nStill these men with several things in common would seem to have almost nothing in common perhaps that's the paradox of leadership there is no one formula no one checklist that defines all leaders\n... McChrystal retired as a four star general he served as the top us commander in Afghanistan from two thousand nine twenty ten\n\nSupport for G. P. B. programs comes from our listeners in this fast paced world you want to have access to news when you need it check out our Web site at ... dot org we've got the latest state national and international news available twenty four seven\nBut they're also in depth feature stories from across the state of Georgia you can also view video performances from great musicians in our G. P. D. music present the rates\nFor information and entertainment you can count on DVD news ... news dot org [noise]\nI'm making the check her body coming up with an excellent point in his new memoir RJ young writes about how was a black man he bonded with his white father by becoming an NRA shooting instructor\nBut he turned to critical eye on the organization and explains why he thinks the country is quote in a literal arms race ramped up by racial edge fear that's coming up with an excellent point from NPR News this morning\nAt eleven non G. P. B. and B. B. news dot org\n\nComing up on an excellent point from NPR this morning it eleven non CPB and keeping news dot ...\n\nSupport for NPR comes from the station and from Baird employee owned and independent they're just kept clients financial interests first since Nineteen Nineteen R. W. ... dot com has more information\nFrom Subaru featuring the all new three row ascent with eating for up to eight and a choice of second row captain's chairs love it's what makes us Subaru with ... learn more it Subaru dot com\nAnd from the John D and Catherine T MacArthur Foundation Mack foundation dot org\nBefore we get back to today's conversation on leadership we should tell you that tomorrow we'll be talking about America's leaders when it comes to Saudi Arabia\nThe murder of journalists ... G has prompted lawmakers on both sides of the aisle to delay a Saudi request to buy us made precision guided munitions kits for bombs bombs that are destined to be dropped on Yemen\nIs the U.S making a bad situation worse\nWe would love to hear from you especially if you are a Yemeni American or if you have friends or family tied up in this conflict leave us a voice mail eight five five to three six one a one a what actions would you like to see taken against the country that has now admitted to murdering a U.S resident\nEight five five to three six one a one eight or you can leave us a high quality audio file through our app wanting vox pop will share some of your questions and your stories tomorrow on\nBack now to our conversation with General Stanley McChrystal coauthor of the new book leaders myth and reality we asked you who you think of as a great leader and why here's what some of you left in our inbox\nGeorge Herbert Walker Bush Bush forty one this staunch Democrat personal hero and whom I think that that leader I Know of\nEver won three and one of the greatest leaders that we have an American leader truly want people to live their lives\nMy name is Rodney from Cincinnati, Ohio um some of my greatest leaders in my life or where my basketball coaches um inner city coaches that had to deal with different personalities this is Harry from St Louis Missouri the leader that I look up to\nBasketball coaches um inner city coaches that had to deal with different personalities this is Harry from St Louis Missouri the leader that I look up to currently is Elizabeth Warren Hi my name is Karen I live in Iowa and you Michigan\nAnd my greatest leaders example was my own father he ran for state representative in Nineteen sixty lost by a few votes was the mayor of our city for\nMany years I grew up in a home where community service was the number one thing in our lives and he was a great leader because he stayed unbiased and fair and how people accountable\nGreat examples everybody thank you very very much for calling in and sharing your stories we still have more time for some more of your stories about where you find leadership in your own life from maybe there was someone you had considered a leader but you don't anymore\nComments on our Facebook page tweet us at one at a or email one a at W. A. M. U. dot org General McChrystal I Want to follow up on something I heard in that montage I ... I recall some people using the word leader\nAnd some using the word hero and I wonder if we need to distinguish between that dock at a tweeted\nIf a quote unquote leader fails to leave but makes people do what they have to do by using threats intimidation or fear or they still called leaders shouldn't they be called anything else but leaders\nI get the sense General McChrystal from reading your book that those people could still be leaders we just might not think of them as being very heroic in their leadership\nI think that's right I mean we broaden the term leader to be people in rules and people who get\nPeople to do things that even though that may be bad things so we don't say leaders are good or bad we said or effective or not because you can have some pretty negative people ugly objectives who effectively lead people in that direction think Adolf Hitler\nIf we really step back and say because some of the names and the ideas and the montage there were tremendous we think back when we want from our leaders what should we want from our leaders\nThe day I retired from the military I had never met President Bush forty one and yet he called me on the phone just to tell me he thought it would be a difficult day than a short conversation he\nJust reached out to somebody in an incredibly thoughtful way\nHe made me feel better\nI think we want our leaders to make us feel better but more important\nSomebody in an incredibly thoughtful way he made me feel better\nI think we want our leaders to make us feel better but more importantly I think we want our leaders to make us better\nSometimes that's not the leader who rubbed your belly and tells you you know it's everybody else's fault and you can get you deserve more sometimes it's a leader who's a little tough on you that coach that teacher that parent\nWho pushes you to be better than you would otherwise be that military commander who works you physically really harder makes you go in harm's way but at the end of it you sit back and you go you know\nI'm Better for that yeah I'm a bit better than I Would otherwise be they ask much sometimes they demand a lot but typically they give alongside to us and and if we\nWe frame leaders in that way and look in the mirror and say our wheat demanding as followers are we asking and demanding from that from our leaders then I think we ask we answer many questions about our society today\nIn the book there are three minutes that you're trying to tear down in terms of the way that we think about leaders let's go through them one at a time one is called the formulaic mess which is basically this idea that leadership can be boiled down to a formula you argue that it's much more can textual right\nAbsolutely you can have this list of traits or behaviors\nAnd their leader can use them on Monday they can work and on Tuesday go to the same organization but the context to change the followers are in a different place and it doesn't work at all so in reality a leaders got to be constantly adapting themselves to meet the needs of the team and the situation\nThe second one is the attribution myth you write that we attribute too much to leaders and we give them we use the kind of tunnel vision as you describe it what do you mean by that\nWell I wrote my memoirs and twenty ... and [noise]\nI thought I was writing the play of my life and that would be easy because I was there and I would therefore be to star but when we did all the interviews the background to get the other parts of the stories in many cases I had made a decision and there'd been an outcome and therefore thought I should get credit or blame for that\nBut I found out all the other people who had done things I didn't even know about and the other factors that have played upon that\nWhen I concluded was the leader still part of it I mean I was still a key part of it but I wasn't the dominant part and so we find today\nWe treated a little bit like a Broadway show we put the spotlight on a leader and we keep that spotlight following the leader no matter where they are the all the other things\nWe treated a little bit like a Broadway show we put the spotlight on the leader and we keep that spotlight following the leader no matter where they are the all the other things in the situation\nOf putting shadows I think we make a mistake if we assume that the leader caused the great thing to happen whereas Timothy responsible for the failure there just a part of it\nAlthough I Would say that based on one of the leaders you profile in the book Walt Disney there are some leaders who want it that way Disney did not credit his other animators initially in disbelief symphonies and the short films that led up to Snow White and the seven door so he kind of you kind of wanted it that way\nWeights very calm and I mean if you think about it everybody a little bit like the the spotlight likes to be on the pedestal so it's a natural thing and Walt Disney after the success of Snow White for which he did an extraordinary job of pushing his team to create at a masterpiece\nHe wanted the basket and that and it was a natural problem but it caused a huge problems just four years later in a bitter strike in Nineteen forty one\nWas speaking to General Stanley McChrystal from NPR in New York the co author of leaders miss and reality that third myth you call the results myth which says that leadership is the process of driving people toward an outcome ... why is that a myth don't results matter\nWill results matter and we claim that that's how we select or choose to follow leaders whether they get a good bottom line or whether they win battles or win elections but in reality\nThe data doesn't support that we tend to follow leaders even though many er serial failures or their outcomes are often much less than they want them to be or have said that they are [noise]\nIt's really on the followers to understand this because leaders tend to feel some place in us and emotional requirement for us they give a vision for the future we're much less analytical and demanding of actual results than we think we are", "show_name": "1A Plus", "year": "2018", "city": "Chatsworth", "day": "23"}