{"month": "10", "state": "GA", "station": "WNGH", "content": "Serving Richmond Hill and beyond the business GDP and Eighteen station radio service of Georgia Public broadcasting I'm your documents admitted before ten o'clock so glad you've joined us here today one eight is max pure on G. P. B. S. G. P. B. news\nPublic broadcasting Andre Dawson submitted before ten o'clock so glad you've joined us here today one eight is max pure and she'd be and GDP moves dot org\nAnd the next fresh air Jonah Hill co stars super bad money ball and the wolf of Wall Street he wrote and directed the new film mid nineties about a group of skate boarders in the mid nineties that's the period when Jonah Hill was skateboarding but he doesn't have a great\nBecause to be graded skateboarding you have to be willing to slam on your face down ten stairs on concrete\nOver and over and over and joined us\nFresh air is the afternoon at three on GDP and she'd be be news dot org\n[noise]\nNinety seven point seven FM double your G. P. B. and W. GBH be room for the Georgia Public broadcasting radio network [noise]\n\nHey there I'm Joshua Johnson today we are thrilled to launch a new project one a across America you've helped us change the national conversation taking on big issues from every corner of this country\nNow we're taking that to a new level telling more of your stories right up to the twenty twenty election will begin with a look at who's voting early and how each party hopes to capitalize on\nWe'll focus on three states for starters cancers Michigan and Colorado and see what's driving voters to the polls\nIf you're in one of those states what's on your mind to head of the election comments on our Facebook page or tweet us ... one egg [noise]\n[noise] fly\nFrom NPR News in Washington encore of a cool and then President Trump and first lady Melania Trump are scheduled to visit Pittsburgh today following Saturdays deadly shooting at a Senate gone around by with a synagogue says the president is welcome to visit\nHowever a group of Pittsburgh Jewish leaders have written an open letter to Trump asking him not to come until he fully denounces white nationalism\nFunerals for the victims are getting underway today as NPR's Sarah McCammon reports from Pittsburgh the two youngest victims will be laid to rest after a joint service\nThe sullen David Rosen thought were in their fifties and were attending a religious service\nI'm an reports from Pittsburgh the two youngest victims will be laid to rest after a joint service\nThe sullen David Rosenthal were in their fifties and were attending a religious service when they were killed friends say the two who had intellectual disability found a supportive community at the tree of life synagogue rabbi Chuck diamond to once led the congregation remembers that brothers as a constant presence at services and study groups\nThat I'd give my study group activity or say or a purple was oppressive they were carried around with them wherever they are they're very proud of it they brought a lot of joy that were full of love and they really had a um presents the community in general the Jewish community and they will be missed by by all of us\nServices for the rest of the victims will be held throughout the week Sarah McCammon NPR News Pittsburgh\nPresident Trump says he is considering in order to end the constitutional right to citizenship for babies born in the U.S to parents who are not us citizens as NPR's Joel Rose reports Trump is trying to make his immigration crackdown the focus of next week's mid term elections\nTrump made the remarks in an interview with ...\nWith the only country in the world where a person comes in and has a baby the baby is essentially a citizen of the United states for eighty five years with all of those benefits ridiculously it's ridiculous that it has to and in fact\nMore than thirty countries around the world offered birthright citizenship\nThe fourteenth amendment to the constitution guarantees the right to citizenship for all children born in the U.S when pressed on whether he can change that Trump says quote there saying I can do it just with an executive order unquote\nThough it's not clear when or if Trump would issues such an order if he does it will certainly spark a legal battle the full interview airs this weekend on ... on HBO Joel Rose NPR News\nNew group of Central American migrants is walking north from Honduras they waited across the river into southern Mexico on Monday and one person reportedly died NPR's Carrie Kahn reports this group hopes to catch up to a larger group of migrants that's walking toward the U.S border\nPresident Trump has not led up on his condemnation of the caravan he told Fox News he will build tense everywhere so migrants who make it to the U.S border and ask for asylum will stay until their claims are finished the defense department says it will send fifty two hundred troops to quote heart in the U.S Mexico border\nNPR's Carrie Kahn on Wall street the Dow Jones industrial are up one hundred and Ninety three points that twenty four thousand six hundred forty three this is NPR\nOn Wall street the Dow Jones industrial syrup one hundred and Ninety three points that twenty four thousand six hundred forty three this is NPR\nLive from the gp newsroom good morning I'm drew Dawson just ahead on one a will take a look at the dramatic uptick in early voting and up next week's mid term elections but first if she'd be be news some members of Atlanta city council meeting today to discuss legislation on developing the Gulch GBDs roster rail has more\nFor the past couple of months Atlanta city council has gone back and forth with the mayor Kesha Lance bottoms on developing the forty acre whole downtown to possible votes and a special meeting to approve the deal with a private developer C. I. M. group were called ...\n... since we negotiated the deal was see I Am which includes more than one point five billion dollars in tax incentives she is now seeking approval from a city council committee\nCounts the members in some residents have voiced concerns about the amount of public money going into the project one of the city deals with other issues like a lack of affordable housing for G. P. B. News I'm Ross route in Atlanta\nTo new solar farms are being planned for clay county in southwest Georgia the Albany Herald reports silicon ranch will generate one hundred six megawatts of power that will be sold to green E. M. C. a group of thirty eight smaller electric co ops the projects are expected to be operating by lake twenty twenty\nAnd sports the Atlanta Hartsfield of the Philadelphia Seventy Sixers last night one Thirteen to Ninety to Atlanta will return to state for a marina de play the Sacramento Kings on Thursday was a record of two wins in Fort losses the hawks are in tenth place in the NBA eastern conference\nFrom Georgia News Go to GB news dot org and follow us on Facebook and on Twitter\nSupport for NPR comes from NPR stations other contributors include progressive insurance offering its home quote explorer so shoppers can evaluate options in one place when buying home insurance custom quotes and rates are available online learn more at progressive dot com [noise]\nYour GB weather forecast for this Tuesday mostly sunny and in the seventies across Georgia today clear in the upper forties mid fifties overnight Wednesday look for a mix of spinning class with high temperatures and you're eighty\n[noise]\n\nThis is one day I'm Joshua Johnson in Washington I say that most days at the top of the show Joshua Johnson in Washington\nOf course sometimes for somewhere else like a member station that helps us bring these conversations to you being in Washington for the deep well of expertise and access here and getting out of Washington to be closer to you\nWell that's basically what makes one a work and today we're excited to announce a two year reporting project that will help us do that even better blend the conversation in Washington with your stories wherever you are in the country we're calling it run a across America\nIt's a big idea to guide our coverage and conversation right up to the twenty twenty election\nDay is partnering with six public radio stations around the country to help us keep the debate national and to look beyond the swing states that many news organizations tend to focus on\nWell explain this project more in a moment but first let's talk about what's happening across America right now and that's early voting early voting is surging we're still about a week out from the election and millions of voters have already cast ballots maybe including you we ask you whether you had voted early and why and here's some of what you told us\nMy name is Jan I've lived for forty five years in Glenwood Springs Colorado I completed my ballot today it arrived in the mail and submitted it the following day my name is Ali yeah I live in Houston, Texas I early vote or because of the convenience this is\nMary I'm from Birmingham, Alabama and I went down to the county courthouse Jefferson County courthouse filled out a request for an absentee ballot because we don't have early voting in Alabama and I was able to vote right there\nI have never in my life voted early because I have never left in this state that had early voting my name is Jessica I Am calling from Grand Rapids Michigan\nThis election is and ... and I feel like my voice needed to be heard so instead of just letting the day come and go wow I Am traveling\nElection it's quite and I feel like my voice needed to be hard foul and at a ... day come and go wow I Am traveling identified it kept out early\nSupport for G. P. B. comes from our monthly sustain years in this fast paced world you want to have access to news when you need it check out our Web site at ... dot org we've got the latest state national and international news available twenty four seven\nBut they're also in depth feature stories from across the state of Georgia you can also view video performances from great musicians in our gp music present series\nFor information and entertainment you can count on DVD news ... news dot org\nHurricane Michael was devastating for South Georgia farmers recovery will take years some farms will never be the same\nQuarters happened down here in South Georgia [noise] nothing less than a curse word of farmers live forever\nDVD reporters are in South Georgia as farmers deal with Michael's aftermath began the long road to rebuilding listen for the reports during MORNING EDITION and all things considered GB new dance with the fact\nSupport for NPR comes from the station and from ... committed a changing lives through math by building math achievements problem solving and critical thinking skills for thousands of students every day and nine hundred franchise locations matinees IOM dot com slash NPR\nAnd from CSP certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org\nThis is one a I'm Joshua Johnson the nature of our political system means that some places get disproportionately more media attention than others one a across America is our effort to change that to understand what\nHe says getting disproportionately more media attention than others\nOne a across America is our effort to change that\nTo understand what's important to you regardless of whether you happen to live in a swing state now we have loved incorporating your stories and your ideas into one a over the last almost two years and that's part of what inspired this over the next two years we'll spend a lot more time hearing from you in person\nOr across America team is headed to use this election season with live events town halls are just conversations at the coffee shop\nIt's a two year project made possible by a generous grant from the corporation for public broadcasting\nDo you feel like you've been ignored by the national media especially getting ignored around the time of big elections\nYou can tell us all about it all the across America page of our website the one a dot org that's the word ... the number one the letter a dot org or you can email us across America at W. A. M. A. U. dot org again across America at W. A. M. U. dot org\nToday we're looking at a surge in early voting across America with the help of three stations we're partnering with\nSilly Clark is the program director at Michigan Radio in Ann Arbor Michigan she's also the co host of its program it's just politics so we welcome Joshua joining us from K. U. N. C. public radio in Greeley, Colorado north of Denver is reporter Michael ... Michael glad to have you with us\nHi Joshua and joining us from Kate M. U. W. public radio in Wichita, Kansas is reporter Brian grim it Brian ... glad to have you with us I happen to be here too by the way our other three partner stations for one a across America or W. B. H M public radio in Birmingham, Alabama\nMinnesota Public radio and Houston Public media and we look forward to hearing more from them\nIn the weeks and months to come but let me start with the three of you in Michigan Colorado in Kansas with regards to early voting in your state particularly accounting for absentee ballots mail in ballots and so forth and so a court in Michigan let me start with you what's early voting looked like in Michigan\nRight so we actually are seeing an increase over last mid term elections I Want to kind of do apples to apples instead of apples to oranges has eventually and just 'cause turnout is higher here in Michigan as it is across the country during the presidential election so we are comparing to twenty fourteen\nTony fourteen we add six hundred and eighty nine thousand requests for absentee ballot we are now almost at one point one million as of October twenty seconds like sixty per se\nAt six hundred and eighty nine thousand requests for absentee ballot we are now almost at one point one ... of October twenty seconds like sixty percent increase here in the state\n[noise] Michael do you want to what about in Colorado what's early voting look like they're\nWell it's too early to tell us so far but a big a flood of ballots have already come in about six hundred Nineteen thousand of them\nAnd a more expected this morning a we have male voting here and people can register all the way up until election day on election day and um uh it's it's too early to tell but there is a strong turnout so far\nUm and it mirrors or what your guest earlier was talking about um the Republicans are tend to be a voting early but I'm over the past week or so I'm the\nI'm Democrats are starting to um get their ballots\nAnd Brian ... what's Kansas look like with early voting\nIs falling out of those those national trends there's there's there's so many of the counties across the state of reporting a\nRecord or near record turnout especially in some of the more populated areas they are Hispanic and particularly when it comes to early voting you know a ... they're saying requests in in one of the most populated counties Johnson county by near Kansas City ah they've had requests for more than forty thousand advanced voting ballots\nLet me sick with you how does early voting works in Kansas to people tend to find it\nEasy accessible or there are a lot of hoops to jump through out of Kansas handle voting early well it depends on the county I think it's it's a county by county and the way they decide um\nObviously how many polling places are open where those polling places are uh you can also request a ballot to get in the mail so vote by mail isn't the common way to do it but if you would like to do that you can request that ... you can get it sent out\nUm it's so it's it's kind of reasonably are open to people who would like to early votes I'm here in the county that I'm In and in Wichita, Kansas uh we've had early voting now for a week or starting today they've opened a few more locations for early voting so they're trying to make it\nI'm somewhat accessible to to to voters who'd like to take that option\nWe heard from some of you in Kansas Colorado in Michigan about early voting a critical mass tweeted I voted I Am in Colorado we have early voting and mail in ballots mailed to us early it's very easy to research candidate amendment or proposition at leisure welcome pleading the ballot Michael would you ...\nYou have early voting and mail in ballots mailed to us early it's very easy to research a candidate amendment or proposition at leisure welcome pleading the ballot Michael would you respond to a critical mass in Colorado how's ... how does early voting work\nWell uh basically you get your ballot in the in the mail they mail it to you um you so you got to do a lot of research in Colorado this year it is a very full ballot and um [noise] you go through the subjects one by one it's great because\nUh you can really sit down with it and um do your homework um you know have a micro brew we love that here in Colorado and\nFill out that ballot and then um get it off in the mail or\nOr some other kind of relaxing recreational or kind of a cup of tea my whatever you want to ...\n... um you know and so uh you know a lot of people I'm like this system in Colorado a but not everyone um you know that ... it ... the world is full of procrastinators so um there are people who wait until the last minute and at this point\nI'm a you know the secretary of state's office is saying if you haven't mailed in your ballot already um now you got to think about a delivering it by hand or just going in on election day in voting\nI'm Glad you brought that up Michael that's probably something that everyone who lives in a state with early voting are male and voting should bear in mind that there is a certain cut off\nBy which your ballot has to be received November six tens and I I don't know how it is for\nYour three states but in every state I've lived in election day is the day your ballot has to be in not just the day that your ballot has to be in a blue mailbox so that is exactly what you're in mind whatever state you're in your ballot has to be in an election officials hand\nOn election day and not a postal carriers hand on election day got to get some of your comments as to why you do or don't like voting early\nMitch tweeted I don't vote early details may change through election day I Want my vote to be cast exactly as it should be since there are no do overs or take backs\nRachel is in Fayetteville, Arkansas and Rachel emailed I Love the convenience of early voting I don't have to worry about long lines or work or travel on election day that would prevent my voice being hurt\n... tweeted no early voting for us in Michigan we can vote absentee if you're willing to lie about the reason why you're not able to vote in person on election day do you have to\nMichigan we can vote absentee if you're willing to lie about the reason why you're not able to vote in person on election day do you have to lie to vote early in Michigan\nFor all practical matters yeah so basically how it works in Michigan is if you want an absentee ballot you have to ah basically say that you are going to possibly be out of town let's say a and there are folks that go and say sure I'm going to be out of town\nAnd and lie there are also some other ways that you can get absentee ballots here in Michigan one is to be over sixty years old or another is may be due to religious reasons or if you were in jail awaiting arraignment or trial but no it is\nWell known around the state that that\nFolks do just say you know what I'm going to be out of town just take\nTo get an absentee ballot ... what is being over sixty has to do with voting early uh possibly can make it easier right so let's say you're over sixty years old and maybe the idea is that there are long waits let's say for example in the city of Detroit\nJoined us for all the results on election\nNight starting at eight Iran gp\nSupport for ... comes from generous listeners like you our reporters have been honored with national awards from public radio news directors incorporated for our use of sounds soft feature and our coverage of breaking news thank you for your support which allows us to keep you informed about stories that impact your life\nAnd show your parts of Georgia you don't otherwise hear about count on us to bring you comprehensive coverage of the state check out our Web site at gp news dot org GB news stand with the back [noise]\nAm I going to talk of already coming up with an excellent point as a child who spent the day watching videos are playing in the back yard actually learning yeah say advocates of the un schooling movement and they want kids to take the lead in their own education is coming up with an excellent point from NPR\nOn forward to this morning at eleven Iran GPA and streaming live but she people start or\n\nSupport for NPR comes from the station and from visiting angel professional caregivers assisting adults at home in bathing dressing meals and light housework nationwide\nAnd from visiting angels professional caregivers assisting adults at home in bathing dressing meals and light housework nationwide visiting angels America's Choice in senior home care learn more at one eight hundred three six five four one eight nine [noise]\nAnd from progressive insurance offering a way to buy a home insurance with their home quote explorer tool custom quote send rates are available online learned more progressive dot com or one eight hundred progressive now that's progressive\nBefore we get back to our conversation we would love your help with tomorrow's program about political rhetoric it's a simple question is President Trump responsible for the recent act of political violence in our country a simple question but not an easy one\nHow much responsibility does he bear or we confusing rally rhetoric with criminal behavior\nWho else is responsible and how much blame did they bear will debate this tomorrow but we'd love to hear your thoughts ahead of that so leave us a voice mail eight five five to three six one a one day\nHow much responsibility if any this President Trump bear for the recent acts of political violence in our country\nEight five five to three six one a one a or you can use our app won a vox pop to send us a radio quality audio file and to keep up to date on future topics will share some of your thoughts tomorrow on one day [noise]\nBack now to our conversation with Zoe Clark of Michigan Radio Michael do you want to of K. U. N. C. public radio in Greeley, Colorado and Brian grid of K. U. W. public radio in Wichita, Kansas today we're introducing won a across America\nWill be spending the next two years traveling to communities across the country that don't tend to play an outsized role\nIn national elections before them come come back to ... let me get to a few more of your comments Linda tweeted\nI voted in Hamilton County Ohio over a week ago no lines it was fast and easy\nCounty is in Illinois and county road on our Facebook page I'm choosing to vote on election day because I bring my children and want them to see and feel the import of this right\nAnd Melissa tweeted I loved to vote in person I enjoy seeing all of the people getting out to the polls and making their voices heard\nThere's only I Love you to react to a message that one of our listeners since we're at one vox pop from Michigan\nSchools and making their voices heard Zoe I Love you to react to a message that one of our listeners since ... from Michigan and told us three reasons that he's voting this year and all of his reasons for voting have to do with voting\nTrip for Michigan or or three branches of government or a Republican controlled and have been for a number of years\nThe main driver of voting this year or two institutions amenities that tried to rectify the Republican attempt to suppress or control election participation\nProposal and to put redistricting in the hands of an artist and commission\nThe other makes registering to vote in your mix ups in a team voting over ... to all and finally proving it straight ticket voting [noise]\nThose are pretty important to our democracy and that was on full\nTruck thanks for calling for leaving his voice mail rather than through the ... what would you say the trucks call is that the kind of reflected in why a number of Michigan are voting this year\nWell let's say yes that I mean there he is speaking about proposal to which is a redistricting as he as Chuck said and then proposal three which is being called promote the vote and and that would allow no excuse absentee voting earlier of course we're talking about whether you have to lie or not to to get an absentee ballot that would change how that works um\nYes ah particularly a problem too which would create this independent commission has just sort of taken the state has been at a bar in storm of a\nA ballad I Am most ballot initiatives like one would like to think right that it's some people some community folks who are like we want to change the law in Michigan let's gather together and let's go you know get enough signatures and put it on the ballot no no no that is not usually how it works in this state usually a\nOrganization some kind of a political organization pays for signature sometimes a dollar two dollars per signature to get questions on the ballot but um this voters not politicians as prop to\nChanging redistricting a young woman Katie Fay he's twenty eight years old when she started this all grass roots organization that four hundred fifty thousand signatures again grass roots volunteers to get this question of redistricting on the ballot and this is just sort of\nFour hundred fifty thousand signatures again grass roots volunteers to get this question of redistricting on the ballot and this is just sort of fascinated both voters and political watchers in general\nWe've heard from a number of you who are reacting to some of these initiatives in Michigan pat emailed in Michigan seniors over sixty are allowed absentee ballots I Love not having to stand in line at the polls\nThis year a referendum called promote the vote is on the ballot which would allow anyone to use an absentee ballot too many people having trouble getting to the polls on election day\nAnd John emailed I live in Ann Arbor Michigan I voted with an absentee ballot for the first time this year I Do so because I'm volunteering as an election inspector this year\nI'm also working with the voters not politicians group and supportive prop too which is passed will make Michigan one of only a handful of states with fear of voter district de ... what's the the kind of the split in terms of who is supporting these measures\nAnd who is opposing them is it kind of a partisan split or do Michigan voters tend to kind of agree that the time has come for this how how does that shake out\nWell I mean again if you're going to take this idea that this grassroots organization that four hundred and fifty thousand signatures one would portend that that is going to create some turn out on election day or for folks who got absentee ballots I'm [laughter]\nBut you you have seen the Michigan chamber of commerce which tends to lean towards conservative Republican candidates ah come out against a proposal to you've got the freedom fund which is um\nI I get money from the device organization just last week or putting one point two million dollars against proposal to again this is about redistricting\nProposal three though which is to promote the vote which would allow an shrine I should say straight ticket voting automatic voter registration same day voter registration and no excuse absentee voting\nWe really haven't seen a a organization full and wholeheartedly come out against this proposal because for many folks are not only are these popular ideas but\nA majority of states in in the country twenty seven states in DC all allowed no excuse absentee voting\nMichael do you want to let me come to you with another proposition that seems to be energizing voters in Colorado and that might affect other races Jennifer's in Colorado and she left his voice mail explaining her view on prop one twelve listen\nOne twelve on our ballot this year would increase the distance between new oil development and any building that is\nProposition one twelve on our ballot this year\nWould increase the distance between new oil development and any building that\nIs designed for them and I see it would increase it to twenty five hundred feet which is less than half a mile and it's not unreasonable to me that the ads me see here are hugely fear mongering they're paid for by LA company and they say you're going to lose all your job all your schools are going to close\nFires going to rain down from the sky it's ridiculous\nJennifer thanks for calling in Michael can you give us a little more context on prop one twelve particularly this couch or argument that ... Jennifer ... she's been seeing on MTV I was\nSure it will be a ... to put her finger pointing at right now there are also a current setback distances which are\nA five hundred to a thousand feet depending on where where you are and ... ... supporters say supporters of on twelve say that the wells\nAre just like Jennifer are are two already too close to people's homes schools places at work and that's a threat to their health because there are these are basically the industrial sites\nThat are dangerous and uh they admit pollutants um the oil so the other side of this is the oil and gas industry which is which is big and Colorado um they say a this measure would essentially run them out of business because\nUm it would be difficult to find sites that are twenty five hundred feet away for every potential new site\nA but just how difficult that is will you know that's debatable the the state's oil and gas conservation commission um did a study a is saying that as much as eighty five percent of new development would be halted", "year": "2018", "show_name": "1A Plus", "city": "Chatsworth", "day": "30"}