{"month": "10", "state": "GA", "station": "WNGH", "content": "From orange making you can get a DVD near that or\nServing jak worth and beyond but this is cheap you were an Eighteen station network of Georgia Public broadcasting it's a minute before ten o'clock on ...\nServing ... worth and beyond who's gp were Eighteen station network\nOf Georgia Public broadcasting it submitted before ten o'clock Andre Dawson glad you've joined us this morning one a as max edit eleven o'clock it's on\nPoint an G. P. B. S. G. P. news dot org the Kavanaugh\nHearings and confirmation raised the question again how do we decide who to believe when a woman to say she was sexually assaulted by someone she knows behind closed door and the man denies that\nThat's an issue universities have been dealing with on the ... author of blurred lines sex and power and consent on campus joined us\nRussia or is this afternoon at three on gp being and she'd be be news dot org\n[noise]\nNinety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\n\nA lot can happen between now in the mid term election on November six\nSo let's check in on the big races quickly\nAt this rate everything changed by tomorrow\nFrom W. A. M. U. and NPR this is one egg [noise]\nEither on Joshua Johnson visiting New Hampshire public radio today on one age the mid term next month's election could answer a lot of big questions how much power does the Democratic blue wave really have are these midterms a referendum on President Trump's for Republicans who align with him benefits or suffer\nMost governors right now a Republican what will the margin be after the election and how much more diverse will Congress become\nPlenty to talk about and we'd love to hear from you too so email I Won a hack W. A. M. U. dot org comments on our Facebook page or tweet us at one egg\n... from NPR News in Washington on core of a Coleman you as commander in Afghanistan has escaped on heard from a shooting incident that wounded to Americans and killed a prominent Afghan police chief Jennifer glass reports from CONMEBOL\nShooting occurred as the commander of us and NATO forces general Scott Miller was finishing a meeting with senior Afghan officials in Kandahar southern Afghanistan about security and upcoming parliamentary elections NATO says Miller was not injured the Taliban have claimed responsibility for the attack that killed powerful prevention\nAbout security and upcoming parliamentary elections NATO says Miller was not injured the Taliban have claimed responsibility for the attack that killed powerful provincial police chief Abdul Raziq he was seen as crucial to the security of Kandahar the birthplace of the Taliban with a group continue to have a presence\nRhetoric was also criticized for alleged torture and running and legal prisons but his death could leave a security vacuum in Kandahar to get further undermine long delayed parliamentary elections on Saturday for NPR News I'm Jennifer glass in Kabul\nThere's word now from Afghanistan that the provincial intelligence chief was also killed in that shooting and the provincial governor has been wounded\nTurkish and Saudi Arabian investigators have finished searching Saudi properties in Istanbul where Saudi journalist ... went missing\nTurkey says it has evidence the Saudi Government killed him Saudi officials vehemently denied us the Washington Post has chosen to publish ... most recent column his editor Karen ... told NPR's MORNING EDITION the paper felt the column was time like\nWe just decided that now is the week at the time to do it I I think also has the story is moving to a more geo political story a story about us Saudi relations\nUm goal for relations I think we just decided that it was good to bring the started back I'm teaching them all a huge amount was ... and his ideas\nWashington Post editor carrying a T a power is returning to more communities in the Florida Panhandle devastated by hurricane Michael NPR Zazi low long reports a few school districts are set to reopen for classes next week\nSchool districts are preparing for students to return early next weekend Holmes county in Franklin County which sits along Florida's northern coast classes are still cancelled in most parts of Florida's panhandle ravaged by hurricane Michael\nIt's not clear windows schools will reopen for students some school buildings are sheltering hundreds of families across the region as a cleanup continues after the storm\nState officials are now sending up at Base Camp in Tallahassee to provide long term housing for the utility workers and first responders working around the panhandle were more than a week after the hurricane many do not have electricity or cell phone service dogs you along NPR News Panama City Florida\nThe death toll from hurricane Michael is now up to twenty nine people many people in the Florida Panhandle are still unaccounted for on Wall street the Dow Jones industrial average is down one hundred and fifty five points the NASDAQ is down\nMany people in the Florida Panhandle are still unaccounted for on Wall street the Dow Jones industrial average is down one hundred and fifty five points the NASDAQ is damn sixty two points you're listening to NPR why from\nThe GPS newsroom good morning I'm drew Dawson just ahead on one a a look ahead to the mid term elections but first and she'd be big news in person early voting for the ... election is underway but many more Georgians are also choosing to vote by absentee ballot GB ... Fowler reports\nIn Georgia you don't need a reason to request an absentee ballot you just have to apply with your county by November second that's what nearly three hundred and fifty thousand Jordan's have done so far for this election once you make your selections you have to follow instructions on her return envelope and sign an oath with things like your name address in the year you were born\nOtherwise your ballot could be rejected\nElection day is November six ... be News I'm Stephen Fowler in Atlanta\nHundreds of Georgians who cast absentee ballots have had them rejected because of problems with signatures an issue that will be challenged in federal court next week a hearing has been scheduled to address a lawsuit that challenges Georgia's absentee ballot signature matching law\nThe ACLU of Georgia is behind the suit claiming that the ballots have been unfairly rejected because of alleged signature mismatch is within the paperwork\nThe group wants elected officials to give voters the chance to confirmed their identities and resolve the issue of November's election the federal hearing scheduled to take place Tuesday Afternoon in Atlanta\nAnd education news Georgia students who took the a C team this year are out performing their peers across the country according to the AJC this is the third year in a row that Georgia students have beaten the national average from Georgia News Go to G. P. B. news dot org and follow us on Facebook and on Twitter\nSupport for NPR comes from NPR stations other contributors include Hitchcock's insurance providing customize insurance for small and medium businesses so they can do more and be more learn more at age I. S. C. O. X. dot com or from an agent Hitchcock's insurance encouraged courage\nIt'd be whether it partly sunny and in the mid seventies across the state today to not look for partly cloudy skies with Lowes ranging from the mid forties in the northern mountains below Seventy south and a woman goes friday we'll be partly sunny with high temperatures ranging from the upper sixties north to the low eighties when the southern tier [noise]\nNorthern mountains below Seventy south and a woman goes ... will be partly sunny with high temperatures ranging from the upper sixties north to below eighties when the southern tier [noise]\n[noise]\n\nThis is one a I'm Joshua Johnson visiting New Hampshire public radio in Concord this is a part of the show where we try to put our conversation for the hour into some context to boil down what will be discussing into one big thing\nBut frankly today what's the point\nWe're just under three weeks away from the midterms and it feels some times like this election is about everything all the time all at once\nWhether the nation support to repudiate President Trump whether the me too movement has affected our politics the future of health care immigration policy our economy national security diversity is Brett Kavanaugh\nIt's an election about everything that makes us in America right now and in states like New Hampshire those national debates blend with local concerns to make for some pretty interesting politics so\nToday's show is about everything sorry to dumped so much in your lap but such is life\nWill deal with pieces of those big issues this hour but maybe you can help us focus what's on your mind right now with the midterms email is one at a at W. A. M. U. dot org comments on our Facebook page where you can watch video stream courtesy of an each PR or tweet us at one egg\nJoining us from our home base in Washington is one of summer and national politics reporter with the Associated Press one and we'll come back to the program thanks for having me also with us NPR lead political editor Domenico Montanaro Dominican welcome hey there\nKatie Sanders is the managing editor for the nonprofit fact checking website politifact she joins us from the Poynter Institute a professional school for journalists in St Petersburg Florida Katie welcome to want to\nThank you for having me and here with me a New Hampshire public radio in Concord is Casey McDermott who covers politics and policy Casey thanks for making time for thanks for having me let's start with New Hampshire's congressional races the state has two districts but both of those races are pretty interesting right now give us a sense of who's running\nStart though at the congressional districts kind of split the state and half on one side we have the first district which cover kind of the eastern part of the state and not race we had eight\nSo uh this congressional districts kind of split the state and half on one side we have the first district which covers kind of the eastern part of the state\nAnd not race we have a contest between Chris Pappas the Democrat and Eddie Edwards the Republican\nI'm both of them fairly young and I think fairly mild mannered you know people have described them as two of the really nice guys in their respective political parties very non controversial or they disagree but often respectfully on a number of issues I'm On the other side of the state we had\nOn GPA and start\nSupport for ... comes from generous listeners like you and the savannah food and wine festival November fifth through another a legendary week of food and drink for murder street and throughout the historic district celebrity chefs wind experts and more savannah food and wine festival dot com\nAnd the Miller theater and Bob no check presents featuring the iconic actor singer songwriter Chris christopherson\nNovember twelfth at Augusta Miller theater tickets on sale now at the Miller box office and Miller theater Augusta dot com [noise]\nYou know showing your car to be a hassle but Joan ... is a whole different story but I was taking off your hands for off your driveway and turn it into public radio and maybe even ... all those marketplaces up here is how to do\nEight seven seven GP be one car or donate securely on line a G. P. D. dot org slash cars and thanks [noise]\n\nSupport for NPR comes from the station and from progressive insurance offering its home quote explore so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learn more it progressive dot com\nAnd from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's work in food health power jobs and resilient city at rock found dot org\nIs is one day I'm Joshua Johnson we're discussing the upcoming upcoming midterm elections with NPR's do medical ... he's one of ... and ... of ...\nThis is one a I'm Joshua Johnson we're discussing the upcoming upcoming midterm elections with NPR's Domenico Montanaro the eighties Juana Summers and Katie Sanders of politifact\nWe'd love to hear from you if there's a particular race or an election that's coming up where you live in the midterms that you're watching very closely we'd love to know what's on your mind about that race or if you just have some questions about what's going on with the midterms overall nationally right now now is a good time to share those comments on our Facebook page where you can also watch video stream of today's program\nTweet us ... when a or email one a act W. A. M. U. dot for\nTheir medical I Wonder if we could pick up with that last question I asked\nCasey Kendra tweeted what I Would like to see is all of the Democrats and Republicans voted out of Congress they are so polarized we need to start over\nHow much do you get a sense that the pure polarization of today's politics is just changing the way voters approached this year's midterms I mean you know Nancy Pelosi's named still comes up quite a bit on the campaign trail she's a of an obvious kind of a hot button for many Republican voters but\nIt is that working in terms of making people show up or is it just turning people off\nYou know a lot of people might be an are frustrated with politics and the country but we're seeing the opposite effect of it not keeping people home or or voting for some third party coalition in fact it's people strapping on the T shirts\nAnd going as hard as they can I Do in their political corners I mean the fact is Mitt turns are usually about activist they're usually about the hardest core a people within the party but in fact\nWe're seeing the potential for a surge this year in turnout I spoke to Michael McDonald who's a professor at the University of Florida who is really\nOne of the preeminent turnout experts in the country you maintain that turnout database he expect there to be a turnout of about forty five fifty percent of eligible voters this year that doesn't sound like a lot but it would be the highest level for a mid term since the mid Nineteen sixties\nAnd that is really spurred on by all of this high interest for seeing high turnout in primaries in in special elections\nAnd you know frankly you've seen Democrats really fired up to vote against this president and we've seen that according to a Pew sixty percent of people say the president is a factor in their vote and that's higher than it's ever been\nI Wonder one summers what your take is on that in terms of the potential playbook for Democrats first of all let's just said a little context is focused on the house for example\nI Wonder one summers what your take is on that in terms of the the potential playbook for Democrats first of all let's just settled context is focused on the house for example how many seats with the Democrats need to flip the house\nShirts that Democrats would need twenty three seats to take control of the house of representatives and right now most public pull in when we look across the landscape suggests that they're doing that they're making good efforts and things are looking good for them right now one thing that I've noticed as I've been talking to\nFolks who work on the Democratic side of the aisle who are professional political folks is they're spending a lot of money to make sure that their voter turnout and particularly looking at the types of voters infrequent voters who say\nMay show up in a presidential election year but are more likely to stay home\nAnd I'm an off year or a midterm year and there's a reason for that typically when we look at the electorate that shows up for mid term elections it's typically older whiter and more Republicans ... Democrats spending a lot of money and a lot of time on the ground trying to turn out younger voters those millennials voters of color or Latino African Americans and Asians\nWho are more likely to vote for Democrats are also more likely to stay home and ...\nIs there a certain benchmark water for what Democrats would consider for lack of a better word a blowout slide you use the goal just to get above ... percent plus one or is there a larger like a stretch gold at the Democratic party is aiming for\nWhat I'm hearing from most people including Ben ray Lujan congressmen who chairs the Democratic democratic congressional campaign committee is they don't think this is going to be a blowout year they feel confident and their chances of taking back the house\nOf turning the house ... but I don't think most people most members of Congress were involved in this would say that there's going to be a huge blue wave crashing over a pickup up some tendency if there had been like that they're focused on delivering that\nTwenty three out turning be the hospital and the message I keep hearing from them as they want to do that is it a balance of power right now Republicans control every branch of government and they want to restore balance of power to this administration\nYou know this idea of a blue wave was the focus of an email from Marty who wrote I'm all about the blue wave but I'm afraid that between voter disenfranchisement lingering gerrymandering and possible foreign interference we're about to be pumped again\nDominican let me ask you about some of the polling water some of the main trends in national polls right now in terms of how the Democrats and Republicans might do\nWell when we look at our NPR PBS NewsHour embarrassed polling Democrats have had an advantage on what's known as the congressional ballot who would you prefer to be\nOur NPR PBS NewsHour Marist polling Democrats have had an advantage on what's known as the congressional ballot who would you prefer to be a to run Congress ... the Democrat in your district or the Republican the ... in your district\nYou know we've had an advantage for Democrats anywhere from seven to twelve points over from the summer until now\nOr other polling other public bowling a showing it to be double digits that's about the range that Democrats feel like they would be able to take the at least those twenty three seats in the house and I look at some other factors to just look at the landscape and the playing field and when I gained out or how many seats would be up for grabs this year\nI found that there are ... seats that were a competitive to potentially competitive despite all the talk of cabinet or you know that confirmation battle in ... Republicans and it certainly did\nOnly six of those seats are democratic held seats Seventy four seats are of the potentially competitive to competitive landscape are held by Republicans no matter what you look at that and you know if the Democrats wouldn't half of those that the house\n[laughter] glad to hear from some of you with regards to your concerns about the midterms including about the nature of polling in general are doing that go I Love you to respond to this comment from a listener who left a note in our inbox\nI'm Alan from Ashville North Carolina and I'm frustrated with directions with not having enough holes in down ballot races even even U.S House by state house and stuff because if it's a close election I Want to vote Democrat\nAt least at the federal and state level but it it's a good weekend that I Want to vote a third party greener libertarian\nOr write my own it so I Need to know with a razor close or not if it's a if it's a shoe it if my vote might be the deciding vote and I need a all I Need some polls to ah to divide and it it actually changes my boat the oil change my vote\nEllen thanks for your comment Dominican that cracks me up or if he wants to run for office he should run for office if he wants to a vote third party because that's his conscience than he should do so\nI get a pragmatic approach though and I think a lot of\nYou know establishment Democrats would argue that they wish there were a lot more voters like him who voted in Wisconsin Michigan and Pennsylvania for the Democrat instead of voting for the third party candidate now when it comes to polls look there is a huge problem in this\nThe concept in Michigan and Pennsylvania for the Democrat instead of voting for the third party candidate now when it comes to polls look\nThere is a huge problem in this country when it comes to a polling generally and then when you go and drill down into the state level or district level or state house level my goodness\nThe response rate that people are getting from polling is lower and lower and lower every year in other words you make a phone call\nDoes somebody wish to participate in that that just continues to decrease it takes a lot of money to conduct a good pole and to get a sizable enough sample that the results are representative and it's really tough and I would just say go based on the issues and vote your conscience\nYeah quite a lot of you express real concern with the very nature of polling Peter wrote on our Facebook page please discuss the obsession the media NPR included has with a horse race method of election coverage is an irresponsible journalism to report on polls one such reporting could affect turnout our elections are not sporting events\nThose survivors should filed claims with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six to\nIf you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty for\nA full list of all survivor resources is available online\nAt G. E. N. A. dot G. A. dot Gov [noise]\nMaking a taco party coming up with an excellent point sure we're going to get on to the most\nThings have to go right\nRyan Gosling stars first manned the movie that put the Apollo eleven moon landing on the big screen but what was Neil Armstrong the man who took that giant leap really like that's coming up for the next on point from NPR\nThis morning at eleven here on the TV and\nBut what was Neil Armstrong the man who took that giant leap really like that's coming up with an excellent point from NPR this morning and eleven here on the TV and she removes dot org\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first learn more at Raymond James dot com\nAnd from the science Sims foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size Sims foundation dot org\n\nBack now to our conversation with one of summers of the Associated Press Katie Sanders of politifact and NPR's the medical months and are all still time to get in some of your questions and thoughts about the mid term elections email us one a X. W. A. M. U. dot org\nTweet us at one eighty or comments on our Facebook page where you can also watch or video stream of our lovely environs here at New Hampshire public radio also you can go check out some more of their excellent coverage at an H. P. R. dot org including of some of the things that make New Hampshire unique\nThere is a story about a giant pumpkin boat race engulfed town\nI didn't know pumpkins were that point but I Will after the show I Want to check it out and H. P. R. dot org let's get to some of your comments about the midterms Laurie emailed I Am a lifelong Democrat and I can tell you what frustrates me and has for years\nThe complete inability of the dams to get a message and stick to it I've gone to my local Democratic Party website in the front page does not see what they are for does not told me what they care about one summers you've been following the Democrats in the run up\nTo the mid terms how common is Laurie complaint and how well are Democrats doing an answering it\nI think what Laurie is pointing to is actually really comment and I think Democrats are trying to figure out how it affects that and number of the conversations I had I have recently wrote an article that looks at how Democrats are trying to make sure they have record med turn turn out\nAnd they said that when they're talking to voters that are sending out mailers are going and knocking the people's doors in these battleground states and districts are trying to make sure\nThat they're telling their voters that they have a message that they are running on rather than just having these conversations that are about just running against President Trump base it on I was talking to some groups that dead centerfield testing recently among Latino voters and they said ... and when they get the scale testing\nIt's running against President Trump's base it on I was talking to some groups that dead center field testing recently among Latino voters and they send them and when they get this field testing and they were saying people were turned out they said if they got ... mailer from their local democratic candidate had President Trump space on it\nMay be super turned off right they throw that away they wouldn't even engage or see who the candidate was so I think they're really trying to tweak that match you can talk about what they can do for them what's at stake that that's\nThat's why you hear Democrats nationally talking about how this is the most important election of our lifetimes why you hear that healthcare message I think has Dominican noted being such a huge share of the advertising that you're seeing from pro democratic groups it's because they do realize that they need a message for their voters to coalesce around otherwise they're not going to turn out\nTo medical I Wonder if we can follow up on that theme was one more voice mail from a listener on the east coast here's what judge John left in our inbox\nShould try and raise sure to New York\nSo often on the shows\nPeople face the Republicans for Democrats or Republicans the Democrats the Republicans should instead of doing that they should be focusing on specific policies\nFamily the Democrats that stand for such and such the Republicans to stand for such and such helped educate listeners because you don't gain anything by just growing Democrats Republicans Democrats Republicans\nJohn thanks very much for calling and sharing your thoughts with us no medical for me I don't know how you hear this but for me as a journalist I feel uncomfortable saying the Democrats who stand for X. I feel more comfortable saying the Democrats\nWho say they stand for tax or the Democrats who have done ... to me journalistically that's more reliable but I Do take John's\nPoint that it just feels a little bit too broad\nYeah I mean we have to always be aware of trying to get into some of the issues and where are the party stand on these things and what they've been pushing I think that that's been part of\nThe pushback and why you've seen so much interest from Democrats obviously in this election because they've seen so much of what\nPresident Obama did on regulations that were put in place that have been rolled back for example a by the environmental protection agency a and a whole host of other things including an immigration policy\nThat Democrats are firmly against and it's also what you saw a as a rise of the Tea Party in twenty ten where they didn't trust a lot of their government officials including ...\nIt's also what you saw a as a rise of the Tea Party in twenty ten where they didn't trust a lot of their government officials including a lot of Republicans in how they essentially took over the Republican Party\nWith that message of uh taxed enough already and being really in opposition to a President Obama's health care act so the party saying for a very very different things and we're seeing that play out and going to come to a head and in this in this mentor\nKatie I Wonder if you can respond to a listener who left a note on our website the one eight dot org listener writes with the upcoming midterm elections and Michelle Obama's advised to go high when opponents go low what is the effectiveness of negative campaigns are the negative campaign ads coming from a particular party or group Katie\nThink everyone's guilty and I don't think any party has a\nHas Israeli going going high all the time right and I think that's because it's affective and that really sticks with people as much as people like to say that they dislike negative advertising and I think actually do a memorable\nAnd it certainly a bill that impression that people are going to remember and that's why we see so much of it and that's why we have jobs here ... years [laughter] that's funny to do\nYou you will never be unemployed not ever\nAnd medical research on some of the diversity of the candidates this time around quite a few record numbers of women running a record numbers of algae beauty of out L G T cue candidates running some of whom spoke to Ari Shapiro on all things considered earlier\nGive us a sense of what that means for the midterms and whether many of these candidates are considered to send a strong chance of winning well look you're correct\nThat there are a lot of people um who are\nA ... of diverse backgrounds I mean women are the biggest bloc of this that are really driving the midterms you think a lot of Native American candidates or you know just in New Hampshire there Chris Pappas who is\nA an openly gay man or he would be the first gay representative from the state of New Hampshire if he wins in a new in the first congressional district there in New Hampshire the Democrat now but\nWhen again and we look at the power of the midterms women they have been fired up since the day President Trump\nWas elected when we're talking about when and where I Am a democratic women there have been two hundred and thirty five women\nWho have been nominated for ah for Congress for their party's nomination a hundred and eighty three of those a hundred and eighty three has been democratic women just if you were to take the number of democratic women who are running a that would be bigger than the record\nHundred and eighty three have been democratic women just if you were to take the number of democratic women who are running aren't that would be bigger than the record previously of all women combined do or nominees and that was a hundred and sixty seven\nSo because I'm Sorry you just just to clarify the numbers are basically saying that three out of four women in this in this go round a democratic woman who'd been nominated\nAbsolutely that's absolutely right it was a wave of democratic women the year of the woman quote unquote round to ah after Nineteen Ninety two after the Clarence Thomas Anita Hill areas have been driven by democratic women and we've seen them be very fired up in poll after poll\nAnd you know they're going to lead the march to the polls for Democrats and if they win the house it's going to be largely because of women\nWanted there are some races where you know women are making a very historic a historic showing I mean the Arizona Senate races going on right now between ... and send them at the Democrat and more with Sally the Republican you know Arizona is going to have\nA female senator in that seat I Wonder how much you see this as a bipartisan trend we heard the numbers from Dominican oh but do we get the sense\nThat both parties both major parties are trying to be part of this trend trying to embrace this trend\n... so I think that the energy and when we talk about female candidates certainly more on the side of Democrats than Republicans I think that's frustrated and number of Republican women I spoke to two women who founded the group Republican women for progress recently and they told me that they were really concerned that their party doesn't have an apparatus to cultivate\nYoung promising Republican conservative women\nFrom the local those local level seats all the way out so nothing that really reflects say what you see on the left on the Democratic side from emily's list a group that cultivate and backs\nA pro abortion rights when female candidates so there there is some concern certainly among Republicans and my colleagues that he actually asked", "show_name": "1A Plus", "year": "2018", "city": "Chatsworth", "day": "18"}